{"title": "Online verification of automated road vehicles using reachability analysis\n", "abstract": " An approach for formally verifying the safety of automated vehicles is proposed. Due to the uniqueness of each traffic situation, we verify safety online, i.e., during the operation of the vehicle. The verification is performed by predicting the set of all possible occupancies of the automated vehicle and other traffic participants on the road. In order to capture all possible future scenarios, we apply reachability analysis to consider all possible behaviors of mathematical models considering uncertain inputs (e.g., sensor noise, disturbances) and partially unknown initial states. Safety is guaranteed with respect to the modeled uncertainties and behaviors if the occupancy of the automated vehicle does not intersect that of other traffic participants for all times. The applicability of the approach is demonstrated by test drives with an automated vehicle at the Robotics Institute at Carnegie Mellon University.", "num_citations": "307\n", "authors": ["1806"]}
{"title": "Model-based probabilistic collision detection in autonomous driving\n", "abstract": " The safety of the planned paths of autonomous cars with respect to the movement of other traffic participants is considered. Therefore, the stochastic occupancy of the road by other vehicles is predicted. The prediction considers uncertainties originating from the measurements and the possible behaviors of other traffic participants. In addition, the interaction of traffic participants, as well as the limitation of driving maneuvers due to the road geometry, is considered. The result of the presented approach is the probability of a crash for a specific trajectory of the autonomous car. The presented approach is efficient as most of the intensive computations are performed offline, which results in a lean online algorithm for real-time application.", "num_citations": "292\n", "authors": ["1806"]}
{"title": "An introduction to CORA 2015\n", "abstract": " The philosophy, architecture, and capabilities of the COntinuous Reachability Analyzer (CORA) are presented. CORA is a toolbox that integrates various vector and matrix set representations and operations on them as well as reachability algorithms of various dynamic system classes. The software is designed such that set representations can be exchanged without having to modify the code for reachability analysis. CORA has a modular design, making it possible to use the capabilities of the various set representations for other purposes besides reachability analysis. The toolbox is designed using the object oriented paradigm, such that users can safely use methods without concerning themselves with detailed information hidden inside the object. Since the toolbox is written in MATLAB, the installation and use is platform independent.", "num_citations": "275\n", "authors": ["1806"]}
{"title": "Reachability analysis of nonlinear systems with uncertain parameters using conservative linearization\n", "abstract": " Given an initial set of a nonlinear system with uncertain parameters and inputs, the set of states that can possibly be reached is computed. The approach is based on local linearizations of the nonlinear system, while linearization errors are considered by Lagrange remainders. These errors are added as uncertain inputs, such that the reachable set of the locally linearized system encloses the one of the original system. The linearization error is controlled by splitting of reachable sets. Reachable sets are represented by zonotopes, allowing an efficient computation in relatively high-dimensional space.", "num_citations": "274\n", "authors": ["1806"]}
{"title": "Reachability analysis and its application to the safety assessment of autonomous cars\n", "abstract": " One of the biggest boosts for innovation in engineering has been the ongoing improvement of digital processor technology. Connections between physical systems and computing elements are becoming more and more intense in many areas, such as transportation, energy, healthcare, manufacturing, chemical processes, and consumer appliances, to name only a few. Systems with strong interconnected physical and computing elements are referred to as embedded systems, mechatronic systems, or cyber-physical systems. The latter expression has recently become more popular when the interconnection between the computational and physical elements is strong.Besides an improvement in eg the efficiency or functionality, cyber-physical systems provide a better reliability and safety compared to conventional solutions. Examples are driving assistant systems in passenger cars or search and rescue robots. The drawback of cyber-physical systems is that they are complex and thus difficult to analyze. This contradicts the objective of improving the safety of such systems, since the correct operation of these systems has to be ensured first. In order to cope with the growing complexity, one has to design improved analysis tools to better understand the behavior of a system or even verify its safety. In short, the demand for automatic verification tools that can analyze complex systems is constantly increasing.", "num_citations": "262\n", "authors": ["1806"]}
{"title": "Computing reachable sets of hybrid systems using a combination of zonotopes and polytopes\n", "abstract": " The computation of reachable sets for hybrid systems with linear continuous dynamics is addressed. Zonotopes are used for the representation of reachable sets, resulting in an algorithm with low computational complexity with respect to the dimension of the considered system. However, zonotopes have drawbacks when being intersected with transition guards which determine the discrete behavior of the hybrid system. For this reason, in the proposed approach, reachable sets are represented by polytopes within guard sets as an intermediate step in order to enclose them by zonotopes afterwards. Different methods for the conservative conversion from zonotopes to polytopes and vice versa are proposed and numerically evaluated.", "num_citations": "162\n", "authors": ["1806"]}
{"title": "CommonRoad: Composable benchmarks for motion planning on roads\n", "abstract": " Numerical experiments for motion planning of road vehicles require numerous components: vehicle dynamics, a road network, static obstacles, dynamic obstacles and their movement over time, goal regions, a cost function, etc. Providing a description of the numerical experiment precise enough to reproduce it might require several pages of information. Thus, only key aspects are typically described in scientific publications, making it impossible to reproduce results - yet, re-producibility is an important asset of good science. Composable benchmarks for motion planning on roads (CommonRoad) are proposed so that numerical experiments are fully defined by a unique ID; all information required to reconstruct the experiment can be found on the CommonRoad website. Each benchmark is composed by a vehicle model, a cost function, and a scenario (including goals and constraints). The scenarios are partly …", "num_citations": "156\n", "authors": ["1806"]}
{"title": "Reachability analysis of nonlinear systems using conservative polynomialization and non-convex sets\n", "abstract": " A new technique for computing the reachable set of hybrid systems with nonlinear continuous dynamics is presented. Previous work showed that abstracting the nonlinear continuous dynamics to linear differential inclusions results in a scalable approach for reachability analysis. However, when the abstraction becomes inaccurate, linearization techniques require splitting of reachable sets, resulting in an exponential growth of required linearizations. In this work, the nonlinearity of the dynamics is more accurately abstracted to polynomial difference inclusions. As a consequence, it is no longer guaranteed that reachable sets of consecutive time steps are mapped to convex sets as typically used in previous works. Thus, a non-convex set representation is developed in order to better capture the nonlinear dynamics, requiring no or much less splitting. The new approach has polynomial complexity with respect to the …", "num_citations": "122\n", "authors": ["1806"]}
{"title": "Comparison of Markov chain abstraction and Monte Carlo simulation for the safety assessment of autonomous cars\n", "abstract": " The probabilistic prediction of road traffic scenarios is addressed. One result is a probabilistic occupancy of traffic participants, and the other result is the collision risk for autonomous vehicles when executing a planned maneuver. The probabilistic occupancy of surrounding traffic participants helps to plan the maneuver of an autonomous vehicle, whereas the computed collision risk helps to decide if a planned maneuver should be executed. Two methods for the probabilistic prediction are presented and compared: 1) Markov chain abstraction and 2) Monte Carlo simulation. The performance of both methods is evaluated with respect to the prediction of the probabilistic occupancy and the collision risk. For each comparison test, we use the same models that generate the probabilistic behavior of traffic participants, where the generation of these data is not compared with real-world data. However, the results …", "num_citations": "117\n", "authors": ["1806"]}
{"title": "Reachability analysis of linear systems with uncertain parameters and inputs\n", "abstract": " For a dynamic system with given initial state set, the reachable state set contains the states along all possible trajectories defined over (in-)flnite time. This paper presents a method for computing conservative approximations of reachable sets for linear systems with uncertain system matrices and bounded inputs. Over- and under-approximations are computed for exponentials of system matrices with entries specified as bounded intervals. It is shown that reachable sets represented by sequences of zonotopes can be computed up to a dimension of 100 within a few seconds.", "num_citations": "101\n", "authors": ["1806"]}
{"title": "Safety verification of autonomous vehicles for coordinated evasive maneuvers\n", "abstract": " The verification of evasive maneuvers for autonomous vehicles driving with constant velocity is considered. Modeling uncertainties, uncertain measurements, and disturbances can cause substantial deviations from an initially planned evasive maneuver. From this follows that the maneuver, which is safe under perfect conditions, might become unsafe. In this work, the possible set of deviations is computed with methods from reachability analysis, which allows to verify evasive maneuvers under consideration of the mentioned uncertainties. Since the presented approach has a short response time, it can be applied for real time safety decisions. The methods are presented for a numerical example where two autonomous cars plan a coordinated evasive maneuver in order to prevent a collision with a wrong-way driver.", "num_citations": "80\n", "authors": ["1806"]}
{"title": "High-level decision making for safe and reasonable autonomous lane changing using reinforcement learning\n", "abstract": " Machine learning techniques have been shown to outperform many rule-based systems for the decision-making of autonomous vehicles. However, applying machine learning is challenging due to the possibility of executing unsafe actions and slow learning rates. We address these issues by presenting a reinforcement learning-based approach, which is combined with formal safety verification to ensure that only safe actions are chosen at any time. We let a deep reinforcement learning (RL) agent learn to drive as close as possible to a desired velocity by executing reasonable lane changes on simulated highways with an arbitrary number of lanes. By making use of a minimal state representation, consisting of only 13 continuous features, and a Deep Q-Network (DQN), we are able to achieve fast learning rates. Our RL agent is able to learn the desired task without causing collisions and outperforms a complex, rule …", "num_citations": "75\n", "authors": ["1806"]}
{"title": "Set-based prediction of traffic participants on arbitrary road networks\n", "abstract": " Safety is of paramount importance in automated driving. One of the main challenges ensuring safety is the unknown future behavior of surrounding traffic participants. Previous works ignore this uncertainty or often address it by computing probability distributions of other traffic participants over time. Probabilistic approaches make it possible to predict the collision probability with other traffic participants, but cannot formally guarantee (i.e., cannot mathematically prove for given assumptions) whether a planned maneuver is collision-free. Our approach addresses exactly this problem: instead of computing probability distributions, we compute an over-approximation of all possible occupancies of surrounding traffic participants over time. This makes it possible to prove whether an automated vehicle can possibly collide with other traffic participants. The presented algorithm for occupancy prediction works on arbitrary road …", "num_citations": "73\n", "authors": ["1806"]}
{"title": "Formalising traffic rules for accountability of autonomous vehicles\n", "abstract": " One significant barrier in introducing autonomous driving is the liability issue of a collision; e.g. when two autonomous vehicles collide, it is unclear which vehicle should be held accountable. To solve this issue, we view traffic rules from legal texts as requirements for autonomous vehicles. If we can prove that an autonomous vehicle always satisfies these requirements during its operation, then it cannot be held responsible in a collision. We present our approach by formalising a subset of traffic rules from the Vienna Convention on Road Traffic for highway scenarios in Isabelle/HOL.", "num_citations": "71\n", "authors": ["1806"]}
{"title": "Implementation of Interval Arithmetic in CORA 2016\n", "abstract": " Interval arithmetic can be seen as one of the workhorses for formal verification approaches. The popularity of interval arithmetic stems from the fact that the possible outcomes of almost all frequently occurring mathematical expressions can be bounded. A disadvantage of interval arithmetic is that due to the negligence of dependencies of variables in expressions, results can be overly conservative. For this reason, interval arithmetic is typically used in formal verification tools when formulas are not contributing much to the accuracy of the overall approach, but do not belong to a restrictive class of expressions and are thus hard to evaluate. Although a lot of textbooks and software manuals for interval arithmetic exist, we have not found a complete and detailed description of how all standard mathematical functions are evaluated. This work changes this situation and describes concisely the evaluation of all standard mathematical functions. The described techniques are implemented as a class in CORA, a free MATLAB tool for continuous reachability analysis. Previously, CORA used the MATLAB toolbox INTLAB, but this tool is no longer freely available. Thus, our interval arithmetic class is currently the only freely available implementation of interval arithmetic that runs under current MATLAB versions. We have thoroughly tested our implementation against INTLAB and present the results.", "num_citations": "68\n", "authors": ["1806"]}
{"title": "Automatic Generation of Safety-Critical Test Scenarios for Collision Avoidance of Road Vehicles\n", "abstract": " It is apparent that one cannot rely solely on physical test drives for ensuring the correct functionality of autonomous vehicles. Since physical test drives are costly and time consuming, it is advantageous to accompany them with computer simulations. However, since most traffic scenarios are not challenging, even simulations are often too time consuming. To address this issue, we present an approach that creates automatically critical driving situations, i.e., situations with a small solution space for avoiding a collision. Our approach combines reachability analysis for determining the size of the solution space with optimization techniques to shrink it. The solution space is reduced by shifting the initial states of traffic participants, demanding an immediate and correct action of the vehicle under test. We demonstrate our approach by automatically increasing the criticality of several initially uncritical situations recorded from …", "num_citations": "67\n", "authors": ["1806"]}
{"title": "Adaptive cruise control with safety guarantees for autonomous vehicles\n", "abstract": " This paper addresses the problem of following a vehicle with varying acceleration in a comfortable and safe manner. Our architecture consists of a nominal controller (here: model predictive control) and a safety controller. Although model predictive control attempts to keep a safe distance, it cannot formally guarantee it, due to the assumptions on the behavior of the leading vehicle. We address this problem by holding a formally verified safety controller available. Our novel mechanism gradually engages the safety maneuver since most critical situations resolve quickly. The overall approach is evaluated against real traffic data. The results show good position and velocity tracking performance, while safety and comfort are guaranteed.", "num_citations": "65\n", "authors": ["1806"]}
{"title": "SPOT: A tool for set-based prediction of traffic participants\n", "abstract": " Predicting the movement of other traffic participants is an integral part in the motion planning of most automated road vehicles. While simple predictions, e.g. based on assuming constant velocity, may suffice for deciding a driving strategy, predicting the set of all possible behaviors is required to ensure safe motion plans. In this work, we propose a novel tool for the latter problem based on reachability analysis: Set-Based Prediction Of Traffic Participants (SPOT). Our tool can predict the future occupancy of other traffic participants, including all possible maneuvers (e.g. full acceleration, full braking, and arbitrary lane changes), by considering physical constraints and assuming that the traffic participants abide by the traffic rules. However, we remove assumptions for each traffic participant individually as soon as a violation of a traffic rule is detected. Removal of assumptions automatically results in larger occupancies …", "num_citations": "64\n", "authors": ["1806"]}
{"title": "Formal and compositional analysis of power systems using reachable sets\n", "abstract": " Power system stability analysis becomes more important in the presence of ever increasing variations in operating conditions. Traditionally, the operation of power systems is verified for specific operating conditions. In this work, the stability analysis is performed for a set of operating conditions using reachability analysis, which makes it possible to compute the bounds of all possible system trajectories. Thus, reachability analysis can be used to rigorously check specifications. Contrary to previous work, the presented approach does not require model simplifications when the system is described by semi-explicit, nonlinear, index-1 differential-algebraic equations. The main obstacle in reachability analysis is the scalability towards larger systems, which is addressed by investigating compositional techniques. As a result, transient stability and variable energy production can be analyzed for the IEEE 14-bus and 30-bus …", "num_citations": "61\n", "authors": ["1806"]}
{"title": "Provably safe motion of mobile robots in human environments\n", "abstract": " Mobile robots operating in a shared environment with pedestrians are required to move provably safe to avoid harming pedestrians. Current approaches like safety fields use conservative obstacle models for guaranteeing safety, which leads to degraded performance in populated environments. In this paper, we introduce an online verification approach that uses information about the current pedestrian velocities to compute possible occupancies based on a kinematic model of pedestrian motion. We demonstrate that our method reduces the need for stopping while retaining safety guarantees, and thus goals are reached between 1.4 and 3.5 times faster than the standard ROS navigation stack in the tested scenarios.", "num_citations": "56\n", "authors": ["1806"]}
{"title": "Set-based computation of vehicle behaviors for the online verification of autonomous vehicles\n", "abstract": " We compute the set of all possible behaviors of an autonomous vehicle using reachability analysis. A reachable set is the set of states a system can reach for a given set of initial states, disturbances, and sensor noise values. We consider autonomous vehicles which plan trajectories for a certain look-ahead horizon which are followed using feedback control. While a perfectly followed trajectory might not violate specified safety properties (e.g. lane departures or vehicle collisions), a violating deviation from the planned trajectory might exist. Given the mathematical model of the controlled vehicle and bounds on uncertainty, our approach detects any possible violation. In addition, the approach provides results faster than the time required to finish the planned maneuvers of the autonomous vehicle.", "num_citations": "56\n", "authors": ["1806"]}
{"title": "Probabilistic collision state checker for crowded environments\n", "abstract": " For path planning algorithms of robots it is important that the robot does not reach a state of inevitable collision. In crowded environments with many humans or robots, the set of possible inevitable collision states (ICS) is often unacceptably high, such that the robot has to stop and wait in too many situations. For this reason, the concept of ICS is extended to probabilistic collision states (PCS), which estimates the collision probability for a given state. This allows to efficiently run planning algorithms through crowded environments when accepting a certain collision probability. A further novelty is that the obstacles possibly react to the robot in order to mitigate the risk of a collision. The results show a significant difference in interaction behavior. Thus, this approach is especially suited for active and non-deterministic moving obstacles in the robot workspace.", "num_citations": "56\n", "authors": ["1806"]}
{"title": "Safety assessment of autonomous cars using verification techniques\n", "abstract": " A common requirement for autonomous cars is a safe locomotion which is evaluated by the method of hybrid verification applied online. The approach checks avoidance of static obstacles and dynamic traffic participants, which are described by imprecise data on their positions and velocities. The nonlinear dynamics of the autonomous car and other traffic participants is conservatively abstracted to Markov chains, which allows the efficient computation of their future positions probabilistically. The result is the probability of a crash for a given time horizon, showing if a given control strategy may lead to unsafe situations.", "num_citations": "56\n", "authors": ["1806"]}
{"title": "Verifying the safety of lane change maneuvers of self-driving vehicles based on formalized traffic rules\n", "abstract": " Validating the safety of self-driving vehicles requires an enormous amount of testing. By applying formal verification methods, we can prove the correctness of the vehicles' behavior, which at the same time reduces remaining risks and the need for extensive testing. However, current safety approaches do not consider liabilities of traffic participants if a collision occurs. Utilizing formalized traffic rules to verify motion plans allows this problem to be solved. We present a novel approach for verifying the safety of lane change maneuvers, using formalized traffic rules according to the Vienna Convention on Road Traffic. This allows us to provide additional guarantees that if a collision occurs, the self-driving vehicle is not responsible. Furthermore, we consider misbehavior of other traffic participants during lane changes and propose feasible solutions to avoid or mitigate a potential collision. The approach has been …", "num_citations": "53\n", "authors": ["1806"]}
{"title": "Formal verification of maneuver automata for parameterized motion primitives\n", "abstract": " An increasing amount of robotic systems is developed for safety-critical scenarios, such as automated cars operating in public road traffic or robots collaborating with humans in flexible manufacturing systems. For this reason, it is important to provide methods that formally verify the safety of robotic systems. This is challenging since robots operate in continuous action spaces in partially unknown environments so that there exists no finite set of scenarios that can be verified before deployment. Verifying the safety during the operation based on the current perception of the environment is often infeasible due to the computational demand of formal verification methods. In this work, we compute sets of behaviors for parameterized motion primitives using reachability analysis, which is used to build a maneuver automaton that connects motion primitives in a safe way. Thus, the computationally expensive task of building a …", "num_citations": "50\n", "authors": ["1806"]}
{"title": "Probabilistic mapping of dynamic obstacles using markov chains for replanning in dynamic environments\n", "abstract": " Robots acting in populated environments must be capable of safe but also time efficient navigation. Trying to completely avoid regions resulting from worst case predictions of the obstacle dynamics may leave no free space for a robot to move, especially in environments with high dynamic. This work presents an algorithm for a ldquosoftrdquo risk mapping of dynamic objects leaving the complete space free of static objects for path planning. Markov Chains are used to model the dynamics of moving persons and predict their potential future locations. These occlusion estimations are mapped into risk regions which serve to plan a path through potentially obstructed space searching for the trade-off between detour and time delay. The offline computation of the Markov Chain model keeps the computational effort low, making the approach suitable for online applications.", "num_citations": "48\n", "authors": ["1806"]}
{"title": "Design and capabilities of the Munich cognitive automobile\n", "abstract": " This paper presents the design of the cognitive automobile in Munich. The focus of the capabilities shown here is the navigation on highways and rural roads. The emphasis on higher speed requires early detection of far field objects, so a multi focal active vision with gaze control is essential. For increased robustness lidar range sensors are combined with vision using an object fusion approach. An elaborate safety concept and a verification stage ensure a safe behavior of the vehicle in all situations. A communication system enables the vehicle to perform cooperative perception and action together with similar intelligent vehicles.", "num_citations": "47\n", "authors": ["1806"]}
{"title": "Fail-safe motion planning of autonomous vehicles\n", "abstract": " Formally verified methods for motion planning are required in order to guarantee safety for autonomous vehicles. In particular, we consider trajectory generation by considering the most probable trajectory of other traffic participants. However, if the surrounding vehicles perform unexpected maneuvers, a collision might be inevitable. In this paper, a fail-safe motion planner is developed, which generates optimal trajectories, yet guarantees safety at all times. Safety is achieved by maintaining an emergency maneuver which can safely bring the host vehicle to a stop while avoiding any collision. The emergency maneuver is computed by considering for a given time horizon the occupancy prediction which encloses all possible trajectories of the other traffic participants. The performance of the approach is evaluated through simulation against real traffic data.", "num_citations": "45\n", "authors": ["1806"]}
{"title": "Reachability computation of low-order models for the safety verification of high-order road vehicle models\n", "abstract": " We present an approach to verify the planned maneuvers of an automated car. The main idea is to compute the occupancy of the automated car on the road using reachable sets, which makes it possible to check if one collides with other traffic participants, or leaves the drivable area. The specialty of the presented approach is that all possible uncertainties in the form of sensor noise, uncertain friction coefficient, and uncertain initial states, are considered. Maneuvers are periodically verified on-board to account for the variety of possible traffic situations, requiring an efficient algorithm. Thus, the underlying vehicle model has to be a compromise between accuracy and simplicity. The inexactness of the model is compensated by adding disturbance to the model such that it contains high-order model behavior. This is demonstrated by exploring the state space with rapidly-exploring random trees (RRTs) of a high-order …", "num_citations": "43\n", "authors": ["1806"]}
{"title": "Safety control of robots under computed torque control using reachable sets\n", "abstract": " A failsafe control strategy is presented for online safety certification of robot movements in a collaborative workspace with humans. This approach plans, predicts and uses formal guarantees on reachable sets of a robot arm and a human obstacle to verify the safety and feasibility of a trajectory in real time. The robots considered are serial link robots under Computed Torque schemes of control. We drastically reduce the computation time of our novel verification procedure through precomputation of non-linear terms and use of interval arithmetic, as well as representation of reachable sets by zonotopes, which scale easily to high dimensions and are easy to convert between joint space and Cartesian space. The approach is implemented in a simulation, to show that real time is computationally within reach.", "num_citations": "42\n", "authors": ["1806"]}
{"title": "Stochastic reachable sets of interacting traffic participants\n", "abstract": " Knowledge about the future development of a certain road traffic situation is indispensable for safe path planning of autonomous ground vehicles or action selection of intelligent driver assistance systems. Due to a significant uncertainty about the future behavior of traffic participants, the prediction of traffic situations should be computed in a probabilistic setting. Under consideration of the dynamics of traffic participants, their future position is computed probabilistically by Markov chains that are obtained with methods known from hybrid verification. The characteristic feature of the presented approach is that all possible behaviors of traffic participants are considered, allowing to identify any dangerous future situation. The novel contribution of this work is the explicit modeling of the interaction of traffic participants, which leads to a more accurate prediction of their positions. Results are demonstrated for different traffic …", "num_citations": "42\n", "authors": ["1806"]}
{"title": "Implementation of Taylor models in CORA 2018\n", "abstract": " Tool Presentation: Computing guaranteed bounds of function outputs when their input variables are bounded by intervals is an essential technique for many formal methods. Due to the importance of bounding function outputs, several techniques have been proposed for this problem, such as interval arithmetic, affine arithmetic, and Taylor models. While all methods provide guaranteed bounds, it is typically unknown to a formal verification tool which approach is best suitable for a given problem. For this reason, we present an implementation of the aforementioned techniques in our MATLAB tool CORA so that advantages and disadvantages of different techniques can be quickly explored without having to compile code. In this work we present the implementation of Taylor models and affine arithmetic; our interval arithmetic implementation has already been published. We evaluate the performance of our implementation using a set of benchmarks against Flow* and INTLAB. To the best of our knowledge, we have also evaluated for the first time how a combination of interval arithmetic and Taylor models performs: our results indicate that this combination is faster and more accurate than only using Taylor models.", "num_citations": "41\n", "authors": ["1806"]}
{"title": "Generating critical test scenarios for automated vehicles with evolutionary algorithms\n", "abstract": " Virtual testing of automated vehicles using simulations is essential during their development. When it comes to the testing of motion planning algorithms, one is mainly interested in challenging, critical scenarios for which it is hard to find a feasible solution. However, these situations are rare under usual traffic conditions, demanding an automatic generation of critical test scenarios. We present an approach that automatically generates critical scenarios based on a minimization of the solution space of the vehicle under test. By formulating a scenario parametrization and automatic determination of relevant parameter intervals, we are able to optimize the criticality of complex scenarios. We use evolutionary algorithms to tackle the resulting highly nonlinear optimization problem. Compared to our previous approach, we are now able to handle complex situations, in particular those involving intersections. Finally, we …", "num_citations": "40\n", "authors": ["1806"]}
{"title": "Set-based prediction of pedestrians in urban environments considering formalized traffic rules\n", "abstract": " Set-based predictions can ensure the safety of planned motions, since they provide a bounded region which includes all possible future states of nondeterministic models of other traffic participants. However, while autonomous vehicles are tested in urban environments, a set-based prediction tailored to pedestrians does not exist yet. This paper addresses this problem and presents an approach for set-based predictions of pedestrians using reachability analysis. We obtain tight over-approximations of pedestrians' reachable occupancy by incorporating the dynamics of pedestrians, contextual information, and traffic rules. In addition, since pedestrians often disregard traffic rules, our constraints automatically adapt so that such behaviors are included in the prediction. Using datasets of recorded pedestrians, we validate our proposed method and demonstrate its use for evasive maneuver planning of automated vehicles.", "num_citations": "40\n", "authors": ["1806"]}
{"title": "Computing the drivable area of autonomous road vehicles in dynamic road scenes\n", "abstract": " This paper presents an algorithm for overapproximating the drivable area of road vehicles in the presence of time-varying obstacles. The drivable area can be used to detect whether a feasible trajectory exists and in which area one can limit the search of drivable trajectories. For this purpose, we abstract the considered road vehicle by a point mass with bounded velocity and acceleration. Our algorithm calculates the reachable occupancy at discrete time steps. At each time step, the set is represented by a union of finitely many sets, which are each the Cartesian product of two 2-D convex polytopes. We demonstrate our method with three examples: i) a traffic situation with identical dynamic constraints in the x- and y-directions; ii) a highway scenario with different lateral and longitudinal constraints of the dynamics; and iii) a highway scenario with different traffic predictions. The examples demonstrate that we can …", "num_citations": "40\n", "authors": ["1806"]}
{"title": "Comparison of trajectory tracking controllers for autonomous vehicles\n", "abstract": " Controlling autonomous vehicles typically has two main components: planning a trajectory and tracking this trajectory using feedback controllers. To benefit from the recent progress in planning algorithms, it is key that the underlying tracking controller is able to follow the planned trajectory as desired. In emergency situations in particular, it is crucial that feedback controllers steer the vehicle as close as possible to the planned trajectory to remain within a safe corridor. While there exists much work on the design of trajectory and path tracking controllers for vehicles, little work has been done to systematically compare different approaches, especially when considering extreme situations, uncertain parameters, and disturbances. In this work, we compare eight tracking controllers in a systematic way, each of them representing a different controller family. By not only considering nominal behavior, but also sensor noise …", "num_citations": "39\n", "authors": ["1806"]}
{"title": "Reachset conformance testing of hybrid automata\n", "abstract": " Industrial-sized hybrid systems are typically not amenable to formal verification techniques. For this reason, a common approach is to formally verify abstractions of (parts of) the original system. However, we need to show that this abstraction conforms to the actual system implementation including its physical dynamics. In particular, verified properties of the abstract system need to transfer to the implementation. To this end, we introduce a formal conformance relation, called reachset conformance, which guarantees transference of safety properties, while being a weaker relation than the existing trace inclusion conformance. Based on this formal relation, we present a conformance testing method which allows us to tune the trade-off between accuracy and computational load. Additionally, we present a test selection algorithm that uses a coverage measure to reduce the number of test cases for conformance testing …", "num_citations": "39\n", "authors": ["1806"]}
{"title": "Computationally efficient fail-safe trajectory planning for self-driving vehicles using convex optimization\n", "abstract": " Ensuring the safety of self-driving vehicles is a challenging task, especially if other traffic participants severely deviate from the predicted behavior. One solution is to ensure that the vehicle is able to execute a collision-free evasive trajectory at any time. However, a fast method to plan these socalled fail-safe trajectories does not yet exist. Our new approach plans fail-safe trajectories in arbitrary traffic scenarios by incorporating convex optimization techniques. By integrating safety verification in the planner, we are able to generate fail-safe trajectories in real-time, which are guaranteed to be safe. At the same time, we minimize jerk to provide enhanced comfort for passengers. The proposed benefits are demonstrated in different urban and highway scenarios using the CommonRoad benchmark suite and compared to a widely-used sampling-based planner.", "num_citations": "38\n", "authors": ["1806"]}
{"title": "Safety assessment of driving behavior in multi-lane traffic for autonomous vehicles\n", "abstract": " An approach for the safety assessment of planned trajectories of autonomous vehicles is presented. Due to the unsafe nature of road traffic, the proposed safety assessment is performed in a probabilistic setting, where the probability distributions of possible future positions of traffic participants are computed based on dynamic models. The underlying algorithms have to be efficient as they need to provide a safety level of the currently planned path while the vehicle is in operation. In order to achieve the necessary efficiency of computation, the dynamics of traffic participants is abstracted into Markov-chains. The approach considers vehicle dynamics, interaction between traffic participants, and lane changes in multi-lane traffic.", "num_citations": "38\n", "authors": ["1806"]}
{"title": "Ensuring drivability of planned motions using formal methods\n", "abstract": " Motion planning of automated vehicles requires dynamical models to ensure that obtained trajectories are drivable. An often overlooked aspect is that motion planning is usually done using simplified models, which do not always sufficiently conform to the real behavior of vehicles. Thus, collision avoidance and drivability is not necessarily ensured. We address this problem by modeling vehicles as differential inclusions composed of simple dynamics and set-based uncertainty; conformance testing is used to determine the required uncertainty. To quickly provide the set of solutions for these uncertain models, we use pre-computed reachable sets (i.e., the union of all possible solutions) for pre-selected motion primitives. The reachable sets of vehicles are obtained through the novel combination of optimization techniques and reachability analysis in the controller synthesis - they enable us to guarantee safety by …", "num_citations": "37\n", "authors": ["1806"]}
{"title": "Online safety verification of trajectories for unmanned flight with offline computed robust invariant sets\n", "abstract": " We address the problem of verifying motion plans for aerial robots in uncertain and partially-known environments. Thereby, the initial state of the robot is uncertain due to errors from the state estimation and the motion is uncertain due to wind disturbances and control errors caused by sensor noise. Since the environment is perceived at runtime, the verification of partial motion plans must be performed online (i.e. during operation) to ensure safety within the planning horizon and beyond. This is achieved by efficiently generating robust control invariant sets based on so-called loiter circles, where the position of the aerial robot follows a circular pattern. Verification of aerial robots is challenging due to the nonlinearity of their dynamics, the high dimensionality of their state space, and their potentially high velocities. We use novel techniques from reachability analysis to overcome those challenges. In order to ensure that …", "num_citations": "36\n", "authors": ["1806"]}
{"title": "A formally verified checker of the safe distance traffic rules for autonomous vehicles\n", "abstract": " One barrier in introducing autonomous vehicle technology is the liability issue when these vehicles are involved in an accident. To overcome this, autonomous vehicle manufacturers should ensure that their vehicles always comply with traffic rules. This paper focusses on the safe distance traffic rule from the Vienna Convention on Road Traffic. Ensuring autonomous vehicles to comply with this safe distance rule is problematic because the Vienna Convention does not clearly define how large a safe distance is. We provide a formally proved prescriptive definition of how large this safe distance must be, and correct checkers for the compliance of this traffic rule. The prescriptive definition is obtained by: (1) identifying all possible relative positions of stopping (braking) distances; (2) selecting those positions from which a collision freedom can be deduced; and (3) reformulating these relative positions such that …", "num_citations": "34\n", "authors": ["1806"]}
{"title": "Road occupancy prediction of traffic participants\n", "abstract": " We predict the road occupancy of traffic participants for collision avoidance systems. The occupancy sets are computed for consecutive time intervals and contain all reachable positions of traffic participants in compliance with a proposed dynamic model. Those sets make it possible to check if planned emergency maneuvers are collision-free in all possible future scenarios. However, no algorithm exists for exactly computing the occupancy when the model forbids unrealistic behavior such as leaving road boundaries or largely exceeding speed limits. For this reason, we provide methods to tightly overapproximate occupancy sets to ensure safe emergency maneuvers. We demonstrate the applicability of the approach by numerical examples, which show that the occupancy computation is not only efficient, but also tight enough to trigger emergency maneuvers almost at the last possible point in time.", "num_citations": "33\n", "authors": ["1806"]}
{"title": "Verification of uncertain embedded systems by computing reachable sets based on zonotopes\n", "abstract": " Formal verification using reachability analysis has been shown to be useful for detecting design failures for controlled embedded systems, and thus to improve dependability. If the state space is hybrid, however, the growth of complexity with the dimension of the continuous dynamics limits the applicability significantly. This paper proposes an efficient approach to computing reachable sets for hybrid systems with time-varying linear continuous dynamics and uncertain inputs. The key idea is to combine zonotopes and polytopes for set representation when reachable sets are intersected with the transition guards which determine the discrete behavior of the hybrid system. Different methods for conservatively transforming zonotopes into polytopes (and vice versa) are proposed and experimentally compared.", "num_citations": "31\n", "authors": ["1806"]}
{"title": "Online verification of cognitive car decisions\n", "abstract": " Verifying a safe locomotion of cognitive cars is indispensable for their participation in road traffic. This paper suggests an approach for verifying safety by computing reachable sets for the position of relevant traffic participants, i.e. a cognitive car as well as moving objects in its environment. In order to account for the uncertainty in the behavior of traffic participants, a stochastic setting is chosen, in which Markov chains represent the positions probabilistically. An efficient online algorithm is presented that leads to the result whether the reachable sets of different traffic participants can intersect, meaning that the control strategy of the cognitive car is possibly unsafe.", "num_citations": "30\n", "authors": ["1806"]}
{"title": "Guaranteeing constraints of disturbed nonlinear systems using set-based optimal control in generator space\n", "abstract": " We address the problem of finding an optimal solution for a nonlinear system for a set of initial states rather than just for a single initial state. In addition, we consider state and input constraints as well as a set of possible disturbances. While previous optimal control techniques typically ignore the fact that the current state of a system is not exactly known, future safety-critical systems demand that all uncertainties including the initial state are considered; this is required for e.g. automated vehicles, surgical robots, or human-robot interaction. We present a new method that obtains optimal control inputs by finding optimal weights for generators that span the space reachable by the considered system. This solution routine can be used not only for a single initial state but also for a set of initial states - this is not possible using classical optimization techniques. We ensure that all constraints are met by using reachability …", "num_citations": "29\n", "authors": ["1806"]}
{"title": "Optimal control of sets of solutions to formally guarantee constraints of disturbed linear systems\n", "abstract": " Optimal control finds an optimal input trajectory which steers an initial state to a desired final state while satisfying given state and input constraints. However, most efficient approaches are restricted to a single initial state. In this paper, we present a new approach, which combines reachability analysis with optimal control. This enables us to solve the optimal control problem for a whole set of initial states by optimizing over the set of all possible solutions. At the same time, we are able to provide formal guarantees for the satisfaction of state and input constraints. Taking the effects of sets of disturbances into account ensures that the resulting controller is robust against them, which is a big advantage over many existing approaches. We show the applicability of our approach with a vehicle-platoon example.", "num_citations": "29\n", "authors": ["1806"]}
{"title": "Convex interpolation control with formal guarantees for disturbed and constrained nonlinear systems\n", "abstract": " A new control method for nonlinear systems is presented which solves reach-avoid problems by interpolating optimal solutions using convex combinations. It also provides formal guarantees for constraint satisfaction and safety. Reach-avoid problems are important control tasks, which arise in many modern cyber-physical systems, including autonomous driving and robotic path planning. We obtain our control policy by computing the optimal input trajectories for finitely many extreme states only and combining them using convex combinations for all states in a continuous set. Our approach has very low online computation complexity, making it applicable for fast dynamical systems. Iterating through our approach leads to a new form of feedback control with formal guarantees in the presence of disturbances. We demonstrate the new control method for a control problem in automated driving and show the advantages …", "num_citations": "29\n", "authors": ["1806"]}
{"title": "Sparse polynomial zonotopes: A novel set representation for reachability analysis\n", "abstract": " We introduce sparse polynomial zonotopes, a new set representation for formal verification of hybrid systems. Sparse polynomial zonotopes can represent non-convex sets and are generalizations of zonotopes, polytopes, and Taylor models. Operations like Minkowski sum, quadratic mapping, and reduction of the representation size can be computed with polynomial complexity w.r.t. the dimension of the system. In particular, for reachability analysis of nonlinear systems, the wrapping effect is substantially reduced using sparse polynomial zonotopes, as demonstrated by numerical examples. In addition, we can significantly reduce the computation time compared to zonotopes when dealing with nonlinear dynamics.", "num_citations": "28\n", "authors": ["1806"]}
{"title": "Computationally efficient safety falsification of adaptive cruise control systems\n", "abstract": " Falsification aims to disprove the safety of systems by providing counter-examples that lead to a violation of safety properties. In this work, we present two novel falsification methods to reveal safety flaws in adaptive cruise control (ACC) systems of automated vehicles. Our methods use rapidly-exploring random trees to generate motions for a leading vehicle such that the ACC under test causes a rear-end collision. By considering unsafe states and searching backward in time, we are able to drastically improve computation times and falsify even sophisticated ACC systems. The obtained collision scenarios reveal safety flaws of the ACC under test and can be directly used to improve the system's design. We demonstrate the benefits of our methods by successfully falsifying the safety of state-of-the-art ACC systems and comparing the results to that of existing approaches.", "num_citations": "28\n", "authors": ["1806"]}
{"title": "CORA 2016 manual\n", "abstract": " The philosophy, architecture, and capabilities of the COntinuous Reachability Analyzer (CORA) are presented. CORA is a toolbox that integrates various vector and matrix set representations and operations on them as well as reachability algorithms of various dynamic system classes. The software is designed such that set representations can be exchanged without having to modify the code for reachability analysis. CORA has a modular design, making it possible to use the capabilities of the various set representations for other purposes besides reachability analysis. The toolbox is designed using the object oriented paradigm, such that users can safely use methods without concerning themselves with detailed information hidden inside the object. Since the toolbox is written in MATLAB, the installation and use is platform independent.", "num_citations": "28\n", "authors": ["1806"]}
{"title": "Automatic centralized controller design for modular and reconfigurable robot manipulators\n", "abstract": " We address the problem of controlling modular robot manipulators. The challenge of modular-robot control is that the overall system dynamics are unknown due to its flexible composition from given modules. Most previous work has faced this problem by designing decentralized controllers. Simple decentralized controllers do not guarantee global asymptotic stability without knowledge of the overall system dynamics and alternative versions involving communication with neighboring modules result in complicated control concepts. Our approach is completely different: we store parameters regarding the dynamics and kinematics of each module and a unique identification number in itself. After finishing the assembly of the modules, the parameters are gathered in a central controller, which also detects the configuration using the identification numbers. Our centralized controller uses this information to synthesize …", "num_citations": "28\n", "authors": ["1806"]}
{"title": "Comparison of trajectory tracking controllers for emergency situations\n", "abstract": " Over the last years a number of different vehicle controllers has been proposed for tracking planned paths or trajectories. Most of previously published works do not compare their results with other approaches or limit the comparison to a few scenarios. Unfortunately, comparisons with existing controller concepts are very rare and a ranking is hard to establish from the literature. In this work, we rigorously compare inversion-based trajectory tracking controllers by systematically exploring the set of possible solutions when disturbances vary over time and initial states and parameters are uncertain. By using Monte-Carlo simulation, we determine the average performance and by using rapidly exploring random trees, we determine the worst-case performance, which is especially important in emergency situations when avoiding a crash is essential. The tested scenarios and the applied methodologies are documented in …", "num_citations": "28\n", "authors": ["1806"]}
{"title": "Energy-consistent, Galerkin approach for the nonlinear dynamics of beams using intrinsic equations\n", "abstract": " The paper presents a Galerkin approach for the solution of nonlinear beam equations. The approach is energy consistent, that is, it is shown that the weighted residual integral describes energy flow. The Galerkin approach gives accurate results with fewer degrees of freedom as compared to low-order finite-element formulation. The Galerkin approach also leads to a nonlinear order-reduction technique that can be used to further decrease the order of the system. The reduced-order model is shown to capture the dominant nonlinearities in the system and is ideal for preliminary design and control synthesis.", "num_citations": "27\n", "authors": ["1806"]}
{"title": "Pedestrian models for autonomous driving part II: high-level models of human behavior\n", "abstract": " Autonomous vehicles (AVs) must share space with pedestrians, both in carriageway cases such as cars at pedestrian crossings and off-carriageway cases such as delivery vehicles navigating through crowds on pedestrianized high-streets. Unlike static obstacles, pedestrians are active agents with complex, interactive motions. Planning AV actions in the presence of pedestrians thus requires modelling of their probable future behavior as well as detecting and tracking them. This narrative review article is Part II of a pair, together surveying the current technology stack involved in this process, organising recent research into a hierarchical taxonomy ranging from low-level image detection to high-level psychological models, from the perspective of an AV designer. This self-contained Part II covers the higher levels of this stack, consisting of models of pedestrian behavior, from prediction of individual pedestrians' likely …", "num_citations": "26\n", "authors": ["1806"]}
{"title": "Combining zonotopes and support functions for efficient reachability analysis of linear systems\n", "abstract": " Reachability analysis is an important technique for formally verifying continuous systems, as well as for guaranteed state estimation, stability analysis, and controller synthesis. We present a detailed assessment of the computational efficiency for the reachability analysis of linear systems with respect to the two most scalable set representations: zonotopes and support functions. As a result, we propose representing reachable sets as a combination of support functions and zonotopes. This mix of representations can be converted to polyhedra of desired (directional) precision, at a higher precision compared to exclusively using support functions or zonotopes. The benefits are shown by an in-depth analysis of computational complexity and by numerical experiments.", "num_citations": "26\n", "authors": ["1806"]}
{"title": "Probabilistic map-based pedestrian motion prediction taking traffic participants into consideration\n", "abstract": " As pedestrians are one of the most vulnerable traffic participants, their motion prediction is of utmost importance for intelligent transportation systems. Predicting motions of pedestrians is especially hard since they move in less structured environments and have less inertia compared to road vehicles. To account for this uncertainty, we present an approach for probabilistic prediction of pedestrian motion using Markov chains. In contrast to previous work, we not only consider motion models, constraints from a semantic map, and various goals, but also explicitly adapt the prediction based on crash probabilities with other traffic participants. Also, our approach works in any situation; this is typically challenging for pure machine learning techniques that learn behaviors for a particular road section and which might consequently struggle with a different road section. The usefulness of combining the aforementioned aspects …", "num_citations": "25\n", "authors": ["1806"]}
{"title": "Worst-case analysis of the time-to-react using reachable sets\n", "abstract": " Collision mitigation and collision avoidance systems in intelligent vehicles reduce the severity and number of accidents. To determine the optimal point in time at which such systems should intervene, time-based criticality metrics such as the Time-To-React (TTR) are commonly used. The TTR describes the last point in time along the current trajectory at which an evasive trajectory exists. In this paper, we present a novel approach to determine the point in time after which it is guaranteed that no evasive maneuver exists, i.e., by using reachable sets, we over-approximate the TTR. Our deterministic upper bound of the TTR can be used to trigger a collision mitigation system or to find a feasible emergency maneuver which avoids the collision. We demonstrate the efficient computation of the tight over-approximated TTR in different urban and rural traffic scenarios, and compare our results to an estimated TTR using an …", "num_citations": "25\n", "authors": ["1806"]}
{"title": "Cognition and emotion in autonomous cars\n", "abstract": " In order to increase the acceptance of vehicles that drive (partly) autonomously, it seems advantageous that the driving style of autonomous cars is human-like. Furthermore, the acceptance of autonomous cars is believed to be increased when their actions and current state becomes more transparent to the passengers. These aspects can be tackled by implementing emotions to an autonomous car which allows a situation specific adaption of driving functions and vehicle dynamics. In this work, the emotions are modeled by the cognitive appraisal model as described by Ortony, Clore and Collins. The approach is presented for a traffic scene where two lanes are merged into one.", "num_citations": "25\n", "authors": ["1806"]}
{"title": "Effortless creation of safe robots from modules through self-programming and self-verification\n", "abstract": " Industrial robots cannot be reconfigured to optimally fulfill a given task and often have to be caged to guarantee human safety. Consequently, production processes are meticulously planned so that they last for long periods to make automation affordable. However, the ongoing trend toward mass customization and small-scale manufacturing requires purchasing new robots on a regular basis to cope with frequently changing production. Modular robots are a natural answer: Robots composed of standardized modules can be easily reassembled for new tasks, can be quickly repaired by exchanging broken modules, and are cost-effective by mass-producing standard modules usable for a large variety of robot types. Despite these advantages, modular robots have not yet left research laboratories because an expert must reprogram each new robot after assembly, rendering reassembly impractical. This work presents …", "num_citations": "24\n", "authors": ["1806"]}
{"title": "BluSTL: Controller Synthesis from Signal Temporal Logic Specifications.\n", "abstract": " We present BluSTL, a MATLAB toolbox for automatically generating controllers from specifications written in Signal Temporal Logic (STL). The toolbox takes as input a system and a set of constraints expressed in STL and constructs an open-loop or a closed-loop (in a receding horizon or Model Predictive fashion) controller that enforces these constraints on the system while minimizing some cost function. The controller can also be made reactive or robust to some external input or disturbances. The toolbox is available at https://github. com/BluSTL/BluSTL.", "num_citations": "24\n", "authors": ["1806"]}
{"title": "An online verification framework for motion planning of self-driving vehicles with safety guarantees\n", "abstract": " Self-driving vehicles must be able to safely navigate in any traffic scenario. However, all situations are different; even when clustering them, an impractical amount of scenarios would have to be verified. Thus, we propose a safety framework to verify the safety of each planned trajectory on-the-fly, using formal methods to handle uncertain measurements and future behaviors of traffic participants and disturbances acting on the ego vehicle, among others. Our framework can easily be integrated...»", "num_citations": "23\n", "authors": ["1806"]}
{"title": "Automatic conversion of road networks from opendrive to lanelets\n", "abstract": " Detailed road maps are an important building block for autonomous driving. They accelerate creating a semantic environment model within the vehicle and serve as a backup solution when sensors are occluded or otherwise impaired. Due to the required detail of maps for autonomous driving and virtual test drives, creating such maps is quite labor-intensive. While some detailed maps for fairly large regions already exist, they are often in different formats and thus cannot be exchanged between companies and research institutions. To address this problem, we present the first publicly available converter from the OpenDRIVE format to lanelets-both representations are among the most popular map formats. We demonstrate the capabilities of the converter by using publicly available maps.", "num_citations": "23\n", "authors": ["1806"]}
{"title": "Can automated road vehicles harmonize with traffic flow while guaranteeing a safe distance?\n", "abstract": " A frequently raised argument against safely-driving automated vehicles is that they would not harmonize well with traffic flow-unrealistically large headways would invite other traffic participants to cut in and thus put passengers of following automated vehicles at risk. In order to test this hypothesis, we use real data of thousands of vehicles recorded in the United States as part of the Next Generation Simulation (NGSIM) program. To study the hypothesis, we pretend each human-driven vehicle is automated: These automated vehicles drive exactly as the recorded human drivers, but they have a much smaller reaction time and thus can still drive safely in situations that are unsafe for human drivers. The main result is that in only very few cases an automated vehicle would not drive safely, although more than half of the human drivers do not keep a safe distance according to their capabilities. Thus, there is no increased …", "num_citations": "23\n", "authors": ["1806"]}
{"title": "STL model checking of continuous and hybrid systems\n", "abstract": " Signal Temporal Logic (STL) is a formalism for reasoning about temporal properties of continuous-time traces of hybrid systems. Previous work on this subject mostly focuses on robust satisfaction of an STL formula for a particular trace. In contrast, we present a method solving the problem of formally verifying an STL formula for continuous and hybrid system models, which exhibit uncountably many traces. We consider an abstraction of a model as an evolution of reachable sets. Through leveraging the representation of the abstraction, the continuous-time verification problem is reduced to a discrete-time problem. For the given abstraction, the reduction to discrete-time and our decision procedure are sound and complete for finitely represented reach sequences and sampled time STL formulas. Our method does not rely on a special representation of reachable sets and thus any reachability analysis tool can …", "num_citations": "23\n", "authors": ["1806"]}
{"title": "Estimating the region of attraction via forward reachable sets\n", "abstract": " We propose and implement an algorithm based on reachability analysis to estimate the region of attraction (ROA) of an equilibrium point for nonlinear systems. The stability region is obtained via the computation of forward reachable sets. We compare our results with well-established techniques in this area. In particular, we consider the optimization of the Lyapunov function (LF) sub-level set using sum-of-squares (SOS) decomposition, and the computation of backward reachable sets of a target set using the viscosity solution of a time-dependant Hamilton-Jacobi-Isaacs (HJI) formulation. Our method can overcome many limitations imposed on the applicability of Lyapunov-based approaches, such as conservatism in estimating the stability region, and difficulties associated with choosing a suitable LF. This is due to the fact that our reachability algorithm does not require a LF in order to provide an estimate of the …", "num_citations": "22\n", "authors": ["1806"]}
{"title": "Formal analysis of drum-boiler units to maximize the load-following capabilities of power plants\n", "abstract": " The load-following capabilities of power plants became increasingly important in recent years as a means of ensuring a reliable operation of future power systems. In this work, we propose a generic approach, based on reachability analysis, to rigorously verify the safety of critical components that often pose limitations on the flexibility of conventional power plants to perform fast load changes. The proposed reachability algorithm makes it possible to compute the bounds of all possible trajectories for a range of operating conditions while simultaneously meeting the practical requirements of a real power plant. As an example, we consider the verification of the water level inside a drum unit. In contrast to previous work, our results are based on measurement data of a realistic configuration of a boiler system located within a 450 MW combined cycle plant in Germany. We use an abstract model which considers the …", "num_citations": "22\n", "authors": ["1806"]}
{"title": "Using online verification to prevent autonomous vehicles from causing accidents\n", "abstract": " Ensuring that autonomous vehicles do not cause accidents remains a challenge. We present a formal verification technique for guaranteeing legal safety in arbitrary urban traffic situations. Legal safety means that autonomous vehicles never cause accidents although other traffic participants are allowed to perform any behaviour in accordance with traffic rules. Our technique serves as a safety layer for existing motion planning frameworks that provide intended trajectories for autonomous vehicles. We verify whether intended trajectories comply with legal safety and provide fallback solutions in safety-critical situations. The benefits of our verification technique are demonstrated in critical urban scenarios, which have been recorded in real traffic. The autonomous vehicle executed only safe trajectories, even when using an intended trajectory planner that was not aware of other traffic participants. Our results indicate …", "num_citations": "21\n", "authors": ["1806"]}
{"title": "Driving strategy selection for cooperative vehicles using maneuver templates\n", "abstract": " We introduce a novel concept based on maneuver templates, which are formalized collaborative maneuvers, to select cooperative driving strategies. The approach is based on the exclusion principle, where we derive provable conditions to discard unsafe cooperative maneuvers for a given traffic situation. We thereby consider the full action set of all cooperative vehicles and do not discretize the action space. We demonstrate the applicability of our approach with numerical examples.", "num_citations": "21\n", "authors": ["1806"]}
{"title": "A formally verified motion planner for autonomous vehicles\n", "abstract": " Autonomous vehicles are safety-critical cyber-physical systems. To ensure their correctness, we use a proof assistant to prove safety properties deductively. This paper presents a formally verified motion planner based on manoeuvre automata in Isabelle/HOL. Two general properties which we ensure are numerical soundness (the absence of floating-point errors) and logical correctness (satisfying a plan specified in linear temporal logic). From these two properties, we obtain a motion planner whose correctness only depends on the validity of the models of the ego vehicle and its environment.", "num_citations": "20\n", "authors": ["1806"]}
{"title": "On the combined inverse-dynamics/passivity-based control of elastic-joint robots\n", "abstract": " In this paper, we present a novel global tracking control approach for elastic-joint robots that can be efficiently computed and is robust against model uncertainties and input disturbances. Elastic-joint robots provide enhanced safety and resiliency for interaction with the environment and humans. On the other hand, the joint elasticity complicates the motion-control problem especially when robust and precise trajectory tracking is required. Our proposed control approach allows us to merge the main benefits of the two well-known control schemes: inverse-dynamics (ID) control, which can be efficiently computed thanks to modern recursive algorithms, and passivity-based (PB) tracking control, which provides enhanced robustness to model uncertainty and external disturbances. As an extension of our previous work, we present a detailed robustness analysis of our combined ID/PB controller, a new variant of the original …", "num_citations": "20\n", "authors": ["1806"]}
{"title": "ARCH-COMP17 Category Report: Continuous and Hybrid Systems with Linear Continuous Dynamics\n", "abstract": " This report presents the results of a friendly competition for formal verification of continuous and hybrid systems with linear continuous dynamics. The friendly competition took place as part of the workshop Applied Verification for Continuous and Hybrid Systems (ARCH) in 2017. In its first edition, seven tools have been applied to solve three different benchmark problems in the category for linear continuous dynamics (in alphabetical order): Axelerator, CORA, Flow*, HyDRA, Hylaa, SpaceEx, and XSpeed. The result is a snapshot of the current landscape of tools and the types of benchmarks they are particularly suited for. Due to the diversity of problems, we are not ranking tools, yet the presented results probably provide the most complete assessment of tools for the safety verification of continuous and hybrid systems with linear continuous dynamics up to this date.", "num_citations": "20\n", "authors": ["1806"]}
{"title": "Automated generation of hybrid system models for reachability analysis of nonlinear analog circuits\n", "abstract": " We address the problem of formally verifying nonlinear analog circuits with an uncertain initial set by computing their reachable set. A reachable set contains the union of all possible system trajectories for a set of uncertain states and as such can be used to provably check whether undesired behavior is possible or not. Our method is based on local linearizations of the nonlinear circuit, which naturally results in a piecewise-linear system. To substantially limit the number of required locations, our approach computes linearized locations on-the-fly depending on which states are reachable. We can show that without the proposed on-the-fly technique, the conversion to piecewise-linear systems is infeasible even for a few nonlinear semiconductor devices (discrete state-space explosion problem). Our method is fully automatic and only requires a circuit netlist. Piecewise-linear systems have gained popularity not only for …", "num_citations": "20\n", "authors": ["1806"]}
{"title": "Set propagation techniques for reachability analysis\n", "abstract": " Reachability analysis consists in computing the set of states that are reachable by a dynamical system from all initial states and for all admissible inputs and parameters. It is a fundamental problem motivated by many applications in formal verification, controller synthesis, and estimation, to name only a few. This article focuses on a class of methods for computing a guaranteed overapproximation of the reachable set of continuous and hybrid systems, relying predominantly on set propagation; starting from the set of initial states, these techniques iteratively propagate a sequence of sets according to the system dynamics. After a review of set representation and computation, the article presents the state of the art of set propagation techniques for reachability analysis of linear, nonlinear, and hybrid systems. It ends with a discussion of successful applications of reachability analysis to real-world problems.", "num_citations": "19\n", "authors": ["1806"]}
{"title": "Methods for order reduction of zonotopes\n", "abstract": " Zonotopes are a special subclass of polytopes, which have several favorable properties: They can be represented in a compact way and they are closed under the Minkowski sum as well as under linear transformations. Zono-topes are a popular set representation used e.g. for reachability analysis of dynamic systems, set-based observers and robust control. The complexity of algorithms that work on zonotopes strongly depends on their order (i.e. their number of generators and dimensions), which is often increased by operations like the Minkowski sum. Thus, to keep computations efficient, zonotopes of high orders are often over-approximated as tight as possible by zonotopes of smaller order. This paper has two main contributions: First, we propose new methods based on principle component analysis (PCA), clustering and constrained optimization for tight over-approximation of zonotopes. Second, we provide an …", "num_citations": "19\n", "authors": ["1806"]}
{"title": "Pedestrian models for autonomous driving part I: low-level models, from sensing to tracking\n", "abstract": " Autonomous vehicles (AVs) must share space with pedestrians, both in carriageway cases such as cars at pedestrian crossings and off-carriageway cases such as delivery vehicles navigating through crowds on pedestrianized high-streets. Unlike static obstacles, pedestrians are active agents with complex, interactive motions. Planning AV actions in the presence of pedestrians thus requires modelling of their probable future behavior as well as detecting and tracking them. This narrative review article is Part I of a pair, together surveying the current technology stack involved in this process, organising recent research into a hierarchical taxonomy ranging from low-level image detection to high-level psychology models, from the perspective of an AV designer. This self-contained Part I covers the lower levels of this stack, from sensing, through detection and recognition, up to tracking of pedestrians. Technologies at …", "num_citations": "18\n", "authors": ["1806"]}
{"title": "Reachset model predictive control for disturbed nonlinear systems\n", "abstract": " The popularity of model predictive control (MPC) is mainly founded on its easy implementation and its ability to consider state and input constraints. For future applications in safety-critical systems, however, it is necessary to provide formal guarantees of safety despite disturbances and measurement noise. In this paper, we include reachability analysis in an MPC approach to obtain provably safe controllers which are easy to implement. We consider continuous-time, nonlinear systems affected by disturbances and measurement noise. In contrast to most existing techniques, we explicitly consider the computation time and guarantee the satisfaction of state and input constraints despite the previously-mentioned disturbances. We use a novel type of dual mode MPC, which does not require the computation of Lyapunov functions. We demonstrate the applicability of our approach with a numerical example of a chemical …", "num_citations": "18\n", "authors": ["1806"]}
{"title": "Efficient mixed-integer programming for longitudinal and lateral motion planning of autonomous vehicles\n", "abstract": " The application of continuous optimization to motion planning of autonomous vehicles has enjoyed increasing popularity in recent years. In order to maintain low computation times, it is advantageous to have a convex formulation, in general requiring the planning problem to be separated into a longitudinal and lateral component. However, this decoupling of the motion often results in infeasible trajectories in situations in which both components need to be heavily linked, e.g., when planning swerving maneuvers to avoid a collision with obstacles. In this work, we propose an approach which extends the convex optimization problem of the longitudinal component to incorporate changing constraints, allowing us to guarantee feasibility of the resulting combined trajectory. Furthermore, we provide additional safety guarantees for the planned motion by integrating formal safety distances assuming infinite precision …", "num_citations": "18\n", "authors": ["1806"]}
{"title": "ARCH-COMP18 category report: Continuous and hybrid systems with nonlinear dynamics\n", "abstract": " We present the results of a friendly competition for formal verification of continuous and hybrid systems with nonlinear continuous dynamics. The friendly competition took place as part of the workshop Applied Verification for Continuous and Hybrid Systems (ARCH) in 2018. In this year, six tools CORA, CORA/SX, C2E2, Flow*, Isabelle/HOL, and SymReach (in alphabetic order) participated. They are applied to solve reachability analysis problems on four benchmarks problems, one of them with hybrid dynamics. We do not rank the tools based on the results, but show the current status and discover the potential advantages of different tools.", "num_citations": "18\n", "authors": ["1806"]}
{"title": "Interaction-aware occupancy prediction of road vehicles\n", "abstract": " A crucial capability of autonomous road vehicles is the ability to cope with the unknown future behavior of surrounding traffic participants. This requires using non-deterministic models for prediction. While stochastic models are useful for long-term planning, we use set-valued non-determinism capturing all possible behaviors in order to verify the safety of planned maneuvers. To reduce the set of solutions, our earlier work considers traffic rules; however, it neglects mutual influences between traffic participants. This work presents the first solution for establishing interaction within set-based prediction of traffic participants. Instead of explicitly modeling dependencies between vehicles, we trim reachable occupancy regions to consider interaction, which is computationally much more efficient. The usefulness of our approach is demonstrated by experiments from the CommonRoad benchmark repository.", "num_citations": "18\n", "authors": ["1806"]}
{"title": "Overapproximative human arm occupancy prediction for collision avoidance\n", "abstract": " Predicting the occupancy of a human in real time is of great interest in human-robot coexistence for obtaining regions that a robot should avoid in safe motion planning. The human body is composed of joints and links, suiting approximation by a kinematic chain, but the control strategy of the human is completely unknown, meaning the potential occupancy grows very fast and it is difficult to compute tightly in real time. As such, most previous work considers only specific, known, or probable movements, and usually does not account for a range of human dimensions. Focusing on the human arm, we analyze archetypal movements performed by test subjects to create a dynamic model. Motion-capture data of subjects are fitted, for modeling purposes, to two abstractions: a 4-degree of freedom (DOF) model and a 3-DOF model, to obtain dynamic parameters. We validate our approach on movements from a publicly …", "num_citations": "18\n", "authors": ["1806"]}
{"title": "A task-driven algorithm for configuration synthesis of modular robots\n", "abstract": " This paper presents a time-efficient, task-based configuration synthesis algorithm for modular robot manipulators. One of the main challenges in modular manipulators is to find possible combinations of modules that are able to complete given tasks while avoiding obstacles in the environment. Most studies on modular robots focus on obtaining combinations of modules to achieve a given task without considering the required path planning in an environment with obstacles. In contrast to previous works, we present a configuration synthesis method for modular manipulators, considering collision detection and path planning in task space. Our simulations show that our approach finds possible combinations with reduced computational time compared to previous techniques.", "num_citations": "18\n", "authors": ["1806"]}
{"title": "Safety assessment for stochastic linear systems using enclosing hulls of probability density functions\n", "abstract": " This contribution addresses the problem of computing the probability that a linear system with uncertain inputs reaches an unsafe region in the state space. The probability of reaching unsafe states is bounded by an upper limit, by intersecting enclosing hulls of the probability density function for time intervals with the specified unsafe regions. Disturbances are modeled as white Gaussian noise, whose mean is modeled as uncertain within specified sets. This allows to consider white non-Gaussian noise in an over-approximative manner. The presented approach is efficient in the sense that high-dimensional systems can be handled.", "num_citations": "18\n", "authors": ["1806"]}
{"title": "Model conformance for cyber-physical systems: A survey\n", "abstract": " Model-based development is an important paradigm for developing cyber-physical systems (CPS). The underlying assumption is that the functional behavior of a model is related to the behavior of a more concretized model or the real system. A formal definition of such a relation is called conformance relation. There are a variety of conformance relations, and the question arises of how to select a conformance relation for the development of CPS. The contribution of this article is a survey of the definitions and algorithms of conformance relations for CPS. Additionally, the article compares several conformance relations and provides guidance on which relation to select for specific problems. Finally, we discuss how to select inputs for testing conformance.", "num_citations": "17\n", "authors": ["1806"]}
{"title": "Flexible automation driven by demonstration: Leveraging strategies that simplify robotics\n", "abstract": " An important question for production engineers is, \"How do I automate this task?\" In traditional industrial automation, e.g., a car factory, robots perform a small set of tasks for long periods of time. Robots are selected because their kinematic structure and strength suit the task requirements, and their motions are preprogrammed by a skilled programmer. In flexible manufacturing environments, tasks can change daily or hourly. The classic approach to automation is less suitable here; buying a dedicated robot for each set of tasks is inefficient, and coding each task is very time-consuming. Furthermore, qualified programmers with the requisite knowledge may not be available. To solve these problems, we propose a framework for modular robots that determines their structure and program based on human demonstrations.", "num_citations": "17\n", "authors": ["1806"]}
{"title": "On-the-fly control design of modular robot manipulators\n", "abstract": " We consider the problem of automatically designing model-based controllers of modular robot manipulators in a systematic way. Modular robots are especially useful in flexible manufacturing, where one wishes to quickly assemble robots from a set of modules for temporary tasks. The evaluation of all possible dynamical models is typically impractical, undermining the implementation of model-based control laws. Contrary to most other work that approached this challenge by designing decentralized controllers, we generate on-the-fly model-based centralized controllers after a new robot has been assembled. In this brief, we extend the applicability of our previous work on this subject by considering both link and joint modules, assembly dependent friction effects, and we finally present experiments that validate the overall approach.", "num_citations": "17\n", "authors": ["1806"]}
{"title": "Tactical decision making for cooperative vehicles using reachable sets\n", "abstract": " Tactical maneuver planning of multiple, communicating vehicles provides the opportunity to increase passenger safety and comfort. We propose a unifying method to orchestrate the motion of cooperative vehicles based on the negotiation of conflicting road areas, which are determined by reachable set computation. As a result, each vehicle receives an individual driving corridor for trajectory planning. The presented conflict resolution scheme has polynomial runtime complexity and is guaranteed to find the optimal allocation of road areas for each negotiation round. Our method is not tailored to specific traffic situations but is applicable to general traffic scenes with manually driven and automated vehicles. We demonstrate the universal usability of our approach in numerical experiments.", "num_citations": "16\n", "authors": ["1806"]}
{"title": "Efficient computation of invariably safe states for motion planning of self-driving vehicles\n", "abstract": " Safe motion planning requires that a vehicle reaches a set of safe states at the end of the planning horizon. However, safe states of vehicles have not yet been systematically defined in the literature, nor does a computationally efficient way to obtain them for online motion planning exist. To tackle the aforementioned issues, we introduce invariably safe sets. These are regions that allow vehicles to remain safe for an infinite time horizon. We show how invariably safe sets can be computed and propose a tight under-approximation which can be obtained efficiently in linear time with respect to the number of traffic participants. We use invariably safe sets to lift safety verification from finite to infinite time horizons. In addition, our sets can be used to determine the existence of feasible evasive maneuvers and the criticality of scenarios by computing the time-to-react metric.", "num_citations": "16\n", "authors": ["1806"]}
{"title": "Compositional transient stability analysis of power systems via the computation of reachable sets\n", "abstract": " The main challenge associated with the analysis of power systems via the computation of reachable sets is improving the algorithmic efficiency to scale towards industrially relevant problem sizes. In this paper, we present a compositional algorithm that can drastically reduce the computational effort required to assess the dynamical response of power systems during transients using reachability analysis. The main reason for the algorithmic efficiency is that we reformulate the transmission network into a set of subsystems, each consisting of a synchronous generator connected to a generator bus, whose algebraic constraints are unknown-but-bounded within some confidence intervals. This makes it possible to parallelize the computation of reachable sets for transient stability analysis and, more importantly, preserve the interaction and correlation between different machines connected to the grid. The applicability of …", "num_citations": "16\n", "authors": ["1806"]}
{"title": "Estimating the domain of attraction based on the invariance principle\n", "abstract": " Estimating the domain of attraction (DA) of an equilibrium point is a long-standing yet still challenging issue in nonlinear system analysis. The method using the sublevel set of Lyapunov functions is proven to be efficient, but sometimes conservative compared to the estimate via invariant sets. This paper studies the estimation problem of the DA for autonomous polynomial system by using the invariance principle. The main idea is to estimate the DA via sublevel sets of a positive polynomial, which characterizes the boundary of invariant sets. This new type of invariant sets admits the condition that the derivative of Lyapunov functions is non-positive, which generalizes the sublevel set method via Lyapunov functions. An iterative algorithm is then proposed for enlarging the estimate of the DA. Finally, the effectiveness of the proposed method is illustrated by numerical examples.", "num_citations": "16\n", "authors": ["1806"]}
{"title": "Energy-consistent, Galerkin approach for the nonlinear dynamics of beams using mixed, intrinsic equations\n", "abstract": " The paper presents a Galerkin approach for the solution of the nonlinear beam equations. Nonlinear beam analysis is required when analyzing helicopter blades1 or high-aspect-ratio wings. 2 The present analysis improves on earlier solution techniques based on nonlinear finite element approach used in Refs. 1 and 2, and is the ideal choice for beam-like structures undergoing large motion. Furthermore, the approach leads to an nonlinear, order-reduction technique which can be applied to the Galerkin equations as well as a finite-element equations.", "num_citations": "16\n", "authors": ["1806"]}
{"title": "Reachability analysis of large linear systems with uncertain inputs in the Krylov subspace\n", "abstract": " One often wishes for the ability to formally analyze large-scale systems-typically, however, one can either formally analyze a rather small system or informally analyze a large-scale system. This paper tries to further close this performance gap for reachability analysis of linear systems. Reachability analysis can capture the whole set of possible solutions of a dynamic system and is thus used to prove that unsafe states are never reached; this requires full consideration of arbitrarily varying uncertain inputs, since sensor noise or disturbances usually do not follow any patterns. We use Krylov methods in this paper to compute reachable sets for large-scale linear systems. While Krylov methods have been used before in reachability analysis, we overcome the previous limitation that inputs must be (piecewise) constant. As a result, we can compute reachable sets of systems with several thousand state variables for …", "num_citations": "15\n", "authors": ["1806"]}
{"title": "Control synthesis for non-polynomial systems: a domain of attraction perspective\n", "abstract": " This paper studies a control synthesis problem to enlarge the domain of attraction (DA) for non-polynomial systems by using polynomial Lyapunov functions. The basic idea is to formulate an uncertain polynomial system with parameter ranges obtained form the truncated Taylor expansion and the parameterizable remainder of the non-polynomial system. A strategy for searching a polynomial output feedback controller and estimating the lower bound of the largest DA is proposed via an optimization of linear matrix inequalities (LMIs). Furthermore, in order to check the tightness of the lower bound of the largest estimated DA, a necessary and sufficient condition is given for the proposed controller. Lastly, several methods are provided to show how the proposed strategy can be extended to the case of variable Lyapunov functions. The effectiveness of this approach is demonstrated by numerical examples.", "num_citations": "15\n", "authors": ["1806"]}
{"title": "Determining the nonexistence of evasive trajectories for collision avoidance systems\n", "abstract": " It is of utmost importance for automatic collision avoidance systems to correctly evaluate the risk of a current situation and constantly decide, if and what kind of evasive maneuver must be initiated. Most motion planning algorithms find such maneuver by searching a deterministic or random subset of the state space or input space. These approaches can be designed to be complete in the sense that they converge to a feasible solution as sampling is made denser. However, they are not suitable to determine whether a solution exists. In this paper, we present an approach which overapproximates the reachable set of the host vehicle considering workspace obstacles. Thus, it provides an upper bound of the solution set and it can report if no solution exists. Furthermore, the calculated set can be used for guiding the search of an underlying planning algorithm to find a solution as each trajectory of the host vehicle is …", "num_citations": "15\n", "authors": ["1806"]}
{"title": "Transient stability analysis by reachable set computation\n", "abstract": " We present a formal technique for verifying the stability of transient responses of power systems. The procedure uses reachability analysis to compute the complete set of possible transient responses starting from a set of initial states, subject to a dynamics specified by differential-algebraic equations. The method is constructive and fully automatic, two properties that are often hard to achieve with direct Lyapunov methods when the differential-algebraic equations are not simplified. Reachability analysis is computationally expensive, but this work presents new techniques that make it possible to verify the stability of a transient response of the IEEE 14-bus benchmark power system network.", "num_citations": "15\n", "authors": ["1806"]}
{"title": "Nonlinear modeling and control design of active helicopter blades\n", "abstract": " This paper presents the theoretical basis for the simulation and control of active helicopter blades. The analysis is based on a model that considers the structural dynamics, the aerodynamics, as well as the integrated blade actuation and sensing. The effect of the integral actuation enters the beam model via an active beam cross-sectional analysis. A two-dimensional incompressible, inviscid, quasi-steady aerodynamic model is coupled to the active structural model. For simulation, analysis, and control design, the blade model is discretized in space using a Galerkin approach. The resulting nonlinear model of high order is reduced using the aeroelastic modes of the blade. Finally, the usefulness of a reduced-order model is demonstrated by designing an energy optimal linear-quadratic-Gaussian (LQG) control.", "num_citations": "15\n", "authors": ["1806"]}
{"title": "On computing the minkowski difference of zonotopes\n", "abstract": " Zonotopes are becoming an increasingly popular set representation for formal verification techniques. This is mainly due to their efficient representation and their favorable computational complexity of important operations in high-dimensional spaces. In particular, zonotopes are closed under Minkowski addition and linear maps, which can be very efficiently implemented. Unfortunately, zonotopes are not closed under Minkowski difference for dimensions greater than two. However, we present an algorithm that efficiently computes a halfspace representation of the Minkowski difference of two zonotopes. In addition, we present an efficient algorithm that computes an approximation of the Minkowski difference in generator representation. The efficiency of the proposed solution is demonstrated by numerical experiments. These experiments show a reduced computation time in comparison to that when first the halfspace representation of zonotopes is obtained and the Minkowski difference is performed subsequently.", "num_citations": "14\n", "authors": ["1806"]}
{"title": "Safe reinforcement learning for autonomous lane changing using set-based prediction\n", "abstract": " Machine learning approaches often lack safety guarantees, which are often a key requirement in real-world tasks. This paper addresses the lack of safety guarantees by extending reinforcement learning with a safety layer that restricts the action space to the subspace of safe actions. We demonstrate the proposed approach using lane changing in autonomous driving. To distinguish safe actions from unsafe ones, we compare planned motions with the set of possible occupancies of traffic participants generated by set-based predictions. In situations where no safe action exists, a verified failsafe controller is executed. We used real-world highway traffic data to train and test the proposed approach. The evaluation result shows that the proposed approach trains agents that do not cause collisions during training and deployment.", "num_citations": "13\n", "authors": ["1806"]}
{"title": "Formalization of interstate traffic rules in temporal logic\n", "abstract": " To allow autonomous vehicles to safely participate in traffic and to avoid liability claims for car manufacturers, autonomous vehicles must obey traffic rules. However, current traffic rules are not formulated in a precise and mathematical way, so that they cannot be directly applied to autonomous vehicles. Additionally, several legal sources other than national traffic laws must be considered to infer detailed traffic rules. Thus, we formalize traffic rules for interstates based on the German Road Traffic Regulation, the Vienna Convention on Road Traffic, and legal decisions from courts. This makes it possible to automatically and unambiguously check whether traffic rules are being met by autonomous vehicles. Temporal logic is used to express the obtained rules mathematically. Our formalized traffic rules are evaluated for recorded data on more than 2,500 vehicles.", "num_citations": "13\n", "authors": ["1806"]}
{"title": "Coupling sumo with a motion planning framework for automated vehicles\n", "abstract": " Testing motion planning algorithms for automated vehicles in realistic simulation environments accelerates their development compared to performing real-world test drives only. In this work, we combine the open-source microscopic traffic simulator SUMO with our software framework CommonRoad to test motion planning of automated vehicles. Since SUMO is not originally designed for simulating automated vehicles, we present an interface for exchanging the trajectories of vehicles controlled by a motion planner and the trajectories of other traffic participants between SUMO and CommonRoad. Furthermore, we ensure realistic dynamic behavior of other traffic participants by extending the lane changing model in SUMO to implement more realistic lateral dynamics. We demonstrate our SUMO interface with a highway scenario.", "num_citations": "13\n", "authors": ["1806"]}
{"title": "Anytime safety verification of autonomous vehicles\n", "abstract": " We propose a procedure to formally verify the safety of autonomous vehicles online, i.e., during operation, that considers the uniqueness of each traffic situation. A challenging aspect of online verification is the varying number of surrounding traffic participants, which causes significant variations in computational demand. To guarantee timely safe motion plans, we propose an anytime approach that provides rapid conservative verification results based on coarse model abstractions, which are refined continually if computation time is available. Reachability analysis, which over-approximates all possible behaviors of other traffic participants, is performed for each abstraction. We demonstrate the usefulness of the proposed procedure using the CommonRoad benchmark suite.", "num_citations": "13\n", "authors": ["1806"]}
{"title": "Distributed formal analysis for power networks with deep integration of distributed energy resources\n", "abstract": " A scalable distributed formal analysis (DFA) via reachable set computation is presented to efficiently evaluate the stability of large-scale interconnected power networks under heterogeneous disturbances induced by high penetration of distributed energy resources (DERs). Based on rigorous mathematical derivation, DFA is able to directly compute the boundaries of all possible dynamics and provide stability information, which is unattainable by traditional time-domain simulations or direct methods. An N+M decomposition approach is established to decouple a large-scale networked system and enable distributed reachable set calculations while also preserving the privacy of each subsystem. Numerical examples on a networked microgrid system show that DFA facilitates the efficient calculation and analysis of the impact DER disturbances can have on power network dynamics, which provides a potent means of …", "num_citations": "13\n", "authors": ["1806"]}
{"title": "Evolutionary cost-optimal composition synthesis of modular robots considering a given task\n", "abstract": " Commercially available robots cannot always be adapted to arbitrary tasks or environments, particularly when the task would exceed the kinematic or dynamic limits of the robot. Modular robots offer a solution to this problem, since they can be reconfigured in various ways from a set of modules. The challenge of choosing the optimal composition for a given task, however, is hard since the search space of compositions is vast. Our approach addresses this problem: instead of finding the cost-optimal solution over all possible compositions individually, we propose a time-efficient composition synthesis method which uses evolutionary algorithms by taking task-related objectives into account. Simulations show that our algorithm finds the cost-optimal module composition with less computation time than other methods in the literature.", "num_citations": "13\n", "authors": ["1806"]}
{"title": "Computing possible driving corridors for automated vehicles\n", "abstract": " Motion planing in dynamic traffic scenes is a challenging problem. In particular, since it is unknown during planning whether a certain decision, such as passing another traffic participant on the left or right, will result in a safe and comfortable motion. Exhaustive exploration of all principle driving paths is computationally expensive, so that one typically reverts to heuristics - this, however can be unsatisfactory in situations when the heuristics fail to find a solution although it exists. We address this problem by computing the union of all possible motions for a sequence of high-level decisions (e.g. overtake vehicle on the left and then another one on the right), which we refer to as a driving corridor. Our proposed algorithm is over-approximative, i.e. the union of driving corridors provably encloses all possible motions. Thus, if the set of reachable positions within a driving corridor becomes empty, the corresponding …", "num_citations": "13\n", "authors": ["1806"]}
{"title": "ARCH-COMP19 category report: Continuous and hybrid systems with linear continuous dynamics\n", "abstract": " This report presents the results of a friendly competition for formal verification of continuous and hybrid systems with linear continuous dynamics. The friendly competition took place as part of the workshop Applied Verification for Continuous and Hybrid Systems (ARCH) in 2019. In its third edition, seven tools have been applied to solve six different benchmark problems in the category for linear continuous dynamics (in alphabetical order): CORA, CORA/SX, HyDRA, Hylaa, JuliaReach, SpaceEx, and XSpeed. This report is a snapshot of the current landscape of tools and the types of benchmarks they are particularly suited for. Due to the diversity of problems, we are not ranking tools, yet the presented results provide one of the most complete assessments of tools for the safety verification of continuous and hybrid systems with linear continuous dynamics up to this date.", "num_citations": "12\n", "authors": ["1806"]}
{"title": "Overapproximative arm occupancy prediction for human-robot co-existence built from archetypal movements\n", "abstract": " Human motion is fast and hard to predict. To implement a provably safe collision-avoidance strategy for robots in collaborative spaces with humans, an overapproximative prediction of the occupancy of the human is required, which needs to be calculated faster than real time. We present a method for computing volumes containing the entire possible future occupancy of the human, given its state, faster than real time. The dynamic model of the human is built from analysing a set of archetypal movements performed by test subjects. The occupancy prediction is tested on a publicly available database of motion capture data, and shown to be overapproximative for all movements relating to everyday activities, sport and dance. Our novel algorithm is useful to guarantee safety in human-robot collaboration scenarios.", "num_citations": "12\n", "authors": ["1806"]}
{"title": "Using reachable sets for trajectory planning of automated vehicles\n", "abstract": " The computational effort of trajectory planning for automated vehicles often increases with the complexity of the traffic situation. This is particularly problematic in safety-critical situations, in which the vehicle must react in a timely manner. We present a novel motion planning approach for automated vehicles, which combines set-based reachability analysis with convex optimization to address this issue. This combination makes it possible to find driving maneuvers even in small and convoluted solution spaces. In contrast to existing work, the computation time of our approach typically decreases, the more complex situations become. We demonstrate the benefits of our motion planner in scenarios from the CommonRoad benchmark suite and validate the approach on a real test vehicle.", "num_citations": "11\n", "authors": ["1806"]}
{"title": "Set-based prediction of traffic participants considering occlusions and traffic rules\n", "abstract": " Provably safe motion planning for automated road vehicles must ensure that planned motions do not result in a collision with other traffic participants. This is a major challenge in autonomous driving, since the future behavior of other traffic participants is not known and since traffic participants are often hidden due to occlusions. In this work, we propose a formal set-based prediction that contains all acceptable future behaviors of both detected and potentially hidden traffic participants. Based on formalized traffic rules and nondeterministic motion models, we perform reachability analysis to predict the set of possible occupancies and velocities of vehicles, pedestrians, and cyclists. Real-world experiments with a test vehicle in various traffic situations demonstrate the applicability and real-time capability of our over-approximative prediction for both online verification and fail-safe trajectory planning. Even in congested …", "num_citations": "11\n", "authors": ["1806"]}
{"title": "Distributed secure state estimation using diffusion kalman filters and reachability analysis\n", "abstract": " The tight coupling of information technology with physical sensing and actuation in cyber-physical systems (CPS) has given rise to new security vulnerabilities and attacks with potentially life-threatening consequences. These attacks are designed to transfer the physical system into unstable and insecure states by providing corrupted sensor readings. In this work, we present an approach for distributed secure linear state estimation in the presence of modeling and measurement noise between a network of nodes with pairwise measurements. We provide security against measurement attacks and simplify the traditional distributed secure state estimation problem. Reachability analysis is utilized to establish a security layer providing secure estimate shares for the distributed diffusion Kalman filter. Furthermore, we consider not only attacks on the link level but also on the sensor level. The proposed combined filter …", "num_citations": "11\n", "authors": ["1806"]}
{"title": "Time-triggered conversion of guards for reachability analysis of hybrid automata\n", "abstract": " A promising technique for the formal verification of embedded and cyber-physical systems is flow-pipe construction, which creates a sequence of regions covering all reachable states over time. Flow-pipe construction methods can check whether specifications are met for all states, rather than just testing using a finite and incomplete set of simulation traces. A fundamental challenge when using flow-pipe construction on high-dimensional systems is the cost of geometric operations, such as intersection and convex hull. We address this challenge by showing that it is often possible to remove the need to perform high-dimensional geometric operations by combining two model transformations, direct time-triggered conversion and dynamics scaling. Further, we prove the overapproximation error in the conversion can be made arbitrarily small. Finally, we show that our transformation-based approach enables …", "num_citations": "11\n", "authors": ["1806"]}
{"title": "Online motion synthesis with minimal intervention control and formal safety guarantees\n", "abstract": " We present a framework for online coordinated obstacle avoidance with formal safety guarantees. Such a formally verified trajectory planner can be used in shared human-robot workspaces to guarantee safety. The obstacle avoidance is based on estimation of the human occupancy on two different time scales. A long-term plan is created based on a probabilistic task representation, learned by demonstration, and an estimate of the human occupancy to be avoided. Using an additional overapproximative, short-term prediction of human motion we guarantee that the robot can always account for sudden or reflex movements. We demonstrate our two-level obstacle avoidance in simulation. The results show that our method reduces the number of safety stops one would encounter when using only the formal safety verification, and synthesizes alternative movement plans that preserves the coordination observed in the …", "num_citations": "11\n", "authors": ["1806"]}
{"title": "Power systems transient stability analysis via optimal rational Lyapunov functions\n", "abstract": " Transient stability analysis is a traditional yet significant topic in power systems. In order to obtain the stability domain of the post-fault equilibrium point, the Lyapunov method is proven to be effective and efficient once a Lyapunov function has been found. The main innovation of this paper consists in the use of rational Lyapunov functions to compute the largest estimate of the Region of Attraction (ROA) of an equilibrium point for power systems. Firstly, the non-polynomial power systems are reconstructed to uncertain differential algebraic systems via the multi-variate truncated Taylor expansion. An iteration procedure is proposed to compute the largest estimate of the ROA by exploiting the Sum of Squares (SOS) technique and the Squared Matrix Representation (SMR). A classical power system with transfer conductances is studied to demonstrate the effectiveness of the proposed approach.", "num_citations": "11\n", "authors": ["1806"]}
{"title": "CommonRoad drivability checker: Simplifying the development and validation of motion planning algorithms\n", "abstract": " Collision avoidance, kinematic feasibility, and road-compliance must be validated to ensure the drivability of planned motions for autonomous vehicles. Although these tasks are highly repetitive, computationally efficient toolboxes are still unavailable. The CommonRoad Drivability Checker—an open-source toolbox—unifies these mentioned checks. It is compatible with the CommonRoad benchmark suite, which additionally facilitates the development of motion planners. Our toolbox drastically reduces the effort of developing and validating motion planning algorithms. Numerical experiments show that our toolbox is real-time capable and can be used in real test vehicles.", "num_citations": "10\n", "authors": ["1806"]}
{"title": "Reachset conformance of forward dynamic models for the formal analysis of robots\n", "abstract": " Model-based design of robotic systems has many advantages, among them faster development cycles and reduced costs due to early detections of design flaws. Approximate models are sufficient for many classical robotic applications; however, they no longer suffice for safety-critical applications. For instance, a dangerous situation which has not been detected by model-based testing might occur in a human-robot co-existence scenario since models do not exactly replicate behaviors of real systems-this problem arises no matter how accurate a model is, since even disturbances and sensor noise can cause a mismatch. We address this issue by adding non-determinism to robotic models and by computing the whole set of possible behaviors using reachability analysis. By using reachset conformance, we automatically adjust the required non-determinism so that all recorded behaviors are captured. For the first time …", "num_citations": "10\n", "authors": ["1806"]}
{"title": "Formal LPV control for transient stability of power systems\n", "abstract": " Transient stability analysis of synchronous generators is important for a secure operation of power systems. This paper presents the design and verification of linear-parameter-varying (LPV) controllers to robustly establish transient stability of multi-machine power systems with formal guarantees. First, we transform power systems described by differential algebraic equations (DAEs) into modular LPV systems, such that the interaction and correlation between different machines connected to the grid is preserved. Then, we employ reachability analysis to determine the set of admissible parameter values which is required for the LPV controller synthesis. Afterwards, reachability analysis is also used to formally guarantee that the synthesized controller encloses the time-varying parameters within chosen parameter ranges during transients. Both tasks are solved simultaneously in a systematic fashion. The method is …", "num_citations": "10\n", "authors": ["1806"]}
{"title": "Robust control of continuum robots using interval arithmetic\n", "abstract": " We consider the problem of controlling pneumatically actuated continuum robots with uncertain system dynamics and input disturbance. While such systems are intrinsically structurally safe due to soft and light-weight components, their structural flexibility challenges the control stability and performance. We present a robust tracking control approach using interval arithmetic. With this approach a user defined tracking performance can be ultimately met without the need for empirical estimation of bounds of perturbations from model uncertainty and input disturbances. We show the validity of our approach by simulating scenarios with different parametric uncertainty and by comparing the performance with an existing inverse-dynamics controller.", "num_citations": "10\n", "authors": ["1806"]}
{"title": "Distributed set-based observers using diffusion strategy\n", "abstract": " Distributed estimation is more robust against single points of failure and requires less communication overhead compared to the centralized version. Among distributed estimation techniques, set-based estimation has gained much attention as it provides estimation guarantees for safety-critical applications and copes with unknown but bounded uncertainties. We propose two distributed set-based observers using interval-based and set-membership approaches for a linear discrete-time dynamical system with bounded modeling and measurement uncertainties. Both algorithms utilize a new over-approximating zonotopes intersection step named the set-based diffusion step. We use the term diffusion since our intersection of zonotopes formula resembles the traditional diffusion step in the stochastic Kalman filter. Our new zonotopes intersection takes linear time. Our set-based diffusion step decreases the estimation errors and the size of estimated sets and can be seen as a lightweight approach to achieve partial consensus between the distributed estimated sets. Every node shares its measurement with its neighbor in the measurement update step. The neighbors intersect their estimated sets constituting our proposed set-based diffusion step. We represent sets as zonotopes since they compactly represent high-dimensional sets, and they are closed under linear mapping and Minkowski addition. The applicability of our algorithms is demonstrated by a localization example. All used data and code to recreate our findings are publicly available", "num_citations": "9\n", "authors": ["1806"]}
{"title": "ARCH-COMP19 category report: Continuous and hybrid systems with nonlinear dynamics\n", "abstract": " We present the results of a friendly competition for formal verification of continuous and hybrid systems with nonlinear continuous dynamics. The friendly competition took place as part of the workshop Applied Verification for Continuous and Hybrid Systems (ARCH) in 2019. In this year, 6 tools Ariadne, CORA, DynIbex, Flow*, Isabelle/HOL, and JuliaReach (in alphabetic order) participated. They are applied to solve reachability analysis problems on four benchmark problems, one of them with hybrid dynamics. We do not rank the tools based on the results, but show the current status and discover the potential advantages of different tools.", "num_citations": "9\n", "authors": ["1806"]}
{"title": "ARCH-COMP18 Category Report: Continuous and Hybrid Systems with Linear Continuous Dynamics\n", "abstract": " This report presents the results of a friendly competition for formal verification of continuous and hybrid systems with linear continuous dynamics. The friendly competition took place as part of the workshop Applied Verification for Continuous and Hybrid Systems (ARCH) in 2018. In its second edition, 9 tools have been applied to solve six different benchmark problems in the category for linear continuous dynamics (in alphabetical order): CORA, CORA/SX, C2E2, Flow*, HyDRA, Hylaa, Hylaa-Continuous, JuliaReach, SpaceEx, and XSpeed. This report is a snapshot of the current landscape of tools and the types of benchmarks they are particularly suited for. Due to the diversity of problems, we are not ranking tools, yet the presented results probably provide the most complete assessment of tools for the safety verification of continuous and hybrid systems with linear continuous dynamics up to this date.", "num_citations": "9\n", "authors": ["1806"]}
{"title": "Online verification of multiple safety criteria for a robot trajectory\n", "abstract": " Ensuring the safety of humans in a collaborative environment with industrial robots is a major concern of human-robot co-working. Most current approaches give no formal guarantee of safety; where such guarantees are given, accounting for the unpredictability of the human may limit robot efficiency. We therefore developed a novel trajectory planner for a robot arm, which formally guarantees the safety of humans from collision with the robot for every possible human behaviour, without restricting the robot more than necessary. To achieve this, the trajectory planner verifies online that the robot adheres to two separate safety criteria derived from ISO standards using reachable occupancies of surrounding humans and the robot. While one criterion anticipates all possible movements of the human and provides a reasonable safety guarantee, the other criterion additionally guarantees strict safety as long as the human …", "num_citations": "9\n", "authors": ["1806"]}
{"title": "Efficient computation of interval-arithmetic-based robust controllers for rigid robots\n", "abstract": " We propose a method for efficient numerical computation of interval-arithmetic-based robust controllers for rigid robot manipulators. The use of interval arithmetic for robust control is the core of a recently proposed approach which allows a user-defined tracking performance to be ultimately met despite uncertain models and input disturbance, without requiring an empirical estimation of bounds of perturbations from uncertain system dynamics. Our proposed algorithm combines a modified recursive Newton-Euler scheme with interval arithmetic computations to automatically obtain formally guaranteed over-approximative estimations of perturbing torques/forces arising from imperfect knowledge of dynamic model parameters. The resulting algorithm has linear computational complexity and can be used online. We validate the applicability of our proposed method with simulations and tests on a commercially available …", "num_citations": "9\n", "authors": ["1806"]}
{"title": "On time-memory trade-off for collision detection\n", "abstract": " Future collision avoidance systems, which are capable of fully controlling the vehicle, have to make critical decisions in a very short time. To do this, they need to check constantly if their own vehicle's occupancy collides with the other traffic participants' occupancy. Those collision checks consume a substantial amount of time and consequently, the collision avoidance systems could fail to intervene in complex scenarios. We propose a new approach to reduce the computation time for collision checks significantly. Instead of using geometric methods, we store finitely many possible collision scenarios between two objects in a table and thus collision checks become a matter of lookup table queries. To ensure that the finite number of configurations cover all possible scenarios, we use a novel abstraction technique which guarantees that every collision will be detected. The approach works for arbitrarily many traffic …", "num_citations": "9\n", "authors": ["1806"]}
{"title": "Fail-safe motion planning for online verification of autonomous vehicles using convex optimization\n", "abstract": " Safe motion planning for autonomous vehicles is a challenging task, since the exact future motion of other traffic participant is usually unknown. In this article, we present a verification technique ensuring that autonomous vehicles do not cause collisions by using fail-safe trajectories. Fail-safe trajectories are executed if the intended motion of the autonomous vehicle causes a safety-critical situation. Our verification technique is real-time capable and operates under the premise that intended trajectories are only executed if they have been verified as safe. The benefits of our proposed approach are demonstrated in different scenarios on an actual vehicle. Moreover, we present the first in-depth analysis of our verification technique used in dense urban traffic. Our results indicate that fail-safe motion planning has the potential to drastically reduce accidents while not resulting in overly conservative behaviors of the …", "num_citations": "8\n", "authors": ["1806"]}
{"title": "Provably-correct and comfortable adaptive cruise control\n", "abstract": " Adaptive cruise control is one of the most common comfort features of road vehicles. Despite its large market penetration, current systems are not safe in all driving conditions and require supervision by human drivers. While several previous works have proposed solutions for safe adaptive cruise control, none of these works considers comfort, especially in the event of cut-ins. We provide a novel solution that simultaneously meets our specifications and provides comfort in all driving conditions, including cut-ins. This is achieved by an exchangeable nominal controller ensuring comfort, combined with a provably correct fail-safe controller that gradually engages an emergency maneuver-this ensures comfort, since most threats are already cleared before emergency braking is fully activated. As a consequence, one can easily exchange the nominal controller without having to have the overall system safety re-certified …", "num_citations": "8\n", "authors": ["1806"]}
{"title": "Reachability analysis for hybrid systems with nonlinear guard sets\n", "abstract": " Reachability analysis is one of the most important methods for formal verification of hybrid systems. The main difficulty for hybrid system reachability analysis is to calculate the intersection between reachable set and guard sets. While there exist several approaches for guard sets defined by hyperplanes or polytopes, only few methods are able to handle nonlinear guard sets. In this work we present a novel approach to tightly enclose the intersections of reachable sets with nonlinear guard sets. One major advantage of our method is its polynomial complexity with respect to the system dimension, which makes it applicable for high-dimensional systems. Furthermore, our approach can be combined with different reachability algorithms for continuous systems due to its modular design. We demonstrate the advantages of our novel approach compared to existing methods with numerical examples.", "num_citations": "8\n", "authors": ["1806"]}
{"title": "Enhancing motion safety by identifying safety-critical passageways\n", "abstract": " Safety is the most important aspect of systems which have to perform collision-free motions in dynamic environments. Formal verification methods, such as reachability analysis, are capable of guaranteeing safety for a given model and given assumptions (e. g. bounded velocity and acceleration). However, certain assumptions can be violated by dynamic obstacles during the execution of the verified motion plan, exposing the system to potential collisions. To compensate for the invalidated verification, this paper introduces the Point of No Return (PNR) and the Point of Guaranteed Arrival (PGA) by incorporating invariably safe sets. These concepts allow one to divide the planned trajectory into safe sections and safety-critical passageways. For the former, we are able to provide safety guarantees for an infinite time horizon. For the latter, we present a method to minimize such safety-critical passageways prior to …", "num_citations": "8\n", "authors": ["1806"]}
{"title": "Combined inverse-dynamics/passivity-based control for robots with elastic joints\n", "abstract": " We consider the global tracking control problem of robots with elastic joints. Even if joint elasticity introduces beneficial features for modern applications which require physically resilient and safer robots that can interact with the environment or humans, it challenges the achievable control performance. We propose a novel controller which combines the benefits of two approaches: the intrinsic robustness to model uncertainty from passivity-based control and the implementation efficiency of inverse-dynamics control schemes using a modern recursive algorithm. The novel controller is applied to an elastic-joint reconfigurable robotic arm using a recently proposed framework for on-the-fly control design. Simulation and experimental results validate our proposed approach.", "num_citations": "8\n", "authors": ["1806"]}
{"title": "ARCH-COMP17 category report: Continuous systems with nonlinear dynamics\n", "abstract": " We present the results of a friendly competition for formal verification of continuous and hybrid systems with nonlinear continuous dynamics. The friendly competition took place as part of the workshop Applied Verification for Continuous and Hybrid Systems (ARCH) in 2017. This year, three tools CORA, Flow* and Isabelle/HOL (in alphabetic order) participated. They are applied to solve the reachability analysis problems on three benchmarks which have 2, 7 and 12 variables respectively. We do not rank the tools based on the results, but show the current status and discover the potential advantages of different tools. Besides, the computational settings presented here provide a guide to use the tools although they might not be optimal.", "num_citations": "8\n", "authors": ["1806"]}
{"title": "Ultimate robust performance control of rigid robot manipulators using interval arithmetic\n", "abstract": " We propose a new method for controlling rigid robot manipulators guaranteeing that a user-defined tracking performance is ultimately met while facing uncertain system dynamics and input disturbance. Our control approach is based on the passivity-based control technique and eliminates the limitations of existing methods (e.g. impractical tuning to avoid chattering and difficult estimation of uncertainty bounds of disturbances) through the use of interval arithmetic. Our controller guarantees to meet the tracking performance when considering input disturbance with unknown bounds. Additionally, our approach can be used for on-the-fly controller synthesis, which makes it especially appealing for robust control of modular and reconfigurable robot manipulators. Finally, we present simulation results and a comparison with the r-α tracking controller that shows the superior performance of our proposed method when …", "num_citations": "8\n", "authors": ["1806"]}
{"title": "Closed-form expressions of convex combinations\n", "abstract": " In this paper, the computation of closed-form convex combinations is considered. In many control tasks, convex combinations play a crucial role, thus requiring an efficient computation. This is the case for online control of fast dynamical systems, in which the control algorithms rely on convex combinations, for example robust control of linear parameter-varying systems. On the other hand, for formal verification, it is necessary that the closed-loop behavior can be expressed in closed-form, which is not possible if the convex combination is expressed as constraints. In this paper, we provide closed-form expressions for any kind of polytope with finitely many extreme points. For special types of polytopes, such as simplices and parallelotopes, we provide especially efficient, analytical closed-form expressions. Numerical experiments show that the closed-form expressions are significantly faster in all randomly-generated …", "num_citations": "8\n", "authors": ["1806"]}
{"title": "Scenario factory: Creating safety-critical traffic scenarios for automated vehicles\n", "abstract": " The safety validation of motion planning algorithms for automated vehicles requires a large amount of data for virtual testing. Currently, this data is often collected through real test drives, which is expensive and inefficient, given that only a minority of traffic scenarios pose challenges to motion planners. We present a workflow for generating a database of challenging and safety-critical test scenarios that is not dependent on recorded data. First, we extract a large variety of road networks across the globe from OpenStreetMap. Subsequently, we generate traffic scenarios for these road networks using the traffic simulator SUMO. In the last step, we increase the criticality of these scenarios using nonlinear optimization. Our generated scenarios are publicly available on the CommonRoad website.", "num_citations": "7\n", "authors": ["1806"]}
{"title": "Optimizing performance in automation through modular robots\n", "abstract": " Flexible manufacturing and automation require robots that can be adapted to changing tasks. We propose to use modular robots that are customized from given modules for a specific task. This work presents an algorithm for proposing a module composition that is optimal with respect to performance metrics such as cycle time and energy efficiency, while considering kinematic, dynamic, and obstacle constraints. Tasks are defined as trajectories in Cartesian space, as a list of poses for the robot to reach as fast as possible, or as dexterity in a desired workspace. In a simulated comparison with commercially available industrial robots, we demonstrate the superiority of our approach in randomly generated tasks with respect to the chosen performance metrics. We use our modular robot proModular.1 for the comparison.", "num_citations": "7\n", "authors": ["1806"]}
{"title": "Establishing reachset conformance for the formal analysis of analog circuits\n", "abstract": " We present the first work on the automated generation of reachset conformant models for analog circuits. Our approach applies reachset conformant synthesis to add nondeterminism to piecewise-linear circuit models so that they enclose all recorded behaviors of the real system. To achieve this, we present a novel technique to compute the required nondeterminism for the piecewise-linear models. The effectiveness of our approach is demonstrated on a real analog circuit. Since the resulting models enclose all measurements, they can be used for formal verification.", "num_citations": "7\n", "authors": ["1806"]}
{"title": "Risk-aware motion planning for automated vehicle among human-driven cars\n", "abstract": " We consider the maneuver planning problem for automated vehicles when they share the road with human-driven cars and interact with each other using a finite set of maneuvers. Each maneuver is calculated considering input constraints, actuator disturbances and sensor noise, so that we can use a maneuver automaton to perform higher-level planning that is robust against lower-level effects. In order to model the behavior of human-driven cars in response to the intent of the automated vehicle, we use control improvisation to build a probabilistic model. To accommodate for potential mismatches between the learned human model and human driving behaviors, we use a conditional value-at-risk objective function to obtain the optimal policy for the automated vehicle. We demonstrate through simulations that our motion planning framework consisting of an interactive human driving model and risk-aware motion …", "num_citations": "7\n", "authors": ["1806"]}
{"title": "Interval-arithmetic-based trajectory scaling and collision detection for robots with uncertain dynamics\n", "abstract": " We consider two fundamental problems in control of robot manipulators: dynamic scaling of trajectories and collision detection using proprioceptive sensors. While most existing methods approach these problems by assuming accurate knowledge of the robot dynamics, we relax this assumption and account for uncertain model parameters and external disturbances. Our approach is based on the use of a recently proposed interval-arithmetic-based recursive Newton-Euler algorithm. This algorithm enables the efficient numerical computation of over-approximative sets of torques/forces arising from uncertain model parameters. The over-approximative nature of these sets is exploited in this work in order to provide a formally robust trajectory scaling and collision detection strategy. The effectiveness of the proposed approaches has been verified by means of experiments on a 6 degrees-of-freedom robot manipulator …", "num_citations": "7\n", "authors": ["1806"]}
{"title": "Calculating human reachable occupancy for guaranteed collision-free planning\n", "abstract": " We address the problem of overapproximative short-term prediction of arm movement, for safe human-robot co-existence. A trajectory planner for a robot manipulator which formally verifies non-collision requires fast prediction of human future occupancy, which must be accurate yet still account for all possible human movement. This work presents two approaches to this: a novel, simple approach calculated directly in task space, and another approach using a kinematic model of the human based on the authors' previous work. We compare both approaches in an experimental setup with a robot manipulator. To the best of our knowledge, this is the first implementation and comparison of approaches to formally verified trajectory planning in human-robot co-working. We find that the novel approach has advantages in terms of ease and speed of computation and tightness at short time horizons and is more intuitive to …", "num_citations": "7\n", "authors": ["1806"]}
{"title": "On estimating the Robust Domain of Attraction for uncertain non-polynomial systems: An LMI approach\n", "abstract": " An increasingly important issue in the area of uncertain systems is the estimation of the Robust Domain of Attraction (RDA). Though this topic is of great interest, most of attention has been paid to the RDA for uncertain polynomial systems. This paper considers the RDA for rational polynomial systems and non-polynomial systems, both with parametric uncertainties, which are constrained in a semialgebraic set. The main underlying idea is to reformulate the original system to an uncertain rational polynomial system by using the truncated Taylor expansion and the parameterizable remainder of non-polynomial functions. A novel way to compute the largest estimate of the RDA is proposed by using a given rational Lyapunov function and the squared matrix representation technique (SMR). Lastly, the benefits of this approach are presented by a numerical example.", "num_citations": "7\n", "authors": ["1806"]}
{"title": "On enlarging backward reachable sets via zonotopic set membership\n", "abstract": " While a number of efficient methods have been proposed for approximating backward reachable sets, no synthesis method via backward reachable sets has been developed for estimating and enlarging the region of attraction (RA). This paper shows how to use backward reachable sets to enlarge the estimate of the RA of linear discrete-time systems, by using an optimal static feedback controller. Two controller design methods are provided: the first method enlarges the estimate of the RA via invariant sets, whose existence is ensured by zonotope containment; the second method provides the optimal control input by using Lyapunov stability and quadratic stabilization. The backward reachable set is represented by zonotopes which give a good compromise between accuracy and efficiency. The effectiveness of both methods is illustrated by a numerical example.", "num_citations": "7\n", "authors": ["1806"]}
{"title": "Arch-comp20 category report: Continuous and hybrid systems with nonlinear dynamics\n", "abstract": " We present the results of a friendly competition for formal verification of continuous and hybrid systems with nonlinear continuous dynamics. The friendly competition took place as part of the workshop Applied Verification for Continuous and Hybrid Systems (ARCH) in 2020. This year, 6 tools Ariadne, CORA, DynIbex, Flow*, Isabelle/HOL, and JuliaReach (in alphabetic order) participated. These tools are applied to solve reachability analysis problems on six benchmark problems, two of them featuring hybrid dynamics. We do not rank the tools based on the results, but show the current status and discover the potential advantages of different tools.", "num_citations": "6\n", "authors": ["1806"]}
{"title": "Constrained polynomial zonotopes\n", "abstract": " We introduce constrained polynomial zonotopes, a novel non-convex set representation that is closed under linear map, Minkowski sum, Cartesian product, convex hull, intersection, union, and quadratic as well as higher-order maps. We show that the computational complexity of the above-mentioned set operations for constrained polynomial zonotopes is at most polynomial in the representation size. The fact that constrained polynomial zonotopes are generalizations of zonotopes, polytopes, polynomial zonotopes, Taylor models, and ellipsoids, further substantiates the relevance of this new set representation. The conversion from other set representations to constrained polynomial zonotopes is at most polynomial with respect to the dimension.", "num_citations": "6\n", "authors": ["1806"]}
{"title": "Representation of polytopes as polynomial zonotopes\n", "abstract": " We prove that each bounded polytope can be represented as a polynomial zonotope, which we refer to as the Z-representation of polytopes. Previous representations are the vertex representation (V-representation) and the halfspace representation (H-representation). Depending on the polytope, the Z-representation can be more compact than the V-representation and the H-representation. In addition, the Z-representation enables the computation of linear maps, Minkowski addition, and convex hull with a computational complexity that is polynomial in the representation size. The usefulness of the new representation is demonstrated by range bounding within polytopes.", "num_citations": "6\n", "authors": ["1806"]}
{"title": "Cost-optimal composition synthesis for modular robots\n", "abstract": " The ongoing trend of increasing product individualization requires more flexible solutions in production systems. Modular robots address this demand since they can be assembled in different ways from a given set of modules. One of the reasons why modular robots are not yet successfully introduced in the market is that it is not clear how to assemble modules such that the robot will be able to achieve a specific task optimally, especially in the presence of obstacles. This problem is challenging since a huge combination of possible assemblies exists and one has to find the optimal trajectory for each of them. We address exactly this issue not by finding optimal solutions for each assembly, but instead pruning the search space: First, we remove assemblies that cannot achieve the task before starting the process of finding optimal trajectories. Second, we exploit the iterative nature of numerical optimization routines by …", "num_citations": "6\n", "authors": ["1806"]}
{"title": "Erreichbarkeitsanalyse von Verkehrsteilnehmern zur Verbesserung von Fahrerassistenzsystemen\n", "abstract": " Das übergeordnete Ziel aktiver Fahrzeugsicherheitssysteme besteht in der Minimierung des Personenschadens in kritischen Verkehrssituationen. Damit zukünftige Fahrerassistenzsysteme in komplexen Verkehrssituationen eine sichere Fahrstrategie wählen können, wird ein Verfahren zu deren Sicherheitsbewertung vorgestellt. Der Ansatz basiert auf der Bestimmung der Erreichbarkeitsmengen von Verkehrsteilnehmern. Im Kontext der Sicherheitsbewertung von Verkehrssituationen werden Erreichbarkeitsmengen als Straßenbereiche verstanden, die ein Fahrzeug möglicherweise erreichen kann. Neben den Erreichbarkeitsmengen werden zusätzlich die Aufenthaltswahrscheinlichkeiten innerhalb der Erreichbarkeitsmengen bestimmt, so dass eine Bewertung von Fahrstrategien auf Grundlage der Unfallwahrscheinlichkeit erfolgen kann.", "num_citations": "6\n", "authors": ["1806"]}
{"title": "Set-based control for disturbed piecewise affine systems with state and actuation constraints\n", "abstract": " We address the finite horizon control of a discrete time piecewise affine (PWA) system, which is affected by an additive bounded disturbance. The goal is to robustly drive the state of the system to some target region, while satisfying state and actuation constraints. This problem is challenging due to the mixed discrete and continuous dynamics, requiring the exploration of many mode sequences. We address this problem by proposing a two-step approach which is based on designing a reference trajectory followed by a feedback controller that tries to make all solutions adhere to the reference mode sequence. As a result, the number of considered mode sequences can be drastically reduced. Termination is guaranteed since the time horizon and the number of modes are finite. Key to the computational efficiency of this procedure is the choice of the reference trajectory, which should be designed to avoid the …", "num_citations": "5\n", "authors": ["1806"]}
{"title": "Utilizing dependencies to obtain subsets of reachable sets\n", "abstract": " Reachability analysis, in general, is a fundamental method that supports formally-correct synthesis, robust model predictive control, set-based observers, fault detection, invariant computation, and conformance checking, to name but a few. In many of these applications, one requires to compute a reachable set starting within a previously computed reachable set. While it was previously required to re-compute the entire reachable set, we demonstrate that one can leverage the dependencies of states within the previously computed set. As a result, we almost instantly obtain an over-approximative subset of a previously computed reachable set by evaluating analytical maps. The advantages of our novel method are demonstrated for falsification of systems, optimization over reachable sets, and synthesizing safe maneuver automata. In all of these applications, the computation time is reduced significantly.", "num_citations": "5\n", "authors": ["1806"]}
{"title": "Model-based offline vehicle tracking in automotive applications using a precise 3D model\n", "abstract": " Object tracking aims at estimating the state of moving objects based on remote measurements. To evaluate online algorithms in automotive systems, ground truth data must be acquired, which is a time-consuming and expensive approach. We propose a novel offline approach to generate ground truth data from existing sensor measurements using CAD models. In our approach, we provide error bounds for the localization of the objects based on the measurement noise of a single laser beam and the sensitivity of the point cloud registration. To estimate accurate kinematic states of the vehicle, we apply an extended Rauch-Tung-Striebel smoother on the stored measurements. In experiments with real sensor data, we demonstrate that the performance of the proposed approach is superior to DGPS within the near range.", "num_citations": "5\n", "authors": ["1806"]}
{"title": "Hierarchical path planner using workspace decomposition and parallel task-space rrts\n", "abstract": " This paper presents a hierarchical path planner consisting of two stages: a global planner that uses workspace information to create collision-free paths for the robot end-effector to follow, and multiple local planners running in parallel that verify the paths in the configuration space by expanding a task-space rapidly-exploring random tree (RRT). We demonstrate the practicality of our approach by comparing it with state-of-the-art planners in several challenging path planning problems. While using a single tree, our planner outperforms other single tree approaches in task-space or configuration space (C-space), while its performance and robustness are comparable to or better than that of parallelized bidirectional C-space planners.", "num_citations": "5\n", "authors": ["1806"]}
{"title": "Negotiation of drivable areas of cooperative vehicles for conflict resolution\n", "abstract": " We address the problem of cooperative conflict resolution for multi-vehicle motion planning in mixed-traffic scenarios, where automated and manually-driven vehicles co-exist. We propose a novel solution based on reachability analysis, which provides the drivable area of each collaborative traffic participant. Overlapping drivable areas are redistributed so that each traffic participant receives an individual area for motion planning. We do not stipulate a specific method for predicting the future motion of non-communicating traffic participants. Furthermore, uncertainties in the initial states of the cooperative vehicles, e.g. due to sensor noise, can be easily integrated. A byproduct of our approach is that collaborative groups can be automatically found by identifying conflicting drivable areas; if no conflict exists, collaboration becomes unnecessary. We demonstrate the redistribution of drivable areas with two numerical …", "num_citations": "5\n", "authors": ["1806"]}
{"title": "Nonlinear modeling and control design of active helicopter blades\n", "abstract": " The paper presents the theoretical basis for the simulation of active helicopter blades. The analysis of active helicopter blades is based on models for the structure, aerodynamics, actuation and sensing. For simulation and analysis purposes, the blade structural model is discretized in space using a Galerkin approach. The effect of the integral actuation enters the beam model via an active beam cross-sectional analysis. A 2-D incompressible, inviscid, quasi-steady aerodynamic model is coupled to the active structural model. The resulting nonlinear model of high order is reduced using the aeroelastic modes of the blade. Finally, a nonlinear controller is obtained by cancelling the nonlinearities and applying an energy optimal LQR design to the resulting linear plant.", "num_citations": "5\n", "authors": ["1806"]}
{"title": "Computing Non-Convex Inner-Approximations of Reachable Sets for Nonlinear Continuous Systems\n", "abstract": " We present a novel approach to compute non-convex inner-approximations of reachable sets for nonlinear continuous systems. The concept of our approach is to extract inner-approximations of reachable sets from pre-computed outer-approximations, which makes our method computationally very efficient as we demonstrate with several numerical examples. Since our approach has polynomial complexity with respect to the system dimension, it is well-suited for high-dimensional systems.", "num_citations": "4\n", "authors": ["1806"]}
{"title": "Falsification-Based Robust Adversarial Reinforcement Learning\n", "abstract": " Reinforcement learning (RL) has achieved enormous progress in solving various sequential decision-making problems, such as control tasks in robotics. Since policies are overfitted to training environments, RL methods have often failed to be generalized to safety-critical test scenarios. Robust adversarial RL (RARL) was previously proposed to train an adversarial network that applies disturbances to a system, which improves the robustness in test scenarios. However, an issue of neural network-based adversaries is that integrating system requirements without handcrafting sophisticated reward signals are difficult. Safety falsification methods allow one to find a set of initial conditions and an input sequence, such that the system violates a given property formulated in temporal logic. In this paper, we propose falsification-based RARL (FRARL): this is the first generic framework for integrating temporal logic …", "num_citations": "4\n", "authors": ["1806"]}
{"title": "Arch-comp20 category report: continuous and hybrid systems with linear continuous dynamics\n", "abstract": " We present the results of the ARCH 1 2020 friendly competition for formal verification of continuous and hybrid systems with linear continuous dynamics. In its fourth edition, eight tools have been applied to solve eight different benchmark problems in the category for linear continuous dynamics (in alphabetical order): CORA, C2E2, HyDRA, Hylaa, Hylaa-Continuous, JuliaReach, SpaceEx, and XSpeed. This report is a snapshot of the current landscape of tools and the types of benchmarks they are particularly suited for. Due to the diversity of problems, we are not ranking tools, yet the presented results provide one of the most complete assessments of tools for the safety verification of continuous and hybrid systems with linear continuous dynamics up to this date.", "num_citations": "4\n", "authors": ["1806"]}
{"title": "A multi-step approach to accelerate the computation of reachable sets for road vehicles\n", "abstract": " We propose an approach for the fast computation of reachable sets of road vehicles while considering dynamic obstacles. The obtained reachable sets contain all possible behaviors of vehicles and can be used for motion planning, verification, and criticality assessment. The proposed approach precomputes computationally expensive parts of the reachability analysis. Further, we partition the reachable set into cells and construct a directed graph storing which cells are reachable from which cells at preceding time steps. Using this approach, considering obstacles reduces to deleting nodes from the directed graph. Although this simple idea ensures an efficient computation, the discretization can introduce considerable over-approximations. Thus, the main novelty of this paper is to reduce the over-approximations by intersecting reachable sets propagated from multiple points in time. We demonstrate our approach …", "num_citations": "4\n", "authors": ["1806"]}
{"title": "Optimizing Sets of Solutions for Controlling Constrained Nonlinear Systems\n", "abstract": " In this article, we present a novel control approach for formally solving reach-avoid problems for constrained and disturbed nonlinear systems by optimizing over reachable sets. Reach-avoid problems arise in many modern control applications of safety-critical systems, such as autonomous driving and human-robot collaboration. They require us to control all states from a set of initial states in finite time into a final set while guaranteeing the satisfaction of state and input constraints despite the presence of disturbances and uncertain measurements. We optimize over reachable sets, thereby, simultaneously improving the control performance and guaranteeing constraint satisfaction for all solutions. Moreover, our new approach involves a novel combination of state-dependent feedforward and feedback control, which leads to better control performance compared to the existing approaches as demonstrated in several …", "num_citations": "4\n", "authors": ["1806"]}
{"title": "Event-Triggered Diffusion Kalman Filters\n", "abstract": " Distributed state estimation strongly depends on collaborative signal processing, which often requires excessive communication and computation to be executed on resource-constrained sensor nodes. To address this problem, we propose an event-triggered diffusion Kalman filter, which collects measurements and exchanges messages between nodes based on a local signal indicating the estimation error. On this basis, we develop an energy-aware state estimation algorithm that regulates the resource consumption in wireless networks and ensures the effectiveness of every consumed resource. The proposed algorithm does not require the nodes to share its local covariance matrices, and thereby allows considerably reducing the number of transmission messages. To confirm its efficiency, we apply the proposed algorithm to the distributed simultaneous localization and time synchronization problem and evaluate …", "num_citations": "4\n", "authors": ["1806"]}
{"title": "Scalable robust model predictive control for linear sampled-data systems\n", "abstract": " We propose a robust reachable-set-based model predictive control method for constrained linear systems. The systems are described by sampled-data models, where a continuous-time physical plant is controlled by a discrete-time digital controller. Thus, the state measurement and the control input are only updated at discrete sampling times, while the constraint satisfaction must be guaranteed not only at, but also between two consecutive time steps. By considering the computation time and using scalable reachability analysis and convex optimization tools, we compute real-time controllers that ensure constraint satisfaction for an infinite time horizon. We demonstrate the applicability of our proposed method using a vehicle platooning benchmark.", "num_citations": "4\n", "authors": ["1806"]}
{"title": "Ensuring motion safety of autonomous vehicles through online fail-safe verification\n", "abstract": " Safety is undoubtedly the most important factor for the success of autonomous vehicles [13]. However, ensuring their safety is a challenging task since they operate in highly uncertain environments with multiple dynamic obstacles whose future motions are unknown [25, 24]. Even when trying to accurately predict and consider the most likely trajectory of obstacles, planned motions might become unsafe when obstacles deviate from the prediction, which regularly happens in real traffic. As a result of the arising uncertainties, most motion planning methods cannot exclude the possibility that the autonomous vehicle causes a collision. For instance, a residual risk of 0.1% per journey can imply one collision in 1,000 journeys. In order to solve safe motion planning, novel approaches need to be developed which 1) provably guarantee safety even if obstacles suddenly deviate from the predicted behavior and 2) are able to cope with any new occurring traffic situation and measurement uncertainties on the fly.II. RELATED WORK Many planning approaches compute trajectories which are collision-free against the predicted most likely trajectories of obstacles within the planning horizon of typically 5s to 12 s [26, 27, 10]. In safety-critical situations, the approaches in [1, 6] plan evasive trajectories while accounting for likely collisions with obstacles. However, when only predicting single behaviors, the safety of planned trajectories only holds if all obstacles do not deviate from this behavior. One way to guarantee the safety of the autonomous vehicle is logical reasoning. Here, planned motions are checked whether they comply with certain rules and axioms, eg …", "num_citations": "4\n", "authors": ["1806"]}
{"title": "Evaluating location compliance approaches for automated road vehicles\n", "abstract": " This work presents techniques for efficiently checking location compliance of automated road vehicles. We refer to location compliance as an allowed translational and rotational positioning of a vehicle on a road network, i.e., the vehicle does not enter forbidden lanes or regions reserved for other traffic participants, such as bike lanes or dedicated bus routes. Previous work has mostly focused on efficient collision detection between traffic participants and static obstacles represented as bounded sets. We formulate location compliance as a set enclosure problem, which cannot be solved directly with collision detection; thus, different algorithms from computational geometry have to be applied. We present polygon enclosure and boundary mesh generation approaches and evaluate them using existing road geometries from the CommonRoad database. For a fair comparison, we generate thousands of random …", "num_citations": "4\n", "authors": ["1806"]}
{"title": "Reachset conformance testing of human arms with a biomechanical model\n", "abstract": " Guaranteeing safety in human-robot co-existence often requires a prediction of the volume that could be occupied by the human up to a future time, in order to avoid collisions. Such predictions should be simple and fast for real-time calculation and collision-checking, but account even for unexpected movement. We use a complex biomechanical model to search for extreme human movement, to validate such a prediction. Since the model has a large input space and highly nonlinear dynamics, we use an exploration algorithm based on RRTs to efficiently find the extreme movements. We find that the simple prediction encloses all arm positions found by the exploration algorithm, except where the biomechanical model does not account for collision between body tissue.", "num_citations": "4\n", "authors": ["1806"]}
{"title": "Determining the maximum time horizon for vehicles to safely follow a trajectory\n", "abstract": " Dealing with the unknown future behavior of other traffic participants is one of the main challenges when generating safe trajectories for autonomous vehicles. When the ego vehicle (i.e., the vehicle to be controlled) follows a given trajectory, an emergency maneuver should be kept available for all times in order to avoid collisions. However, generating an emergency maneuver for each time step is computationally expensive and often not required. In this paper, we propose an algorithm for determining the maximum time horizon under which the ego vehicle can safely follow a given trajectory. First, an upper and a lower bound of this time horizon are computed. Then, binary search is used to find the maximum time horizon for which safety is still guaranteed. Our algorithm reduces the frequency of generating emergency maneuvers while still guaranteeing collision-free trajectories. The approach is tested on real traffic …", "num_citations": "4\n", "authors": ["1806"]}
{"title": "Should collision avoidance systems use yaw stabilization?\n", "abstract": " Due to historical reasons or system development aspects, many high-level control tasks in vehicles are performed by underlying low-level controllers. This separation of concerns provides reliable systems, but potentially degrades the performance compared to centralized control. Performance losses are acceptable for most control tasks, but for collision avoidance systems one should not compromise on safety. We investigate the performance loss for collision avoidance systems when an underlying yaw stabilization controller is used, which can be found in many modern vehicles under various product names, such as electronic stability control (ESC). Since electronic stability control differs from vehicle to vehicle, we use an idealized controller that performs better than or equally well as an actual realization. It is shown that central control concepts bypassing the yaw stabilization perform better than a hypothetical …", "num_citations": "4\n", "authors": ["1806"]}
{"title": "Sicherheitsbewertung von Fahrstrategien kognitiver Automobile Safety Assessment of Driving Strategies of Cognitive Cars\n", "abstract": " In static environments, safety of planned driving trajectories of (cognitive) autonomous vehicles can be assessed by checking possible collisions with the obstacles to be circumvented. In most road traffic scenarios, this approach is not sufficient, however, as the dynamics of other traffic participants has to be considered. For this purpose, the reachable road areas and the probability distribution of the positions of other traffic participants (under consideration of interaction) are computed in this work. This allows to determine the probability of a collision of the autonomous vehicle with other traffic participants, such that planned driving trajectories of the cognitive vehicle can be assessed with respect to safety.", "num_citations": "4\n", "authors": ["1806"]}
{"title": "On the co-NP-completeness of the zonotope containment problem\n", "abstract": " We introduce a new type of norm for non-degenerate zonotopes to solve the point containment problem, i.e., whether a point lies in a zonotope. With this norm we prove the co-NP-completeness of the zonotope containment problem, i.e., whether a zonotope is contained within another one. We propose novel algorithms to solve the zonotope containment problem exactly in polynomial time when fixing the dimension or the number of generators of either of the two zonotopes. In addition, we propose an optimisation-based algorithm, that is particularly suitable for disproving containment for zonotopes.", "num_citations": "3\n", "authors": ["1806"]}
{"title": "Privacy preserving set-based estimation using partially homomorphic encryption\n", "abstract": " Set-based estimation has gained a lot of attention due to its ability to guarantee state enclosures for safety-critical systems. However, it requires computationally expensive operations, which in turn often requires outsourcing of these operations to cloud-computing platforms. Consequently, this raises some concerns with regard to sharing sensitive information and measurements. This paper presents the first privacy-preserving set-based estimation protocols using partially homomorphic encryption in which we preserve the privacy of the set of all possible estimates and the measurements. We consider a linear discrete-time dynamical system with bounded modeling and measurement uncertainties without any other statistical assumptions. We represent sets by zonotopes and constrained zonotopes as they can compactly represent high-dimensional sets and are closed under linear maps and Minkowski addition. By selectively encrypting some parameters of the used set representations, we are able to intersect sets in the encrypted domain, which enables guaranteed state estimation while ensuring the privacy goals. In particular, we show that our protocols achieve computational privacy using formal cryptographic definitions of computational indistinguishability. We demonstrate the efficiency of our approach by localizing a mobile quadcopter using custom ultra-wideband wireless devices. Our code and data are available online.", "num_citations": "3\n", "authors": ["1806"]}
{"title": "Hierarchical genetic path planner for highly redundant manipulators\n", "abstract": " This paper is concerned with path planning of highly redundant manipulators, which are particularly well suited for flexible manufacturing. We envision that highly redundant manipulators will be composed of a set of standard modules. In order to find the optimal configuration of modules, one has to perform a discrete search on possible assemblies of modules combined with a continuous search of each assembly to verify the feasibility for completing the given task. This requires efficient planning techniques in the workspace since configuration space conversion is too demanding when considering many possible assemblies. For this reason, we propose a hierarchical path planner consisting of a global path planner (GPP) and a local motion planner (LMP). The GPP generates multiple collision-free paths in the workspace by using the free space structuring algorithm MAKLINK. The GPP passes the paths to the LMP, which determines their feasibility. If one path is found to be unfeasible, another one is chosen automatically. Along the path the LMP selects a number of points as intermediate goals and for each goal it solves the inverse kinematics problem. The LMP is based on a genetic algorithm that reuses the population from one intermediate goal to the next. This nonrandom initial population technique significantly reduces the joint angle variations, thereby increasing the probability that a collision-free path exists in the configuration space.", "num_citations": "3\n", "authors": ["1806"]}
{"title": "KogMo-RTDB-Real-time Database for Cognitive Automobiles\n", "abstract": " Documentation - KogMo-RTDB - Real-time Database for Cognitive Automobiles / Realzeitdatenbasis für kognitive Automobile KogMo-RTDB - Real-time Database for Cognitive Automobiles Home Documentation Download Links Contact Technical Documentation Cross-referenced on-line Documentation (autogenerated with doxygen including source browser) KogMo-RTDB: Einführung in die Realzeitdatenbasis für Kognitive Automobile Introduction and how-to for KogMo-RTDB (german). Posters (all in english) A Real-Time-capable Hard- and Software Architecture for Joint Image and Knowledge Processing in Cognitive Automobiles The section Software Architecture includes the KogMo-RTDB, other sections describe the specified real-time system (hard- and software of the reference platform). Interfaces for Integrating Cognitive Functions into Intelligent Vehicles The section Simulation and Logging is KogMo-RTDB …", "num_citations": "3\n", "authors": ["1806"]}
{"title": "Comparison of guaranteed state estimators for linear time-invariant systems\n", "abstract": " Guaranteed state estimation computes the set of possible states of dynamical systems given the bounds of model uncertainties, disturbances, and noises. For the first time, we evaluate and compare a broad class of guaranteed state estimators for linear time-invariant systems regarding scalability, accuracy, and real-time applicability. In particular, we consider strip-based observers, set-propagation observers, and interval observers. The performance of most guaranteed state estimators is significantly affected by the chosen set representation. Zonotopes have emerged as a popular set representation since important operations such as linear maps and Minkowski sum can be computed exactly and efficiently. Furthermore, we provide comparisons with ellipsoids and constrained zonotopes as set representations. The comparison is conducted on various models for state estimation of autonomous vehicles.", "num_citations": "2\n", "authors": ["1806"]}
{"title": "Computation of Solution Spaces for Optimization-based Trajectory Planning\n", "abstract": " The nonlinearity of the vehicle dynamics and the non-convexity of collision avoidance constraints pose major challenges for optimization-based trajectory planning of automated vehicles. Current solutions to these challenges are either tailored to specific traffic scenarios, simplify the vehicle dynamics, are computationally demanding, or may get stuck in local minima. This work presents a novel approach to address the aforementioned shortcomings by identifying collision-free driving corridors that represent spatio-temporal constraints for motion planning using set-based reachability analysis. We derive a suitable formulation of collision avoidance constraints from driving corridors that can be integrated into arbitrary nonlinear programs as well as (successive) convexification procedures. When combining our approach with existing motion planning methods based on continuous optimization, trajectories can be …", "num_citations": "2\n", "authors": ["1806"]}
{"title": "Adaptive Parameter Tuning for Reachability Analysis of Linear Systems\n", "abstract": " Despite the possibility to quickly compute reachable sets of large-scale linear systems, current methods are not yet widely applied by practitioners. The main reason for this is probably that current approaches are not push-button-capable and still require to manually set crucial parameters, such as time step sizes and the accuracy of the used set representation—these settings require expert knowledge. We present a generic framework to automatically find near-optimal parameters for reachability analysis of linear systems given a user-defined accuracy. To limit the computational overhead as much as possible, our methods tune all relevant parameters during runtime. We evaluate our approach on benchmarks from the ARCH competition as well as on random examples. The results show that our new framework verifies the selected benchmarks faster than manually-tuned parameters and is an order of magnitude …", "num_citations": "2\n", "authors": ["1806"]}
{"title": "COUPLING APOLLO WITH THE COMMONROAD MOTION PLANNING FRAMEWORK\n", "abstract": " Open-source software platforms are becoming more important for researchers in the field of autonomous driving. One of the leading platforms for autonomous driving is Apollo, whose purpose is accelerating the testing and deployment of autonomous vehicles. However, Apollo’s complex software structure hampers an easy integration of software modules, especially for motion planning. Moreover, the standalone version of Apollo requires users to upload their algorithms to a cloud platform to allow testing in diverse scenarios, which is unacceptable for many companies. In contrast, the open-source CommonRoad benchmark suite contains diverse testing scenarios in different settings, such as highways, urban environments, dense traffic, and settings where interaction with bicyclists and pedestrians is particularly important. In addition, CommonRoad provides a motion planning framework in Python, which enables rapid prototyping of motion planners, along with additional tools, such as an efficient drivability checker, a map format converter, and interfaces to the traffic simulators SUMO and CARLA. In this work, we introduce a Python API between the planning module of the Apollo platform and the CommonRoad software framework, which bridges the gap between rapid prototyping for planning algorithms and their validation through real test drives. We demonstrate our interface with two scenarios.", "num_citations": "2\n", "authors": ["1806"]}
{"title": "Computing safe sets of linear sampled-data systems\n", "abstract": " Leveraging autonomous systems in safety-critical applications requires formal robustness guarantees against uncertainties. We address this issue by computing safe terminal sets with corresponding safety-preserving terminal controllers, which ensure robust constraint satisfaction for an infinite time horizon. To maximize the region of operation, we also construct as large as possible safe initial sets that can be safely steered into the safe terminal set in finite time. We use scalable reachability analysis and convex optimization to efficiently compute safe sets of sampled-data systems. These systems are composed of a physical plant evolving in continuous time and a digital controller being implemented in discrete time. We further verify the effectiveness of our robust control approach using a simple double-integrator system and a vehicle-platooning benchmark.", "num_citations": "2\n", "authors": ["1806"]}
{"title": "Synthesizing traffic scenarios from formal specifications for testing automated vehicles\n", "abstract": " Virtual testing plays an important role in the validation and verification of automated vehicles. State-of-the-art approaches first generate a huge amount of test scenarios through simulations or test drives, which are later filtered to obtain relevant scenarios for a given set of specifications. However, only few works exist on synthesizing scenarios directly from specifications. In this work, we present an optimization-based approach to synthesize scenarios only from formal specifications and a given map. To concretize the specifications, we formulate predicates, which are subsequently converted to a mixed-integer quadratic optimization problem. We demonstrate how our method can generate scenarios for maps featuring merging lanes and intersections given a variety of specifications.", "num_citations": "2\n", "authors": ["1806"]}
{"title": "Kooperative Bewegungsplanung autonomer Fahrzeuge unter Verwendung von Manöver-Templates\n", "abstract": " Dieser Beitrag berichtet über eine Methode zur Auswahl kooperativer Fahrstrategien für automatisierte Kraftfahrzeuge. Hierzu wird ein neues Konzept basierend auf Manöver-Templates vorgestellt, welche kooperative Fahrstrategien repräsentieren. Auf der Grundlage von Manöver-Templates werden unsichere kooperative Fahrstrategien identifiziert und anschließend verworfen, wodurch sich die Anzahl möglicher Fahrmanöver verringert, so dass man sich auf verbleibende Optionen konzentrieren kann. Numerische Beispiele zeigen, dass sich mit der vorgestellten Methode die Rechenzeiten für kooperative Manöver verkürzen lassen.", "num_citations": "2\n", "authors": ["1806"]}
{"title": "AROC 2020 manual\n", "abstract": " In this manual we present the philosophy, architecture, and capabilities of the Automated Reachset Optimal Control (AROC) toolbox. AROC is a MATLAB toolbox that automatically synthesizes verified controllers for solving reach-avoid problems using reachability analysis. Two different types of controllers are considered: For model predictive control verified controllers are constructed in real-time during online application; The motion primitive based control algorithms, on the other hand, first synthesize verified controllers for many different motion primitives offline, which are then used for online planning with a maneuver automaton. AROC currently contains one model predictive control algorithm and the three motion primitive based control algorithms optimization based control, convex interpolation control, and generator space control. Furthermore, the toolbox provides an implementation of a maneuver automaton for convenient online-planning with motion primitives. AROC is released under the GPLv3 license.", "num_citations": "2\n", "authors": ["1806"]}
{"title": "Guaranteed state estimation in cora 2021\n", "abstract": " Tool presentation: Safety-critical systems often require guaranteed state estimation instead of estimating the most-likely state. While a lot of research on guaranteed state estimation has been conducted, there exists no tool for this purpose. Since guaranteed state estimation is in many cases a reachability problem or closely related to reachability analysis, this paper presents its implementation in the continuous reachability analyzer (CORA). We present how we integrated different types of observers, different set representations, and linear as well as nonlinear dynamics. The scalability and usefulness of the implemented observers is demonstrated for a scalable tank system.", "num_citations": "1\n", "authors": ["1806"]}
{"title": "CommonRoad Scenario Designer: An Open-Source Toolbox for Map Conversion and Scenario Creation for Autonomous Vehicles\n", "abstract": " Maps are essential for testing autonomous driving functions. Several map and scenario formats are available. However, they are usually not compatible with each other, limiting their usability. In this paper, we address this problem using our open-source toolbox that provides map converters from different formats to the well-known CommonRoad format. Our toolbox provides converters for OpenStreetMap, Lanelet/Lanelet2, OpenDRIVE, and SUMO. Additionally, a graphical user interface is included, which allows one to efficiently create and manipulate CommonRoad maps and scenarios. We demonstrate the functionality of the toolbox by creating CommonRoad maps and scenarios based on other map formats and manually-created map data.", "num_citations": "1\n", "authors": ["1806"]}
{"title": "CommonRoad-RL: a configurable reinforcement learning environment for motion planning of autonomous vehicles\n", "abstract": " Reinforcement learning (RL) methods have gained popularity in the field of motion planning for autonomous vehicles due to their success in robotics and computer games. However, no existing work enables researchers to conveniently compare different underlying the Markov decision processes (MDPs). To address this issue, we present CommonRoad-RL-an open-source toolbox to train and evaluate RL-based motion planners for autonomous vehicles. Configurability, modularity, and stability of CommonRoad-RL simplify comparing different MDPs. This is demonstrated by comparing agents trained with different rewards, action spaces, and vehicle models on a real-world highway dataset. Our toolbox is available at commonroad.in.tum.de.", "num_citations": "1\n", "authors": ["1806"]}
{"title": "AROC: a toolbox for automated reachset optimal controller synthesis\n", "abstract": " We present a MATLAB toolbox forA utomatedR eachsetO ptimalC ontrol (AROC) that automatically synthesizes verified controllers for solving reach-avoid problems using reachability analysis. The toolbox implements two different types of control approaches: When using our verified model predictive controller, a feasible control law is constructed and verified on-the-fly during online application of the system. For motion-primitive-based control, on the other hand, controllers for many motion primitives are synthesized offline and then used for online motion planning with a maneuver automaton. Since our toolbox considers general nonlinear systems with input constraints, state constraints, and bounded disturbances, it is applicable to a very broad class of systems, as we demonstrate with several numerical examples. AROC is available at https://aroc. in. tum. de.", "num_citations": "1\n", "authors": ["1806"]}
{"title": "Reachability-based Identification, Analysis, and Control Synthesis of Robot Systems\n", "abstract": " We introduce reachability analysis for the formal examination of robots. We propose a novel identification method, which preserves reachset conformance of linear systems. We additionally propose a simultaneous identification and control synthesis scheme to obtain optimal controllers with formal guarantees. In a case study, we examine the effectiveness of using reachability analysis to synthesize a state-feedback controller, a velocity observer, and an output feedback controller.", "num_citations": "1\n", "authors": ["1806"]}
{"title": "Cooperative raw sensor data fusion for ground truth generation in autonomous driving\n", "abstract": " Ground truth data plays an important role in validating perception algorithms and in developing data-driven models. Yet, generating ground truth data is a challenging process, often requiring tedious manual work. Thus, we present a post-processing approach to automatically generate ground truth data from environment sensors. In contrast to existing approaches, we incorporate raw sensor data from multiple vehicles. As a result, our cooperative fusion approach overcomes drawbacks of occlusions and decreasing sensor resolution with distance. To improve the alignment precision for raw sensor data fusion, we include mutual detections and match the jointly-observed static environment to support differential global positioning system localization. We further provide a new registration algorithm, where all point clouds are moved simultaneously, while restricting the transformation parameters to increase the …", "num_citations": "1\n", "authors": ["1806"]}
{"title": "Scalable Zonotope-Ellipsoid Conversions using the Euclidean Zonotope Norm\n", "abstract": " Set-based computations become increasingly popular for safety-critical systems to ensure properties of controllers and observers. To efficiently compute various set operations, one often uses different set representations and conversions between them. Two popular set representations, for which scalable conversion algorithms do not yet exist, are zonotopes and ellipsoids. We provide computational approaches for all four conversion cases, i.e., overapproximations and underapproximations from zonotopes to ellipsoids and vice versa. By using upper bounds on the maximum and lower bounds on the minimum Euclidean norm of a given zonotope, our approaches have polynomial complexity and thus can be used for high-dimensional spaces. We show that the tightness of our approaches directly depends on the tightness of the Euclidean norm. Numerical experiments demonstrate the usefulness of our proposed …", "num_citations": "1\n", "authors": ["1806"]}
{"title": "Formal synthesis of closed-form sampled-data controllers for nonlinear continuous-time systems under STL specifications\n", "abstract": " We propose a counterexample-guided inductive synthesis framework for the formal synthesis of closed-form sampled-data controllers for nonlinear systems to meet STL specifications over finite-time trajectories. Rather than stating the STL specification for a single initial condition, we consider an (infinite and bounded) set of initial conditions. Candidate solutions are proposed using genetic programming, which evolves controllers based on a finite number of simulations. Subsequently, the best candidate is verified using reachability analysis; if the candidate solution does not satisfy the specification, an initial condition violating the specification is extracted as a counterexample. Based on this counterexample, candidate solutions are refined until eventually a solution is found (or a user-specified number of iterations is met). The resulting sampled-data controller is expressed as a closed-form expression, enabling both interpretability and the implementation in embedded hardware with limited memory and computation power. The effectiveness of our approach is demonstrated for multiple systems.", "num_citations": "1\n", "authors": ["1806"]}
{"title": "Provably-Safe Cooperative Driving via Invariably Safe Sets\n", "abstract": " We address the problem of provably-safe cooperative driving for a group of vehicles that operate in mixed traffic scenarios, where both autonomous and human-driven vehicles are present. Our method is based on Invariably Safe Sets (ISSs), which are sets of states that let each of the cooperative vehicles remain safe for an infinite time horizon. The potential conflicts between the ISSs of a group of cooperative vehicles are resolved by examining and negotiating their Safe Maneuver Corridors. As a result, each vehicle obtains its negotiated ISS, which is used as target sets for motion planning. We demonstrate the applicability and benefits of our method on various traffic scenarios from the CommonRoad benchmark suite.", "num_citations": "1\n", "authors": ["1806"]}
{"title": "Calibration of Controlled Markov Chains for Predicting Pedestrian Crossing Behavior Using Multi-objective Genetic Algorithms\n", "abstract": " Pedestrian motion prediction is a core issue in assisted and automated driving and challenging to solve. In this work, controlled Markov chains are used for predicting pedestrian crossing behavior in urban environments with and without crosswalks. Intentions, such as crossing a road, are estimated by incorporating the probability of colliding with other traffic participants. On a public dataset, we calibrate the model parameters using genetic algorithms which we formulate as a multi-objective optimization problem. Rather than only minimizing the position deviation of the prediction, we also consider the classification performance for pedestrians' crossing intention. The conducted evaluation shows benefits of our approach: it achieves comparable intention recognition performance compared to a support vector machine, while additionally achieving accurate spatiotemporal predictions.", "num_citations": "1\n", "authors": ["1806"]}
{"title": "Die Formalisierung von Rechtsnormen am Beispiel des Überholvorgangs\n", "abstract": " Von Menschen geschaffene Regelwerke lassen sich nur schwer in eine maschinell lesbare Form übertragen. Zugleich besteht ein zunehmend großes Interesse daran, rechtliche Regelungen für Algorithmen greifbar zu machen, um beispielsweise bei automatisierten Fahrzeugen die Einhaltung von Straßenverkehrsregeln zu gewährleisten. Dieser Beitrag soll Herausforderungen und erste Lösungsansätze bei der Formalisierung und Programmierung von Rechtsnormen darstellen.", "num_citations": "1\n", "authors": ["1806"]}
{"title": "D. 3.1 Cooperation and Communication Planning Unit Concept\n", "abstract": " As Automated Vehicles (AVs) will be deployed in mixed traffic, they need to interact safely and efficiently with other traffic participants (TPs). The interACT project is working towards the safe integration of AVs into mixed traffic environments.In its Work Package (WP) 3, the interACT project aims to develop a novel Cooperation and Communication Planning Unit (CCPU) to enable the integrated planning and control of AV's behaviour, and the provision of time-synchronised Human Machine Interfaces (HMI) for both the on-board user and the other TPs.", "num_citations": "1\n", "authors": ["1806"]}
{"title": "D1. 1 Definition of interACT use cases and scenarios\n", "abstract": " interACT studies current human‐machine interactions in mixed traffic and will increase the chances of safe deployment of AVs by developing novel software and HMI hardware components for reliable and user‐centric communication among an AV, its on‐board user and other road users. It is expected that by reaching its goals, this project will facilitate the gradual integration of AVs in future transport networks. The present document is the D1.1 “Definition of interACT scenarios” which is prepared as the first document within WP1 of the interACT project. The document presents the selection process for scenarios, a framework for the use case description and the selected interACT use cases and example scenarios. Use cases are a functional description of the behaviour of the AV in a traffic situation (see 3.3). Scenarios are a description of sequences of actions and events performed by different actors over a certain amount of time (see 3.2). As the natural traffic environment consists of a manifold variety of traffic scenes, it is essential for the interACT technical project work to reduce the complexity of the traffic environment to a manageable number of relevant use cases and scenarios that an AV could be confronted with. Therefore, WP1 started with an agreement on and definition of relevant interACT use cases and scenarios among all industrial and academic consortium members. The interACT use cases and scenarios have been selected using a step‐wise process of intensive discussions within the consortium. Starting with some open brain‐storming discussions the use cases were aggregated and rated by the partners against several criteria (such …", "num_citations": "1\n", "authors": ["1806"]}
{"title": "Efficient methods for order reduction of zonotopes\n", "abstract": " Zonotopes are a special subclass of polytopes, which have several favorable properties: They can be represented in a compact way and they are closed under the Minkowski sum as well as under linear transformations. Zonotopes are a popular set representation used eg for reachability analysis of dynamic systems, set-based observers and robust control. The complexity of algorithms that work on zonotopes strongly depends on their order (ie their number of generators and dimensions), which is often increased by operations like the Minkowski sum. Thus, to keep computations efficient, zonotopes of high orders are often over-approximated as tight as possible by zonotopes of smaller order. This paper has two main contributions: First, we propose new methods based on principle component analysis (PCA), clustering and constrained optimization for tight over-approximation of zonotopes. Second, we provide an overview of the most important known methods for order reduction and compare the performance of new and known methods in low-and high-dimensional spaces.", "num_citations": "1\n", "authors": ["1806"]}
{"title": "Online-Analyse von Fahrstrategien kognitiver autonomer Fahrzeuge\n", "abstract": " Der Beitrag berichtet über eine Methode, mit der für unbemannte Kraftfahrzeuge im Straßenverkehr auf der Grundlage aktueller Messdaten überprüft wird, ob eine autonom geplante Fahrstrategie sicher realisiert werden kann. Dazu wird zunächst ausgehend von einer hybriden Modellierung eine konservative Darstellung der Fahrdynamik in Form von Markov-Prozessen generiert. Durch Uberlagerung mit ähnlichen Modellen zur Darstellung des Verhaltens der Fahrzeugumgebung lässt sich die Wahrscheinlichkeit berechnen, mit der eine kollisionsfreie Fahrt möglich ist. Diese Berechnung wird repetitiv über einen geeigneten Prädiktionshorizont durchgeführt. Der Beitrag zeigt auf, über welche Maßnahmen zur Komplexitätsreduktion eine Echtzeitfähigkeit der Berechnung erreicht werden kann.", "num_citations": "1\n", "authors": ["1806"]}