{"title": "MoRFchibi SYSTEM: software tools for the identification of MoRFs in protein sequences\n", "abstract": " Molecular recognition features, MoRFs, are short segments within longer disordered protein regions that bind to globular protein domains in a process known as disorder-to-order transition. MoRFs have been found to play a significant role in signaling and regulatory processes in cells. High-confidence computational identification of MoRFs remains an important challenge. In this work, we introduce MoRFchibi SYSTEM that contains three MoRF predictors: MoRFCHiBi, a basic predictor best suited as a component in other applications, MoRFCHiBi_Light, ideal for high-throughput predictions and MoRFCHiBi_Web, slower than the other two but best for high accuracy predictions. Results show that MoRFchibi SYSTEM provides more than double the precision of other predictors. MoRFchibi SYSTEM is available in three different forms: as HTML web server, RESTful web server and downloadable software at: http://www …", "num_citations": "86\n", "authors": ["1902"]}
{"title": "VariCarta: A comprehensive database of harmonized genomic variants found in autism spectrum disorder sequencing studies\n", "abstract": " Recent years have seen a boom in the application of the next‐generation sequencing technology to the study of human disorders, including Autism Spectrum Disorder (ASD), where the focus has been on identifying rare, possibly causative genomic variants in ASD individuals. Because of the high genetic heterogeneity of ASD, a large number of subjects is needed to establish evidence for a variant or gene ASD‐association, thus aggregating data across cohorts and studies is necessary. However, methodological inconsistencies and subject overlap across studies complicate data aggregation. Here we present VariCarta, a web‐based database developed to address these challenges by collecting, reconciling, and consistently cataloging literature‐derived genomic variants found in ASD subjects using ongoing semi‐manual curation. The careful manual curation combined with a robust data import pipeline rectifies …", "num_citations": "14\n", "authors": ["1902"]}
{"title": "Whole genome sequencing and variant discovery in the ASPIRE autism spectrum disorder cohort\n", "abstract": " Autism spectrum disorder (ASD) is a highly heterogeneous genetic disorder with strong evidence of ASD‐association currently available only for a small number of genes. This makes it challenging to identify the underlying genetic cause in many cases of ASD, and there is a continuing need for further discovery efforts. We sequenced whole genomes of 119 deeply phenotyped ASD probands in order to identify likely pathogenic variants. We prioritized variants found in each subject by predicted damage, population frequency, literature evidence, and phenotype concordance. We used Sanger sequencing to determine the inheritance status of high‐priority variants where possible. We report five novel de novo damaging variants as well as several likely damaging variants of unknown inheritance; these include two novel de novo variants in the well‐established ASD gene SCN2A. The availability of rich phenotypic …", "num_citations": "12\n", "authors": ["1902"]}
{"title": "LIST-S2: taxonomy based sorting of deleterious missense mutations across species\n", "abstract": " The separation of deleterious from benign mutations remains a key challenge in the interpretation of genomic data. Computational methods used to sort mutations based on their potential deleteriousness rely largely on conservation measures derived from sequence alignments. Here, we introduce LIST-S2, a successor to our previously developed approach LIST, which aims to exploit local sequence identity and taxonomy distances in quantifying the conservation of human protein sequences. Unlike its predecessor, LIST-S2 is not limited to human sequences but can assess conservation and make predictions for sequences from any organism. Moreover, we provide a web-tool and downloadable software to compute and visualize the deleteriousness of mutations in user-provided sequences. This web-tool contains an HTML interface and a RESTful API to submit and manage sequences as well as a browsable …", "num_citations": "7\n", "authors": ["1902"]}
{"title": "Monitoring changes in the Gene Ontology and their impact on genomic data analysis\n", "abstract": " Background           The Gene Ontology (GO) is one of the most widely used resources in molecular and cellular biology, largely through the use of “enrichment analysis.” To facilitate informed use of GO, we present GOtrack (https://gotrack.msl.ubc.ca), which provides access to historical records and trends in the GO and GO annotations.                             Findings           GOtrack gives users access to gene- and term-level information on annotations for nine model organisms as well as an interactive tool that measures the stability of enrichment results over time for user-provided “hit lists” of genes. To document the effects of GO evolution on enrichment, we analyzed more than 2,500 published hit lists of human genes (most older than 9 years ); 53% of hit lists were considered to yield significantly stable enrichment results.                             Conclusions           Because stability is far from assured for any individual …", "num_citations": "4\n", "authors": ["1902"]}
{"title": "Interactive Exploration, Analysis, and Visualization of Complex Phenome–Genome Datasets with ASPIREdb\n", "abstract": " Identifying variants causal for complex genetic disorders is challenging. With the advent of whole‐exome and whole‐genome sequencing, computational tools are needed to explore and analyze the list of variants for further validation. Correlating genetic variants with subject phenotype is crucial for the interpretation of the disease‐causing mutations. Often such work is done by teams of researchers who need to share information and coordinate activities. To this end, we have developed a powerful, easy to use Web application, ASPIREdb, which allows researchers to search, organize, analyze, and visualize variants and phenotypes associated with a set of human subjects. Investigators can annotate variants using publicly available reference databases and build powerful queries to identify subjects or variants of interest. Functional information and phenotypic associations of these genes are made accessible as …", "num_citations": "4\n", "authors": ["1902"]}