{"title": "A systematic literature review on agile requirements engineering practices and challenges\n", "abstract": " Unlike traditional software development methods, agile methods are marked by extensive collaboration, i.e. face-to-face communication. Although claimed to be beneficial, the software development community as a whole is still unfamiliar with the role of the requirements engineering practices in agile methods. The term “agile requirements engineering” is used to define the “agile way” of planning, executing and reasoning about requirements engineering activities. Moreover, not much is known about the challenges posed by collaboration-oriented agile way of dealing with requirements engineering activities. Our goal is to map the evidence available about requirements engineering practices adopted and challenges faced by agile teams in order to understand how traditional requirements engineering issues are resolved using agile requirements engineering. We conducted a systematic review of literature …", "num_citations": "464\n", "authors": ["414"]}
{"title": "Requirements prioritization based on benefit and cost prediction: an agenda for future research\n", "abstract": " In early phases of the software cycle, requirements prioritization necessarily relies on the specified requirements and on predictions of benefit and cost of individual requirements. This paper presents results of a systematic review of literature, which investigates how existing methods approach the problem of requirements prioritization based on benefit and cost. From this review, it derives a set of under-researched issues which warrant future efforts and sketches an agenda for future research in this area.", "num_citations": "138\n", "authors": ["414"]}
{"title": "ERP requirements engineering practice: lessons learned\n", "abstract": " Standard off-the-shelf requirements engineering processes have become a key to conceptualizing any integrated, corporate-wide solution based on packaged enterprise resource planning software. A generic RE model offers defined processes, suggests process stakeholders, specifies steps to accomplish tasks, indicates task dependencies, and provides standard tool support for ERP RE. Essentially, any off-the-shelf RE process is about composition and reconciliation: you start with a general set of business process and data requirements, then explore standard ERP functionality to see how closely it matches your organization's process and data needs.", "num_citations": "129\n", "authors": ["414"]}
{"title": "A qualitative study of DevOps usage in practice\n", "abstract": " Organizations are introducing agile and lean software development techniques in operations to increase the pace of their software development process and to improve the quality of their software. They use the term DevOps, a portmanteau of development and operations, as an umbrella term to describe their efforts. In this paper, we describe the ways in which organizations implement DevOps and the outcomes they experience. We first summarize the results of a systematic literature review that we performed to discover what researchers have written about DevOps. We then describe the results of an exploratory interview‐based study involving 6 organizations of various sizes that are active in various industries. As part of our findings, we observed that all organizations were positive about their experiences and only minor problems were encountered while adopting DevOps.", "num_citations": "122\n", "authors": ["414"]}
{"title": "Cloud computing security requirements: A systematic review\n", "abstract": " Many publications have dealt with various types of security requirements in cloud computing but not all types have been explored in sufficient depth. It is also hard to understand which types of requirements have been under-researched and which are most investigated. This paper's goal is to provide a comprehensive and structured overview of cloud computing security requirements and solutions. We carried out a systematic review and identified security requirements from previous publications that we classified in nine sub-areas: Access Control, Attack/Harm Detection, Non-repudiation, Integrity, Security Auditing, Physical Protection, Privacy, Recovery, and Prosecution. We found that (i) the least researched sub-areas are non-repudiation, physical protection, recovery and prosecution, and that (ii) access control, integrity and auditability are the most researched sub-areas.", "num_citations": "100\n", "authors": ["414"]}
{"title": "On the pragmatic design of literature studies in software engineering: an experience-based guideline\n", "abstract": " Systematic literature studies have received much attention in empirical software engineering in recent years. They have become a powerful tool to collect and structure reported knowledge in a systematic and reproducible way. We distinguish systematic literature reviews to systematically analyze reported evidence in depth, and systematic mapping studies to structure a field of interest in a broader, usually quantified manner. Due to the rapidly increasing body of knowledge in software engineering, researchers who want to capture the published work in a domain often face an extensive amount of publications, which need to be screened, rated for relevance, classified, and eventually analyzed. Although there are several guidelines to conduct literature studies, they do not yet help researchers coping with the specific difficulties encountered in the practical application of these guidelines. In this article, we …", "num_citations": "98\n", "authors": ["414"]}
{"title": "Report: Devops literature review\n", "abstract": " DevOps is a conceptual framework for reintegrating development and operations of Information Systems. We performed a Systematic Mapping Study to explore DevOps. 26 articles out of 139 were selected, studied and summarized. Based on this a concept table was constructed. We discovered that DevOps has not been adequately studied in scientific literature. There is relatively little research available on DevOps and the studies are often of low quality. We also found that DevOps is supported by a culture of collaboration, automation, measurement, information sharing and web service usage. DevOps benefits IS development and operations performance. It also has positive effects on web service development and quality assurance performance. Finally, our mapping study suggests that more research is needed to quantify these effects.", "num_citations": "81\n", "authors": ["414"]}
{"title": "A mapping study on cooperation between information system development and operations\n", "abstract": " DevOps is a conceptual framework for reintegrating development and operations of Information Systems. We performed a Systematic Mapping Study to explore DevOps. 26 articles out of 139 were selected, studied and summarized. Based on this a concept table was constructed. We discovered that DevOps has not been adequately studied in scientific literature. There is relatively little research available on DevOps and the studies are often of low quality. We also found that DevOps is supported by a culture of collaboration, automation, measurement, information sharing and web service usage. DevOps benefits IS development and operations performance. It also has positive effects on web service development and quality assurance performance. Finally, our mapping study suggests that more research is needed to quantify these effects.", "num_citations": "72\n", "authors": ["414"]}
{"title": "Value creation by agile projects: Methodology or mystery?\n", "abstract": " Business value is a key concept in agile software development approaches. This paper presents results of a systematic review of literature on how business value is created by agile projects. We found that with very few exceptions, most published studies take the concept of business value for granted and do not state what it means in general as well as in the specific study context. We could find no study which clearly indicates how exactly individual agile practices or groups of those create value and keep accumulating it over time. The key implication for research is that we have an incentive to pursue the study of value creation in agile project by deploying empirical research methods.", "num_citations": "68\n", "authors": ["414"]}
{"title": "Measuring reuse of SAP requirements: A model-based approach\n", "abstract": " Reusing SAP R/3 business requirements has been recognized as the most promising strategy to shorten the time-to-production and increase the quality of the conceptual design in R/3 implementation projects. However, very little research has been conducted to actually quantify and really estimate the results from SAP R/3 requirement reuse the customers have achieved. This paper deals with the identification and the measurement of reuse in the requirements conceptualization phase of the SAP R/3 component configuration cycle. We present a systematic approach based on standard functional size measurement practices. We introduce two key concepts: SAP requirements reuse levels and reuse indicators. The reuse levels serve to classify SAP requirements based on the extent to which the requirements are reused in a R/3 implementation project. The reuse indicators are then built to quantify the requirement …", "num_citations": "57\n", "authors": ["414"]}
{"title": "Handling requirements dependencies in agile projects: A focus group with agile software development practitioners\n", "abstract": " Agile practices on requirements dependencies are a relatively unexplored topic in literature. Empirical studies on it are scarce. This research sets out to uncover concepts that practitioners in companies of various sizes across the globe and in various industries, use for dealing with requirements dependencies in their agile software projects. Concepts were revealed through online focus group research, using an adapted forum for discussion, and grounded theory to analyze the responses. Our study resulted in the following findings: (1) requirements dependencies occur in agile projects and are important to these projects' success just as this is known for `traditional' software projects'; (2) requirements dependencies (i) were considered and treated as part of risk management, (ii) were deemed a responsibility of the individual team members, and (iii) mostly did affect project planning; (3) continuous communication …", "num_citations": "52\n", "authors": ["414"]}
{"title": "An ontology based approach to non-functional requirements conceptualization\n", "abstract": " The growing awareness of the importance of non-functional requirements (NFRs) among the requirements engineering (RE) community in the last few years led to a heightened interest in NFRs description and modeling and, in turn, to the emergence of several models intended to capture and structure the relevant concepts defining the NFRs and their relations. Yet, most of the terms and concepts in use for describing NFRs have been loosely defined, and often there is no commonly accepted taxonomy of NFRs. Common Foundation is required to enable effective communication and to enable integration of NFRs' related research activities within the RE community. In this paper, this Common Foundation will be realized by developing an ontology-based approach which is adequate for projects taking into consideration the NFRs and their relations earlier in the software development and throughout the life cycle.", "num_citations": "50\n", "authors": ["414"]}
{"title": "Requirements prioritization based on benefit and cost prediction: A method classification framework\n", "abstract": " In early phases of the software development process, requirements prioritization necessarily relies on the specified requirements and on predictions of benefit and cost of individual requirements. This paper induces a conceptual model of requirements prioritization based on benefit and cost. For this purpose, it uses Grounded Theory. We provide a detailed account of the procedures and rationale of (i) how we obtained our results and (ii) how we used them to form the basis for a framework for classifying requirements prioritization methods.", "num_citations": "42\n", "authors": ["414"]}
{"title": "A conceptual model of client-driven agile requirements prioritization: Results of a case study\n", "abstract": " Requirements (re) prioritization is an essential mechanism of agile development approaches to maximize the value for the clients and to accommodate changing requirements. Yet, in the agile Requirements Engineering (RE) literature, very little is known about how agile (re) prioritization happens in practice. Conceptual models about this process are missing, which, in turn, makes it difficult for both practitioners and researchers to reason about requirements decision-making at inter-iteration time. We did a multiple case study on agile requirements prioritization methods to yield a conceptual model for understanding the inter-iteration prioritization process. The model is derived by using interview data from practitioners in 8 development organizations. Such a model makes explicit the concepts that are used tacitly in the agile requirements prioritization practice and can be used for structuring future empirical …", "num_citations": "39\n", "authors": ["414"]}
{"title": "Applying real options thinking to information security in networked organizations\n", "abstract": " An information security strategy of an organization participating in a networked business sets out the plans for designing a variety of actions that ensure confidentiality, availability, and integrity of company’s key information assets. The actions are concerned with authentication and nonrepudiation of authorized users of these assets. We assume that the primary objective of security efforts in a company is improving and sustaining resiliency, which means security contributes to the ability of an organization to withstand discontinuities and disruptive events, to get back to its normal operating state, and to adapt to ever changing risk environments. When companies collaborating in a value web view security as a business issue, risk assessment and cost-benefit analysis techniques are necessary and explicit part of their process of resource allocation and budgeting, no matter if security spendings are treated as capital investment or operating expenditures.This paper contributes to the application of quantitative approaches to assessing risks, costs, and benefits associated with the various components making up the security strategy of a company participating in value networks. We take a risk-based approach to determining what types of security a strategy should include and how much of each type is enough. We adopt a real-options-based perspective of security and make a proposal to value the extent to which alternative components in a security strategy contribute to organizational resiliency and protect key information assets from being impeded, disrupted, or destroyed.", "num_citations": "38\n", "authors": ["414"]}
{"title": "Lessons learnt from five years of experience in ERP requirements engineering\n", "abstract": " Generic off-the-shelf requirements engineering (RE) processes have been packaged by enterprise resource planning (ERP) vendors since 1997, and adopted by client organizations as the key strategy for getting the business requirements and the conceptual design for their complex solutions. We summarize one company's five years of experience in making a generic ERP RE model a live process. It rests on previously published ERP RE process assessment results and reports on what we learnt with particular focus on typical issues organizations face when adopting a standard model and solutions that can be used to avoid those issues in the future. Each of our lessons is described together with a RE practice, technical foundation for the practice and engineering techniques for the RE practitioner. The lessons were used to refine our corporate documentation model, a process-focused and template-based ERP …", "num_citations": "36\n", "authors": ["414"]}
{"title": "Cooperation between information system development and operations: a literature review\n", "abstract": " Software development can profit from improvements in the deployment and maintenance phases. DevOps improves these phases through a collection of principles and practices, centered around close collaboration between Development and Operations personnel. Both sides have paid little attention to issues faced by each other. Yet knowledge sharing is invaluable. Development personnel can for example make software more robust by implementing scalability and performance features desired by operations personnel.", "num_citations": "34\n", "authors": ["414"]}
{"title": "Customer requirements based ERP customization using AHP technique\n", "abstract": " Purpose                – Customization is a difficult task for many organizations implementing enterprise resource planning (ERP) systems. The purpose of this paper is to develop a new framework based on customers’ requirements to examine the ERP customization choices for the enterprise. The analytical hierarchy process (AHP) technique has been applied complementarily with this framework to prioritize ERP customization choices.                                        Design/methodology/approach                – Based on empirical literature, the paper proposed an ERP customization framework anchored on the customer's requirements. A case study research method was used to evaluate the applicability of the framework in a real-life setting. In a case study with 15 practitioners working on the vendor's and the client's sides in an ERP implementation, the paper applied the framework jointly with the AHP technique to …", "num_citations": "31\n", "authors": ["414"]}
{"title": "Validating adequacy and suitability of business-IT alignment criteria in an inter-enterprise maturity model 202\n", "abstract": " Aligning requirements of a business with its information technology is currently a major issue in enterprise computing. Existing literature indicates important criteria to judge the level of alignment between business and IT within a single enterprise. However, identifying such criteria in an inter-enterprise setting - or re-thinking the existing ones - is hardly addressed at all. Business-IT alignment in such settings poses new challenges, as in inter-enterprise collaborations, alignment is driven by economic processes instead of centralized decision-making processes. In our research, we develop a maturity model for business-IT alignment in inter-enterprise settings that takes this difference into account. In this paper, we report on a multi-method approach we devised to confront the validation of the business-IT alignment criteria that we included in the maturity model. As independent feedback is critical for our validation, we …", "num_citations": "31\n", "authors": ["414"]}
{"title": "Using maturity assessments to understand the ERP requirements engineering process\n", "abstract": " Applying standard requirements engineering (RE) processes is a major trend in today's enterprise resource planning (ERP) software engineering. It emerged five years ago with the promise to provide a mechanism helping ERP project organizations deliver their business requirements timely and within budget. This paper looks in depth at a standard ERP RE process and seeks answers to four questions: how well it is defined, what are the risks associated with its application in mature/immature organizations, what are the essential practices that contribute to its success, and what are the costs of the process and the quality of the delivered results. The main motivation of this paper is to provide some practical advice for using assessments to increase project teams' understanding of the ERP RE process.", "num_citations": "29\n", "authors": ["414"]}
{"title": "A traceability metamodel for change management of non-functional requirements\n", "abstract": " Requirements changes are an issue in the software development life cycle which often originates from an incomplete knowledge of the domain of interest. Hardly any requirement manifests in isolation, and usually the provision of one requirement may affect the level of provision of another. Understanding the relations among system requirements is essential to ensuring their consistency and change management. In practice, many organizations either focus their traceability efforts on functional requirements (FRs) or else fail entirely to implement an effective traceability process. Tracing non-functional requirements (NFRs) has, by and large, been neglected. In this paper, we propose a metamodel which explicitly captures NFRs and their relations, and which is independent from any programming paradigm. In addition, we present an implementation using XML-based representations for the metamodel and XQuery …", "num_citations": "28\n", "authors": ["414"]}
{"title": "Balancing uncertainty of context in ERP project estimation: an approach and a case study\n", "abstract": " The increasing demand for Enterprise Resource Planning (ERP) solutions as well as the high rates of troubled ERP implementations and outright cancellations calls for developing effort estimation practices to systematically deal with uncertainties in ERP projects. This paper describes an approach—and a case study—to balancing uncertainties of context in the very early project stages, when an ERP adopter initiates a request‐for‐proposal process and when alternative bids are to be compared for the purpose of choosing an implementation partner. The proposed empirical approach leverages the complementary application of three techniques, an algorithmic estimation model, Monte Carlo simulation, and portfolio management. Our case study findings show how the ability of our approach to model uncertainty allows practitioners to address the challenging question of how to adjust project context factors so that …", "num_citations": "27\n", "authors": ["414"]}
{"title": "A reflection on agile requirements engineering: solutions brought and challenges posed\n", "abstract": " The software development industry has rapidly accepted agile methods. Empirical studies suggest that due to their flexible and emergent nature, agile methods brought solutions to several chronic problems of traditional software development methods. One among the many is the acceptance of requirements changes at later stages of development. However, knowledge about the solutions that agile brought to requirements engineering (RE) is fragmented. Also, little is known about whether the agile philosophy, while introducing solutions to well-known RE problems from the past, has unintentionally opened new challenges. This paper offers a reflection on this matter. Based on the results of our recently published systematic review on agile RE, we reflect on the differences of'traditional'and agile RE and the practices adopted by the latter, on the solutions and challenges of agile RE, and on some implications that …", "num_citations": "25\n", "authors": ["414"]}
{"title": "Practical reuse measurement in ERP requirements engineering\n", "abstract": " Component-based, architecture-centric requirements engineering processes have been applied in Enterprise Resource Planning projects for a decade, but have only relatively recently achieved significant recognition in the broader software engineering research community. This sub-area is now entering a new level of maturity by beginning to address the reuse aspects in the ERP RE process. The present article makes a first contribution to applied ERP requirements reuse measurement by incorporating reuse metrics planning as part of the implementation of metrics on an ERP project. Relevant process integration issues are tackled in the context of SAP R/3 implementation projects.", "num_citations": "25\n", "authors": ["414"]}
{"title": "Benchmarking business process models\n", "abstract": " Enterprise modelling is an important premise for a successful business process (re) engineering (BPR) project (J. Brown, 1995). To facilitate this first step in any BPR initiative, the business process engineering community has developed different modelling methods and produced numerous tools implementing them. Although the commercially available BPR and CASE-tools support a lot of modelling activities (eg developing models, customizing reference models, simulating processes), today's modellers still meet difficulties in:• introducing quality assurance principles into enterprise modelling;• validating the produced business process models according to a disciplined and documented procedure.", "num_citations": "25\n", "authors": ["414"]}
{"title": "What the job market wants from requirements engineers? An empirical analysis of online job ads from the Netherlands\n", "abstract": " Recently, the requirements engineering (RE) community recognized the increasing need for understanding how industry perceives the jobs of requirements engineers and their most important qualifications. This study contributes to the community's research effort on this topic. Based on an analysis of RE job ads in 2015 from the Netherlands' three most popular online IT-job portals, we identified those task and skill related qualifications that employers demand from RE job seekers. We found that the job titles used in industry for the specialists that the RE community calls 'requirements engineers', are 'Product Owner' and 'Analyst', be it Information Analyst, Application Analyst, or Data Analyst. Those professionals supposed to perform RE tasks also take responsibility for additional tasks including quality assurance, realization and deployment, and project management. The most in-demand skills are soft skills …", "num_citations": "24\n", "authors": ["414"]}
{"title": "Agile practitioners’ understanding of security requirements: insights from a grounded theory analysis\n", "abstract": " A 2017 systematic review on engineering non-functional requirements in agile projects revealed a number of published proposals for approaching security requirements in agile settings. While these proposals acknowledge the urgent need for methods to systematically engineer security requirements in agile projects, they were designed mostly in academic settings. Very little empirical evaluation of these proposals happened in real-life contexts. In turn, little is known about how agile developers understand security requirements and how they devise their coping strategies regarding these requirements. This position paper presents a qualitative analysis that sought to discover how agile practitioners reason about security requirements, what contextual factors they consider important for shaping the pro-cess of coping with security requirements in agile projects, and what these strategies are. We conclude with some …", "num_citations": "24\n", "authors": ["414"]}
{"title": "An approach to estimation of degree of customization for ERP projects using prioritized requirements\n", "abstract": " Customization in ERP projects is a risky, but unavoidable undertaking that companies need to initiate in order to achieve alignment between their acquired ERP solution and their organizational goals and business processes. Conscious about the risks, many companies commit to leveraging the off-the-shelf built-in functionality in their chosen ERP package, keeping customization at a minimum level so that it does not jeopardize the project or the future projects that would build upon it. However, many organizations experience that once the project team enters the stage of implementing the solution, requests for customization increase in volume and diversity. Managing properly the process of customization gets increasingly harder.This paper addresses the problem of estimating the degree of customization at an early stage of ERP implementation. This will support customization decision makers in making value and …", "num_citations": "23\n", "authors": ["414"]}
{"title": "A comparative case study on clients participation in a'traditional'and in an Agile software company\n", "abstract": " Agile literature suggests that the active and continuous participation and involvement of the clients throughout the project is key to building the right product and raise users' satisfaction. However, relatively little research has been made on comparing what makes clients happy in'traditional'companies that use planed-driven processes and in agile companies. In turn, it's hard to collect and evaluate evidence in favor of either settings. This paper fills in this gap and compares two software development companies in a Nord-European country in respect to client participation and its impact on the clients' satisfaction with the project. One of the companies is agile by its design while the other follows a'traditional'software development approach. Our study suggests that active clients' participation is not an exclusive attribute of agile projects and that it can be successfully integrated (and implemented) in a'traditional'project as …", "num_citations": "23\n", "authors": ["414"]}
{"title": "Using real option thinking to improve decision making in security investment\n", "abstract": " Making well-founded security investment decisions is hard: several alternatives may need to be considered, the alternatives’ space is often diffuse, and many decision parameters that are traded-off are uncertain or incomplete. We cope with these challenges by proposing a method that supports decision makers in the process of making well-founded and balanced security investment decisions. The method has two fundamental ingredients, staging and learning, that fit into a continuous decision cycle. The method takes advantage of Real Options thinking, not only to select a decision option, but also to compound it with other options in following decision iterations, after reflection on the decision alternatives previously implemented. Additionally, our method is supported by the SecInvest tool for trade-off analysis that considers decision parameters, including cost, risks, context (such as time-to-market and B2B …", "num_citations": "23\n", "authors": ["414"]}
{"title": "A metamodel for tracing non-functional requirements\n", "abstract": " The tendency for non-functional requirements (NFRs) to have a wide-ranging impact on a software system, and the strong interdependencies and tradeoffs that exist between NFRs an the software project, leave typical existing software modeling methods incapable of integrating them into the software engineering. In this paper, we propose a metamodel which explicitly models FRs, NFRs, their refinements and their interdependencies. The metamodel, which is independent from any programming paradigm, is further transformed into a relational model which facilitates NFRs traceability using tracing queries implemented through \"Datalog\" expressions. The approach is illustrated on a case study.", "num_citations": "22\n", "authors": ["414"]}
{"title": "Scope management of non-functional requirements\n", "abstract": " In order to meet commitments in software projects, a realistic assessment must be made of project scope. Such an assessment relies on the availability of knowledge on the user-defined project requirements and their effort estimates and priorities, as well as their risk. This knowledge enables analysts, managers and software engineers to identify the most significant requirements from the list of requirements initially defined by the user. In practice, this scope assessment is applied to the functional requirements (FRs) provided by users who are unaware of, or ignore, the non-functional requirements (NFRs). This paper presents ongoing research which aims at managing NFRs during the software development process. Establishing the relative priority of each NFR, and obtaining a rough estimate of the effort and risk associated with it, is integral to the software development process and to resource management. Our …", "num_citations": "22\n", "authors": ["414"]}
{"title": "Establishing reuse measurement practices in SAP requirements engineering\n", "abstract": " The paper reports on first attempts to define, apply and fully integrate some reuse measurement practices into the SAP requirements engineering activities. It addresses all the facets of the context for SAP requirements reuse measurement and indicates who reuse metrics data are collected for, where and when during the RE process reuse measurements are made, what counting standards are appropriate, and what action items can be taken based on the reuse measurements.", "num_citations": "21\n", "authors": ["414"]}
{"title": "A systematic literature review on requirement prioritization techniques and their empirical evaluation\n", "abstract": " [Context and Motivation] Many requirements prioritization approaches have been proposed, however not all of them have been investigated empirically in real-life settings. As a result, our knowledge of their applicability and actual use is incomplete. [Question/problem] A 2007 systematic review on requirements prioritization mapped out the landscape of proposed prioritization approaches and their prioritization criteria. To understand how this sub-field of requirements engineering has developed since 2007 and what evidence has been accumulated through empirical evaluations, we carried out a literature review that takes as input publications published between 2007 and 2019. [Principle ideas/results] We evaluated 102 papers that proposed and/or evaluated requirements prioritization methods. Our results show that the newly proposed requirements prioritization methods tend to use as basis fuzzy logic and …", "num_citations": "20\n", "authors": ["414"]}
{"title": "Approaching the ERP project cost estimation problem: An experiment\n", "abstract": " This poster reports on a solution to ERP project cost estimation and on results from its first experimental application.", "num_citations": "19\n", "authors": ["414"]}
{"title": "Six degrees of success or failure in ERP requirements engineering: experiences with the ASAP process\n", "abstract": " In this paper, we build on previous work inferring lessons learnt from five years of experience in using generic offthe-shelf requirements engineering (RE) processes in Enterprise Resource Planning (ERP) projects [7]. We identify and discuss six ways that the application of a generic RE process model can succeed or fail. The distinction between success and failure is not always immediately evident.", "num_citations": "19\n", "authors": ["414"]}
{"title": "Developing an Inter-Enterprise Alignment Maturity Model: Research Challenges and Solutions.\n", "abstract": " Business-IT alignment is pervasive today, as organizations strive to achieve competitive advantage. Like in other areas, eg, software development, maintenance and IT services, there are maturity models to assess such alignment. Those models, however, do not specifically address the aspects needed for achieving alignment between business and IT in inter-enterprise settings. In this paper, we present the challenges we face in the development of an inter-enterprise alignment maturity model, as well as the current solutions to counter these problems.", "num_citations": "18\n", "authors": ["414"]}
{"title": "How practitioners approach gameplay requirements? An exploration into the context of massive multiplayer online role-playing games\n", "abstract": " Gameplay requirements are central to game development. In the business context of massive multiplayer online role-playing games (MMOGs) where game companies' revenues rely on players' monthly subscriptions, gameplay is also recognized as the key to player retention. However, information on what gameplay requirements are and how practitioners `engineer' them in real life is scarce. This exploratory study investigates how practitioners developing MMOGs reason about gameplay requirements and handle them in their projects. 12 practitioners from three leading MMOGs-producing companies were interviewed and their gameplay requirements documents were reviewed. The study's most important findings are that in MMOG projects: (1) gameplay requirements are co-created with players, (2) are perceived and treated by practitioners as sets of choices and consequences, (3) gameplay is endless within a …", "num_citations": "16\n", "authors": ["414"]}
{"title": "Understanding success and failure profiles of ERP requirements engineering: an empirical study\n", "abstract": " Organizations adopting Enterprise Resource Planning (ERP) are also adopting standard ERP- vendor-specific process models for engineering their requirements. Making successfully a live process out of such a model is hard. Maturity assessment frameworks can help ERP adopters identify and understand those practices which help their ERP processes succeed and those which do not. This paper deploys a Requirements Engineering maturity model to examine variations in instantiations of a standard ERP RE process. We draw on our previous results and our lessons learnt from eight years of experience in using ERP RE processes.", "num_citations": "16\n", "authors": ["414"]}
{"title": "A systematic mapping study on crowdsourced requirements engineering using user feedback\n", "abstract": " Crowdsourcing is an appealing concept for achieving good enough requirements and just‐in‐time requirements engineering (RE). A promising form of crowdsourcing in RE is the use of feedback on software systems, generated through a large network of anonymous users of these systems over a period of time. Prior research indicated implicit and explicit user feedback as key to RE‐practitioners to discover new and changed requirements and decide on software features to add, enhance, or abandon. However, a structured account on the types and characteristics of user feedback useful for RE purposes is still lacking. This research fills the gap by providing a mapping study of literature on crowdsourced user feedback employed for RE purposes. On the basis of the analysis of 44 selected papers, we found nine pieces of metadata that characterized crowdsourced user feedback and that were employed in seven …", "num_citations": "15\n", "authors": ["414"]}
{"title": "Focus Group: Cost-effective and Methodologically Sound Ways to Get Practitioners Involved in Your Empirical RE Research.\n", "abstract": " Focus groups are a qualitative research method helping researchers collect and analyze information from practitioners in industry, in order to better understand how a Requirements Engineering (RE) phenomenon happens from the perspective of those working in the field. It is useful in both exploratory and confirmatory studies. While focus groups have been popular in studies of other disciplines where a researcher investigates ‘why’,‘what’and ‘how’aspects of a phenomenon of interest in practical context, the potential of this research method is under-exploited in RE. One reason could be that computer science, software engineering and Information Systems (IS) programs in most universities do relatively little to prepare their master students and PhD researchers on the use of this research method. As a result, the method is partly understood and is sub-optimally or incorrectly applied, or avoided altogether. This may translate in a missed opportunity for RE researchers to engage with practitioners in industry-relevant research that could be both done in costeffective and pragmatic way.This mini-tutorial provides some practical suggestions on how to evaluate the fitness of focus group research techniques to a research context, how to design a good enough focus-group-research process, how to counter validity threats and how to report and publish the results.", "num_citations": "15\n", "authors": ["414"]}
{"title": "The inter-organizational business case in ES implementations: exploring the impact of coordination structures and their properties\n", "abstract": " Developing the business case (BC) for an inter-organizational network is a major challenge. Factors like competition and differences in semantics between actors influence the stakeholders’ willingness to share information necessary for the BC development. In this paper we develop an exploratory framework showing the effect that coordination structure and project scope have on the development of a shared BC. We defined several coordination properties, such as competition, decision making location and decision power that mitigate this effect. We applied the framework in a case study where a BC is developed for an inter-organizational network. Our findings show that current BC development methods need to be re-stated and complemented by extra tools and interventions to support stakeholders in the inter-organizational specific setting.", "num_citations": "15\n", "authors": ["414"]}
{"title": "Using measurements to support real-option thinking in agile software development\n", "abstract": " This position paper applies real-option-theory perspective to agile software development. We complement real-option thinking with the use of measurements to support midcourse decision-making from the viewpoint of the client. Our position is motivated by using empirical data gathered from secondary sources.", "num_citations": "15\n", "authors": ["414"]}
{"title": "Can app changelogs improve requirements classification from app reviews? an exploratory study\n", "abstract": " [Background] Recent research on mining app reviews for software evolution indicated that the elicitation and analysis of user requirements can benefit from supplementing user reviews by data from other sources. However, only a few studies reported results of leveraging app changelogs together with app reviews.[Aims] Motivated by those findings, this exploratory experimental study looks into the role of app changelogs in the classification of requirements derived from app reviews. We aim at understanding if the use of app changelogs can lead to more accurate identification and classification of functional and non-functional requirements from app reviews. We also want to know which classification technique works better in this context.[Method] We did a case study on the effect of app changelogs on automatic classification of app reviews. Specifically, manual labeling, text preprocessing, and four supervised …", "num_citations": "14\n", "authors": ["414"]}
{"title": "Relational-model based change management for non-functional requirements: Approach and experiment\n", "abstract": " In software industry, many organizations either focus their traceability efforts on Functional Requirements (FRs) or else fail entirely to implement an effective traceability process. Non-Functional Requirements (NFRs) such as security, safety, performance, and reliability are treated in a rather ad hoc fashion and are rarely traced. This is mainly because of the unique nature of NFRs. They are subjective, relative and they tend to become scattered among multiple modules when they are mapped from the requirements domain to the solution space. Furthermore, NFRs can often interact, in the sense that attempts to achieve one NFR can help or hinder the achievement of other NFRs at particular software functionality. Such an interaction creates an extensive network of interdependencies and tradeoffs among NFRs which is not easy to trace. In a previous work, we proposed a conceptualization of NFRs through the NFRs …", "num_citations": "14\n", "authors": ["414"]}
{"title": "Striving for balance: A look at gameplay requirements of massively multiplayer online role-playing games\n", "abstract": " Engineering gameplay requirements is the most important task for game development organizations. Game industry discourse is concerned with continuous redesign of gameplay to enhance players' experience and boost game's appeal. However, accounts of gameplay requirements practices are rare. In responding to calls for more research into gameplay requirements engineering, we performed an exploratory study in the context of massively multiplayer online role-playing games (MMORPGs), from the perspective of practitioners involved in the field. Sixteen practitioners from three leading MMORPG-producing companies were interviewed and their gameplay requirements documents were reviewed. Interviewing and qualitative data analysis occurred in a cyclical process with results at each stage of the study informing decisions about data collection and analysis in the next.The analysis revealed a process of …", "num_citations": "13\n", "authors": ["414"]}
{"title": "Depicting the smarter cities of the future: A systematic literature review & field study\n", "abstract": " Smart Cities have become one of the most interesting research topics for governments, businesses and researchers in the last few years. Being a Smart City implies a competitive edge compared to other cities in terms of economic growth, sustainability, human resources and governance. Therefore, more and more governments pursue this future vision and hop onto the Smart City `Bandwagon'. However, the development of Smart City solutions is faced with challenges since there is no clear definition for Smart Cities yet. This paper provides a review on what challenges arise when designing Smart City solutions to provide a complete overview of identified challenges. This paper carries out a systematic literature review of publications between 2008 and 2016 which will be compared with a field study on Smart City initiatives conducted by the municipality of Enschede to develop a requirements framework for these …", "num_citations": "13\n", "authors": ["414"]}
{"title": "How do real options concepts fit in agile requirements engineering?\n", "abstract": " Agile requirements engineering is driven by creating business value for the client and heavily involves the client in decision-making under uncertainty. Real option thinking seems to be suitable in supporting the client's decision making process at inter-iteration time. This paper investigates the fit between real option thinking and agile requirements engineering. We first look into previously published experiences in the agile software engineering literature to identify (i) `experience clusters' suggesting the ways in which real option concepts fit into the agile requirements process and (ii) `experience gaps' and under-researched agile requirements decision-making topics which require further empirical studies. Furthermore, we conducted a cross-case study in eight agile development organizations and interviewed 11 practitioners about their decision-making process. The results suggest that options are almost always …", "num_citations": "13\n", "authors": ["414"]}
{"title": "Preliminary results in a multi-site empirical study on cross-organizational ERP size and effort estimation\n", "abstract": " This paper reports on initial findings in an empirical study carried out with representatives of two ERP vendors, six ERP adopting organizations, four ERP implementation consulting companies, and two ERP research and advisory services firms. Our study’s goal was to gain understanding of the state-of-the practice in size and effort estimation of cross-organizational ERP projects. Based on key size and effort estimation challenges identified in a previously published literature survey, we explored some difficulties, fallacies and pitfalls these organizations face. We focused on collecting empirical evidence from the participating ERP market players to assess specific facts about the state-of-the-art ERP size and effort estimation practices. Our study adopted a qualitative research method based on an asynchronous online focus group.", "num_citations": "13\n", "authors": ["414"]}
{"title": "Early quantitative assessment of non-functional requirements\n", "abstract": " Non-functional requirements (NFRs) of software systems are a well known source of uncertainty in effort estimation. Yet, quantitatively approaching NFR early in a project is hard. This paper makes a step towards reducing the impact of uncertainty due to NRF. It offers a solution that incorporates NFRs into the functional size quantification process. The merits of our solution are twofold: first, it lets us quantitatively assess the NFR modeling process early in the project, and second, it lets us generate test cases for NFR verification purposes. We chose the NFR framework as a vehicle to integrate NFRs into the requirements modeling process and to apply quantitative assessment procedures. Our solution proposal also rests on the functional size measurement method, COSMICFFP, adopted in 2003 as the ISO/IEC 19761 standard. We extend its use for NFR testing purposes, which is an essential step for improving NFR development and testing effort estimates, and consequently for managing the scope of NFRs. We discuss the advantages of our approach and the open questions related to its design as well.", "num_citations": "13\n", "authors": ["414"]}
{"title": "Towards agile security risk management in RE and beyond\n", "abstract": " Little attention has been given so far to the process of security risk management at the early stages of system development. Security has been addressed by isolated security assurance practices, some of which consider risks and mitigations but they do not provide an overview of the overall security state of the system being developed. This paper takes the position that (1) these isolated security assurance practices should be fully integrated and should be embedded in short iterations of risk assessment, treatment and acceptance, providing input for updating security requirements and for security risk management, and that (2) available empirical data from public catalogs and databases should be used as a source of expertise, to leverage past experiences, and therefore reduce, although not eliminate, subjectivity of human judgment. Borrowing from the agile software development and project management …", "num_citations": "12\n", "authors": ["414"]}
{"title": "What practitioners think of inter-organizational ERP requirements engineering practices: focus group results\n", "abstract": " Empirical studies on requirements engineering for inter-organizational enterprise resource planning (ERP) systems have demonstrated that the ERP vendor-provided prescriptive models for ERP roll-outs make tacit assumptions about the ERP adopter’s context. This, in turn, leads to the implementation of suboptimal solutions. Specifically, these models assume that ERP implementations happen within a single company, and so they pay only scant attention to the stakeholders’ requirements for inter-organizational coordination. Given this backdrop, the first author proposed 13 practices for engineering the ERP coordination requirements in previous publications. This paper reports a confirmatory study evaluating those practices. Using an online focus group, the authors collected and analyzed practitioners’ feedback and their experiences to understand the extent to which the proposed practices are indeed …", "num_citations": "12\n", "authors": ["414"]}
{"title": "Complementing approaches in ERP effort estimation practice: an industrial study\n", "abstract": " Projects implementing enterprise resource planning (ERP) solutions are characterized by specific context factors such as high level of reuse, scope of the ERP modules, interdependent functionality, and use of vendor-specific standard implementation method, all of which impose risks known to cause various degrees of project failure. We suggest a remedy to this issue by tackling it from a portfolio management perspective. Our solution rests on earlier work by other authors and is a combination of a classic cost estimation method (COCOMO II), a Monte Carlo simulation process, and a portfolio management model. We report on the results of a case study done in a company site in the telecommunication sector.", "num_citations": "12\n", "authors": ["414"]}
{"title": "ERP effort estimation based on expert judgments\n", "abstract": " A new technology shift brings to the ERP domain a change in the industry and a new platform build on in-memory optimized databases, introduced and known as SAP HANA [1]. This technology shift in the ERP domain led to SAP's ERP on HANA, the solution where the ERP suite is offered on the same platform as ERP Services such as Business Analytics. The integration of ERP Services and the ERP suite brings to the industry new opportunities to \"fine tune\" customer and industry specific business processes. This radical shift in innovation brings with it new challenges in terms of ERP effort estimation. No longer can we rely on a single method such as functional size measurement methods, due to the wide range of customization possibilities. This shift from a typical predefined solution scope to a highly customizable landscape poses a challenge to project estimation practitioners as the functional size estimation …", "num_citations": "11\n", "authors": ["414"]}
{"title": "Cooperation between software development and operations: a literature review\n", "abstract": " Many software development organizations make a structural division of their software departments. A popular one is separating software development and operations. Organizations have made this division in order to gain higher efficiency by achieving economies of scale and specialization. This paper provides an overview of the research literature related to DevOps. DevOps is a collection of principles and practices that try to improve cooperation between development and operations in organizations which separate these two functions. We found that research about DevOps is still in its infancy despite its widespread adoption in industry. We also find that how companies implement DevOps depends on contextual factors such as culture, level of automation, measurement instruments and how information is shared.", "num_citations": "10\n", "authors": ["414"]}
{"title": "Uncertain context factors in erp project estimation are an asset: Insights from a semi-replication case study in a financial services firm\n", "abstract": " This paper reports on the findings of a case study in a company in the financial services sector in which we replicated the use of a previously published approach to systematically balance the contextual uncertainties in the estimation of Enterprise Resource Planning (ERP) projects. The approach is based on using three techniques, a parametric model, namely COCOMO II, a portfolio management model, and Monte Carlo simulations. We investigated (i) whether the adjustment of uncertain cost drivers in the COCOMO II model increases the chance of project success in a portfolio of ERP projects, (ii) which cost drivers of the COCOMO II model can be adjusted in a way that maximized the chance of portfolio success under time constraints, and (iii) which cost drivers of the COCOMO II model can be adjusted in a way that maximized the chance of portfolio success under effort constraints. We found that 11 COCOMO II …", "num_citations": "10\n", "authors": ["414"]}
{"title": "Towards an early software effort estimation based on functional and non-functional requirements\n", "abstract": " The increased awareness of the non-functional requirements as a key to software project and product success makes explicit the need to include them in any software project effort estimation activity. However, the existing approaches to defining size-based effort relationships still pay insufficient attention to this need. This paper presents a flexible, yet systematic approach to the early requirements-based effort estimation, based on Non-Functional Requirements ontology. It complementarily uses one standard functional size measurement model and a linear regression technique. We report on a case study which illustrates the application of our solution approach in context and also helps evaluate our experiences in using it.", "num_citations": "10\n", "authors": ["414"]}
{"title": "Understanding functional reuse of ERP requirements in the telecommunication sector: an empirical study\n", "abstract": " This paper is an empirical study on the application of Function Points (FP) and a FP-based reuse measurement model in Enterprise Resource Planning (ERP) projects in three organizations in the telecommunication sector. The findings of the study are used to compare the requirements reuse for one particular package, namely SAP. We found (1) that reuse is possible up to 80% at best, and (2) that, while for some modules, the organizations achieved the same levels of reuse, for other modules, the organizations' levels of reuse varied widely. We conclude with some implications of our findings for both practitioners and researchers.", "num_citations": "9\n", "authors": ["414"]}
{"title": "Capability-based planning with TOGAF® and ArchiMate®\n", "abstract": " Capability-based planning comes to incorporate the development of the capabilities into the architectural effort following the ADM cycle of TOGAF, and everything that this pertains.  A complete method for capability-based planning starts from the business strategy, then goes through the determination of the strategic business capabilities, and concludes by guiding the architectural work up to the post-deployment of the business capabilities. This method consists of three phases that respectively address the why, the what and the how of the process.  Since capabilities are not currently addressed by the ArchiMate modeling language, four new concepts are proposed for extension: capability, capability increment, metric, and resource, as those essential for modeling purposes. ArchiMate’s syntax is then extended with these concepts, and four new viewpoints are distinguished which focus on different architectural areas. The proposed method and language extension are showcased by means of an example, using the fictional organization ArchiSurance as a case. Along the way, a number of models are created, most of them including prescriptive elements.  The most important aspects of the above body of work have been validated with four experienced professionals from the areas of Enterprise Architecture and the Business.", "num_citations": "9\n", "authors": ["414"]}
{"title": "Exploring the business case development process in inter-organizational enterprise system implementations\n", "abstract": " Creating and negotiating an inter-organizational business case (BC) for multiple-stakeholder enterprise systems is a major challenge. This paper looks closer into the factors that influence the stakeholders’ willingness to share information necessary for the BC development. The authors develop an explanatory framework showing the effect that project constellation has on the development of a shared BC. They identify several factors, such as goal consensus, cultural and semantic similarities and willingness to share information, that mitigate this effect. Subsequently, the authors apply the framework in an inter-organizational case study in which a BC is developed. The findings show that current BC development methods need to be re-stated and complemented by new tools and interventions to support stakeholders in the inter-organizational specific setting. The authors elaborate on the possibilities that group …", "num_citations": "9\n", "authors": ["414"]}
{"title": "Getting the client into the loop in information system modelling courses\n", "abstract": " Information system modelling is more than a translation of requirements from one notation into another, it is part of the requirements analysis process. Adding explicitness and making design choices should provide critical feedback to the requirements document being modelled. We want our students to develop such a critical attitude. However, in our educational system it is institutionalized that students get a `perfect' problem description and don't have to align with anyone in order to solve the problem (other than the odd question of clarification to the instructor). To make students realize that things are different in the real world, we have added assignments in which the students (1) make an initial class diagram based on a written specification, and (2) talk with a more knowledgeable stakeholder to question their understanding of what is desired. In this position paper we describe the set-up of these assignments.", "num_citations": "9\n", "authors": ["414"]}
{"title": "A best practice based approach to CASE-tool selection\n", "abstract": " Best software practices are adopted and adapted by software organizations to support improvement goals. Traditionally, CASE tools have been considered as one of the most important means for implementing best practices. Today's CASE technology offers much process optimization and increases the options for how and where improvements could be done. However, CASE tool expenses are typically high due to their steep learning curve. The selection of the right CASE tool has, therefore become more important in ensuring the CASE investment delivers value for money. This paper introduces a best practice based approach to CASE tool selection so the potentiality of CASE tools to support the development of a process-oriented software organization can be assessed. The paper derives three sets of CASE attributes pertinent to the best practices addressed in three major reference process architectures …", "num_citations": "9\n", "authors": ["414"]}
{"title": "ARIS Based Reference Model for Benchmarking\n", "abstract": " Benchmarking is today an emerging strategy for improving the competitiveness of the enterprise. Its importance significantly increases when it is a part of a business process (re) engineering project, and serves as a basis for taking process perspective and creating process vision (Davenport, 1993). Conducting a benchmarking study usually is a taxing job that requires a great deal of specialized information in order to perform the work well. According to American Productivity and Quality Center (APQC), a study can range anywhere from over $100 000 to $5 000, depending mainly on company's knowledge and competency in benchmarking, the studied objects and the benchmarking partners. Moreover, recent research of APQC s International Benchmarking Clearing House revealed that 95% of respondents believe most companies do not know how to benchmark (Biesada, 1992). The objective of our work is to …", "num_citations": "9\n", "authors": ["414"]}
{"title": "Understanding what industry wants from requirements engineers: An exploration of RE jobs in Canada\n", "abstract": " [Background] Prior research on the professional occupation of Requirements Engineering (RE) in Europe and Latin America indicated incongruities between RE practice as perceived by industry and as in textbooks, and conducted detailed analysis of both RE and non-RE job aspects. Relatively little is published on the RE competencies and skills industry expects, and seldom investigated the application domains calling for RE professionals.[Aims] We felt motivated by those findings to carry out research on RE job posts in a North-American market. Especially, we focused solely on RE-specific tasks, competencies and skills, from the perspective of defined position categories. Plus, we intend to explore the application domains in need for RE professionals to reveal the wide range of RE roles in industry.[Methods] Coding process, analysis, and synthesis were applied to the textual descriptions of the 190 RE job ads …", "num_citations": "8\n", "authors": ["414"]}
{"title": "Security requirements engineering in the agile era: How does it work in practice?\n", "abstract": " Currently many software companies attempt the integration of agile project delivery models and security requirements engineering (RE). However, very little is published on how this is achieved in real-life settings. This paper reports on results from a documentary study initiated to understand the agile-ready security practices that organizations use. We selected seven well-documented Security RE frameworks for Agile projects that have been used in practice and carried out a qualitative thematic analysis based on documents describing the frameworks and their supposed use in detail. This resulted in a list of solution practices that focus on introducing artefacts, organizational roles, competencies and activities in order to make sure that security RE is done systematically in agile project organizations. Our conclusion is that Security RE adds up to the documentation in an agile project, as teams introduce new story …", "num_citations": "8\n", "authors": ["414"]}
{"title": "Requirements for smart cities: Results from a systematic review of literature\n", "abstract": " Smart cities are gaining increasingly more importance in both research and business circles. Much effort is spent to defining what a smart city is and how it could be realized with today's or future technologies. However, from requirements engineering perspective, our knowledge of smart cities is fragmented; little is known about the requirements for smart cities as complex systems, or as systems of systems, in specific application domains. In this paper, we elicit requirements for smart city systems by carrying out a systematic review of scientific literature focused on the so-called “hard” domains of smart cities. Based on 32 selected publications, we gathered and classified requirements in respect to three types of smart city systems (instrumented, interconnected, and intelligent systems) and four classes of requirements: end-to-end experience, architectural, security, and infrastructure requirements. Our most important …", "num_citations": "8\n", "authors": ["414"]}
{"title": "How to reduce software development cost with personnel assignment optimization: Exemplary improvement on the hungarian algorithm\n", "abstract": " Reasonable reduction and controlling of software cost is always a challenge for software companies. To estimate software development cost more precisely, current research effort is focused on improving the measurement of software size or complexity by combining or adjusting key cost drivers, such as function points and other observable project context factors. However, personnel factors are seldom investigated or treated in depth as a way to reduce the estimated software development cost. On the premise that a software project is decomposed in a number of tasks, and that predetermined developers are available as resources for it, this paper intends to optimize the allocation of available personnel for lower development cost. In this research, we consider the problem of allocating competent developers to suitable tasks as an unbalanced personnel assignment problem, and improve the traditional Hungarian …", "num_citations": "8\n", "authors": ["414"]}
{"title": "Business-IT alignment domains and principles for networked organizations: A qualitative multiple case study\n", "abstract": " Applying principles for business-IT alignment in networked organizations seems to be key for their survival in competitive environments. In this paper, we present a qualitative multiple case study conducted in three collaborative networked organizations: (i) an outsourcing relation between an international IT and business integrator and a mass-marketed service provider, (ii) an inter-organizational collaboration among governmental departments of the state of Tamaulipas in Mexico, and (iii) a networked organization between the province Overijssel, the municipalities Zwolle and Enschede, the water board district Regge & Dinkel and Royal Grolsch N.V. in the Netherlands. Drawing from this case study, we derive four principles that networked organizations seem to adhere to when striving for alignment at a certain level of maturity.", "num_citations": "8\n", "authors": ["414"]}
{"title": "A meta-model for the assessment of non-functional requirement size\n", "abstract": " Non-functional requirements (NFRs) pose unique challenges in estimating the effort it would take to implement them. This is mainly because of their unique nature; NFRs are subjective, relative, interactive and tending to have a broad impact on the system as a whole. Nevertheless, it is crucial, when making decisions about the scope of software by given resources and budget, to furnish a justifying and quantitative analysis based on both functional requirements (FRs) and NFRs. This paper presents a meta-model which complements the FR dimension with the NFRs as another dimension to be used in effort estimation approaches. The meta-model is deployed to extend the use of the COSMIC functional size measurement method to measure the size of NFRs, as effort is a function of size. We report on a case study to demonstrate our approach in context.", "num_citations": "8\n", "authors": ["414"]}
{"title": "Challenges and Solutions in Planning Information Systems for Networked Value Constellations\n", "abstract": " Nowadays businesses often decide to form networked value constellations in order to satisfy complex customer needs. To fulfill the value-based requirements of an e-Business idea and to realize the coordination of such a multi-actor network an adequate underlying information systems architecture has to be conceptualized. This paper discusses the applicability of classical information system planning approaches, such as Information Engineering to cross-organizational settings expressed through value-based requirements. On the basis of this analysis several requirements for the enhancement and adaptation of Information Engineering-like methodologies for e-Business ideas are defined for the purpose of enabling alignment between a value- based business context and the information systems architecture in a networked environment. The paper proposes a way to derive data-orientation from value-orientation, i.e. an enterprise model from a value model. This in turn enables afterwards the straightforward use of traditional data-oriented techniques for value-based business models.", "num_citations": "8\n", "authors": ["414"]}
{"title": "Evaluating the value-added benefits of using requirements reuse metrics in ERP projects\n", "abstract": " Measurement programs often go astray and fail to reach full success because of misconceptions and differences in expectations about the benefits to be realized as a result of a measurement exercise. This paper suggests how to plan and apply requirements reuse measurement in a business focussed way, by doing frequent benefits assessments. We describe an approach to analyzing, evaluating and tracking the reuse metrics usage patterns in Enterprise Resource Planning (ERP) projects and the benefits gained from integrating requirements reuse measurement practices in the ERP requirements elicitation- modelling- negotiation cycle. Relationships between requirements measurement activities and requirements engineering activities and deliverables are studied in the context of SAP R/ 3 implementation projects.", "num_citations": "8\n", "authors": ["414"]}
{"title": "An assessment of the effects of requirements reuse measurements on the ERP requirements engineering process\n", "abstract": " Setting realistic expectations for a requirements measurement exercise and assessing the real benefits resulting from the implementation of metrics in Requirements Engineering (RE) is a key challenge for many information systems (IS) organizations. This paper describes how a project team can demonstrate a connection between efforts invested in requirements reuse measurement and business results in Enterprise Resource Planning (ERP) projects. We provide an approach to analyzing and assessing the benefits gained from integrating requirements reuse measurement practices in the ERP RE process. Dependencies between requirements measurement activities and RE activities and deliverables are studied in the context of SAP R/3 implementation projects.", "num_citations": "8\n", "authors": ["414"]}
{"title": "Designing Software Architecture to Support Continuous Delivery and DevOps: A Systematic Literature Review.\n", "abstract": " This paper presents a systematic literature review of software architecture approaches that support the implementation of Continuous Delivery (CD) and DevOps. Its goal is to provide an understanding of the stateof-the-art on the topic, which is informative for both researchers and practitioners. We found 17 characteristics of a software architecture that are beneficial for CD and DevOps adoption and identified ten potential software architecture obstacles in adopting CD and DevOps in the case of an existing software system. Moreover, our review indicated that micro-services are a dominant architectural style in this context. Our literature review has some implications: for researchers, it provides a map of the recent research efforts on software architecture in the CD and DevOps domain. For practitioners, it describes a set of software architecture principles that possibly can guide the process of creating or adapting software systems to fit in the CD and DevOps context.", "num_citations": "7\n", "authors": ["414"]}
{"title": "Play-testing and requirements engineering: implications for research and teaching\n", "abstract": " In Requirements Engineering (RE) for large scale game systems, play-testing is an important activity that is used to validate requirements from players' perspective. Play-testers are not professionals that are involved in the process of RE. They are not professional testers, either. Yet, their feedback in terms of perceptions and experiences of the early prototypes of a game, have a decisive impact on what the RE-professionals do next in the RE process. This position paper presents a qualitative study that sought to discover who takes the role of play-testers and what kind of feedback play-testers generate in the early stages of RE for games. The case study responds to the observation that no textbook on RE or software engineering addresses play-testing as a phenomenon, and that classic Computer Science programs at universities teach testing techniques mostly in the context of embedded systems, hence students …", "num_citations": "7\n", "authors": ["414"]}
{"title": "ERP Services Effort Estimation Strategies Based on Early Requirements.\n", "abstract": " ERP clients and vendors necessarily estimate their project interventions at a very early stage, before the full requirements to an ERP solution are known and often before a contract is finalized between a vendor/consulting company and a client. ERP project estimation at the stage of early requirements in a contractual setting has been challenging as it requires the inclusion and the availability of multiple experts, each being a specialist in a particular domain, eg solution architect, technical architect, consultant project manager. Today’s highly volatile and customized ERP landscape demands a new approach to estimate effort by leveraging ERP professionals’ tacit knowledge and expert judgments, as well as information from historical project databases (if available). This paper presents three ERP Service estimation strategies that leverage the strengths of both Functional Size Measurement (FSM) and expert-judgment-based estimation techniques. These strategies use a more structured approach to reduce the effects of expert bias and avoid common pitfalls associated with FSM and expert judgment-based estimation.", "num_citations": "7\n", "authors": ["414"]}
{"title": "Approximate COSMIC Functional Size--Guideline for Approximate COSMIC Functional Size Measurement\n", "abstract": " The COSMIC method provides a standardized way of measuring the functional size of software from the functional domains commonly referred to as 'business application' or 'Management Information Systems' (MIS) and 'real-time' software, and hybrids of these. In practice it is often sufficient to measure a functional size approximately. Typical situations where such a need arises are early in the life of a project, before the functional user requirements ('FUR') have been specified down to the level of detail where the precise size measurement is possible or when a measurement is needed, but there is insufficient time or no need to measure the required size using the standard method. The guideline describes the current state of the art with regard to approximate COSMIC functional size measurement. All proposed COSMIC approximation methods rely on determining some average of the size(s) and/or number(s) of …", "num_citations": "7\n", "authors": ["414"]}
{"title": "What enterprise architecture and enterprise systems usage can and can not tell about each other\n", "abstract": " There is an increased awareness of the roles that enterprise architecture (EA) and enterprise systems (ES) play in today’s organizations. EA and ES usage maturity models are used to assess how well companies are capable of deploying these two concepts while striving to achieve strategic corporate goals. The existence of various architecture and ES usage models raises questions about how they both refer to each other, eg if a higher level of architecture maturity implies a higher ES usage level. This paper compares these two types of models by using literature survey results and case-study experiences. We conclude that (i) EA and ES usage maturity models agree on a number of critical success factors and (ii) in a company with a mature architecture function, one is likely to observe, at the early stages of ES initiatives, certain practices associated with a higher level of ES usage maturity.", "num_citations": "7\n", "authors": ["414"]}
{"title": "Reuse measurement in the ERP requirements engineering process\n", "abstract": " Reusing business process and data requirements is fundamental to the development of modern Enterprise Resource Planning systems. Currently, measuring the benefits from ERP reuse is attracting increasing attention, yet most organizations have very little familiarity with approaches to evaluating quantitatively requirements reuse customers have achieved. This paper is intended to provide a solid understanding of ERP requirements reuse measurement. It describes the first results obtained from the integration of explicit and systematic reuse measurement with standard requirements engineering (RE) practices in ERP implementation projects. Aspects of measurement planning, execution and reuse data usage are analyzed in the context of SAP R/3 implementation. As a preliminary result of our study, the paper concludes that the proposed approach shows considerable promise.", "num_citations": "7\n", "authors": ["414"]}
{"title": "Modeling and analyzing digital business ecosystems: an approach and evaluation\n", "abstract": " Joint actions with other businesses are key to the survival of many companies today. Advanced collaboration technologies support companies in synchronizing their joint actions by forming digital business ecosystems (DBE). While such technologies are beneficial to companies, their use might also be potentially detrimental due to the increased complexity they add to the management of the BDE partners' collaboration and due to the partners' lack of knowledge in coping with this complexity. For companies to deal with the complexities in their dynamic environments, they need approaches for mapping out and analyzing their DBEs. Due to the newness of the DBE concept, how to model and analyze DBEs is hardly known. Yet, this is necessary, as partners in a DBEs want to know if their DBEs promotes or prohibits profit. This article proposes an approach to modelling and analyzing DBEs, based on the …", "num_citations": "6\n", "authors": ["414"]}
{"title": "Engineering of quality requirements as perceived by near-shore development centers' architects in Eastern Europe: the hole in the whole\n", "abstract": " Context: To software architects (SAs), the quality requirements (QRs) to a software system are key to designing the software architecture. However, understanding SAs' roles in the QRs engineering activities only recently became a topic in empirical requirements engineering research and very little is still known about QRs engineering from SAs' in large and distributed projects. Goal: This exploratory study aims at explicating how SAs are involved in engineering QRs in a specific distributed development setting, namely in organizations that distribute software development activities to closely located business units, known as near-shore development centres (NDCs), and in a specific geographic zone, namely Eastern Europe. Method: Based on interviews with 16 practitioners working on large projects in NDCs, we explicate the participation and involvement of NDCs' architects in QRs tasks. Results: We found that SAs …", "num_citations": "6\n", "authors": ["414"]}
{"title": "Sprint planning with a digital aid tool: lessons learnt\n", "abstract": " Managing the product's backlog is a major task in agile projects. This case study reports on one organization's experiences from the transition to a backlog management tool and its contribution to improving sprint planning. Our key lessons learnt are that a tool is particularly appropriate to organize and specify backlog items in a transparent manner and to handle dependencies. However, we also observed an overhead in backlog management and in reporting during meetings. The concrete project settings play the paramount role in whether such a tool helps or harms the process.", "num_citations": "6\n", "authors": ["414"]}
{"title": "A conceptual framework for research in cross-organizational ERP cost estimation\n", "abstract": " A Conceptual Framework for Research in Cross-organizational ERP Cost Estimation — University of Twente Research Information Skip to main navigation Skip to search Skip to main content University of Twente Research Information Logo Home Profiles Research Units Research Output Datasets Activities Prizes Press / Media Search by expertise, name or affiliation A Conceptual Framework for Research in Cross-organizational ERP Cost Estimation Maia Daneva, Roelf J. Wieringa Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Academic › peer-review Overview Original language Undefined Title of host publication Proceedings of Workshop on Requirements Engineering and Project Management in Software Projects (PROMan) Pages - Publication status Published - 30 Aug 2005 Keywords METIS-226677 Cite this APA Author BIBTEX Harvard Standard RIS Vancouver , …", "num_citations": "6\n", "authors": ["414"]}
{"title": "Multi-criteria and model-based analysis for project selection: An integration of capability-based planning, project portfolio management and enterprise architecture\n", "abstract": " Nowadays, organizations are faced with many investment decisions, many of which are related to the selection of projects the organization should undertake in order to achieve its strategic goals. However, these projects are often influenced by several drivers, such as specific concerns of the stakeholders, availability of resources, and varying levels of risk. Thus, organizations often encounter difficulties when having to make such investment decisions. To address this issue, we propose a method which integrates aspects of Project Portfolio Management, of Enterprise Architecture and of Capability-based planning. Our method also covers a comprehensive selection process, based on organizational capabilities, and analytical techniques, such as AHP and linear programming. We demonstrate the application of the method in the case of a large European energy supplier.", "num_citations": "5\n", "authors": ["414"]}
{"title": "Towards risk-driven security requirements management in agile software development\n", "abstract": " The focus on user stories in agile means non-functional requirements, such as security, are not always explicit. This makes it hard for the development team to implement the required functionality in a reliable, secure way. Security checklists can help but they do not consider the application’s context and are not part of the product backlog.             In this paper we explore whether these issues can be addressed by a framework which uses a risk assessment process, a mapping of threats to security features, and a repository of operationalized security features to populate the product backlog with prioritized security requirements. The approach highlights the relevance of each security feature to product owners while ensuring the knowledge and time required to implement security requirements is made available to developers. We applied and evaluated the framework at a Dutch medium-sized software …", "num_citations": "5\n", "authors": ["414"]}
{"title": "Empirical Validation of a Software Requirements Specification Checklist.\n", "abstract": " [Context/Motivation] For areas such as Government IT Procurement, the Software Requirements Specification (SRS) often forms the basis for a public procurement. In these cases, having domain knowledge is often mutually exclusive to knowing RE. Domain experts lacking the necessary RE experience face issues assessing the quality and correctness of the SRS. This especially forms a problem for situations where the SRS acts as the base for a proposal and resulting contract, which is why often third party RE experts are consulted for evaluating the SRS beforehand. These experts are highly motivated to improve their process and offer a more uniform and better service.[Question/problem] Is our developed checklist a valid instrument to support the RE practitioner in the SRS validation process?[Principal ideas/results] We propose to empirically evaluate the checklist in a live study. Participants of our Evaluation Study are asked to simulate the validation of a sample SRS, guided by our checklist. We will analyze the data from a post-use questionnaire at the end of the session using a mixed method approach to assess the quality and usability of our checklist and its expected impact on the validation process. This assessment will be part of the overall validation of our checklist.[Expected Contribution] We expect to gain knowledge regarding the quality of our instrument. Secondly, this live study contributes to the validation, and thus the realization of a practical tool to be used by RE practitioners worldwide.", "num_citations": "5\n", "authors": ["414"]}
{"title": "Implementations of service oriented architecture and agile software development: What works and what are the challenges?\n", "abstract": " Today many organizations use service-oriented architecture and agile software development as their software paradigms. While both certainly have their advantages, in the fields of Empirical Software Engineering and Information Systems these have been treated in relative isolation and their impact on each other is not well understood. This paper performs a grounded theory research by empirically analyzing professional blog posts published in IBM's Developerworks platform, to find good practices and common pitfalls of using a service-oriented architecture and agile software development together. The perspective taken in this study is the one of service-oriented architecture practitioners involved in agile projects. We found that continuous integration, collaboration, governance and continuous improvement are good practices that result out of merging the two paradigms. We found that the challenges of the joint …", "num_citations": "5\n", "authors": ["414"]}
{"title": "Requirements engineering: foundation for software quality\n", "abstract": " Welcome to the proceedings of the 22nd edition of REFSQ: the International Working Conference on Requirements Engineering–Foundation for Software Quality! Requirements engineering (RE) has been recognized as a critical factor that impacts the quality of software, systems, and services. Since the term “requirements engineering‿ was coined, the community of practitioners and researchers has been working tirelessly on the identification, characterization, and evaluation of the multifaceted relationships between aspects of requirements processes, artifacts, and methods and aspects of software quality. The REFSQ working conference series has been well established as Europe’s premier meeting place in RE and as one of the leading international forums dedicated to the conversation on RE and its many relationships to quality.", "num_citations": "5\n", "authors": ["414"]}
{"title": "Understanding maturity of collaborative network organizations by using B-ITa processes\n", "abstract": " Organization’s concerns as controlling costs, improving quality, increasing effectiveness, and managing risk increasingly impose strong requirements on Business-IT alignment (B-ITa). Several Maturity Models came into being for considering improvement actions in B-ITa. The IT-Enabled Collaborative Network organizations (ICoNOs) maturity model specifically addresses the processes needed for achieving B-ITa in networked organizations. We have evaluated ICoNOs maturity model on a case study in an Asian organization. On the basis of this study, we propose to introduce a new domain named as “Cost Management”.", "num_citations": "5\n", "authors": ["414"]}
{"title": "Integrating reuse measurement practices into the ERP requirements engineering process\n", "abstract": " The management and deployment of reuse-driven and architecture-centric requirements engineering processes have become common in many organizations adopting Enterprise Resource Planning solutions. Yet, little is known about the variety of reusability aspects in ERP projects at the level of requirements. Neither, we know enough how exactly ERP adopters benefit from reuse as part of the requirements engineering process. This paper sheds some light into these questions and suggests a practical approach to applied ERP requirements reuse measurement by incorporating reuse metrics planning as part of the implementation of metrics on an ERP project. Relevant process integration challenges are resolved in the context of SAP R/3 implementation projects in which the author participated while being employed at the second largest telecommunication company in Canada.", "num_citations": "5\n", "authors": ["414"]}
{"title": "Correlating architecture maturity and enterprise systems usage maturity to improve business/IT alignment\n", "abstract": " This paper compares concepts of maturity models in the areas of Enterprise Architecture and Enterprise Systems Usage. We investigate whether these concepts correlate, overlap and explain each other. The two maturity models are applied in a case study. We conclude that although it is possible to fully relate constructs from both kinds of models, having a mature architecture function in a company does not imply a high Enterprise Systems Usage maturity.", "num_citations": "5\n", "authors": ["414"]}
{"title": "Benchmarking as a controlling tool in information management\n", "abstract": " This paper reports a study on the interfaces between benchmarking and information management controlling. Based on a definition analysis and an ARIS-based reference model for benchmarking, we explore the use of benchmarking as a controlling tool with respect to three main concerns: how benchmarking supports management of business processes, application systems, and infrastructures.", "num_citations": "5\n", "authors": ["414"]}
{"title": "Software benchmark design and use\n", "abstract": " This paper presents a holistic view of software benchmarking. We elucidate the concepts of the problem area by studying relevant benchmarking aspects like why software products are benchmarked, what benchmark is useful, how the benchmarks can be designed and used, and how the benchmarking process can be modelled and supported by means of software tools.", "num_citations": "5\n", "authors": ["414"]}
{"title": "Assessing resilience in enterprise architecture: a systematic review\n", "abstract": " This review paper aims to explore state-of-the-art research and scientific literature about Enterprise Architecture (EA) resilience. Based on a systematic literature review, 850 articles have been subjected to evaluation for relevance. Based on the findings in 58 selected papers, we conclude that the field of EA resilience is still in its infancy. We identified several definitions and classified six types of resilience measures, based on information type (qualitative/quantitative), the source of the disruption (internal/external), and the duration of the resilience (short-term/long-term). Based on the review, we found 19 metrics that are candidates for EA practitioners to consider for the design of measurement and assessment methods for EA resilience. In addition, we identified relevant research from Information Systems sub-domains and other sciences that can be incorporated to create a holistic view on EA resilience. Based on …", "num_citations": "4\n", "authors": ["414"]}
{"title": "The strategy blueprint: a strategy process computer-aided design tool\n", "abstract": " Strategy has always been a main concern of organizations because it dictates their direction, and therefore determines their success. Thus, organizations need to have adequate support to guide them through their strategy formulation process. The goal of this research is to develop a computer-based tool, known as ‘the Strategy Blueprint’, consisting of a combination of nine strategy techniques, which can help organizations define the most suitable strategy, based on the internal and external factors that influence their business. The research methodology we adopted is design science. To visualize the Strategy Blueprint tool, we use a spreadsheet-based implementation. Our first evaluation of the tool in real-life settings indicates that the tool is both useful and easy to use.", "num_citations": "4\n", "authors": ["414"]}
{"title": "Clients’ participation in software projects: comparative case study between an agile and a ‘traditional’software company\n", "abstract": " One of the main characteristics of agile software development is the active and continuous participation and involvement of the clients throughout the project. According to agile proponents, this leads to building ‘the right’product and to satisfied clients. In this paper we present a comparative study of two Dutch software development companies in respect to client participation and its impact on the project. One of the companies is purely agile while the other is following a traditional software development approach. Our study suggests that active clients’ participation is not an exclusive attribute of agile projects and that it can be successfully integrated (and implemented) in a traditional project as well. Further, the study shows that by involving clients, software companies have the chance to get higher customer satisfaction, regardless whether or not they implement agile software development processes. Although our study is not quantitative, we think that it is indicative about the impact of the factor “client’s participation” on the client’s satisfaction.", "num_citations": "4\n", "authors": ["414"]}
{"title": "Evaluating cross-organizational ERP requirements engineering practices: A focus group study\n", "abstract": " This focus group study presents our first validation of practices for engineering the coordination requirements in cross-organizational Enterprise Resource Planning (ERP) projects. The study evaluates 13 practices addressing a variety of coordination aspects crucial to ERP projects. These practices are results in previously published research publications by the first author. The practices are formulated in response to practitioners' needs at ERP adopting organizations. The proposed practices have now reached the stage where we need some independent feedback as to the extent to which they fit the realities of practitioners. We perform this validation by means of a qualitative research approach, namely the focus group method. Current software engineering literature provides few examples of using focus groups in the evaluation of good software development practices. Because of this, providing reflections on our …", "num_citations": "4\n", "authors": ["414"]}
{"title": "Managing Uncertainty in ERP Project Estimation Practice: An Industrial Case Study\n", "abstract": " Uncertainty is a crucial element in managing projects. This paper’s aim is to shed some light into the issue of uncertain context factors when estimating the effort needed for implementing enterprise resource planning (ERP) projects. We outline a solution approach to this issue. It complementarily deploys three techniques to allow a tradeoff between ERP projects requiring more effort than expected and those requiring less. We present the results of a case study carried out in a telecommunication company site.", "num_citations": "4\n", "authors": ["414"]}
{"title": "Status report on functional size measurement for cross-organizational ERP solutions: problems and alternative approaches\n", "abstract": " Measurement is a fundamental part of any managed activity and functional size of software is the core to successful management of any software work of any magnitude [10, 12, 15, 16]. It is crucial for estimating project team efforts and normalizing quality attributes such as defect rates, defect density, speed of delivery, and project duration. This paper discusses aspects of the measurement challenge in the context of cross-organizational implementation of large business information systems, namely Enterprise Resource Planning (ERP) systems. We make an account of observations in ERP functional size measurement practice and literature, identify aspects of the gap between practice and research, and report on a recent research initiative at the University of Twente that we plan to carry out with strong industrial participation.", "num_citations": "4\n", "authors": ["414"]}
{"title": "Assessing the potentials of CASE-tools in software process improvement: a benchmarking study\n", "abstract": " CASE tools have been thought as one of the most important means for implementing the derived quality programs. Two basic questions should be answered to find the right CASE tool: what attributes the CASE tools should exhibit and how the existing tools can be ranked according to their capability to support the quality program goals. We propose our solution based on the concept of software benchmarking. First, we summarise the QR method, and then we report on how it was applied in CASE tools assessment. Next we derive appropriate benchmark sets for CASE tools on the base of the CMM, the standard ISO 9000 and the MBNQA-criteria. We propose and implement a framework for CASE tools evaluation and selection.", "num_citations": "4\n", "authors": ["414"]}
{"title": "Knowledge-based decision support system for competitive software audit\n", "abstract": " There is a growing trend in the use of the knowledge-based techniques in business and marketing decision making. Nevertheless a few investigations on the topic of marketing decision support in software industry have been reported. The goal of the present paper is to gain inside the development of a knowledge-based system for decision support in a competitive software business environment. Analysing the company's decision structure we derive a procedure for a competitive software audit and determine the use cases. A general architecture of a knowledge-based decision support system is proposed. Object modeling and problem solving methods are briefly discussed. The solution of two different decision making problems is illustrated by proper case studies.", "num_citations": "4\n", "authors": ["414"]}
{"title": "Benchmarking in Software Development\n", "abstract": " The Software Engineering solution of the so-called “software crisis” was proposed two decades ago. But there are still some alarming symptoms. A lot of software products are delivered with delay. They are of poor quality and with excessive costs (especially for maintenance). Though many methodological recommendations have been applied, our experience shows that pure theory itself is not enough for implementing the engineering approach to software development. So we propose a feasible approach based on common sense and pragmatism rather than on deep and complex theoretical results. In our opinion, people involved in software constructing are practically minded and such an utilitarian approach would be more comprehensible and useful.", "num_citations": "4\n", "authors": ["414"]}
{"title": "A security risk mitigation framework for cyber physical systems\n", "abstract": " Cyber physical systems (CPSs) are safety‐critical, be it weapon systems, smart medical devices, or grid stations. This makes ensuring security of all the components constituting a CPS unavoidable. The rise in the demand of interconnectedness has made such systems vulnerable to attacks, ie, cyberattacks. Over 170 cases of cyber‐security breaches in CPS were reported over the past two decades. An increase in the number of cyberattack incidents on CPS makes them more exposed and less trustworthy. However, identifying the security requirements of the CPS to pinpoint the relevant risks may help to counteract the potential attacks. Literature reveals that the most targeted security requirements of CPS are authentication, integrity, and availability. However, little attention has been paid on certain crucial security attributes such as data freshness and nonrepudiation. One major reason of security breaches in CPS …", "num_citations": "3\n", "authors": ["414"]}
{"title": "Requirements Engineering: Foundation for Software Quality: 22nd International Working Conference, REFSQ 2016, Gothenburg, Sweden, March 14-17, 2016, Proceedings\n", "abstract": " This book constitutes the proceedings of the 22nd International Working Conference on Requirements Engineering–Foundation for Software Quality, REFSQ 2016, held in Gothenburg, Sweden, in March 2016. The 16 full papers and 5 short papers presented in this volume were carefully reviewed and selected from 64 submissions. The papers were organized in topical sections named: decision making in requirements engineering; open source in requirements engineering; natural language; compliance in requirements engineering; requirements engineering in the automotive domain; empirical studies in requirements engineering; requirements engineering foundations; human factors in requirements engineering; and research methodology in requirements engineering.", "num_citations": "3\n", "authors": ["414"]}
{"title": "What agile ERP consultants think of requirements engineering for interorganizational ERP Systems: insights from a focus group in BeNeLux\n", "abstract": " In 2006-2010, 12 practices for engineering the coordination requirements in inter-organizational Enterprise Resource Planning (ERP) projects were identified, classified to levels of inter-organizational coordination complexity, and subjected to a preliminary evaluation. Aim: This set of practices is now the object of a broader evaluation effort, including 8 focus groups with practitioners working in various project contexts (e.g. outsourced, cloud, agile), so that we get deeper understanding about those practices that happen in certain contexts and not in others. Method: In this paper, we present the focus group research pertaining to the agile ERP project context. We analyze the coordination requirements experiences of 9 practicing ERP consultants, specialized in agile ERP exclusively, for the purpose of understanding the fit of the 12 practices with these practitioners' project realities. Results/Conclusion: Our results …", "num_citations": "3\n", "authors": ["414"]}
{"title": "Tool support for change impact analysis in requirement models: exploiting semantics of requirement relations as traceabilitt relations\n", "abstract": " In the process of software engineering, eliciting requirements yields the first software artifacts; software requirements specifications. Software requirements are used to describe what a software system should do and are used to validate if the implementation satisfies the needs determined for it. From the moment that the first artifacts are produced, they are subject to change. Software artifacts are related to each other through traceability information. Using the traceability information, change impact analysis is performed and it is determined which related software artifacts require changes as well. However, without additional semantics of traceability information an explosion of impacts occurs. This means that change impact analysis yields all related artifacts and causes many false positives. Existing literature states that additional semantics should be employed to counter the explosion of impacts. Recent research yielded a metamodeling approach for requirements models that describes semantics for requirements relations. Tool support has been developed following this approach, that allows for inferencing and consistency checking of requirements models using these relations. However, the tool provides no support for performing change impact analysis. In this work, the semantics of requirements relations are exploited for the use of change impact analysis. This is done by identifying a classification of change for the formalized requirements model. Consequently different rationales of change are identified. It is determined that domain changes drive the change impact analysis. By combining the formalization for the rationale of change and the …", "num_citations": "3\n", "authors": ["414"]}
{"title": "A focus group study on inter-organizational ERP requirements engineering practices\n", "abstract": " This focus group study evaluates 12 practices for engineering the coordination requirements in inter-organizational Enterprise Resource Planning projects. The practices were proposed and initially evaluated in previously published articles. Here, we present independent feedback of practitioners on the fit of the practices with these practitioners' project realities. We found that all 12 practices have been observed by the practitioners. Four out of the 12 practices have been observed in contexts that we have not expected, which formed ideas for future research.", "num_citations": "3\n", "authors": ["414"]}
{"title": "Uncertainty in ERP Effort Estimation: A Challenge or an Asset?\n", "abstract": " Traditionally, software measurement literature considers the uncertainty of cost drivers in project estimation as a challenge and treats it as such. This paper develops the position that uncertainty can be seen as an asset. It draws on results of a case study in which we replicated an approach to balancing uncertainties of project context characteristics in requirements-based effort estimation for ERP implementations.", "num_citations": "3\n", "authors": ["414"]}
{"title": "Validating the domains of an inter-organizational business-IT alignment assessment instrument: A case study\n", "abstract": " CIOs can judge the effectiveness of their business-IT alignment activities by assessing maturity of processes in domains relevant to alignment. Currently, assessment instruments that support this are being developed. This paper reports on a case study aimed at validating four process domains we deemed necessary for inclusion in an assessment instrument that focuses on business-IT alignment at the level of inter-organizational collaboration. Our case study research draws on empirical evidence from an inter-organizational collaboration among different government departments within the state of Tamaulipas in Mexico. The case study revealed that the domains included in the alignment assessment instrument are the most important ones to address when achieving business-IT alignment in inter-organizational collaborations.", "num_citations": "3\n", "authors": ["414"]}
{"title": "Towards a scope management of non-functional requirements in requirements engineering\n", "abstract": " Getting business stakeholders’ goals formulated clearly and project scope defined realistically increases the chance of success for any application development process. As a consequence, stakeholders at early project stages acquire as much as possible knowledge about the requirements, their risk estimates and their prioritization. Current industrial practice suggests that in most software projects this scope assessment is performed on the user’s functional requirements (FRs), while the non-functional requirements (NFRs) remain, by and large, ignored. However, the increasing software complexity and competition in the software industry has highlighted the need to consider NFRs as an integral part of software modeling and development. This paper contributes towards harmonizing the need to build the functional behavior of a system with the need to model the associated NFRs while maintaining a scope management for NFRs. The paper presents a systematic and precisely defined model towards an early integration of NFRs within the requirements engineering (RE). Early experiences with the model indicate its ability to facilitate the process of acquiring the knowledge on the priority and risk of NFRs.", "num_citations": "3\n", "authors": ["414"]}
{"title": "Identifying and Quantifying Reuse in the SAP Requirements Engineering Process\n", "abstract": " This research is a first step towards the introduction of reuse measurement activities into the SAP requirements engineering process. We present why reuse metrics data are collected, where and when during this process reuse measurements are made, what to count as reuse and how to count it, what to do with the reuse data and how the reuse indicators fit into the large picture of SAP requirements engineering. We demonstrate the feasibility and the utility of applying our approach to an experimental case study. Some counting model validation issues are discussed at the end.", "num_citations": "3\n", "authors": ["414"]}
{"title": "What we know about software architecture styles in continuous delivery and devops?\n", "abstract": " This paper takes a software architect’s perspective to DevOps/CD and attempts to provide a consolidated view on the architecture styles for which empirical publications indicate to be suitable in the context of DevOps and CD. Following techniques from the evidence-based software engineering paradigm, we set out to answer a number of research questions pertaining to (1) the architecture characteristics important in DevOps/CD projects according to published literature, (2) the architectural styles found to work well in this context, (3) the application domains in which architecture characteristics and styles were evaluated, and (4) the empirical method being used by researchers on this topic. We applied a research protocol grounded on well-established systematic literature review guidelines, and evaluated sources published between 2009 and 2019. Our results indicate that (a) 17 software architecture …", "num_citations": "2\n", "authors": ["414"]}
{"title": "Augmenting App Review with App Changelogs: An Approach for App Review Classification.\n", "abstract": " Recent research on the automatic classification of app reviews either focused on grouping app reviews into categories relevant to software evolution, or employed app reviews as the only research data to improve app reviews classification. Although it was reported that app review classification can benefit from supplementing user reviews with the data from other sources, only a few studies employed app changelogs for this purpose. This paper explores how to augment app reviews with changelogs to improve the accuracy and performance of classifying functional and non-functional requirements in app reviews. Specifically, we propose AUG-AC as an approach to extract feature words from app changelogs and construct the augments for app reviews. Next, we designed a series of experiments to evaluate our approach, varying in the length of AC-based augments for app reviews. The results show that AUG-AC outperforms the existing method by using app changelogs as a source of data next to app reviews.", "num_citations": "2\n", "authors": ["414"]}
{"title": "An empirical study on memory bias situations and correction strategies in ERP effort estimation\n", "abstract": " An Enterprise Resource Planning (ERP) project estimation process often relies on experts of various backgrounds to contribute judgments based on their professional experience. Such expert judgments however may not be bias-free. De-biasing techniques therefore have been proposed in the software estimation literature to counter various problems of expert bias. Yet, most studies on de-biasing focus on systematic bias types such as bias due to interdependence, improper comparisons, presence of irrelevant information, and awareness of clients’ expectations. Little has been done to address bias due to experts’ memory. This is surprising, knowing that memory bias retrieval and encoding errors are likely to affect the estimation process outcome. This qualitative exploratory study investigates the memory bias situations encountered by ERP professionals, and the possible coping strategies to problems …", "num_citations": "2\n", "authors": ["414"]}
{"title": "An Experience Report on ERP Effort Estimation Driven by Quality Requirements.\n", "abstract": " Producing useful and accurate project effort estimates is highly dependable on the proper definition of the project scope. In the ERP service industry, the scope of an ERP service project is determined by desired needs which are driven by certain quality attributes that the client expects to be present in the implemented service solution. However, most of the needs for quality are implicit at the bidding stage of an ERP service project. Using software architecture principles such as more structured approaches to determining the prioritized set of quality requirements and their traceability to functional requirements, could help improve project effort estimation accurateness, project preparation and scope validation. This paper presents a real-world example in the SAP organization, in which we demonstrate this.", "num_citations": "2\n", "authors": ["414"]}
{"title": "From Start-ups to SaaS Conglomerate: Life Cycles of Software Products Workshop (IW-LCSP 2013)\n", "abstract": " From Start-ups to SaaS Conglomerate: Life Cycles of Software Products Workshop (IW-LCSP 2013) Sami Hyrynsalmi, Krzysztof Wnuk, Maya Daneva, Tuomas Mäkilä, Andrea Herrmann (Eds.) Proceedings of From Start-ups to SaaS Conglomerate: Life Cycles of Software Products Workshop (IW-LCSP 2013) Hosted by 4th International Conference on Software Business (ICSOB 2013) in Potsdam, Germany, June 11, 2013 Page 2 Copyright© 2013 for the individual papers by the papers’ authors. Copying permitted for private and academic purposes. This volume is published and copyrighted by its editors. Addresses of the editors: Sami Hyrynsalmi University of Turku FI-20014 Turun yliopisto, Turku, Finland sthyry@ utu. fi Krzysztof Wnuk Lund University PO Box 118, 221 00 Lund, Sweden krzysztof. wnuk@ cs. lth. se Maya Daneva University of Twente PO Box 217 7500 AE Enschede, The Netherlands m. daneva@ . nl FI…", "num_citations": "2\n", "authors": ["414"]}
{"title": "Reprioritizing the Requirements in Agile Software Development: Towards a Conceptual Model from Clients' Perspective.\n", "abstract": " Continuous and client-centric requirements reprioritization forms the very core of today’s agile approaches. In this paper, we report on results of a grounded theory study on agile requirements prioritization methods. The outcome is a conceptual model for understanding the inter-iteration prioritization process from client’s perspective. The latter is derived from the authors’ experiences and by using empirical data, published earlier by other authors.", "num_citations": "2\n", "authors": ["414"]}
{"title": "Integrating Portfolio Management and Simulation Concepts in the ERP Project Estimation Practice\n", "abstract": " This paper presents a two-site case study on requirements-based effort estimation practices in enterprise resource planning projects. Specifically, the case study investigated the question of how to handle qualitative data and highly volatile values of project context characteristics. We counterpart this challenge and expound upon the integration of portfolio management concepts and simulation concepts into a classic effort estimation model (COCOMO II).", "num_citations": "2\n", "authors": ["414"]}
{"title": "Function point counts derived from SAP business scenario requirements\n", "abstract": " Recent years have witnessed a very high level of interest in the SAP technology and the Function Points Analysis (FPA). The motivation for implementing the SAP R/3 business application suite is twofold. On one side, SAP provides the information technology infrastructure for business process re-engineering [2] and a component-based concept for R/3 implementation which benefits the most from software reusability. On the other side, SAP has protected its customers from the Year 2000 problem and, in addition, has brought interne capabilities to the R/3 application suite. Simultaneously, Function Points (FP) have been becoming widely accepted as the standard metric for software controlling and planning.", "num_citations": "2\n", "authors": ["414"]}
{"title": "ARIS-based framework for enhancing reference models: experience in simultaneous bid preparation\n", "abstract": " The paper presents a strategy for enterprise modelling within Business Process Re-engineering. Adopting the ARIS methodology, the strategy is based on the idea that the business process models developed by means of a given technique within a certain BPR-project could be reused in other BPR-initiatives. The feasibility of the approach is proven within two case studies taken from the ESPRIT Project No. 7131 “BIDPREP — An Integrated System for Simultaneous Bid Preparation”.", "num_citations": "2\n", "authors": ["414"]}
{"title": "What Industry Wants from Requirements Engineers in China? An Exploratory and Comparative Study on RE Job Ads\n", "abstract": " [Background] Publications on the professional occupation of Requirements Engineering (RE) reported on market demands for both RE and non-RE qualifications and indicated the state-of-the-practice of RE roles in industry. However, prior research was not from the perspective of the RE area in the Software Engineering Body of Knowledge (SWEBOK). Nor, they shed light on the industry needs of RE professionals in China.[Aims] This paper focused on RE-specific tasks and skills sought after in China, from the perspective of RE activities elaborated in SWEBOK.[Method] Using an empirical qualitative research method, we selected and analyzed 535 job ads from China's two largest job portals. Job titles and descriptions of these ads were analyzed to uncover RErelevant responsibilities in the categories of RE activities in SWEBOK as well as RE skills.[Results] We identified the qualifications, experience and skills …", "num_citations": "1\n", "authors": ["414"]}
{"title": "Developers' Eyes on the Changes of Apps: An Exploratory Study on App Changelogs\n", "abstract": " Release planning for mobile apps has only recently become an area of active research. As a result, little is known about the types of requirements that app developers pay the most attention to when releasing an app. This research uses the changelogs of apps to shed light on this. We report the results of an exploratory study in which we analyzed the requirements that dominate the changes of apps, according to a set of 3000 changelogs collected from 120 apps from three categories in the Apple App Store: Travel, Social networking, and Books. We analyzed the changelogs in terms of functional and non-functional requirements, from a developers' perspective. Our results suggest that developers' releases are by far more concerned with non-functional requirements than with functional requirements. We also found that usability and maintainability are the most frequently mentioned non-functional requirements …", "num_citations": "1\n", "authors": ["414"]}
{"title": "Experiences in Using Practitioner‟ s Checklists to Evaluate the Relevance of Experiments Reported in Requirements Engineering\n", "abstract": " Background: Requirements Engineering (RE) researchers recognize that for RE methods to be adopted in industry, practitioners should be able to evaluate the relevance of a study to their practice.. Kitchenham et al proposed a set of perspective-based checklists, which demonstrated to be a useful instrument for this purpose. Specifically, the checklist from the practitioner‟ s perspective seems to be a good candidate for evaluating the relevance of RE studies to RE practice. However, little is known about the applicability of the checklist to the area of RE. Moreover, this checklist also requires a greater analysis about its reliability. Aim: The aim of this report is to propose a perspective-based checklist to the RE community that allows evaluating the relevance of experimental studies in RE from the practitioner‟ s/consultant‟ s viewpoint. Method: Our research followed an iterative design-science based approach in which we first analyzed the problems with a previously published checklist and developed an operationalized proposal for a new checklist to counter these problems. We performed a reliability evaluation of this new checklist. The research was performed with two practitioners and 24 papers that report experimental results on comprehensibility of software requirements specifications. Results: This report gives first-hand experiences of practitioners in evaluating the relevance of primary studies in RE, by using a perspective-based checklist. With respect to the reliability of the adjusted checklist, 9 of out 19 questions show an acceptable proportion of agreement (between two practitioners).Conclusions: Based on our experience, the …", "num_citations": "1\n", "authors": ["414"]}
{"title": "Teaching consistency of UML specifications\n", "abstract": " Consider the situation that you have a data model, a functional model and a process model of a system, perhaps made by different analysts at different times. Are these models consistent with each other? A relevant question in practice - and therefore we think it should also be addressed in our courses. However, UML modelling textbooks don't discuss it, so we developed our own teaching materials. In this position paper we explain why and how.", "num_citations": "1\n", "authors": ["414"]}
{"title": "Architecture Maturity and Requirements Engineering Process Maturity Do not Explain Each Other\n", "abstract": " Enterprise Architecture and Enterprise Resource Planning (ERP) solutions have profound influences on today’s connected business world. Yet, the relationship between the two is not enough explored and, as a result, only partially understood. This paper sheds some light into this relationship and suggests exploring it by using the concept of maturity [PAU95]. We build upon our previous experiences in assessing ERP Requirements Engineering processes and enterprise architecture processes in an industrial setting.", "num_citations": "1\n", "authors": ["414"]}
{"title": "The role of benchmarking in information system development\n", "abstract": " This paper highlights the importance of benchmarking for fitness and enhancement of quality and productivity in IS development life cycle. We introduce a pragmatic approach to IS improvement based on continuos learning from best-in-class achievements. We also report a benchmarking case study that illustrates the application of the method during the requirements analysis and the development of requirements specification.", "num_citations": "1\n", "authors": ["414"]}
{"title": "MIM formalism: an approach to marketing modelling and IMS development\n", "abstract": " Well engineered intelligent marketing systems cover the following functionalities: marketing situation modeling, integrated data and knowledge handling, marketing process support. Currently, there are loose linkages among the three issues. The author explores these linkages by developing a formalism capable of representing a wide range of marketing situations in a rigorous and comprehensive fashion. The purpose of the formalism is also to guide the development of IMS which will provide the three capabilities in an integrated and uniform way.", "num_citations": "1\n", "authors": ["414"]}
{"title": "for Software Quality\n", "abstract": " Welcome to the proceedings of the 22nd edition of REFSQ: the International Working Conference on Requirements Engineering–Foundation for Software Quality! Requirements engineering (RE) has been recognized as a critical factor that impacts the quality of software, systems, and services. Since the term “requirements engineering” was coined, the community of practitioners and researchers has been working tirelessly on the identification, characterization, and evaluation of the multifaceted relationships between aspects of requirements processes, artifacts, and methods and aspects of software quality. The REFSQ working conference series has been well established as Europe’s premier meeting place in RE and as one of the leading international forums dedicated to the conversation on RE and its many relationships to quality.The first REFSQ was celebrated in 1994, in Utrecht, The Netherlands. Since then …", "num_citations": "1\n", "authors": ["414"]}