{"title": "An empirical study on object-oriented metrics\n", "abstract": " The objective of this study is the investigation of the correlation between object-oriented design metrics and the likelihood of the occurrence of object oriented faults. Such a relationship, if identified, can be utilized to select effective testing techniques that take the characteristics of the program under test into account. Our empirical study was conducted on three industrial real-time systems that contain a number of natural faults reported for the past three years. The faults found in these three systems are classified into three types: object-oriented faults, object management faults and traditional faults. The object-oriented design metrics suite proposed by Chidamber and Kemerer (1994) is validated using these faults. Moreover, we propose a set of new metrics that can serve as an indicator of how strongly object-oriented a program is, so that the decision to adopt object oriented testing techniques can be made, to …", "num_citations": "396\n", "authors": ["1065"]}
{"title": "Architecture-based software reliability modeling\n", "abstract": " Reliability is one of the essential quality requirements of software systems, especially for life critical ones. Software reliability modeling provides a means for estimating reliability of software, which facilitates effective decision making for quality control. Existing models either use a black-box approach that is based on test data of the whole system or a white-box approach that uses components’ reliabilities and inter-component interactions. While the black-box approach is applicable to the late phases of software development, the white-box approach can support decisions on early component reuse and later component upgrades and updates. However, the white-box based models have traditionally considered only homogeneous software behaviors. For this reason, we extended the white-box to an architecture-based approach, utilizing the characteristics of architectural styles to capture design information and to …", "num_citations": "262\n", "authors": ["1065"]}
{"title": "An architecture-based software reliability model\n", "abstract": " We present an analytical model for estimating architecture-based software reliability, according to the reliability of each component, the operational profile, and the architecture of software. Our approach is based on Markov chain properties and architecture view to state view transformations to perform reliability analysis on heterogeneous software architectures. We demonstrate how this analytical model can be utilized to estimate the reliability of a heterogeneous architecture consisting of batch-sequential/pipeline, call-and-return, parallel/pipe-filters, and fault tolerance styles. In addition, we conduct an experiment on a system embedded with three architectural styles to validate this heterogeneous software reliability model.", "num_citations": "216\n", "authors": ["1065"]}
{"title": "Infrared studies on the interaction of carbon monoxide with divalent nickel in hydrogenase from Chromatium vinosum\n", "abstract": " Revised Manuscript Received May 17, 1994® abstract: Infrared spectra of a carbon monoxy-bound form of the EPR silent Ni (II) species of hydrogenase isolated from Chromatium vinosum are presented. These spectra show a band at 2060 cm-1 dueto v (CO) for a metal-CO complex. This absorbance shifts to 2017 cm-1 upon exposure of the enzyme to 13CO. This band is attributed to v (CO) from a Ni (II)-CO species. It is shown that the CO on this species is photolabile at cryogenic temperatures but rebinds to form the original carbon monoxy species at temperatures above 200 K. In addition to the v (CO) band, infrared lines are detected at 2082, 2069, and 1929 cm-1, which shift slightly higher in frequencyupon photolysis of the CO from the Ni. These infrared bands do not arise from CO itself on the basis of the fact that the frequency of these bands is unaffected by exposure of the enzyme to 13CO. Experiments in …", "num_citations": "186\n", "authors": ["1065"]}
{"title": "UML-based integration testing for component-based software\n", "abstract": " Component-based software engineering is increasingly being adopted for software development. Currently, components delivered by component providers only include specifications of the interfaces. This imposes significant dificulties on adequate testing of an integrated component-based system. Without source code, many testing techniques will not be applicable. The Unified Modeling Language (UML) has been widely adopted in component-based software development processes. Many of its useful tools, such as interaction diagrams, statechart diagrams, and component diagrams, characterize the behavior of components in various aspects, and thus can be used to help test componentbased systems. In this paper, we first analyze different test elements that are critical to test component-based software, then we propose a group of UML-based test adequacy criteria that can be used to test …", "num_citations": "163\n", "authors": ["1065"]}
{"title": "Effect of code coverage on software reliability measurement\n", "abstract": " Existing software reliability-growth models often over-estimate the reliability of a given program. Empirical studies suggest that the over-estimations exist because the models do not account for the nature of the testing. Every testing technique has a limit to its ability to reveal faults in a given system. Thus, as testing continues in its region of saturation, no more faults are discovered and inaccurate reliability-growth phenomena are predicted from the models. This paper presents a technique intended to solve this problem, using both time and code coverage measures for the prediction of software failures in operation. Coverage information collected during testing is used only to consider the effective portion of the test data. Execution time between test cases, which neither increases code coverage nor causes a failure, is reduced by a parameterized factor. Experiments were conducted to evaluate this technique, on a …", "num_citations": "141\n", "authors": ["1065"]}
{"title": "Techniques for testing component-based software\n", "abstract": " Component-based software engineering is increasingly being adopted for software development. Although much work has been proposed for building component-based-systems, techniques for testing component-based systems have not been well developed. We present a test model that depicts a generic infrastructure of component-based systems and suggests key test elements. The test model is realized using a component interaction graph (CIG) in which the interactions and the dependence relationships among components are illustrated. By utilizing the CIG, we propose a family of test adequacy criteria which allow optimization of the balancing among budget, schedule, and quality requirements typically necessary in software development. The methodology proposed is efficient and effective, as demonstrated by promising results obtained from a case study.", "num_citations": "138\n", "authors": ["1065"]}
{"title": "Some aryl semicarbazones possessing anticonvulsant activitie\n", "abstract": " A number of aryl semicarbazones displayed anticonvulsant activity in the maximal electroshock (MES) and subcutaneous pentylenetetrazole (scPTZ) screens when administered intraperitoneally to mice. When given by the oral route to rats, protection was afforded in the MES but not scPTZ tests. Correlations were noted between the σ and σ* values of the aryl substituents, the interplanar angles made by the aryl rings with the adjacent carbimino groups and the shapes of certain semicarbazones determined by X-ray crystallography, and the activities in the rat oral MES screen. Molecular modeling studies revealed a number of statistically significant descriptors which contributed to anticonvulsant activity.", "num_citations": "120\n", "authors": ["1065"]}
{"title": "Evaluation of some Mannich bases of cycloalkanones and related compounds for cytotoxic activity\n", "abstract": " A number of Mannich bases of cycloalkanones and related quaternary ammonium compounds were prepared for cytotoxic evaluation in order to examine the theory that sequential release of alkylating agents produces increased bioactivity compared to related compounds containing only 1 potential alkylating site. Many of the compounds had significant activity against murine L1210 cells and various human tumours. Some correlations between structure and activity were noted but the biological data did not support the view that potential sequential liberation of cytotoxic species produced compounds with increased potency. The formation of various oximes and oxime benzoates as candidate prodrugs was achieved but in general these compounds were not cytotoxic at the concentrations utilized. This observation may be due to the fact that the oximes were much more stable in deuterated phosphate buffered saline …", "num_citations": "97\n", "authors": ["1065"]}
{"title": "Testing object-oriented programs-an integrated approach\n", "abstract": " Traditional testing techniques often overlook object-oriented faults that are either caused by inheritance and/or polymorphism features or are introduced in object management. We present an object-flow based testing strategy that utilizes two object-flow coverage criteria (all-bindings and all-du-pairs) in testing object-oriented programs. The all-bindings criterion takes inheritance and polymorphism features into account to ensure that every binding of every object is exercised under some test. The all-du-pairs criterion is applied to monitor the behavior of every object during its lifetime by keeping track of where the object is defined (d) and where such a definition is referenced or used (u). These object-flow coverage criteria can be used to develop test cases that are able to trigger object-oriented faults. Furthermore, an integrated approach that incorporates the object-flow based testing strategy with traditional testing …", "num_citations": "76\n", "authors": ["1065"]}
{"title": "Co-organizing the collective journey of inquiry with idea thread mapper\n", "abstract": " This research integrates theory building, technology design, and design-based research to address a central challenge pertaining to collective inquiry and knowledge building: How can student-driven, ever-deepening inquiry processes become socially organized and pedagogically supported in a community? Different from supporting inquiry using predesigned structures, we propose reflective structuration as a social and temporal mechanism by which members of a community coconstruct/reconstruct shared inquiry structures to shape and guide their ongoing knowledge building processes. Idea Thread Mapper (ITM) was designed to help students and their teacher monitor emergent directions and co-organize the unfolding inquiry processes over time. A study was conducted in two upper primary school classrooms that investigated electricity with the support of ITM. Qualitative analyses of classroom videos and …", "num_citations": "73\n", "authors": ["1065"]}
{"title": "Review of carbon materials for advanced lithium-sulfur batteries\n", "abstract": " Lithium-ion batteries (LIBs) are extensively used in numerous portable devices such as smart-phones and laptops. However, current LIBs based on the conventional intercalation mechanism cannot meet the requirements of the electronics industry and electric vehicles although they are approaching their theoretical capacity. Therefore, it is extremely urgent to seek for systems with higher energy densities. Among various promising candidates, lithium-sulfur (Li-S) batteries with a high theoretical capacity are very attractive. However, the commercial use of Li-S batteries still faces obstacles such as the low electrical conductivity of sul-batteries sheds light on the efficient utilization of sulfur by improving the conductivity of the composites and restraining the shuttle effect of polysulfides. Here, we give a brief review of recent progress on carbon/sulfur composites, especially carbon nanotube, graphene and porous carbon …", "num_citations": "57\n", "authors": ["1065"]}
{"title": "An empirical study of the correlation between code coverage and reliability estimation\n", "abstract": " Existing time-domain models for software reliability often result in an overestimation, of such reliability because they do not take the nature of testing techniques into account. Since every testing technique has a limit to its ability to reveal faults in a given system, as a technique approaches its saturation region fewer faults are discovered and reliability growth phenomena are predicted from the models. When the software is turned over to field operation, significant overestimates of reliability are observed. We present a technique to solve this problem by addressing both time and coverage measures for the prediction of software failures. Our technique uses coverage information collected during testing to extract only effective data from a given operational profile. Execution time between test cases which neither increase coverage nor cause a failure as reduced by a parameterized factor. Experiments using this technique …", "num_citations": "57\n", "authors": ["1065"]}
{"title": "Characterization of the rutin-metal complex by electrospray ionization tandem mass spectrometry\n", "abstract": " Flavonoids are polyphenolic compounds that can be found in the roots, stalks, and fruits of many natural plants. Long-time research has shown that flavonoids have many biological activities, such as, anti-cancer, anti-inflammation, anti-virus, anti-allergy and anti-osteoporosis. 1–5 Nearly all of those biological activities are relative to their interaction with several enzymes in the human body and their antioxidant activity, which leads to scavenge excess free radicals that may damage the biomolecules. 6–8 It has already been reported that the antioxidant mechanism of flavonoids may also come from the interaction between transition-metal ions and flavonoids to produce complexes that keep the metal ions from the participation of free-radical generation. 9–11 Thus a metalflavonoid complex plays a meaningful role in the elimination of excess free radicals, which may be harmful to biomolecules. At the same time, as natural metal chelators, flavonoids show a significant function on the bio-utilization of metal and antimetal-toxicosis. 12Rutin is an ordinary flavonoid, which is widely distributed in edible plants. It is a powerful antioxidant and has evident antiinflammatory properties. 13, 14 The antioxidant and antiinflammatory activities of rutin are enhanced by complexation with transition metals. 15 Hereby, we chose rutin to investigate the complexes’ structures of rutin with several different transition metals (Cu2+, Zn2+, Mn2+ and Fe2+). Although a traditional analytical method (ultraviolet-visible absorption spectroscopy) 16 has been used to elucidate structure information of metal flavonoid complex, it can only give indirect structure information. With the …", "num_citations": "53\n", "authors": ["1065"]}
{"title": "The mechanical properties of polypropylene fiber reinforced concrete\n", "abstract": " The compressive, shear strengths and abrasion-erosion resistance as well as flexural properties of two polypropylene fiber reinforced concretes and the comparison with a steel fiber reinforced concrete were reported. The exprimental results show that a low content of polypropylene fiber (0.91 kg/m3 of concrete) slightly decreases the compressive and shear strengths, and appreciably increased the flexural strength, but obviously enhances the toughness index and fracture energy for the concrete with the same mix proportion, consequently it plays a role of anti-cracking and improving toughness in concrete. Moreover, the polypropylene mesh fiber is better than the polypropylene monofilament fiber in improving flexural strength and toughness of concrete, but the two types of polypropylene fibers are inferior to steel fiber. All the polypropylene and steel fibers have no great beneficial effect on the abrasion …", "num_citations": "50\n", "authors": ["1065"]}
{"title": "Regression testing on object-oriented programs\n", "abstract": " Regression testing is an important activity at both testing and maintenance phases. When a piece of software is modified, it is necessary to ensure the quality of the software is preserved. To this end, regression testing retests the software using the test cases selected from the original test pool. We present a regression testing technique that selects test cases by utilizing static information from the analysis of the program structure and dynamic information by tracing the function-calling sequences. To compare the effectiveness of this technique with other existing approaches, we conducted an empirical study on an industrial trial real-time system. The results show that not only, does this technique preserve all the necessary information for regression testing, but it is also much more efficient and more precise than the existing techniques.", "num_citations": "46\n", "authors": ["1065"]}
{"title": "Techniques of maintaining evolving component-based software\n", "abstract": " Component based software engineering has been increasingly adopted for software development. Such an approach using reusable components as the building blocks for constructing software, on one hand, embellishes the likelihood of improving software quality and productivity; on the other hand, it consequently involves frequent maintenance activities, such as upgrading third party components or adding new features. The cost of maintenance for conventional software can account for as much as two-thirds of the total cost, and it can likely be even more for maintaining component based software. Thus, an effective maintenance technique for component based software is strongly desired. The authors present a technique that can be applied on various maintenance activities over component based software systems. The technique proposed utilizes a static analysis to identify the interfaces, events and …", "num_citations": "43\n", "authors": ["1065"]}
{"title": "Synthesis and cytotoxic evaluation of some styryl ketones and related compounds\n", "abstract": " A number of 1-aryl-4-methyl-1-penten-3-ones 1 were converted to the corresponding Mannich bases 2 and analogues 3. Attempts to form the azines 4 from several members in series 1 led to the isolation of the corresponding pyrazolines 5 or aryl aldehyde azines 6. Replacement of the isopropyl group of a compound in series 1 by methyl and ethyl functions led to ketones that reacted with hydrazine producing the corresponding azines. The Mannich bases displayed greater activity than the precursor ketones towards murine P388 and L1210 leukemia cells as well as to a panel of human tumour cell lines. Certain of the Mannich bases had selective toxicity towards some human tumour cell lines and others to L1210 cells (in contrast to human T lymphocytes). Several drug-resistant cell lines were shown to be free from cross resistance to a number of the Mannich bases.", "num_citations": "38\n", "authors": ["1065"]}
{"title": "Synthesis and cytotoxic evaluation of some cyclic arylidene ketones and related oximes, oxime esters, and analogs\n", "abstract": " A number of arylidene derivatives of alicyclic ketones and some corresponding oximes, oxime esters, and related compounds were prepared as candidate cytotoxic agents. All of the compounds were evaluated against murine L1210 lymphoid leukemia cells. In general, cytotoxicity was greatest with the α,β‐unsaturated ketones and diminished with the oximes, and the oxime esters had little or no activity in this screen. When the same compounds were examined in both the in vitro L1210 and P388 leukemia screens, in the majority of cases the L1210 cells were more sensitive to these derivatives. Over half of the compounds prepared were evaluated against approximately 55 human tumors in vitro and showed selective toxicity toward one or more groups of neoplastic diseases, particularly leukemia. Some correlations between structure and bioactivity were discerned. The cytotoxicity screening and stability studies of …", "num_citations": "37\n", "authors": ["1065"]}
{"title": "Heterogeneous software reliability modeling\n", "abstract": " A number of Markov-based software reliability models have been developed for measuring software reliability. However, the application of these models is strictly limited to software that satisfies the Markov properties. The objective of our work is to expand the application domain of the Markov-based models, so that most software can be modeled and software reliability can be measured at the architecture level. To overcome the limitations of Markov properties, our model takes execution history into account and addresses both deterministic and probabilistic software behaviors. Each state represents the executions of one or more components depending on the architectural styles. In addition, the executions of one component are depicted by using distinctive states, when such executions are influenced by past states. Furthermore, we construct loops to eliminate the likelihood of unlimited state expansion and utilize a …", "num_citations": "34\n", "authors": ["1065"]}
{"title": "Research progress and future prospects for promoting endothelialization on endovascular stents and preventing restenosis\n", "abstract": " Restenosis at the site of implantation of a cardiovascular stent remains a significant problem in the interventional treatment of cardiovascular disease. Studies confirm that endothelial impairment is one of the most important factors leading to restenosis and treatment failure. Accelerating the re-endothelialization of vascular stents and rapidly restoring the integrity of the endothelium is currently the best strategy for preventing restenosis. There has been great progress in understanding endothelial development and repair, particularly the role of endothelial progenitor cells (EPCs) in restoring the endothelial integrity at injured vascular sites. EPCs hold great promise for treating cardiovascular diseases. Furthermore, modifying the adherence properties of EPCs and other types of seed cells on stents can accelerate cell proliferation and endothelialization. In this review, we summarize the progress in utilizing seed cells from various sources for in vitro endothelialization and native endothelialization, as well as their application in vascular grafts.", "num_citations": "31\n", "authors": ["1065"]}
{"title": "Making Collective Progress Visible for Sustained Knowledge Building.\n", "abstract": " This paper presents the design of Idea Thread Mapper (ITM), a timeline-based collective knowledge-mapping tool that interoperates with Knowledge Forum and potentially other learning platforms. Using ITM, students engage in collaborative, metacognitive conversations to identify “juicy” topics that have emerged from their knowledge-building discourse, as their communal focuses, and review ideas addressing each focus as a line of inquiry—an idea thread. A study was conducted in a grade 3 classroom to foster sustained knowledge building through ITM-aided collaborative reflection. Analyses of online discourse, classroom videos, ITM data, and student interviews elaborate the processes and benefits of ITM-aided reflection to foster student awareness of their collective knowledge and collaborative, sustained efforts to advance it.", "num_citations": "29\n", "authors": ["1065"]}
{"title": "Modeling and control of complex dynamic systems: applied mathematical aspects\n", "abstract": " The concept of complex dynamic systems arises in many varieties, including the areas of energy generation, storage and distribution, ecosystems, gene regulation and health delivery, safety and security systems, telecommunications, transportation networks, and the rapidly emerging research topics seeking to understand and analyse. Such systems are often concurrent and distributed, because they have to react to various kinds of events, signals, and conditions. They may be characterized by a system with uncertainties, time delays, stochastic perturbations, hybrid dynamics, distributed dynamics, chaotic dynamics, and a large number of algebraic loops. This special issue provides a platform for researchers to report their recent results on various mathematical methods and techniques for modelling and control of complex dynamic systems and identifying critical issues and challenges for future investigation in this field. This special issue amazingly attracted one-hundred-andeighteen submissions, and twenty-seven of them are selected through a rigorous review procedure.The selected papers contribute mathematical modelling, parameter identification, monitoring and diagnosis, optimization, and control for a variant of complex systems such as chaotic systems 4 papers, impulsive and singular systems 4 papers, nonlinear systems 12 papers, delay systems 3 papers, stochastic systems 3 papers, and gene complex network 1 paper. From the viewpoint of modelling, the related papers mainly investigate mathematical modelling for complex systems by using physical laws or deal with model identification by using the data based training and …", "num_citations": "29\n", "authors": ["1065"]}
{"title": "Fabrication of free standing resolution standards using proton beam writing\n", "abstract": " The need for a smaller beam size has been driven by the goals of producing nanostructures using proton beam writing (PBW) and also improving the spatial resolution for ion beam applications (e.g. PIXE, RBS, IBIC, etc.) to nanodimensions. Thus, it is vital to have a resolution standard which has a high degree of side-wall straightness. PBW, as a true direct-write 3D micromachining process, is an ideal technique to produce free standing resolution standards with precise edges and straight side walls. This paper describes a process for fabricating free standing Ni resolution standards with a thickness of 2 μm. A large area support structure for the grid was fabricated in PMMA using deep ultraviolet (DUV) at 220–250 nm exposure, and at the centre of the support structure we used PBW to fabricate a microgrid. Ni Sulfamate electroplating was then performed to produce a 2 μm thick Ni grid from this polymer pattern. The …", "num_citations": "29\n", "authors": ["1065"]}
{"title": "Software architecture analysis: A case study\n", "abstract": " The Arch project is investigating methods and tools for understanding, specifying, controlling and improving the subsystem architecture of large so~ are systems. This paper focuses on one of Arch’s capabilities, critiquing modularity. It discusses the relationship of modularity and architecture to configuration management, describes Arch’s information-sharing measure and its heuristic method, maverick analysis, for spotting poor information-hiding, and gives examples of using Arch tofind and analyze problem modules. Then it describes a case study in which Arch was used to analyze a “real”, production software system, including the real developer’s responses to Arch’s analysis.", "num_citations": "29\n", "authors": ["1065"]}
{"title": "Effect of parathyroid hormone on early chondrogenic differentiation from mesenchymal stem cells\n", "abstract": " Treatment of articular cartilage injuries remains a difficult challenge due to the limited capacity for intrinsic repair. Mesenchymal stem cells (MSCs) can differentiate into chondrocytes under certain culture conditions. This study focused on the modulatory effects of parathyroid hormone (PTH) on chondrogenic differentiation from MSCs. MSCs were treated with various concentrations of PTH under chondrogenic pellet culture condition. RNA was isolated for real-time polymerase chain reaction (PCR) and gene expressions of collagen type II α1 chain (Col2a1), collagen type X α1 chain, collagen type I α1 chain, SRY-box9 (Sox9), and type 1 PTH/PTHrP receptor (PTH1R) were examined. Chondrogenic differentiation was also evaluated by histological findings. PTH had opposite effects on chondrogenesis, depending on the concentration. A low to moderate concentration of PTH promoted chondrogenic differentiation of …", "num_citations": "25\n", "authors": ["1065"]}
{"title": "Measuring OO design metrics from UML\n", "abstract": " Design metrics are useful means for improving the quality of software. A number of object-oriented metrics have been suggested as being helpful for resource allocation in software development. These metrics are particularly useful for identifying fault-prone classes and for predicting required maintenance efforts, productivity, and rework efforts. To obtain the design metrics of the software under development, most existing approaches measure the metrics by parsing the source code of the software. Such approaches can only be performed in a late phase of software development, thus limiting the usefulness of the design metrics in resource allocation. In this paper, we present a methodology that compiles UML specifications to obtain design information and to compute the design metrics at an early stage of software development. The current version of our tool uses diagrams produced by the Rational Rose …", "num_citations": "25\n", "authors": ["1065"]}
{"title": "Excess volumes of (a polar liquid+ an aromatic hydrocarbon) at the temperature 298.15 K: I.(N, N-dimethylformamide+ an aromatic hydrocarbon)\n", "abstract": " Excess volumes have been measured by means of a continuous-dilution dilatometer for (N,N-dimethylformamide + benzene or toluene oro-xylene orp-xylene or ethylbenzene or styrene) at the temperature 298.15 K.VEis negative over the entire range of composition for all mixtures. |VEm(minimum)| and |VEm(x= 0.5)| values of this series decrease in the sequence: C6H5CH = CH2≥ C6H5CH3≥p-C6H4(CH3)2≈ C6H6≥m-C6H4(CH3)2≥o-C6H4(CH3)2≈ C6H5CH2CH3. The results show that there are quite strong interactions betweenN,N-dimethylformamide molecules and aromatic-hydrocarbon molecules.", "num_citations": "25\n", "authors": ["1065"]}
{"title": "Clustering and tailoring user session data for testing web applications\n", "abstract": " Web applications have become major driving forces for world business. Effective and efficient testing of evolving Web applications is essential for providing reliable services. In this paper, we present a user session based testing technique that clusters user sessions based on the service profile and selects a set of representative user sessions from each cluster. Then each selected user session is tailored by augmentation with additional requests to cover the dependence relationships between Web pages. The created test suite not only can significantly reduce the size of the collected user sessions, but is also viable to exercise fault sensitive paths. We conducted two empirical studies to investigate the effectiveness of our approach- one was in a controlled environment using seeded faults, and the other was conducted on an industrial system with real faults. The results demonstrate that our approach consistently …", "num_citations": "22\n", "authors": ["1065"]}
{"title": "Cytotoxic evaluation of some N-acyl and N-acyloxy analogues of 3, 5-bis (arylidene)-4-piperidones.\n", "abstract": " The preparation of thirteen N-acyl and N-acyloxy analogues of two 3, 5-bis (arylidene)-4-piperidones were prepared as potential prodrugs of the parent ketones. Approximately half of the compounds demonstrated antileukemic properties when evaluated against murine L1210 lymphoid leukemia cells. Three of the derivatives were more active than or equipotent with the reference drug melphalan. All of the compounds were examined against approximately 55 human tumours representing eight different neoplastic diseases. Not only were most of the compounds more cytotoxic than melphalan but 60% of the derivatives displayed selective toxicity to leukemia. A stability study of six of the candidate prodrugs using 1H NMR spectroscopy revealed that while some decomposition in solution occurred, the parent amine was not liberated.", "num_citations": "22\n", "authors": ["1065"]}
{"title": "Dispensers and applicator heads therefor\n", "abstract": " An applicator head for selectively dispensing product includes a base structure and a support structure. The base structure includes a top face inclined relative to a bottom face, and a first side wall. The top face includes a base flange, and defines a first orifice in fluid communication with a fastener of the bottom face. The support structure includes a lower face inclined relative to an upper face, and a second side wall. The upper face includes a top surface and defines a second orifice. The lower face includes a support flange engaged with the base flange such that the support structure is pivotable relative to the base structure between first and second positions. Fluid communication is facilitated from the fastener through the second orifice in only one of the first and second positions. A dispenser is also provided.", "num_citations": "20\n", "authors": ["1065"]}
{"title": "Corporate governance and firm performance\n", "abstract": " While Advances continues to publish papers from any area of Finance, the focus of this issue is on corporate governance, broadly defined as the system of controls that helps corporations and other organizations effectively manage, administer, and direct economic resources. Included in the volume are papers focusing on: the impact of deregulation and corporate structure on productive efficiency; the effectiveness of the fraud triangle and SAS; board monitoring and access to debt financing; institutional investors; and managerial stability and payout policy.", "num_citations": "19\n", "authors": ["1065"]}
{"title": "Effect of class testing on the reliability of object-oriented programs\n", "abstract": " Although object-oriented programming has been increasingly adopted for software development and many approaches for testing object-oriented programs have been proposed, the issue of reliability of object-oriented programs has not been explored. The objective of this study was to investigate the effectiveness of class testing from the perspective of reliability. The experiments in this study involved testing and measuring the reliability of a C++ program and a Java program. We introduced a class testing technique that exploits the function dependence relationship to reduce the testing effort in subclass testing and in testing polymorphism without degrading the reliability of object-oriented programs. In subclass testing, the impact of function dependence class testing on reliability was compared with two other techniques: exhaustive class testing, which flattens every class and tests every function in the class; and …", "num_citations": "19\n", "authors": ["1065"]}
{"title": "Synthesis and cytotoxic evaluation of mesna adducts of some 1-aryl-4, 4-dimethyl-5-(1-piperidino)-1-penten-3-one hydrochlorides.\n", "abstract": " Reaction of 1-(4-bromophenyl)-4, 4-dimethyl-5-(1-piperidino)-1-penten-3-one hydrochloride (1f) with sodium 2-mercaptoethanesulphonate (mesna) gave rise to the thiol adduct. 3. Recrystallization of this compound led to the formation of the corresponding zwitterion 4f. A series of analogues of 4f were prepared and the structure of a representative compound was confirmed by X-ray crystallography. In general, the thiol adducts had similar activity towards P388 cells and human tumour cell lines as the precursor enones 1 although greater selectivity to malignant diseases was found with the thiol adducts. A stability study of representative compounds conducted by 1H NMR spectroscopy revealed that the thiol adducts decomposed in solution. In one case regeneration of the ketone was noted while for the other compounds, the decomposition products were not identified.", "num_citations": "19\n", "authors": ["1065"]}
{"title": "Fostering sustained knowledge building through metadiscourse aided by the Idea Thread Mapper\n", "abstract": " This study was conducted in two Grade 5/6 classrooms that studied electricity over a three-month period using Knowledge Forum. Classroom A used Idea Thread Mapper (ITM)—a timeline-based collective discourse mapping tool—to engage in ongoing metadiscourse to review collective advances and gaps. Classroom B did not engage in this reflective practice until near the end of the inquiry. The results show that members of class A had more comprehensive and coherent awareness of the various inquiry themes discussed by their community focusing on deep conceptualization of electricity. Informed by the reflective awareness, classroom A also engaged in more active and connected online discourse to address deepening issues and develop coherent explanations across different lines of inquiry.", "num_citations": "18\n", "authors": ["1065"]}
{"title": "Computer-Supported Metadiscourse to Foster Collective Progress in KnowledgeBuilding Communities\n", "abstract": " This study investigates metacognitive conversations in two grade 5/6 classrooms that engaged in knowledge building about the human body using Knowledge Forum. The metacognitive conversations were supported by Idea Thread Mapper (ITM), which makes collective progress in online discourse visible for collaborative reflection. The analyses elaborate the processes of the metadiscourse and the teachers' role.", "num_citations": "17\n", "authors": ["1065"]}
{"title": "Cross-layer packet scheduling for downlink multiuser OFDM systems\n", "abstract": " This paper proposes a channel and queue aware fair (CQAF) packet scheduling scheme for the downlink packet transmission in multiuser orthogonal frequency division multiplexing (OFDM) systems. By making use of the information on the channel conditions and the queue lengths, the proposed CQAF packet scheduling scheme efficiently allocates the subcarriers, transmission power and modulation level to users under the constraints of total transmission power, the number of subcarriers, bit-error-rate (BER) requirement and generalized processor sharing (GPS)-based fairness requirement. The numerical results show that the proposed CQAF packet scheduling scheme can reduce the transmission delay and queue length significantly while maximizing system throughput and maintaining fairness among users.", "num_citations": "16\n", "authors": ["1065"]}
{"title": "A high sensitive SH-SAW biosensor based 36° YX black LiTaO3 for label-free detection of Pseudomonas Aeruginosa\n", "abstract": " A label-free and high sensitive shear horizontal surface acoustic wave (SH-SAW) biosensor for the nucleic acid detection of Pseudomonas Aeruginosa was developed in this work. An effective detection cell was fabricated by dint of acrylic material. The base frequency of the SH-SAW biosensor fabricated on 36°Y-X rotated black LiTaO3 piezoelectric substrate was 210 MHz. The self-assembled monolayer was formed on the gold surface of the sensitive area, and the increase of mass loading in the sensitive area leads to phase shift of SH-SAW. In this work, the detection limit has been improved by 3–4 times than that in our previous works, which is 1 nmol/L for the nucleic acid of the Pseudomonas Aeruginosa. And the phase shifts related to detection sensitivity are also elevated to 4 ° after the specific binding of the ss-DNA probes and the complementary sequences. In this study, the plot of phase shift against the …", "num_citations": "15\n", "authors": ["1065"]}
{"title": "Slicing component-based systems\n", "abstract": " We present a dependence model based on which an efficient slicing algorithm is applied to compute forward slices for impact analysis and for regression test selection. The dependence model not only captures control and data dependence relationships, but also depicts dependence between components and their execution contexts. The model is constructed in a hierarchical fashion, from inter-statement to inter-component level, where at each level detailed dependence relationships are analyzed, then summarized information is published for the next level of composition. With this model, our slicing algorithm identifies all the affected elements that can be utilized to effectively select regression test cases. The analysis shows that our approach is more efficient than the existing approaches in terms of the execution time and the space requirements. And the promising results of regression testing obtained from the …", "num_citations": "13\n", "authors": ["1065"]}
{"title": "Limiting factors of RF performance improvement as down-scaling to 65-nm node MOSFETs\n", "abstract": " As continuous down-scaling the RF MOSFETs into 65 nm node, the RF performance of fT, fmax and NFmin also show the dependence on short channel effect owing to increasing drain current and transconductance. The device performance was improved by accurate higher drain bias conditions in the nano-scale devices, which produced a 20% enhancement of the saturation drain current, 5% fT increased and 3% lowered NFmin. The NFmin of 0.63 dB, at 10 GHz under a drain bias of 1.2 V was found. However, the fT improves continuously to 65 nm node transistors, but the fmax and NFmin is limited at 65 nm node devices than 90 nm node devices due to the parasitic effect.", "num_citations": "11\n", "authors": ["1065"]}
{"title": "Development and perspective of research for microbolites\n", "abstract": " This paper briefs the difinition of microbolite, its research content and practical significance, divides the research history into four developmental stages, ie the early enlightment, controversy between palaeontologic school and actualism (sedimentary) schoo, comparative actualism (sedimentology) and microbial sedimentology, refering to the rocks, microbes, ecosystems, environments, classification and evolution of microbolites. The hot research topics of nowadays, which are microbial reefs and mounds, travertine deposits and P, Fe, Mn microbolites are also introduced. And points out developing trends about structure type, sedimentary environment, component rock and genetic index. Finally, suggests that the facing tasks are to analyse and identify fossil bacteria, microbial textures, structures and minerals, indicator elements, isotopes and biomarkers, as well as microbial ecosystems and lithogenetic and …", "num_citations": "11\n", "authors": ["1065"]}
{"title": "Idea Thread Mapper: Designs for sustaining student-driven knowledge building across classrooms\n", "abstract": " This research project aims to address the intra- and inter-community challenges associated with student-driven knowledge building over longer terms and across classrooms, in which students take on collective responsibility for charting the course of sustained inquiry and dynamic interaction. We designed the Idea Thread Mapper (ITM) system to support knowledge building in each classroom community as well as idea interaction across communities. At a local classroom level, students engage in focused inquiry and knowledge- building discourse. As their inquiry proceeds, they carry out metacognitive conversations to frame/reframe their collective inquiry directions and processes and synthesize their journey of thinking over time. For cross-community interaction, they selectively share productive idea threads and syntheses in a cross-community space for idea contact with broader knowledge builders. Supported by ITM, we conducted design-based research in a network of Grades 3-6 classrooms. Findings and implications are discussed.", "num_citations": "10\n", "authors": ["1065"]}
{"title": "Progressive reliability forecasting of service-oriented software\n", "abstract": " Reliability is an essential quality requirement for service-oriented systems. A number of models have been developed for predicting reliability of traditional software, in which code-based defects are the main concern for the causes of failures. Service-oriented software, however, shares many common characteristics with distributed systems and web applications. In addition to residual defects, the reliabilities of these types of systems can be affected by their execution context, message transmission media, and their usages. We present a case study to demonstrate that the reliability of a service varies on an hourly basis, and reliability forecasts should be recalibrated accordingly. In this study, the failure behavior of a required external service, used by a provided service, was monitored for two months to compute the initial estimates, which then continuously re-computed based on the learning of the new failure patterns …", "num_citations": "10\n", "authors": ["1065"]}
{"title": "Tools and techniques for testing-based software reliability estimation\n", "abstract": " In this dissertation we point out some fundamental problems with the time-domain models which use the notion of\" time\" between failures or the number of faults within a certain time duration, and present our coverage enhanced time-domain reliability models. The coverage enhanced models extend the existing time-domain models by using the notion of useless testing effort. A key feature of our model, unlike the existing models, is that it takes into account the structure of the software under development. This feature not only distinguishes our model from all the existing reliability models, but it is also the basis of our claim that structure-based reliability models are likely to provide more accurate reliability estimates than the existing time-domain models.", "num_citations": "10\n", "authors": ["1065"]}
{"title": "Effective online software anomaly detection\n", "abstract": " While automatic online software anomaly detection is crucial for ensuring the quality of production software, current techniques are mostly inefficient and ineffective. For online software, its inputs are usually provided by the users at runtime and the validity of the outputs cannot be automatically verified without a predefined oracle. Furthermore, some online anomalous behavior may be caused by the anomalies in the execution context, rather than by any code defect, which are even more difficult to detect. Existing approaches tackle this problem by identifying certain properties observed from the executions of the software during a training process and using them to monitor online software behavior. However, they may require a large execution overhead for monitoring the properties, which limits the applicability of these approaches for online monitoring. We present a methodology that applies effective algorithms to …", "num_citations": "9\n", "authors": ["1065"]}
{"title": "Future learning spaces for learning communities: New directions and conceptual frameworks\n", "abstract": " This symposium presents our efforts to reconceptualize learning spaces from their traditional notions as bound and immutable to one where the physical and social boundaries are flexible and dynamically connected to the learning itself. We present the work from five international research centers that consider space as a multi-dimensional mediational tool that shapes, and is shaped by, the learning communities who use them. In each case, researchers will present their innovative spaces along with the learning community frameworks they use to describe and design them. Each study demonstrates specific insights regarding how to conceptualize and design Future Learning Spaces for Learning Communities.", "num_citations": "9\n", "authors": ["1065"]}
{"title": "Online reliability computing of composite services based on program invariants\n", "abstract": " Reliability is an essential software quality requirement, especially for online service software. Without an accurate prediction of service reliability, any unexpected failure can disrupt service. The majority of existing models use static data collected prior to the release of the software. These types of models may predict the reliability of the software as it was during the data collection phase. However, online service software is continuously evolving, and their behaviors can be changed by the runtime usage. Thus, the prediction made by static data can be inaccurate. We present an approach to tackle this challenge by taking into account software runtime behavior in our reliability prediction. We used a data mining tool, Daikon, to collect likely invariants of the software to capture its states in the runtime. This runtime information is then used to compute the reliability of the software by using our port-based reliability model.", "num_citations": "9\n", "authors": ["1065"]}
{"title": "Superluminal surface polaritonic solitons at weak light level via coherent population oscillation\n", "abstract": " We investigate the possibility of generating nonlinear surface polaritons at the interface between a negative-index metamaterial and a dielectric doped with two-level quantum emitters by means of coherent population oscillation (CPO) working at room temperature. Based on the CPO and the strong confinement of the optical field near the interface, we find that the system can possess a giant Kerr nonlinearity. We demonstrate that it is possible to obtain a type of surface polaritonic solitons which is not only robust during propagation but also has ultraweak generation power and superluminal propagating velocity.", "num_citations": "9\n", "authors": ["1065"]}
{"title": "Testing component-based software\n", "abstract": " Component-based software development facilitates software reuse and promotes productivity and quality. Although much work has been proposed for building component-based systems, techniques of testing component-based systems have not been well developed. In this paper, we present a technique for component-based software in integration testing. Our approach uses both static and dynamic analysis to guide test case generation. Static analysis captures the interaction relationship among the components, which is used to investigate what needs to be tested. Dynamic analysis keeps track of the interface invocations as well as event triggering for each test executed, and the information is used to determine test adequacy. The methodology proposed is efficient and effective, as demonstrated by the promising results obtained from an empirical study.", "num_citations": "9\n", "authors": ["1065"]}
{"title": "Assessment of the molluscicidal activities of tribromosalan, cartap and chlorothalonil against Oncomelania hupensis\n", "abstract": " Molluscicidal activities of Tribromosalan, Cartap and Chlorothalonil were evaluated in the laboratory and the field against Oncomelania hupensis, the intermediate host of Schistosoma japonicum in China. The three chemicals were very effective against O. hupensis in the laboratory. The molluscicidal activities found in the field trials suggest that Tribromosalan and Cartap may be used as practical molluscicides. Dosage of 10 g/m2 of Tribromosalan in spring only and 20 g/m2 of Cartap in both spring and autumn would be recommendable as practical mollusciciding doses for the control of O. hupensis.", "num_citations": "9\n", "authors": ["1065"]}
{"title": "Letrozole improves the sensitivity of breast cancer cells overexpressing aromatase to cisplatin via down-regulation of FEN1\n", "abstract": " Purpose                 Flap endonuclease 1 (FEN1) is up-regulated by estrogen (17β-estradiol, E2) and related to cisplatin resistance of human breast cancer cells. Letrozole, an aromatase inhibitor, suppresses the change of testosterone into estrogen and is frequently used to treat breast cancer. However, the effects of letrozole on FEN1 expression and cisplatin sensitivity in breast cancer cells overexpressing aromatase have not been revealed.                                               Methods                 The expression of FEN1 and the proteins in ERK/Elk-1 signaling were evaluated by RT-PCR and Western blot. Cisplatin sensitivity was explored through CCK-8 and flow cytometry analysis, respectively. FEN1 siRNAs and FEN1 expression plasmid were transfected into cells to down-regulate or up-regulate FEN1 expression. The promotor activity of FEN1 was detected using luciferase reporter assay …", "num_citations": "8\n", "authors": ["1065"]}
{"title": "Metadiscourse on collective knowledge progress to inform sustained knowledge-building discourse\n", "abstract": " This study was conducted in two Grade 5/6 classrooms that studied electricity over a three-month period using Knowledge Forum. Classroom A used Idea Thread Mapper (ITM)—a timeline-based collective discourse mapping tool—to engage in ongoing metadiscourse to review collective advances and gaps. Classroom B did not engage in this reflective practice until near the end of the inquiry. The results show that members of class A had more comprehensive and coherent awareness of the various inquiry themes discussed by their community focusing on deep conceptualization of electricity. Informed by the reflective awareness, classroom A also engaged in more active and connected online discourse to address deepening issues and develop coherent explanations across different line of inquiry.", "num_citations": "8\n", "authors": ["1065"]}
{"title": "Capillary electrophoretic determination of selected phenolic compounds in humic substances of well waters and fertilizers\n", "abstract": " Humic substances (HS), complex yellowish-brown and refractory organic materials, are ubiquitous in aquatic and terrestrial environments and play an important role in the carbon cycle, as well as in the fate of organic and inorganic pollutants in the environment. 1 HS exhibit various ratios of extractable humic acids (HA) to fulvic acids (FA). Lignins, polyphenolic compounds abundant in vascular plants, are widespread in land and coastal environments, 2–5 and represent a major precursor to terrestrial HS. 1There are many natural pathways, including photolysis, 6 thermal, 7 microbial, 8 and bacterial degradation, 9 which could release these phenolic building blocks from HS polymeric networks. These degraded fragments may enter directly into the circulatory systems of many organisms, or exist in vivo following the metabolism of intact polymers. Deep concern has been expressed with regard to blackfoot disease (BFD), which has been endemic in southwestern Taiwan for decades. Many studies on its cytotoxicity induced by HS, especially HA, have been carried out. 10–12 The types and effects of various degraded molecules from HS on pathogenic mechanisms, however, have still not been determined.", "num_citations": "8\n", "authors": ["1065"]}
{"title": "Automatic test case generation for multi-tier web applications\n", "abstract": " Testing multi-tier Web applications is challenging yet critical. First, because of inter-tier interactions, a fault in one tier may propagate to the others. Second, Web applications are often continuously evolving. Testing such emerging applications must efficiently generate test cases to catch up with fast-paced evolution and effectively capture cross-tier faults. We present a technique based on an inter-connection dependence model to generate sequences of Web pages that are potentially fault prone. To ensure that these sequences of Web pages will be exercised as designated, the path condition for each execution path is computed and used to determine the domain of each input parameter and database state. Input data for each Web page can then be automatically generated by using boundary value analysis. The test suite generated by our technique guarantees that inter-tier interactions will be adequately tested.", "num_citations": "7\n", "authors": ["1065"]}
{"title": "Maintaining multi-tier web applications\n", "abstract": " Large-scale multi-tier web applications are inherently dynamic, complex, heterogeneous and constantly evolving. Maintaining such applications is important yet inevitably expensive. First, the size of the test suite of an evolving system will be continuously growing. Second, to ensure that the changes will not affect the quality of the systems, regression testing is frequently performed. To effectively and efficiently maintain web applications after each change, obsolete test cases must be removed and regression testing should selectively re-test. To this end there is a need for an inter-tier change impact analysis, which requires a coherent model rendering inter-tier dependence information. We present a technique that makes use of an integrated inter-connection dependence model to analyze cross-tier change impacts. These are then used to select affected test cases for regression testing and to identify repairable test …", "num_citations": "7\n", "authors": ["1065"]}
{"title": "Effect of architecture configuration on software reliability and performance estimation\n", "abstract": " Presents a case study that enables the early prediction of software reliability and performance at the architecture design stage. Software architecture design is a crucial stage in the software development process, especially in developing large-scale software. Early prediction of the reliability and performance of the software can be used as a basis for making design decisions. We have studied several common architectural styles, with emphasis on the pipe-filter and the batch-sequential styles, and observed the impact of different configurations on reliability and performance measurements. Moreover, several external factors that might have an influence on these measurements are studied. The results show that altering the architecture configuration to attain higher reliability and/or better performance is feasible depending on variations in the execution environment.", "num_citations": "7\n", "authors": ["1065"]}
{"title": "Systems Pharmacology for the Study of Anticancer Drugs: Promises and Challenges, Clin. Pharmacol\n", "abstract": " Systems pharmacology (SP) is an emerging branch in the field of pharmacological science that applies systematic approaches to the study of pharmacology with an aim to provide a holistic understanding of mechanism of action of drugs on various levels of biological system. SP is a discipline bridging systems biology and pharmacokineticspharmacodynamics (PK-PD) to enhance systematic understanding of the efficacy and side effect of existing drugs in order to identify predictive biomarkers for treatment outcomes and targetable pharmacophores for drug discovery [1, 2]. Network analysis is the main approach to studying SP with a focus on identifying desired and undesirable targets within the networks of diseases and drug responses, including chemicals, proteins or nucleic acids. The successful application of network analysis to SP relies on the advance of computational analysis techniques and the availability of high throughput biological data on drug discovery generated by “omics” studies, such as genomics, proteomics, metabolomics and transcriptomics [2, 3]. Ultimately, network analysis could provide global views on drug-target relationships and intertwining interactions among cellular pathways in physiological and pathological processes [4-6]. Systems pharmacology approaches have recently been implicated in the studies of anticancer drugs, especially in new drug discovery and understanding of variability in responses to chemotherapy, by providing insights systematically into the relationships between tumour phenotypes, oncogenes and drug targets.Identification of valid drug targets is perhaps the biggest challenge in drug …", "num_citations": "6\n", "authors": ["1065"]}
{"title": "Differential source follower having 6dB gain with applications to WiGig baseband filters\n", "abstract": " Sallen-Key filters require an operational amplifier with a large input impedance and a small output impedance to meet the external filter characteristics. This invention eliminates the need for internal feedback path for stability and increases the gain of a source follower which has characteristics matching the operational amplifier in the Sallen-Key filter. The source follower provides 6 dB of AC voltage gain and is substituted for the operational amplifier in the Sallen-Key filter. The Sallen-Key filter requires a differential configuration to generate all the required signals with their complements and uses these signals in a feed forward path. Furthermore, since the source follower uses only two n-channel stacked devices, the headroom voltage is maximized to several hundred millivolts for a 1.2 V voltage supply in a 40 nm CMOS technology. Thus, the required 880 MHz bandwidth of the Sallen-Key filter can be easily met …", "num_citations": "6\n", "authors": ["1065"]}
{"title": "费氏中华根瘤菌 (Sinorhizobium fredii) 的多样性研究\n", "abstract": " 用大豆品种Willimas和黑龙33从多年种植大豆未接种根瘤菌的土壤中捕集大豆根瘤菌,从分离株中选出50株费氏中华根瘤菌,对供试菌株的培养特性,生长速度,耐酸,耐碱性,生长最终pH值,天然抗药性,CN源利用,刚果红吸收强度,产黑色素能力和质粒图谱类型进行了系统的比较研究,并通过聚类分析得到树状图谱,证实了不同土壤中费氏中华根瘤菌的多样性.", "num_citations": "6\n", "authors": ["1065"]}
{"title": "Thermal Regimes of Lithosphere and Geothermal Resources Potential in Fujian Province, China1\n", "abstract": " From the determinations of surface heat flow based on silica geothermometry, residual heat flow, radiogenic heat production of rocks, thermal conductivities of rocks and so on, the temperatures at different depths of the lithosphere in Fujian Province are estimated by using a one‐dimensional steady‐state model. According to these and the research on geological structures, the possibility of existence of various geothermal systems in Fujian is discussed. The authors consider that in Fujian, geothermal systems related to shallow magmatism do not exist and hot dry rock systems can not be exploited for the time being. However, intermediate‐ and low‐temperature hydrothermal systems are well developed. They are controlled by active faults and distributed widely in southeastern Fujian, but do not have an anomalous heat source. The groundwater circulates at great depths and has a temperature usually less than 150 …", "num_citations": "6\n", "authors": ["1065"]}
{"title": "Cross-boundary Interaction for Sustaining Idea Development and Knowledge Building With Idea Thread Mapper\n", "abstract": " This study investigated the cross-classroom interaction in four grade 5 knowledge building communities as the third iteration of design-based research. The four classrooms studied human body systems with the support of the Idea Thread Mapper platform. As the students conducted focused inquiry and discourse within their own community, they posted reflective syntheses of their \"Journey of Thinking\" to a cross-community space accessible to the broader peers from other classrooms. Students from the four classrooms further participated in a live \"Super Talk\" to collaboratively address a challenging question. Qualitative analyses of classroom videos, online discourse, and classroom observation notes provide a rich description of how the students interacted within and across communities to develop scientific understandings.", "num_citations": "5\n", "authors": ["1065"]}
{"title": "A heuristic transition executability analysis method for generating EFSM-specified protocol test sequences\n", "abstract": " Automatic executable test sequence generation is a challenging task for protocol test based on the Extended Finite State Machine (EFSM) model. Transition executability analysis (TEA) can guarantee the executability of generated test sequences. However, as a reachability analysis technique, it often suffers from the state explosion problem. To remedy the situation, this paper proposes a heuristic transition executability analysis (HTEA) method for compressing the explored state space during test sequences derivation. In our approach, a transition feasibility guidance matrix is first constructed through extracting the inherent constraint relationship between each adjacent transitions in the EFSM under testing. Then, relying on the built matrix and related runtime feedback, we define an objective function to dynamically evaluate state nodes in the HTEA expanding tree. Finally, the proposed objective function is utilized to …", "num_citations": "5\n", "authors": ["1065"]}
{"title": "Pricing-based distributed power control for weighted sum energy-efficiency maximization in ad hoc networks\n", "abstract": " We consider the problem of maximizing the weighted sum energy efficiency (WS-EE) in ad hoc networks. To solve this problem in a distributed manner, one novel distributed adaptive-pricing algorithm is developed based on limited information exchange among the nodes. Specifically, each node updates its current interference information and broadcasts it to the other nodes. Having collected all this information, each node can adjust its transmit power accordingly with simple arithmetical operations. Then iterate these two steps. This algorithm is strictly proven to be convergent and can attain the KKT optimality conditions of the problem. Moreover, an alternative centralized algorithm based on gradient projection method is proposed to serve as the performance benchmark. Simulation results show that the proposed distributed algorithm converges rapidly. Furthermore, this distributed algorithm performs as well as the …", "num_citations": "5\n", "authors": ["1065"]}
{"title": "On-line evaluating the SS removals for chemical coagulation using digital image analysis and artificial neural networks\n", "abstract": " Chemical coagulation is one of the most important processes for industrial wastewater treatment plants to remove the suspended solids (SS), which depend significantly on particle characteristics. A digital image analysis system was set up in this study for the on-line measurements of particle characteristics, including particle size distribution, equivalent diameter, total area, total volume, and the fractal dimension in the both coagulation and flocculation periods in chemical coagulation. Two real industrial wastewaters, textile wastewater and landfill leachate, were used for conducting the coagulation and flocculation processes with different polyaluminum chloride dosages in a batch reactor. The artificial neural network (ANN) models were used to construct the correlations between the monitoring data acquired and the SS removal efficiencies. The experimental results indicated that the ANN models were able …", "num_citations": "5\n", "authors": ["1065"]}
{"title": "Using idea thread mapper to support collaborative reflection for sustained knowledge building\n", "abstract": " This paper reports a design-based study conducted in a Grade 5/6 classroom over two consecutive school years. Students of each year engaged in knowledge building in a scientific area using Knowledge Forum. The design innovation focused on engaging students in collective metadiscourse to review knowledge goals and progress with the support of Idea", "num_citations": "5\n", "authors": ["1065"]}
{"title": "Effect of data validity on the reliability of data-centric web services\n", "abstract": " Reliability is an essential quality requirement for web services. Existing techniques for measuring reliability of web services mainly focus on failures caused by code-based defects. For data-centric web services, the reliability of services can be significantly affected by the quality of data used to provide services. However, the impact of data quality on the reliability of web services has rarely been explored. We present an approach to estimate data quality and to incorporate data quality with the reliability of software components in the reliability estimation of web services. To demonstrate the proposed approach, we present a case study on a government web service. In this study we observed that more than 60% of service failures reported over a three-month period were caused by invalid data. The results show that by taking into account data quality, the reliability estimate of the web service is more accurate than the …", "num_citations": "5\n", "authors": ["1065"]}
{"title": "Mechanism of jointed rock loosing under blasting load\n", "abstract": " With the theory of stress wave, it discussed mechanism of jointed rock loosing under blasting load. And this was verified by a numerical simulation using the dynamic finite element method. Results show that, compression of blasting load can store strain energy in rocks and quick unloading of the stresses can lead to elastic recovery, which are the essential reason for rock loosing during blast excavation. Blast disturbance can induce rock loosing, typical characteristics are shear moving of rocks in the normal direction of excavation surface and opening of weak planes in the parallel direction. The dynamic finite element method, which adopts Lagrange coordinates, can be used to simulate better the loosing process of jointed rock under blasting load. For example, the program of ANSYS/LS-DYNA is good for this case.", "num_citations": "5\n", "authors": ["1065"]}
{"title": "Automatic Test Generation for Database-Driven Applications.\n", "abstract": " Database-driven software has been widely adopted in many areas of software applications. In this type of software, the database is an integrated part of the system. Traditional testing techniques have focused either on the software or on the databases, but ignored the interactions between the two core components of the system. Recently, the importance of testing database-driven applications has gradually been recognized. Testing cannot be considered complete until the software and its interactions with databases are adequately exercised. In this paper, we present an automatic test case generation for testing the interactions between the applications and the databases. The aim is to generate a test suite that can fulfill the requirement of a set of test adequacy criteria that cover def-use associations of database interactions and the boundary points. We present a tool that supports automatic generation of test cases and a case study conducted to demonstrate the validity of the technique and the tool.", "num_citations": "5\n", "authors": ["1065"]}
{"title": "A wrinkled membrane model for cloth draping with multigrid acceleration\n", "abstract": " Fabric is modeled as a particular type of membrane formed from two orthogonal families of yarns. In contrast to usual membrane theory, the fabric is regarded to possess a certain compressive rigidity which is much weaker than its tensile rigidity. An energy density function is defined corresponding to the material model. The finite element formulation is based on the total Lagrangian approach. Four node quadrilateral elements are adopted. An accelerated multigrid technique using the conjugate gradient method as basic iterative method is employed to minimize energy to reach the final equilibrium position. Two examples of fabric draping are analyzed using the proposed model. The influence of the material parameters on the draping behavior is discussed.", "num_citations": "5\n", "authors": ["1065"]}
{"title": "Toward a multi-level knowledge building innovation network\n", "abstract": " Knowledge building requires collaborative bootstrapping, with participants at all levels of the education system part of a collective effort to go beyond information exchange to innovation-producing networks that demonstrate that education can operate as a knowledge creating enterprise. Organizational theories and research are increasingly focused on multilevel perspectives for creating actionable knowledge; the challenge is to take advantage of emergence to self-organize around solutions and new means. By “innovation networks” we mean networks that go beyond sharing and discussion to the actual creation of new knowledge and innovations. Self-organization and emergence surround us, all the time and at multiple levels, whether we are aware or not. However, self-organization around idea improvement is rare and requires engaging innovative capacity at all levels, a research-intensive enterprise surrounding innovations, and an open source engineering team committed to enabling new forms of interaction, media, and analytic tools. “Multi-level” envisions inclusion of students, teachers, administrators, researchers, engineers, and policy makers in a collaborative enterprise. This session takes the form of a design think tank to advance conceptual frameworks and means for new and more powerful environments to support a multi-level knowledge building innovation network.", "num_citations": "4\n", "authors": ["1065"]}
{"title": "Effects, safety and cost-benefit analysis of Down syndrome screening in first trimester\n", "abstract": " OBJECTIVE: To investigate the effects, safety and cost-benefit analysis of Down syndrome screening in first trimester. METHODS: From January 2009 to December 2012, 43 729 pregnant women undergoing 3 methods of Down syndrome traditional screening strategies in Shenzhen Maternity and Child Healthcare Hospital were studied retrospectively, including in 17 502 cases in pregnancy associated plasma protein A (PAPP-A) and free β-hCG measured biochemistry screening, 14 080 cases in nuchal translucency (NT) screening and 12 147 cases in combined screening, meanwhile, 7 389 cases on non-invasive fetal trisomy test (NIFTY) were performed in Huada Gene Research Institute (BGI). The effects and safety of four screening strategies were assessed throughout a decision tree. The economical characters of each screening strategy were compared by cost-effectiveness analysis as well as cost-benefit analysis. RESULTS:(1) The effects of four strategies are: NIFTY> combined screening> NT screening> biochemistry screening.(2) The safety of four strategies are: NIFTY> combined screening> NT screening> biochemistry screening.(3) Cost-effectiveness analysis and cost-benefit analysis: the biochemistry screening has lowest cost-effectiveness ratio (CER) and highest cost-benefit ratio (CBR), which performed a better economical efficiency. The incremental CER of three traditional screening strategies are all less than the economical burden of Down syndrome. NIFTY has highest CER and negative net present value (NPV), NPV would be positive and CBR would be more than 1 if the price of NIFTY reduce to 1 434 Yuan …", "num_citations": "4\n", "authors": ["1065"]}
{"title": "SVPWM over-modulation scheme of NPC three-level converter using vector synthesization\n", "abstract": " Common neutral-point voltage balance control technique can not decrease fluctuation of the neutral-point voltage but effectively eliminate offset of the neutral-point voltage. In order to decrease fluctuation of the neutral-point voltage, we present a novel output vector order of over-modulation using vectors synthesizing concept. The new method can decrease action time of the middle vector to 1/3 of the conventional over-modulation technology. Therefore, the method can reduce fluctuation of the neutral-point voltage to the full extent, realize the aim of over-modulation, and improve the performance of the system. Both single-mode and dual-mode over-modulation technology can use this method to synthesize output vector on hexagon. The simulation results reveal that the new method is valid and feasible.", "num_citations": "4\n", "authors": ["1065"]}
{"title": "A wideband 0.18 μm CMOS LNA with RC-feedback topology for UWB applications\n", "abstract": " A 0.18 mum CMOS low noise amplifier using RC-feedback topology is proposed with optimized matching, gain, noise, linearity and area for UWB applications. The IC prototype achieved 9.5 dB of average power gain, low 3.4 dB noise figure (NF), -9.2 dB input match, -13.5 dB return loss, -6 dBm of IIP3 and only 0.54 mm 2  size with 15 mW power consumption. Good agreement between the simulated and measured results is found.", "num_citations": "4\n", "authors": ["1065"]}
{"title": "Dataflow analysis and testing of software components.\n", "abstract": " Software components have been dramatically adopted in building large-scale complex software systems. Since the components are often assembled by using a plug-and-play approach, they must be thoroughly tested prior to the deployment. In this paper, we present a set of dataflow coverage criteria for guiding test case generation as well as an efficient algorithm for computing def-use associations. The coverage criteria include six levels of def-use associations that need to be exercised to explore plausible faults introduced by the data manipulations. Moreover, we address the callback and re-entrance features of components, which may introduce additional def-use pairs that cannot be identified by using traditional dataflow analysis approaches. Our dataflow analysis is based on the components’ common composition structure and the nature of execution flows. The algorithm makes use of a Def-Use Binding Graph to compute def-use associations, which eliminates the need of def-use propagation; thus its space requirement can be reduced from quadratic to linear proportional to the component size. A component that is adequately tested by using these dataflow coverage criteria can be reliably deployed in various execution contexts. Furthermore, the test cases and scripts can be reused in integration, thereby making testing more effective.", "num_citations": "4\n", "authors": ["1065"]}
{"title": "The influence of fat on the deterioration of food aroma in model systems during storage\n", "abstract": " Storage studies (30 and 45°C) determining the stability of selected, aroma compounds (50 ppm) in the presence of simple microcrystalline cellulose (MCC) (with or without 5% vegetable oil and water activities of 0.11, 0.33, 0.53 and 0.76) were conducted. MCC was found to exhibit substantial aroma compound binding. Binding appeared to be strongly dependent on water activity with the binding being less at higher water activities and appeared to reach a maximum at an Aw of approximately 0.33.Aroma compounds varied greatly in terms of storage stability in the presence of our two model systems. Furfurylmercaptan, pyrrole, 1-methylpyrrole, 2,4-hexadienal and ethyl-2-mercaptoproprionate were found to be very unstable during storage (listed in decreasing order of loss). The inclusion of oil in the model systems invariably increased the stability of the aroma compounds studied although sometimes losses were so …", "num_citations": "4\n", "authors": ["1065"]}
{"title": "PAM sequence design for dimmable visible light communication\n", "abstract": " In current visible light communication (VLC) systems employing intensity modulation and direct detection (IM/DD), the transmitted optical intensity signal must satisfy the nonnegativity, peak optical intensity and illumination constraints. By taking into account the three constraints, we first present the signal space for the pulse amplitude modulated (PAM) sequences in the maximum flickering time period (MFTP). Then, to minimize the error probability of the VLC systems, we seek to find the PAM sequences providing the largest minimum Euclidean distance. Since the objective function is nonconvex and nondifferentiable, it is difficult to solve the original optimization problem directly. Thus, two methods corresponding to the joint design and greedy algorithm, are proposed to design the PAM sequences in VLC. The two methods offer a tradeoff between the symbol error rate (SER) performance and design complexity.", "num_citations": "3\n", "authors": ["1065"]}
{"title": "Making a difference: analytics for quality knowledge-building conversations\n", "abstract": " The symposium focuses on the analysis of the knowledge building process e.g. idea improvement conversations by which students get to a high quality of knowledge and understanding. Learning Analytics (LA) focuses on the collection, measure and analysis of data about learners and their contexts (Long & Siemens, 2011). LA tools are normally rooted in probabilistic/frequency-based approaches. These are themselves incapable of capturing the meaning of texts at any level, because probabilities do not constitute natural language semantics.  \\  \\ Therefore, semantic related analytics seems to be a promising approach. Not only to get insight in the process of knowledge building as a support for students and teachers in this collective process but also as a possibility for assessment. Not to control but to mirror and feed forward the semiotic collaborative process of building an understanding that makes a difference for how students look at and act in our world.", "num_citations": "3\n", "authors": ["1065"]}
{"title": "Online reliability prediction of service composition\n", "abstract": " Reliability is an important quality attribute for service oriented software. Existing approaches use static data collected from the testing to predict the software reliability. These approaches do not address the dynamism of service behavior after deployment. In this paper, we propose a method from any time moment to predict reliability of service composition in the near future. We first collect the service runtime data to predict the future failure data by using the ARIMA model. We then predict the reliability of each port based on the Nelson model, and nally we can compute the reliability of composite services. An Online Shop example is used to demonstrate the eectiveness of our method.", "num_citations": "3\n", "authors": ["1065"]}
{"title": "A revision approach based on assignment equivalence classes\n", "abstract": " The problem of belief revision and specification evolution has been studied for years. Different methods have been proposed to solve this problem. However, the problem of efficiency has not been solved well. Therefore, this paper proposes a revision algorithm based on assignment equivalence classes to improve the efficiency of the delegate model based algorithm. The new algorithm follows the same structure of the delegate model based algorithm but reduces the times of model checking. Concepts such as delegate models of a proposition set and sub-assignment equivalence classes are introduced, and relevant properties are also proved. The new algorithm is implemented, which has a better performance than before.", "num_citations": "3\n", "authors": ["1065"]}
{"title": "Detection and genotyping of Campylobacter jejuni and Campylobacter coli in food samples by fla-DGGE.\n", "abstract": " The aim of this study was to apply a denaturing gradient gel electrophoresis electrophoresis Subject Category: Techniques, Methodologies and Equipment", "num_citations": "3\n", "authors": ["1065"]}
{"title": "Laboratory and field assessment of molluscicidal activity of B-2 against Oncomelania hupensis, the vector snail of schistosomiasis in China\n", "abstract": " Molluscicidal activity of B-2 (sodium 2, 5-dichloro-4-bromophenol; called as Phebrol and registered in WHO as OMS 3012) was evaluated in a laboratory and the field trials were performed in two different localities inYueyang city, China, for control of Oncomelania hupensis. B-2 was effective against 0. hupensis both in the laboratory and in the field. A dosage of 50 g/m2 in 10% granular form or 20 ml/m2 in 25% liquid form of B-2 would be recommendable as a standard mollusciciding dose for control of O. hupensis.", "num_citations": "3\n", "authors": ["1065"]}
{"title": "Resource Allocation for Relay-Assisted D2D Communications with Network Coding\n", "abstract": " Network coding is widely adopted in ad hoc networks to enhance the network throughput while few attention has been paid on applying it in device- to-device (D2D) networks. In this paper, we consider a relay-assisted D2D network with inter- session network coding, where multiple D2D users coexist in an underlaying manner. We aim to maximize the sum throughput via joint power and resource group allocation, which is formulated as a mixed integer programming problem. To solve this problem, an iterative algorithm with low complexity is accordingly proposed. Simulation results verify the effectiveness and superiority of the proposed algorithm compared with existing algorithms.", "num_citations": "2\n", "authors": ["1065"]}
{"title": "Relationship between collateral circulation and cardiac function recovery in patients receiving percutaneous coronary intervention for a single left anterior descending artery\n", "abstract": " OBJECTIVE: To explore the relationship between coronary collateral circulation following percutaneous coronary intervention (PCI) for a single left anterior descending artery and the recovery of cardiac function. METHODS: A total of 625 patients with coronary heart disease were retrospectively analyzed, who received selective coronary angiography demonstrating lesions involving a single left anterior descending artery and underwent stent placement between January, 2010 and December, 2012. According to Rentrop's classification, the patients were divided into group A (n= 280) with Rentrop grades 1-3 and group B (n= 325) with Rentrop grade 0. Group A were further divided into 3 subgroups according to the source of collateral circulation, namely group A1 (n= 200) with contralateral collateral circulation, group A2 (n= 44) with contralateral+ ipsilateral collateral circulation, and group A3 (n= 36) with ipsilateral collateral circulation. The outcomes of cardiac function recovery were compared between groups A and B and between the 3 subgroups in group A. RESULTS: Compared with patients without collateral circulation, patients with collateral coronary circulation showed greater left ventricular ejection fraction increment and reduction in brain natriuretic peptide and red cell volume distribution width with also lower expansion left ventricular end-diastolic volume. Among the 3 subgroups in group A, cardiac function improvement was the most obvious in patients with contralateral+ ipsilateral collateral circulation (group A2) followed by those in group A3, and was the worst in group A1. CONCLUSION: The presence of collateral coronary …", "num_citations": "2\n", "authors": ["1065"]}
{"title": "Cost-based data-partitioning for intra-query parallelism\n", "abstract": " Contemporary DBMS systems already use data-partitioning and data-flow analysis for intra-query parallelism. We study the problem of identifying data-partitioning targets. To rank candidates, we propose a simple cost model that relies on plan structure, operator cost and selectivity for a given base table. We evaluate this model in various optimization schemes and observe how it affects degrees of parallelism and query execution latencies across all TPC-H queries: When compared with the existing naıve model which partitions the largest physical table in the query, our approach identifies significantly better partitioning targets thus resulting in sinificantly higher degree of resource utilization and intra-query parallelism for most queries while having little impact on the remaining queries in the TPC-H benchmark.", "num_citations": "2\n", "authors": ["1065"]}
{"title": "Proton radiation damage in ZnO-pigmented white paints and optical degradation mechanisms\n", "abstract": " S781 white paints were irradiated with 150-keV protons in a simulated space environment, in order to elucidate more definitely the irradiation damage and optical degradation mechanisms for ZnO-pigmented white paints. After proton irradiations, the degradation in spectral reflectance and solar absorptance was measured in situ. The interaction between the protons and S781 white paints, and the irradiation-induced defects, were also studied through simulations and photoluminescence. The results show that the zinc vacancies in the 1-charge state are due to the ionization of the ZnO pigments, and are responsible for the b band absorption and optical degradation. Furthermore, this work also supports the first-principles results of considering zinc vacancies as the defects responsible for the green luminescence band from ZnO.", "num_citations": "2\n", "authors": ["1065"]}
{"title": "Diversity and enzyme-producing activity of culturable halophilic bacteria in Daishan Saltern of East China.\n", "abstract": " Soil and saline water samples were collected from the Daishan Saltern of East China, and the halophilic bacteria were isolated and cultured by using selective media, aimed to investigate the diversity and enzyme-producing activity of culturable halophilic bacteria in saltern environment. A total of 181 strains were isolated by culture-dependent method. Specific primers were used to amplify the 16S rRNA gene of bacteria and archaea. The operation taxonomy units (OTUs) were determined by ARDRA method, and the representative strain of each OTU was sequenced. The phylogenetic position of all the isolated strains was determined by 16S rRNA sequencing. The results showed that the isolated 181 strains displayed 21 operational taxonomic units (OTUs), of which, 12 OTUs belonged to halophilic bacteria, and the others belonged to halophilic archaea. Phylogenetic analysis indicated that there were 7 genera …", "num_citations": "2\n", "authors": ["1065"]}
{"title": "Competition mechanism of lightning upward leaders issued from UHVDC transmission lines [J]\n", "abstract": " Research on the lightning shielding failure characteristics of UHVDC transmission lines is important for adequate transmission line protection and safe operation of a power grid. Focusing the competition characteristics of upward leaders in the lightning attachment process, this work provides technical reference for efficient evaluations of lightning shielding failures and reliable lightning protection designs of UHVDC transmission lines. The charge simulation method is employed to calculate electric field distributions. Based on the calculation and some data obtained by recent long-gap discharge and lightning observations, the effect of several upward leaders starting from UHVDC transmission lines on lightning attachment processes is studied by numerical simulation. The results show that the upward leader inception is delayed, the propagation velocity is smaller, and the propagation direction of the upward leader is changed with interaction among all upward leaders, which influences the selection of lightning striking point. Therefore, in order to improve the accuracy of calculating the lightning shielding failure rate of UHVDC transmission lines, the interaction characteristics of upward leaders should be taken into account. In addition, an analysis of the influence of operating voltage and the protection angle of UHVDC transmission lines based on competition mechanism of upward leaders is made. It is found that the existence of operating voltage mainly affects the ability of the conductor and the overhead ground wire at the same side to incept upward leaders, while the protection angle mainly affects the position of the\" starting points\" of upward …", "num_citations": "2\n", "authors": ["1065"]}
{"title": "Community structure and spatio-temporal pattern of zoobenthos in Guanting Reservoir, Beijing, China\n", "abstract": " The community structure and spatio-temporal pattern of zoobenthos in Guanting Reservoir were studied from March, 2007 to December, 2007. The results showed that a total of 43 species were identified, belonging to 4 phyla, 24 families and 42 gena; The dominant species were Limnodrilus hofmeisteri, Tanypus punctipennis and Tokunagayusurika akamusi, with annual average density of 5 037 ind./m2 and biomass of 39.80 g/m2. The maximal and minimal densities and biomasses of the zoobenthos were observed in winter and summer. The density and biomass of chironomidae were found high below ice, Tokunagayusurika akamusi being 9 136 ind./m2 and biomass of 64.39 g/m2 in Wukeshu sampling station in December. The maximal annual average density and biomass of zoobenthos were found in Xiaying sampling station. The annual average value of Shannon-Wiener diversity index was 2.03 and that of Pielou index 0.56. The polluted-tolerance species L. hofmeisteri, T. punctipennis and T. akamusi overwhelmed the community, indicating that the reservoir was seriously in eutrophication. The density of zoobenthos with total phosphorous level (TP) and temperature were to be significant negatively correlated (P0. 01), with chlorophyll-a significant negatively correlated (P0. 05), with NO-3-N and pH significant positively correlated (P0. 01), with PO3-4-P, NO-2-N, SD, and water depth significant positively correlated (P0. 05), with TN not significant correlated (P0. 05). Correlation between biomass of zoobenthos and environment factors was not significant (P0. 5).", "num_citations": "2\n", "authors": ["1065"]}
{"title": "快速高效植物瞬时表达的实验室烟草无土栽培体系的构建\n", "abstract": " 目的 构建适用于快速高效植物瞬时表达系统的实验室烟草无土栽培体系. 方法优化烟草的无土栽培条件, 基于 Geminivirus 新型植物高效瞬时表达系统, 观察烟草品种, 侵染时机, 侵染工程菌浓度, 侵染后叶片采收时间对无土栽培烟草表达绿色荧光蛋白 (GFP) 的影响, 以 Western blot 和 ELISA 分析 GFP 表达情况. 结果烟草无土培育的最佳条件为: 光照强度 9000LX/层, 光照时间 16 h/d, 日/夜温度 28/21℃, 相对湿度 80%. 侵染工程菌的最佳 D600 为 0.8; 叶片采收最佳时间为侵染后 4 d; 本明烟和豫烟 5 号最佳侵染时机分别为第 6 周和第 5 周; 工程菌 pBYGFPDsRed. R/LBA4404 侵染的本明烟和豫烟 5 号均能高效表达 GFP; 豫烟 5 号的平均生物量高于本明烟. 结论基于人工气候箱成功构建了实验室烟草无土栽培体系, 并可实现 GFP 在本明烟和豫烟 5 号的快速高效表达.", "num_citations": "2\n", "authors": ["1065"]}
{"title": "Analysis of characteristics of climate change from 1951 to 2009 at Jinzhou City.\n", "abstract": " With routine meteorological data from 1951 to 2009 at Jinzhou City, the variation characteristics of the temperature temperature Subject Category: Properties", "num_citations": "2\n", "authors": ["1065"]}
{"title": "Specification-driven Structural testing of multi-tier web applications\n", "abstract": " Large scale, multi-tier web applications are inherently dynamic, complex, and heterogeneous. Testing such emerging applications is challenging yet critical. First, because of inter-tier interactions, a fault in one tier may propagate to the others; while each tier is often implemented and maintained by a designated team, detailed cross-tier information may not be available to the other teams. Second, dynamic pages, generated by backend software at runtime, have been largely used to fulfill interactive service requests. Exhaustively testing all the dynamic pages is neither practical nor feasible. Effective testing of multi-tier web applications requires a coherent model to capture the dependence relationships caused by the cross tier interactions and to provide some mechanisms for exploring dynamic pages. Existing models for structural testing of web applications have not been able to address these challenges; thus prevalent testing approaches employed by industry are mostly based on black box testing, whose effectiveness is often restrained by lack of complete specifications. Both black and white box approaches have their limitations and they can complement each other only if there exists an effective means to bridge the gap between the two. In this paper, we present a test model that synthesizes specifications and an inter-connection dependence model to guide the structural testing driven by specifications. We model the specifications by structuralizing use cases/scenarios and construct an interconnection model to capture inter-tier dependence relationships which are then rendered by using DOM-like summary Web GUI Trees. The structure of …", "num_citations": "2\n", "authors": ["1065"]}
{"title": "Excess volumes of (benzylnitrile+ an aromatic hydrocarbon) at the temperature 298.15 K\n", "abstract": " Excess volumes have been measured by means of a continuous-dilution dilatometer for [(1 −x)C6H5CH2CN +x{C6H6or C6H5CH3oro-(CH3)2C6H4orm-(CH3)2C6H4orp-(CH3)2C6H4or C6H5C2H5or C6H5CH:CH2}] at the temperature 298.15 K. Values ofVEmare negative over the entire range of composition for all mixtures. |VEm(minimum)| and |VEm(x= 0.5)| values of this series decrease in the sequence: C6H5CH3> C6H5CH2CH3>p-C6H4(CH3)2>m-C6H4(CH3)2>o-C6H4(CH3)2> C6H5CH:CH2> C6H6. The results shows that there are quite strong interactions between nitrile molecules and aromatic-hydrocarbon molecules.", "num_citations": "2\n", "authors": ["1065"]}
{"title": "Using Idea Thread Mapper to support cross-classroom “Super Talk” among four Grade 5 knowledge building communities\n", "abstract": " Enabling collaborative interaction across social levels over longer timescales represents a key research challenge in computer-supported collaborative learning (CSCL). This study investigates a multi-layer interaction approach to cross-community knowledge building supported by the design of Idea Thread Mapper (ITM).  A design-based research study was conducted in four Grade 5 classrooms that studied human body systems over six months. ITM was used to support student knowledge building discourse in each classroom and cross-classroom interaction in a shared meta-space focused on a cross-cutting challenging problem: How do people grow? Multi-level discourse analysis traced students’ collective idea development in the cross-classroom discourse that built on the diverse lines of inquiry developed within each classroom. The findings contribute new understandings and designs for expanding CSCL practices across networks of classrooms, enabling a larger creative context for students’ ever-deepening work with ideas.", "num_citations": "1\n", "authors": ["1065"]}
{"title": "Cluster Formation and Power Control for M2M-Enabled Two-Tier Cellular Network\n", "abstract": " The vast amount of the machine type communication devices (MTCDs) in machine-to-machine (M2M) communications and their limited energy budget are the crucial challenges to transmission scheme design. Clustered communication has been considered as one key technology for supporting M2M wireless networks with a large number of communication devices. This paper investigates the optimization problem of cluster formation and power control for M2M-enabled two-tier cellular network. To solve the mixed-integer non-linear programming problem, this paper proposes an algorithm that transforms the problem into a coalition structure generation sub-problem embedded with an optimal transmission power sub-problem. Compared with other approaches for solving the cluster formation and power control problem, simulation results show that the proposed algorithm can effectively solve the target problem and …", "num_citations": "1\n", "authors": ["1065"]}
{"title": "Distribution characteristics of microorganisms on the skin of submariners during closed environment voyages\n", "abstract": " Objective To investigate the distribution and changes of microorganisms on the skin of submariners under a chronically closed environment, and provide reference for targeted medical support. Methods One hundred and twenty-two samples were collected using swab. After culture and isolation, the microbes were identified by matrix-assisted laser desorption/ionization time of flight mass spectrometry (MALDI-TOF-MS). Results A total of 52 types of 229 bacteria and 2 types of fungi were isolated. Major opportunistic pathogens included Acinetobacter baumannii, Pseudomonas aeruginosa and Enterobacter cloacae, while major dwelling bacteria included Micrococcus luteus, Oslo Mora bacteria, Acinetobacter, Staphylococcus epidermidis, and Serratia marcescens. Compared with the early period of the task, major opportunistic pathogens and dwelling bacteria were significantly increased in the middle and late period of the task. Conclusion The skin microbes of the submariners are investigated, targeted drugs need to be prepared for daily medical support and war trauma.", "num_citations": "1\n", "authors": ["1065"]}
{"title": "Gestation-specific reference intervals for thyroid function tests and the clinical significance for thyroid function monitoring through different periods of pregnancy\n", "abstract": " Objective To investigate the gestation-specific reference intervals (GRIs) and dynamic changes of thyroid function at different gestational ages in Chongqing. Methods Combining self-sequential longtitudinal with cross-sectional study, the serum samples from 640 pregnant women with different gestational age were collected from June 2014 to September 2015 in the Third Military Medical University. The free triiodothyronine (FT3), free thyroxine (FT4), thyroglobulin (TG), thyroid-stimulating hormone (TSH), thyroid peroxidase antibody (TPOAb), and antithyroglobulin antibody (TGAb) were detected by the direct chemiluminescence method. According to China Guideline for the diagnosis and treatment of thyroid disease in pregnancy and postpartum in 2012, the reference interval of the thyroid function was calculated. The data were analyzed by Chi square test. Results Established GRIs of thyroid function during pregnancy in Chongqing: The GRIs was 3.68-5.59 pmol/L for FT3, 9.34-17.02 pmol/L for FT4, 0.18-5.26 mIU/L for TSH in 6-9+ 6 weeks of pregnancy; the GRIs was 3.69-6.03 pmol/L for FT3, 8.42-15.75 pmol/L for FT4, 0.09-4.85 mIU/L for TSH in 10-13+ 6 weeks of pregnancy; the GRIs was 3.24-5.46 pmol/L for FT3, 6.50-14.24 pmol/L for FT4, 0.11-5.13 mIU/L for TSH in 14-27+ 6 weeks of pregnancy; the GRIs was 3.06-5.05 pmol/L for FT3, 6.12-11.69 pmol/L for FT4, 0.75-3.67 mIU/L for TSH in 30-34 weeks of pregnancy; the GRIs was 2.96-5.00 pmol/L for FT3, 6.26-11.36 pmol/L for FT4, 0.84-5.54 mIU/L for TSH in 36-40 weeks of pregnancy. Screening by GRIs, the prevalence of thyroid dysfunction was 8.75%(46), however, the prevalence was …", "num_citations": "1\n", "authors": ["1065"]}
{"title": "Assessment of left ventricular systolic synchrony in patients with bundle branch block using speckle tracking imaging\n", "abstract": " Objective To assess left ventricular systolic synchrony in short-axis direction in patients with complete left bundle-branch block (CLBBB) and complete right bundle-branch block (CRBBB). Methods Twenty-eight CLBBB patients (including 15 with normal left ventricular systolic function [CLBBBa group] and 13 with left ventricular systolic dysfunction [CLBBBb group]), 29 CRBBB patients (including 16 with normal left ventricular systolic function [CRBBBa group] and 13 with left ventricular systolic dysfunction [CRBBBb group]), as well as 25 controls without cardiovascular diseases were enrolled and analyzed with speckle tracking imaging. Time to peak systolic radial strain, circumferential strain and time to peak systolic rotation angle at mitral valve level, papillary muscle level, apex cordis level were measured, respectively, and the the standard deviation of these parameters were calculated. Results Compared with control group, time to peak systolic strain of radial, circumferential strain and time to peak systolic rotation angle (except time to peak systolic circumferential strain at apex cordis level in CLBBBa group) increased in CLBBB patients (all P0. 05), and time to peak systolic radial strain increased in CRBBBb group (all P0. 05). Compared with CRBBBa and control group, the standard deviation of time to peak systolic radial strain, systolic circumferential strain and systolic rotation angle increased in CLBBB patients (all P0. 05), and the standard deviation of time to peak systolic radial strain increased in CRBBBb group (P0. 05). Conclusion There is significant systolic dyssynchrony in CLBBB patients, as well as in radial strain of CRBBB patients with …", "num_citations": "1\n", "authors": ["1065"]}
{"title": "Study on 500MHz SAW NH_3 Gas Sensor [J]\n", "abstract": " The fundamental theory and design method of surface acoustic wave (SAW) gas sensor were introduced in this paper. Rayleigh mode was the vibrating mode of this SAW device, with 500 MHz working frequency. The polyaniline was used as sensitive polymer and reference-differential output was used in electro circuit structure. The SAW NH3 gas sensor was fabricated by optimizing SAW chip, coating techniques of sensitive polymer, gas channels and signal processing circuit with high sensitivity, short adsorption and restoration time.", "num_citations": "1\n", "authors": ["1065"]}
{"title": "Fair Packet Scheduling for Downlink Multiuser OFDM Systems with Channel and Queue Information\n", "abstract": " In this paper, an channel and queue aware fair (CQAF) packet scheduling scheme is proposed for the downlink packet transmission in multiuser orthogonal frequency division multiplexing (OFDM) systems. By making use of the information on the channel conditions and the queue lengths, the proposed CQAF packet scheduling scheme efficiently allocates the subcarriers, transmission power and modulation level to users under the constraints of total transmission power, the number of subcarriers, bit-error-rate (BER) requirement and generalized processor sharing (GPS)-based fairness requirement. The numerical results show that the proposed CQAF packet scheduling scheme can reduce the transmission delay and queue length significantly while maximizing system throughput and maintaining fairness among users.", "num_citations": "1\n", "authors": ["1065"]}
{"title": "Selenium-enriched fermentation mycelia of Coprinus comatus enhance the antihyperglycemia and antioxidant activities in alloxan-induced diabetic mice.\n", "abstract": " This study evaluated the effect of selenium selenium Subject Category: Chemicals and Chemical Groups", "num_citations": "1\n", "authors": ["1065"]}
{"title": "Measuring 0 0 Design Metrics from UML\n", "abstract": " Design metrics are useful means for improving the quality of software. A number of object-oriented metrics have been suggested as being helpful for resource allocation in software development. These metrics are particularly useful for identifying fault-prone classes and for predicting required maintenance efforts, productivity, and rework efforts. To obtain the design metrics of the software under development, most existing approaches measure the metrics by parsing the source code of the software. Such approaches can only be performed in a late phase of software development, thus limiting the usefulness of the de-sign metrics in resource allocation. In this paper, we present a methodology that compiles UML specifications to obtain design information and to compute the design metrics at an early stage of software devel-opment. The current version of our tool uses diagrams produced by the Rational Rose tool and computes 00 metrics that have been suggested as being good indicators for identifying faults related to Object-Oriented features. Our technique advances the state of the metrics measuring process; thus it is expected to strongly promote the use of de-sign metrics and significantly increase their impact on improving software quality.", "num_citations": "1\n", "authors": ["1065"]}
{"title": "Cold-stress stimulates pregnancy-induced hypertension syndrome in pregnant rats\n", "abstract": " Objective To determine whether cold-stress stimulation could lead to pregnancy-induced hypertension syndrome (PIH) in rats. Methods Female adult Wistar female rats were randomly divided into 4 groups: non-pregnant control group (NN), non-pregnant cold-stress group (NC), pregnant control group (PN) and pregnant cold-stress group (PC). The rats were kept in (4±2)℃ for 4 h (cold-stress groups) every day or remained in 25℃(control groups) from the 1 st day to 19 th day of pregnancy. The blood pressure, urine protein, body weight, haematocrit (HCT), weight of placenta, length and weight of fetus were all measured. The histological change of the placenta and kidneys were also observed. Results After cold-stress stimulation for 2 weeks, the blood pressure, urine protein in NC and PC group increased significantly compared with that in control group, while the weight of placenta and fetus, the length of fetus in PC decreased significantly than that in PN. Obvious ischemic and anoxic histological changes in kidneys and all layers of placenta were found in PC group. Conclusion Repeated cold-stress stimulation can induce PIH in rats, thus provide a new non-invasive method to establish an animal model of PIH.", "num_citations": "1\n", "authors": ["1065"]}
{"title": "A kit for preparation of 188Re sulfide suspension\n", "abstract": " [en] The 188 Re sulfide suspension could be prepared quickly by a kit. The kit consists of three 10 mL vials. All the procedures were carried out in sterility circumstance. Vial A consisted of 1 mL KReO 4 and Na 2 S 2 O 3 (mole ratio 1: 70) solution with excipient. Vial B was 5 mol/L HCl solution. Vial C consisted of 1.5 mL PVP and NaOH solution (mole ratio 1000: 1). Vial B was sealed, Vial A and C were freeze-dried. Bacterium check, endotoxin check and security check were qualified. Kits were kept at ambient temperature and the Labelling efficiency of 188 Re sulfide suspension was more than 98% with 2 months. The particle sizes were 1-5 μm (60.1+-12.7)%; 5-10 μm (30.9+-8.1)%;> 10 μm (9.0+-4.7)%. The radiochemical purity of 188 Re sulfide suspension made by the kit was higher than 98% in 5 days with particle sizes 1-5 μm (49.9+-14.4%); 5-10 μm (41.1+-5.4)%;> 10μm (9.0+-3.3)%", "num_citations": "1\n", "authors": ["1065"]}
{"title": "The Structure of Chlorophyll-Protein Complexes of Algal PSI and the Characteristics of Their Long-Wavel ength Fluorescence\n", "abstract": " Studies on the structure of chlorophyll-protein complexes of algal PSI and the characteristics of their long-wavelength fluorescence are reviewed, and comparied with those of higher plants. The diversity of algal PSI forms a sharp contrast with the identity of PSI of higher plants, and has the characteristics of phylumla. Comparitive studies between the. PSI of algae and higher plants will contribute a better under standing to the structure, function and evolution of PSI.", "num_citations": "1\n", "authors": ["1065"]}
{"title": "SIMULTANEOUS DETERMINATION OF COPPER AND ZINC BY K _FACTOR DUAL_WAVELENGTH STANDARD ADDITION METHOD\n", "abstract": " A new method for the simultaneous spectrophotometric determination of copper and zinc is proposed. The method is based on the difference of absorption spectra of copper and zinc forming coloured complexes with 5_Br_PADAP in weak acidic medium and in the presence of nonionic surfactant OP. The absorbances of complex solution are measured at wavelength of 555 and 575 nm, respectively, and the data treated by the principle of K _factor dual_wavelength standard addition method. The recovery rate of both elements is found to be 95%~ 110% in the synthetic mixtures containing microamounts of copper and zinc with the concentration ratio from 1∶ 1 to 1∶ 20. The proposed method has been applied to the determination of copper and zinc in human hair with satisfactory results.", "num_citations": "1\n", "authors": ["1065"]}
{"title": "Structural Principle and Practice of PRE ISDN Novell Router Software\n", "abstract": " Compared with ISDN (integrated services digital networks), the PRE ISDN is cheaper when it is applied to the existed exchange equipment of the same data transmission quality. As the means of interconnection of LANs, PRE ISDN is of significant economic importance for China's current telecommunication. Some problems related to the design of a router needed for interconnection of Novell NetWare through PRE ISDN are discussed.", "num_citations": "1\n", "authors": ["1065"]}
{"title": "Site gains and its estimation method of a lightning location system\n", "abstract": " We discuss a new concept in lightning location system (LLS). Specitically,it is anoptimum method of lightning signal strength and a parameterization method of the site gaincurve estimation in LLS. Site gain correction curves for all DFs for 1989 were found byusing the data observed in an LLS of three direction finders (DFs) in Beijing region. Theresult shows that the curves, as a function of measured bearing, only include the one- andtwo-cycle sinusoidal components. It also indicates that the larger the site errors which DFhas, the larger the amplitude of the site gain curve. In this LLS, the ranges of site gainare 0.9--1.2, 0.85--1.05, 0.9--1.1 for DF1, DF2 and DF3 respectively. For discussion, we suggested a model for site gains due to dipole radiation. This modelcan be used to reasonably explain the characteristics of structure of site gain curves.", "num_citations": "1\n", "authors": ["1065"]}