{"title": "SQL Injection and Cross Site Scripting Prevention using OWASP ModSecurity Web Application Firewall\n", "abstract": " Web Application or website are widely used to provide functionality that allows companies to build and maintain relationships with their customers. The Information stored by web applications is often confidential and, if obtained by malicious attackers. Its exposure could result in substantial losses for both consumers and companies. SQL Injection and Cross Site Scripting are attacks that aiming web application database vulnerabilities. Its can allow malicious attackers to manipulate web server database that can cause various data lost, information thieving, and inconsistent of data. Therefore, this research propose the Open Web Application Security Project (OWASP) ModSecurity Core Rule Set which can help administrator securing the web servers. OWASP operate by blocking IP Address which try to breaking the security rule, monitoring network traffic and preventing suspicious network requesting from outside.", "num_citations": "10\n", "authors": ["1285"]}
{"title": "Ekstraksi Data pada Tabel dari Halaman Web Menggunakan Pohon Document Object Model\n", "abstract": " Data on the web page can be available in various formats, such as table. With the growing of web pages, the need to extract data from tables is increasing. Results of the extraction can be used for integration with other web tables or stored in a database. This study discusses the extraction of data from a table on a web page using a Document Object Model (DOM) tree. The initial step of this extraction process is to transform the HTML document into a DOM tree. Then, by applying search methods Depth First Search (DFS), part of the data in the table is extracted and stored in a CSV file. An engine has been developed using Visual Basic. The results show that the engine can automatically extract data from the table that has the following characteristics: the number of rows and columns are not limited, able to handle all of the table orientation layout, and able to handle tables that are merged cells.", "num_citations": "4\n", "authors": ["1285"]}
{"title": "Perbaikan Citra RGB dengan Metode Homomorphic Filtering Menggunakan Butterworth Filter\n", "abstract": " Gambar terkadang diakuisisi di bawah pencahayaan yang buruk. Pada kondisi ini sebagian area yang memiliki tingkat kecerahan yang sama akan terlihat lebih cerah pada suatu daerah dan terlihat lebih gelap pada daerah lainnya. Situasi ini akan menimbulkan masalah pada sistem yang berbasis computer vision. Untuk itu diperlukan sebuah perbaikan kualitas citra, agar dapat menghasilkan sebuah citra yang memiliki kualitas warna yang baik dengan menggunakan metode Homomorphic Filtering. Teknik ini menggunakan Illumination-Reflectance model. Model ini membagi gambar menjadi dua komponen utama. Komponen pertama adalah jumlah sumber penerangan yang terlihat. Komponen kedua adalah komponen pantulan dari objek yang ada di sekitar tempat pengambilan gambar. Proses pemisahan ini memungkinkan perbaikan warna pada citra digital dengan membuang detil illuminasi yang tidak seragam, sehingga citra hasil keluaran menjadi tampak lebih baik. Citra hasil perbaikan memiliki derau atau noise yang lebih sedikit daripada citra asli, dikarenakan filter yang digunakan mengeliminasi frekuensi tinggi, sedangkan noise disebabkan oleh frekuensi tinggi. Penelitian ini menunjukkan bahwa metode Homomorphic Filtering dapat memperbaiki citra dan mempengaruhi tingkat nilai kekaburan citra hasil sebesar 86% yaitu 0.25 dan nilai contrast sebesar 4% atau 1.14.", "num_citations": "3\n", "authors": ["1285"]}
{"title": "Aplikasi Diagnosa Penyakit Asma Menggunakan Bayesian Network Berbasis Web\n", "abstract": " Penyakit asma merupakan suatu penyakit kronis (menahun) yang menyerang saluran pernapasan pada paru dimana terdapat peradangan (inflamasi) dinding rongga bronchiale sehingga mengakibatkan penyempitan saluran napas yang akhirnya seseorang mengalami sesak napas. Penelitian bertujuan untuk membangun aplikasi menggunakan metode bayesian network yang berbasis web sebagai alat bantu untuk diagnosa penyakit asma. Dengan aplikasi ini, pasien tidak harus menunggu lama untuk mendapatkan perawatan oleh dokter, namun dapat menjadi alternative untuk mengantisipasi pengobatan secara cepat dan tepat. Cara menggunakan aplikasi ini yaitu admin menginputkan pertanyaan berupa gejala-gejala yang akan dijawab oleh user, selanjutnya sistem akan mengolah semua jawaban user menggunakan metode bayesian network dan sistem akan mengeluarkan output berupa hasil …", "num_citations": "3\n", "authors": ["1285"]}
{"title": "Perancangan dan implementasi pengukuran jarak dan tinggi objek berbasis kamera Pada perangkat mobile\n", "abstract": " Perkembangan perangkat mobile saat ini tidak hanya terbatas sebagai alat komunikasi, melainkan sudah dapat menjadi alat bantu bagi manusia dalam melakukan kegiatan sehari-hari, salah satunya adalah kamera dalam sebuah perangkat mobile. Penggunaan kamera pada perangkat mobile dapat lebih dimaksimalkan dengan membuat sebuah aplikasi yang dapat melakukan pengukuran jarak dan tinggi dari sebuah objek. Metode yang diterapkan pada pengukuran ini menggunakan konsep kesebangunan segitiga yang terbentuk dari proses pembentukan bayangan dengan menggunakan sinar-sinar istimewa pada lensa cembung yang ada di dalam sebuah kamera. Proses pengukuran dapat dilakukan dengan dua cara yaitu pengukuran dengan memasukkan data objek atau tanpa memasukkan data. Rata-rata galat terkecil dari hasil pengujian adalah 0, 0001404 yaitu untuk pengukuran dengan …", "num_citations": "3\n", "authors": ["1285"]}
{"title": "Implementasi teknologi papan informasi digital pada Masjid Al Bayan Kelurahan Limbungan Baru Kecamatan Rumbai Pesisir Kota Pekanbaru\n", "abstract": " Masjid Al Bayan sebagai pusat kegiatan keislaman dan masyarakat memiliki kendala belum adanya sarana dan prasarana untuk penyampaian informasi kepada masyarakat secara masif dan menarik. Hal ini terbukti ketika terjadi bencana kebakaran rumah warga respon masyarakat untuk penggalanagan dana bantuan sosial belum cepat. Pengumpulan bantuan dan pemberian bantuan ke korban rentang waktu satu minggu setelah terjadi bencana. Hal ini merupakan salah satu contoh kejadian sebagai sumber informasi yang perlu disampaikan kepada masyarakat dan jama’ah masjid Al Bayan. Sebagai tempat pusat kegiatan keislaman, sarana pendukung diperlukan untuk memberikan dampak yang lebih luas bagi masyarakat. Salah satunya dengan adanya teknologi papan informasi digital sebagai alat penyampai informasi yang lebih menarik dengan menampilkan infografis. Teknologi ini menggantikan peran papan pengumuman konvensional yang sangat terbatas menampilkan informasi dan kurang menarik. Teknologi ini mampu menampilkan informasi berupa teks, gambar digital (infografis) dan video. Jika terhubung ke jaringan internet, papan informasi digital ini juga mampu menampilkan video streaming dan halaman suatu website. Teknologi ini dilengkapi dengan minimum sistem berdaya rendah yang terhubung ke LED TV melalui port HDMI. Hasil dari penerapan alat Papan Informasi Digital mendapatkan hasil dari analisa survey usability yaitu nilai efisiensinya 93.5%, nilai efektifitasnya 91.6%, dan nilai kepuasannya 87.6% dengan rata-rata total nilai usability adalah 90.9% atau senilai 4.54 dalam skala 1-5. Selain …", "num_citations": "2\n", "authors": ["1285"]}
{"title": "Ekstraksi tabel HTML bentuk column-row wise ke dalam basis data\n", "abstract": " Tabel adalah bagian penting pada sebuah halaman web. Tabel memuat tabulasi data atau informasi yang ingin disampaikan dari halaman web tersebut. Tabulasi data ini dapat digunakan untuk kebutuhan perbandingan dengan tabel serupa atau sebagai pencetus untuk melakukan sebuah aksi. Namun, tabel pada halaman web bersifat independen terhadap pembuat halaman web. Tidak ada bentuk atau layout standar sebuah tabel pada halaman web. Salah satu layout tabel pada halaman web adalah column-row wise. Penelitian ini menawarkan pendekatan untuk mengekstraksi isi tabel sedemikian sehingga arti dari keterkaitan antara dua atribut dan data dalam tabel column-row wise tidak hilang. Data yang diekstrak disimpan ke dalam basis data yang membentuk tiga tabel, yaitu tabel yang menyimpan atribut pertama, tabel yang menyimpan atribut kedua, dan tabel yang menyimpan atribut pertama, kedua, dan data dari atribut pertama dan kedua. Penelitian ini menghasilkan sebuah algoritma untuk mengekstrak data dari tabel yang berbentuk column-row wise pada sebuah halaman web. Algoritma yang dihasilkan dari penelitian ini diharapkan dapat diimplementasikan dalam berbagai bahasa pemrograman. Untuk pengujian, algoritma telah diimplementasikan dengan Bahasa pemrograman Python dan berhasil melakukan ekstraksi tabel dan menyimpannya dalam basis data. Nilai cyclomatic complexity number algoritma yang diusulkan adalah 12. Hal ini berarti, kompleksitas algoritma yang diusulkan masih tinggi.", "num_citations": "2\n", "authors": ["1285"]}
{"title": "Implementasi Pembelajaran Alat Musik Tradisional (Talempong) dengan Pendeteksi Gerak\n", "abstract": " Pengenalan budaya dan alat musik musik tradisional dapat dilakukan dengan beberapa cara yaitu dengan membaca buku, petunjuk, atau dapat langsung mencoba langsung pada alat musiknya sendiri. Namun untuk dapat memainkan secara langsung, alat musik tradisional harganya relatif mahal. Salah satu dari alat musik tersebut adalah talempong yang berasal dari Provinsi Sumatera Barat. Hal tersebut berpengaruh kepada pelaksanaan kurikulum di lembaga pendidikan yang mempelajari alat musik tradisional, seperti yang terjadi pada SMA N 4 Payakumbuh. Sedangkan masyarakat terutama generasi muda terpengaruh oleh perkembangan zaman dan teknologi sehingga alat musik tradisional perlahan terlupakan. Dengan memanfaatkan teknologi yang ada, dibangun pembelajaran alat musik talempong dengan menggunakan kinect untuk membantu menjaga kelestarian budaya. Alat ini dapat …", "num_citations": "2\n", "authors": ["1285"]}
{"title": "Pewarnaan Graph Untuk Penyusunan Jadwal Kuliah Menggunakan Algoritma Recursive Lerge First (Studi Kasus: Politeknik Caltex Riau)\n", "abstract": " Penyusunan jadwal kuliah merupakan masalah yang umum dihadapi oleh kampus diseluruh dunia. Ada empat faktor yang mempengaruhi penyusunan jadwal kuliah yaitu faktor dosen, mahasiswa, ruangan, dan matakuliah. Proyek akhir ini menerapkan teknik pewarnaan graph dengan algoritma Recursive Large First sebagai solusi penyelesaian masalah penjadwalan kuliah. Masalah penjadwalan kuliah dimodelkan dengan graf dan diselesaikan dengan metode pewarnaan graf menggunakan algoritma Recursive Large First. Prasyarat solusi dalam penyusunan jadwal kuliah yang sifatnya harus dipenuhi yaitu dosen, matakuliah dan ruangan tidak boleh bentrok, kelas matakuliah yang membutuhkan ruangan khusus harus dijadwalkan pada ruangan yang tepat, seperti laboratorium. Aplikasi penyusunan jadwal kuliah di bangun menggunakan bahasa pemograman Java serta menggunakan basis data MySQL …", "num_citations": "2\n", "authors": ["1285"]}
{"title": "Smartposter Aplikasi Pemesanan Tiket Nonton Bioskop Berbasis Android\n", "abstract": " Seiring dengan berkembangnya teknologi, tidak jarang pada saat sekarang ini teknologi digunakan sebagai media bisnis untuk menunjang kemajuan suatu bisnis. SmartPoster merupakan sebuah sistem yang cerdas untuk melakukan dialog interaktif dengan pelanggan. Pada tugas akhir ini SmartPoster digunakan sebagai alat untuk melakukan pemesanan tiket nonton bioskop dengan nama aplikasi SmartCinema. Aplikasi ini dibuat untuk memudahkan konsumen melakukan pemesanan tiket nonton bioskop tanpa harus datang ke studio bioskop. Aplikasi ini bekerja dengan cara membaca kode QR (Quick Respons) yang diletakkan pada sebuah poster film bioskop dengan menggunakan smartphone android yang terkoneksi jaringan internet. Pada aplikasi ini pengguna dapat memilih waktu tayang film, studio dan tempat duduk. Konsumen yang telah melakukan pemesanan tiket nonton bioskop akan …", "num_citations": "2\n", "authors": ["1285"]}
{"title": "Performance of Discrete Wavelet Transform on CCTV Images Data Decomposition\n", "abstract": " In this paper presented the performance of discrete wavelet transforms (DWT) on movement image data in Closed Circuit Television (CCTV). Movement image on CCTV recordings is taken using background subtraction technique. Implementation of DWT on data is aimed to obtain a smaller amount of image data but not eliminating the characters of the original image characters. The application of discrete wavelet transforms is performed by filtering technique using impulse wavelet Daubechies order 4 (Db4). From the test conducted, on the first level decomposition, the data size reduction is 49.99% with the change in parameters average value of pixel is 1.19% and pixel pattern change 1.93%. In second level, the data size reduction is 24.99% with the change in parameters average value of pixel is 1.62% and pixel pattern change 2.46%. In Third level, the data size reduction is 12.48% with the change in parameters average value of pixel is 2.32% and pixel pattern change 3.84%. In fourth level, the data size reduction is 6.22% with the change in parameters average value of pixel is 2.31% and pixel pattern change 4.57% from the pattern of original image. From these results it can be concluded that wavelet transformation can be used to minimize the amount of image data without loss the characteristics of its original.", "num_citations": "1\n", "authors": ["1285"]}
{"title": "Rancang Bangun Sistem Tryout Ujian Nasional pada SMAIT Al-Ittihad Menggunakan Framework CodeIgniter\n", "abstract": " Tryout merupakan suatu kegiatan latihan soal yang mengacu pada soal-soal ujian nasional. Pada saat ini kegiatan tryout yang dilakukan pada SMAIT Al-Ittihad masih secara tertulis dengan menggunakan kertas dan melakukan pemeriksaan lembar jawaban siswa secara manual, sehingga membutuhkan waktu yang lama. Maka dari itu, telah dirancang sistem tryout ujian nasional berbasis website dengan menggunakan bahasa pemograman PHP dengan framework Codeigniter yang berfungsi agar program lebih terstruktur baik dari segi kode program ataupun file php dan database yang digunakan adalah MySQL. Setelah dirancangnya sistem tryout ujian nasional, maka sistem telah mampu menjawab masalah yang dapat membantu pihak sekolah dalam proses pemeriksaan nilai hasil tryout dibuktikan pada kuesioner Skala Likert dengan persentase sebesar 82, 6% oleh siswa dan 81, 4% oleh guru …", "num_citations": "1\n", "authors": ["1285"]}
{"title": "Ekstraksi Tabel HTML ke Database Management System dengan Pendekatan Service Oriented Architecture\n", "abstract": " Seiring dengan perkembangan berbagai bisnis proses, keberadaan data yang ada semakin berkembang dalam berbagai bentuk. Salah satu bentuk data adalah tabel di dalam sebuah halaman HTML. Berbeda dengan tabel pada database, tabel HTML memiliki struktur yang beragam. Nama atribut, pada tabel database selalu berada pada baris pertama. Sedangkan, pada tabel HTML, nama atribut dapat berada pada kolom pertama (row wise table) atau pada baris dan kolom pertama (column-row wise table). Sehingga, dalam proses ekstraksi, terlebih dahulu harus dikenali bagian pada tabel yang berperan sebagai nama kolom dan bagian tabel yang berperan sebagai data. Setelah diekstraksi, agar dapat digunakan untuk kebutuhan yang lebih lanjut, tabel HTML tersebut disimpan dalam sebuah database. Proses ini dilakukan dengan pendekatan Service Oriented Architecture sehingga ekstraksi dapat dilakukan secara otomatis. Penelitian ini mengembangkan sebuah model ekstraksi tabel HTML dengan pendekatan semantic tree dan memanfaatkan SOA dalam proses loading data ke database. Model yang dihasilkan berhasil mengekstrak tabel dari halaman web dengan 3 jenis bentuk layout, yaitu column wise, row wise, dan column-row wise dan menyimpannya dalam DBMS.", "num_citations": "1\n", "authors": ["1285"]}
{"title": "Aplikasi Pembelajaran Bangun Ruang Untuk Siswa SD Menggunakan Leap Motion\n", "abstract": " Materi bangun ruang merupakan salah satu materi dalam pelajaran matematika yang memuat prinsip hitungan dan hafalan rumus, sehingga memerlukan pemahaman yang berlebih. Untuk memudahkan dalam pemahaman materi, maka penyampaian materi dapat digabungkan dengan teknologi komputer, salah satunya menggunakan teknologi Leap Motion. Aplikasi pembelajaran bangun ruang dibuat menggunakan aplikasi Unity 3D dan untuk objek, kerangka dan jaring-jaring bangun ruang dibuat menggunakan aplikasi Blender. Aplikasi pembelajaran dapat dikontrol menggunakan gerakan tangan yang terdeteksi oleh perangkat Leap Motion. Berdasarkan pengujian menggunakan Paired Sample t-Test, diperoleh bahwa nilai t hitung (-3.27) lebih kecil dari pada nilai t tabel (2.02) yang berarti nilai rata-rata siswa sebelum menggunakan aplikasi lebih rendah dibandingkan dengan nilai setelah menggunakan …", "num_citations": "1\n", "authors": ["1285"]}
{"title": "Pengembangan Engine Integrasi Tabel HTML pada Halaman Web\n", "abstract": " Two problems are arisen while integrating number of tables from number of web pages, ie structural conflict and semantic conflict. To tackle those problems, the proposed study combines some existing methods that are already proven to solve problems in integrating process. The proposed integration process of HTML table consists of 4 phases:(1) locating the table in web pages,(2) separating attributes and data values,(3) integrating the table scheme,(4) migrating the data values into integrated scheme. Table location in web page is determined using heuristic approach. This approach also can separate the attributes and the data values of the table. Semantic conflict that is apparent while integrating the table scheme is handled using domain specific ontology. The resulted data value, then, is migrated to table scheme in line with duplication data checking using vector space model. Result of the integration is presented as single HTML table. This approach is implemented as an engine that is coded using Phyton language. Result of experiment shows that the proposed approach can be used to integrate number of HTML table from number of web pages into a single integrated table.", "num_citations": "1\n", "authors": ["1285"]}
{"title": "Integration of HTML tables in web pages\n", "abstract": " The growing number of Web pages on the Internet introduces a need to combine and integrate information from HTML tables of different Web pages that contain similar information into a single Web page, especially information from the same domain of interest. This paper presents an approach of HTML table integration by combining several existing methods that are proved to solve different issues in the integration processes. The integration of HTML table consists of three phases: (1) extraction of the structure of the tables; (2) integration of the tables' schema; (3) integration of the data values. To solve the conflicts in semantics and naming in the tables schema, domain-ontology is used. To improve quality of integration of data values in the tables, the vector space model is used to check the duplications of data values. As the integration result, a single HTML table is obtained. The approach is implemented on an …", "num_citations": "1\n", "authors": ["1285"]}
{"title": "Aplikasi Kontrol Slide Microsoft Office Powerpoint Dengan Suara Menggunakan Teknologi Windows Speech Recognition\n", "abstract": " Presentasi merupakan kegiatan pengajuan suatu topik, pendapat atau informasi kepada orang lain. Seiring dengan perkembangannya, presentasi menjadi aspek penting dalam beberapa bidang. Pada saat ini banyak media untuk presentasi, salah satunya software yang dikembangkan oleh Microsoft yaitu Microsoft Office PowerPoint yang mendukung sebuah presentasi menjadi lebih menarik. Dalam teknisnya, presentasi menggunakan Microsoft Office PowerPoint sangat membantu dalam menyampaikan materi presentasi. Untuk memudahkan seorang presenter dalam presentasi, speech recognition sebagai perangkat lunak yang berfungsi menerjemahkan perintah berupa suara sangat beperan dalam memberi perintah untuk menjalankan slide presentasi. Pada windows terdapat tools Windows speech recognition yang digunakan untuk memberi perintah pada laptop atau PC. Tetapi tools ini memiliki kendala …", "num_citations": "1\n", "authors": ["1285"]}
{"title": "Rancang dan Bangun Sistem informasi Penggajian Karyawan (Studi Kasus PT JNE)\n", "abstract": " Sejalan dengan perkembangan ilmu dan teknologi dewasa ini, semakin banyak perusahaan atau instansi dibidang jasa kurir bermunculan. Dengan masih adanya sistem penggajian karyawan masih menggunakan sistem manual terdapat banyak kesalahan yang terjadi, antara lain: membutuhkan banyak waktu dan tenaga bila kita membutuhkan dokumen, adanya data yang terselip karena kurang terjaminnya keamanan data. Dengan terjadinya masalah tersebut diatas, diperlukan sarana yang dapat meringankan tugas seorang accounting dan manager keuangan dalam menyelesaikan suatu masalah terutama masalah pengolahan data gaji karyawan. Sistem informasi penggajian karyawan ini dengan menggunakan bahasa java dalam merancang sistem informasinya dan postgre sql sebagai tempat penyimpanan data-data penggajian karyawan pada perusahaan tersebut. Sistem informasi ini dipergunakan …", "num_citations": "1\n", "authors": ["1285"]}