{"title": "A confidence-based framework for disambiguating geographic terms\n", "abstract": " We describe a purely confidence-based geographic term disambiguation system that crucially relies on the notion of “positive” and “negative” context and methods for combining confidence-based disambiguation with measures of relevance to a user’s query.", "num_citations": "210\n", "authors": ["1734"]}
{"title": "Partial metric spaces\n", "abstract": " As with many mathematical concepts these axioms are chosen to ensure that two things are equal if and only if some property expressible in terms of the concept holds. For a metric space, x= y if and only if d (x, y)= 0. Thus as there is the equality relation x= y in a metric space, so there is what we call an indistancy relation d (x, y)= 0. Axioms M1 and M2 work together to identify equality with indistancy. That is x and y are equal if and only if x and y have no distance between them. Such identification may seem to be so fundamental that to suggest otherwise would serve no purpose. However, there is a longstanding precedent for relaxing the axioms which ensure this identification. The relation defined by x≡ y if and only if d (x, y)= 0 is an equivalence, which can be useful, as in the construction of the classical lp-spaces. In this construction, spaces are considered in which axiom M2 is dropped while the others hold …", "num_citations": "203\n", "authors": ["1734"]}
{"title": "Partial metrics and co-continuous valuations\n", "abstract": " The existence of deep connections between partial metrics and valuations is well known in domain theory. However, the treatment of non-algebraic continuous Scott domains has been not quite satisfactory so far.             In this paper we return to the continuous normalized valuations Μ on the systems of open sets and introduce notions of co-continuity ({U                                i               , i ∃ I} is a filtered system of open sets ⟹ Μ(Int(∩                                i∃I                Ui)) = inf                 i∃I                Μ(Ui)) and strong non-degeneracy (U ⊂ V are open sets ⟹ Μ(U) < Μ(V)) for such valuations. We call the resulting class of valuations CC-valuations. The first central result of this paper is a construction of CC-valuations for Scott topologies on all continuous dcpo's with countable bases. This is a surprising result because neither co-continuous, nor strongly non-degenerate valuations are usually possible for ordinary Hausdorff …", "num_citations": "64\n", "authors": ["1734"]}
{"title": "Incorporation of reaction field effects into density functional calculations for molecules of arbitrary shape in solution\n", "abstract": " An attempt is made to combine continuum reaction field approaches with DFT ab initio calculations for quantitative evaluation of salvation effects in chemical processes. The formalism of the combined method is delineated along with its possibilities and limitations, and applied to several small model systems. It is found that DFT can provide dipole moments in vacuum and in solution (e.g., for water) with accuracies (0.1 D) that have not been reported with other methods. The results obtained suggest that agreement within$˜1 kcal/mole can be expected between calculated and experimental hydration enthalpies of polar unchanged solutes. The results for ions are not as consistent as for dipolar molecules, suggesting that accurate multipole representations of the electron density of solutes may be required especially for ionic solutes.", "num_citations": "53\n", "authors": ["1734"]}
{"title": "A view of thermodynamics of hydration emerging from continuum studies\n", "abstract": " Main physical-chemical features of hydration found in continuum studies and possible limitations of the method are analyzed. Particular attention is given to: the choice of thermodynamic observables to be compared to the calculations; representations of the solute polarizability; compensation between the loss of hydration enthalpy and gain in Coulomb interactions upon a complex formation; two minima in interaction potentials between polar groups in solution; similarities and dissimilarities between interaction potentials in solution from continuum and molecular theories; continuum calculations of entropies of hydration; and evaluation of a temperature dependence of thermodynamic characteristics of hydration with continuum methods.", "num_citations": "49\n", "authors": ["1734"]}
{"title": "Towards computing distances between programs via Scott domains\n", "abstract": " This paper introduces an approach to defining and computing distances between programs via continuous generalized distance functions ρ: A×A→D, where A and D are directed complete partial orders with the induced Scott topology, A is a semantic domain, and D is a domain representing distances (usually, some version of interval numbers). A continuous distance function ρ can define a T o topology on a nontrivial domain A only if the axiom ∃0 ε D.∀x ε A.ρ(x,x)=0 does not hold. Hence, the notion of relaxed metric is introduced for domains — the axiom ρ(x,x)=0 is eliminated, but the axiom ρ(x,y)=ρ(y,x) and a version of the triangle inequality tailored for the domain D remain.             The paper constructs continuous relaxed metrics yielding the Scott topology for all continuous Scott domains with countable bases. This construction is closely related to partial metrics of Matthews and valuation spaces of O'Neill …", "num_citations": "42\n", "authors": ["1734"]}
{"title": "Continuum based calculations of hydration entropies and the hydrophobic effect\n", "abstract": " A mean-field approach based on continuum electrostatics is applied to the evaluation of entropies of hydration of inert gases. Calculated hydration entropies agree well with the corresponding experimental values at room temperature for all inert gases. TAS calculated with polarizabilities of inert gases andwater taken into account agree with experimental values within 1 kcal/mol. The agreement is~ 0.4 kcal/mol worse if the polarizabilities are neglected. An interpretation of the nature of the hydration entropy of nonpolarsolutes following from our results and a possible role of the approximations involved in the calculations are discussed.", "num_citations": "42\n", "authors": ["1734"]}
{"title": "Magnitude of hydration entropies of nonpolar and polar molecules\n", "abstract": " A mean field model based on continuum representation of bulkwater is applied to the calculation of hydration entropies of nonpolar and polar spheres. Polar spheres were assigned charges of±0.5 e and±le. It is found that above the radius of~ 3 Á hydration entropies of nonpolar and polar spheres of similar size are identical within the accuracy of our computations. Hydration entropies are similar for nonpolar and half-charged spheres of all radii. It is found that the mean field model exhibits a gaslike behavior. If entropy calculations are performed at constant pressure, the hydration entropy perA2 of solute’s accessible area does not exhibit a size dependence and stays around 30 cal/A2. In calculations at constant volume, corresponding compression entropy terms are added to the constant-pressure results, leading to a strong size dependence. A comparison of the results to scaled particle theory suggests that the size …", "num_citations": "31\n", "authors": ["1734"]}
{"title": "Some corollaries of the correspondence between partial metrics and multivalued equalities\n", "abstract": " Multivalued equalities originally arose in the context of the theory of sheaves, while partial metrics originally arose in the context of the theory of domains for denotational semantics. It turns out that multivalued equalities and partial metrics are closely related: one can either consider them equivalent up to the choice of dual notation, or one can formally capture the duality between logical and metric viewpoints by explicitly requiring logical values and distances to be represented by dual structures. Not only does this allow the transfer of the ideas and results between these two fields, but the most interesting situations are those of interplay between logical and metric considerations. The computational understanding of partial metrics as upper bounds and of multivalued equalities as lower bounds is discussed, together with the lower bound counterparts to partial metrics and the corresponding upper bound counterparts …", "num_citations": "18\n", "authors": ["1734"]}
{"title": "Calculations of hydration entropies of alkali and halide ions based on the continuum approach\n", "abstract": " To understand the thermodynamics of hydration of any molecules from monoatomics to proteins, one should be able to calculate the thermodynamic characteristics of the process with some self-consistent theoretical method. Limiting such calculations even to a quantity as important as free energy1 may be insufficient. An ability to calculate enthalpy, 2entropy, 3 and even heat capacity4· 5 may be equally important. Many solution processes are governedby small differences of hydration con-tributions, and we do not know ahead which thermodynamic characteristic of the hydration will dominate this small difference. During the last six years we have been developing a method for calculation of the thermodynamics of hydration based on the continuum representation of the bulk water solvent. 6-8 We have demonstrated that the continuum approach leads to accurate predictions of hydration enthalpies of ionic and polar …", "num_citations": "12\n", "authors": ["1734"]}
{"title": "Mathematics of domains\n", "abstract": " Two groups of naturally arising questions in the mathematical theory of domains for denotational semantics are addressed. Domains are equipped with Scott topology and represent data types. Scott continuous functions represent computable functions and form the most popular continuous model of computations.", "num_citations": "11\n", "authors": ["1734"]}
{"title": "Linear models of computation and program learning\n", "abstract": " We consider two classes of computations which admit taking linear combinations of execution runs: probabilistic sampling and generalized animation. We argue that the task of program learning should be more tractable for these architectures than for conventional deterministic programs. We look at the recent advances in the \"sampling the samplers\" paradigm in higher-order probabilistic programming. We also discuss connections between partial inconsistency, non-monotonic inference, and vector semantics.", "num_citations": "6\n", "authors": ["1734"]}
{"title": "Dataflow matrix machines as programmable, dynamically expandable, self-referential generalized recurrent neural networks\n", "abstract": " Dataflow matrix machines are a powerful generalization of recurrent neural networks. They work with multiple types of linear streams and multiple types of neurons, including higher-order neurons which dynamically update the matrix describing weights and topology of the network in question while the network is running. It seems that the power of dataflow matrix machines is sufficient for them to be a convenient general purpose programming platform. This paper explores a number of useful programming idioms and constructions arising in this context.", "num_citations": "5\n", "authors": ["1734"]}
{"title": "Continuous Functions as Models for Programs: Mathematics and Applications\n", "abstract": " We present evidence of continuous nature of many computational processes. We argue that, therefore, powerful techniques of continuous mathematics should be applicable in the studies of computational processes and, moreover, in the design of tools for software engineers. We see the potential for both theoretical and applied advances along these lines, and we would like to incorporate both into our Thesis. Ideally theoretical advances should lead at once to the new applications, however, given the state of the art it does not seem feasible. Therefore we opt for the research program consisting of two parts. Part 1 consists of advancing the mathematics of topological models of computation. It does take potential applications into account, but we do not expect to incorporate any such applications in this Thesis. The internal mathematical motivations will mostly guide the theoretical part. Part 2 consists of applying the existing body of knowledge to software engineering, and, in particular, to the design and implementation of programming languages. We have found that paradigms employed in the design of most modern\" academic\" programming languages seem to be incompatible with mathematical models of computations we prefer. Therefore, we will perform experimental explorations in the design and implementation of programming languages. We will take into account both their conformity to the desired mathematical properties and potential practical usability. We will restrict ourselves to small prototypes of the real systems, so we do not expect to incorporate any\" commercially usable\" systems in this Thesis.", "num_citations": "5\n", "authors": ["1734"]}
{"title": "Almost Continuous Transformations of Software and Higher-order Dataflow Programming\n", "abstract": " We consider two classes of stream-based computations which admit taking linear combinations of execution runs: probabilistic sampling and generalized animation. The dataflow architecture is a natural platform for programming with streams. The presence of linear combinations allows us to introduce the notion of almost continuous transformation of dataflow graphs. We introduce a new approach to higher-order dataflow programming: a dynamic dataflow program is a stream of dataflow graphs evolving by almost continuous transformations. A dynamic dataflow program would typically run while it evolves. We introduce Fluid, an experimental open source system for programming with dataflow graphs and almost continuous transformations.", "num_citations": "4\n", "authors": ["1734"]}
{"title": "Partial inconsistency landscape: an overview\n", "abstract": " Partial inconsistency landscape: an overview Page 1 Introduction Bilattices and Hahn-Jordan decomposition Signed measures and vector semantics Partial inconsistency landscape: an overview Michael Bukatin Nokia Corporation, Cambridge, MA Joint work with Ralph Kopperman and Steve Matthews --- 28th Summer Conference on Topology and its Applications, Special Session on Asymmetric Topology, July 24, 2013 1 / 48 Page 2 Introduction Bilattices and Hahn-Jordan decomposition Signed measures and vector semantics Electronic coordinates These slides are linked from my new page on partial inconsistency and vector semantics of programming languages: http://www.cs.brandeis.edu/∼bukatin/partial inconsistency.html E-mail: bukatin@cs.brandeis.edu 2 / 48 Page 3 Introduction Bilattices and Hahn-Jordan decomposition Signed measures and vector semantics To memory of Bella Abramovna …", "num_citations": "3\n", "authors": ["1734"]}
{"title": "Michael A. Bukatin PUBLICATIONS\n", "abstract": " Michael A. Bukatin PUBLICATIONS Papers in mathematics and computer science: Michael Bukatin. Higher-order neuromorphic computati Page 1 Michael A. Bukatin PUBLICATIONS Papers in mathematics and computer science: Michael Bukatin. Higher-order neuromorphic computations with linear streams (extended abstract). In: Online program of CCC 2020: Continuity, Computability, Constructivity – From Logic to Algorithms, September 2020. ccc-2020:paper-6 Michael Bukatin and Jon Anthony. Dataflow Matrix Machines and V-values: a Bridge between Programs and Neural Nets. In Beáta Gyuris, Katalin Mády, and Gábor Recski, editors, K + K = 120: Papers dedicated to László Kálmán and András Kornai on the occasion of their 60th birthdays, Research Institute for Linguistics, Hungarian Academy of Sciences, 2017 (online), 2019 (paperback, pp.153-185). arXiv:1712.07447 Leonid Perlov and Michael Bukatin. …", "num_citations": "3\n", "authors": ["1734"]}
{"title": "An intelligent theory of cost for partial metric spaces\n", "abstract": " Partial metric spaces generalise metric spaces, allowing non zero self distance. This is needed to model computable partial information, but falls short in an important respect. The present cost of computing information, such as processor time or memory used, is rarely expressible in domain theory, but contemporary theories of algorithms incorporate precise control over cost of computing resources. Complexity theory in Computer Science has dramatically advanced through an intelligent understanding of algorithms over discrete totally defined data structures such as directed graphs, without using partially defined information. So we have an unfortunate longstanding separation of partial metric spaces for modelling partially defined computable information from the complexity theory of algorithms for costing totally defined computable information. To bridge that separation we seek an intelligent theory of cost for …", "num_citations": "2\n", "authors": ["1734"]}
{"title": "Logic of fixed points and Scott topology\n", "abstract": " Domains with Scott topologies are frequently defined as sets of fixed points of retractions or, more generally, arbitrary Scott continuous transformations of domains. For the case of retractions, the logical approach to this technique was developed by Hoofman under the name of continuous information systems. We present this approach for general Scott continuous transformations, together with its underlying intuition, a number of applications to closure operations and finitary retractions in the algebraic case, and a spectrum of outstanding open problems.", "num_citations": "2\n", "authors": ["1734"]}
{"title": "On a Smyth conjecture\n", "abstract": " The set Ix= fy 2 Ajfx; yg is unboundedg is an observable continuous representation of negative information about x 2 A for a weakly Hausdor continuous dcpo A with the Scott topology. When A is not weakly Hausdor the largest continuous approximation of Ix is represented by Jx= fy 2 Ajx 2 Int (Iy) g, and the largest observable continuous representation of Ix is represented by J0 x= Int (Jx). Mike Smyth conjectured, that J or J0 is closely related to the least symmetric closed tolerance on A. In this paper we establish that, indeed, fhx; yijy 2 J0 xg is the complement of this tolerance. We also establish a relationship between this tolerance and lower bounds of relaxed metrics on A.", "num_citations": "2\n", "authors": ["1734"]}
{"title": "Partial Metrics and Co-continuous Valuations (Extended Version)\n", "abstract": " The existence of deep connections between partial metrics and valuations is well known in domain theory. However, the treatment of non-algebraic continuous Scott domains have been not quite satisfactory so far. In this paper we return to the continuous normalized valuations on the systems of open sets and introduce notions of co-continuity (fUi; i 2 Ig| ltered system of sets)(Int (", "num_citations": "2\n", "authors": ["1734"]}
{"title": "Dataflow Matrix Machines as a Model of Computations with Linear Streams\n", "abstract": " We overview dataflow matrix machines as a Turing complete generalization of recurrent neural networks and as a programming platform. We describe vector space of finite prefix trees with numerical leaves which allows us to combine expressive power of dataflow matrix machines with simplicity of traditional recurrent neural networks.", "num_citations": "1\n", "authors": ["1734"]}
{"title": "Dataflow Graphs as Matrices and Programming with Higher-order Matrix Elements\n", "abstract": " We consider dataflow architecture for two classes of computations which admit taking linear combinations of execution runs: probabilistic sampling and generalized animation. We improve the earlier technique of almost continuous program transformations by adopting a discipline of bipartite graphs linking nodes obtained via general transformations and nodes obtained via linear transformations which makes it possible to develop and evolve dataflow programs over these classes of computations by continuous program transformations. The use of bipartite graphs allows us to represent the dataflow programs from this class as matrices of real numbers and evolve and modify programs by continuous change of these numbers. We develop a formalism for higher-order dataflow programming for this class of dataflow graphs based on the higher-order matrix elements. Some of our software experiments are briefly discussed.", "num_citations": "1\n", "authors": ["1734"]}
{"title": "Relaxed Metrics, Maximal Points, and Negative Information\n", "abstract": " In our earlier paper, we presented a method of obtaining partial and relaxed metrics from co-continuous and bi-continuous valuations for any continuous Scott domain A via formalism of Info-structures. Certain pathologies in the behavior of Ix= fy 2 Ajfx; yg is unboundedg precluded us from extending this method beyond bounded complete domains. In this paper, we obtain meaningful Scott continuous relaxed metrics for continuous dcpo's by replacing Ix with Neginfo (x)= Int (Jx), where Jx= fy 2 Ajx 2 Int (Iy) g. This result can be understood in terms of interplay between negation duality and Stone duality. This technique works especially well, when a continuous dcpo A satis es the Lawson condition| the relative Scott and Lawson topologies on Total (A) are equal. We obtain that the Lawson condition is equivalent to the property 8x 2 Total (A): Ix= Jx. This implies that when the Lawson condition holds, an induced metric on Total (A) results.", "num_citations": "1\n", "authors": ["1734"]}
{"title": "Information Systems and Retractions: an Elementary Treatment\n", "abstract": " We show that information systems allow to treat retractions of domains for denotational semantics in more simple and intuitive ways. We consider both algebraic and continuous cases. The basic intuition is that an approximable mapping r describing a retraction jrj should be treated as a candidate to become the entailment relationin the information system to describe Fix (jrj) as a domain.In the algebraic case this means that closure operations are the best since only they possess the re exivity property: 8u 2 Con: uru. For all other retractions we have to exclude assertions that become non-re exive, which means that we are generally unable to describe their sets of xed points by information systems. Yet the situation can be somewhat salvaged if r performes all its entailments via re exive elements. Formally, we can write it as 8u; w 2 Con: urw) 9v 2 Con: urv; vrv; vrw. v here is an element retaining re exivity. This formula is the necessary and su cient condition for the retraction jrj to be nitary, because we can use elements retaining re exivity as a backbone to build an information system that would describe a domain isomorphic to Fix (jrj) as an algebraic cpo. Since we still have to exclude non-re exive elements, this isomorphism cannot be re ned to equality. This criterion of nitarity can be rewritten as 8u; w 2Con: urw)", "num_citations": "1\n", "authors": ["1734"]}
{"title": "Subdomains for Algebraic Information Systems\n", "abstract": " In 1976 Dana Scott suggested using retractions to describe subdomains, the use of closure operations being suggested in the algebraic case Scott 76]. Both choices were only marginally understood at that time. The present paper shows that the use of information systems (see Scott 82]) naturally leads to closure operations in the algebraic case. Speci cally, subdomains are formed due to the fact that some elements lose consistency or deductive closure and thus, are excluded from an original domain, jAj. The inconsistency in jAj is treated as the entailment of the contradiction in jA> j= jAj f> g. Thus, the subdomains of jAj correspond to the intensi cations of the entailment relation in jA> j. These intensi cations are approximable mappings and the corresponding continuous functions are precisely the closure operations on jA> j (x:> is excluded). A closure operation jrj: jA> j! jA> j yields the subdomain jRj jAj, jRj= Fix (jrj) n f> g.The domain of all subdomains, jSub (A) j, is constructed for every domain jAj. jSub (A) j is a subdomain of jA>! A> j, and its elements are approximable mappings representing subdomains of jAj. The fundamental property of jSub (A) j is that r vSub (A) si jRj jSj for the subdomains jRj and jSj corresponding to r and s. The following related matters are also discussed: the idea of data types as objects, the projection of jSub (A) j onto jAj and the equations such as jXj= jSub (X) j, the nitary projections and why their xed points do not form subdomains, and the somewhat adverse relationship between retraction-based subtypes and intensional type theories.", "num_citations": "1\n", "authors": ["1734"]}