{"title": "What is metacognition?\n", "abstract": " THE DISCOVERY and theoretical elaboration of metacognition constitute a major breakthrough in recent decades of cognitive research. While it is al-ways best to begin with definitions, a concept as complex as metacognition demands that our initial definition be provisional. This definition will be-come more detailed and complete as our understanding grows. Many teachers would describe metacognition, quite acceptably, as “thinking about thinking.” But I would propose a more precise definition: metacognition is the monitoring and control of thought. In this article, I seek to clarify the concept of metacognition and to present ideas about how metacognitive ability can be taught.Metacognition serves many diverse functions, as does language. Consider what the Austrian philosopher Ludwig Wittgenstein had to say about language:“Think of the tools in a tool-box: There is a hammer, pliers, a saw, a screw-driver, a rule …", "num_citations": "690\n", "authors": ["1046"]}
{"title": "Cognition and the question of test item format\n", "abstract": " The effects of testing on cognition bear not only on the meaning of what is measured, but also its consequences. Test item formats vary in their typical cognitive demand and in the range of cognitions they sample. Multiple-choice items, in particular, often elicit low-level cognitive processing whereas constructed-response items more often evoke complex thinking. However, the typical cognitions elicited by differing response formats are less a reflection of the limitations of those formats than they are of typical use. Even when research demonstrates that item response formats vary in cognitive features, psychometric characteristics, and costs of administration and scoring, policy implications remain ambiguous because of tradeoffs along these dimensions. No one format is appropriate for all purposes and on all occasions. This article presents the state of the cumulative research bearing on the differential cognitive …", "num_citations": "312\n", "authors": ["1046"]}
{"title": "Computer competence: The first national assessment.\n", "abstract": " This report contains the results of a national survey conducted by the National Assessment of Educational Progress (NAEP) during the 1985-86 school year. The report, which attempts to capture the interacting forces influencing computer competence among students, is presented in six chapters:(1) Overview (major findings, significance of this assessment, and importance of computer competence);(2) Assessing Computer Competence (ie, knowledge of computer technology, computer applications, and computer programming);(3) Attitudes, Instruction, and Access (student attitudes toward computers, experience with computers, computer use in the school, and computer use outside the school);(4) Computer Competence among Subgroups (eg, gender, race/ethnicity, parental education, public/non-public education, and community and religion);(5) Computer Coordinators (their characteristics, teaching activities, professional experience and training, and professional confidence); and (6) Implications. The major findings of this survey indicate that access to a computer at home is positively related to computer competence; students like using computers; computers are seldom used in subject areas such as reading, math, or science; males demonstrate more competence than females; racial differences exist, favoring white students over black students; computer competence is increased for students whose parents went to college, who attend non-public schools, and who live in the northeast; and many computer coordinators have minimal training in computer studies. Sample survey questions are provided in each area and the results are reported J …", "num_citations": "195\n", "authors": ["1046"]}
{"title": "Learning and cognition: The design of the mind\n", "abstract": " At times, the horizons of the human intellect seem to stretch on forever. We need all the powers of the human mind if we are to defeat the vicious problems that con-front humanity, and to nurture creativity and discovery in the arts, engineering, science, and medicine. Every compelling vision of the future requires capable minds that work together to achieve positive ends. Fortunately, human cultures have devised programs to promote the mind’s rational and creative abilities. Those programs collectively are called education, but their manifestations are diverse. Education can take the form of direct personal apprenticeship as practiced from prehistoric times to the present, the dialogic search for fundamental truth that characterized ancient Athens, or the formal curricula that are the mainstays of schools and universities today. But to recognize diverse forms of education is not to say that they are adequate for the future. Educators and the broader public fully recognize that education must be more effective now than ever before. Today’s citizens must be smarter, more knowl-edgeable, and more creative than previous generations. What will it take to accomplish this? How can education become more effective so that current and future learners will be far more capable than those of the past? A key answer, I believe, is that we need a far greater understanding of the nature and operation of the human mind. After all, if edu-cation is intended to develop the mind’s capability, then only through a deep understanding of the mind can we chart an optimal course for its development. For more than a century now, scholars from diverse disciplines have tried to …", "num_citations": "189\n", "authors": ["1046"]}
{"title": "What is problem solving?\n", "abstract": " E VERY educator is familiar with the term\" problem solving,\" and most would agree that the abili ty to solve problems is a worthy goal of education. But what is problem solving? Its meaning is actually quite straightforward: problem solving is the process of moving toward a goal when the path to that goal is uncertain. We solve problems every time we achieve something without having known beforehand how to do so. We encounter simple problems every day: finding lost keys, deciding what to do when our car won't start, even impro vising a meal from leftovers. But there are also larger and more significant\" ill-de fined\" problems, such as getting an edu cation, becoming a successful person, and finding happiness. Indeed, the most im portant kinds of human activities involve accomplishing goals without a script.", "num_citations": "181\n", "authors": ["1046"]}
{"title": "Computerized figural response testing system and method\n", "abstract": " A method and system for interactive test taking is provided, having a computer with memory, an image display screen, and a pointing device such as a mouse for examinee manipulation of symbols or objects on the screen. Starting figural material is presented on the screen along with a problem statement requiring responses relative to the starting figural material. The examinee inputs response data through the mouse, manipulating and/or generating symbols on the screen in relation to the starting figural material. Scoring of the examinee's responses is done on-line or after completion of all tasks, and may include an evaluation of the sequence of examinee responses to respective items, as well as an evaluation of the duration of the examinee's response or any component of such response to an item.", "num_citations": "149\n", "authors": ["1046"]}
{"title": "Education as the cultivation of intelligence\n", "abstract": " Martinez defines intelligence from a cognitive perspective as a repertoire of those skills, strategies, and knowledge structures that are most instrumental in human effectiveness. He posits that in today's complex, fast-paced, technologically dense, and information-rich society, intelligence is the supreme human resource. The current social context not only demands intelligence, but rewards it economically, psychically, and in other ways. His central argument in this book is this: The intellectual abilities that are crucial to modern life, including economic viability and effectiveness in daily living, correspond to the cognitive functions that are reasonably called intelligence; these intellectual abilities are learnable; we now know enough about the structure and mechanisms of intelligent thought and behavior to teach them directly. Martinez explicates his argument and provides research-based evidence to support his claim.", "num_citations": "140\n", "authors": ["1046"]}
{"title": "Increased cerebrospinal fluid Fas (Apo-1) levels in Alzheimer’s disease: relationship with IL-6 concentrations\n", "abstract": " Increasing lines of evidence suggest a role of apoptosis in the neurodegeneration associated with Alzheimer’s disease, in which it has been implicated in increasing the expression of p53 and Fas. On the other hand, inflammatory cytokines have also been implicated as important factors in the progression of neuronal damage in this disease. In an attempt to investigate the possible in vivo relationship between programmed cell death and the inflammatory response in patients with dementia of the Alzheimer type (DAT), we measured the levels of soluble Fas, interleukin-1β (IL-lβ) and IL-6 in cerebrospinal fluid (CSF) from ten DAT patients and ten age-matched controls. Our results show a significant increase in IL-6 and soluble Fas concentrations in the CSF of DAT patients compared with those from nondemented controls. Moreover, linear regression analysis demonstrated a significant correlation (r=0.703; P<0.05 …", "num_citations": "100\n", "authors": ["1046"]}
{"title": "Machine-interpretable figural response testing\n", "abstract": " This invention provides automatic testing systems and methods for testing for figural responses to a test inquiry. The testing system includes a test sheet of predetermined dimensions having a grid with a plurality of marking areas arranged in predetermined position and a figural arrangement having a first optical reflectivity arranged within the grid corresponding to one or more of the marking areas. The system includes indicia of a second optical reflectivity overmarking a selected number of the marking areas associated with the figural arrangement and optical scanning means having different optical sensitivities to the first and second optical reflectivities for scanning the sheet to determine the positions of the overmarked areas. The method of testing of this invention includes storing the position of at least one of the marking areas corresponding to a specified figural response to the test inquiry and instructing the test …", "num_citations": "99\n", "authors": ["1046"]}
{"title": "Chemical evolution and volcanic activity of the active crater lake of Poás volcano, Costa Rica, 1993–1997\n", "abstract": " Concentrations of chloride and sulfate and pH in the hot crater lake (Laguna Caliente) at Poás volcano and in acid rain varied over the period 1993–1997. These parameters are related to changes in lake volume and temperature, and changes in summit seismicity and fumarole activity beneath the active crater. During this period, lake level increased from near zero to its highest level since 1953, lake temperature declined from a maximum value of 70°C to a minimum value of 25°C, and pH of the lake water increased from near zero to 1.8. In May 1993 when the lake was nearly dry, chloride and sulfate concentrations in the lake water reached 85,400 and 91,000 mg l−1, respectively. Minimum concentrations of chloride and sulfate after the lake refilled to its maximum volume were 2630 and 4060 mg l−1, respectively. Between January 1993 and May 1995, most fumarolic activity was focused through the bottom of the …", "num_citations": "97\n", "authors": ["1046"]}
{"title": "Mapping of the human visual cortex using image-guided transcranial magnetic stimulation\n", "abstract": " We describe a protocol using transcranial magnetic stimulation (TMS) to systematically map the visual sensations induced by focal and non-invasive stimulation of the human occipital cortex. TMS is applied with a figure of eight coil to 28 positions arranged in a 2×2-cm grid over the occipital area. A digitizing tablet connected to a PC computer running customized software, and audio and video recording are used for detailed and accurate data collection and analysis of evoked phosphenes. A frameless image-guided neuronavigational device is used to describe the position of the actual sites of the stimulation coils relative to the cortical surface. Our results show that TMS is able to elicit phosphenes in almost all sighted subjects and in a proportion of blind subjects. Evoked phosphenes are topographically organized. Despite minor inter-individual variations, the mapping results are reproducible and show good …", "num_citations": "96\n", "authors": ["1046"]}
{"title": "N-Acetylcysteine delays age-associated memory impairment in mice: role in synaptic mitochondria\n", "abstract": " Mitochondrial oxidative damage is implicated in brain aging and in age-related neurodegenerative diseases. Since N-acetylcysteine (NAC) has recently been shown to prevent apoptotic death in neuronal cells and protect synaptic mitochondria proteins from oxidative damage in aged mice, we have investigated whether dietary administration of this thiolic antioxidant retards age-related memory loss. At 48 weeks of age, a control female OF-1 mice group was fed standard food pellets and another group received pellets containing 0.3% (w/w) of NAC. After 23 weeks of this diet, the NAC had partially restored the memory deficit associated with aging in mice. Moreover, the lipid peroxide and protein carbonyl contents of the synaptic mitochondria were significantly decreased in the NAC-supplemented animals in comparison with their age-matched controls. The antioxidant properties and probable action on …", "num_citations": "90\n", "authors": ["1046"]}
{"title": "A comparison of multiple‐choice and constructed figural response items\n", "abstract": " In contrast to multiple‐choice test questions, figural response items call for constructed responses and rely upon figural material, such as illustrations and graphs, as the response medium. Figural response questions in various science domains were created and administered to a sample of 4th‐, 8th‐, and 12th‐grade students. Item and test statistics from parallel sets of figural response and multiple‐choice questions were compared. Figural response items were generally more difficult, especially for questions that were difficult (p < .5) in their constructed‐response forms. Figural response questions were also slightly more discriminating and reliable than their multiple‐choice counterparts, but they had higher omit rates. This article addresses the relevance of guessing to figural response items and the diagnostic value of the item type. Plans for future research on figural response items are discussed.", "num_citations": "82\n", "authors": ["1046"]}
{"title": "Evaluation of CHROMagar Candida medium for the isolation and presumptive identification of species of Candida of clinical importance\n", "abstract": " CHROMagar candida is a new differential culture medium that allows the isolation and presumptive identification of species of yeast of clinical importance. We tested 618 strains of yeast, including 128 direct isolates from clinical specimens. After two days of incubation at 37°C, 339 of 341 Candida albicans, 98 of 99 Candida glabrata, all the Candida tropicalis, and all the Candida krusei were identified correctly. The sensitivity and specificity in these cases were both superior to 99%. Easy to prepare, with low cost, CHROMagar Candida proves to be a useful medium for the identification of species of yeast that are isolated with greater frequency in clinical material and for the identification of mixed cultures.", "num_citations": "81\n", "authors": ["1046"]}
{"title": "Assessment for Learning.\n", "abstract": " Describes the essential elements of a new generation of tests, shows how they might promote learning, and indicates what it will take to create them. Mastery systems envisioned by the Educational Testing Service will provide immediate, elaborate feedback; express learning progress via mapping; and present\" real world\" test questions. Includes seven references.(MLH)", "num_citations": "81\n", "authors": ["1046"]}
{"title": "Increased cerebrospinal fluid cAMP levels in Alzheimer's disease\n", "abstract": " Since increasing evidence suggests that upregulation of the cAMP-second messenger system may be implicated in Alzheimer's disease neurodegeneration, we have compared the cAMP and cGMP levels in cerebrospinal fluid (CSF) from patients with dementia of the Alzheimer type (DAT, n=10) with those from nondemented age-matched controls (n=10). Our results show that cAMP levels, but not cGMP, are significantly (p<0.01) elevated in CSF from patients with DAT compared to those from nondemented controls. Moreover, a linear regression analysis demonstrated a significant correlation (r=0.62; p<0.01) between cAMP and tau protein levels in CSF when controls and patients with DAT were studied together. These results suggest that upregulation of cAMP-signaling pathway is implicated in Alzheimer's disease physiopathology.", "num_citations": "75\n", "authors": ["1046"]}
{"title": "Interest enhancements to science experiments: Interactions with student gender\n", "abstract": " Males are more likely than females to aspire to and enter scientific careers, a pattern that might be attributed to gender differences in the appeal of school science. Differences might arise, in part, from gender‐related interactions with the interest value of school science experiments. If modifiable, the interest value of experiments could influence attitudes toward science and subsequent choices concerning science involvement. In this study, middle school students carried out versions of science experiments designed to vary in their interest value. Experiment modifications, guided by a three‐component model of interest, ranged from introduction of fantasy scenarios to manipulation of the difficulty and social context of the experiments. Subjects were 101 middle school students, 46 males and 55 females. Of primary interest were MANOVA comparisons of self‐reported interest in the experiments, by gender and …", "num_citations": "61\n", "authors": ["1046"]}
{"title": "A randomized trial of an elementary school mathematics software intervention: Spatial-temporal math\n", "abstract": " Fifty-two low performing schools were randomly assigned to receive Spatial-Temporal (ST) Math, a supplemental mathematics software and instructional program, in second/third or fourth/fifth grades or to a business-as-usual control. Analyses reveal a negligible effect of ST Math on mathematics scores, which did not differ significantly across subgroups defined by prior math proficiency and English Language Learner status. Two years of program treatment produced a nonsignificant effect. Publication of evaluation results from large-scale real-world supplemental mathematics instructional implementations such as this one can provide a realistic view of the possibilities, costs, and limitations of this and other computer aided instruction supplemental interventions.", "num_citations": "56\n", "authors": ["1046"]}
{"title": "Stimulation of human somatosensory cortex: tactile and body displacement perceptions in medial regions\n", "abstract": " We examined the somatosensory perceptions evoked by stimulation of rolandic and parietal brain regions in 40 epileptic patients undergoing a presurgical investigation with intracerebral electrodes. Bipolar stimulation trains were delivered in an incremental sequence at medial and/or lateral contact pairs of stereotaxically implanted, multi-contact electrodes, while monitoring stimulus afterdischarge propagation with electrodes in frontal and temporal lobes. Rolandic stimulation evoked contralateral sensations, whereas sensations from either side were evoked in the opercular region. Stimulation of lateral posterior parietal cortex evoked only few sensations and these were restricted to the supramarginal gyrus. Contralateral sensations were evoked in the posterior cingulate gyrus, whereas ipsilateral sensations were evoked in the vicinity of the cingulate sulcus. Complex proprioceptive sensations in the form …", "num_citations": "56\n", "authors": ["1046"]}
{"title": "Pautas de tratamiento antibiótico empírico de las infecciones intraabdominales\n", "abstract": " La infección intraabdominal es una de las causas más frecuentes de abdomen agudo, representando el 23% de las consultas por dolor abdominal (1). En general ocurre como consecuencia de la contaminación bacteriana o química del peritoneo debida a la perforación del tubo digestivo oa la obstrucción e inflamación de una víscera hueca (colecistitis, diverticulitis, apendicitis). La incidencia aumenta con la edad y el número de enfermedades concomitantes, por lo que cabe esperar un incremento en las próximas décadas a medida que se prolongue la esperanza de vida. Enfermedades comunes como la colelitiasis ya afectan al 5% a 6% de la población, aunque únicamente el 3% desarrollará colecistitis aguda (2); la prevalencia de apendicitis aguda es del 7%(3) y la enfermedad diverticular afecta al 50% de la población mayor de 70 años, pero solamente el 20% presenta alguna complicación como diverticulitis aguda (4). El tratamiento de la infección intraabdominal incluye el control quirúrgico, radiográfico o endoscópico del foco de infección, la antibioticoterapia, la administración de líquido y las medidas de soporte de los órganos insuficientes (5). Sin embargo, a pesar de estas recomendaciones, la mortalidad global por fallo del tratamiento sigue siendo elevada, desde el 22% en la cirugía abdominal de urgencia (6) hasta el 44% en los pacientes con abdomen agudo en la Unidad de Cuidados Intensivos (7). La mortalidad atribuible a cada técnica quirúrgica varía desde el 0, 2% en la apendicitis aguda complicada en adultos jóvenes, el 3% en pacientes ancianos (8) y hasta el 52% en peritonitis difusa postoperatoria nosocomial (9 …", "num_citations": "55\n", "authors": ["1046"]}
{"title": "Access to information technologies among school‐age children: Implications for a democratic society\n", "abstract": " Access to information and participation in a democratic society are mutually dependent. This connection implies the possibility that a segment of society can become disenfranchised, not by exclusion from voting rights, but by exclusion from access to information and information technologies. Large‐scale survey data on access to information technologies hint that such a process has already begun. As information technology proliferates, we approach a societal watershed in which technology will either improve the life chances of the disadvantaged or further drive a wedge between the poor and the privileged. © 1994 John Wiley & Sons, Inc.", "num_citations": "55\n", "authors": ["1046"]}
{"title": "Estudio multicéntrico epidemiológico-clínico de cáncer de pulmón en España (estudio EpicliCP-2003)\n", "abstract": " ObjetivoLa mortalidad por cáncer de pulmón en España aumenta ininterrumpidamente. El objetivo del presente estudio ha sido conocer su incidencia hospitalaria, así como otros datos de manejo clínico, en varias regiones españolas.Material y métodosSe ha realizado un estudio prospective observacional de los pacientes diagnosticados de cáncer de pulmón en 2003 en 13 centros de 9 comunidades autónomas. Se evaluaron variables epidemiológicas, clínicas, diagnósticas y terapéuticas.ResultadosSe han registrado 1.064 varones y 125 mujeres correspondientes a una población total de 2.726.601 habitantes (1.346.483 varones y 1.380.118 mujeres). Las tasas estandarizadas según población mundial variaron entre 42,4 y 61,8/100.000 en varones y entre 1,5 y 8,6/100.000 en mujeres. El 51% tenía más de 70 años. El 97,5% de los varones y el 32% de las mujeres eran fumadores o ex fumadores. Se …", "num_citations": "52\n", "authors": ["1046"]}
{"title": "Extending the rule space methodology to a semantically-rich domain: Diagnostic assessment in architecture\n", "abstract": " This paper presents a technique for applying the Rule Space methodology of cognitive diagnosis to assessment in a semantically-rich domain. Previous applications of Rule Space—all in simple, well-structured domains—based diagnosis on examinees’ ability to perform individual problem-solving steps. In a complex domain, however, test items might be so different from one another that the problem-solving steps used for one item are unrelated to the steps used to solve another item. The technique presented herein extends Rule Space’s applicability by basing diagnosis on item characteristics that are more abstract than individual problem-solving steps. A cognitive model of problem-solving motivates selection of characteristics in order to maintain the connection between an examinee’s problem-solving skill and his/her diagnosis. To test the extended Rule Space procedure, data were collected from 122 …", "num_citations": "48\n", "authors": ["1046"]}
{"title": "Correlations between magnetic resonance imaging‐based hippocampal sclerosis and depth electrode investigation in epilepsy of the mesiotemporal lobe\n", "abstract": " Quantitative analysis of hippocampal formations (HF) by magnetic resonance imaging (MRI) was correlated with depth electrode recordings in 18 patients with partial epilepsy. All had seizures of mesiotemporal origin. Electrodes explored three HF segments: amygdala and HF head and anterior and posterior HF body. Corresponding. HF measurements were made on coronal MRI sequences, and atrophy was quantified by one global and three segmental indexes of asymmetry per patient. HF from which seizure originated showed global atrophy in 15 patients. Segmental analysis demonstrated discrete tissue damage in 1 patient; thus, 16 patients (88%) had significant hippocampal atrophy ipsilateral to the mesial focus. The existence of more pronounced atrophy in segments giving rise to ictal onset than in segments without ictal onset was not statistically significant. Nevertheless, in posterior HF, all segments (four …", "num_citations": "46\n", "authors": ["1046"]}
{"title": "Visual motion perception from stimulation of the human medial parieto-occipital cortex\n", "abstract": " Visual phenomena evoked by direct electrical stimulation of extrastriate cortex were observed in 30 epileptic patients as part of a presurgical investigation. An incremental sequence of low-level bipolar stimulation trains was delivered at medial and lateral pairs of contacts of stereotaxically-implanted multilead intracerebral electrodes in parietal, occipital and posterior temporal regions. Diffusion of stimulus afterdischarges was monitored by electrodes in temporal and frontal lobes and by the non-stimulated contacts of the stimulated electrode. Localized stimulations evoked few visual phenomena. The strongest anatomo-perceptual correlation was found for stimulation in the medial parieto-occipital fissure which evoked visual motion phenomena in all three patients stimulated in that region. The evoked motion perceptions were not associated with eye movements or any particular localization of the epileptic …", "num_citations": "45\n", "authors": ["1046"]}
{"title": "Effects of high pressure processing on protein fractions of blue crab (Callinectes sapidus) meat\n", "abstract": " The studies about the effect of high pressure processing (HPP) on the myofibrillar proteins of crab meat are scarce in the literature. The aim of this study is to evaluate the effect of high pressure processing (HPP) at 100, 300 and 600 MPa (10 °C/5 min) on the muscular protein fractions of blue crab meat (Callinectes sapidus) and compares the effect of high pressure treatments and the thermal cooking process on the yielding of crab meat. Differential scanning calorimetry analysis of raw crab meat showed two peaks at 48.18 and 76.76 °C corresponding to myosin and actin denaturation. The increasing in the pressure level resulted in a decrease in denaturation enthalpy of both proteins. Data from Fourier transform infrared spectroscopy indicated changes in the secondary protein structures in which a reduction in α-helix and an increase in β-turn were observed as a result of denaturation induced by HPP …", "num_citations": "44\n", "authors": ["1046"]}
{"title": "Impaired mitochondrial function protects against free radical-mediated cell death\n", "abstract": " Free radical damage can have fatal consequences. Mitochondria carry out essential cellular functions and produce high levels of reactive oxygen species (ROS). Many agents also generate ROS. Using the yeast Saccharomyces cerevisiae as a eukaryotic model, the role of functional mitochondria in surviving free radical damage was investigated. Respiratory-deficient cells lacking mitochondrial DNA (ρ0) were up to 100-fold more resistant than isogenic ρ+ cells to killing by ROS generated by the bleomycin-phleomycin family of oxidative agents. Up to approximately 90% of the survivors of high oxidative stress lost mitochondrial function and became “petites.” The selective advantage of respiratory deficiency was studied in several strains, including DNA repair-deficient rad52/rad52 and blm5/blm5 diploid strains. These mutant strains are hypersensitive to lethal effects of free radicals and accumulate more DNA …", "num_citations": "38\n", "authors": ["1046"]}
{"title": "A review of automatically scorable constructed‐response item types for large‐scale assessment\n", "abstract": " The use of automated scanning of test sheets, beginning in the 1930s, led to widespread use of the multiple‐choice format in standardized testing. New forms of automated scoring now hold out the possibility of making a wide range of constructed‐response item formats feasible for use on a large‐scale basis. We describe new developments in five domains: mathematical reasoning, algebra problem solving, computer science, architecture, and natural language. For each one, we describe the task as presented to the examinee, the methods used to score the response, and the psychometric properties of the item responses. We then highlight general challenges and issues spanning these technologies. We conclude by offering our views on the ways in which such technologies are likely to shape the future of testing.", "num_citations": "38\n", "authors": ["1046"]}
{"title": "DNA damage-inducible and RAD52-independent repair of DNA double-strand breaks in Saccharomyces cerevisiae\n", "abstract": " Chromosomal repair was studied in stationary-phase Saccharomyces cerevisiae, including rad52/rad52 mutant strains deficient in repairing double-strand breaks (DSBs) by homologous recombination. Mutant strains suffered more chromosomal fragmentation than RAD52/RAD52 strains after treatments with cobalt-60 γ irradiation or radiomimetic bleomycin, except after high bleomycin doses when chromosomes from rad52/rad52 strains contained fewer DSBs than chromosomes from RAD52/RAD52 strains. DNAs from both genotypes exhibited quick rejoining following γ irradiation and sedimentation in isokinetic alkaline sucrose gradients, but only chromosomes from RAD52/RAD52 strains exhibited slower rejoining (10 min to 4 hr in growth medium). Chromosomal DSBs introduced by γ irradiation and bleomycin were analyzed after pulsed-field gel electrophoresis. After equitoxic damage by both DNA …", "num_citations": "36\n", "authors": ["1046"]}
{"title": "Energy and angular momentum disposals in the vibrationally mediated photodissociation of HOOH and HOOD: Intramolecular properties via photofragment mapping\n", "abstract": " Vector correlations, vibrational fragment pair correlations and population distributions in OH(D) photofragments generated via two photon, vibrationally mediated photodissociation of HOOH(D) at selected wavelengths near 750 nm, have been determined using polarized, Doppler-resolved LIF spectroscopy. These measurements, together with a knowledge of the direct, single photon dissociation dynamics at comparable supplied energies,    (i) allow assignment of the two electronic transitions (Ã 1 A and [Btilde] 1 B ← [Xtilde] 1 A) contributing to the continuum accessed in the double resonance experiments,   (ii) establish the minor influence of rotational torques exerted on the electronically excited potential energy surfaces, when these are accessed at large 0-0 bond extensions,   (iii) establish strong photofragment rotational excitation as originating primarily from the molecular ro-vibrational motion in the …", "num_citations": "36\n", "authors": ["1046"]}
{"title": "A comparative evaluation of Etest and broth microdilution methods for fluconazole and itraconazole susceptibility testing of Candida spp.\n", "abstract": " The Etest strip is a promising tool of broad application in clinical microbiology. The method  provides MIC readings and is easier to perform than broth microdilution. We carried out a study  to compare the MICs of fluconazole and itraconazole obtained by the Etest with those obtained  by broth microdilution, performed according to the guidelines of the NCCLS document M27-A,  with 402 clinical isolates (360 Candida albicans, 17 Candida tropicalis, nine Candida krusei, nine Candida glabrata and seven Candida parapsilosis) and seven control isolates. The agreement between MICs by the two methods (at 6∓ 2  dilutions) was 74.5% for fluconazole and 61.4% for itraconazole. These results suggest that  further development is necessary to standardize the medium and incubation conditions before  introduction of the Etest as a routine method in the clinical microbiology laboratory for  fluconazole and …", "num_citations": "34\n", "authors": ["1046"]}
{"title": "The effects of mathematics instruction using spatial temporal cognition on teacher efficacy and instructional practices\n", "abstract": " This paper examined the effects of an instructional approach known as Spatial Temporal Mathematics (ST Math) on teacher beliefs about mathematics teaching. Participants were 339 elementary teachers teaching grades 2–5 who were randomly assigned to a control or treatment group. Hierarchical linear modeling was used to determine the effects of the intervention on self-efficacy, outcome expectancy, and instructional practices using scientific reasoning. While the treatment did not yield significant effects in teacher outcomes, our secondary analysis indicated that time on ST Math and the integration of ST Math into daily instructions were positively associated with teacher efficacy and instructional practices using scientific reasoning. Implications of the results on teacher beliefs about mathematics teaching are discussed.", "num_citations": "32\n", "authors": ["1046"]}
{"title": "Relationship between sensory and physico-chemical quality parameters of cold-stored\" Clemenules\" mandarins coated with two commercial waxes\n", "abstract": " The relationship between physico-chemical parameters (weight loss, rind gloss, juice yield, soluble solids content, titratable acidity, maturity index, and ethanol and acetaldehyde content) and sensory attributes (acidity, sensory maturity index, off-flavor and mandarin like-flavor) of\" Clemenules\" mandarins was studied in relation to coating treatments and cold storage duration. Fruit were uncoated (control) or treated with two commercial water-based waxes, both with the same wax composition (polyethylene wax and shellac) but two different total solids concentrations (70 and 100 g/kg). Fruit were stored at 5 deg C and 90% relative humidity for 12, 22, 32, 42, 52 or 62 days, plus 7 days at 20 deg C to simulate shelf life marketing conditions. Physico-chemical quality was well preserved throughout storage, especially in fruit coated with 70 g/kg total solids water wax. Fruit from this treatment had the lowest weight loss and the greatest rind gloss. Mandarin-like flavor decreased throughout the storage period, which was highly related with ethanol build-up. Partial least square regression analysis showed that in general the correlation between sensory attributes and instrumental measurements was high.", "num_citations": "31\n", "authors": ["1046"]}
{"title": "Aims, equity, and access in computer education\n", "abstract": " Despite the controversy, teachers, prin cipals, superintendents, and school boards are making tough choices about whether and how to link computers and learning. Many questions are relevant to the dis cussion: Are computers being integrat ed into subject-matter areas? Should they be? How important is out-of-school ac cess to computers in developing com puter-related competence? How can we insure that access to computers will be equitably distributed between males and females and across racial and ethnic lines?At the same time, the widespread be lief that America faces an uncertain eco nomic future is fueling the interest in technology-related education. The cur rent scene bears a striking resemblance to the national climate following the launch of Sputnik I in 1957. John Jen nings captured the national mood well when he called economic competitiveness\" the Sputnik of the Eighties.\" l Just as the first …", "num_citations": "31\n", "authors": ["1046"]}
{"title": "Cognitive processing requirements of constructed figural response and multiple-choice items in architecture assessment\n", "abstract": " Contrasts between constructed-response items and multiple-choice counterparts have yielded but a few weak generalizations. Such contrasts typically have been based on the statistical properties of groups of items, an approach that masks differences in properties at the item level and may lead to inaccurate conclusions. In this article, we examine item-level differences between a certain type of constructed-response item (called figural response) and comparable multiple-choice items in the domain of architecture. Our data show that in comparing two item formats, item-level differences in difficulty correspond to differences in cognitive processing requirements and that relations between processing requirements and psychometric properties are systematic. These findings illuminate one aspect of construct validity that is frequently neglected in comparing item types, namely the cognitive demand of test items.", "num_citations": "29\n", "authors": ["1046"]}
{"title": "Components of interesting science experiments.\n", "abstract": " Examined among 59 7th graders the features of science experiments that make them interesting to middle school (MS) students. The authors compared a model of interest in learning with the reasons MS students give for liking school science experiments. Ss were asked to list the characteristics of experiments they found appealing. Each of the 12 characteristics identified was classified as an instance of 1 of the 3 theoretically based interest dimensions: cognitive, mastery, and social. 66 other 7th graders were asked to organize the characteristics. Six elements appeared under the cognitive appeal, 4 elements under mastery appeal, and 2 elements under social appeal. These characteristics might form the basis for a checklist or more elaborate rating instrument.(PsycINFO Database Record (c) 2016 APA, all rights reserved)", "num_citations": "29\n", "authors": ["1046"]}
{"title": "Increased cAMP immunostaining in cerebral vessels in Alzheimer’s disease\n", "abstract": " Increasing evidence suggests that up-regulation of the cAMP-second messenger system is implicated in Alzheimer’s disease neurodegeneration. Since previous studies reported an increased level of cAMP in microvessels of Alzheimer’s patients compared with those from non-demented elderly controls, we have carried out an immunohistochemical study to compare cAMP immunostaining in brain vessels from patients with dementia and neuropathological criteria of Alzheimer’s disease (n=5) with those of age-matched patients (n=10). We have also included a control group of adult patients (n=5) to evaluate the role of aging separate from the effects of dementia. Our results demonstrated an increased cAMP immunostaining in cerebral cortical and meningeal vessels from Alzheimer’s patients compared to nondemented elderly and adult controls. Vascular cAMP immunostaining was mainly observed in frontal and …", "num_citations": "28\n", "authors": ["1046"]}
{"title": "Cognitive representations: Distinctions, implications, and elaborations\n", "abstract": " IMPLICATIONS■ 人は内的/外的世界を意味に基づく体制化によって構成しているので, 知識とは単なる感覚の記述ではない・「イメージはとは, 知覚の延長線やコピーを超えた, 構成されたものであるので, あるシンボルの状態を有するようになる」(Piaget & Inhelder, 1971).・無自覚のうちに, 記憶は既有知識に合致するよう歪められる (Bartlett, 1932).・絵画制作からは, 作者によって見ている世界が異なることが示される. ある要素は削除されたり, ある要素は補われたりする (Goodman, 1978).", "num_citations": "28\n", "authors": ["1046"]}
{"title": "Spatial Temporal Mathematics at Scale: An Innovative and Fully Developed Paradigm to Boost Math Achievement among All Learners.\n", "abstract": " The advancement of science and technology is vital to sustained economic success in the United States. The next generation of STEM professionals must be prepared to engage the world’s most pressing problems. Education, especially in the science, technology, engineering and math (STEM) disciplines, is vital to this endeavor. Yet the US public education system is not adequately developing the intellectual readiness needed to sustain the nation’s economy (NAS, 2007). Students graduating from US high schools are seriously under-prepared to enter STEM fields, which require academic proficiency in mathematics and science, as well as proficiency in problem solving and reasoning.International comparisons show that the performance of American students is far below optimal. In the most recent PISA assessment, for example, top performing students in the US ranked well behind students in the highest achieving countries (PISA, 2007). Performance lagged especially in mathematics, with US proficiency falling well below the average for industrialized countries. In the US, one-third of 4th graders and one-fifth of 8th graders lack the competence to perform basic mathematical computations, with low-income children performing below middle-income children (NAEP, 2005). Achievement gaps are also evident when comparing African American and Hispanic students with white or Asian American students (Levitt & Fryer, 2004) and when comparing girls and boys (Nation’s Report Card, 2009). The United States", "num_citations": "27\n", "authors": ["1046"]}
{"title": "Near threshold stereo-dynamics of molecular photodissociation: the visible and near ultraviolet photodissociation of H2O2\n", "abstract": " Sub-Doppler LIF probing of OH fragments generated from polarised laser photodissociation of H2O2 at wavelengths ranging from 308 to 465 nm, has established contributions from (at least) two single-photon electronic transitions in the very weak continuum absorption lying in this spectral range. The opportunity of studying the photodissociation at energies fairly close to threshold allows the stereo-dynamics to be probed in the long range parts of the repulsive electronically excited potentials, so providing a simple complementary strategy to resonance Raman luminescence and femtosecond kinetic spectroscopy.", "num_citations": "27\n", "authors": ["1046"]}
{"title": "High-resolution ultrasound associated with aspiration biopsy in the follow-up of patients with differentiated thyroid cancer\n", "abstract": " OBJECTIVE: To assess the value of ultrasound in the follow-up of patients undergoing surgery for differentiated thyroid carcinoma.SUBJECTS: The study included 89 patients (70 women and 19 men) with differentiated thyroid carcinoma (76 papillary and 13 follicular cancer).METHODS: High-frequency ultrasound (US) was used in the evaluation of 89 subjects who underwent surgery for thyroid carcinoma. Fine-needle aspiration was performed in cases with positive US. In addition, determinations of thyroglobulin (Tgb) in serum, scintigraphy with 131I, and cervical palpation were evaluated. We determined sensitivity, specificity, and overall accuracy for each of these diagnostic methods.RESULTS: Ultrasonography was positive in 22 subjects, 16 in the nodal area and 6 in the thyroid bed. Twenty-two subjects received fine-needle aspiration with US control; 13 (59%) of 22 were positive for cancer. The results of the …", "num_citations": "26\n", "authors": ["1046"]}
{"title": "Contención mecánica: su uso en cuidados intensivos\n", "abstract": " ObjetivoAnalizar la incidencia del uso de contención mecánica (CM) o restricción física en una unidad de cuidados intensivos y valorar el procedimiento.Procedimientos básicosEstudio descriptivo, prospectivo. Criterios de inclusión: pacientes que precisaron CM desde marzo a junio de 2010. Variables: demográficas, situación clínica, indicaciones, técnicas y dispositivos… Análisis estadístico con media, desviación estándar y porcentajes, con el programa SPSS 14.0.Resultados85 casos: 65,9% hombres, edad media de 64,19 (±17,9) y con NEMS de 29,3 (±8,2). Incidencia de CM: 15,6%. Indicación principal de CM: riesgo de interrupción grave de procesos terapéuticos (80%). Fue decisión enfermera (94,1%). Medida urgente: 85,9%. Registro del procedimiento: 57,6%. Información a la familia: 9,4%. Alternativa previa: contención verbal (100%), farmacológica (48,2%).ConclusionesExiste incidencia relevante de …", "num_citations": "25\n", "authors": ["1046"]}
{"title": "High-performance liquid chromatographic determination of chitin in the snow crab, Chionoecetes opilio\n", "abstract": " A HPLC method was developed for the determination of glucosamine in crab shells. The amount of glucosamine residue can be used to estimate the amount of chitin in analyzed material. Crab samples were hydrolysed with 6 M HCl at 100 °C for 13 h and the released glucosamine was determined by HPLC using refractive index (RI) detection. Separations were performed using an ODS-2 column with an isocratic mobile phase consisting of 10% methanol, 90% hexanesulfonate, pH 2.1. Glucosamine identification was carried out not only on basis of retention time, but also with respect to mass spectra, which were acquired by HPLC–MS.", "num_citations": "23\n", "authors": ["1046"]}
{"title": "Human memory: The basics\n", "abstract": " Since learning and remembering are closely linked, teachers can benefit from understanding the fundamentals of human memory.", "num_citations": "22\n", "authors": ["1046"]}
{"title": "Genetic changes and bioassays in bleomycin-and phleomycin-treated cells, and their relationship to chromosomal breaks\n", "abstract": " The recombinogenicity of damaged chromosomes in diploid Saccharomyces cerevisiae cells treated with bleomycin and structurally related phleomycin was measured, along with aneuploidy and mutation events. Phleomycin was substantially (up to 26-fold) more effective than bleomycin in producing genetic changes at all concentrations, even when colony-forming abilities of cells growing in the presence of bleomycin or phleomycin were similar. These results suggest that the DNA lesions produced by the two structurally related analogs could differ in their nature or frequency, or could be processed differently by the cells. Bioassays were developed and used to compare the cytotoxicities of freshly dissolved bleomycin and phleomycin with the cytotoxicities of lysates prepared from bleomycin- and phleomycin-treated cells. Unexpectedly, lysates prepared from bleomycin-treated cells were 1.5-3.5 times more …", "num_citations": "22\n", "authors": ["1046"]}
{"title": "Chemical composition of snow crab shells (Chionoecetes opilio)\n", "abstract": " The snow crab (Chionoecetes opilio) shells have potential important economical and industrial applications due to theirchemical composition. They have a high content of protein (34.2% dw) and essential amino acids; they also have fat (17.1% dw), with a high proportion of ω3 polyunsaturated fatty acids. About 28.5% dw corresponds to ash (calcium, phosphorous, and magnesium are the major minerals). The mean concentrations of vitamin E, astaxantin, and β-carotene were 23.3, 9.49, and 0.2 mg/100 g dw, respectively. Results presented in this study indicate that snow crab by-products may serve as excellent nutritional components for future applications in the health and food sectors", "num_citations": "21\n", "authors": ["1046"]}
{"title": "Focal myoclonus associated with posterior thalamic hematoma\n", "abstract": " Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS", "num_citations": "21\n", "authors": ["1046"]}
{"title": "Prevalence of Trypanosoma cruzi Infection among People Aged 15 to 89 Years Inhabiting the Department of Casanare (Colombia)\n", "abstract": " The purpose of this study was to calculate the seroprevalence of Trypanosoma cruzi infection in a sample of inhabitants from a region considered to be at high risk of natural transmission of Chagas disease in Colombia. A cross-sectional study was conducted in subjects from 5 municipalities, recruited in urban and rural locations, distributed by gender according to the demographic information available. Socio-demographic information, history of potential exposure to insect vectors, blood donating, as well as symptoms suggesting cardiac disease were collected using a questionnaire. After giving written informed consent, blood specimens were obtained from 486 people to determine the serologic evidence of past exposure to T. cruzi. Infection was diagnosed when two different tests (ELISA and IHA) were positive. The seroprevalence of antibodies against T. cruzi was 16.91% considering an estimated population of 44,355 aged between 15 and 89 years (95%IC: 13.72 to 20.01). The factors significantly associated with the infection were: 1- Housing materials like vegetable material, adobe or unfinished brick walls; 2- The fact of having previous tests for Chagas disease (regardless of the result). Of note, the mean ages among infected and not infected participants were significantly different (49.19 vs. 41.66, p≤0.0001). Among the studied municipalities, the one with the highest frequency of T. cruzi infection was Nunchia, with 31.15% of the surveyed subjects. Therefore it may be concluded that T. cruzi infection is highly prevalent in the north region of Casanare, in Colombia.", "num_citations": "19\n", "authors": ["1046"]}
{"title": "Future bright: A transforming vision of human intelligence\n", "abstract": " Ever since Alfred Binet invented the first IQ test more than a century ago, we have thought of intelligence as fixed from birth and unalterable-as genetically programmed and immutable as eye color. If our IQ was 115 at the age of eighteen, it would be 115 at age thirty-two and at age seventy-two. But as Michael Martinez reveals in Future Bright, human intelligence is not at all a static quality. Drawing on cutting-edge research, Martinez shows that not only can we improve our IQ scores--with the right approach, we can improve intelligence itself. Future Bright introduces the radical view that intelligence can be learned. Ranging from the search for Einstein's brain to the curious case of a railroad worker whose frontal lobe was pierced by a tamping iron, Martinez looks at some of the most fascinating stories in the history of cognitive science, revealing how researchers have sought insight into intelligence by understanding more about the brain. We see how the physical structures of the brain relate to how we think, discover how memories are made, and examine the several kinds of intelligence. Martinez then explores the astonishing evidence from recent cognitive science that intelligence can be learned. Equally important, he concludes with ten strategies for enhancing our intelligence, beginning with the all-important idea of making improved intelligence a conscious goal, and including such ideas as reading books, learning to be an expert, finding where our talents lie and, not least, eating well and exercising, both of which improve brain function significantly. Genetics is only one of the factors that shape our intelligence. Future Bright highlights the many …", "num_citations": "19\n", "authors": ["1046"]}
{"title": "Estudio de prevalencia de patologías dentarias de desarrollo en radiografías panorámicas\n", "abstract": " El objetivo de este estudio fue determinar la prevalencia de patologías dentarias de desarrollo (erupción, forma, posición, tamaño, número) que caracterizan a la población de la Ciudad de Buenos Aires utilizando la información que proporcionan radiografías panorámicas. Se obtuvo la prevalencia de patologías de desarrollo y el análisis de varianza con el objeto de comparar lesiones entre géneros. Se observaron radiografías panorámicas de 1000 pacientes atendidos en la Cátedra de Radiología de la Facultad de Odontología de la Universidad de Buenos Aires, derivados de Clínicas de la misma.", "num_citations": "19\n", "authors": ["1046"]}
{"title": "EXTENDING THE RULE SPACE MODEL TO A SEMANTICALLY‐RICH DOMAIN: DIAGNOSTIC ASSESSMENT IN ARCHITECTURE\n", "abstract": " This paper presents a technique for applying the Rule Space model of cognitive diagnosis (Tatsuoka, 1983) to assessment in a semantically‐rich domain. Responses to 22 architecture test items, developed to assess a range of architectural knowledge, were analyzed using Rule Space. Verbal protocol analyses guided the construction of a model of examinee performance, consisting of processes for constructing an initial representation of an item (labeled understand), forming goals and performing actions based on those goals (solve), and determining whether goals have been attempted and satisfied (check). Item attributes, derived from these processes, formed the basis for diagnosis. Our technique extends Rule Space's applicability by defining attributes in terms of item characteristics and the causal relations between characteristics and the problem‐solving model. Data were collected from 122 architects of …", "num_citations": "19\n", "authors": ["1046"]}
{"title": "Takt Time, el corazón de la producción\n", "abstract": " Si se tiene un puesto o una línea de trabajo que produce a un ritmo inferior al del cliente, es decir que el tiempo de ciclo es superior al Takt-Time, se requiere de horas extras o turnos adicionales para poder conseguir la producción que el cliente solicita. Por el contrario, si se produce a un ritmo superior al del cliente, es decir que el tiempo ciclo es inferior al Takt-time, la línea de producción tendrá tiempo de espera, o tendrá que desplazar a los operarios a otros puestos y se estará generando producción en mayor cantidad. Por tanto, el objetivo al organizar la producción o diseñar un puesto de trabajo es conllevar a que coincida el tiempo de ciclo, con el tiempo Takt.A nivel industrial se puede observar cómo las empresas poseen procesos en los cuales cada vez son más cortos los tiempos de producción, debido a la alta demanda de productos por parte de los usuarios consumidores,¿ pero cómo hacen las empresas para poder saber si están cumpliendo con la demanda del cliente? Después de investigar y observar la forma en que trabajan, se encuentra que la forma de controlar la estadística y conteo de los tiempos de producción es manual, lo cual genera", "num_citations": "18\n", "authors": ["1046"]}
{"title": "Music training and mathematics achievement: A multiyear iterative project designed to enhance students’ learning\n", "abstract": " In a seminal study of the Mozart effect, college students who listened to the first ten minutes of Mozart’s Sonata for Two Pianos in D Major (K. 448) experienced a shortterm enhancement of spatial-temporal (ST) reasoning (Rauscher et al., 1993, 1995). Findings from this study were reported widely in the popular media.ABSTRACT", "num_citations": "18\n", "authors": ["1046"]}
{"title": "Photofragment vector correlations in the vibrationally mediated photodissociation of H2O2\n", "abstract": " Photofragment vector correlations for photofragments generated through vibrationally mediated photodissociation have been measured for the first time. The results obtained for H2O2, dissociated via the third OH overtone state, 4νOH, implicate torsional motion in the intermediate state as a contributor to the final OH photofragment rotation. They also imply excitation into both the Ã 1A and B̃ 1B states, which are near-degenerate at the highly extended OO distances (dictated by energy conservation and the Franck-Condon principle) at which secondary absorption is allowed.", "num_citations": "18\n", "authors": ["1046"]}
{"title": "Obsea: a decadal balance for a cabled observatory deployment\n", "abstract": " The study of the effects of climate change on the marine environment requires the existence of sufficiently long time series of key parameters. The study of these series allows both to characterize the range of variability in each particular region and to detect trends or changes that could be attributed to anthropogenic causes. For this reason, networks of permanent cabled observation systems are being deployed in the ocean. This paper presents a balance of a decade of activity at the OBSEA cabled observatory, as an example of ocean monitoring success and drawbacks. It is not the objective of this article to analyze the scientific and technical aspects already presented by the authors in different publications (Table 4). We will evaluate the overall experience by retracing the different steps of infrastructure deployment and maintenance, focusing on routines for in situ control, damages experienced, breakdowns and …", "num_citations": "17\n", "authors": ["1046"]}
{"title": "Guidelines for the empirical antibiotic treatment of intraabdominal infections\n", "abstract": " [Guidelines for the empirical antibiotic treatment of intraabdominal infections] - Abstract - Europe PMC Sign in or create an account https://orcid.org Europe PMC Menu About About Europe PMC Preprints in Europe PMC Funders Joining Europe PMC Governance Roadmap Outreach Tools Tools overview ORCID article claiming Journal list Grant finder External links service RSS feeds Annotations Annotations submission service Developers Developer resources Articles RESTful API Grants RESTful API API use cases SOAP web service Annotations API OAI service Bulk downloads Developers Forum Help Help using Europe PMC Search syntax reference Contact us Contact us Helpdesk Feedback Twitter Blog Tech blog Developer Forum Europe PMC plus Search worldwide, life-sciences literature Search Advanced Search Recent history Saved searches Abstract Citations & impact [Guidelines for the empirical …", "num_citations": "16\n", "authors": ["1046"]}
{"title": "Introducción de metodologías activas en el aprendizaje de la informática: Experiencia del grupo GREIDI\n", "abstract": " Este artículo describe el proceso seguido por un grupo de profesores interesados en la introducción de metodologías docentes activas en diversas asignaturas de las titulaciones de Ingeniería Técnica en Informática de Gestión y de Sistemas de la Universidad de Valladolid. Estas experiencias se han realizado como parte de la actividad del grupo de investigación docente", "num_citations": "15\n", "authors": ["1046"]}
{"title": "Current status of the degree of malnutrition in hospitalized patients of the Community of La Rioja\n", "abstract": " UNLABELLED: Recent studies have reflected the prevalence of malnutrition within the hospital sphere. The high incidence of malnutrition in hospitals and the negative effect this has on the evolution of patients, since complications are significantly greater in undernourished patients, make it important to find out the nutritional status of patients when they are admitted to hospital and to follow their progress. In the La Rioja region, there have been no prior studies establishing the nutritional status of patients in hospital, so this study was undertaken. It is important to know whether malnutrition is present, the degree of any malnutrition found, and, where necessary, to make the medical and nursing staff aware of the importance of proper nutritional care during a hospital stay. MATERIALS AND METHODS: In a sample of 240 patients selected at random, a nutritional assessment was made on admission. If the patients were still hospitalized one week later, the nutritional assessment was repeated. RESULTS: After the initial assessment, only 12.5% of the 240 patients showed normal nutritional status; mild malnutrition was seen in 55% of cases while moderate and severe cases represented 28.3% and 0.8%, with the most prevalent types of malnutrition being kwasiorkor and mixed (31.6% and 29.6%, respectively). There was no statistical association between the sex of the patient and the degree of malnutrition (p> 0.05). On analysis of the cases by age group, those patients aged less than 65 years mainly presented a marasmus-like and mixed malnutrition, both to a slight degree, whereas the most prevalent malnutrition in patients over the age of 65 was the …", "num_citations": "15\n", "authors": ["1046"]}
{"title": "La detección integrada como un instrumento para vincular la prevención primaria, el tratamiento temprano, y la vigilancia epidemiológica en diabetes e hipertensión arterial\n", "abstract": " Introducción: La diabetes y la hipertensión arterial son enfermedades cronicodegenerativas con periodos de latencia prolongados, esto representa un grave problema económico para los servicios de salud y un gran desafío para la sociedad. La prevalencia nacional de diabetes en la población de 20 a 69 años es de 8.2% de acuerdo a la Encuesta Nacional de Enfermedades Crónicas (ENEC93), se estima que en 1999 existen alrededor de 4.3 millones de diabéticos, de los cuales el 29.2%(alrededor de 1.25 millones) no han sido diagnosticados; el 70.8%(más de 3 millones) se conoce enfermo y de éstos en los Servicios Estatales de Salud (SSA), sólo el 11%(473 mil) acude de manera regular a su tratamiento. La hipertensión arterial es un importante factor de riesgo en la cardiopatía isquémica, la enfermedad cerebrovascular y las nefropatías; la mortalidad por estas enfermedades ha mostrado una tendencia ascendente durante las últimas décadas y se encuentran actualmente entre las primeras causas de muerte. Metodología: Se realizó un estudio descriptivo con el cuestionario de detección integrada para diabetes e hipertensión arterial,¿ tiene diabetes y no lo sabe?, misma que se aplicó a 6186 individuos de 25 años cumplidos y más, de ambos sexos, que acudieron a las unidades de salud de la SSA, así como dentro de la comunidad; los estados participantes fueron Guanajuato, el Estado de México, Jalisco y San Luis Potosí, durante un periodo de un año. El proceso de detección se realizó de manera bietápica, el instrumento de detección fue el cuestionario así como las tomas de glucemia capilar valoradas con glucómetro y la …", "num_citations": "15\n", "authors": ["1046"]}
{"title": "Correlation of MRI hippocampal volume analysis, video/EEG monitoring and inter-and postictal single photon emission tomography in refractory focal epilepsy\n", "abstract": " The effectiveness of surgery in patients with refractory complex partial seizures depends on accurate localisation of the epileptogenic zone. To assess the correlation between magnetic resonance imaging (MRI) hippocampal volume measurements, Tc 99m-hexamethyl-propyleneamineoxime inter- and postictal single photon emission computed tomography (SPECT) and clinico-electrophysiological (video/EEG) localisation of the epileptogenic zone we prospectively studied 16 consecutive patients with refractory complex partial seizures and no significant abnormality on standard MRI. Each test was interpreted blindly by independent observers. Eight patients (50%) had asymmetrical hippocampal volumes indicative of unilateral atrophy; correlation with the video/EEG and postical SPECT changes was very high (100% with definitive video/EEG localisation, 75% with interictal EEG and 83% with postictal …", "num_citations": "15\n", "authors": ["1046"]}
{"title": "Donation after cardiac death in liver transplantation: an additional source of organs with similar results to donation after brain death\n", "abstract": " BackgroundAs new sources of organs are needed, liver transplantation using donors after cardiac death (DCD) is progressively increasing, but outcomes with this method are still questioned. This study was accomplished to verify that DCD outcomes are comparable to those seen in donation after brain death (DBD).MethodsThis was a prospective cohort study including 100 liver transplantation performed between 2014 and 2017, divided according to donor type in 75 DBD and 25 DCD.ResultsDCD donors were younger (mean age: DCD 56 years, DBD 59 years; P = .009). Mean Modified End-stage Liver Disease (MELD) score was lower for DCD (DCD 16, DBD 19; P < .001). No differences were found regarding ischemia times and development of postreperfusion syndrome or coagulopathy. Primary graft dysfunction was more frequent in DCD (60%, DCD 29.3%; P = .006). Rates of primary graft nonfunction (DCD 0 …", "num_citations": "13\n", "authors": ["1046"]}
{"title": "Spatio-temporal kriging analysis to identify the role of wild boar in the spread of African swine fever in the Russian Federation\n", "abstract": " The current situation of African Swine Fever (ASF) epidemic in continental Europe represents a serious economic risk for the European pig industry. It is well known that both domestic pigs and wild boar are involved in the ASF spread, but the exact mechanism of the domestic–wildlife interface remains under research. A spatio-temporal kriging analysis was carried out to estimate the most possible source of infection (domestic pigs or wild boar) for 1,323 notifications of ASF reported in the Russian Federation (RF) from 2013 to 2017. Results for the whole period of study showed that domestic pigs and wild boar were the potential source of infection for 55% and 45% of notifications, respectively. The analysis stratified by year showed fluctuation in this tendency through time. At the early stages of the ASF epidemic in the Southern regions of the RF in 2007–2008 wild boar appears to be the main source of infection …", "num_citations": "12\n", "authors": ["1046"]}
{"title": "Declaración sobre ética e integridad en la docencia universitaria\n", "abstract": " Este Documento sobre ética e integridad en la docencia universitaria es el segundo de la trilogía sobre la integridad en el desempeño de la actividad académica que el Observatorio de Bioética y Derecho está elaborando con la finalidad de analizar los principales problemas de ética en el ámbito de la investigación, la docencia y la gestión de la educación superior, así como de efectuar recomendaciones y propuestas para afrontarlos.El primer documento fue elaborado de forma conjunta por la Cátedra Unesco de la Universidad Católica de Porto y la Cátedra Unesco de Bioética de la Universitat de Barcelona (UB), cuya sede es el Observatorio de Bioética y Derecho de la UB, y se tituló Declaración sobre integridad científica en investigación e innovación responsable (puede consultarse en: http://www. publicacions. ub. edu/refs/observatoriBioEticaDret/documents/08489. pdf.). En él se definió la integridad, desde un punto de vista etimológico y conceptual, ligada a la idea de ‘totalidad intacta’y atendiendo a su dimensión moral,‘como la fidelidad a un sistema axiológico y normativo asumido por la propia persona’. Por eso, la ‘integridad’se entiende también como principio que implica una acción obligatoria, e impone el respeto y la protección de la dignidad de cada uno de los otros. Este es el sentido que recoge la Declaración Universal de Bioética y Derechos Humanos de la Unesco. Este trabajo, publicado en octubre de 2016, proporcionó pautas a investigadores, profesionales y agentes del sistema de investigación e innovación, integrando las particularidades del ámbito latino y las distintas perspectivas culturales.", "num_citations": "12\n", "authors": ["1046"]}
{"title": "Cognitive affordances of the cyberinfrastructure for science and math learning\n", "abstract": " The cyberinfrastucture is a broad informational network that entails connections to real‐time data sensors as well as tools that permit visualization and other forms of analysis, and that facilitates access to vast scientific databases. This multifaceted network, already a major boon to scientific discovery, now shows exceptional promise in advancing educational goals, especially in fostering deep and authentic understanding in science and scientific practice. In this paper, we outline the key features of the cyberinfrastructure that make it far more than the latest technological innovation. In particular, we identify six cognitive affordances for education that are unique to the cyberinfrastructure and that, in combination, set it apart from its predecessors: (a) immediate original data, (b) distributed expert networks, (c) analytical and visualization tools, (d) instantaneous retrieval of source documents, (e) forums for public discourse …", "num_citations": "12\n", "authors": ["1046"]}
{"title": "Overexpression of genes involved in vesicular trafficking to the vacuole defends against lethal effects of oxidative damage.\n", "abstract": " Anticancer bleomycins and structurally-related analogs are oxidative agents that mimic ionizing radiation in many of their cellular effects. The current study was designed to better understand this class of radiomimetic and oxidative drugs, and how cells defend against them to become resistant. Based on some of the properties conferred by the blm5-1 mutation of Saccharomyces cerevisiae, a multi-step cloning strategy was developed to search for genes that protect cells against oxidative damage and lethal effects of bleomycin treatments. The strategy employed blm5-1 mutant strains to search for genes that rescued the drug hypersensitivities conferred by the mutation, and utilized the inability of homozygous blm5-1 mutant diploid strains to grow at elevated temperatures. This approach identified the VPS3, VPS8 and PEP7 genes that function in vesicular trafficking between the endosome and the yeast vacuole via the carboxypeptidase Y (CpY) pathway. Mutant blm5-1 strains possess several phenotypic characteristics consistent with CpY mutants, including reduced mitotic growth rates and sporulative abilities. However, blm5-1 strains were not found to be defective in the transport of CpY into the vacuole. We suggest that the ability of the VPS3, VPS8 and PEP7 genes to rescue lethal effects of oxidative damage resulted from the overexpression of these genes.", "num_citations": "12\n", "authors": ["1046"]}
{"title": "Problem-solving correlates of new assessment forms in architecture\n", "abstract": " In the figural response item format, proficiency is expressed by manipulating elements of a picture or diagram. Figural response items in architecture were contrasted with multiple-choice counterparts in their ability to predict architectural problem-solving proficiency. Problem-solving proficiency was measured by performance on two architecture design problems, one of which involved a drawing component, whereas the other required only a written verbal response. Both figural response and multiple-choice scores predicted verbal design problem solving, but only the figural response scores predicted graphical problem solving. The presumed mechanism for this finding is that figural response items more closely resemble actual architectural tasks than do multiple-choice items. Some evidence for this explanation is furnished by architects' self-reports, in which architects rated figural response items as \"more like what …", "num_citations": "12\n", "authors": ["1046"]}
{"title": "Item Formats and Mental Abilities in Biology Assessment.\n", "abstract": " Investigated the relationships of figural response items and open-ended verbal items in biology to figural and verbal mental aptitudes (n= 24). Performance on the verbal items was positively related to verbal ability. Figural response scores were related positively to both figural and verbal abilities.(PR)", "num_citations": "12\n", "authors": ["1046"]}
{"title": "The EpicliCP-2003 study: a multicenter epidemiological and clinical study of lung cancer in Spain\n", "abstract": " ObjectiveMortality due to lung cancer in Spain is increasing continuously. The aim of the present study was to collect information on the hospital incidence of lung cancer, as well as information on clinical management, in different regions of Spain.Material and methodsA prospective observational study of patients diagnosed with lung cancer in 2003 was carried out in 13 centers in 9 autonomous communities. Epidemiological, clinical, diagnostic, and therapeutic variables were assessed.ResultsOf a total population of 2 726 601 inhabitants (1 346 483 men and 1 380 118 women), 1064 male and 125 female lung cancer patients were included. The incidence standardized to the world population varied between 42.4/100 000 and 61.8/100 000 in men and between 1.5/100 000 and 8.6/100 000 in women. Overall, 51% were aged over 70 years, and 97.5% of the men and 32% of the women were smokers or ex …", "num_citations": "11\n", "authors": ["1046"]}
{"title": "Early outcomes of liver transplantation using donors after circulatory death in patients with hepatocellular carcinoma: a comparative study\n", "abstract": " IntroductionDonation after circulatory death (DCD) has increased in the last decade, although a slight increase in surgical complications has been reported in liver transplantation (LT). Therefore, DCD is not overall recommended because it entails an added risk. However, DCD in selected patients shows acceptable results.ObjectiveThe objective was to analyze the characteristics, early outcomes, and survival at 1 year post-LT from a single institute (January 2015 to May 2017).Materials and methodsWe included 18 DCD-LTs and compared them with a control group of 18 donation after brain death (DBD) LTs. We analyzed pre- and posttransplant variables related to donors, recipients, and intraoperative early outcomes within patients transplanted due to hepatocellular carcinoma (HCC). A descriptive analysis, Mann-Whitney U test, χ2, or Fisher test was performed when appropriate, as well as multivariate analysis in …", "num_citations": "10\n", "authors": ["1046"]}
{"title": "Second consensus report on the use of antimicrobial agents in exacerbations of chronic obstructive pulmonary disease\n", "abstract": " Aware of the importance of chronic obstructive pulmonary disease (COPD), a panel of experts belonging to the Spanish Society of Respiratory Medicine and Thoracic Surgery (SEPAR), the Spanish Society of Chemotherapy (SEQ) and the Spanish Society of Family and Community Medicine (SEMFyC) issued a statement of consensus in 2000 to serve as the basis for adequate antibiotic control of the disease. Three years later, in accordance with significant scientific progress made in this area, the statement has been thoroughly revised. The new paper in fact constitutes a second consensus statement on the use of antibiotics in COPD exacerbations. When several scientific associations expressed interest in joining the project and contributing to it the Spanish Society of Emergency Medicine (SEMES), the Spanish Society of General Medicine (SEMG) and the Spanish Society of Rural and General Medicine (SEMERGEN) their incorporation led SEPAR and SEMFyC to change the structure of the statement and certain aspects of its content. Additionally, a new group of antibiotics, the ketolides, has joined the therapeutic arsenal. Telithromycin, the single representative of the group for the moment, can be considered not only an alternative treatment but even the drug of choice in certain clinical settings that are analyzed in the new statement. Those developments, along with others, such as the increasingly recognized action of levofloxacin against Pseudomonas aeruginosa and the steady action of amoxicillin with clavulanic acid when administered at recommended doses every 8 hours, provide new antimicrobial therapeutic protocols for COPD …", "num_citations": "10\n", "authors": ["1046"]}
{"title": "The application of an expert model of interpretive skill to a multicultural-multimedia system on ethnic dance\n", "abstract": " The purpose of our research was to investigate the nature of expertise in the interpretation of cultural artifacts, in particular, the Concheros dance of Mexico. The discovery environment for the development of interpretive skill was a CD-ROM-based multimedia computer system which provided users with footage of the dance and related historical and cultural information pertaining to the Concheros community. The experimental version of the multimedia system was structured to require the use of expert strategies, including hypothesis formation, use of conditional and probabilistic language, and the marking of resources for interest and relevance. Our analysis showed that, compared to a control group, higher ability students exposed to the experimental version of our computer-based learning environment demonstrated a greater capacity to render an interpretive account of the Concheros dance. One implication is …", "num_citations": "10\n", "authors": ["1046"]}
{"title": "Learning and cognition\n", "abstract": " Welcome to the first edition of Learning and Cognition: The Design of the Mind. My goal in writing this textbook was to present what is known about the human mind in a form that is as interesting and engaging as possible. As you read the book, I hope you will find that our current knowledge of the mind weaves together into a fascinating story.Too often, students in university courses get the impression that theories of learning and cognition are scattershot—constellations of facts and findings that might seem important in isolation, but that don’t really hold together. A lack of coherence makes teaching difficult for instructors, who are responsible for telling the “story” of the human mind in a form that is as interesting as possible. Fortunately, theories of human learning and cognition really are fascinating, as well as applicable in academic and everyday contexts. Even better, they hold together as an articulated whole. It’s up to us, as instructors, to convey this to our students.", "num_citations": "9\n", "authors": ["1046"]}
{"title": "Creating virtual learning communities of rural schools teachers\n", "abstract": " This paper is based on the analysis of the experience obtained in the development of rural teacher communities under the umbrella of the project NEtwork Multigrade Education (NEMED) in Spain. The article briefly shows the current situation of the rural school in Spain and highlights the links that have been created through the creation of a virtual learning community of teachers spread in several isolated areas, the so-called Virtual Rural School. This in fact acts as a virtual community of practice (VCoP)", "num_citations": "9\n", "authors": ["1046"]}
{"title": "EVALUATION AND SURGICAL-TREATMENT OF THE EPILEPSIES\n", "abstract": " The currently available surgical procedures for the treatment of epilepsy, from fundamental data to therapeutic results, including various means of investigation are reported. The work is based on a review of the literature and on the cases studied by the two teams from the Universities of Montreal and Bordeaux who share the same concept of epilepsy surgery. The patient groups of the two teams include 316 S.E.E.G., 214 cortectomies, 39 callosotomies and 2 multiple sub-pial transsections. In the first part, the authors attempt to demonstrate that the epileptic focus corresponds to the region where the seizures arise, that this focus is not directly comparable to the region where inter-ictal spikes are recorded and sometimes becomes autonomous from the causal lesion. The epileptic phenomenon has a definite harmful effect on cerebral functions and a probable self-aggravating potential. The second chapter …", "num_citations": "9\n", "authors": ["1046"]}
{"title": "A comparison of multiple‐choice and constructed figural response items\n", "abstract": " In contrast to multiple‐choice test questions, figural response items call for constructed responses and rely upon figural material, such as illustrations and graphs, as the response medium. Figural response questions in various science domains were created and administered to a sample of 4th‐, 8th‐, and 12th‐grade students. Item and test statistics from parallel sets of figural response and multiple‐choice questions were compared. Figural response items were generally more difficult, especially for questions that were difficult (p<.5) in their constructed‐response forms. Figural response questions were also slightly more discriminating and reliable than their multiple‐choice counterparts, but had higher omit rates. The paper addresses the relevance of guessing to figural response items and the diagnostic value of the item type. Plans for future research on figural response items are discussed.", "num_citations": "9\n", "authors": ["1046"]}
{"title": "Fatty acid profile and total lipid content of chionoecetes opilio shells\n", "abstract": " In the present study, the Soxhlet method was used to determine the total lipid content of Chionoecetes opilio shells. Several parameters were optimized in order to achieve the maximum extraction efficiency.", "num_citations": "8\n", "authors": ["1046"]}
{"title": "Determinación de los niveles del síndrome burnout en profesionales de la salud de la V región\n", "abstract": " En esta investigación se analizan los niveles de Síndrome Burout en profesionales de la salud de la Quinta Región, Chile, un tipo de estrés laboral que sólo comenzó a ser estudiado en forma sistemática en la década de los 80. Puede ser definido como un Síndrome de cansancio físico y emocional que involucra el desarrollo de un concepto negativo de sí mismo, una actitud laboral negativa y una pérdida de preocupación hacia los clientes. La muestra está constituida por 153 profesionales de tres hospitales de la Región, entre asistentes sociales, enfermeras, matronas, médicos, odontólogos, psicólogos y psiquiatras. En ellos se evaluó el síndrome a través del Cuestionario de Burnout para Profesionales Sanitarios (Filgueira Bouza, 1993), el que fue adaptado a realidad sociocultural chilena. Los resultados muestran que la mayoría de los encuestados manifiestan Burnout a través de las categorías “fuentes de …", "num_citations": "8\n", "authors": ["1046"]}
{"title": "Advances in computer-based mathematics assessment\n", "abstract": " Mathematician/philosopher Alfred North Whitehead has been credited with saying that civilization advances by extending the number of important operations which we can perform without thinking of them. In this century, an insufficiently appreciated task of education has become to extend automated skill in key operations to all citizens. As a consequence, it becomes the task of educational assessment to determine the presence of these automated skills. Often, students will demonstrate these automated operations in familiar educational settings with traditional assessments, but are unable to apply them to noneducational situations (for example, see Erlwanger, 1973; Rosnick and Clement, 1980; diSessa, 1982; McCloskey et al., 1980; and a general discussion in Davis, 1984).", "num_citations": "8\n", "authors": ["1046"]}
{"title": "Gender differences in science interest\n", "abstract": " Males are more likely than females to aspire to and attain careers in science. This pattern might be attributed to differences in the appeal of school science to boys and girls. In this study, middle school students carried out versions of science experiments that differed in their motivational appeal. Findings showed that boys were more attentive to aspects of science experiments that elicit perceptions of control, whereas girls were more attentive to social aspects. Further, attempts to enhance the interest value of science experiments were found to be more effective for girls than for boys. Motivational enhancement of science experiments was found to affect subsequent choices to participate in science experiments.", "num_citations": "8\n", "authors": ["1046"]}
{"title": "Computers in US and Canadian Schools: Have We Made Progress?\n", "abstract": " HEN COMPUTERS first appeared in WW homes and schools, predictions were made that they would revolutionize education, home life, and society. Sud-denly, computer literacy became &dquo; the next great crisis in American education&dquo;(Molnar, 1978). We came to believe that every student needed some kind of com-puter competency to be employable, and various computer experiences in school to be appropriately educated. The pres-ence of computers in schools quickly became accepted as desirable and neces-sary.", "num_citations": "8\n", "authors": ["1046"]}
{"title": "Velocity of ASF spread in wild boar in the European Union (2014–2017)\n", "abstract": " Purpose: The continued advance of African Swine Fever (ASF) through Eastern European countries represents a threat for the European pig industry. ASF is often described as a highly contagious infectious disease of swine. In the current affected countries in the European Union (EU), the spatio-temporal dynamics of ASF spread in wild boar appear to be different; ie in Estonia, the whole country has been affected since its introduction in 2014, while in Poland, ASF remained within the limits of a single county for a long period. Here we quantify the velocity of spread of ASF in wild boar in the EU to elucidate whether it is constant or increasing, which can help to understand if further cases are expected in other areas as well as the rate of occurrence.Methods & Materials: We apply a spatio-temporal kriging model to interpolate the date of a total of 7112 ASF notifications in wild boar from 2014 to 2017 taking into …", "num_citations": "7\n", "authors": ["1046"]}
{"title": "Titularidad, mercado y eficiencia técnica en el transporte aéreo: Un análisis de frontera graph no paramétrico\n", "abstract": " El objetivo de este estudio es analizar la influencia que dos variables de naturaleza cualitativa: la titularidad del capital de la empresa, ya sea público, mixto o privado y la estructura del mercado en el que opera, liberalizado o regulado con niveles de competencia restringidos, tienen sobre los niveles de eficiencia técnica alcanzados por un conjunto de líneas aéreas. La metodología empleada se basa en el Análisis Envolvente de Datos y evalúa la eficiencia a través de funciones de distancia definidas sobre una representación graph del conjunto de posibilidades de producción. El análisis, pionero en la aplicación de medidas de eficiencia graph, muestra cómo en este sector las compañías de titularidad privada, cuando operan en mercados liberalizados y competitivos, presentan niveles de eficiencia superiores a los de las compañías que actúan en mercados regulados. Sin embargo, si el mercado en el que operan las empresas privadas se encuentra relativamente regulado, entonces tienden a mostrar en media unos niveles de eficiencia inferiores a los que exhiben las compañías de capital mixto y público.", "num_citations": "7\n", "authors": ["1046"]}
{"title": "Fragment pair correlations in the vibrationally mediated photodissociation of H2O2: rotation-vibration coupling in the third OH stretching overtone state\n", "abstract": " Photofragment scalar pair correlations are determined following photodissociation of selected rovibrational levels of the third OH stretching overtone state of H2O2 at λ ≈ 748 nm. An anticorrelation between the rotational populations of the two sibling OH fragments is observed that is insensitive to the selected Ka  level in the range 1–5 with ⟨J⟩ ≈ 7–14. Simulations of the OH pair correlations, and previously measured v-j correlations and rotational distributions, indicate the breakdown of Ka  as a good quantum number in the interrogated third OH stretching overtone state of H2O2 and highlight the role of a-axis rotation in promoting rotation-vibration coupling.", "num_citations": "7\n", "authors": ["1046"]}
{"title": "Antibodies to AIDS-associated retrovirus (HTLV-III/LAV) in drug addicts from Vizcaya, Northern Spain\n", "abstract": " Serum samples from 313 asymptomatic intravenous (IV) drug users from Bilbao (Vizcaya, Vasque Country, Spain) were tested for antibodies to HTLV-III/LAV virus, the probable etiologic agent of the acquired immune deficiency syndrome (AIDS). Viral antibodies were assayed by ELISA test. 41.9% of the sera gave positive reactions. No seropositivity was detected among 22 normal blood donors, 58 chronic alcoholics, or 20 members of the Drug Control Center personnel. Virus specific reactions were confirmed by indirect immunofluorescence using an HTLV-III/LAV producer cell line, and by Western blotting. 55% of the ELISA-positive sera were also positive in Western blot assay. No differences in seropositivity by age or sex were observed but it increased with the period of parenteral drug use. Presence of antibody statistically correlated with the frequency of syringe sharing, confirming the transmission of viral …", "num_citations": "7\n", "authors": ["1046"]}
{"title": "Educational Opportunity for Underrepresented Minority Students in California: Comparisons with Other States.\n", "abstract": " This report compares California with other states in how the problem of low achievement by minority students is being confronted. The severity of the achievement gap is assessed, as well as the steps being taken to close the gap. The topics considered are:(1) the changing demographic profile of racial and ethnic minorities in California; graduation rates; correlates of the achievement gap such as unemployment, juvenile delinquency, and criminality; and the moral and practical needs for change;(2) educational disadvantages of ethnic and racial minority students (education level of parents of SAT examinees; family income; English deficiency; subjects studied in high school; proportion of examinees in a college preparatory program; and the deleterious effects of tracking);(3) minority representation and scoring on college entrance examinations (test scores by race and ethnicity; effects of increased minority representation among examinees; encouraging minority students to take college entrance tests);(4) the establishment of equitable college admissions requirements, with emphasis on California;(5) data from community colleges, four year colleges, graduate schools, and professional schools in California on minority representation and success; and (6) selected efforts to increase minority representation in California and other states. On many measures of progress toward equal representation among achievers, California was one of the best among comparable states. Black Californians are fairly well represented in colleges, but Hispanics are severely underrepresented at all levels of postsecondary education. It is noted that the numbers of …", "num_citations": "7\n", "authors": ["1046"]}
{"title": "Programa Gestion@: programa psicoeducativo en línea para adolescentes con elevada ansiedad\n", "abstract": " El presente artículo pretende exponer un programa piloto preventivo online para adolescentes con elevada ansiedad y comprobar su eficacia en tres casos que presentaban ansiedad subclínica. Para la participación en el programa se seleccionó de una escuela de Barcelona los adolescentes con elevada ansiedad, evaluada mediante el test SCAS (Spence Children’s Anxiety Scale), ausencia de comorbilidad con otros trastornos evaluados con YSR (Youth Self-Report) y que no habían recibido ningún tipo de tratamiento psicológico ni psiquiátrico. El programa psicoeducativo Gestion@ propone a través de una intervención online una psicoeducación de la ansiedad abarcando los diferentes componentes principales de la ansiedad (fisiológico, cognitivo y conductual). El adolescente realiza la intervención mediante cinco módulos que ha de ir completando cada uno en una semana. Completar cada módulo le lleva unos 20 minutos. Cada módulo está compuesto con información sobre la ansiedad y con actividades para comprobar su comprensión. Una vez finalizado cada módulo se le permite el acceso al siguiente, asegurando así el seguimiento. El adolescente tiene posibilidad de contacto online con un profesional en todo momento. Una vez terminado el programa se evalúa la ansiedad 6 y 12 meses después, evaluando también la satisfacción de cada módulo y del programa. En los tres casos que han participado en el estudio se han obteniendo unos buenos resultados. El siguiente objetivo es aplicarlo a una muestra más amplia, comprobar su eficacia e ir adaptándolo en función de los resultados.", "num_citations": "6\n", "authors": ["1046"]}
{"title": "Las metáforas y las adivinanzas: Estudio comparativo entre dos entornos escolares\n", "abstract": " En este artículo se explora cómo los niños comprenden las metáforas contenidas en las adivinanzas populares de la región central de México. Para ello, se seleccionaron dos escuelas (una escuela pública y una privada) de la ciudad de Querétaro, México. En cada escuela se entrevistaron treinta estudiantes (diez de segundo, diez de cuarto y diez de sexto de primaria), para un total de sesenta niños. Se les presentaron una serie de adivinanzas populares metafóricas con dos tareas: sin opciones y con opciones. Los resultados revelan que los niños de ambas escuelas muestran una tendencia evolutiva similar en el desarrollo de la comprensión de metáforas; esto se evidencia tanto en la coordinación como en el establecimiento de relaciones conceptuales parte/todo. Además, se encontró que la modalidad de la tarea tiene un impacto poderoso en ambas poblaciones. Finalmente, si bien se observan las mismas tendencias entre ambas escuelas, los niños de la escuela con un enfoque centrado en la comprensión y producción de textos obtuvieron mejores resultados en la resolución de las adivinanzas y en la comprensión de metáforas.", "num_citations": "6\n", "authors": ["1046"]}
{"title": "IEEE 1451 HTTP server implementation for marine data\n", "abstract": " Accessing real time data from a marine sensor network (MSN) can be a challenge. Open access to real time data using interoperable internet technologies is one of the major demands. The IEEE 1451 Smart Transducer Interface Standards [1, 2, 7] specify a standard API (application processor interface) process to discover and access sensor data by using an HTTP connection. This paper presents an HTTP Server for Marine Data coming from OBSEA [3, 5] cabled Observatory at the Western Mediterranean Sea. The implementation was using LabVIEW Web Services.", "num_citations": "6\n", "authors": ["1046"]}
{"title": "An analysis of sea ice condition to determine ship transits through the Northwest Passage\n", "abstract": " An analysis was carried out to determine the duration of the summer shipping season for deepwater vessels transiting through the Northwest Passage Route. The most likely route segment to obstruct shipping is in Viscount Melville Sound, which is typically characterized haracterized by the presence of high concentration mixtures of deformed, thick first year and multiyear ice. The period for ship transits through the Passage is determined from the computer-based based analysis of digital Canadian Ice Service weekly ice charts which hich are available from the late 1960’s to the present. Automated computer-based based algorithms were developed to estimate the number of, if any, weeks with ice conditions that would successfully allow transit. The results show a very large year to year variability ility in the duration of the summer shipping season with the trend towards slightly improving ice conditions. The possibility of future increases in old ice concentrations in western and central portions of Parry Channel due to an apparent trend towards more ore rapid passage of this old ice through the Queen Elizabeth Islands to the north may impede ship passages in the next decade by comparison with the last decade or two.", "num_citations": "6\n", "authors": ["1046"]}
{"title": "Preliminary results of a comparative yield study of induced sputum, string test, and gastric aspirate for the microbiological diagnosis of pulmonary tuberculosis in children\n", "abstract": " Preliminary Results Of A Comparative Yield Study Of Induced Sputum, String Test, And Gastric Aspirate For The Microbiological Di Page 1 / Thematic Poster Session / Sunday, May 16/8:15 AM-4:00 PM / Area A51 DIAGNOSIS OF LATENT AND ACTIVE TUBERCULOSIS L, Hall G (First Level), Morial Convention Center Preliminary Results Of A Comparative Yield Study Of Induced Sputum, String Test, And Gastric Aspirate For The Microbiological Diagnosis Of Pulmonary Tuberculosis In Children , EC Wilches-Luna , JM Hernández-Sarmiento , AL Casanova-Reynolds , N. Hernández , SP CM Perez-Velez1 2 3 4 3 Moreno-Ortega , SL Atehortúa-Muñoz , JC Rozo-Anaya , GI Mejía , V. Gómez , BE Ferro , AE Prada-Quiroz , CA 4 5 6 7 8 9 10 Moreira , W. Duque-Loaiza , M. Martínez , CL Daley , JA Robledo 11 12 8 13 14 National Jewish Health / University of Colorado, Denver, CO, United States of America, Universidad del …", "num_citations": "6\n", "authors": ["1046"]}
{"title": "Diagnóstico ergonómico de los trabajadores en la industria de la construcción\n", "abstract": " 2.1. ANTECEDENTES DE LA ERGONOMÍA EN LA LA INDUSTRIA DE LA CONSTRUCCIÓN 2.2. GENERALIDADES DEL DIAGNÓSTICO ERGONÓMICO 2.3. CONDICIONES DE SEGURIDAD 2.4. CONDICIONES DE HIGIENE 2.5. FACTORES DE RIESGO ERGONÓMICO 2.6. TÉCNICAS ERGONÓMICAS", "num_citations": "6\n", "authors": ["1046"]}
{"title": "Cloning, characterization and identification of the gene encoding phosphatidylinositol 4-kinase.\n", "abstract": " The vast majority of AIDS-related deaths are associated with opportunistic infections. For fungal infections, there are few effective antifungals, particularly for systemic use. The discovery that very low doses of the bleomycin family of anticancer chemical congeners compromise the integrity of fungal cell walls led to our approach to identify genes that complement-cell wall defects, and develop methods to facilitate the identification of new antifungals targeted to fungal cell walls. This report describes one of the genes cloned by complementation of the blm1-1 mutation of S. cerevisiae using a YCp50-based yeast genomic library. Characterization and identification of the gene were carried out using drug screening tests, Southern hybridization analyses, DNA sequencing and DNA sequence similarity searches in databases. The gene STT4, is essential for viability and encodes a phosphatidylinositol 4-kinase that plays an important role in the phosphatidylinositol-mediated signal transduction pathway required for cell wall integrity. Like blm1-1 mutant strains, stt4 cells arrest mostly in the G2/M phase of the cell cycle. Further studies using this approach should help us understand the role of PI4-K in maintaining fungal cell-wall integrity, identify additional genes affecting potential target structures in cell walls of opportunistic fungal pathogens in AIDS patients, and assist in drug discovery and antifungal drug design.", "num_citations": "6\n", "authors": ["1046"]}
{"title": "Chromosome numbers and geographical distribution of Ulex europaeus subsp. europaeus (Leguminosae)\n", "abstract": " Chromosome numbers are reported in Ulex europaeus subsp. europaeus (99 samples from northern Spain, France and Great Britain). Three levels of ploidy (diploid, tetraploid and hexaploid) have been detected; the diploid and tetraploid levels, hitherto unknown in this taxon, have been found exclusively in coastal areas of northern Spain and western France.", "num_citations": "6\n", "authors": ["1046"]}
{"title": "Fatigue resistance of press hardened 22MnB5 steels\n", "abstract": " In press hardened steels, fatigue behaviour is very sensitive to surface defects or irregularities, either intrinsic or introduced during trimming operations. This work addresses the understanding and prediction of fatigue resistance of press hardened steels from a fracture mechanics approach. The size of fatigue originating defects were evaluated and used to estimate the fatigue limit for different surface conditions (coated and uncoated), different coatings (Al-Si and Zn) and different edge condition (polished and mechanically trimmed). Good agreement was found between calculated and experimental values, which shows the potential of fracture mechanics to estimate the fatigue performance of press hardened steels.", "num_citations": "5\n", "authors": ["1046"]}
{"title": "Evaluación del efecto de una intervención de limpieza/desinfección sobre la incidencia de infecciones por microorganismos multirresistentes en una Unidad de Cuidados Intensivos\n", "abstract": " ObjetivoEvaluar el efecto de una intervención sobre la incidencia de infecciones nosocomiales (IN) por microorganismos multirresistentes en las Unidades de Cuidados Intensivos (UCI).Material y métodosSe realizó un estudio antes-después de una intervención para el control de un brote de Acinetobacter baumannii multirresistente (ABMR) en dos UCI. Durante el brote (del 22-12-06 al 12-2-07) se procedió al cierre y limpieza/desinfección de las salas y equipamiento de las dos UCI, con muestreo microbiológico antes y después. Se comparó la densidad de incidencia de IN por microorganismos multirresistentes entre los pacientes ingresados: preintervención (del 1-3-2006 al 15-12-2006) y posintervención (del 1-3-2007 al 15-12-2007). Para comprobar si existían diferencias estadísticamente significativas se calculó la razón de tasas (RT) y su intervalo de confianza (IC) al 95%. El nivel de significación …", "num_citations": "5\n", "authors": ["1046"]}
{"title": "Chromosome numbers and geographic distribution of Ulex gallii and U. minor (Leguminosae)\n", "abstract": " Chromosome numbers from 188 samples of the Ulex gr. gallii-minor from Portugal, Spain, France and Great Britain are reported. The gametic and somatic chromosome numbers are n = 16 and In = 32, respectively, in all samples of U. minor. Three levels of ploidy (diploid, tetraploid and hexaploid) have been detected in samples of U. galli, sensu lata from N Spain. In samples from Brittany and Great Britain, only the tetraploid level has been found. New data are compared with all previous reports for the species of this group of gorses.", "num_citations": "5\n", "authors": ["1046"]}
{"title": "Cognitive processing requirements of constructed figural response and multiple‐choice items in architecture assessment\n", "abstract": " Contrasts between constructed response items and stem‐equivalent multiple‐choice counterparts have yielded only a few weak generalizations. Such comparisons typically have involved averaging item characteristics, and this aggregation has masked differences in statistical properties at the item level. Moreover, even aggregated format differences have not been explained in terms of differential cognitive processing demands of the items. In this paper, we examine item‐level differences between figural response items and their multiple‐choice counterparts in the domain of architecture. The figural response item format is an assessment form that uses figural material (such as, graphs, illustrations, and diagrams) as item stimuli and the medium through which knowledge and skill are demonstrated. We first examine item‐level format differences in difficulty and then ask whether there are corresponding differences …", "num_citations": "5\n", "authors": ["1046"]}
{"title": "¿ Es necesario conocer qué trabajadores son portadores de SARM en contacto con enfermos oncológicos?\n", "abstract": " Nuestro objetivo fue determinar la prevalencia de Staphylococcus aureus resistente a meticilina (SARM) en los trabajadores que tuvieron contacto directo con enfermos oncológicos infectados por SARM e ingresados en la unidad de cuidados intensivos del Instituto Valenciano de Oncología. La prevalencia de colonización por SARM se estudió en 62 trabajadores. Las muestras obtenidas de las fosas nasales y faringe (n= 124) fueron incubadas durante 24 horas en medio de transporte Amies Viscosa (Eurotubo®) y después sembradas en agar chocolate, agar MRSA II y caldo Brain Heart Infusion. Las colonias que se identificaron mediante la tinción de Gram como cocos gram-positivos con disposición en racimos, catalasa positiva y coagulasa positiva, se procesaron para estudio de sensibilidad mediante el método de Kirby-Bauer y prueba de cribado de la meticilina (10 μg de Oxoid®) en Mueller-Hinton …", "num_citations": "4\n", "authors": ["1046"]}
{"title": "The effects of ST Math on standardized test scores: A randomized field study\n", "abstract": " • The ST Math program significantly improved scores on the math CST after controlling for markers of SES and linguistic skill• 0.42 effect size is “substantively important” by What Works Clearinghouse Standards• Evidence for the impact of Spatial Reasoning in Mathematics• Evidence for the effectiveness of ST Math software• No significant interaction effects; however:• Grade: CST tests vary by grade so students received different tests• English Learner: CST as a language based test might bias results• National School Lunch Program: NSLP may not be most reliable measurement of SES (Harwell & LeBeau, 2010)", "num_citations": "4\n", "authors": ["1046"]}
{"title": "A mutant approach and molecular strategy to study fungal cell walls.\n", "abstract": " The current study describes recombinant plasmids which complement the hypersusceptibility to killing bleomycin of blm1-1 mutant cells of Saccharomyces cerevisiae, and a strategy developed and used to recover active clones from a stable yeast genomic library. The resistance of a spontaneous revertant isolated from the original blm1-1 mutant strain and of mutant cells transformed with each of several recombinant plasmids which complemented the recessive blm1-1 mutation was comparable to the resistance of the parental (non-mutant) strain from which the original blm1-1 mutant was derived. The strategy for cloning S. cerevisiae DNA was based on complementation and in situ hybridization. This strategy employed 32P-labelled 6.6-kb BamHI and 3.8-kb BamHI-ClaI probes from a cloned DNA fragment to recover clones which either fully or partially complemented the hypersensitivity of mutant cells to killing by bleomycin. This method considerably reduced the time and effort required to recover biologically active clones from a genomic library.", "num_citations": "4\n", "authors": ["1046"]}
{"title": "Eficiencia y efectividad del servicio de catálogo colectivo de publicaciones seriadas\n", "abstract": " Se realiza un estudio de la eficiencia y efectividad del servicio de catálogo colectivo de publicaciones seriadas del Sistema Nacional de Información de Ciencias Médicas de Cuba, en el que se consideran los indicadores costo-tiempo-productividad para medir la eficacia. La efectividad se evalúa mediante el análisis de la necesidad. Los resultados obtenidos muestran valores positivos en cuanto a la eficiencia, aunque en relación con la efectividad no son tan satisfactorios. Se ofrecen los resultados en forma de números absolutos y en valores porcentuales, que se representan en gráficos estadísticos y tablas.", "num_citations": "4\n", "authors": ["1046"]}
{"title": "FIGURAL‐RESPONSE ASSESSMENT: SYSTEM DEVELOPMENT AND PILOT RESEARCH IN CELL AND MOLECULAR BIOLOGY\n", "abstract": " The purpose of the GRE figural‐response project was to design a prototype assessment system for delivering and scoring figural‐response items in the domain of cell and molecular biology, and to begin to investigate properties of the item format This report describes progress to date in an effort that is intended to be continuous and lead to program implementation. We first describe features of the delivery system and give sample items; ancillary developments, such as a tutorial, are also noted. Then, findings from a pilot research study are described. The essence of the pilot study was to examine the relationships between two item types (figural‐response and open‐ended verbal questions) and measures of figural and verbal ability. The data hint that whereas verbal items draw from verbal ability, figural‐response items draw from figural and verbal ability. The report concludes with a discussion of possible new …", "num_citations": "4\n", "authors": ["1046"]}
{"title": "Automated scoring of paper-and-pencil figural responses\n", "abstract": " Large-scale testing is dominated by the multiple-choice question format. Widespread use of the format is explained, in part, by the ease with which multiple-choice items can be scored automatically. This article examines automated scoring procedures for an alternative item type: figural response. Figural response items call for the completion or modification of figural material, including illustrations, diagrams, and graphs. Nineteen science items were written in cooperation with the National Assessment of Educational Progress and printed with a special ink, invisible to scanning equipment. The items were answered with pencils; response sheets were then scanned and the resulting data were processed by computer-based scoring algorithms. Implications of this technology for the future of large-scale testing are discussed.", "num_citations": "4\n", "authors": ["1046"]}
{"title": "Investigations pré-chirurgicales\n", "abstract": " Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS", "num_citations": "4\n", "authors": ["1046"]}
{"title": "Declaration on ethics and integrity in university teaching\n", "abstract": " From a social perspective, the democratization of education has increased the number of university students, diversified their profiles, accentuated pluralism, made educational trajectories more flexible, increased expectations, and increased the number of university professors and specializations. In addition, it has increased educational levels, making relations more complex and communication more difficult. At the same time, the teaching of academic knowledge has become separated from educating students for the purpose of obtaining employment. However, with the range of jobs rapidly transforming, higher education has had to continually reformulate its specialised offerings, increasingly ignoring the idea of the education of responsible citizenship and, instead, addressing immediate and changing functional necessities rather than permanent human necessities. From an economic perspective, the economic crisis in a context of a growth in the number of institutions of higher education has led to a decrease in public financing, which has in turn led public universities to find other forms of financing, less dependent on the state. At the same time, the proliferation of private universities has increased competition between schools while financial deficits have generated the adoption of forms of organisation and management based on profit. Thus, the growing demand to adapt to the market has led to a growth in the supply of new courses and degrees and the capture of resources through the creation of specialized research centres and the search for economically profitable projects. In this context, humanistic education is atrophying while technical …", "num_citations": "3\n", "authors": ["1046"]}
{"title": "Effect of once-daily generic ciclesonide on exhaled nitric oxide in atopic children with persistent asthma\n", "abstract": " BackgroundCiclesonide (CIC) is an effective inhaled corticosteroid for treating asthmatic children. However, its effect on airway inflammation assessed by the fraction of exhaled nitric oxide (FENO) in children with persistent asthma is virtually unknown. We aimed to assess the effect of once-daily generic CIC, 80 or 160 μg, on FENO, lung function, asthma control and bronchial hyperresponsiveness, in atopic children with persistent asthma.MethodsThis was a 12-week, randomised, double-blind, parallel-group study. Sixty children with mild-to-moderate persistent asthma were recruited. Changes in FENO, asthma control score, lung function (FEV1) and bronchial hyperresponsiveness to methacholine (BHR) were used to assess the effects of both CIC doses. Non-normally distributed variables were log-transformed to approximate normality, and parametric tests were used for comparisons within and between groups …", "num_citations": "3\n", "authors": ["1046"]}
{"title": "Is it necessary to know which workers are carriers of MRSA in contact with cancer patients?\n", "abstract": " Our objective was to determine the prevalence of methicillin-resistant Staphylococcus aureus in workers who had direct contact with oncologic patients infected with MRSA and admitted to the intensive care unit of the Valencian Institute of Oncology. A study of prevalence of MRSA colonization of 62 workers was performed. Samples were taken from nose and pharynx in each of the workers. After 24 hours of incubation in Amies transport medium Viscose (Eurotubo®), 124 samples were seeded (N= 124) in chocolate agar agar, MRSA II and BHI broth (Brain Heart Infusion). Those colonies that were identified by Gram stain gram-positive cocci in clusters available, catalase positive and coagulase positive were processed for study of sensitivity by Kirby-Bauer method and screening test for methicillin (10μg of Oxoid®) on Mueller-Hinton (Becton-Dickinson®, BD), supplemented with NaCl (2%). Those confirmed MRSA isolates, he returned to perform sensitivity study by microdilution (MicroScan®, Siemens) to determine the MIC (mg/L). The prevalence of methicillin-resistant Staphylococcus aureus (MRSA) was 1.61%(1) and 12.90%(8) for methicillin-sensitive Staphylococcus aureus (MSSA), from nostrils. The measures implemented were: nasal application of mupirocin to the worker colonized control isolation measures in infected patients and indoctrination of the personnel involved.", "num_citations": "3\n", "authors": ["1046"]}
{"title": "Classroom teachers' view of a bilingual program\n", "abstract": " This study made public classroom teachers' views about a bilingual program in their school. Twelve elementary classroom teachers in a large urban school district were interviewed and observed to gain a personal view of their perceptions of the implementation of a bilingual program. The student population in this school is predominately Hispanic and linguistically diverse.", "num_citations": "3\n", "authors": ["1046"]}
{"title": "Chronic copper poisoning in sheeps by consumption of sunflower-meal\n", "abstract": " Chronic poisoning is not uncommon in sheep.  Moreover, sheep is the animal specie most susceptible to this form of copper poisoning.  In last year, we have studied two clinical cases of chronic copper poisoning by consumption of sunflower-meal in this specie.  Information about epidemiological data, clinical symptoms and post mortem findings were obtained in the field.  134 sheeps fed only with sunflower-meal during 5 months developed the disease. However, 114 sheeps that pastured did not develope it.  Ill animals showed anorexia, haematuria, immediately icterus, and finally incoordination, ptyalism, and, in some animals, diarrhoea.  Treatment was instaured using ammonium molybdate and sodium sulphate.  A total of 29 animals died in 30 days approximately.  The main post mortem findings were: generalized icterus, epicardial haemorrhage, hydropericardium, infarction and haemorrhage of lymph nodes, yellow/red and friable liver, distended gall-bladder with dense and dark bile, haemorragic gastrointestinal tract, hypertrophic and haemorragic kidneys, and friable spleen.  Samples of liver and kidney of several animals and samples of 5 different feeding-stuffs was obtained.  We measured the copper concentrations in all samples.  Mean copper concentrations in liver was 200 ppm (wet weight), and in kidney 35 ppm (wet weight).  The copper concentrations in the different feeding-stuffs were ranged between 1 and 10 ppm.  We studied the copper exposure in these animals by the consumption of the different feeding-stuffs and we concluded that the copper contained in two sunflower-meals was the cause of this poisoning.", "num_citations": "3\n", "authors": ["1046"]}
{"title": "Résultats\n", "abstract": " Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS", "num_citations": "3\n", "authors": ["1046"]}
{"title": "Figural response in science and technology testing\n", "abstract": " The changing role of testing demands new assessment methods. One such method is the figural response item format. Figural response items differ from traditional test items in two fundamental ways. First, they are not multiple-choice items; rather, they call for constructed responses swers generated by the student rather than chosen from a list of options. Second, the student demonstrates understanding by carrying out some operation on figural media such as graphs, illustrations, and diagrams, rather than on words or numbers.Both features of figural response items have potential benefits for testing. For example, the student's constructed response might be a closer approximation of the desired skill than would be the selection of a multi-ple-choice option. Expression of understanding through figural repre-sentations might enable the measurement of knowledge that is difficult or impossible to express verbally or numerically. In addition, people who tend to think pictorially might find expression of their knowledge facili-", "num_citations": "3\n", "authors": ["1046"]}
{"title": "Photofragment mapping of intramolecular motion\n", "abstract": " The intramolecular motion in selected rovibrational levels in HOOH and HOOD, populated by tunable, pulsed laser excitation in the third O-H overtone band, has been probed via ‘photofragment mapping’ following secondary photon absorption. Quantum state distributions, vector correlations and vibrational {vx, v2) and rotational jOC CZV2)) OH(D) fragment pair correlations have been obtained using polarized, Doppler resolved laser induced fluorescence techniques. The results provide quantitative estimates of the extensive intramolecular redistribution of energy among the overtone levels and highlight the role of a-axis rotation in promoting rotation—vibration coupling.", "num_citations": "3\n", "authors": ["1046"]}
{"title": "Preliminary studies on the antibacterial, insecticidal and toxicological effects of the Chilcuan root (Helipsis longipes)\n", "abstract": " [Preliminary studies on the antibacterial, insecticidal and toxicological effects of the Chilcuan root (Helipsis longipes)] FAO_logo home-icon English Español Français العربية 中文 Русский home-icon Translate with Google Access the full text NOT AVAILABLE Lookup at Google Scholar google-logo Bibliographic information Language : Spanish Type : Summary In AGRIS since : 1992 Volume : 20 Issue : 2 Start Page : 151 End Page : 156 All titles : \" [Preliminary studies on the antibacterial, insecticidal and toxicological effects of the Chilcuan root (Helipsis longipes)] \" Save as: AGRIS_AP RIS EndNote(XML) [Preliminary studies on the antibacterial, insecticidal and toxicological effects of the Chilcuan root (Helipsis longipes)] Loading... Paper Written Paper [Preliminary studies on the antibacterial, insecticidal and toxicological effects of the Chilcuan root (Helipsis longipes)] [1989] Romero R, CM Del Castillo R, AR Martinez …", "num_citations": "3\n", "authors": ["1046"]}
{"title": "Research of writing in primary education in Chile: A review of decade (2007-2016)\n", "abstract": " The review provides a synthesis of the basic education writing research carried out during the 2007-2016 period in Chile. Through the integrative review method, 27 academic sources were identified and classified into two main areas of study: writing learning and writing instruction. In the area of student writing learning, research has focused mainly on the analysis of linguistic knowledge (spelling and sentence production) and the evaluation of the quality of texts, mostly in narrative texts, and to a lesser extent expository and opinion. In the area of teaching writing, attention has been focused mainly on understanding the teaching practices of story writing or opinion texts. Less attention, they have dedicated to the study of the practices of evaluation of the writing and of the needs of initial and continuous formation of the professors related to the didactics of the writing. It also highlights the absence of national surveys …", "num_citations": "2\n", "authors": ["1046"]}
{"title": "Molecular Adsorbent Recirculating System Treatment Can Reduce Blood Levels of N-Acetylcysteine in Patients With Acetaminophen Overdose\n", "abstract": " BackgroundAcetaminophen poisoning continues to be a major cause of liver failure that can lead to liver transplantation. N-acetylcysteine (NAC) is the cornerstone of treatment. Some authors use a Molecular Adsorbent Recirculating System (MARS) system in acetaminophen poisoning. It is reported that the MARS system eliminates acetaminophen more efficiently than conventional dialysis. It is theoretically possible that treatment with MARS administered after NAC will increase the effectiveness of treatment.Case ReportsThe first patient, a woman of 14 years old, presented blood levels of 112 mg/dL 12 hours after ingestion of 15 g of acetaminophen. Treatment with NAC was initiated. At 17 and 23 hours after ingestion, blood levels were 23.5 μg/mL and 5.9 μg/mL, respectively. The second patient, a woman of 28 years old, presented blood levels of 115 mg/dL 4 hours after ingestion of 40 g of acetaminophen …", "num_citations": "2\n", "authors": ["1046"]}
{"title": "Use of video game technology for geriatric total pain management education: response of interdisciplinary healthcare students (QI821)\n", "abstract": " BackgroundPain management curriculum is rarely case based and integrative, leaving practitioners unprepared to manage an interdisciplinary and patient-centered approach to pain management. With a growing geriatric population suffering from pain, the PAIN-ME-FREE online video game was developed by UTHealth San Antonio affiliates. The game educates future healthcare providers on total pain management of elders using a multidisciplinary approach.", "num_citations": "2\n", "authors": ["1046"]}
{"title": "Crisis humanitaria y escasez de Medicamentos: Guía práctica para los pacientes con Diabetes Mellitus e Hipertensión Arterial\n", "abstract": " La crisis humanitaria que aqueja al país, tiene entre sus áreas de más vulnerabilidad, la alimen-tación y la ausencia de los medicamentos. Los pacientes tienen generalmente algún conocimiento sobre la alimentación, lo cual se puede trabajar educándolos en la consulta externa, orientándolos en la distribución de sus recursos en los alimentos mas importantes y como racionarlos para obtener un mayor beneficio. En cuanto a los medicamentos, la situación de escasez de médicos, pacientes y familiares, los ha llevado a improvisaciones de prescripción y automedicación, cuyas consecuencias pueden ser fatales. Entre las conductas mas frecuentes que se observan, están la disminución de la dosis, el intercambio de fármacos sin asesoría alguna, la sustitución de la medicación usual por medicina alternativa y otros.", "num_citations": "2\n", "authors": ["1046"]}
{"title": "Hipertensión arterial en hemodiálisis. Valoración terapéutica\n", "abstract": " CONCLUSIONES La HTA se controla en el 97% de los casos en HD con VFR y/o tratamiento farmacológico asociado.", "num_citations": "2\n", "authors": ["1046"]}
{"title": "Efecto antimitótico y citotóxico del extracto etanólico de Genipa americana L. sobre tejido meristematico de Allium cepa L. y cultivo celular NCTC-929\n", "abstract": " Anti-mitotic and Cytotoxic effects of ethanolic extracts of Genipa americana L. on meristhematic tissue of Allium cepa L. and NCTC-929 cell cultures. The effects of ethanolic extracts of Genipa americana L.(Ñandypa) on cell replication cycle were evaluated using the Allium test and NCTC-929 fibroblast cell cultures. The mitotic index, the mitosis phases index, the extent of the cell cycle and the metabolic cytotoxicity were measured respectively. The analysis verified that the cells under treatment had a lower mitotic index; thus altering the cell kinetics. Interchromosomal bridges in anaphase, as well as lagging chromosomes and chromosomal fragments were registred.", "num_citations": "2\n", "authors": ["1046"]}
{"title": "Non-invasive estimation of firmness in apple fruit using VIS/NIR spectroscopy\n", "abstract": " Better and steady fruit quality evaluation at harvest is a major challenge for commercial growers of apples in Denmark. Those fruits not meeting the requirements for the fresh market traditionally go to the juice concentrate industry where low cost products are obtained. Special fruit qualities are needed to develop commodities that can obtain a premium added value on the market. Nowadays in the food industry, quality evaluation is commonly performed non-destructively by means of optical sensors such as spectrometers, hyperspectral and multispectral cameras, that allow rapid measurements of fruit composition. These methods are desirable to replace the traditional destructive ones in terms of optimization of resources and sampling. In preliminary experiments, we tested visible/NIR spectroscopy for its ability to predict firmness, which is a relevant fruit quality trait connected to juice making as well as for eating …", "num_citations": "2\n", "authors": ["1046"]}
{"title": "Traumatismo cráneo-encefálico en urgencias\n", "abstract": " Se define el traumatismo craneoencefálico (TCE) como toda lesión orgánica o funcional del contenido craneal por una violencia exterior. Son la primera causa de mortalidad en niños mayores de un año en países desarrollados, siendo también causantes de retraso mental, epilepsia y discapacidad física. La edad es un factor determinante de mortalidad siendo en los niños menores de un año doble que en los de 1 a 6 años y triple que los de 6 a 12 años. En general 1/3 de las muertes acaecidas en niños de 1 a 14 años son debidas a accidentes, y de ellas el 50% a TCE. La mortalidad global de los TCE varía entre el 5% y el 20%.", "num_citations": "2\n", "authors": ["1046"]}
{"title": "Cognitive-Developmental Hierarchies: A Search for Structure Using Item-Level Data.\n", "abstract": " Item-level statistics from ability and achievement tests have been underutilized as sources of data for building models of cognitive development. How item data can be used to build a cognitive-developmental map of proportional reasoning is demonstrated. The product of the analysis is a cognitive hierarchy with levels corresponding to categories of cognitive demand established in prior theory. Levels of the constructed hierarchy also correspond to predictions of the working memory demands of the items, and to the measured memory span of examinees. The techniques used in this study could be used more generally to model cognitive-developmental trajectories within other topics and domains. These techniques could be applied to numerous extant assessment databases to identify important conceptual systems in mathematics, science, and other fields, and to construct cognitive-developmental hierarchies within those systems. An appendix contains a test of proportional reasoning.(Contains 2 tables, 2 figures, and 34 references.)(Author/SLD)", "num_citations": "2\n", "authors": ["1046"]}
{"title": "A Taxonomy of Methods for Demonstration of Proficiency in a Figural Medium.\n", "abstract": " The taxonomy presented in this paper lends structure to the range of tasks or problems possible within an interactive graphical medium. Some 70 items from a testing project were the basis for forming the categories described in the taxonomy. Items were drawn from science and technology domains. The categorical scheme was refined iteratively by two raters until it was able to accommodate all items. The framework is intended to have utility in the design of problems cast within an interactive graphical medium. The following item types are included:(1) point to image element;(2) evaluate image;(3) show direction/path;(4) show height, extent, or boundaries;(5) assemble elements; 6) indicate categorical, ordinal, or functional relationships; and (7) indicate continuous relationships.(Contains one table and eight references.)(Author/SLD)", "num_citations": "2\n", "authors": ["1046"]}
{"title": "Survey and identification of major pests attacking jackfruit and their possible biological control in Eastern Visayas [Philippines]\n", "abstract": " The pest attacking jackfruit in Eastern Visayas [Philippines] were identified from the provinces of Leyte, Southern Leyte, Samar, Northern Samar and Eastern Samar. The monthly survey and sampling of pests from the selected municipalities of the province led to the identification of the 12 insect pests and 12 diseases attacking the crop in these areas. These identified pests were present throughout the year infesting the crop at various stages of plant growth and plant parts. Fruit fly (Bactrocera umbrosa) and unidentified fruit borers dominated the insect pests associated with jackfruit in terms of counts and damage inflicted by the insects to the crop. Likewise, inflorescence rot (Rhizopus nigricans) and fruit decay (Diplodia artocarpi) severely infected the fruitlets. The insect feedings and infections of the fungal pathogens considerably destroyed the fruits of the crop. An attempt to identify some biological control agent of the major pests of the crop was done. Relative to the preliminary findings, a hymenopterous parasites and an entomophagous fungi were identified associated with the larval stage of the fruit borer and fruit fly", "num_citations": "2\n", "authors": ["1046"]}
{"title": "Liver dysfunction associated with total parenteral nutrition\n", "abstract": " An evaluation is made of liver malfunctions in patients receiving TPN over a period of> or= 15 days between 1989 and 1991. Use was made of the monitoring records on patients undergoing TPN and, subsequently, of clinical records, with analysis of diagnoses and type of intervention, the biochemical parameters (SGOT, SGPT, GGT, FA, LDH, and total and direct bilirubin), and the type and degree of malnutrition, nutritional backup, associated medication, etc. A group of patients was excluded from the study on the basis of the following criteria: liver-biliary disease, cardiac insufficiency, liver metastasis, sepsis, kidney insufficiency and hepatotoxic drugs. Of 237 patients, 75 (31.64%) had liver alterations: following application of the exclusion criteria, 24 patients (10.12%) were taken with liver alterations attributable to the TPN. Macro-and micronutrients were included in the TPN. We found no relation between the kcal/kg of weight, nor with the quantity of glucose and fats nor of nitrogen, calculated according to individual requirements: they remained within the limits established. No serious case of cholestatic jaundice was encountered. Moderate to severe malnutrition was found in 50% of patients, so that this must be treated as a risk factor. GGT is the first enzyme to alter; this occurred in the largest proportion of patients (91.66%), followed by SGPT. FA and GOT are altered in the same percentage of patients. Biochemical parameter monitoring is essential in patients undergoing TPN, not only for appraisal of the nutritional state but also to prevent or correct potential serious metabolic complications.", "num_citations": "2\n", "authors": ["1046"]}
{"title": "Fungaemia caused by rare yeasts: incidence, clinical characteristics and outcome over 10 years\n", "abstract": " Sir, We have read with interest the article recently published in JAC, 1 which analysed a large series of uncommon yeast fungaemias in France. We are also concerned about the increasing incidence of these episodes, mainly reported in immunosuppressed patients, 2, 3 which could potentially change future strategies for antifungal management. Therefore, we would like to add our experience from a large tertiary hospital in Spain. We analysed all episodes in which a rare yeast was isolated from blood cultures from January 2007 to December 2016, according to recent guidelines’ definitions, 4 which in summary consider rare yeast those different from Candida spp. and Cryptococcus neoformans/gattii that cause invasive infections in humans. All isolates were identified by sequencing of the ITS1-5.8 S-ITS2 region. In vitro susceptibility testing was performed according to the EUCAST EDef 7.2 procedure. Given the …", "num_citations": "1\n", "authors": ["1046"]}
{"title": "Misión imposible\n", "abstract": " Este relato es fruto de una experiencia llevada a cabo en la UPM con alumnos de primer curso en la asignatura de Cálculo. Una historia que tiene como protagonista al agente 00π que gracias a sus conocimientos matemáticos logrará superar las dificultades de una difícil misión.", "num_citations": "1\n", "authors": ["1046"]}
{"title": "Commentary on Part III: Differential Achievement: Seeking Causes, Cures, and Construct Validity\n", "abstract": " The four chapters in this section document the pervasiveness of the achievement gap, especially its manifestations in college matriculation, success, and graduation. The papers explore possible causes of the gap, and consider what can be done to combat longstanding disparities among population groups identified by race and ethnicity. All four papers implicitly reject simplistic arguments that find obvious villains and straightforward prescriptions. They scrutinize the proposal that academic aptitude, as indexed by the SAT I, directly reinforces (if not causes) differential achievement, and that if academic aptitude were replaced with something else, then significant strides could be made toward parity in college success and other outcomes of interest. Collectively, the authors dismiss this thesis and, instead, implicitly advance two major themes:(1) the achievement gap among racial/ethnic and socioeconomic groups is …", "num_citations": "1\n", "authors": ["1046"]}
{"title": "Presencia natural de nematodos entomopatógenos en avellanares y castañares de Asturias y Cataluña\n", "abstract": " RESULTADOSTan sólo una muestra del total de los aislados pertenece al género Heterorhabditis, concretamente a la especie H. bacteriophora, procedente del avellanar catalán. El resto de cepas pertenecen al género Steinernema, siendo S. feltiae la especie más abundante.", "num_citations": "1\n", "authors": ["1046"]}
{"title": "An Evaluation of HEVC using Common Conditions\n", "abstract": " A new video coding standard, HEVC (High Efficiency Video Coding), has been recently developed. In this paper we will analyze its performance and how it behaves under packet loss conditions, which is a typical scenario for multimedia transmission over wireless networks. We have modified the reference software in order to make it resistant to data loss and we have measured the impact of these losses at different coding settings. For the sake of comparability we have used the Common Conditions which are oftenly used in the developement process to measure the improvements that new contributions produce in the standard.", "num_citations": "1\n", "authors": ["1046"]}
{"title": "Decisiones compartidas en la enfermedad avanzada\n", "abstract": " -En el proceso de comunicación no solo están en juego conocimientos técnicos y científicos sino también valores: debemos saber explorar los valores del enfermo para poder ayudarle en la toma de decisiones. Y a la vez se nos pedirá en muchas ocasiones que transmitamos nuestros propios valores:“Doctor,¿ qué haría usted si fuera su padre?.”-En todo este proceso de comunicación tendremos en cuenta que la incertidumbre tanto del profesional como del paciente que recibe malas noticias, con respecto a múltiples aspectos, será una constante: indicación o no indicación de un tratamiento paliativo (ej.¿ me someto a una cirugía con intención paliativa?¿ me compensarán los efectos de una quimioterapia o radioterapia paliativas?¿ podré aguantar todo el proceso sin ser una carga?¿ cuánto tiempo me queda con ello o sin ello?…). Debemos aprender a manejar todo el proceso dentro de unos márgenes aceptables de incertidumbre. Más allá de los elementos racionales deberemos saber estar atentos a los elementos emocionales de toda esta información, vinculados muchas veces a la incertidumbre y otras a los miedos profundos a la muerte que pronto llegará. Autonomía del paciente y planificación anticipada En el modelo de relación sanitaria deliberativo, el paciente es el “protagonista”, el sujeto fundamental del proceso y el profesional es el “coprotagonista”. Las decisiones se tomarán de manera compartida pero poniendo la autonomía16 por delante de la beneficencia. La autonomía del paciente no debe centrarse en la firma de documentos escritos (documentos de Consentimiento informado) para procedimientos y/o …", "num_citations": "1\n", "authors": ["1046"]}
{"title": "Efficient sampling to determine the distribution of fruit quality and yield in a commercial apple orchard\n", "abstract": " In situ assessment of fruit quality and yield can provide critical data for marketing and for logistical planning of the harvest, as well as for site-specific management. Our objective was to develop and validate efficient field sampling procedures for this purpose. We used the previously reported ‘fractionator’tree sampling procedure and supporting handheld software (Gardi et al., 2007; Wulfsohn et al., 2012) to obtain representative samples of fruit from a 7.6-ha apple orchard (Malus× domestica ‘Fuji Raku Raku’) in central Chile. The resulting sample consisted of 70 fruit on 56 branch segments distributed across 36 trees for yield estimation. A sub-sample of 56 fruit (one per branch segment) was removed; and, individual fruit mass, firmness and contents of malic acid, soluble solids and starch were measured in the laboratory. The data also were used to obtain an imprecise, but unbiased, estimate of yield. Estimated …", "num_citations": "1\n", "authors": ["1046"]}
{"title": "Absentismo y Abandono en primer curso de grado en la universidad Politécnica de Madrid: Decálogo de prácticas para su reducción\n", "abstract": " El presente trabajo se enmarca en el esfuerzo que la Universidad Politécnica de Madrid (UPM) está realizando para analizar las causas y prevenir el abandono de la titulación por parte de los alumnos de primer curso de Grado. El proyecto transversal de innovación educativa (PIE)“Análisis del absentismo y abandono en las titulaciones de Grado de la UPM”, llevado a cabo en el curso 2011-12, se alinea con ese propósito y la comunicación describe en concreto los resultados del PIE relativos a la identificación y selección de prácticas docentes que pueden contribuir a la consecución del objetivo primordial del mencionado proyecto. En análisis previos realizados en el mismo, se evidenció que el absentismo de los alumnos a clase era un predictor del posterior abandono; por ello, en una primera fase se contactó con un grupo numeroso de docentes de la UPM para localizar, a través de un formulario, los profesores que presentaran un bajo índice de absentismo en sus clases. A continuación se realizaron entrevistas a los profesores seleccionados que han permitido identificar un conjunto de acciones que los profesores utilizan para motivar el aprendizaje y seleccionar un “decálogo de prácticas” que recoge las actuaciones (actividades, actitudes, etc.) docentes más valoradas/utilizadas por estos profesores “estrella”. Todas ellas están relacionadas con las habilidades comunicativas del profesor (entusiasmo, captación de la atención, presentación de contenidos), con el clima creado en clase (respeto, confianza, expectativas de aprobar si hay esfuerzo) y con la información ofrecida al alumno (recursos y criterios de evaluación). El análisis …", "num_citations": "1\n", "authors": ["1046"]}
{"title": "Prevención y control de la infección relacionada con la asistencia en el ámbito sociosanitario\n", "abstract": " La infección relacionada con la asistencia sanitaria (IRA) en los centros sociosanitarios (CSS) es uno de los principales problemas relacionados con la seguridad del paciente. En los últimos años, ha aumentado el componente agudo en los centros sociosanitarios. Los residentes de los CSS tienen un riesgo similar de desarrollar una IRA a de los pacientes de los hospitales agudos. Se ha publicadoun gran número de información y trabajos sobre programas de control de la infección en CSS. Las recomendaciones desarrolladas por los programas de control de infección en CSS están basadas en opiniones de expertos. Llama la atención la falta de meta-análisis y estudios controlados en este campo. El desarrollo de sistemas de vigilancia, con definiciones adaptadas de IRA en los CSS, permitela recogida sistemática de información, análisis de datos y uso de información orientado a mejorar los cuidados de los pacientes, reducir la incidencia prevenible de IRAS y comparar resultados concentros con características parecidas (AU)ABSTRACTThe Health Care Associated Infections (HCAI) in long-term care facilities (LTCFs) is one of the main problems related to patient safety. In recent years, acute health conditions have increased amongst nursing home residents. LTCF residents have a risk of developing HCAI that approaches that seen inacute care hospital patients. A great deal of information has been published concerning infections inthe LTCF, and infection control programs are nearly universal in that setting. Recommendations are developed for long-term care infection control programs based on expert opinions. The lack of …", "num_citations": "1\n", "authors": ["1046"]}
{"title": "Relación entre atributos sensoriales y parámetros fisico-químicos indicativos de la calidad de la variedad Mauricio\n", "abstract": " Relación entre atributos sensoriales y parámetros fisico-químicos indicativos de la calidad de la variedad Mauricio - Dialnet Ayuda ¿En qué podemos ayudarle? × Buscar en la ayuda Buscar Consultar la ayuda Ir al contenido Dialnet Buscar Revistas Tesis Congresos Ayuda Relación entre atributos sensoriales y parámetros fisico-químicos indicativos de la calidad de la variedad Mauricio Autores: MT Martínez, Félix Romojaro Almela, María Teresa Pretel Pretel, A Cascales Localización: Alimentación, equipos y tecnología, ISSN 0212-1689, Año nº 23, Nº 195, 2004, págs. 85-91 Idioma: español Texto completo no disponible (Saber más ...) Fundación Dialnet Acceso de usuarios registrados Imagen de identificación Identificarse ¿Olvidó su contraseña? ¿Es nuevo? Regístrese Ventajas de registrarse Dialnet Plus Más información sobre Dialnet Plus Opciones de compartir Facebook Twitter Opciones de entorno …", "num_citations": "1\n", "authors": ["1046"]}
{"title": "Lightning activities in Venezuela using the Lightning Imaging Sensor of TRMM NASA project\n", "abstract": " In this work, handlings of the NASA LIS data were presented, to establish the lightning activities in Venezuela, between years 1998 and 2002. The main objective is to obtain the most relevant data, discerning by geopolitical State and month along the year. With this processing, is possible to show the geographical areas with the highest lightning activity and the variation of this characteristic with the months along the years considered. This information is very important to engineers and Scientifics to know the most recent data of the lightning by Venezuelan Regions and specifically for high risk zones, like that involved in oil exploration and production facilities. Finally, an iso-keraunic map, was obtained.", "num_citations": "1\n", "authors": ["1046"]}
{"title": "Poisoning by organophosphate insecticides. Epidemiology and prevention\n", "abstract": " In an agrarian environment, exposure to anticholinesterasic insecticides is a potential health problem. Acute or chronic intoxication may cause serious health problems due to its frequency or its severity. Extremadura is, as are other Spanish autonomous regions, mainly a rural environment which means that this problems carries special relevance there. In this article, the authors evaluate the number of cases of intoxication, the validity of the measures taken, and they describe the pedagogical programs which exist dealing with this problem. They review the physiopathological causes of this intoxication, its symptoms and its treatment. The authors reveal the results obtained from a questionnaire given to a group of Extremaduran farmers. Furthermore, the authors provide information to health professionals responsible for the treatment and prevention of this intoxication; the authors consider health education, especially …", "num_citations": "1\n", "authors": ["1046"]}
{"title": "Role of the blm5-1 mutation of Saccharomyces cerevisiae in DNA repair and meiosis and a potential requirement of vacuolar metabolism in the repair of bleomycin-induced double …\n", "abstract": " Mutational alteration of the BLM5 gene of the model eukaryote, Saccharomyces cerevisiae, confers extreme hypersensitivity to lethal effects of ionizing radiation and anticancer bleomycins. Since bleomycin hypersensitivities in blm5-1 mutant strains were unrelated to drug accumulations in the cells, a possible role in the repair of radiomimetic damage was proposed for the Bhn5p. This hypothesis was examined in two parts: The global repair of chromosomal doublestrand breaks (DSBs) and the isolation of genes that functionally complemented the bleomycin hypersensitivity conferred by the blm5-1 mutation.", "num_citations": "1\n", "authors": ["1046"]}
{"title": "Taking a Canoe to the Moon: Comprehensive Art Education for the Pacific. PREL Briefing Paper.\n", "abstract": " This paper describes a comprehensive model for art education for the Pacific Islands that includes the study of the content of visual art, including production, history, criticism, and aesthetics. This comprehensive research-based approach can be an effective vehicle for teaching multicultural understanding. Five recommendations are:(1) consider art education programs that are comprehensive, discipline-based, and integrated into the core curriculum;(2) offer teachers inservice training opportunities in the content knowledge of art and in the comprehensive, discipline-based models for teaching art education;(3) expose children to art of their own culture to promote cultural preservation and understanding;(4) include the study of many cultures within art education programs; and (5) create an aesthetically pleasing, multicultural classroom by introducing and incorporating examples of art from around the world. Contains 5 references.", "num_citations": "1\n", "authors": ["1046"]}
{"title": "Clinical and diagnostic characteristics in status epilepticus\n", "abstract": " The status epilepticus (SE) is a condition characterized by prolonged or repeated seizures over a period of at least 30 min. Neuropathologic consequences of SE are mostly due to continuous excitation of neurons. This recognition has led to an expansion of SE definition to include disorders in which clinical manifestations are subtle or atipical but have sustained and prolonged excitation of neurons recorded by surface or depth electrodes. In this article, we review the electroclinical features of SE. In secondarily generalized convulsive SE, there is a predictable progression of clinical and electroencephalographic (EEG) changes; clinical sings become increasingly subtle, whereas continuous or periodic epileptic discharges are seen on the EEG (electroclinical disassociation). Complex partial SE (CPSE) often goes unrecognized or is mistaken for behavioral or psychiatric disturbances; EEG could be difficult to distinguish from absence status, and needs rapid and vigorous treatment because permanent sequel can occur. SE is sometimes difficult to diagnose in encephalopathic epilepsy; an EEG criterion is the definitive change from the preictal state. EEG is the most useful test in SE; not only it serves to support the diagnosis of SE, but also to monitorize a successful treatment if the patient does not recover the neurologic function.", "num_citations": "1\n", "authors": ["1046"]}
{"title": "In vitro susceptibility of itraconazole against fluconazole resistant and susceptible Candida spp. isolates from oral cavities of HIV infected patients\n", "abstract": " Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS", "num_citations": "1\n", "authors": ["1046"]}
{"title": "AUTOMATIC SCORING OF PAPER‐AND‐PENCIL FIGURAL RESPONSES\n", "abstract": " Large‐scale testing is dominated by the multiple‐choice question format. Widespread use of the format is due, in part, to the ease with which multiple‐choice items can be scored automatically. This paper examines automatic scoring procedures for an alternative item type: figural response. Figural response items call for the completion or modification of figural material, including illustrations, diagrams, and graphs. Twenty‐five science items were written in cooperation with the National Assessment of Educational Progress (NAEP) and printed with an ink that was invisible to scanning equipment. The items were answered with pencils; response sheets were scanned and the resulting data were processed by computer‐based scoring algorithms. The paper describes the technology that lead to successful pilot scoring of seven items for ten subjects. Implications of this technology for the future of large‐scale testing are …", "num_citations": "1\n", "authors": ["1046"]}
{"title": "Profile: Student Characteristics from the 1986 and 1988 NAEP Assessments.\n", "abstract": " This profile is a\" biographical sketch\" of the nation's students based on information gathered in the 1986 and 1988 National Assessments of Educational Progress (NAEP) as part of their surveys of proficiencies in subject areas. The report is based primarily on data from the 1988 assessment, in which about 79,000 students in grades 4, 8, and 12 answered questions about their personal characteristics, home life, and schoolwork. The 1986 assessment involved about 73,000 students at grades 3, 7, and 11. Of particular note is that minority children compose a steadily increasing proportion of the nation's students, and this trend is likely to continue, with the most rapid growth in Hispanic and Asian populations. Data are provided in table and chart form for student characteristics that include:(1) race and ethnicity;(2) language oth. n than English;(3) high school program;(4) achievement and failure;(5) attendance;(6) part-time employment; and (7) future plans. Aspects of home life that were investigated include parental work, parent-child relationships, and leisure time activities, including television viewing. The school program is examined for different subject areas. Using these data for educational improvement is briefly discussed. Twelve figures and 29 short tables present the profile information. Each profile contains references.(SLD)", "num_citations": "1\n", "authors": ["1046"]}
{"title": "Diseases in heroin addiction\n", "abstract": " An analysis of the medical pathologies seen in heroin addicts heroin addicts hospitalized in the Provincia de Vizcaya, Basque Country, Spain, from 1982 to 1987, and its possible association to the infection by the human immunodeficiency virus, HIV, is presented. An increasing of hospitalized addicts per year was observed, being infectious diseases the main pathology detected. HIV infection was present in more than 90% of individuals with non opportunistic acquired infections. Significant annual increase in the number of tuberculosis and candida infections was present. The possible association of HIV infection with increased susceptibility to commonly acquired non opportunistic infections is discussed.", "num_citations": "1\n", "authors": ["1046"]}
{"title": "Synthesis and Characterization of n‐Alkylanilinium Octamolybdates. Identification of Some Products of Their Thermogravimetric Decomposition\n", "abstract": " The compounds (BH)4Mo8O26 being B: anilinium, N‐methylanilinium, N,N‐dimethylanilinium and N,N‐diethylanilinium have been synthetized and characterized for the first time. Thermogravimetric decomposition in isothermal and non‐isothermal regime have been studied. At temperatures between 480–560 K a great number of organic compounds, different from the initial organic bases have been identified, with molecular weight between 117–254 g mol−1.", "num_citations": "1\n", "authors": ["1046"]}