{"title": "Programming in occam 2\n", "abstract": " Some thesis volumes scanned as part of the digitisation scheme funded by Dr Leonard Polonsky are currently unavailable due to sensitive material or uncleared third-party copyright content. We are attempting to contact authors whose theses are affected.", "num_citations": "404\n", "authors": ["1639"]}
{"title": "Understanding Insider Threat: A Framework for Characterising Attacks\n", "abstract": " The threat that insiders pose to businesses, institutions and governmental organisations continues to be of serious concern. Recent industry surveys and academic literature provide unequivocal evidence to support the significance of this threat and its prevalence. Despite this, however, there is still no unifying framework to fully characterise insider attacks and to facilitate an understanding of the problem, its many components and how they all fit together. In this paper, we focus on this challenge and put forward a grounded framework for understanding and reflecting on the threat that insiders pose. Specifically, we propose a novel conceptualisation that is heavily grounded in insider-threat case studies, existing literature and relevant psychological theory. The framework identifies several key elements within the problem space, concentrating not only on noteworthy events and indicators- technical and behavioural- of …", "num_citations": "207\n", "authors": ["1639"]}
{"title": "What is intransitive noninterference?\n", "abstract": " The term \"intransitive noninterference\" refers to the information flow properties required of systems like downgraders, in which it may be legitimate for information to flow indirectly, between two users but not directly. We examine the usual definition of this property in terms of a modified purge function, and show that this is a distinctly weaker property than an alternative we derive from considerations of determinism.", "num_citations": "161\n", "authors": ["1639"]}
{"title": "Insider attacks in cloud computing\n", "abstract": " The computer-security industry is familiar with the concept of a Malicious Insider. However, a malicious insider in the cloud might have access to an unprecedented amount of information and on a much greater scale. Given the level of threat posed by insiders, and the rapid growth of the cloud computing ecosystem, we examine here the concept of insider attacks in cloud computing. Specifically, if more of our assets are going to reside in the cloud, and as increasingly our lives, enterprises and prosperity may depend upon cloud, it is imperative that we understand the scope for insider attacks so that we might best prepare defenses. We need to understand whether cloud might expose our assets to increased threat in terms of both actors and attack surface. We present here an assessment of current insider threat definitions and classifications, and their applicability to the cloud. We elucidate the nature of insiders with …", "num_citations": "147\n", "authors": ["1639"]}
{"title": "Automated Insider Threat Detection System Using User and Role-Based Profile Assessment\n", "abstract": " Organizations are experiencing an ever-growing concern of how to identify and defend against insider threats. Those who have authorized access to sensitive organizational data are placed in a position of power that could well be abused and could cause significant damage to an organization. This could range from financial theft and intellectual property theft to the destruction of property and business reputation. Traditional intrusion detection systems are neither designed nor capable of identifying those who act maliciously within an organization. In this paper, we describe an automated system that is capable of detecting insider threats within an organization. We define a tree-structure profiling approach that incorporates the details of activities conducted by each user and each job role and then use this to obtain a consistent representation of features that provide a rich description of the user's behavior. Deviation …", "num_citations": "126\n", "authors": ["1639"]}
{"title": "A taxonomy of cyber-harms: Defining the impacts of cyber-attacks and understanding how they propagate\n", "abstract": " Technological advances have resulted in organizations digitalizing many parts of their operations. The threat landscape of cyberattacks is rapidly changing and the potential impact of such attacks is uncertain, because there is a lack of effective metrics, tools and frameworks to understand and assess the harm organizations face from cyber-attacks. In this article, we reflect on the literature on harm, and how it has been conceptualized in disciplines such as criminology and economics, and investigate how other notions such as risk and impact relate to harm. Based on an extensive literature survey and on reviewing news articles and databases reporting cyber-incidents, cybercrimes, hacks and other attacks, we identify various types of harm and create a taxonomy of cyber-harms encountered by organizations. This taxonomy comprises five broad themes: physical or digital harm; economic harm; psychological …", "num_citations": "103\n", "authors": ["1639"]}
{"title": "PB-PKI: a privacy-aware blockchain-based PKI\n", "abstract": " Conventional public-key infrastructure (PKI) designs using certificate authorities and web-of-trust are not optimal and have security flaws. The properties afforded by the Bitcoin blockchain are a natural solution to some of the problems with PKI-in particular, certificate transparency and elimination of single points-offailure. Proposed blockchain-based PKI designs are built as public ledgers linking identity with public key, providing no privacy. We consider cases requiring privacy-aware PKIs, which do not link identity with public key. We show that blockchain technology can be used to construct a privacy-aware PKI while eliminating some of the problems of conventional PKI, and present PB-PKI, a privacy-aware blockchain-based PKI.", "num_citations": "98\n", "authors": ["1639"]}
{"title": "Guidelines for usable cybersecurity: past and present\n", "abstract": " Usability is arguably one of the most significant social topics and issues within the field of cybersecurity today. Supported by the need for confidentiality, integrity, availability and other concerns, security features have become standard components of the digital environment which pervade our lives requiring use by novices and experts alike. As security features are exposed to wider cross-sections of the society, it is imperative that these functions are highly usable. This is especially because poor usability in this context typically translates into inadequate application of cybersecurity tools and functionality, thereby ultimately limiting their effectiveness. With this goal of highly usable security in mind, there have been a plethora of studies in the literature focused on identifying security usability problems and proposing guidelines and recommendations to address them. Our paper aims to contribute to the field by …", "num_citations": "96\n", "authors": ["1639"]}
{"title": "Towards a conceptual model and reasoning structure for insider threat detection\n", "abstract": " The insider threat faced by corporations and governments today is a real and significant problem, and one that has become increasingly difficult to combat as the years have progressed. From a technology standpoint, traditional protective measures such as intrusion detection systems are largely inadequate given the nature of the ‘insider’ and their legitimate access to prized organisational data and assets. As a result, it is necessary to research and develop more sophisticated approaches for the accurate recognition, detection and response to insider threats. One way in which this may be achieved is by understanding the complete picture of why an insider may initiate an attack, and the indicative elements along the attack chain. This includes the use of behavioural and psychological observations about a potential malicious insider in addition to technological monitoring and profiling techniques. In this paper, we propose a framework for modelling the insider-threat problem that goes beyond traditional technological observations and incorporates a more complete view of insider threats, common precursors, and human actions and behaviours. We present a conceptual model for insider threat and a reasoning structure that allows an analyst to make or draw hypotheses regarding a potential insider threat based on measurable states from real-world observations.", "num_citations": "89\n", "authors": ["1639"]}
{"title": "FDR2 user manual\n", "abstract": " FDR2 user manual - ORA - Oxford University Research Archive Logos Header links Search History Bookmarks 0 New Search Deposit Help Footer links Deposit Agreements Disclaimer Privacy Policy Cookies Accessibility Statement Take-down Policy Copyright API Contact Skip to main NEW SEARCH Deposit HELP 0 Back to Search CONTACT Name Email Comment Send message Actions Authors Bibliographic Details Terms of Use Stats Export BibTeX EndNote RefWorks General item icon General item FDR2 user manual Actions Email × Send the bibliographic details of this record to your email address. Your Email Please enter the email address that the record information will be sent to. Your message (optional) Please add any additional information to be included within the email. Send Cite × APA Style Gardiner, P., Goldsmith, M., Hulance, J., Jackson, D., Roscoe, AW, Scattergood, B., & Armstrong, P. (2000). …", "num_citations": "86\n", "authors": ["1639"]}
{"title": "The perfect ‘spy’ for model-checking cryptoprotocols\n", "abstract": " This paper describes the modeling of a fully potent attacker against cryptoprotocols, including its inference system, in the process algebra CSP. Techniques for keeping the state space within practical bounds for the model checker FDR2 are explained.", "num_citations": "83\n", "authors": ["1639"]}
{"title": "Authentication for pervasive computing\n", "abstract": " Key management is fundamental to communications security, and for security in pervasive computing sound key management is particularly difficult. However, sound key management itself depends critically on sound authentication. In this paper we review current notions of entity authentication and discuss why we believe these notions are unsuitable for the pervasive domain. We then present our views on how notions of authentication should be revised to address the challenges of the pervasive domain, and some of the new research problems that will arise. We end with some brief thoughts on how our revised notions may be implemented and some of the problems that may be encountered.", "num_citations": "71\n", "authors": ["1639"]}
{"title": "Identifying attack patterns for insider threat detection\n", "abstract": " The threat that insiders pose to businesses, institutions and governmental organisations continues to be of serious concern. Recent industry surveys provide unequivocal evidence to support the significance of this threat and its prevalence in enterprises today.1 In an attempt to address this challenge, several approaches and systems have been proposed by practitioners and researchers. These focus on defining the insider threat and exploring the human and psychological factors involved, through to the detection and deterrence of these threats via technological and behavioural theories.2, 3, 4, 5, 6Insider threats pose major concerns to businesses, institutions and governmental organisations. Few solutions to this problem consider all the technical, organisational and behavioural aspects.In new research, Ioannis Agrafiotis, Jason RC Nurse, Oliver Buckley, Phil Legg, Sadie Creese and Michael Goldsmith define …", "num_citations": "60\n", "authors": ["1639"]}
{"title": "Trustworthy and effective communication of cybersecurity risks: a review\n", "abstract": " Slowly but surely, academia and industry are fully accepting the importance of the human element as it pertains to achieving security and trust. Undoubtedly, one of the main motivations for this is the increase in attacks (e.g., social engineering and phishing) which exploit humans and exemplify why many authors regard them as the weakest link in the security chain. As research in the socio-technical security and trust fields gains momentum, it is crucial to intermittently pause and reflect on their progress while also considering related domains to determine whether there are any established principles which may be transferred. Comparison of the states-of-the-arts may assist in planning work going forward and identifying useful future directions for the less mature socio-technical field. This paper seeks to fulfil several of these goals, particularly as they relate to the emerging cybersecurity-risk communication domain …", "num_citations": "59\n", "authors": ["1639"]}
{"title": "The Attacker in Ubiquitous Computing Environments: Formalising the Threat Model\n", "abstract": " The ubiquitous computing paradigm will involve both the storage of increased amounts of valuable or sensitive digital data, and an increase in potential interfaces to networks and devices where such data is stored. Such information systems will be relied upon to provide adequate data security. It is imperative that techniques be developed to assure the trustworthiness of the technologies from which they are built. Formal verification provides the tools and techniques to assess whether systems are indeed trustworthy, and is an established approach for security assurance. When using formal verification for security assessment one of the most important concerns should be to be precise about the threat model. In the now extensive field of the formal analysis of crypto-protocols, the Dolev-Yao threat model is the de facto standard. This paper discusses how and when this threat model may be inappropriate for use in the ubiquitous computing environment and that it may be appropriate to assume the existence of multiple channels exposed to different threat models. We then present a selection of crypto-protocols for ubiquitous computing scenarios that require this heterogeneous approach.", "num_citations": "57\n", "authors": ["1639"]}
{"title": "Exploiting empirical engagement in authentication protocol design\n", "abstract": " We develop the theme of an earlier paper [3], namely that security protocols for pervasive computing frequently need to exploit empirical channels and that the latter can be classified by variants of the Dolev-Yao attacker model. We refine this classification of channels and study three protocols in depth: two from our earlier paper and one new one.", "num_citations": "56\n", "authors": ["1639"]}
{"title": "Information Quality and Trustworthiness: A Topical State-of-the-Art Review\n", "abstract": " The importance and value of information cannot be disputed. It is used as basis for menial and mission-critical tasks alike. In a society where information is so easily publicised and freely accessible, however, being able to assess information quality and trustworthiness is paramount. With appreciation of this fact, our paper seeks to navigate these two mature fields and define the latest state-of-the-art. The novelty of this work is found in the provision of an up-to-date review, a research survey which considers and links provenance, quality and trustworthiness, and a literature analysis that includes a first-look review at some of these aspects within the socialmedia domain. This factor-based review should provide an ideal grounding for future research that assesses interaction between these three topics, which may then also progress to associations with information assurance and security at large. To demonstrate how some of the factors might be considered, we also examine their application to a commonplace scenario.", "num_citations": "50\n", "authors": ["1639"]}
{"title": "Smart Insiders: Exploring the Threat from Insiders using the Internet-of-Things\n", "abstract": " The Internet-of-Things (IoT) is set to be one of the most disruptive technology paradigms since the advent of the Internet itself. Market research company Gartner estimates that around 4.9 billion connected things will be in use in 2015, and around 25 billion by 2020. While there are substantial opportunities accompanying IoT, spanning from Healthcare to Energy, there are an equal number of concerns regarding the security and privacy of this plethora of ubiquitous devices. In this position paper we approach security and privacy in IoT from a different perspective to existing research, by considering the impact that IoT may have on the growing problem of insider threat within enterprises. Our specific aim is to explore the extent to which IoT may exacerbate the insider-threat challenge for organisations and overview the range of new and adapted attack vectors. Here, we focus especially on (personal) devices which …", "num_citations": "49\n", "authors": ["1639"]}
{"title": "Caught in the Act of an Insider Attack: Detection and Assessment of Insider Threat\n", "abstract": " The greatest asset that any organisation has are its people, but they may also be the greatest threat. Those who are within the organisation may have authorised access to vast amounts of sensitive company records that are essential for maintaining competitiveness and market position, and knowledge of information services and procedures that are crucial for daily operations. In many cases, those who have such access do indeed require it in order to conduct their expected workload. However, should an individual choose to act against the organisation, then with their privileged access and their extensive knowledge, they are well positioned to cause serious damage. Insider threat is becoming a serious and increasing concern for many organisations, with those who have fallen victim to such attacks suffering significant damages including financial and reputational. It is clear then, that there is a desperate need for …", "num_citations": "48\n", "authors": ["1639"]}
{"title": "A Conceptual Model for Privacy Policies with Consent and Revocation Requirements\n", "abstract": " This paper proposes a conceptual model for privacy policies that takes into account privacy requirements arising from different stakeholders, with legal, business and technical backgrounds. Current approaches to privacy management are either high-level, enforcing privacy of personal data using legal compliance, risk and impact assessments, or low-level, focusing on the technical implementation of access controls to personal data held by an enterprise. High-level approaches tend to address privacy as an afterthought in ordinary business practice, and involve ad hoc enforcement practices; low-level approaches often leave out important legal and business considerations focusing solely on technical management of privacy policies. Hence, neither is a panacea and the low level approaches are often not adopted in real environments. Our conceptual model provides a means to express privacy policy …", "num_citations": "43\n", "authors": ["1639"]}
{"title": "Denotational semantics for occam 2\n", "abstract": " Denotational semantics for occam 2 - ORA - Oxford University Research Archive Logos Header links Search History Bookmarks 0 New Search Deposit Help Footer links Deposit Agreements Disclaimer Privacy Policy Cookies Accessibility Statement Take-down Policy Copyright API Contact Skip to main NEW SEARCH Deposit HELP 0 Back to Search CONTACT Name Email Comment Send message Actions Authors Bibliographic Details Terms of Use Stats Export BibTeX EndNote RefWorks Journal article icon Journal article Denotational semantics for occam 2 Actions Email × Send the bibliographic details of this record to your email address. Your Email Please enter the email address that the record information will be sent to. Your message (optional) Please add any additional information to be included within the email. Send Cite × APA Style Goldsmith, MH, Roscoe, AW, & Scott, BG (1993). Denotational semantics …", "num_citations": "42\n", "authors": ["1639"]}
{"title": "Two sides of the coin: measuring and communicating the trustworthiness of online information\n", "abstract": " Information is the currency of the digital age – it is constantly communicated, exchanged and bartered, most commonly to support human understanding and decision-making. While the Internet and Web 2.0 have been pivotal in streamlining many of the information creation and dissemination processes, they have significantly complicated matters for users as well. Most notably, the substantial increase in the amount of content available online has introduced an information overload problem, while also exposing content with largely unknown levels of quality, leaving many users with the difficult question of, what information to trust? In this article we approach this problem from two perspectives, both aimed at supporting human decision-making using online information. First, we focus on the task of measuring the extent to which individuals should trust a piece of openly-sourced information (e.g., from Twitter, Facebook or a blog); this considers a range of factors and metrics in information provenance, quality and infrastructure integrity, and the person’s own preferences and opinion. Having calculated a measure of trustworthiness for an information item, we then consider how this rating and the related content could be communicated to users in a cognitively-enhanced manner, so as to build confidence in the information only where and when appropriate. This work concentrates on a range of potential visualisation techniques for trust, with special focus on radar graphs, and draws inspiration from the fields of Human-Computer Interaction (HCI), System Usability and Risk Communication. The novelty of our contribution stems from the comprehensive …", "num_citations": "39\n", "authors": ["1639"]}
{"title": "An overview of insider attacks in cloud computing\n", "abstract": " Cloud computing offers the potential for significant cost reductions and increased agility for users. However, security concerns continue to be raised as a potential barrier to uptake for private, community and public clouds. A report from the European Network and Information Security Agency on the Priorities for Research on Current and Emerging Network Technologies highlighted trusted cloud models as one of its top priorities for further research. More recently—September 2012—Carnegie Mellon University's computer emergency response team have released a paper describing insider threats to cloud computing as a direction for new research. Further, a project completed at the University of Warwick in 2010 investigated security aspects of cloud computing and in particular the potential for cascade effects. This research involved a detailed modelling of the threat and vulnerability landscape, including the …", "num_citations": "39\n", "authors": ["1639"]}
{"title": "A data-reachability model for elucidating privacy and security risks related to the use of online social networks\n", "abstract": " Privacy and security within Online Social Networks (OSNs) has become a major concern over recent years. As individuals continue to actively use and engage with these mediums, one of the key questions that arises pertains to what unknown risks users face as a result of unchecked publishing and sharing of content and information in this space. There are numerous tools and methods under development that claim to facilitate the extraction of specific classes of personal data from online sources, either directly or through correlation across a range of inputs. In this paper we present a model which specifically aims to understand the potential risks faced should all of these tools and methods be accessible to a malicious entity. The model enables easy and direct capture of the data extraction methods through the encoding of a data-reachability matrix for which each row represents an inference or data-derivation step …", "num_citations": "36\n", "authors": ["1639"]}
{"title": "Unwinding Ariadne's identity thread: Privacy risks with fitness trackers and online social networks\n", "abstract": " The recent expansion of Internet of Things (IoT) and the grow-ing trends towards a healthier lifestyle, have been followed by a proliferation in the use of tness-trackers in our daily life. These wearable IoT devices combined with the extensive use by individu-als of Online Social Networks (OSNs) have raised many security and privacy concerns. Individuals enrich the content of their online posts with their physical performance and attendance at sporting events, without considering the plausible risks that this may result in. This paper aims to examine the potential exposure of users-identity that is caused by information that they share online and personal data that are stored by their tness-trackers. We approach the privacy concerns that arise by building an interactive tool. This tool models online information shared by individuals and elaborates on how they might be exposed to the unwanted leakage of further personal …", "num_citations": "32\n", "authors": ["1639"]}
{"title": "Cloud computing: Insider attacks on virtual machines during migration\n", "abstract": " The use of Virtual Machines (VMs) and Infrastructure-as-a-Service (IaaS) has risen dramatically and, according to Gartner, is set to continue rising with a compound annual growth rate predicted to be 41.7% over the four years to 2016. By using Cloud providers, organisations are reducing their capital expenditure on hardware, software and support, however, these same organisations are putting a great deal of trust in the provider offering a safe and secure platform for their data and resources. One of the biggest benefits of IaaS to the customer is the rapid elasticity of their provision. This elasticity can require relocation of a VM from one physical machine and / or one hypervisor to another. Whilst such migration is transparent and potentially seamless, it may also introduce vulnerability. We explore here the potential for a malicious insider to exploit vulnerabilities associated with mobile VMs to obtain large volumes of …", "num_citations": "31\n", "authors": ["1639"]}
{"title": "A Critical Reflection on the Threat from Human Insiders–Its Nature, Industry Perceptions, and Detection Approaches\n", "abstract": " Organisations today operate in a world fraught with threats, including “script kiddies”, hackers, hacktivists and advanced persistent threats. Although these threats can be harmful to an enterprise, a potentially more devastating and anecdotally more likely threat is that of the malicious insider. These trusted individuals have access to valuable company systems and data, and are well placed to undermine security measures and to attack their employers. In this paper, we engage in a critical reflection on the insider threat in order to better understand the nature of attacks, associated human factors, perceptions of threats, and detection approaches. We differentiate our work from other contributions by moving away from a purely academic perspective, and instead focus on distilling industrial reports (i.e., those that capture practitioners’ experiences and feedback) and case studies in order to truly appreciate how …", "num_citations": "30\n", "authors": ["1639"]}
{"title": "Sonification in security operations centres: what do security practitioners think?\n", "abstract": " In Security Operations Centres (SOCs) security practitioners work using a range of tools to detect and mitigate malicious computer-network activity. Sonification, in which data is represented as sound, is said to have potential as an approach to addressing some of the unique challenges faced by SOCs. For example, sonification has been shown to enable peripheral monitoring of processes, which could aid practitioners multitasking in busy SOCs. The perspectives of security practitioners on incorporating sonification into their actual working environments have not yet been examined, however. The aim of this paper therefore is to address this gap by exploring attitudes to using sonification in SOCs. We report on the results of a study consisting of an online survey (N=20) and interviews (N=21) with security practitioners working in a range of different SOCs. Our contribution is a refined appreciation of the contexts in which sonification could aid in SOC working practice, and an understanding of the areas in which sonification may not be beneficial or may even be problematic.We also analyse the critical requirements for the design of sonification systems and their integration into the SOC setting. Our findings clarify insights into the potential benefits and challenges of introducing sonification to support work in this vital security-monitoring environment.", "num_citations": "27\n", "authors": ["1639"]}
{"title": "The Oxford occam transformation system\n", "abstract": " The Oxford occam transformation system - ORA - Oxford University Research Archive Logos Header links Search History Bookmarks 0 New Search Deposit Help Footer links Deposit Agreements Disclaimer Privacy Policy Cookies Accessibility Statement Take-down Policy Copyright API Contact Skip to main NEW SEARCH Deposit HELP 0 Back to Search CONTACT Name Email Comment Send message Actions Authors Bibliographic Details Terms of Use Stats Export BibTeX EndNote RefWorks General item icon General item The Oxford occam transformation system Actions Email × Send the bibliographic details of this record to your email address. Your Email Please enter the email address that the record information will be sent to. Your message (optional) Please add any additional information to be included within the email. Send Cite × APA Style Goldsmith, M. (1988). The Oxford occam transformation system. …", "num_citations": "27\n", "authors": ["1639"]}
{"title": "Understanding the radical mind: Identifying signals to detect extremist content on twitter\n", "abstract": " The Internet and, in particular, Online Social Networks have changed the way that terrorist and extremist groups can influence and radicalise individuals. Recent reports show that the mode of operation of these groups starts by exposing a wide audience to extremist material online, before migrating them to less open online platforms for further radicalization. Thus, identifying radical content online is crucial to limit the reach and spread of the extremist narrative. In this paper, our aim is to identify measures to automatically detect radical content in social media. We identify several signals, including textual, psychological and behavioural, that together allow for the classification of radical messages. Our contribution is threefold: (1) we analyze propaganda material published by extremist groups and create a contextual text-based model of radical content, (2) we build a model of psychological properties inferred from …", "num_citations": "26\n", "authors": ["1639"]}
{"title": "Watchdog transformations for property-oriented model-checking\n", "abstract": " We discuss how to transform a CSP refinement, , to enable all its events to be hidden; this is useful because many of the state space compression functions provided by the model-checker FDR are effective only when events are hidden [1]. In an earlier paper [2] we described a suitable transformation for the case where the refinement is in the traces semantics of CSP. This paper extends the approach to the more difficult case of the stable-failures semantics. In both cases, a watchdog transformation is applied to the specification S, resulting in a watchdog processWD S, which is then composed in parallel with I, or with I in a simple context. The watchdog process monitors I and somehow indicates whether it can behave in a way that is incompatible with refinement of S. All events of the original assertion can be hidden in the transformed assertion. We also discuss the design of compression strategies that …", "num_citations": "26\n", "authors": ["1639"]}
{"title": "Cyber harm: concepts, taxonomy and measurement\n", "abstract": " Coherent, adaptable and durable cybersecurity capacity-building requires a comprehensive and in-depth understanding of harms that can be caused by cyber-events. At the national level, the avoidance and reduction of harm is a central feature in all efforts to develop cybersecurity policy, strategy and capacity. This article offers a taxonomy of cyber harm, which enables a better understanding of how harm is manifested within and outside of cyberspace, and proposes an initial set of metrics and methods to assess cyber harm in national contexts. Based on this framework, a national Cyber Harm Model (CHM) would form the basis for a comprehensive and durable cybersecurity policy by contextualising and validating cybersecurity capacity research that has resulted in the development of the National Cybersecurity Capacity Maturity Model (CMM).", "num_citations": "25\n", "authors": ["1639"]}
{"title": "Research directions for trust and security in human-centric computing\n", "abstract": " Pervasive networks foresee communicating and computing devices embedded throughout our environment. This will cause huge increases in the complexity of network infrastructures and the information services available over them. The challenge of managing information services, while maintaining security and privacy will be great. It is not clear that current security paradigms will map readily into such future environments. This paper outlines the authors’ current position regarding the technical challenges which will need to be addressed in order to make secure pervasive computing environments a reality.", "num_citations": "25\n", "authors": ["1639"]}
{"title": "Inadequacies of Current Risk Controls for the Cloud\n", "abstract": " In this chapter, we describe where current best practice in information security risk controls is likely to be inadequate for use in the cloud. In particular, we focus on public cloud ecosystems where cloud users will need to be mobile within the marketplace in order to achieve maximum benefits, as we believe these environments to be particularly challenging to the security control model. Our analysis is with reference to those risk controls defined by the ISO27001/27002 standards and the NIST Recommended Security Controls for Federal Information Systems and Organizations Special Publication 800–53 Revision 3. We highlight here only those we consider not to easily scale into such cloud environments, and by implication those not referred to, we believe, will transfer with relative ease.", "num_citations": "24\n", "authors": ["1639"]}
{"title": "A model for identity in the cyber and natural universes\n", "abstract": " In this paper we describe a model for evaluating and investigating holistic identities across both the cyber- and natural-worlds. The model is taxonomy-agnostic and helps guide analysts through the creation of a rich super identity whilst also being flexible enough for users to deploy their intuition and experience. Super identities are created by iterative stages of enrichment and relaxation, which allow the super identity to grow and include more elements of identity. The confidence in individual elements can be propagated so as to provide an overall level of confidence in the super identity. The quality of the final, rich super identity can be metricized, identifying good qualities of the super identity such as reinforcement of elements and consensus within element types. This work is a key enabling component of a large inter-disciplinary project called Super identity, which is seeking to develop the model through …", "num_citations": "24\n", "authors": ["1639"]}
{"title": "A methodology for model-checking ad-hoc networks\n", "abstract": " Wireless networks, specifically ad-hoc networks, are characterised by rapidly changing network topologies. The dynamic nature of ad-hoc networks makes protocol design and assessment particularly challenging. We present a methodology, based on CSP and the FDR model-checker, to validate critical properties of ad-hoc networks, properties like self-stabilisation. Our work started by applying CSP/FDR to a tactical internet (a military mobile network). The techniques developed there were generalised to our methodology for model-checking ad-hoc networks, and more general self-configuring systems. We first give an overview of the results of model-checking the tactical internet, then we describe the methodology on an ad-hoc network case study, namely the Cluster-Based Routing Protocol. The methodology is quite generic, but it enables the complex dynamic properties of ad-hoc networks to be captured …", "num_citations": "23\n", "authors": ["1639"]}
{"title": "Nonsense attacks on Google assistant and missense attacks on Amazon Alexa\n", "abstract": " This paper presents novel attacks on voice-controlled digital assistants using nonsensical word sequences. We present the results of a small-scale experiment which demonstrates that it is possible for malicious actors to gain covert access to a voice-controlled system by hiding commands in apparently nonsensical sounds of which the meaning is opaque to humans. Several instances of nonsensical word sequences were identified which triggered a target command in a voice-controlled digital assistant, but which were incomprehensible to humans, as shown in tests with human experimental subjects. Our work confirms the potential for hiding malicious voice commands to voice-controlled digital assistants or other speech-controlled devices in speech sounds which are perceived by humans as nonsensical. This paper also develops a novel attack concept which involves gaining unauthorised access to a voice-controlled system using apparently unrelated utterances. We present the results of a proof-of-co ncept study showing that it is possible to trigger actions in a voice-controlled digital assistant using utterances which are accepted by the system as a target command despite having a different meaning to the command in terms of human understanding.", "num_citations": "22\n", "authors": ["1639"]}
{"title": "Tools for understanding identity\n", "abstract": " We present two tools for analysing identity in support of homeland security. Both are based upon the Superi-dentity model that brings together cyber and physical spaces into a single understanding of identity. Between them, the tools provide support for defensive, information gathering and capability planning operations. The first tool allows an analyst to explore and understand the model, and to apply it to risk-exposure assessment activities for a particular individual, e.g. an influential person in the intelligence or government community, or a commercial company board member. It can also be used to understand critical capabilities in an organization's identity-attribution process, and so used to plan resource investment. The second tool, referred to as Identity Map, is designed to support investigations requiring enrichment of identities and the making of attributions. Both are currently working prototypes.", "num_citations": "22\n", "authors": ["1639"]}
{"title": "Bootstrapping multi-party ad-hoc security\n", "abstract": " In pervasive-computing scenarios users may wish to achieve some degree of security in their interaction with other people or equipment, in contexts where they cannot be confident of the others' long-term identities and where there may be no reliable PKI. We examine the problem of bootstrapping security in an ad-hoc network formed by a group of users. In [4] a number of protocols using low-bandwidth channels involving the human agent (s)\" in the loop\" to bootstrap secure communication over an untrusted infrastructure were presented, the point being that the attacker's powers are more limited with regard to these empirical channels in one or more respects than in the standard Dolev-Yao view. The two-party protocols proved easy to verify [3](relative to those weakened powers) by adapting the CSP/FDR-based approach of Casper [9], but the multi-party network-formation protocol (based on a combination of low …", "num_citations": "21\n", "authors": ["1639"]}
{"title": "Reflecting on the Ability of Enterprise Security Policy to Address Accidental Insider Threat\n", "abstract": " An enterprise's information security policy is an exceptionally important control as it provides the employees of an organisation with details of what is expected of them, and what they can expect from the organisation's security teams, as well as informing the culture within that organisation. The threat from accidental insiders is a reality across all enterprises and can be extremely damaging to the systems, data and reputation of an organisation. Recent industry reports and academic literature underline the fact that the risk of accidental insider compromise is potentially more pressing than that posed by a malicious insider. In this paper we focus on the ability of enterprises' information security policies to mitigate the accidental insider threat. Specifically we perform an analysis of real-world cases of accidental insider threat to define the key reasons, actions and impacts of these events -- captured as a grounded insider …", "num_citations": "19\n", "authors": ["1639"]}
{"title": "Cybercrime investigators are users too! Understanding the socio-technical challenges faced by law enforcement\n", "abstract": " Cybercrime investigators face numerous challenges when policing online crimes. Firstly, the methods and processes they use when dealing with traditional crimes do not necessarily apply in the cyber-world. Additionally, cyber criminals are usually technologically-aware and constantly adapting and developing new tools that allow them to stay ahead of law enforcement investigations. In order to provide adequate support for cybercrime investigators, there needs to be a better understanding of the challenges they face at both technical and socio-technical levels. In this paper, we investigate this problem through an analysis of current practices and workflows of investigators. We use interviews with experts from government and private sectors who investigate cybercrimes as our main data gathering process. From an analysis of the collected data, we identify several outstanding challenges faced by investigators. These pertain to practical, technical, and social issues such as systems availability, usability, and in computer-supported collaborative work. Importantly, we use our findings to highlight research areas where user-centric workflows and tools are desirable. We also define a set of recommendations that can aid in providing a better foundation for future research in the field and allow more effective combating of cybercrimes.", "num_citations": "18\n", "authors": ["1639"]}
{"title": "Privacy Requirements in Cybersecurity Applications of Blockchain\n", "abstract": " Blockchain has promise as an approach to developing systems for a number of applications within cybersecurity. In Blockchain-based systems, data and authority can be distributed, and transparent and reliable transaction ledgers created. Some of the key advantages of Blockchain for cybersecurity applications are in conflict with privacy properties, yet many of the potential applications have complex requirements for privacy. Privacy-enabling approaches for Blockchain have been introduced, such as private Blockchains, and methods for enabling parties to act pseudonymously, but it is as yet unclear which approaches are suitable in which applications. We explore a set of proposed uses of Blockchain within cybersecurity and consider their requirements for privacy. We compare these requirements with the privacy provision of Blockchain and explore the trade-off between security and privacy, reflecting on the …", "num_citations": "17\n", "authors": ["1639"]}
{"title": "A formalised approach to designing sonification systems for network-security monitoring\n", "abstract": " Sonification systems, in which data are represented through sound, have the potential to be useful in a number of network-security monitoring applications in Security Operations Centres (SOCs). Security analysts working in SOCs generally monitor networks using a combination of anomaly-detection techniques, Intrusion Detection Systems and data presented in visual and text-based forms. In the last two decades significant progress has been made in developing novel sonification systems to further support network-monitoring tasks, but many of these systems have not been sufficiently validated, and there is a lack of uptake in SOCs. Furthermore, little guidance exists on design requirements for the sonification of network data. In this paper, we identify the key role that sonification, if implemented correctly, could play in addressing shortcomings of traditional network-monitoring methods. Based on a review of prior research, we propose an approach to developing sonification systems for network monitoring. This approach involves the formalisation of a model for designing sonifications in this space; identification of sonification design aesthetics suitable for realtime network monitoring; and system refinement and validation through comprehensive user testing. As an initial step in this system development, we present a formalised model for designing sonifications for network-security monitoring. The application of this model is demonstrated through our development of prototype sonification systems for two different use-cases within network security monitoring.", "num_citations": "17\n", "authors": ["1639"]}
{"title": "Validating an Insider Threat Detection System: A Real Scenario Perspective\n", "abstract": " There exists unequivocal evidence denoting the dire consequences which organisations and governmental institutions face from insider threats. While the in-depth knowledge of the modus operandi that insiders possess provides ground for more sophisticated attacks, organisations are ill-equipped to detect and prevent these from happening. The research community has provided various models and detection systems to address the problem, but the lack of real data due to privacy and ethical issues remains a significant obstacle for validating and designing effective and scalable systems. In this paper, we present the results and our experiences from applying our detection system into a multinational organisation, the approach followed to abide with the ethical and privacy considerations and the lessons learnt on how the validation process refined the system in terms of effectiveness and scalability.", "num_citations": "17\n", "authors": ["1639"]}
{"title": "Towards designing a multipurpose cybercrime intelligence framework\n", "abstract": " With the wide spread of the Internet and the increasing popularity of social networks that provide prompt and ease of communication, several criminal and radical groups have adopted it as a medium of operation. Existing literature in the area of cybercrime intelligence focuses on several research questions and adopts multiple methods using techniques such as social network analysis to address them. In this paper, we study the broad state-of-the-art research in cybercrime intelligence in order to identify existing research gaps. Our core aim is designing and developing a multipurpose framework that is able to fill these gaps using a wide range of techniques. We present an outlineof a framework designed to aid law enforcement in detecting, analysing and making sense out of cybercrime data.", "num_citations": "16\n", "authors": ["1639"]}
{"title": "CyberVis: Visualizing the potential impact of cyber attacks on the wider enterprise\n", "abstract": " A variety of data-mining tools and filtering techniques exist to detect and analyze cyber-attacks by monitoring network traffic. In recent years many of these tools use visualization designed to make traffic patterns and impact of an attack tangible to a security analyst. The visualizations attempt to facilitate understanding elements of an attack, including the location of malicious activity on a network and the consequences for the wider system. The human observer is able to detect patterns from useful visualizations, and so discover new knowledge about existing data sets. Because of human reasoning, such approaches still have an advantage over automated detection, data-mining and analysis. The core challenge still lies in using the appropriate visualization at the right time. It is this lack of situational awareness that our CyberVis framework is designed to address. In this paper we present a novel approach to the …", "num_citations": "16\n", "authors": ["1639"]}
{"title": "Investigating the leakage of sensitive personal and organisational information in email headers\n", "abstract": " Email is undoubtedly the most used communications mechanism in society today. Within business alone, it is estimated that 100 billion emails are sent and received daily across the world. While the security and privacy of email has been of concern to enterprises and individuals for decades, this has predominately been focused on protecting against malicious content in incoming emails and explicit data exfiltration, rather than inadvertent leaks in outgoing emails. In this paper, we consider this topic of outgoing emails and unintentional information leakage to better appreciate the security and privacy concerns related to the simple activity of sending an email. Specifically, our research seeks to investigate the extent to which potentially sensitive information could be leaked, in even blank emails, by considering the metadata that is a natural part of email headers. Through findings from a user-based experiment, we demonstrate that there is a noteworthy level of exposure of organisational and personal identity information, much of which can be further used by an attacker for reconnaissance or develop a more targeted and sophisticated attack.", "num_citations": "15\n", "authors": ["1639"]}
{"title": "Accepting Information with a Pinch of Salt: Handling Untrusted Information Sources\n", "abstract": " This paper describes on-going research developing a system to allow incident controllers and similar decision makers to augment official information input streams with information contributed by the wider public (either explicitly submitted to them or harvested from social networks such as Facebook and Twitter), and to be able to handle inconsistencies and uncertainty arising from the unreliability of such sources in a flexible way.", "num_citations": "15\n", "authors": ["1639"]}
{"title": "Applying Semantic Technologies to Fight Online Banking Fraud\n", "abstract": " Cybercrime tackling is a major challenge for Law Enforcement Agencies (LEAs). Traditional digital forensics and investigation procedures are not coping with the sheer amount of data to analyse, which is stored in multiple devices seized from distinct, possibly-related cases. Moreover, inefficient information representation and exchange hampers evidence recovery and relationship discovery. Aiming at a better balance between human reasoning skills and computer processing capabilities, this paper discusses how semantic technologies could make cybercrime investigation more efficient. It takes the example of online banking fraud to propose an ontology aimed at mapping criminal organisations and identifying malware developers. Although still on early stage of development, it reviews concepts to extend from well-established ontologies and proposes novel abstractions that could enhance relationship discovery …", "num_citations": "14\n", "authors": ["1639"]}
{"title": "Towards a User and Role-based Sequential Behavioural Analysis Tool for Insider Threat Detection\n", "abstract": " Insider threat is recognised to be a significant problem and of great concern to both corporations and governments alike. Traditional intrusion detection systems are known to be ineffective due to the extensive knowledge and capability that insiders typically have regarding the organisational setup. Instead, more sophisticated measures are required to analyse the actions performed by those within the organisation, to assess whether their actions suggest that they pose a threat. In this paper, we propose a proof-of-concept that focuses on the use of activity trees to establish sequential-based analysis of employee behaviour. This concept combines the notions of previously-proposed techniques such as attack trees and behaviour trees. For a given employee, we define a tree that can represent all sequences of their observed behaviours. Over time, branches are either appended or created to reflect the new observations that are made on how the employee acts. We also incorporate a similarity measure to establish how different branches compare against each other. Attacks can be defined as where the similarity measure between a newly-observed branch and all existing branches is below a given acceptance criteria. The approach would allow an analyst to observe chains of events that result in low probability activities that could be deemed as unusual and therefore may be malicious. We demonstrate our proof-of-concept using third-party synthetic employee activity logs, to illustrate the practicalities of delivering this form of protective monitoring.", "num_citations": "14\n", "authors": ["1639"]}
{"title": "Supporting human decision-making online using information-trustworthiness metrics\n", "abstract": " The vast amount of information available online places decision makers wishing to use this content in an advantageous but also very difficult position. The advantages stem from the volume of content from a variety of sources that is readily available; the difficulties arise because of the often unknown quality and trustworthiness of the information – is it fact, opinion or purely meant to deceive? In this paper we reflect on and extend current work on information trust and quality metrics which can be used to address this difficulty. Specifically, we propose new metrics as worthy of consideration and the new combinatorics required to take measurements of the various trust factors into a single score. These feed into our existing overarching policy-based approach that uses trustworthiness metrics to support decision-making online.", "num_citations": "14\n", "authors": ["1639"]}
{"title": "Building confidence in information-trustworthiness metrics for decision support\n", "abstract": " In light of the significant amount of information available online today and its potential application to a range of situations, the importance of identifying trustworthy information, and secondly, of building user confidence in that information is paramount. With this in mind, we have developed a novel trustworthiness metric which is designed to provide a relative score based on several key factors that influence trust, such as information's provenance and quality, and the integrity of the infrastructure through which the information passes. In this paper we consider whether providing insight into the various factors that make-up the resulting trustworthiness score actually helps to build trust in the metric itself, and whether users can successfully understand the advice being conveyed. Specifically, we present here the results of experiments which explore whether or not the visual interface that enables users to understand how …", "num_citations": "14\n", "authors": ["1639"]}
{"title": "A tripwire grammar for insider threat detection\n", "abstract": " The threat from insiders is an ever-growing concern for organisations, and in recent years the harm that insiders pose has been widely demonstrated. This paper describes our recent work into how we might support insider threat detection when actions are taken which can be immediately determined as of concern because they fall into one of two categories: they violate a policy which is specifically crafted to describe behaviours that are highly likely to be of concern if they are exhibited, or they exhibit behaviours which follow a pattern of a known insider threat attack. In particular, we view these concerning actions as something that we can design and implement tripwires within a system to detect. We then orchestrate these tripwires in conjunction with an anomaly detection system and present an approach to formalising tripwires of both categories. Our intention being that by having a single framework for describing …", "num_citations": "13\n", "authors": ["1639"]}
{"title": "Reflecting on the Use of Sonification for Network Monitoring\n", "abstract": " In Security Operations Centres (SOCs), computer networks are generally monitored using a combination of anomaly detection techniques, Intrusion Detection Systems (IDS) and data presented in visual and text-based forms. In the last two decades significant progress has been made in developing novel sonification systems to further support network monitoring tasks. A range of systems has been proposed in which sonified network data is presented for incorporation into the network monitoring process. Unfortunately, many of these have not been sufficiently validated and there is a lack of uptake in SOCs. In this paper, we describe and reflect critically on the shortcomings of traditional network-monitoring methods and identify the key role that sonification, if implemented correctly, could play in improving current monitoring capabilities. The core contribution of this position paper is in the outline of a research agenda for sonification for network monitoring, based on a review of prior research. In particular, we identify requirements for an aesthetic approach that is suitable for continuous real-time network monitoring; formalisation of an approach to designing sonifications in this space; and refinement and validation through comprehensive user testing.", "num_citations": "13\n", "authors": ["1639"]}
{"title": "Inferring Social Relationships from Technology-Level Device Connections\n", "abstract": " Technology is present in every area of our lives and, for many, life without it has become unthinkable. As a consequence of this dependence and the extent to which technology devices (computers, tablets and smartphones) are being used for work and social activities, a clear coupling between devices and their owners can now be observed. By coupling, we specifically refer to the fact that information present on a person's device, be it user-generated or created by the native OS, can produce great insight into their life. In this paper, we look to exploit this coupling to investigate whether connections between technology devices recorded in system log-files, can be used to make inferences about the social relationships between device owners. A key motivation here is to better understand and elucidate the privacy risks associated with the digital footprints that we as humans (often inadvertently) create. Our work draws …", "num_citations": "13\n", "authors": ["1639"]}
{"title": "Reaching for informed revocation: shutting off the tap on personal data\n", "abstract": " We introduce a revocation model for handling personal data in cyberspace. The model is motivated by a series of focus groups undertaken by the EnCoRe project aimed at understanding the control requirements of a variety of data subjects. We observe that there is a lack of understanding of the various technical options available for implementing revocation preferences, and introduce the concept of informed revocation by analogy to Faden and Beauchamp’s informed consent. We argue that we can overcome the limitations associated with informed consent via the implementation of EnCoRe technology solutions. Finally, we apply our model and demonstrate its validity to a number of data-handling scenarios which have arisen in the context of the EnCoRe research project. We have found that data subjects tend to alter their default privacy preferences when they are informed of all the different types of …", "num_citations": "13\n", "authors": ["1639"]}
{"title": "Parallelization of FDR\n", "abstract": " Parallelization of FDR - ORA - Oxford University Research Archive Logos Header links Search History Bookmarks 0 New Search Deposit Help Footer links Deposit Agreements Disclaimer Privacy Policy Cookies Accessibility Statement Take-down Policy Copyright API Contact Skip to main NEW SEARCH Deposit HELP 0 Back to Search CONTACT Name Email Comment Send message Actions Authors Bibliographic Details Terms of Use Stats Export BibTeX EndNote RefWorks Conference item icon Conference item Parallelization of FDR Actions Email × Send the bibliographic details of this record to your email address. Your Email Please enter the email address that the record information will be sent to. Your message (optional) Please add any additional information to be included within the email. Send Cite × APA Style Goldsmith, M., & Martin, J. (2002). Parallelization of FDR. Copy APA Style MLA Style Goldsmith, …", "num_citations": "13\n", "authors": ["1639"]}
{"title": "Formalising policies for insider-threat detection: A tripwire grammar\n", "abstract": " The threat that organisations face from within is growing significantly, as it has been widely demonstrated by the harm that insiders have caused recently. For many years the security community has invested in barriers and perimeters, of increasing sophistication, designed to keep those with malign intent outside of the organisations’ information infrastructures. But assuming that one can keep the threat out of an organisation is simply not a practical stance to adopt. In our research we are concerning ourselves with how technology might be deployed to help with the detection of insider threats both automatically and in support of human-led mechanisms. This paper describes our recent research into how we might support threat detection when actions taken can be immediately determined as of concern. In particular we capture actions that fall into one of two categories: those that violate a policy which is specifically crafted to describe behaviours that should be avoided; or those that exhibit behaviours which follow a pattern of a known insider-threat attack. We view these concerning actions as something that we can design and implement tripwires within a system to detect. We then orchestrate these tripwires in conjunction with an anomaly detection system. We present a review of the security policies organisation apply and a grammar to describe tripwires. We further validate our grammar by formalising the most common tripwires for both categories. Our aim is to provide a single framework for unambiguously capturing tripwires, alongside a library of existing ones in use. Therefore, tripwires may be used to map experiences regardless of the …", "num_citations": "12\n", "authors": ["1639"]}
{"title": "Applying Formal Methods to Detect and Resolve Ambiguities in Privacy Requirements\n", "abstract": " In this paper, we demonstrate how formal methods can be used to unambiguously express privacy requirements. We focus on requirements for consent and revocation controls in a real world case study that has emerged within the EnCoRe project. We analyse the ambiguities and issues that arise when requirements expressed in natural language are transformed into a formal notation, and propose solutions to address these issues. These ambiguities were brought to our attention only through the use of a formal notation, which we have designed specifically for this purpose.", "num_citations": "12\n", "authors": ["1639"]}
{"title": "Authentication in Pervasive Computing, Position Paper\n", "abstract": " The pervasive computing paradigm foresees communicating and computational devices embedded in all parts of our environment, from our physical selves, to our homes, our offices, our streets and so forth. What will security mean in this New World of ubiquitous computing? In this position paper we outline our current thinking on the new issues and problems in security for pervasive computing, the emphasis being on delineating the range of new technological issues and problems.In this new paradigm devices will need to interact, almost spontaneously, with certain other devices in an environment that is both unknown and changing. In traditional approaches, the interaction of two (or more) devices is secured by an authenticated key exchange, where authentication usually means entity authentication. However, we feel that security, based on entity authentication, is likely to be inadequate in the pervasive computing paradigm, for two principle reasons:", "num_citations": "12\n", "authors": ["1639"]}
{"title": "occam transformation at Oxford\n", "abstract": " occam transformation at Oxford - ORA - Oxford University Research Archive Logos Header links Search History Bookmarks 0 New Search Deposit Help Footer links Deposit Agreements Disclaimer Privacy Policy Cookies Accessibility Statement Take-down Policy Copyright Contact Skip to main NEW SEARCH Deposit HELP 0 Back to Search CONTACT Name Email Comment Send message Actions Authors Bibliographic Details Terms of Use Stats Export BibTeX EndNote RefWorks Conference item icon Conference item occam transformation at Oxford Actions Email × Send the bibliographic details of this record to your email address. Your Email Please enter the email address that the record information will be sent to. Your message (optional) Please add any additional information to be included within the email. Send Cite × APA Style Goldsmith, MH (1987). occam transformation at Oxford. Copy APA Style MLA Style …", "num_citations": "11\n", "authors": ["1639"]}
{"title": "Communicating trustworthiness using radar graphs: A detailed look\n", "abstract": " The amount of trust we, as human-beings, place in each other or an object (e.g., online information) is typically guided by several trust factors and antecedents. These factors can vary in importance depending on the individual making the trust decision and also on the situation - such is actually the subjective nature of trust. In this paper, we explore this notion of factors' importance by delving into detail on some of our recent user experiments and subsequent findings, partly described in previous work. These experiments used radar graphs to communicate trustworthiness as a function of five trust factors, namely competence, popularity, recency, corroboration and proximity. Here, we expand that work by further considering the importance of each of the factors to participants, while also investigating the correlations between individuals' perceptions of trust, and aspects such as graph area or size and expected scores …", "num_citations": "10\n", "authors": ["1639"]}
{"title": "Refinement checking for privacy policies\n", "abstract": " This paper presents a framework for analysis and comparison of privacy policies expressed in P3P (Platform for Privacy Preferences). In contrast to existing approaches to policy analysis, which focus on demonstrations of equality or equivalence of policies, our approach makes it possible to check for refinement between policies. We automatically generate a CSP model from a P3P policy, which represents the policy’s intended semantics; using the FDR model checker, we then perform various tests (using process refinement) to determine (a) whether a policy is internally consistent, and (b) whether a given policy refines another by permitting similar data collection, processing and sharing practices. Our approach allows for the detection of subtle differences between practices prescribed by different privacy policies, the comparison of relative levels of privacy offered by different policies, and captures the semantics of …", "num_citations": "10\n", "authors": ["1639"]}
{"title": "Using information trustworthiness advice in decision making\n", "abstract": " In a society at the brink of information overload, using a measurement of trustworthiness to focus attention and ultimately reduce risks faced by individuals is an increasingly attractive option in supporting well-conceived decisions. As such, this paper seeks to advance discussions on trustworthiness and decision-making research by critically investigating individuals' ability to cognitively combine trustworthiness measures and the information content that they relate to, to make decisions. This is an often assumed reality but one that is lacking focused analysis in the socio-technical field. In our experiments, as we present trustworthiness information using visualisations on a computer screen, we also conduct a secondary assessment of a range of visualisation techniques to determine whether there are any better or generally preferred approaches to support decisions. Findings from both evaluations are relatively positive …", "num_citations": "10\n", "authors": ["1639"]}
{"title": "A logical high-level framework for critical infrastructure resilience and risk assessment\n", "abstract": " Critical Infrastructures (CIs) play crucial roles in modern societies and our reliance on their proper functioning even in the face of accidental failures and deliberate targeted attacks makes their protection of paramount importance. A notable characteristic of CIs is their interdependencies that may exist at many levels and facets of the infrastructure, and which may sometimes lead to unforeseen and unexpected interactions. In particular, the underlying dependencies may induce domino effects in the propagation of failure impacts with devastating consequences and pose serious threats. Thus, technologies that provide new insights and visibility into the infrastructure dependencies, helping stakeholders to understand root causes and to predict the propagation of failure impacts are valuable for the assessment of risks and the engineering of resilience into the infrastructure. This paper presents a logical framework for the …", "num_citations": "10\n", "authors": ["1639"]}
{"title": "EnCoRe: Towards a holistic approach to privacy\n", "abstract": " We make the case for an integrated approach to privacy management within organisations. Current approaches to privacy management are either too high-level, enforcing privacy of personal data using legal compliance, risk and impact assessments, or too low-level, focusing only on the technical implementation of access controls to personal data held by an enterprise. High-level approaches tend to address privacy as an afterthought in ordinary business practice, and involve ad hoc enforcement practices; low-level approaches often leave out important legal and business considerations. As part of the EnCoRe project we are developing a methodology which tries to bridge the gap between privacy risk and impact assessment with the technical management of privacy policies. We are working to define a conceptual model as a means of expressing policy requirements as well as users' privacy preferences and as a …", "num_citations": "10\n", "authors": ["1639"]}
{"title": "Assumption–Commitment Support for CSP Model Checking\n", "abstract": " We present a simple formulation of Assumption-Commitment reasoning using CSP. In our formulation, an assumption-commitment style property of a process SYS takes the form COM ⊑ SYS ∥ ASS, for some 'assumption' and 'commitment' processes ASS and COM. We state some proof rules that allow us to derive assumption-commitment style properties of a composite system from corresponding properties of its components, given appropriate side conditions. Most of the rules have a superficially appealing 'homomorphic' quality, in the sense that the overall assumption and commitment processes are composed similarly to the overall system. We also present a 'non-homomorphic' rule that corresponds quite well to proof rules of established assumption-commitment theory. The antecedants and side conditions are expressed as refinements that can be checked separately by the refinement-style model checker FDR …", "num_citations": "10\n", "authors": ["1639"]}
{"title": "A taxonomy of attacks via the speech interface\n", "abstract": " This paper investigates the security of human-computer interaction via a speech interface. The use of speech interfaces for human-computer interaction is becoming more widespread, particularly in the form of voice-controlled digital assistants. We argue that this development represents new security vulnerabilities which have yet to be comprehensively investigated and addressed. This paper presents a comprehensive review of prior work in this area to date. Based on this review, we propose a high level taxonomy of attacks via the speech interface. Our taxonomy systematises the prior work on the security of voice-controlled digital assistants, and identifies new categories of potential attacks which have yet to be investigated and thus represent a focus for future research.", "num_citations": "9\n", "authors": ["1639"]}
{"title": "CSP: The Best Concurrent-System Description Language in the World – Probably!\n", "abstract": " CSP: The Best Concurrent−System Description Language in the World−Probably! - ORA - Oxford University Research Archive Logos Header links Search History Bookmarks 0 New Search Deposit Help Footer links Deposit Agreements Disclaimer Privacy Policy Cookies Accessibility Statement Take-down Policy Copyright API Contact Skip to main NEW SEARCH Deposit HELP 0 Back to Search CONTACT Name Email Comment Send message Actions Authors Bibliographic Details Terms of Use Stats Export BibTeX EndNote RefWorks Conference item icon Conference item CSP: The Best Concurrent−System Description Language in the World−Probably! Actions Email × Send the bibliographic details of this record to your email address. Your Email Please enter the email address that the record information will be sent to. Your message (optional) Please add any additional information to be included within the email. …", "num_citations": "9\n", "authors": ["1639"]}
{"title": "The Data that Drives Cyber Insurance: A Study into the Underwriting and Claims Processes\n", "abstract": " Cyber insurance is a key component in risk management, intended to transfer risks and support business recovery in the event of a cyber incident. As cyber insurance is still a new concept in practice and research, there are many unanswered questions regarding the data and economic models that drive it, the coverage options and pricing of premiums, and its more procedural policy-related aspects. This paper aims to address some of these questions by focusing on the key types of data which are used by cyber-insurance practitioners, particularly for decision-making in the insurance underwriting and claim processes. We further explore practitioners’ perceptions of the challenges they face in gathering and using data, and identify gaps where further data is required. We draw our conclusions from a qualitative study by conducting a focus group with a range of cyber-insurance professionals (including underwriters …", "num_citations": "8\n", "authors": ["1639"]}
{"title": "Analysing cyber-insurance claims to design harm-propagation trees\n", "abstract": " With a continuously changing threat landscape, companies must be prepared for the most unforeseen cyber events. Harm originating from cyberspace varies in magnitude and type, with potential for systemic consequences. While the adoption of security controls may partially mitigate the impact of cyber-attacks, a nuanced understanding of how events unfold during and after an incident will help organisations to better estimate the risk they face and implement advanced incident response strategies. A better estimation of risk is of particular importance to the insurance community because the costs from claims due to cyber-events vary significantly. Towards this end, we collected and analysed more than 70 claims against an insurance company, extracting different types of harm and their characteristics. We then reconstructed the claims based on these types of harm in order to obtain patterns of how cyber-harm …", "num_citations": "8\n", "authors": ["1639"]}
{"title": "An Initial Usability Evaluation of the Secure Situation Awareness System\n", "abstract": " The importance of situation awareness systems in crisis-management scenarios cannot be emphasised enough. These systems enable entire disaster situations to be mapped out in a real-time fashion thereby aiding significantly in human decision-making and the necessary positioning, management and deployment of resources. As a result of the core role these systems play in responding to crises, it is vital that they are highly usable and optimized for human cognition and experience. In this paper we consider this reality in the context of an initial evaluation of the visualisation interface of a situation-awareness tool called Secure Situation Awareness (SSA). Our evaluation seeks to gather useful feedback from potential end-users on the usability of the tool’s interface to feed into the design and development of interfaces for similar systems.", "num_citations": "8\n", "authors": ["1639"]}
{"title": "Critical systems validation and verification with CSP and FDR\n", "abstract": " Formal Systems and DERA have enjoyed a number of fruitful collaborations in recent years, especially in projects exploiting the FDR tool to analyse CSP models of systems. This paper presents an overview of the approach and some of the diverse applications to which it has been applied.", "num_citations": "8\n", "authors": ["1639"]}
{"title": "Extracting Social Structure from DarkWeb Forums\n", "abstract": " This paper explores various Social Network Analysis (SNA) techniques in order to identify a range of potentially ‘important’members of Islamic Networks within Dark Web Forums. For this experiment, we conducted our investigation on five forums collected in previous work as part of the Dark Web Forum portal and built upon the tool support created in our previous research in order to visualise and analyse the network. Whilst existing work attempts to identify these structures through stateof-the-art Computational Linguistic techniques, our work relies on the communication metadata alone. Our analysis involved first calculating a range of SNA metrics to better understand the group members, and then apply unsupervised learning in order to create clusters that would help classify the Dark Web Forums users into hierarchical clusters. In order to create our social networks, we investigated the effect of repeated author resolution and various weighting schemes on the ranking of forum members by creating four social networks per forum and evaluating the correlation of the top n users (for n= 10, 20, 30, 40, 50 and 100). Our results identified that varying the weighting schemes created more consistent ranking schemes than varying the repeated author resolution.", "num_citations": "7\n", "authors": ["1639"]}
{"title": "Visual Analytics of E-mail Sociolinguistics for User Behavioural Analysis\n", "abstract": " The cyber-security threat that most organisations face is not one that only resides outside their perimeter attempting to get in, but emanates from the inside too. Insider threats encompass anyone or thing which exploits authorised access to company information and resources to steal, corrupt or disrupt assets. Threat actors could include not only employees, but also contractors, trusted partners and in some cases clients. The nature of their access is usually persistent, as it is valid and required to conduct their roles, and as such, abuse of their privileges can pose a serious and real threat to the successful operation of the business. Whilst measures have been proposed for detecting previous attacks or those currently in progress, what would be much more desirable is to detect employees who are possibly becoming vulnerable to coercion or persuasion into conducting an attack of some form–enabling supportive or preventative action by the organisation to avoid escalation of an attack. Research into psychology and behaviour is indicating that it may be possible to detect such human vulnerability through analysis of language used–linguistics. In this paper we present a visual analytics tool for the assessment of sociolinguistic behaviours exhibited via e-mail communications, aimed at helping to identify people who are potentially at risk. We discuss the visual designs choices made to provide both detail and overview for the analyst for studying communications within a large group of users, and demonstrate this for a large real-world dataset of over 600 employees. We show how an analyst can use the tool to construct linguistic behavioural models to …", "num_citations": "7\n", "authors": ["1639"]}
{"title": "Operational semantics for fun and profit\n", "abstract": " The FDR refinement-checking tool, available free for academic purposes. [5] relies fundamentally upon the congruences between operational and denotational semantics for CSP, in order to determine a denotational property by exploring an operationally presented system. But the calculation of the standard structured operational semantics of complex systems proves a bottleneck in the performance of the tool, and so we compile a custom inference system for each case, optimised for facilitating execution of the relevant queries. Recent developments have revealed how these calculations can be re-used in restructuring systems to maximise the potential for hierarchical compression and for export to a related probabilistic formalism.", "num_citations": "7\n", "authors": ["1639"]}
{"title": "The meaning and implementation of PRI ALT in occam\n", "abstract": " This paper describes what we believe to be an error in the implementation of PRI ALT on the inmos transputer, and exhibits anomalous behaviour of that implementation. A correct implementation of comparable complexity is described, and some of the properties of the construct are described. Finally, an attempt is made to describe circumstances in which the behaviour of the existing implementation is adequate for the correctness of a program which uses it.", "num_citations": "7\n", "authors": ["1639"]}
{"title": "Property-based compression strategies\n", "abstract": " Property−based compression strategies - ORA - Oxford University Research Archive Logos Header links Search History Bookmarks 0 New Search Deposit Help Footer links Deposit Agreements Disclaimer Privacy Policy Cookies Accessibility Statement Take-down Policy Copyright API Contact Skip to main NEW SEARCH Deposit HELP 0 Back to Search CONTACT Name Email Comment Send message Actions Authors Bibliographic Details Terms of Use Stats Export BibTeX EndNote RefWorks Conference item icon Conference item Property−based compression strategies Actions Email × Send the bibliographic details of this record to your email address. Your Email Please enter the email address that the record information will be sent to. Your message (optional) Please add any additional information to be included within the email. Send Cite × APA Style Zakiuddin, I., Moffat, N., Goldsmith, M., & Whitworth, T. (2002)…", "num_citations": "6\n", "authors": ["1639"]}
{"title": "A survey on screenlogger attacks as well as countermeasures\n", "abstract": " Keyloggers and screenloggers are one of the active growing threats to user's confidentiality as they can run in user-space, easily be distributed and upload information to remote servers. They use a wide number of different technologies and may be implemented in many ways. Keyloggers and screenloggers are very largely diverted from their primary and legitimate function to be exploited for malicious purposes compromising the privacy of users, and bank customers notably. Due to the recent multiplication of mobile devices with a touchscreen, the screenlogger threat has become even more dangerous. This threat is even harder to fight given the limited resources of the affected devices. This paper is the first step of a project aiming at proposing efficient countermeasures against screenloggers. It provides a complete overview of the different techniques used by this malware and discusses an extensive set of …", "num_citations": "5\n", "authors": ["1639"]}
{"title": "Hearing attacks in network data: An effectiveness study\n", "abstract": " Sonification, in which data is represented as sound, can be used to turn network attacks and network-security information into audio signals. This could complement the range of security-monitoring tools currently used in Security Operations Centres (SOCs). Prior work in sonification for network monitoring has not assessed the effectiveness of the technique for enabling users to monitor network-security information. To this end, we aim to investigate the viability of using sonified network datasets to enable humans to detect (recognise the presence of some) and identify (understand the type of) network attacks. In this paper we report the results of a user study in which we assessed the utility of a network-traffic sonification system for representing network attacks. Our results show that by listening to the sonified network data, participants could detect attacks accurately and efficiently, including combinations of attacks …", "num_citations": "5\n", "authors": ["1639"]}
{"title": "RicherPicture: Semi-automated cyber defence using context-aware data analytics\n", "abstract": " In a continually evolving cyber-threat landscape, the detection and prevention of cyber attacks has become a complex task. Technological developments have led organisations to digitise the majority of their operations. This practice, however, has its perils, since cybespace offers a new attack-surface. Institutions which are tasked to protect organisations from these threats utilise mainly network data and their incident response strategy remains oblivious to the needs of the organisation when it comes to protecting operational aspects. This paper presents a system able to combine threat intelligence data, attack-trend data and organisational data (along with other data sources available) in order to achieve automated network-defence actions. Our approach combines machine learning, visual analytics and information from business processes to guide through a decision-making process for a Security Operation Centre …", "num_citations": "5\n", "authors": ["1639"]}
{"title": "NetVis: a Visualization Tool Enabling Multiple Perspectives of Network Traffic Data\n", "abstract": " Computer network traffic visualizations deliver improved understanding of pattern-of-life for networks, and such enhanced awareness can facilitate the detection of malicious traffic. Existing tools often opt for graph or plotbased visualizations to detect patterns or outliers in the data, but they still largely provide segmented views. In this paper we present a novel framework designed to support multiple heterogeneous visualizations of network traffic data. NetVis enables different visualizations that work in tandem to provide different perspectives of the same data in real-time. As each visualization is modularly tied together, it enables a user to investigate on-going activity, or any subset of it, at their pace and based on their priorities for further exploration. We currently support six visualizations, three are new and three are based on existing literature (parallel coordinate plots, flowscan and spinning cube of potential doom …", "num_citations": "5\n", "authors": ["1639"]}
{"title": "Analysis of Dependencies in Critical Infrastructures\n", "abstract": " Unforeseen and unexpected dependencies and interactions within a critical infrastructure (CI) network may pose serious threats, and the lack of knowledge or understanding of such dependencies can be a risk to the system. This is true whether events that propagate adverse impacts through these dependencies have malicious intent or not. We therefore present a framework for modelling and reasoning about dependencies within CIs. The framework includes a domain-specific modelling language for CI dependencies and configuration, a formalism and calculus for reasoning about dependencies within the CI model, and tools to provide analytical capabilities that may be used for decision support during risk assessment and analysis of CIs.", "num_citations": "5\n", "authors": ["1639"]}
{"title": "Transformation of occam programs\n", "abstract": " The value of formal techniques in conventional software engineering is starting to gain recognition even outside academic computer science departments. We maintain that their use is essential in taming the extra complexity that accompanies the extra power that concurrency brings: for while in a FORTRAN program, say, the contribution of the 'program counter' to the number of states that need to be considered is the sum of the contributions of its component modules, in a highly parallel program it is their product. Various paradigms of parallel programming have been suggested, all with much the same expressive power. The authors deal with one of the most tractable: synchronising communications. The authors describe their work on formal manipulation of occam, and give an example of a practical application of program transformation techniques.< >", "num_citations": "5\n", "authors": ["1639"]}
{"title": "Sonification to support the monitoring tasks of security operations centres\n", "abstract": " Sonification (the representation of data as sound) may offer a solution to some of the network-security monitoring challenges faced in security operations centres (SOCs). Prior work has shown that sonification can present network-security information to humans effectively, and indicated that security practitioners foresee potential for sonification to aid in scenarios related to their work. The use of sonification by security practitioners in tasks relevant to SOCs has not been examined, however. To address this gap, we assessed the use of sonification by security practitioners in network-security monitoring tasks in an experimental setting. We report on the results of a study in which we compared the performance of security practitioners using a Security Information and Event Management (SIEM) tool with their performance using a SIEM tool that incorporated sonification, in a primary and a non-primary monitoring task. In …", "num_citations": "4\n", "authors": ["1639"]}
{"title": "A Combined Attack-Tree and Kill-Chain Approach to Designing Attack-Detection Strategies for Malicious Insiders in Cloud Computing\n", "abstract": " Attacks on cloud-computing services are becoming more prevalent with recent victims including Tesla, Aviva Insurance and SIM-card manufacturer Gemalto[1]. The risk posed to organisations from malicious insiders is becoming more widely known about and consequently many are now investing in hardware, software and new processes to try to detect these attacks. As for all types of attack vector, there will always be those which are not known about and those which are known about but remain exceptionally difficult to detect - particularly in a timely manner. We believe that insider attacks are of particular concern in a cloud-computing environment, and that cloud-service providers should enhance their ability to detect them by means of indirect detection. We propose a combined attack-tree and kill-chain based method for identifying multiple indirect detection measures. Specifically, the use of attack trees enables …", "num_citations": "4\n", "authors": ["1639"]}
{"title": "Attack and defence modelling for attacks via the speech interface\n", "abstract": " This paper presents a high-level model of attacks via a speech interface, and of defences against such attacks. Specifically, the paper provides a summary of different types of attacks, and of the defences available to counter them, within the framework of the OODA loop model. The model facilitates an inclusive conceptualisation of attacks via the speech interface, and serves as a basis for critical analysis of the currently available defence measures.", "num_citations": "4\n", "authors": ["1639"]}
{"title": "Wider research applications of dynamic consent\n", "abstract": " As research processes change due to technological developments in how data is collected, stored and used, so must consent methods. Dynamic consent is an online mechanism allowing research participants to revisit consent decisions they have made about how their data is used. Emerging from bio-banking where research data is derived from biological samples, dynamic consent has been designed to address problems with participant engagement and oversight. Through discussion that emerged during a workshop run at the IFIP 2018 Summer School, this paper explores wider research problems could be addressed by dynamic consent. Emergent themes of research design, expectation management and trust suggested overarching research problems which could be addressed with a longer term view of how research data is used, even if that use is unknown at the point of collection. We posit that …", "num_citations": "4\n", "authors": ["1639"]}
{"title": "An Assessment of the Security and Transparency Procedural Components of the Estonian Internet Voting System\n", "abstract": " The I-Voting system designed and implemented in Estonia is one of the first nationwide Internet voting systems. Since its creation, it has been met with praise but also with close scrutiny. Concerns regarding security breaches have focused on in-person election observations, code reviews and adversarial testing on system components. These concerns have led many to conclude that there are various ways in which insider threats and sophisticated external attacks may compromise the integrity of the system and thus the voting process. In this paper, we examine the procedural components of the I-Voting system, with an emphasis on the controls related to procedural security mechanisms, and on system-transparency measures. Through an approach grounded in primary and secondary data sources, including interviews with key Estonian election personnel, we conduct an initial investigation into the extent to which …", "num_citations": "4\n", "authors": ["1639"]}
{"title": "Analytics for characterising and measuring the naturalness of online personae\n", "abstract": " Currently 40 % of the world’s population, around 3 billion users, are online using cyberspace for everything from work to pleasure. While there are numerous benefits accompanying this medium, the Internet is not without its perils. In this case study article, we focus specifically on the challenge of fake (or unnatural) online identities, such as those used to defraud people and organisations, with the aim of exploring an approach to detect them. In particular, through our method and case study we outline and experiment with novel analytics for characterising and measuring the naturalness of an online persona or identity; this naturalness is defined as the extent to which that persona has features similar to those expected for comparable personae online. Our case scenario involves a participant set of two types of individuals, and our aim at this stage is to use our approach to correctly characterise, and then distinguish …", "num_citations": "4\n", "authors": ["1639"]}
{"title": "Tag clouds with a twist: using tag clouds coloured by information’s trustworthiness to support situational awareness\n", "abstract": " The amount and variety of information currently available online is astounding. Information can be found covering any subject and is accessible from any part of the globe. While this is beneficial for countless purposes, whether they be in understanding situations or for making decisions, the sheer amount of information has led to significant problems in information overload. As humans, we are simply unable to consume, reason about, and act on such a vast quantity of information in a timely manner. This is especially true in cases where gathering a quick understanding or awareness of a situation is desirable, or even required. In this article, therefore, we aim to investigate an approach to helping address this problem, which builds on our previous research in the area of assessing and presenting the trustworthiness of online information. Specifically, this article examines the capability of tag (or word) clouds, coloured …", "num_citations": "4\n", "authors": ["1639"]}
{"title": "Predicting Graphical Passwords\n", "abstract": " Over the last decade, the popularity of graphical passwords has increased tremendously. They can now be found on various devices and systems, including platforms such as the Windows 8 and Android operating systems. In this paper, we focus on the PassPoints graphical-password scheme and investigate the extent to which these passwords might be predicted based on knowledge of the individual (e.g., their age, gender, education, learning style). We are particularly interested in understanding whether graphical passwords may suffer the same weaknesses as textual passwords, which are often strongly correlated with an individual using memorable information (such as the individuals spouses, pets, preferred sports teams, children, and so on). This paper also introduces a novel metric for graphical-password strength to provide feedback to an individual without the requirement of knowing the image …", "num_citations": "4\n", "authors": ["1639"]}
{"title": "Formal Methods in the development of the H1 transputer\n", "abstract": " Formal methods in the development of the H1 transputer | Proceedings of the world transputer user group (WOTUG) conference on Transputing '91 ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleProceedingsProceedings of the world transputer user group (WOTUG) conference on Transputing '91Formal methods in the development of the H1 transputer ARTICLE Formal methods in the development of the H1 transputer Share on Authors: Andrew William Roscoe profile image AW Roscoe View Profile , Michael H Goldsmith profile image MH Goldsmith View Profile , ADB Cox profile image ADB Cox View Profile , JB Scattergood profile …", "num_citations": "4\n", "authors": ["1639"]}
{"title": "Sonification Mappings: Estimating Effectiveness, Polarities and Scaling in an Online Experiment\n", "abstract": " Sonification is a technique to present data arrays as sound, thereby taking advantage of the human ability to hear patterns that might otherwise not be apparent. Mappings from parameters of data to parameters of sound form the basis of parameter-mapping sonification. The choice of mappings and their design can influence both the utility of the sonification system and the ability of users to interpret the sounds. In this article the authors demonstrate the use of a time-efficient methodology with an experimental online platform for assessing mappings. Experiments explored the effectiveness of various mappings, and the discussions explore the implications of each approach. Based on the responses of 100 participants in an online Magnitude Estimation experiment, the effectiveness of 16 data-sound mappings was explored. Results showed that mappings involving certain sound parameters were generally effective …", "num_citations": "3\n", "authors": ["1639"]}
{"title": "A state machine system for insider threat detection\n", "abstract": " The risk from insider threats is rising significantly, yet the majority of organizations are ill-prepared to detect and mitigate them. Research has focused on providing rule-based detection systems or anomaly detection tools which use features indicative of malicious insider activity. In this paper we propose a system complimentary to the aforementioned approaches. Based on theoretical advances in describing attack patterns for insider activity, we design and validate a state-machine system that can effectively combine policies from rule-based systems and alerts from anomaly detection systems to create attack patterns that insiders follow to execute an attack. We validate the system in terms of effectiveness and scalability by applying it on ten synthetic scenarios. Our results show that the proposed system allows analysts to craft novel attack patterns and detect insider activity while requiring minimum computational time and memory.", "num_citations": "3\n", "authors": ["1639"]}
{"title": "An ethics framework for research into heterogeneous systems\n", "abstract": " Heterogeneous systems often found in the Internet of Things (IoT) have a wide range of challenges in ethics and law. Any device with an IP address can potentially collect, process, store and share data and make automated decisions in unpredictable ways. When conducting research and development in IoT, it is necessary to have a comprehensive socio-technical understanding of decision-making and data-handling, as well as procedures in place to pre-empt and address unforeseen consequences. In this paper we propose a comprehensive conceptual-modelling approach to help researchers systematically identify, consider and respond to challenges in ethics and law when conducting research and development of heterogeneous systems. Our framework is a six-layered model that addresses these concerns with regards to proximity to the data and actions in question. Using our framework, researchers should …", "num_citations": "3\n", "authors": ["1639"]}
{"title": "Improving the effectiveness of CSIRTs\n", "abstract": " Following the pioneering work at Carnegie-Mellon University in the US, national Computer Emergency Response Teams (CERTs) have been established worldwide to try to address the ever-growing threats to information systems and their use. The problem they are designed to address is clearly real and formidable, although relatively little has been done to measure how effective such national responses are in mitigating the threats posed by cyber-criminals and state-sponsored cyber-attacks. The goal of this paper is to take a first step towards developing metrics which can be used to measure the effectiveness of CSIRTs. A primary motive for doing so is to enable more effective CSIRTs to be implemented, which focus on activities with the maximum impact on threat mitigation. More specifically, this paper aims to identify the ways in which a CSIRT might be deemed to be effective, and possible approaches towards developing CSIRT effectiveness metrics. It also identifies the issues that need to be addressed to realise the goal. Issues such as cooperation, data sharing and trust are discussed as crucial components of an effective CSIRT. Existing measurement types of computer security incident response (NIST, Carnegie Mellon's Software Engineering Institute) are presented before defining a set of suggested direct and indirect measures of the effectiveness of a CSIRT.", "num_citations": "3\n", "authors": ["1639"]}
{"title": "A Pragmatic System-failure Assessment and Response Model.\n", "abstract": " Several attack models exist today that attempt to describe cyber-attacks to varying degrees of granularity. Fast and effective decision-making during cyber-attacks is often vital, especially during incidents in which reputation, finance and physical damage can have a crippling effect on people and organisations. Such attacks can render an organisation paralysed, and it may cease to function, we refer to such an incident as a “System Failure”. In this paper we propose a novel conceptual model to help analysts make pragmatic decisions during a System Failure. Our model distils the essence of attacks and provides an easy-to-remember framework intended to help analysts ask relevant questions at the right time, irrespective of what data is available to them. Using abstraction-based reasoning our model allows enterprises to achieve “some” situational awareness during a System Failure, but more importantly, enable them to act upon their understanding and to justify their decisions. Abstraction drives the reasoning process making the approach relevant today and in the future, unlike several existing models that become deprecated over time (as attacks evolve). In the future, it will be necessary to trial the model in exercises to assess its value.", "num_citations": "3\n", "authors": ["1639"]}
{"title": "Applying Social Network Analysis to Security\n", "abstract": " In this paper, we set out to explore some of the many ways in which Social Network Analysis (SNA) can be applied to the field of security. In particular, we investigate what information someone (eg, an attacker) could infer if they were able to gather data on a person’s friend-groups or device communications (eg, email interactions) and whether this could be used to predict the “hierarchical importance” of the individual. This research could be applied to various social networks to help with criminal investigations by identifying the users with high influence within the criminal gangs on Dark Web Forums, in order to help identify the ring-leaders of the gangs. For this study we conducted an initial investigation on the Enron email dataset, and investigated the effectiveness of existing SNA metrics in establishing hierarchy from the social network created from the email communications metadata. We then tested the metrics on a fresh dataset to assess the practicality of our results to a new network.", "num_citations": "3\n", "authors": ["1639"]}
{"title": "The Meaning and Implementation of SKIP in CSP\n", "abstract": " The CSP model checker FDR has long supported Hoare’s termination semantics for CSP, but has not supported the more theoretically complete construction of Roscoe’s, largely due to the complexity of adding a second termination semantics. In this paper we provide a method of simulating Roscoe’s termination semantics using the Hoare termination semantics and then prove the equivalence of the two different approaches. We also ensure that FDR can support the simulation reasonably efficiently.", "num_citations": "3\n", "authors": ["1639"]}
{"title": "Cyber Warfare: A Multidisciplinary Analysis\n", "abstract": " keywords=\" 2D rainfall rate fields; inverse problem regularization; millimetre terrestrial links; path attenuation; rainfall field estimation; rainfall rate estimation; reconstruction algorithm; retrieval algorithm; terrestrial microwave link measurements; geophysical signal processing; hydrological techniques; inverse problems; microwave links; microwave measurement; rain;\",", "num_citations": "3\n", "authors": ["1639"]}
{"title": "Developing a Strategy for Automated Privacy Testing Suites\n", "abstract": " This paper describes a strategy to develop automated privacy testing suites to assess the correctness of consent and revocation (C&R) controls offered to users by an EnCoRe system. This strategy is based on a formal language in order to provide rigorous and unambiguous consent and revocation specifications, and comprises of two novel procedures that facilitate the process of eliciting testing requirements for privacy properties and creating automated privacy-testing suites. We demonstrate the effectiveness of the strategy by describing our application of the method to a realistic case study, although space limitations preclude a complete presentation.", "num_citations": "3\n", "authors": ["1639"]}
{"title": "Data presentation in security operations centres: exploring the potential for sonification to enhance existing practice\n", "abstract": " Security practitioners working in Security Operations Centres (SOCs) are responsible for detecting and mitigating malicious computer network activity. This work requires both automated tools that detect and prevent attacks, and data presentation tools that can present pertinent network security monitoring information to practitioners in an efficient and comprehensible manner. In recent years, advances have been made in the development of visual approaches to data presentation, with some uptake of advanced security visualization tools in SOCs. Sonification in which data are represented as sound, is said to have potential as an approach that could work alongside existing visual data presentation approaches to address some of the unique challenges faced by SOCs. For example, sonification has been shown to enable peripheral monitoring of processes, which could aid practitioners multitasking in busy …", "num_citations": "2\n", "authors": ["1639"]}
{"title": "Analysing trends and success factors of international cybersecurity capacity-building initiatives\n", "abstract": " The global community has been engaged extensively in assessing and addressing gaps in cybersecurity commitments and capabilities across nations and regions. As a result, a significant number of Cybersecurity Capacity Building (CCB) initiatives were launched to overcome cyber-risks and realise digital dividends. However, these efforts are facing various challenges such as lack of strategy, and duplication. Although extensive research has been carried out on CCB, no single study exists which focuses on analysing CCB initiatives. This gap presents an opportunity for investigating current trends in CCB efforts and identifying the principles for successful CCB initiatives. In this paper, we aim to bridge this gap by collecting and analysing 165 publicly available initiatives. We classify the initiatives based on Oxford’s widely accepted Cybersecurity Capacity Maturity Model (CMM) and perform a descriptive statistical analysis. We further reflect on these initiatives, drawing on well-established success factors from the literature of capacity-building. Towards this end, we also conduct qualitative analysis based on CMM reports for two countries which have experienced socio-economic challenges, Mexico and Brazil, to understand which factors are essential in successful CCB initiatives. We conclude the paper with some interesting results on regional trends, key players, and ingredients of success factors.", "num_citations": "2\n", "authors": ["1639"]}
{"title": "Reasoning about Vulnerabilities in Dependent Information Infrastructures: A Cyber Range Experiment\n", "abstract": " Malice aside, even the pursuit of legitimate local goals such as cost minimisation, availability, and resilience in subsystems of a critical information infrastructure (CII) can induce subtle dynamic behaviours and dependencies that endanger higher-level goals and security of services. However, in practice, the subsystems of a CII may not be entirely cooperative, potentially having different and perhaps conflicting management goals; and some subsystems may be malicious or untrustworthy. Consequently, vulnerabilities may arise accidentally or deliberately through the dependency on subsystems with conflicting goals, or systems which might contain potentially rogue elements. We have developed an analytical framework for reasoning about vulnerabilities and risks in dependent critical infrastructure. To validate the analytical framework we have carried out a series of experiments on a Cyber Range facility …", "num_citations": "2\n", "authors": ["1639"]}
{"title": "A Modelling Approach for Interdependency in Digital Systems-of-Systems Security\n", "abstract": " There is little doubt that the proper functioning of our modern society depends upon cyberspace, and that the continued growth in appetite for new technology and the potential benefits associated with it shows little sign of abating. Unfortunately the reality of modern information and communications systems involves a complex array of hardware, middleware, software, communications protocols and services, operated by a diverse set of stakeholders (users and providers each with a heterogeneous set of changing motives (including personal, enterprise, or societal gains). Everyday services that we take for granted often rely on complex interdependent systems, with the result that a seemingly unrelated failure in one of the subsystems, invisible to the service consumer, may lead to an all too visible collapse of the service that they expect. In the context of information and network risk management this complexity …", "num_citations": "2\n", "authors": ["1639"]}
{"title": "Refinement-friendly bigraphs and spygraphs\n", "abstract": " Over the past decade the successful approach to specification and mechanical analysis of correctness and security properties using CSP and its refinement checker FDR has been extended to contexts including mobile ad-hoc networks and pervasive systems. But the more scope for network reconfiguration the system exhibits, the more intricate and less obviously accurate the models must become in order to accommodate such dynamic behaviour in a language with a basically static process and communication graph. Milner's Bigraph framework, on the other hand, and in particular Blackwell's Spygraph specialisation, are ideally suited for describing intuitively such dynamic reconfigurations of a system and support notions of locality and adjacency which fit them well for reasoning, for instance, about the interface between physical and electronic security; but they lack powerful analytic tool support. Our long-term …", "num_citations": "2\n", "authors": ["1639"]}
{"title": "Beyond Mobility: What Next After CSP/π\n", "abstract": " Process algebras like CSP and CCS inspired the original occam model of communication and process encapsulation. Later the π-calculus and various treatments handling mobility in CSP added support for mobility, as realised in practical programming systems such as occam-π, JCSP, CHP and Sufrin’s CSO, which allow a rather abstract notion of motion of processes and channel ends between parents or owners. Milner’s Space and Motion of Communicating Agents on the other hand describes the bigraph framework, which makes location more of a first-class citizen of the calculus and evolves through reaction rules which rewrite both place and link graphs of matching sections of a system state, allowing more dramatic dynamic reconfigurations of a system than simple process spawning or migration. I consider the tractability of the notation, and to what extent the additional flexibility reflects or elicits desirable programming paradigms.", "num_citations": "2\n", "authors": ["1639"]}
{"title": "An algebraic transformation system for occam programs\n", "abstract": " Occam is a programming language which combines considerable expressive power, particularly tailored towards concurrent problems, with relatively simple semantics well founded in mathematics. The Oxford University Programming Research Group has been associated with the development of the language from the outset, through the close connection between occam and the pure mathematical notation of Communicating Sequential Processes (CSP). The semantics of both occam and CSP have been the subjects of considerable research at PRG. We are a project working under Bill Roscoe to develop and apply this knowledge to practical uses, especially the mechanised (or machine assisted) transformation and verification of occam. We have available two forms of semantic description of occam: denotational and algebraic. The denotational semantics [1] are most suitable as a basis for analysing the …", "num_citations": "2\n", "authors": ["1639"]}
{"title": "Assessing a Decision Support Tool for SOC Analysts\n", "abstract": " It is difficult to discern real-world consequences of attacks on an enterprise when investigating network-centric data alone. In recent years, many tools have been developed to help understand attacks using visualisation, but few aim to predict real-world consequences. We have developed a visualisation tool that aims to improve decision support during attacks in Security Operation Centres (SOCs). Our tool visualises propagation of risks from sensor alert data to Business Process (BP) tasks. This is an important capability gap present in many SOCs today, as most threat detection tools are technology-centric. In this article, we present a user study that assesses our tool’s usability and ability to support the analyst. Ten analysts from seven SOCs performed carefully designed tasks related to understanding risks and recovery decision-making. The study was conducted in laboratory conditions with simulated attacks and …", "num_citations": "1\n", "authors": ["1639"]}
{"title": "Dataset construction and analysis of screenshot malware\n", "abstract": " Among the various types of spyware, screenloggers are distinguished by their ability to capture screenshots. This gives them considerable nuisance capacity, giving rise to theft of sensitive data or, failing that, to serious invasions of the privacy of users. Several examples of attacks relying on this screen capture feature have been documented in recent years. However, there is not sufficient empirical and experimental evidence on this topic. Indeed, to the best of our knowledge, there is no dataset dedicated to screenshot-taking malware until today. The lack of datasets or common testbed platforms makes it difficult to analyse and study their behaviour in order to develop effective countermeasures. The screenshot feature is often a smart feature that does not activate automatically once the malware has infected the machine; the activation mechanisms of this function are often more complex. Consequently, a dataset …", "num_citations": "1\n", "authors": ["1639"]}
{"title": "Black-Box Attacks via the Speech Interface Using Linguistically Crafted Input\n", "abstract": " This paper presents the results of experiments demonstrating novel black-box attacks via the speech interface. We demonstrate two types of attack that use linguistically crafted adversarial input to target vulnerabilities in the handling of speech input by a speech interface. The first attack demonstrates the use of nonsensical word sounds to gain covert access to voice-controlled systems. This attack exploits vulnerabilities at the speech recognition stage of handling of speech input. The second attack demonstrates the use of crafted utterances that are misinterpreted by a target system as a valid voice command. This attack exploits vulnerabilities at the natural language understanding stage of handling of speech input.", "num_citations": "1\n", "authors": ["1639"]}
{"title": "Anomaly Detection Using Pattern-of-Life Visual Metaphors\n", "abstract": " Complex dependencies exist across the technology estate, users and purposes of machines. This can make it difficult to efficiently detect attacks. Visualization to date is mainly used to communicate patterns of raw logs, or to visualize the output of detection systems. In this paper we explore a novel approach to presenting cybersecurity-related information to analysts. Specifically, we investigate the feasibility of using visualizations to make analysts become anomaly detectors using Pattern-of-Life Visual Metaphors. Unlike glyph metaphors, the visualizations themselves (rather than any single visual variable on screen) transform complex systems into simpler ones using different mapping strategies. We postulate that such mapping strategies can yield new, meaningful ways to showing anomalies in a manner that can be easily identified by analysts. We present a classification system to describe machine and human …", "num_citations": "1\n", "authors": ["1639"]}
{"title": "On properties of cyberattacks and their nuances\n", "abstract": " PurposeSeveral attack models attempt to describe behaviours of attacks with the intent to understand and combat them better. However, all models are to some degree incomplete. They may lack insight about minor variations about attacks that are observed in the real world (but are not described in the model). This may lead to similar attacks being classified as the same type of attack, or in some cases the same instance of attack. The appropriate solution would be to modify the model or replace it entirely. However, doing so may be undesirable as the model may work well for most cases or time and resource constraints may factor in as well. This paper aims to explore the potential value of adding information about attacks and attackers to existing models.Design/methodology/approachThis paper investigates used cases of minor variations in attacks and how it may and may not be appropriate to communicate subtle …", "num_citations": "1\n", "authors": ["1639"]}
{"title": "POSTER: Detection of Online Radical Content Using Multimodal Approach\n", "abstract": " Several criminal and terrorist organisations have benefited tremendously from the worldwide reach, growth, and speed of the Internet. By utilising the Internet and multiple social media platforms, they are now able to spread their views, widen their reach, and have opportunities to recruit people from all over the world. This has also given them a media platform to broadcast their messages and different propaganda material aiming to spread fear, radicalise and recruit potential members. Previous study has demonstrated that the use of Internet by terrorist groups has significantly increased in the recent years [1]. Several social media platforms such as Twitter and Facebook are working towards keeping these platforms clean by suspending those who are promoting violent content or extremist behaviour. However, due to the volume and speed of the generated data it is still challenging to detect those misbehaving users accurately and in a timely manner. Recent research has focused on studying the online behaviour of pro-extremists users mainly by performing contentbased analysis in order to identify distinguishing textual features that can aid in automatic detection of these users [2]. However, using this approach alone has several shortcomings including producing a large number of false positives, having a high dependency on the data, and it can be easily evaded by adapting the users writing styles through automated tools. Ashcroft et al. make an attempt to automatically detect Jihadist messages on Twitter [2]. They adopt a machine-learning method to classify tweets as ISIS supporters or not. They focus on English tweets that contain a reference …", "num_citations": "1\n", "authors": ["1639"]}
{"title": "The Relative Effectiveness of widely used Risk Controls and the Real Value of Compliance\n", "abstract": " As the volume of cyber-attacks continues to rise and also the levels of harm suffered from them, it is becoming critical that organisations can demonstrate that reasonable efforts are being undertaken to reduce cyber-risk. However, the risk responses and controls typically viewed as necessary, and even essential, by the professional and expert community are generally not underpinned by any framework that facilitates rigorous reasoning, qualification or quantification of the benefits resulting from their deployment. This means that the real value of compliance, or the variability of compliance, to risk-control standards is not well reasoned or measurable in any scientific, unambiguous or verifiable sense.This further means that methods used to manage, mitigate or transfer the risk by stakeholders across the information security and cyber risk landscapeare existing increasingly in isolation. Our study here has shown that a more rigorous risk valuation and risk management environment can only fully exists where transparent and effective collaboration between stakeholders exists. Only through such collaboration can risk be fully understood, modelled, valued and thus managed.", "num_citations": "1\n", "authors": ["1639"]}
{"title": "Information trustworthiness as a solution to the misinformation problems in social media\n", "abstract": " The advent of the Internet has reshaped the way we communicate and interact in our daily lives. It provides an ideal medium through which we can share information and ideas, form groups, and contribute to a variety of discussions. In this position paper, we focus specifically on the information now available online – especially content from social media – to consider in detail the challenges that such information poses to modern-day society. Typical examples of challenges include the prevalence of mistaken information and deliberate misinformation and rumours. With an understanding of these challenges, we then introduce the notion of information-trustworthiness measures as a potential solution to the problem of misinformation in social media. The idea here is to use quality and trust metrics to assess information, and then, based on values attained, advise users whether or not they should trust the content. This paper extends our previous research in the field by assessing the misinformation problem in much greater detail, and also presenting our current agenda for future work.", "num_citations": "1\n", "authors": ["1639"]}
{"title": "Formalising Requirements for a Biobank Case Study Using a Logic for Consent and Revocation\n", "abstract": " In this paper we focus on formalising privacy requirements for the Oxford Radcliffe Biobank (ORB) case study that has emerged within the EnCoRe project. We express the requirements using a logic designed for reasoning about the dynamics of privacy and specifically for capturing the lifecycle of consent and revocation (C&R) controls that a user may invoke. We demonstrate how to tackle ambiguities uncovered in the formalisation and to bridge the gap between user requirements for personal data privacy and system level policy languages effectively.", "num_citations": "1\n", "authors": ["1639"]}
{"title": "Classifying unbounded nondeterminism in CSP\n", "abstract": " Classifying unbounded nondeterminism in CSP | Topology and category theory in computer science ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleBooksTopology and category theory in computer scienceClassifying unbounded nondeterminism in CSP chapter Classifying unbounded nondeterminism in CSP Share on Authors: G. Barrett profile image Geoff Barrett View Profile , Michael H Goldsmith profile image Michael Goldsmith View Profile Authors Info & Affiliations Publication: Topology and category theory in computer scienceSeptember 1991 Pages 57–74 0citation 0 Downloads Metrics Total Citations0 Total Downloads0 Last …", "num_citations": "1\n", "authors": ["1639"]}