{"title": "Minimizing multimodal functions of continuous variables with the “simulated annealing” algorithm—Corrigenda for this article is available here\n", "abstract": " A new global optimization algorithm for functions of continuous variables is presented, derived from the “Simulated Annealing” algorithm recently introduced in combinatorial optimization. The algorithm is essentially an iterative random search procedure with adaptive moves along the coordinate directions. It permits uphill moves under the control of a probabilistic criterion, thus tending to avoid the first local minima encountered. The algorithm has been tested against the Nelder and Mead simplex method and against a version of Adaptive Random Search. The test functions were Rosenbrock valleys and multiminima functions in 2,4, and 10 dimensions. The new method proved to be more reliable than the others, being always able to find the optimum, or at least a point very close to it. It is quite costly in term of function evaluations, but its cost can be predicted in advance, depending only slightly on the starting point.", "num_citations": "2107\n", "authors": ["1207"]}
{"title": "Scaling and criticality in a stochastic multi-agent model of a financial market\n", "abstract": " Financial prices have been found to exhibit some universal characteristics 1, 2, 3, 4, 5, 6 that resemble the scaling laws characterizing physical systems in which large numbers of units interact. This raises the question of whether scaling in finance emerges in a similar way—from the interactions of a large ensemble of market participants. However, such an explanation is in contradiction to the prevalent ‘efficient market hypothesis’7 in economics, which assumes that the movements of financial prices are an immediate and unbiased reflection of incoming news about future earning prospects. Within this hypothesis, scaling in price changes would simply reflect similar scaling in the ‘input’signals that influence them. Here we describe a multi-agent model of financial markets which supports the idea that scaling arises from mutual interactions of participants. Although the ‘news arrival process’ in our model lacks both …", "num_citations": "1879\n", "authors": ["1207"]}
{"title": "Volatility clustering in financial markets: a microsimulation of interacting agents\n", "abstract": " The finding of clustered volatility and ARCH effects is ubiquitous in financial data. This paper presents a possible explanation for this phenomenon within a multi-agent framework of speculative activity. In the model, both chartist and fundamentalist strategies are considered with agents switching between both behavioural variants according to observed differences in pay-offs. Price changes are brought about by a market maker reacting to imbalances between demand and supply. Most of the time, a stable and efficient market results. However, its usual tranquil performance is interspersed by sudden transient phases of destabilisation. An outbreak of volatility occurs if the fraction of agents using chartist techniques surpasses a certain threshold value, but such phases are quickly brought to an end by stabilising tendencies. Formally, this pattern can be understood as an example of a new type of dynamic behaviour …", "num_citations": "956\n", "authors": ["1207"]}
{"title": "A hybrid genetic-neural architecture for stock indexes forecasting\n", "abstract": " In this paper, a new approach for time series forecasting is presented. The forecasting activity results from the interaction of a population of experts, each integrating genetic and neural technologies. An expert of this kind embodies a genetic classifier designed to control the activation of a feedforward artificial neural network for performing a locally scoped forecasting activity. Genetic and neural components are supplied with different information: The former deal with inputs encoding information retrieved from technical analysis, whereas the latter process other relevant inputs, in particular past stock prices. To investigate the performance of the proposed approach in response to real data, a stock market forecasting system has been implemented and tested on two stock market indexes, allowing for account realistic trading commissions. The results pointed to the good forecasting capability of the approach, which …", "num_citations": "378\n", "authors": ["1207"]}
{"title": "Agent-based simulation of a financial market\n", "abstract": " This paper introduces an agent-based artificial financial market in which heterogeneous agents trade one single asset through a realistic trading mechanism for price formation. Agents are initially endowed with a finite amount of cash and a given finite portfolio of assets. There is no money-creation process; the total available cash is conserved in time. In each period, agents make random buy and sell decisions that are constrained by available resources, subject to clustering, and dependent on the volatility of previous periods. The model proposed herein is able to reproduce the leptokurtic shape of the probability density of log price returns and the clustering of volatility. Implemented using extreme programming and object-oriented technology, the simulator is a flexible computational experimental facility that can find applications in both academic and industrial research projects.", "num_citations": "346\n", "authors": ["1207"]}
{"title": "Power-laws in a large object-oriented software system\n", "abstract": " We present a comprehensive study of an implementation of the Smalltalk object oriented system, one of the first and purest object-oriented programming environment, searching for scaling laws in its properties. We study ten system properties, including the distributions of variable and method names, inheritance hierarchies, class and method sizes, system architecture graph. We systematically found Pareto - or sometimes log-normal - distributions in these properties. This denotes that the programming activity, even when modeled from a statistical perspective, can in no way be simply modeled as a random addition of independent increments with finite variance, but exhibits strong organic dependencies on what has been already developed. We compare our results with similar ones obtained for large Java systems, reported in the literature or computed by ourselves for those properties never studied before, showing …", "num_citations": "306\n", "authors": ["1207"]}
{"title": "Blockchain-oriented software engineering: challenges and new directions\n", "abstract": " In this work, we acknowledge the need for software engineers to devise specialized tools and techniques for blockchain-oriented software development. Ensuring effective testing activities, enhancing collaboration in large teams, and facilitating the development of smart contracts all appear as key factors in the future of blockchain-oriented software development.", "num_citations": "270\n", "authors": ["1207"]}
{"title": "Banking on blockchain: Costs savings thanks to the blockchain technology\n", "abstract": " This paper looks at the challenges and opportunities of implementing blockchain technology across banking, providing food for thought about the potentialities of this disruptive technology. The blockchain technology can optimize the global financial infrastructure, achieving sustainable development, using more efficient systems than at present. In fact, many banks are currently focusing on blockchain technology to promote economic growth and accelerate the development of green technologies. In order to understand the potential of blockchain technology to support the financial system, we studied the actual performance of the Bitcoin system, also highlighting its major limitations, such as the significant energy consumption due to the high computing power required, and the high cost of hardware. We estimated the electrical power and the hash rate of the Bitcoin network, over time, and, in order to evaluate the efficiency of the Bitcoin system in its actual operation, we defined three quantities:“economic efficiency”,“operational efficiency”, and “efficient service”. The obtained results show that by overcoming the disadvantages of the Bitcoin system, and therefore of blockchain technology, we could be able to handle financial processes in a more efficient way than under the current system. View Full-Text", "num_citations": "210\n", "authors": ["1207"]}
{"title": "Applications of simulated annealing for the design of special digital filters\n", "abstract": " This paper describes the salient features of using a simulated annealing (SA) algorithm in the context of designing digital filters with coefficient values expressed as the sum of power of two. A procedure for linear phase digital filter design, using this algorithm, is first presented and tested, yielding results as good as known optimal methods. The algorithm is then applied to the design of Nyquist filters, optimizing at the same time both frequency response and intersymbol interference, and to the design of cascade form FIR filters. Although SA is not a solution to all design problems, and is computationally very expensive, it may be an important method for designing special digital filters where numerous or conflicting constraints are present.", "num_citations": "202\n", "authors": ["1207"]}
{"title": "OOA metrics for the Unified Modeling Language\n", "abstract": " UML is the emerging standard for expressing OOA/OOD models. New metrics for object oriented analysis models are introduced, and existing ones are adapted to the entities and concepts of UML. In particular, these metrics concern UML use case diagrams and class diagrams used during the OOA phase. The proposed metrics are intended to allow an early estimate of development efforts, implementation time and cost of the system under development, and to measure its object orientedness and quality since the beginning of the analysis phase. The proposed metric suite is described in detail, and its relations with proposed metrics found in the literature are highlighted. Some measurements on three software projects are given.", "num_citations": "197\n", "authors": ["1207"]}
{"title": "Fast neural networks without multipliers\n", "abstract": " Multilayer perceptrons (MLPs) with weight values restricted to powers of two or sums of powers of two are introduced. In a digital implementation, these neural networks do not need multipliers but only shift registers when computing in forward mode, thus saving chip area and computation time. A learning procedure, based on backpropagation, is presented for such neural networks. This learning procedure requires full real arithmetic and therefore must be performed offline. Some test cases are presented, concerning MLPs with hidden layers of different sizes, on pattern recognition problems. Such tests demonstrate the validity and the generalization capability of the method and give some insight into the behavior of the learning algorithm.< >", "num_citations": "168\n", "authors": ["1207"]}
{"title": "Testing for non-linear structure in an artificial financial market\n", "abstract": " We present a stochastic simulation model of a prototype financial market. Our market is populated by both noise traders and fundamentalist speculators. The dynamics covers switches in the prevailing mood among noise traders (optimistic or pessimistic) as well as switches of agents between the noise trader and fundamentalist group in response to observed differences in profits. The particular behavioral variant adopted by an agent also determines his decision to enter on the long or short side of the market. Short-run imbalances between demand and supply lead to price adjustments by a market maker or auctioneer in the usual Walrasian manner. Our interest in this paper is in exploring the behavior of the model when testing for the presence of chaos or non-linearity in the simulated data. As it turns out, attempts to determine the fractal dimension of the underlying process give unsatisfactory results in that we …", "num_citations": "153\n", "authors": ["1207"]}
{"title": "Extreme programming examined\n", "abstract": " This is a collection of papers from the first annual Conference on Extreme Programming and Flexible Processes in Software Engineering, held in Italy in June 2000. Through careful selection and organization, this collection of 33 papers provides an excellent overview of the issues and discussions on the new development methodology, Extreme Programming. The collection of papers cover a broad and diverse set of topics, grouped into parts: Part 1: principles of XP Part 2: some methodology and process issues for XP, including topics on reference architecture, frameworks, project organization and large scale software development Part 3: XP in relationship to the Unified Modeling Language (UML) and the Unified Software Development Process (USDP), maintenance and patterns Part 4: XP key practices, including pair programming, unit testing and refactoring Part 5: tools to support XP, such as refactoring …", "num_citations": "141\n", "authors": ["1207"]}
{"title": "Bitcoin Spread Prediction Using Social and Web Search Media.\n", "abstract": " In the last decade, Web 2.0 services such as blogs, tweets, forums, chats, email etc. have been widely used as communication media, with very good results. Sharing knowledge is an important part of learning and enhancing skills. Furthermore, emotions may affect decisionmaking and individual behavior. Bitcoin, a decentralized electronic currency system, represents a radical change in financial systems, attracting a large number of users and a lot of media attention. In this work, we investigated if the spread of the Bitcoin’s price is related to the volumes of tweets or Web Search media results. We compared trends of price with Google Trends data, volume of tweets and particularly with those that express a positive sentiment. We found significant cross correlation values, especially between Bitcoin price and Google Trends data, arguing our initial idea based on studies about trends in stock and goods market.", "num_citations": "129\n", "authors": ["1207"]}
{"title": "Using an artificial financial market for assessing the impact of Tobin-like transaction taxes\n", "abstract": " The Tobin tax is a solution proposed by many economists for limiting the speculation in foreign exchange and stock markets and for making these markets stabler. In this paper we present a study on the effects of a transaction tax on one and on two related markets, using an artificial financial market based on heterogeneous agents.The microstructure of the market is composed of four kinds of traders: random traders, fundamentalists, momentum traders and contrarians, and the resources allocated to them are limited. In each market it is possible to levy a transaction tax. In the case of two markets, each trader can choose in which market to trade, and an attraction function is defined that drives their choice based on perceived profitability. We performed extensive simulations and found that the tax actually increases volatility and decreases trading volumes. These findings are discussed in the paper.", "num_citations": "129\n", "authors": ["1207"]}
{"title": "The ICO phenomenon and its relationships with ethereum smart contract environment\n", "abstract": " Initial Coin Offerings (ICO) are public offers of new cryptocurrencies in exchange of existing ones, aimed to finance projects in the blockchain development arena. In the last 8 months of 2017, the total amount gathered by ICOs exceeded 4 billion US$, and overcame the venture capital funnelled toward high tech initiatives in the same period. A high percentage of ICOs is managed through Smart Contracts running on Ethereum blockchain, and in particular to ERC-20 Token Standard Contract. In this work we examine 1387 ICOs, published on December 31, 2017 on icobench.com website, gathering information relevant to the assessment of their quality and software development management, including data on their development teams. We also study, at the same date, the financial data of 450 ICO tokens available on coinmarketcap.com website, among which 355 tokens are managed on Ethereum blochain. We …", "num_citations": "126\n", "authors": ["1207"]}
{"title": "Using an artificial financial market for studying a cryptocurrency market\n", "abstract": " This paper presents an agent-based artificial cryptocurrency market in which heterogeneous agents buy or sell cryptocurrencies, in particular Bitcoins. In this market, there are two typologies of agents, Random Traders and Chartists, which interact with each other by trading Bitcoins. Each agent is initially endowed with a finite amount of crypto and/or fiat cash and issues buy and sell orders, according to her strategy and resources. The number of Bitcoins increases over time with a rate proportional to the real one, even if the mining process is not explicitly modelled. The model proposed is able to reproduce some of the real statistical properties of the price returns observed in the Bitcoin real market. In particular, it is able to reproduce the unit root property, the fat tail phenomenon and the volatility clustering. The simulator has been implemented using object-oriented technology, and could be considered a …", "num_citations": "121\n", "authors": ["1207"]}
{"title": "Molecular dynamics simulation of liquid water between two walls\n", "abstract": " A molecular dynamics simulation, lasting ≈25 ps, has been performed with 150 ST2 water molecules between two quasi-hard repulsive walls, at a temperature of 302 K. A number of static and dynamic properties have been computed as a function of the distance from the walls, showing that water near the walls is in general more “ordered” than in the bulk, and that this bulk water behaves like ordinarv liquid ST2 water.", "num_citations": "112\n", "authors": ["1207"]}
{"title": "Empirical analysis on the satisfaction of IT employees comparing XP practices with other software development methodologies\n", "abstract": " Job satisfaction has been studied by economists and psychologists. We believe this factor is very important in that it influences the effectiveness of the software development process. This paper reports the first results of a comparative analytic study on the job satisfaction of developers that use XP practices and others that do not use XP practices. By determining the factors that are highly valued by developers, the research can provide insight in currently practised software development processes, and help make changes that increase their strategic value.", "num_citations": "98\n", "authors": ["1207"]}
{"title": "Traders' long-run wealth in an artificial financial market\n", "abstract": " In this paper, we study the long-run wealth distribution of agents with different trading strategies in the framework of the Genoa Artificial Stock Market.The Genoa market is an agent-based simulated market able to reproduce the main stylised facts observed in financial markets, i.e., fat-tailed distribution of returns and volatility clustering. Various populations of traders have been introduced in a`thermal bath' made by random traders who make random buy and sell decisions constrained by the available limited resources and depending on past price volatility. We study both trend following and trend contrarian behaviour; fundamentalist traders (i.e., traders believing that stocks have a fundamental price depending on factors external to the market) are also investigated. Results show that the strategy alone does not allow forecasting which population will prevail. Trading strategies yield different results in different …", "num_citations": "98\n", "authors": ["1207"]}
{"title": "Crypto-trading: Blockchain-oriented energy market\n", "abstract": " Bloekehain - software technology used for peer-to-peer transaction platforms - is being increasingly applied to alternative opportunities for a variety of industries and use cases such as also in the energy sector. As of now all energy related to blockchain applications are still in a concept stage. This paper aims to present the preliminary ideas of a research project that we have launched in collaboration with a small Fintech company: the Crypto-Trading project. From a research perspective we have explored how a blockchain-based system integrating smart contract functionality can be used to share energy in order to promote smart grids for the management of electricity in the Sardinia Region. From a technical perspective the project will implement a modular blockchain-based software platform for extending the features of cryptocurrency exchanges to the renewable Energy Market, including a robo-advisor which will …", "num_citations": "88\n", "authors": ["1207"]}
{"title": "The emotional side of software developers in JIRA\n", "abstract": " Issue tracking systems store valuable data for testing hypotheses concerning maintenance, building statistical prediction models and (recently) investigating developer affectiveness. For the latter, issue tracking systems can be mined to explore developers emotions, sentiments and politeness -affects for short. However, research on affect detection in software artefacts is still in its early stage due to the lack of manually validated data and tools. In this paper, we contribute to the research of affects on software artefacts by providing a labeling of emotions present on issue comments. We manually labeled 2,000 issue comments and 4,000 sentences written by developers with emotions such as love, joy, surprise, anger, sadness and fear. Labeled comments and sentences are linked to software artefacts reported in our previously published dataset (containing more than 1K projects, more than 700K issue reports and …", "num_citations": "86\n", "authors": ["1207"]}
{"title": "Modeling and Simulation of the Economics of Mining in the Bitcoin Market\n", "abstract": " In January 3, 2009, Satoshi Nakamoto gave rise to the “Bitcoin Blockchain”, creating the first block of the chain hashing on his computer’s central processing unit (CPU). Since then, the hash calculations to mine Bitcoin have been getting more and more complex, and consequently the mining hardware evolved to adapt to this increasing difficulty. Three generations of mining hardware have followed the CPU’s generation. They are GPU’s, FPGA’s and ASIC’s generations. This work presents an agent-based artificial market model of the Bitcoin mining process and of the Bitcoin transactions. The goal of this work is to model the economy of the mining process, starting from GPU’s generation, the first with economic significance. The model reproduces some “stylized facts” found in real-time price series and some core aspects of the mining business. In particular, the computational experiments performed can reproduce the unit root property, the fat tail phenomenon and the volatility clustering of Bitcoin price series. In addition, under proper assumptions, they can reproduce the generation of Bitcoins, the hashing capability, the power consumption, and the mining hardware and electrical energy expenditures of the Bitcoin network.", "num_citations": "76\n", "authors": ["1207"]}
{"title": "Molecular dynamics simulation of water near walls using an improved wall—water interaction potential\n", "abstract": " Two molecular dynamics simulations, lasting 14 and 24 ps, have been performed with 150 water molecules between two walls. The wall potential is obtaine", "num_citations": "72\n", "authors": ["1207"]}
{"title": "The jira repository dataset: Understanding social aspects of software development\n", "abstract": " Issue tracking systems store valuable data for testing hypotheses concerning maintenance, building statistical prediction models and recently investigating developers\" affectiveness\". In particular, the Jira Issue Tracking System is a proprietary tracking system that has gained a tremendous popularity in the last years and offers unique features like the project management system and the Jira agile kanban board. This paper presents a dataset extracted from the Jira ITS of four popular open source ecosystems (as well as the tools and infrastructure used for extraction) the Apache Software Foundation, Spring, JBoss and CodeHaus communities. Our dataset hosts more than 1K projects, containing more than 700K issue reports and more than 2 million issue comments. Using this data, we have been able to deeply study the communication process among developers, and how this aspect affects the development …", "num_citations": "70\n", "authors": ["1207"]}
{"title": "On the distribution of bugs in the eclipse system\n", "abstract": " The distribution of bugs in software systems has been shown to satisfy the Pareto principle, and typically shows a power-law tail when analyzed as a rank-frequency plot. In a recent paper, Zhang showed that the Weibull cumulative distribution is a very good fit for the Alberg diagram of bugs built with experimental data. In this paper, we further discuss the subject from a statistical perspective, using as case studies five versions of Eclipse, to show how log-normal, Double-Pareto, and Yule-Simon distributions may fit the bug distribution at least as well as the Weibull distribution. In particular, we show how some of these alternative distributions provide both a superior fit to empirical data and a theoretical motivation to be used for modeling the bug generation process. While our results have been obtained on Eclipse, we believe that these models, in particular the Yule-Simon one, can generalize to other software systems.", "num_citations": "67\n", "authors": ["1207"]}
{"title": "Who wins? Study of long-run trader survival in an artificial stock market\n", "abstract": " We introduce a multi-asset artificial financial market with finite amount of cash and number of stocks. The background trading is characterized by a random trading strategy constrained by the finiteness of resources and by market volatility. Stock price processes exhibit volatility clustering, fat-tailed distribution of returns and reversion to the mean. Three active trading strategies have been introduced and studied in two different market conditions: steady market and growing market with asset inflation. We show that the profitability of each strategy depends both on the periodicity of portfolio reallocation and on the market condition. The best performing strategy is the one that exploits the mean reversion characteristic of asset price processes.", "num_citations": "66\n", "authors": ["1207"]}
{"title": "Non linear satellite radio links equalized using blind neural networks\n", "abstract": " After an ad hoc extension of the multilayer perceptron model to complex signals, a blind neural network equalizer is proposed. Several experimental results are also reported which prove the effectiveness of this approach for equalizing a digital satellite radio channel in the presence of mild nonlinearities and intersymbol interference. Moreover, the proposed method works without any knowledge about the nonlinear nature of the channel.", "num_citations": "66\n", "authors": ["1207"]}
{"title": "Software development: do good manners matter?\n", "abstract": " A successful software project is the result of a complex process involving, above all, people. Developers are the key factors for the success of a software development process, not merely as executors of tasks, but as protagonists and core of the whole development process. This paper investigates social aspects among developers working on software projects developed with the support of Agile tools. We studied 22 open-source software projects developed using the Agile board of the JIRA repository. All comments committed by developers involved in the projects were analyzed and we explored whether the politeness of comments affected the number of developers involved and the time required to fix any given issue. Our results showed that the level of politeness in the communication process among developers does have an effect on the time required to fix issues and, in the majority of the analysed projects, it had a positive correlation with attractiveness of the project to both active and potential developers. The more polite developers were, the less time it took to fix an issue.", "num_citations": "64\n", "authors": ["1207"]}
{"title": "A massive analysis of ethereum smart contracts empirical study and code metrics\n", "abstract": " In this work, we perform a comprehensive empirical study of smart contracts deployed on the ethereum blockchain. The objective of the analysis is to provide empirical results on smart contracts features, smart contract transactions within the blockchain, the role of the development community, and the source code characteristics. We collected a set of more than 10000 smart contracts source codes and a dataset of meta-data regarding their interaction with the blockchain from etherscan.io. We examined the collected data computing different statistics on naming policies, smart contract ether balance, number of smart contract transactions, functions, and other quantities characterizing the use and purpose of smart contracts. We found that the number of transactions and the balances follow power-law distributions and the software code metrics display, on average, values lower than corresponding metrics in standard …", "num_citations": "62\n", "authors": ["1207"]}
{"title": "An agile software engineering method to design blockchain applications\n", "abstract": " Cryptocurrencies and their foundation technology, the Blockchain, are reshaping finance and economics, allowing a decentralized approach enabling trusted applications with no trusted counterpart. More recently, the Blockchain and the programs running on it, called Smart Contracts, are also finding more and more applications in all fields requiring trust and sound certifications. Some people have come to the point of saying that the\" Blockchain revolution\" can be compared to that of the Internet and the Web in their early days. As a result, all the software development revolving around the Blockchain technology is growing at a staggering rate. The feeling of many software engineers about such huge interest in Blockchain technologies is that of unruled and hurried software development, a sort of competition on a first-come-first-served basis which does not assure neither software quality, nor that the basic concepts …", "num_citations": "62\n", "authors": ["1207"]}
{"title": "Simulating kanban and scrum vs. waterfall with system dynamics\n", "abstract": " Nowadays, Scrum is the most used Agile Methodology, while the Lean-Kanban approach is perhaps the fastest growing AM. On the other hand, traditional, waterfall-like approaches are still very used in real-life software projects, due to the ease of up-front planning and budgeting, that however are seldom matched upon project completion. In our opinion, more effort is needed to study and model the inner structure and behavior of these approaches, highlighting positive and negative feedback loops that are strategic to understand their features, and to decide on their adoption. In this paper we analyze the dynamic behavior of the adoption of Kanban and Scrum, versus a traditional software development process such as the Waterfall approach. We use a system dynamics model, based on the relationships between system variables, to assess the relative benefits of the studied approaches. The model is …", "num_citations": "62\n", "authors": ["1207"]}
{"title": "Digital filters design by simulated annealing\n", "abstract": " Presents preliminary results on the application of the simulated annealing (SA) algorithm to solve the general discrete coefficients filter design problem. The main characteristics of the approach taken with respect to optimal algorithms is that no particular assumptions are made on the filter structure or the cost function. With respect to heuristic methods, no particular starting point is needed, and no heuristics have to be invented for the design problem. The conclusion is that the approach is very versatile and have a very simple implementation: only the cost function and a few pieces of information need to be supplied. The main drawback is its high computational cost, which is one or two orders of magnitude more than conventional methods.< >", "num_citations": "61\n", "authors": ["1207"]}
{"title": "Learning of Chua's circuit attractors by locally recurrent neural networks\n", "abstract": " Many practical applications of neural networks require the identification of strongly non-linear (e.g., chaotic) systems. In this paper, locally recurrent neural networks (LRNNs) are used to learn the attractors of Chua's circuit, a paradigm for studying chaos. LRNNs are characterized by a feed-forward structure whose synapses between adjacent layers have taps and feedback connections. In general, the learning procedures of LRNNs are computationally simpler than those of globally recurrent networks. Results show that LRNNs can be trained to identify the underlying link among Chua's circuit state variables, and exhibit chaotic attractors under autonomous working conditions.", "num_citations": "56\n", "authors": ["1207"]}
{"title": "Would you mind fixing this issue?\n", "abstract": " A successful software project is the result of a complex process involving, above all, people. Developers are the key factors for the success of a software development process and the Agile philosophy is developer-centred. Developers are not merely executors of tasks, but actually the protagonists and core of the whole development process. This paper aims to investigate social aspects among developers working together and the appeal of a software project developed with the support of Agile tools such as Agile boards. We studied 14 open source software projects developed using the Agile board of the JIRA repository. We analysed all the comments committed by the developers involved in the projects and we studied whether the politeness of the comments affected the number of developers involved over the years and the time required to fix any given issue. Our results show that the level of politeness …", "num_citations": "49\n", "authors": ["1207"]}
{"title": "A modified Yule process to model the evolution of some object-oriented system properties\n", "abstract": " We present a model based on the Yule process, able to explain the evolution of some properties of large object-oriented software systems. We study four system properties related to code production of four large object-oriented software systems – Eclipse, Netbeans, JDK and Ant. The properties analysed, namely the naming of variables and methods, the call to methods and the inheritance hierarchies, show a power-law distribution as reported in previous papers for different systems. We use the simulation approach to verify the goodness of our model, finding a very good correspondence between empirical data of subsequent software versions, and the prediction of the model presented.", "num_citations": "49\n", "authors": ["1207"]}
{"title": "Measurements of complex dielectric constant of human sera and erythrocytes\n", "abstract": " A method for measuring the complex permittivity of biological liquids at microwave frequencies is presented. The calibration needs three reference materials; this method allows measurements to be made very quickly, using only very small amounts of material. Measurements were made on human erythrocytes, obtaining their inner conductivity using Fricke's equation, and on human sera of normal and sick individuals. Using an optimization technique, some parameters related to the water bound to the serum proteins were identified, showing differences possibly related to the presence of certain diseases.", "num_citations": "45\n", "authors": ["1207"]}
{"title": "An empirical study of software metrics for assessing the phases of an agile project\n", "abstract": " We present an analysis of the evolution of a Web application project developed with object-oriented technology and an agile process. During the development we systematically performed measurements on the source code, using software metrics that have been proved to be correlated with software quality, such as the Chidamber and Kemerer suite and Lines of Code metrics. We also computed metrics derived from the class dependency graph, including metrics derived from Social Network Analysis. The application development evolved through phases, characterized by a different level of adoption of some key agile practices — namely pair programming, test-based development and refactoring. The evolution of the metrics of the system, and their behavior related to the agile practices adoption level, is presented and discussed. We show that, in the reported case study, a few metrics are enough to characterize …", "num_citations": "44\n", "authors": ["1207"]}
{"title": "Measuring and understanding the effectiveness of jira developers communities\n", "abstract": " Tools for project management and issues/bugs tracking are becoming useful for governing the development process of Open Source software. Such tools simplify the communications process among developers and ensure the scalability of a project. The more information developers are able to exchange, the clearer are the goals, and the higher is the number of developers keen on joining and actively collaborating on a project. In this paper we present a preliminary empirical analysis of the communities-structure of developers in JIRA by analyzing 7 popular projects hosted in the repository. We analyze how these communities perform in terms of issue-resolution time of any given issue. The main contributions of this work are the confirmation of the existence of communities in developer networks, and the empirical finding that the issue resolution-time of any given issue is not correlated with the dimension of a …", "num_citations": "43\n", "authors": ["1207"]}
{"title": "Distributed Scrum in research project management\n", "abstract": " Can research projects be agile? In this paper we describe our proposal of applying Scrum for the management of an European research project aimed at developing an agent-based software platform for European economic policy design. The use of an agile, adaptive methodology is justified because successful research projects are complex, unstable processes, that should be continuously adapted along their way. We describe in detail the roles, artifacts and practices of the proposed process, and the first steps of its adoption.", "num_citations": "43\n", "authors": ["1207"]}
{"title": "A neural network diagnosis approach for analog circuits\n", "abstract": " This paper presents a neural network system for the diagnosis of analog circuits and shows how the performance of such a system can be affected by the choice of different techniques used by its submodules. In particular we discuss the influence of feature extraction techniques such as Fourier Transforms, Wavelets and Principal Component Analysis. The system uses several different power supplies and as many neural networks “in parallel”. Two different algorithms that can be used to combine the candidate sets produced by each network are also presented. The system is capable of diagnosing multiple faults even if trained on single ones.", "num_citations": "43\n", "authors": ["1207"]}
{"title": "On the suitability of Yule process to stochastically model some properties of object-oriented systems\n", "abstract": " We present a study of three large object-oriented software systems—VisualWorks Smalltalk, Java JDK and Eclipse—searching for scaling laws in some of their properties. We study four system properties related to code production, namely the inheritance hierarchies, the naming of variables and methods, and the calls to methods. We systematically found power-law distributions in these properties, most of which have never been reported before. We were also able to statistically model the programming activities leading to the studied properties as Yule processes, with very good correspondence between empirical data and the prediction of Yule model. The fact that a design and optimization process like software development can be modeled on the large with the laws of statistical physics poses intriguing issues to software engineers, and could be exploited for finding new metrics and quality measures.", "num_citations": "42\n", "authors": ["1207"]}
{"title": "A comparison between real and complex valued neural networks in communication applications\n", "abstract": " Neural networks are becoming a very useful tool for the processing of data in several communication applications, where it is of great interest to have complex computing structures. In this paper, after a brief review of existing techniques, a new complex Multi-Layer Perceptron is proposed. In particular, after defining a proper neuron structure (i.e. using a non-analytic activation function), a novel learning algorithm is derived. On equalizing an 8-PSK complex signal distorted by a nonlinear communication channel, a comparison between this new complex network and the real-valued Multi-Layer Perceptron is also reported in this paper. The results show that the proposed network has a lower computation complexity and fewer parameters, for the same performance, than the classical real-valued network.", "num_citations": "42\n", "authors": ["1207"]}
{"title": "Studying lean-kanban approach using software process simulation\n", "abstract": " We developed an event-driven simulator of the Kanban process a WIP limited pull system visualized by the Kanban board. WIP (work in process) represent the capacity in the activity to perform features simoultaneously. The simulator is fully object-oriented, and its design model reflects the objects of the Lean software development domain. We used this simulator to assess comparatively WIP-limited and unlimited processes. We also studied the optimum values of the working item limits in the activities, using a paradigmatic case of 4 activities and 100 work items. The cost function used is equal to the total time needed to complete the project, plus a weighted sum of the limits themselves. We performed an exhaustive search on all the admissible values of the solution, finding sensible optimal values, and a non-trivial behavior of the cost function in the optimization space.               This demonstrates the …", "num_citations": "41\n", "authors": ["1207"]}
{"title": "An empirical study of social networks metrics in object-oriented software\n", "abstract": " We study the application to object-oriented software of new metrics, derived from Social Network Analysis. Social Networks metrics, as for instance, the EGO metrics, allow to identify the role of each single node in the information flow through the network, being related to software modules and their dependencies. These metrics are compared with other traditional software metrics, like the Chidamber-Kemerer suite, and software graph metrics. We examine the empirical distributions of all the metrics, bugs included, across the software modules of several releases of two large Java systems, Eclipse and Netbeans. We provide analytical distribution functions suitable for describing and studying the observed distributions. We study also correlations among metrics and bugs. We found that the empirical distributions systematically show fat-tails for all the metrics. Moreover, the various metric distributions look very similar and consistent across all system releases and are also very similar in both the studied systems. These features appear to be typical properties of these software metrics.", "num_citations": "40\n", "authors": ["1207"]}
{"title": "A blockchain based system to ensure transparency and reliability in food supply chain\n", "abstract": " We propose a blockchain oriented platform to secure storage origin provenance for food data. By exploiting the blockchain distributed and immutable nature the proposed system ensures the supply chain transparency with a view to encourage local region by promoting the smart food tourism and by increasing local economy. Thanks to the decentralized application platforms that makes us able to develop smart contracts, we define and implement a system that works inside the blockchain and guarantees transparency, reliability to all actors of the food supply chain. Food, in fact, is the most direct way to get in touch with a place. The touristic activities related to wine and food consumption and sale in fact influence the choice of a destination and may encourage the purchase of typical food also once tourists are back home to the country of origin. Touristic destinations must therefore be equipped with …", "num_citations": "39\n", "authors": ["1207"]}
{"title": "Fractal dimension in software networks\n", "abstract": " A large number of real networks are characterized by two fundamental properties: they are small world and scale-free. A recent paper demonstrated that the structure of many complex networks is also self-similar under a length-scale transformation, and calculated their fractal dimension using the\" box counting\" method. We studied nine large object-oriented software systems, finding that the graphs associated to these networks are self-similar. We also studied the time evolution of the fractal dimension during system growth, finding a significant correlation between the fractal dimension and object-oriented complexity metrics known to be correlated with software fault-proneness. Thus, in software systems the fractal dimension could be considered as a measure of internal complexity, and consequently of the system quality.", "num_citations": "39\n", "authors": ["1207"]}
{"title": "Smart contracts software metrics: a first study\n", "abstract": " Smart contracts (SC) are software codes which reside and run over a blockchain. The code can be written in different languages with the common purpose of implementing various kinds of transactions onto the hosting blockchain, They are ruled by the blockchain infrastructure and work in order to satisfy conditions typical of traditional contracts. The software code must satisfy constrains strongly context dependent which are quite different from traditional software code. In particular, since the bytecode is uploaded in the hosting blockchain, size, computational resources, interaction between different parts of software are all limited and even if the specific software languages implement more or less the same constructs of traditional languages there is not the same freedom as in normal software development. SC software is expected to reflect these constrains on SC software metrics which should display metric values characteristic of the domain and different from more traditional software metrics. We tested this hypothesis on the code of more than twelve thousands SC written in Solidity and uploaded on the Ethereum blockchain. We downloaded the SC from a public repository and computed the statistics of a set of software metrics related to SC and compared them to the metrics extracted from more traditional software projects. Our results show that generally Smart Contracts metrics have ranges more restricted than the corresponding metrics in traditional software systems. Some of the stylized facts, like power law in the tail of the distribution of some metrics, are only approximate but the lines of code follow a log normal distribution which reminds of …", "num_citations": "38\n", "authors": ["1207"]}
{"title": "Micro pattern fault-proneness\n", "abstract": " One of the goals of Software Engineering is to reduce, or at least to try to control, the defectiveness of software systems during the development phase. The aim of our study is to analyze the relationship between micro patterns (introduced by Gil and Maman) and faults in a software system. Micro patterns are similar to design patterns, but their characteristic is that they can be identified automatically, and are at a lower level of abstraction with respect to design patterns. Our study aims to show, through empirical studies of open source software systems, which categories of micro patterns are more correlated to faults. Gil and Maman demonstrated, and subsequent studies confirmed, that 75% of the classes of a software system are covered by micro patterns. In our study we also analyze the relationship between faults and the remaining 25% of classes that do not match with any micro pattern. We found that these …", "num_citations": "38\n", "authors": ["1207"]}
{"title": "Multi-layer perceptrons with discrete weights\n", "abstract": " The feasibility of restricting the weight values in multilayer perceptrons to powers of two or sums of powers of two is studied. Multipliers could be thus replaced by shifters and adders on digital hardware, saving both time and chip area, under the assumption that the neuron activation function is computed through a lookup table (LUT) and that a LUT can be shared among many neurons. A learning procedure based on back-propagation for obtaining a neural network with such discrete weights is presented. This learning procedure requires full real arithmetic and therefore must be performed offline. It starts from a multilayer perceptron with continuous weights learned using back-propagation. Then a weight normalization is made to ensure that the whole shifting dynamics is used and to maximize the match between continuous and discrete weights of neurons sharing the same LUT. Finally, a discrete version of BP …", "num_citations": "37\n", "authors": ["1207"]}
{"title": "Assessing traditional and new metrics for object-oriented systems\n", "abstract": " We present an extensive analysis of software metrics for 111 object-oriented systems written in Java. For each system, we considered 18 traditional metrics such as LOC and Chidamber and Kemerer metrics, as well as metrics derived from complex network theory and social network analysis. These metrics were computed at class level. We also considered two metrics at system level, namely the total number of classes and interfaces, and the fractal dimension. We discuss the distribution of these metrics, and their correlation, both at class and at system level. We found that most metrics follow a leptokurtotic distribution. Only a couple of metrics have patent normal behavior while three others are very irregular, and even bimodal. The statistics gathered allow us to study and discuss the variability of metrics along different systems, and to devise a roadmap for further research.", "num_citations": "36\n", "authors": ["1207"]}
{"title": "Self-organization and market crashes\n", "abstract": " This paper presents a model of stock price behavior that encompasses both short-term fluctuations and long-term exponential trends punctuated by crashes. The model represents stock market behavior as the interaction of two self-organizing processes. The first process represents business-as-usual stock price fluctuations. It builds on a model of stock price behavior introduced by Cont and Bouchaud. The second process is a risk process that determines the severity of crashes. It is a random graph process driven by macroeconomic variables. Our model is based on the assumption that stock market prices that grow at a higher rate than the real economy force structural changes that, in turn, leverage the risk of a crash. The transition from a business-as-usual regime to a crash regime is determined by trigger events. Trigger events are exponentially distributed while the size of a crash depends on the state of the …", "num_citations": "36\n", "authors": ["1207"]}
{"title": "XPSwiki: An agile tool supporting the planning game\n", "abstract": " We present XPSwiki, a tool supporting the XP practices for requirement gathering and project management — user stories and the Planning Game. XPSwiki has been developed in Smalltalk using Squeak Swiki technology. It is accessed through the Internet in a user friendly agile way. XPSwiki keeps track of multiple projects, each with its releases, iterations, user stories, acceptance tests, and engineering tasks. It also manages teams of developers, who sign stories and tasks, and who pair-program them with another team member. XPSwiki allows project tracking and documentation, and is at present in use among real software firms.", "num_citations": "34\n", "authors": ["1207"]}
{"title": "Refactoring and its relationship with fan-in and fan-out: An empirical study\n", "abstract": " Many of the seventy-two refactorings originally proposed by Fowler have the aim of reducing coupling in classes and thereby aiding programmer maintainability. While we might assume that classes with high levels of coupling would be the targets for refactoring more often than any other type of class, no empirical evidence exists to support this assumption. In this paper, we explore that open question through the extraction of fifty-two of Fowler's catalog of refactorings drawn from versions of four open-source systems. We compare the coupling characteristics of each set of refactored classes with the corresponding set of non-refactored classes (those for which no refactorings were applied across versions), we seek to inform one overriding research question: is there a significant difference between these two sets of classes in terms of their level of coupling? Results showed that highly-coupled classes were more …", "num_citations": "33\n", "authors": ["1207"]}
{"title": "A machine learning approach for text categorization of fixing-issue commits on CVS\n", "abstract": " We studied data mining from CVS repositories of two large OO projects, Eclipse and Netbeans, focusing on\" fixing-issue\" commits.", "num_citations": "33\n", "authors": ["1207"]}
{"title": "Arsonists or firefighters? Affectiveness in agile software development\n", "abstract": " In this paper, we present an analysis of more than 500 K comments from open-source repositories of software systems developed using agile methodologies. Our aim is to empirically determine how developers interact with each other under certain psychological conditions generated by politeness, sentiment and emotion expressed within developers’ comments. Developers involved in an open-source projects do not usually know each other; they mainly communicate through mailing lists, chat, and tools such as issue tracking systems. The way in which they communicate affects the development process and the productivity of the people involved in the project. We evaluated politeness, sentiment and emotions of comments posted by agile developers and studied the communication flow to understand how they interacted in the presence of impolite and negative comments (and vice versa). Our analysis shows that “firefighters” prevail. When in presence of impolite or negative comments, the probability of the next comment being impolite or negative is 13% and 25%, respectively; ANGER however, has a probability of 40% of being followed by a further ANGER comment. The result could help managers take control the development phases of a system, since social aspects can seriously affect a developer’s productivity. In a distributed agile environment this may have a particular resonance.", "num_citations": "32\n", "authors": ["1207"]}
{"title": "Entropy of the degree distribution and object-oriented software quality\n", "abstract": " The entropy of degree distribution has been considered from many authors as a measure of a network's heterogeneity and consequently of the resilience to random failures. In this paper we propose the entropy of degree distribution as a new measure of software quality. We present a study were software systems are considered as complex networks which are characterized by heterogeneous distribution of links. On such complex software networks we computed the entropy of degree distribution. We analyzed various releases of the publically available Eclipse and Net-beans software systems, calculating the entropy of degree distribution for every release analyzed. Our results display a good correlation between the entropy of degree distribution and the number of bugs for Eclipse and Netbeans. Complexity and quality metrics are in general computed on every system module while the entropy is just a scalar …", "num_citations": "32\n", "authors": ["1207"]}
{"title": "Tabu search metaheuristics for global optimization of electromagnetic problems\n", "abstract": " This paper presents a Tabu Search based strategy which has been applied to optimize the objective function associated to the design of a solenoids system. For this kind of problem, Tabu Search strategies are able to find the global minimum with considerably better performance than that obtained using a Simulated Annealing algorithm. Algorithms used to perform the self-tuning of Tabu Search parameters have also been developed, achieving interesting improvements in terms of computing time and quality of the solutions. Such algorithms are an original development of Reactive Tabu Search and they are based on the past history of the search. Tabu Search strategies have also been applied in continuous optimization of the same problem with encouraging results.", "num_citations": "31\n", "authors": ["1207"]}
{"title": "A systolic circuit for fast Hartley transform\n", "abstract": " The authors present a systolic circuit for computing a fast algorithm performing the discrete Hartley transform (DHT). The proposed architecture employs a systolic elevator concept and CORDIC processors. The elevator assures local communications in the proposed algorithm, and the CORDIC processor makes it possible to enhance processing speed and exploit parallelism. The architecture appears to be regular and, therefore, very attractive for VLSI realizations. The computational cost necessary for computing the DFT (discrete Fourier transform) is also discussed with respect to other architectures.< >", "num_citations": "30\n", "authors": ["1207"]}
{"title": "The predictor impact of Web search media on Bitcoin trading volumes\n", "abstract": " In the last decade, Web 2.0 services have been widely used as communication media. Due to the huge amount of available information, searching has become dominant in the use of Internet. Millions of users daily interact with search engines, producing valuable sources of interesting data regarding several aspects of the world. Search queries prove to be a useful source of information in financial applications, where the frequency of searches of terms related to the digital currency can be a good measure of interest in it. Bitcoin, a decentralized electronic currency, represents a radical change in financial systems, attracting a large number of users and a lot of media attention. In this work we studied the existing relationship between Bitcoin's trading volumes and the queries volumes of Google search engine. We achieved significant cross correlation values, demonstrating search volumes power to anticipate trading …", "num_citations": "29\n", "authors": ["1207"]}
{"title": "A neural network model of parametric nonlinear hysteretic inductors\n", "abstract": " A neural network model of nonlinear hysteretic inductors is presented. The proposed neural network model is shown to reproduce the dynamic scalar hysteretic behavior of the current-flux relationship. Moreover, the intrinsic characteristics of the neural network approach yield a model particularly suitable when dependencies on different parameters are present, e.g., influence of mobile part positions, of temperature etc. Both theoretical comparisons (e.g., Chua-Stronsmoe model and Jiles-Atherton model) and experimental measurements (e.g., variable reluctance linear motor) are considered. Results point out the numerical accuracy and computational efficiency of the proposed NN approach, that results in a general framework useful in the field of electric machines, of electronic power circuits, of control and identification.", "num_citations": "29\n", "authors": ["1207"]}
{"title": "Design patterns for gas optimization in ethereum\n", "abstract": " Blockchain technology is an emerging technology that allows new forms of decentralized architectures, designed to generate trust among users, without the intervention of mediators or knowledge between the parties. Since 2015, thanks to the introduction of Smart Contracts by Ethereum, it is possible to run programs on the blockchain, greatly extending the potential of this technology. The programming of Smart Contract, through the Solidity language is different from the traditional one. First of all, any action that requires to modify the blockchain costs gas, which corresponds to a fraction of the currency used by that given blockchain, and therefore to real money. Gas optimization is a unique challenge in this context and has obvious implications. This document aims to provide a set of design patterns and tips to help gas saving in developing Smart Contracts on Ethereum. The provided patterns are presented divided …", "num_citations": "28\n", "authors": ["1207"]}
{"title": "The genoa artificial stock market: Microstructure and simulations\n", "abstract": " This paper presents an artificial financial market based on heterogeneous agents which are endowed with a limited amount of cash and one traded asset. Agents make random buy and sell decisions which are constrained by their limited resources and depend on the past price volatility. The price formation process is given by the intersection of the supply and demand curves.", "num_citations": "26\n", "authors": ["1207"]}
{"title": "A greedy genetic algorithm for continuous variables electromagnetic optimization problems\n", "abstract": " A greedy genetic algorithm for continuous variables electromagnetic optimization problems is presented. The presented algorithm is characterized by the use of a nonlinear simplex method as a principal optimizer, and of a greedy genetic algorithm to explore the search space, realizing a balance between diversity and a bias toward fitter individuals. The resulting algorithm merges the efficiency typical of calculus-based search with the robustness typical of random methods. A detailed comparison of the performance obtained implementing several strategies is presented, using an electromagnetic design test problem.", "num_citations": "26\n", "authors": ["1207"]}
{"title": "Micro patterns in agile software\n", "abstract": " In this paper we present a study on micro patterns in different releases of two software systems developed with Object Oriented technologies and Agile process. Micro patterns are design decisions in code that can be easily automatically recognised. Gil and Maman introduced the concept to support providing objective assessment of design decisions [1]. They catalogued 27 micro patterns that capture a variety of programming practices in Java. Micro patterns can be a useful metrics in order to measure the quality of software by showing that certain categories of micro patterns are more fault prone than others, and that the classes that do not correspond to any category of micro patterns are more likely to be faulty. In our study we present some empirical results on two case studies of systems developed with Agile methodologies, and compare them to previous results obtained for non Agile systems. In …", "num_citations": "25\n", "authors": ["1207"]}
{"title": "A ontology-based process modelling for XP\n", "abstract": " We describe the Extreme Programming Ontology (XPO), a formal model specifying the main concepts used in the extreme programming methodology and their properties. XPO's modular structure was developed using the usual normative top down approach to software engineering process modeling. It relies on a set of core components rooted in three main concepts: organisational role, product and phase. Besides being useful for indexing relevant documents and XP artifacts such as user stories and Wiki pages, XPO is aimed at being a sound basis for nonintrusive analysis of agile processes, mining process data about programmers activity and repositories content in order to extract new concepts potentially identifying critical factors in agile software development. Extension to XPO are also discussed, including other agile methodologies and more general software engineering concepts.", "num_citations": "25\n", "authors": ["1207"]}
{"title": "Neural networks for power system condition monitoring and protection\n", "abstract": " To maintain a good voltage quality level to customers in power distribution system, it is essential to minimise transients, line voltage dips and spikes due to a variety of causes, including fault occurrence, power interruption and large load changes. In case of private generating systems it is essential that ultra-rapid switching devices be used which cut off the customer plant from the utility system so quickly that the presence of voltage dips is not perceived by the industrial plant's sensitive loads. These devices require very fast acquisition and control systems which permit to diagnose and, possibly, predict abnormal events. In this paper, a control methodology based on a locally recurrent-globally feed-forward neural network and on a neural classifier is proposed. It will be shown that it is possible to predict with good accuracy the value of the control variables based on previously acquired samples and use these values …", "num_citations": "25\n", "authors": ["1207"]}
{"title": "Initial coin offerings and agile practices\n", "abstract": " An ICO (Initial Coin Offering) is an innovative way to fund projects based on blockchain. The funding is based on the selling of tokens by means of decentralized applications called smart contracts written in Solidity, a programming language specific for Ethereum blockchain. The ICOs work in a volatile context and it is crucial that the team is capable of handling constant changes. The Agile methods, proven practices enabling to develop software in presence of changing requirements, could be a means for managing uncertainty. The main goals of this work are to understand software engineering activities related to ICOs, recognize the ICOs developed using Agile methods, and make a comparison between ICOs and Agile ICOs. In addition, we perform a deeper analysis of Agile ICOs concerning project planning, software development, and code features. Our work shows that the roles of the people involved in an ICO can be compared to the typical roles of the SCRUM methodology. The majority of Agile ICOs use tool of testing before storing smart contract on blockchain. Finally, the application of volumetric and complexity software metrics shows that the files of Agile ICOs is on average shorter and less complex than in other smart contracts. View Full-Text", "num_citations": "24\n", "authors": ["1207"]}
{"title": "How diverse is your team? Investigating gender and nationality diversity in GitHub teams\n", "abstract": " Building an effective team of developers is a complex task faced by both software companies and open source communities. The problem of forming a “dream” team involves many variables, including consideration of human factors and it is not a dilemma solvable in a mathematical way. Empirical studies might provide interesting insights to explain which factors need to be taken into account in building a team of developers and which levers act to optimise productivity among developers. In this paper, we present the results of an empirical study aimed at investigating the link between team diversity (i.e., gender, nationality) and productivity (issue fixing time). We consider issues solved from the GHTorrent dataset inferring gender and nationality of each team’s members. We also evaluate the politeness of all comments involved in issue resolution. Results show that higher gender diversity is linked with a lower team average issue fixing time (higher productivity), that nationality diversity is linked with lower team politeness and that gender diversity is linked with higher sentiment.", "num_citations": "24\n", "authors": ["1207"]}
{"title": "Journal of economic behavior and organization: special issue on heterogeneous interacting agents in financial markets\n", "abstract": " EconPapers: Journal of economic behavior and organization: special issue on heterogeneous interacting agents in financial markets EconPapers Economics at your fingertips EconPapers Home About EconPapers Working Papers Journal Articles Books and Chapters Software Components Authors JEL codes New Economics Papers Advanced Search EconPapers FAQ Archive maintainers FAQ Cookies at EconPapers Format for printing The RePEc blog The RePEc plagiarism page Journal of economic behavior and organization: special issue on heterogeneous interacting agents in financial markets Thomas Lux and Michele Marchesi Journal of Economic Behavior & Organization, 2002, vol. 49, issue 2, 143-147 Date: 2002 References: View references in EconPapers View complete reference list from CitEc Citations: View citations in EconPapers (3) Track citations by RSS feed Downloads: (external link) http://www.…", "num_citations": "24\n", "authors": ["1207"]}
{"title": "Finite wordlength digital filter design using an annealing algorithm\n", "abstract": " A very versatile algorithm for the design of finite-wordlength filters is described. It is a simulated annealing algorithm, derived directly from the simulated annealing algorithm for functions of continuous variables which searches over discrete values of the filter coefficients. It has very fast development time and produces filters with good performances. Its only drawback is a very long execution time. Three examples of filter design are included.< >", "num_citations": "24\n", "authors": ["1207"]}
{"title": "Ensuring transparency and traceability of food local products: A blockchain application to a Smart Tourism Region\n", "abstract": " This article proposes a blockchain oriented platform to guarantee the origin and provenance of food items in a Smart Tourism Region context. Local food and beverage, in fact, can become a good combination to attract tourist and to promote the area provided that their provenance is clearly certified. We designed and developed a blockchain‐based system to manage an agri‐food supply chain for tracking food items. By using smart contracts the platform guarantees transparency, efficiency and trustworthiness. Our system is particularly suitable to manage cold chain since the system interfaces with IoT network devices providing detailed information about data monitoring food such as storage temperature, environment humidity, and GPS data. All involved actors can share data and information in a more efficient, transparent, and tamper proof way than traditional systems. The final consumer can access with …", "num_citations": "23\n", "authors": ["1207"]}
{"title": "An analysis of anti-micro-patterns effects on fault-proneness in large java systems\n", "abstract": " Micro patterns are similar to design patterns, but are at a lower level of abstraction, closer to the implementation. Anti patterns are micro patterns not respecting the prescriptions of good Object Oriented programming practices. In this paper, we use the definitions introduced by Arcelli and Maggioni [3] in order to study the evolution of five particular micro patterns (anti patterns) in different releases of the Eclipse and NetBeans systems, and the correlations between anti patterns and faults. Our analysis confirms previous findings regarding the high coverage of micro patterns onto the system classes, and show that anti patterns not only represent bad Object Oriented programming practices, but may also be associated to the production of lower quality software, since they present a fault proneness significantly enhanced.", "num_citations": "23\n", "authors": ["1207"]}
{"title": "Development and testing of an artificial stock market\n", "abstract": " In this paper, an artificial financial market based on heterogeneous agents is presented. The proposed market is composed of traders with limited amount of cash, one traded asset and a centralized mechanism, the market maker, matching buy and sell orders. The price formation process is given by the intersection of the demand and the supply curve.", "num_citations": "23\n", "authors": ["1207"]}
{"title": "A parallel simulated annealing algorithm for the design of magnetic structures\n", "abstract": " A new parallel global optimization algorithm is presented and evaluated. It is based on simulated annealing and on speculative computation. It is particularly suited for parallel architectures from some units to some tens of processors and for problems characterized by a cost function whose evaluation takes a long time, features that fit well with the design of magnetic structures. Comparative tests with respect to traditional sequential SA is presented on the design of a magnet for Magnetic Resonance Imaging.< >", "num_citations": "23\n", "authors": ["1207"]}
{"title": "The frequency dependence of an analytical model of an electrically stimulated biological structure\n", "abstract": " A digital computer simulation has been carried out of the exposure of a cell, modeled as a multilayered spherical structure, to an alternating electrical field. Electrical and electrochemical quantities of possible biological interest can be evaluated everywhere inside the cell. A strong frequency behavior in the range 0–10 MHz has been obtained.", "num_citations": "23\n", "authors": ["1207"]}
{"title": "An agent-based artificial market model for studying the bitcoin trading\n", "abstract": " The objective of this paper is to simulate the trading of the currency pair BTC/USD, investigating through the theory of the genetic algorithms the best sets of trading strategies, simulating through a realistic order book the bitcoin price formation, and reproducing a bitcoin price series that exhibits some stylized facts found in real-time price series. In this artificial market model two kinds of agents, Chartists and Random traders, perform trading. Chartists trade through the application of trading rules. Specifically, a part of Chartists trades applying the best sets of trading rules selected by a genetic algorithm that simulates a trading system, based on four technical analysis indicators, searching for parameters of each indicator that guarantee the highest profits in the training period; the remaining part trades applying trading rules choosing their parameters in a random way. On the contrary random trader's trade without …", "num_citations": "22\n", "authors": ["1207"]}
{"title": "Abcde–agile block chain dapp engineering\n", "abstract": " Blockchain software development is becoming more and more important for any modern software developer and IT startup. Nonetheless, blockchain software production still lacks of a disciplined, organized and mature development process, as demonstrated by the many and (in)famous failures and frauds occurred in recent years. In this paper we present ABCDE, a complete method addressing blockchain software development. The method considers the software integration among the blockchain components – smart contracts, libraries, data structures – and the out-of-chain components, such as web or mobile applications, which all together constitute a complete DApp system. We advocate for ABCDE the use of agile practices, because these are suited to develop systems whose requirements are not completely understood since the beginning, or tend to change, as it is the case of most blockchain-based …", "num_citations": "21\n", "authors": ["1207"]}
{"title": "The fractal dimension of software networks as a global quality metric\n", "abstract": " We analyzed the source code of various releases of two large Object Oriented Open Source Java software systems, Eclipse and Netbeans, investigating the complexity of the whole release and of its subprojects. We show that when the classes in the source code and the dependencies between them are considered, such systems can be viewed as complex software networks, and emerging structures, characteristic of fractals, appear at different length scales – on the entire systems and on subprojects of any size.We were able to find in all examined cases a scaling region where it is possible to compute a self-similar coefficient, the fractal dimension, using “the box counting method”. Such a coefficient is a single metric related to the system’s complexity.More importantly, we were able to show that this measure looks fairly related to software quality, acting as a global quality software metric. In particular, we computed …", "num_citations": "21\n", "authors": ["1207"]}
{"title": "Extreme programming and agile processes in software engineering\n", "abstract": " Extreme Programming has come a long way since its first use in the C3 project almost 10 years ago. Agile methods have found their way into the mainstream, and at the end of last year we saw the second edition of Kent Beck’s book on Extreme Programming, containing a major refactoring of XP. This year, the 6th International Conference on Extreme Programming and Agile Processes in Software Engineering took place June 18–23 in Sheffield. As in the years before, XP 2005 provided a unique forum for industry and academic professionals to discuss their needs and ideas on Extreme Programming and agile methodologies. These proceedings reflect the activities during the conference which ranged from presentation of research papers, invited talks, posters and demonstrations, panels and activity sessions, to tutorials and workshops. Included are also papers from the Ph. D. and Master’s Symposium which …", "num_citations": "21\n", "authors": ["1207"]}
{"title": "On the randomness and seasonality of affective metrics for software development\n", "abstract": " The role of emotions and human aspects of software development is gaining increasing attention from both academics and developers. Software development is a complex activity, but since software is everywhere and it is necessary to achieve the highest quality possible. High technical skills, knowledge and competence of a software developer are not the only factors which influence the final product. Good attitudes, communication skills and good manners are equally as important. In this paper we focused our attention on understanding how developer sentiment and emotions evolved over time during the development process of 10 systems, considering affectiveness as time series. We studied seasonality, randomness and correlations. Results showed that there was not a significant correlation among joy and love, sadness and anger, sentiment and joy. Regarding seasonality and randomness, results showed …", "num_citations": "20\n", "authors": ["1207"]}
{"title": "An agile development process and its assessment using quantitative object-oriented metrics\n", "abstract": " The development of a Web application using agile practices is presented, characterized by empirical software measurements that have been performed throughout the duration of the project. The project is the specialization of jAPS, an open source Java Web portal generation framework, for building a Research Register management system. The agile principles and practices used in the project are described and discussed. During the various phases of the project some key agile practices, such as pair programming, test-based development and refactoring, were used at different levels of adoption. The evolution of some object-oriented metrics of the system, and their behavior related to the agile practices adoption level is presented and discussed, showing that software quality, as measured using standard OO metrics, looks directly related to agile practices adoption.", "num_citations": "20\n", "authors": ["1207"]}
{"title": "A stochastic model of software maintenance and its implications on extreme programming processes\n", "abstract": " A stochastic model of software maintenance and its implications on extreme programming processes | Extreme programming examined ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleBooksExtreme programming examinedA stochastic model of software maintenance and its implications on extreme programming processes chapter A stochastic model of software maintenance and its implications on extreme programming processes Share on Authors: Sergio Focardi View Profile , Michele Marchesi View Profile , Giancarlo Succi View Profile Authors Info & Affiliations Extreme programming examinedMay 2001 Pages 191–206 Published:…", "num_citations": "20\n", "authors": ["1207"]}
{"title": "A study on the performances of simplex method for function minimization\n", "abstract": " \" A study on the performances of simplex method for function minimization\"/BARABINO GP; BARABINO G.; BIANCO B.; MARCHESI M.-(1980).((Intervento presentato al convegno Proc. IEEE International Conference on Circuits and Computers ICCC 80, New York nel 1-3 Ottobre.", "num_citations": "20\n", "authors": ["1207"]}
{"title": "ICOs overview: Should investors choose an ICO developed with the lean startup methodology?\n", "abstract": " An Initial Coin Offering (ICO) is an innovative way to raise funds and launch a startup. It is also an opportunity to take part in a project, or in a DAO (Decentralized Autonomous Organization). The use of ICO is a global phenomenon that involves many nations and several business categories: ICOs collected over 5.2 billion dollars only in 2017. The success of an ICO is based on the credibility and innovativeness of project proposals. This fund-raising tool contains however some critical issues, such as the use of tokens that have no intrinsic value and do not generate direct liquidity, and the role of investors in the management of the startup. We analyzed if the Lean Startup methodology is helpful to face this critical aspects and we examined some ICOs in which the proposing team states explicitly that a lean startup approach is used.", "num_citations": "19\n", "authors": ["1207"]}
{"title": "Using simulation for understanding and reproducing distributed software development processes in the cloud\n", "abstract": " Context: Organizations increasingly develop software in a distributed manner. The Cloud provides an environment to create and maintain software-based products and services. Currently, it is unknown which software processes are suited for Cloud-based development and what their effects in specific contexts are.Objective: We aim at better understanding the software process applied to distributed software development using the Cloud as development environment. We further aim at providing an instrument, which helps project managers comparing different solution approaches and to adapt team processes to improve future project activities and outcomes.Method: We provide a simulation model, which helps analyzing different project parameters and their impact on projects performed in the Cloud. To evaluate the simulation model, we conduct different analyses using a Scrumban process and data from a project …", "num_citations": "18\n", "authors": ["1207"]}
{"title": "Tabu search metaheuristics for electromagnetic problems optimization in continuous domains\n", "abstract": " This paper presents a tabu search based strategy which is applied to optimize the objective function associated with the design of a solenoid system. The strategies used to apply tabu search in a continuous domain are developed without increasing computational effort with respect to the corresponding discrete problem. Algorithms developed for discrete problems used to self-tune tabu search parameters have also been applied, achieving improvements in terms of the quality of the solutions.", "num_citations": "18\n", "authors": ["1207"]}
{"title": "Performance analysis of locally recurrent neural networks\n", "abstract": " Many practical applications of neural networks require the identification of non‐linear deterministic systems or chaotic systems. In these cases the use of a network architecture known as locally recurrent neural network (LRNN) is often preferable in place of standard feedforward multi‐layer perceptron (MLP) networks, or of globally recurrent neural network. In this paper locally recurrent networks are used to simulate the behaviour of the Chua’s circuit that can be considered a paradigm for studying chaos. It is shown that such networks are able to identify the underlying link among the state variables of the Chua’s circuit. Moreover, they are able to behave like an autonomous Chua’s double scroll, showing a chaotic behaviour of the state variables obtainable through a suitable circuit elements choice.", "num_citations": "18\n", "authors": ["1207"]}
{"title": "How diverse is your team? investigating gender and nationality diversity in github teams\n", "abstract": " Building an effective team of developers is a complex task faced by both software companies and open source communities. The problem of forming a “dream” team involves many variables, including consideration of human factors, and it is not a dilemma solvable in a mathematical way. Empirical studies might provide interesting insights to explain which factors need to be taken into account in building a team of developers and which levers act to optimise collaboration and productivity among developers. In this paper, we present the results of an empirical study aimed at investigating the link between team diver-sity (ie, gender, nationality) and productivity (issue fixing time). We consider issues solved from the GHTorrent dataset inferring gender and nationality of each team’s members. We also evaluate the politeness of all comments involved in issue resolution. Results show that higher gender diversity is linked with a lower team average issue fixing time and that nationality diversity is linked with lower team politeness.", "num_citations": "17\n", "authors": ["1207"]}
{"title": "Power laws in Smalltalk\n", "abstract": " Many real systems have been described as complex networks, where nodes represent specific parts of the system and connections represent relationships among them. Examples of such networks come from very different contexts. Traditional theories suggest to represent complex systems as random graphs, according to the models proposed by Erdos and Rényi. However, there is an increasing evidence that many real world systems behave in different ways displaying scale-free distributions of nodes degree. Random graphs are not suitable to describe such behaviors, thus new models have been proposed in recent years. Recently, it has emerged the interest in applying complex network theories to represent large software systems. Software applications are made of modules and relationships among them. Thus, a representation based on graph theory is natural. This work presents our study1 in this context. We analyzed four large Smalltalk systems. For each one we built the graph representing all system classes and the relationships among them. We show that these graphs display scale free characteristics, in accordance to recent studies on other large software systems.", "num_citations": "17\n", "authors": ["1207"]}
{"title": "An agent based model to analyze the bitcoin mining activity and a comparison with the gold mining industry\n", "abstract": " In this paper, we present an analysis of the mining process of two popular assets, Bitcoin and gold. The analysis highlights that Bitcoin, more specifically its underlying technology, is a “safe haven” that allows facing the modern environmental challenges better than gold. Our analysis emphasizes that crypto-currencies systems have a social and economic impact much smaller than that of the traditional financial systems. We present an analysis of the several stages needed to produce an ounce of gold and an artificial agent-based market model simulating the Bitcoin mining process and allowing the quantification of Bitcoin mining costs. In this market model, miners validate the Bitcoin transactions using the proof of work as the consensus mechanism, get a reward in Bitcoins, sell a fraction of them to cover their expenses, and stay competitive in the market by buying and divesting hardware units and adjusting their expenses by turning off/on their machines according to the signals provided by a technical analysis indicator, the so-called relative strength index. View Full-Text", "num_citations": "16\n", "authors": ["1207"]}
{"title": "Modeling and simulation of an artificial stock option market\n", "abstract": " Since their introduction in 1973, options have become an important and very popular financial instrument. However, despite much research performed on the subject, the effects of option trading on the underlying asset market are still debated. Both empirical and theoretical studies have failed to point out how price volatility and volumes of the underlying asset are affected. In this paper we present the first study on the effects of an option market related to an underlying stock market, using an artificial financial market based on heterogeneous agents. We modeled a realistic European option using two market models. The microstructure of the first model is kept as simple as possible, being composed only of random traders. The second model is more complex and realistic, involving the presence of various kinds of trading strategies (random, fundamentalist and chartist). We show that the introduction of options …", "num_citations": "16\n", "authors": ["1207"]}
{"title": "A rapid development process with UML\n", "abstract": " Since \"design-oriented\" life-cycles came to their maturity, dramatic changes have been introduced as far as programming tools and computer hardware are concerned. Such changes made it possible to develop applications focusing on refactoring rather than on analysis and design. The underlying hypothesis is that by adopting suitable tools and target languages, refactoring would possibly cost less than the overhead introduced by modern A&D techniques. Recently, extreme programming has been proposed as an alternative to a \"design-oriented\" life-cycle.In this paper we describe a software application developed using a software life-cycle that basically follows the guidelines suggested by extreme programming. Such an approach requires highly expressive programming languages and powerful CASE tools. UML has been selected as the underlying modeling language throughout the whole process, for it …", "num_citations": "16\n", "authors": ["1207"]}
{"title": "Global optimization for discrete magnetostatic problems\n", "abstract": " The problem of global optimization of magnetic structures composed of solenoids is examined, using a modified simulated annealing algorithm able to deal with the functions of continuous and/or discrete variables. The algorithm is tested using a discrete problem which allows determination of the cost function for every possible configuration of the system, providing information about the pattern of the cost function with respect to design variables. Despite the difficulty of minimizing the function, the proposed algorithm was able to locate the global minimum, or a point where the cost function has a value very close to it, seven times out of a total of ten runs. The algorithm is described, and results are discussed.< >", "num_citations": "16\n", "authors": ["1207"]}
{"title": "Fast wavelet transform assisted predictors of streaming time series\n", "abstract": " We explore the shift variance of the decimated, convolutional Discrete Wavelet Transform, also known as Fast Wavelet Transform. We prove a novel theorem improving the FWT algorithm and implement a new prediction method suitable to the multiresolution analysis of streaming univariate datasets using compactly supported Daubechies Wavelets. An effective real value forecast is obtained synthesizing the one step ahead crystal and performing its inverse DWT, using an integrated group of estimating machines. We call Wa.R.P. (Wavelet transform Reduced Predictor) the new prediction method. A case study, testing a cryptocurrency exchange price series, shows that the proposed system can outperform the benchmark methods in terms of forecasting accuracy achieved. This result is confirmed by further tests performed on other time series. Developed in C++, Standard 2014 conformant, the code implementing the …", "num_citations": "15\n", "authors": ["1207"]}
{"title": "Incidence of predatory journals in computer science literature\n", "abstract": " PurposeOne of the main tasks of a researcher is to properly communicate the results he obtained. The choice of the journal in which to publish the work is therefore very important. However, not all journals have suitable characteristics for a correct dissemination of scientific knowledge. Some publishers turn out to be unreliable and, against a payment, they publish whatever researchers propose. The authors call “predatory journals” these untrustworthy journals. The purpose of this paper is to analyse the incidence of predatory journals in computer science literature and present a tool that was developed for this purpose.Design/methodology/approachThe authors focused their attention on editors, universities and publishers that are involved in this kind of publishing process. The starting point of their research is the list of scholarly open-access publishers and open-access stand-alone journals created by Jeffrey Beall …", "num_citations": "15\n", "authors": ["1207"]}
{"title": "Is bitcoin’s market predictable? Analysis of Web search and social media\n", "abstract": " In recent years, Internet has completely changed the way real life works. In particular, it has been possible to witness the online emergence of web 2.0 services that have been widely used as communication media. On one hand, services such as blogs, tweets, forums, chats, email have gained wide popularity. On the other hand, due to the huge amount of available information, searching has become dominant in the use of Internet. Millions of users daily interact with search engines, producing valuable sources of interesting data regarding several aspects of the world. Bitcoin, a decentralized electronic currency, represents a radical change in financial systems, attracting a large number of users and a lot of media attention. In this work we studied whether Bitcoin’s trading volume is related to the web search and social volumes about Bitcoin. We investigated whether public sentiment, expressed in large-scale …", "num_citations": "15\n", "authors": ["1207"]}
{"title": "A new class of optimization algorithms for circuit design and modelling\n", "abstract": " A class of optimization algorithms for finding the global minimum of functions of continuous variables is presented. These algorithms merge conventional local minima search strategies with the stimulated annealing (SA) technique. The rationale behind these algorithms is discussed, and a complete description is given of one of them, derived from the Hooke and Jeeves (1961) search method. Tests made on mathematical functions show an increase up to two orders of magnitudes in efficiency with respect to a conventional SA algorithm. An example of application to VLSI design is given.< >", "num_citations": "15\n", "authors": ["1207"]}
{"title": "Why blockchain is important for software developers, and why software engineering is important for blockchain software (Keynote)\n", "abstract": " In the past few years, cryptocurrencies and blockchain applications has been one of the most rapidly emerging fields of computer science, leading to a strong demand of software applications. Several new projects have been emerging almost daily, with an impetus that was not seen since the days of the dawn of the Internet. However, the need of being timely on the market and the lack of experience in a brand new field led to epic disasters, such as those of DAO in 2016 and of Parity Ethereum wallet in 2017. Also, there have been several hacks successfully performed on cryptocurrency exchanges, the biggest being those of MtGox in 2014 (350 million US), and Coincheck in 2017 (400 million US$). The application of sound SE practices to Blockchain software development, both for Smart Contract and generic Blockchain software, might be crucial to the success of this new field. Here the …", "num_citations": "14\n", "authors": ["1207"]}
{"title": "A statistical comparison of Java and Python software metric properties\n", "abstract": " This paper presents a statistical analysis of 20 opens ource object-oriented systems with the purpose of detecting differences in metrics distribution between Java and Python projects. We selected ten Java projects from the Java Qualitas Corpus and ten projects written in Python. For each system, we considered 10 class-level software metrics.", "num_citations": "14\n", "authors": ["1207"]}
{"title": "Re-visiting the'Maintainability Index'Metric from an Object-Oriented Perspective\n", "abstract": " The Maintainability Index (MI) metric was proposed in the early nineties to gauge ease of code maintenance. A high value of MI indicates well-constructed code which is easy to maintain and a low MI, the opposite. The metric has been criticized in the past and more recently for its applicability to code and validity more generally. Very few studies however have explored whether the MI correlates strongly with class features such as coupling, defects or size - features of object-oriented (OO) classes which are acknowledged to be surrogates of maintenance complexity. We explore the relationship between the MI and these four perspectives. Three releases of two Eclipse projects were used as the empirical basis of the study and the JHawk tool was used to extract class-based metrics. Significant correlations were found between class features and the MI for all class features except fan-in which measures incoming …", "num_citations": "14\n", "authors": ["1207"]}
{"title": "Studying the evolution of quality metrics in an agile/distributed project\n", "abstract": " This paper analyzes the development of a project initiated by a co-located agile team that subsequently evolved into a distributed context. The project, named JAPS (Java Agile Portal System) [1], has been monitored on a regular basis since it started in January 2005, collecting both process and product metrics. Product metrics have been calculated by checking out the source code history from the CVS repository. By analyzing the evolution of these metrics, it has been possible to evaluate how the distribution of the team has impacted the source code quality.", "num_citations": "14\n", "authors": ["1207"]}
{"title": "Developing a tool supporting XP process\n", "abstract": " We present the development of XPSwiki, a tool supporting the XP practices for requirement gathering and project management – user stories and the Planning Game. XPSwiki has been developed in Smalltalk using Squeak Swiki technology, and is accessed through the Internet in a user friendly, agile way. It keeps track of multiple projects, each with its releases, iterations, user stories, acceptance tests, and tasks. XPSwiki allows project tracking, and automates documentation generation and metrics collection. It is presently in use in real software development environments.", "num_citations": "14\n", "authors": ["1207"]}
{"title": "Effort estimation of web applications through web CMF objects\n", "abstract": " Several Content Management Frameworks (CMF), either open source or with a commercial license, are available to help the publication of huge amounts of information and to develop Web applications. Unfortunately, developing Web applications through a CMF is not exempt from cost and time overruns, as in traditional software projects, and currently there is no estimation model able to adequately measure the effort of Web application development. This work presents a new methodology for estimating the effort of Web applications developed with a Content Management Framework (CMF). We present the new key elements for analysis and planning, needed to define every important step in developing a Web application through a CMF. Using those elements, it is possible to estimate the effort needed to build such an application in man-days. We also present the experimental validation of the proposed …", "num_citations": "13\n", "authors": ["1207"]}
{"title": "Parameter-based refactoring and the relationship with fan-in/fan-out coupling\n", "abstract": " Refactoring is an activity which, in theory, should have minimal impact on the overall structure of a system. That said, certain refactorings change the coupling profile of a system and over time those cumulative changes in coupling can have serious implications for system maintenance effort. In this paper, we analyse effect of the fan-in and fan-out metrics from the perspective of two refactorings - namely 'Add parameter' to, and 'Remove Parameter' from, a method. We developed a bespoke pattern-matching tool to collect these two refactorings from multiple releases of the Tomcat open-source system using the Evolizer tool to extract method signature data and the JHawk metrics tool to collect the two coupling metrics. Results point to significant differences in the profiles of fan-in and fan-out between refactored and non-refactored classes. We describe how software company can take advantage from this knowledge by …", "num_citations": "13\n", "authors": ["1207"]}
{"title": "Study of the evolution of an agile project featuring a web application using software metrics\n", "abstract": " We present an agile process used for the development of a Web application written in Java, devised by choosing a set of proven agile practices taken by existing popular agile methodologies. During the project, we regularly measured the software using Chidamber and Kemerer object-oriented metrics suite, and other metrics. The application development evolved through phases, characterized by a different level of adoption of some key agile practices – such as pair programming, test-based development and refactoring. The evolution of the OO metrics of the system, and their behavior related to the agile practices adoption level is presented and discussed, showing that soft ware quality, as measured using standard OO metrics, looks directly related to agile practices adoption.", "num_citations": "13\n", "authors": ["1207"]}
{"title": "Tabu search metaheuristic for designing digital filters\n", "abstract": " This paper deals with the application of a Tabu Search (TS) metaheuristic to the design of digital filters, with coefficient values expressed as the sum of power of two. The performances of the algorithm are heavily affected by the choice of its parameters, which in turn are related to different implemented strategies. The tuning of these parameters has been performed after many tests. The results of the proposed technique are compared to those obtained by simply rounding the optimal values of coefficients obtained by means of Remetz algorithm, and to those obtained using a simulated annealing algorithm.", "num_citations": "13\n", "authors": ["1207"]}
{"title": "Hierarchical management of VLSI cells at different description levels\n", "abstract": " The implementation of a data structure that permits a VLSI designer to operate at different description levels during the design of a chip is addressed. This data structure has been realized using software tools like object-oriented programming, which allow the creation of very modular programs. For the input/output program operations, the EDIF format has been used. To manage the data structure, suitable graphics, which permit the user to access data structure through the use of windows and menus, have been developed.< >", "num_citations": "13\n", "authors": ["1207"]}
{"title": "An organized repository of ethereum smart contracts’ source codes and metrics\n", "abstract": " Many empirical software engineering studies show that there is a need for repositories where source codes are acquired, filtered and classified. During the last few years, Ethereum block explorer services have emerged as a popular project to explore and search for Ethereum blockchain data such as transactions, addresses, tokens, smart contracts’ source codes, prices and other activities taking place on the Ethereum blockchain. Despite the availability of this kind of service, retrieving specific information useful to empirical software engineering studies, such as the study of smart contracts’ software metrics, might require many subtasks, such as searching for specific transactions in a block, parsing files in HTML format, and filtering the smart contracts to remove duplicated code or unused smart contracts. In this paper, we afford this problem by creating Smart Corpus, a corpus of smart contracts in an organized, reasoned and up-to-date repository where Solidity source code and other metadata about Ethereum smart contracts can easily and systematically be retrieved. We present Smart Corpus’s design and its initial implementation, and we show how the data set of smart contracts’ source codes in a variety of programming languages can be queried and processed to get useful information on smart contracts and their software metrics. Smart Corpus aims to create a smart-contract repository where smart-contract data (source code, application binary interface (ABI) and byte code) are freely and immediately available and are classified based on the main software metrics identified in the scientific literature. Smart contracts’ source codes have been …", "num_citations": "12\n", "authors": ["1207"]}
{"title": "Measuring high and low priority defects on traditional and mobile open source software\n", "abstract": " Software defects are the major cause for system failures. To effectively design tools and provide support for detecting and recovering from software failures, requires a deep understanding of defect features. In this paper we present an analysis of defect characteristics in two different open source software development domains: Mobile and Traditional. Our attention is focused on measuring the differences between High-Priority and Low-Priority defects. High or Low priority of a given defect is decided by a developer when creating a bug report for an issue tracking system. We sampled hundreds of real world bugs in hundreds of large and representative open-source projects. We used natural language text classification techniques to automatically analyse roughly 700,000 bug reports from the Bugzilla, Jira and Google Issues issue tracking systems. Results show that there are differences between High-Priority and …", "num_citations": "12\n", "authors": ["1207"]}
{"title": "An analysis of SNA metrics on the Java Qualitas Corpus\n", "abstract": " We computed the software graphs of 96 systems of the Java Qualitas Corpus, parsing the source code and identifying the dependencies among classes.", "num_citations": "12\n", "authors": ["1207"]}
{"title": "The interplay between two stock markets and a related foreign exchange market: a simulation approach\n", "abstract": " There is still much that is unknown about the interactions among financial markets, and about the relationships between stock prices and exchange rates. This topic gains attention during financial crises, and many papers try to find empirical regularities emerging from financial data, or to study contagion processes. In this paper we present a study on the interplay between two stock markets and one foreign exchange market extending the framework provided by the Genoa Artificial Stock Market. There are four different trading strategies, and the agents are divided into two groups: those who trade in the stock markets and those who trade in the FOREX. We studied three market conditions: the FOREX dynamics, the behavior of the two stock markets together with the FOREX, and finally we conducted a what-if analysis for testing the effects of a inflationary monetary shock of one currency affecting all of the three …", "num_citations": "12\n", "authors": ["1207"]}
{"title": "Price formation in an artificial market: limit order book versus matching of supply and demand\n", "abstract": " In this paper, we present an extension of the Genoa artificial stock market (GASM) (Raberto et al., 2001) that includes a limit order book as mechanism for price formation. At every time step an agent is chosen with uniform distribution to issue an order. The order can be a limit order or a market order. If the order is a limit order, it is stored in the book; if the order is a market order, a transaction occurs. Prices are formed at variable time steps, i.e., only when a market order is issued. We investigate how the new asynchronous trading mechanism affects the statistical properties of simulated prices. This computational experiment shows that the fat tails of the returns distribution can be recovered simply as a consequence of the limit order book without any additional assumption on agents' behavior.", "num_citations": "12\n", "authors": ["1207"]}
{"title": "Introducing tdd on a free libre open source software project: a simulation experiment\n", "abstract": " This paper describes a simulation model that represents the first step to modeling open source software development processes. The model has been tuned using data from a real FLOSS project: Apache. The goal of our research is to show the effects of adopting TDD (Test Driven Development) on our open source simulation model. In order to introduce the TDD practice, we have only changed some parameter values in the FLOSS simulation model. In particular, the average time required to write a line of production code increases because now automated tests are also coded, the number of defects injected during coding decreases as does the debugging time to fix a single defect. The two FLOSS development models (nonTDD and TDD) have been compared, the one incorporating the agile practice of Test Driven Development yielding better results in terms of code quality (defects/Kloc).", "num_citations": "12\n", "authors": ["1207"]}
{"title": "Forecasting Bitcoin closing price series using linear regression and neural networks models\n", "abstract": " In this article we forecast daily closing price series of Bitcoin, Litecoin and Ethereum cryptocurrencies, using data on prices and volumes of prior days. Cryptocurrencies price behaviour is still largely unexplored, presenting new opportunities for researchers and economists to highlight similarities and differences with standard financial prices. We compared our results with various benchmarks: one recent work on Bitcoin prices forecasting that follows different approaches, a well-known paper that uses Intel, National Bank shares and Microsoft daily NASDAQ closing prices spanning a 3-year interval and another, more recent paper which gives quantitative results on stock market index predictions. We followed different approaches in parallel, implementing both statistical techniques and machine learning algorithms: the Simple Linear Regression (SLR) model for uni-variate series forecast using only closing prices, and the Multiple Linear Regression (MLR) model for multivariate series using both price and volume data. We used two artificial neural networks as well: Multilayer Perceptron (MLP) and Long short-term memory (LSTM). While the entire time series resulted to be indistinguishable from a random walk, the partitioning of datasets into shorter sequences, representing different price “regimes”, allows to obtain precise forecast as evaluated in terms of Mean Absolute Percentage Error(MAPE) and relative Root Mean Square Error (relativeRMSE). In this case the best results are obtained using more than one previous price, thus confirming the existence of time regimes different from random walks. Our models perform well also in terms of time …", "num_citations": "11\n", "authors": ["1207"]}
{"title": "Applying the etl process to blockchain data. prospect and findings\n", "abstract": " We present a novel strategy, based on the Extract, Transform and Load (ETL) process, to collect data from a blockchain, elaborate and make it available for further analysis. The study aims to satisfy the need for increasingly efficient data extraction strategies and effective representation methods for blockchain data. For this reason, we conceived a system to make scalable the process of blockchain data extraction and clustering, and to provide a SQL database which preserves the distinction between transaction and addresses. The proposed system satisfies the need to cluster addresses in entities, and the need to store the extracted data in a conventional database, making possible the data analysis by querying the database. In general, ETL processes allow the automation of the operation of data selection, data collection and data conditioning from a data warehouse, and produce output data in the best format for subsequent processing or for business. We focus on the Bitcoin blockchain transactions, which we organized in a relational database to distinguish between the input section and the output section of each transaction. We describe the implementation of address clustering algorithms specific for the Bitcoin blockchain and the process to collect and transform data and to load them in the database. To balance the input data rate with the elaboration time, we manage blockchain data according to the lambda architecture. To evaluate our process, we first analyzed the performances in terms of scalability, and then we checked its usability by analyzing loaded data. Finally, we present the results of a toy analysis, which provides some findings …", "num_citations": "11\n", "authors": ["1207"]}
{"title": "Agile practices in a large organization: the experience of poste Italiane\n", "abstract": " In this paper we show how agile practices have been used at the Poste Italiane for building a monitoring system of its complex IT infrastructure. The system, called Datamart, is built upon the existing monitoring infrastructure. A testing framework has been developed for performing assertion checking either on existing legacy modules or on the new functionalities. This framework is currently used, and is able to process data coming from 100,000 distributed computers, enabling and improving their centralized control.", "num_citations": "11\n", "authors": ["1207"]}
{"title": "The effects of short-selling and margin trading: a simulation analysis\n", "abstract": " This paper examines the effects of introducing and removing short sale constraints and margin requirements on a stock market using a multiagent simulation model. We focused on the influence of these kinds of restrictions on daily price volatility and on traders long-run wealth distribution. We performed analysis both in a closed market and in an open market, where there is random cash inflow or outflow ten simulation days apart. Considering the closed market, we found that if short selling and margin trading are not banned, volatility tend to slightly increase. Also, we found that, if short selling and margin trading are allowed, there is a chance that some traders declare bankrupt and leave the market. Generally, the open and the closed market have similar features, except for the fact that in an open market the number of bankrupts increases. External factors, such as sudden variations of prices and wealth, damage traders who are in debt positions much more than the other traders.", "num_citations": "11\n", "authors": ["1207"]}
{"title": "Extreme Programming and Agile Processes in Software Engineering: 5th International Conference, XP 2004, Garmisch-Partenkirchen, Germany, June 6-10, 2004, Proceedings\n", "abstract": " Software development is being revolutionized. The heavy-weight processes of the 1980s and 1990s are being replaced by light-weight, so called agile processes. Agile processes move the focus of software development back to what really matters: running software. This is only made possible by accepting that software developmentisacreativejobdoneby, with, andforindividualhumanbeings. For this reason, agile software development encourages interaction, communication, and fun. This was the focus of the Fifth International Conference on Extreme P-grammingandAgileProcessesinSoftwareEngineeringwhichtookplacebetween June 6 and June 10, 2004 at the conference center in Garmisch-Partenkirchen at the foot of the Bavarian Alps near Munich, Germany. In this way the conference provided a unique forum for industry and academic professionals to discuss their needs and ideas for incorporating Extreme Programming and Agile Metho-logies into their professional life under consideration of the human factor. We celebrated this year’s conference by re? ecting on what we had achieved in the last half decade and we also focused on the challenges we will face in the near future.", "num_citations": "11\n", "authors": ["1207"]}
{"title": "Dynamic topology neural network\n", "abstract": " In this paper a new method is presented to dynamically adapt the topology of a neural network using only the information of the learning set. The proposed algorithm eliminates connections from an initial fully connected network and presents some characteristics which can resemble some behaviour of the biological networks like the so-called critical period. Preliminary experimental results are presented which prove the effectiveness of the proposed algorithm.", "num_citations": "11\n", "authors": ["1207"]}
{"title": "Simulation of the best ranking algorithms for an app store\n", "abstract": " The world of mobile applications is relatively young. However, it has already grown and will continue to expand in the future. Consequently, an increasing number of mobile application stores provide new ways for the users of downloading mobile applications and for the developers of submitting new applications. Millions of consumers look for mobile applications to download - i.e. games, maps, movie, e-mails and so on. This extraordinary new world represents an exceptional challenge for application developers who want to earn and obtain new business opportunities. Our research work focused on studying, analyzing and modeling the best strategies that should be adopted in a mobile application store in order to maximize efficiency and profit. We propose a model that simulates a complex system of mobile applications, developers, and users, all together interacting in an application mobile store. Here …", "num_citations": "10\n", "authors": ["1207"]}
{"title": "Size estimation of web applications through web CMF object\n", "abstract": " This work outlines a new methodology for estimating the size of Web applications developed with a Content Management Framework (CMF). The reason for proposing - through this work - a new methodology for size estimation is the realization of the inadequacy of the RWO method, which we had recently developed, in estimating the effort of the latest Web applications. The size metric used in the RWO method was found not to be well suited for Web applications developed through a CMF. In this work, we present the new key elements for analysis and planning, needed to define every important step in developing a Web application through a CMF. Using those elements, it is possible to obtain the size of such an application. We also present the experimental validation performed on a 7-project dataset, provided by an Italian software company.", "num_citations": "10\n", "authors": ["1207"]}
{"title": "An empirical study of refactoring in the context of FanIn and FanOut coupling\n", "abstract": " The aim of refactoring is to reduce software complexity and hence simplify the maintenance process. In this paper, we explore the impact of refactorings on \"FanIn\" and \"FanOut\" coupling metrics through extraction of refactoring data from multiple releases of five Java open-source systems, We first considered how a single refactoring modified these metric values, what happened when refactorings had been applied to a single class in unison and finally, what influence a set of refactorings had on the shape of Fan In and Fan Out distributions. Results indicated that, on average, refactored classes tended to have larger FanIn and Fan Out values when compared with non-refactored classes. Where evidence of multiple (different) refactorings applied to the same class was found, the net effect (in terms of FanIn and Fan Out coupling values) was negligible.", "num_citations": "10\n", "authors": ["1207"]}
{"title": "Neural network modelling of variable hysteretic inductors\n", "abstract": " A neural model for devices made using hysteretic materials is presented. The model provides a close prediction of dynamic hysteresis loops and accounts for dependencies on position. Traditional theoretical approach limitations and experimental results are discussed.", "num_citations": "10\n", "authors": ["1207"]}
{"title": "Improved weighted least squares minimax design of FIR filters specified in frequency and time domain\n", "abstract": " An improved weighted least-squares (LS) algorithm is presented for the design of minimax finite-impulse-response (FIR) digital filters specified both in frequency and time domain. The new technique is compared with traditional algorithms for linear-phase FIR filter design, demonstrating its speed and precision. It is then applied to the design of Nyquist filters with both null and non-null intersymbol interference, demonstrating its flexibility.< >", "num_citations": "10\n", "authors": ["1207"]}
{"title": "Improved evoked potential estimation using neural network\n", "abstract": " The possibility of using the multilayer perceptron (MLP) neural network for the processing of the evoked potentials (EPs) is analyzed. In this case, the process can be conceived as deterministic low amplitude signals (damped sine waves), corresponding to the brain's response to stimuli, embedded in strongly colored noise, the EEG background activity. Typical values of the signal-to-noise ratio are less than 0 dB. The network, used as a nonlinear filter, is trained using iteratively as the input signal one of a set of available EP ensembles and as the target signal another ensemble of the same set. Experimental results, both on synthetic and real data, show that the method provides good results with very few EP ensembles. Therefore, it allows a noteworthy reduction of the signal nonstationarity and the patient's annoyance", "num_citations": "10\n", "authors": ["1207"]}
{"title": "Design of multi-layer neural networks with powers-of-two weights\n", "abstract": " The feasibility of restricting the weight values to powers-of-two or sums of powers-of-two in multilayer neural networks is discussed. A learning procedure based on back-propagation to obtain a neural network with such weights is presented. This learning procedure requires full real arithmetic, and therefore must be performed offline. These neural networks do not require multipliers, and are well suited for high-speed and high-integration digital neural circuits. To show the effectiveness of the approach, tests on a pattern recognition problem are presented.< >", "num_citations": "10\n", "authors": ["1207"]}
{"title": "Results on the application of simulated annealing algorithm for the design of digital filters with powers-of-two coefficients\n", "abstract": " Results on the application of the simulated annealing (SA) algorithm to the problem of finding the coefficients of a digital filter with very coarse coefficients values (namely, power-of-two) are presented. For a minimax criterion in the frequency response, the algorithm was found particularly useful for designing a cascade-form FIR (finite impulse response) filter whose performance is known to be superior to that of direct-form filters. Because the SA algorithm is a global optimization method, all stages are designed simultaneously, thus avoiding the classical iterative procedure. The final result is better performance at a higher computational cost.< >", "num_citations": "10\n", "authors": ["1207"]}
{"title": "The Butterfly “Affect”: impact of development practices on cryptocurrency prices\n", "abstract": " The network of developers in distributed ledgers and blockchains open source projects is essential to maintaining the platform: understanding the structure of their exchanges, analysing their activity and its quality (e.g. issues resolution times, politeness in comments) is important to determine how “healthy” and efficient a project is. The quality of a project affects the trust in the platform, and therefore the value of the digital tokens exchanged over it.In this paper, we investigate whether developers’ emotions can effectively provide insights that can improve the prediction of the price of tokens. We consider developers’ comments and activity for two major blockchain projects, namely Ethereum and Bitcoin, extracted from Github. We measure sentiment and emotions (joy, love, anger, etc.) of the developers’ comments over time, and test the corresponding time series (i.e. the affect time series) for correlations and causality …", "num_citations": "9\n", "authors": ["1207"]}
{"title": "Entropy of some CK metrics to assess object-oriented software quality\n", "abstract": " The term \"software entropy\" refers to the tendency for software, over time, to become difficult and costly to maintain. A software system that undergoes continuous change, such as having new functionality added to its original design, will eventually become more complex and can become disorganized as it grows, losing its original design structure.         A recent study show that software degradation may be measured using the WMC expressed in terms of Shannon entropy. In this paper we extended the empirical analyses also to RFC and CBO since these CK metrics have been shown to be correlated with fault-proneness of OO classes.         We analyzed various releases of the publicly available Eclipse and Netbeans software systems, calculating the entropy of some CK metrics for every release analyzed. The validity is shown through a direct measure of software quality such as the number of detected defects. Our …", "num_citations": "9\n", "authors": ["1207"]}
{"title": "The impact of transaction taxes on traders' behaviour and wealth: a microsimulation\n", "abstract": " The Impact of Transaction Taxes on Traders' Behaviour and Wealth: a Microsimulation IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Univ. Cagliari Catalogo Ricerca Università di Cagliari 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno The Impact of Transaction Taxes on Traders' Behaviour and Wealth: a Microsimulation Italiano Italiano Italiano Italiano English English The Impact of Transaction Taxes on Traders' Behaviour and Wealth: a Microsimulation / Mannaro K; Marchesi M; Setzu A. - (2005). ((Intervento presentato al convegno 10th Annual Workshop on Economic Heterogeneous Interacting Agents (WEHIA 2005) nel June 13-15, 2005. Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte dell'ateneo Scheda breve Scheda …", "num_citations": "9\n", "authors": ["1207"]}
{"title": "A revised Web Objects method to estimate Web application development effort\n", "abstract": " We present a study of the effectiveness of estimating web application development effort using Function Points and Web Objects methods, and a method we propose-the Revised Web Objects (RWO). RWO is an upgrading of WO method, aimed to account for new web development styles and technologies. It also introduces an up-front classification of web applications according to their size, scope and technology, to further refine their effort estimation. These methods were applied to a data-set of 24 projects obtained by Datasiel spa, a mid-sized Italian company, focused on web application projects, showing that RWO performs statistically better than WO, and roughly in the same way as FP.", "num_citations": "8\n", "authors": ["1207"]}
{"title": "The new XP\n", "abstract": " In October, 1999, Kent Beck’s book “Extreme Programming Explained—Embrace Change” was published. Well, you may love or hate XP, but for sure you cannot say it was irrelevant. By publishing his book, sold in hundreds of thousand copies and translated in tens of languages, Beck started the tidal wave of agile methodologies. These methodologies can be fully adopted, partially adopted or not adopted at all, but no serious software engineer may overlook them. All new editions of software engineering textbooks now have a section on agile methodologies and XP.Five years after that book, Kent again took the stage and published—with Cynthia Andres—the second edition. And you can bet that it is not just a polishing or some addition. No, this second edition critically reviews what happened in these five years, and almost completely refunds XP, albeit sticking to the original principles, or just to be able to be faithful to them.", "num_citations": "8\n", "authors": ["1207"]}
{"title": "NXCS: Hybrid approach to stock indexes forecasting\n", "abstract": " In this chapter, a hybrid approach for stock market forecasting is presented. It allows to develop a mixture of hybrid experts, each consisting of a genetic classifier and an associated artificial neural network. The resulting experts have been applied to stock market forecasting using technical trading rules as genetic inputs and other inputs—in particular past quotations—for the neural networks. In particular, the former are used to find quasi-stationary regimes within the financial data series, whereas the latter are assigned the task of making “context-dependent” predictions on the next day trend of the market. To this end, a novel kind of feedforward artificial neural network has been defined, allowing to implement suitable predictors without being compelled to exploit more complex neural architectures. Test runs have been performed on some well-known stock market indexes, also taking into account trading …", "num_citations": "8\n", "authors": ["1207"]}
{"title": "An empirical comparison of function points and Web Objects\n", "abstract": " This paper compares the effectiveness of Function Points and Web Object analysis to estimate the development effort of Web applications. The empirical study is performed on a set of industrial projects carried on in an Italian software company. Starting from original requirements and estimates, carried on using FP analysis, we compute the Web Objects analysis of the same requirements, and compare the results of the two approaches. We also assess the relative effectiveness of FP and WO using post-mortem data about the actual effort taken to develop the studied systems.", "num_citations": "7\n", "authors": ["1207"]}
{"title": "An analysis of bug distribution in object oriented systems\n", "abstract": " We introduced a new approach to describe Java software as graph, where nodes represent a Java file - called compilation unit (CU) - and an edges represent a relations between them. The software system is characterized by the degree distribution of the graph properties, like in-or-out links, as well as by the distribution of Chidamber and Kemerer metrics computed on its CUs. Every CU can be related to one or more bugs during its life. We find a relationship among the software system and the bugs hitting its nodes. We found that the distribution of some metrics, and the number of bugs per CU, exhibit a power-law behavior in their tails, as well as the number of CUs influenced by a specific bug. We examine the evolution of software metrics across different releases to understand how relationships among CUs metrics and CUs faultness change with time.", "num_citations": "7\n", "authors": ["1207"]}
{"title": "Adopting agile methodologies in distributed software development\n", "abstract": " From the second half of the '90s, some software engineering practitioners introduced a new group of software development methodologies called Agile Methodologies (Ams): they have been developed to overcome the limits of the traditional approaches in the software development. FLOSS (Free Libre Open Source Software) has been proposed as possible different solution to the software crisis that is afflicting the ICT worldwide business. If the AMs improve the quality code and allow to respond quickly to requirement changes, FLOSS approach decreases the development costs and increases the spreading of competences about the software products. A debate is shaping about the compatibility of these two approaches. Software development teams have been spreading around the world, with users in Europe, management in the USA and programmers in the USA and India. The scattering of team members and functions around the world introduces barriers to productivity, cultural and languages differences can lead to misunderstanding of requirements, time zone differences can delay project schedules. Agile methods can provide a competitive advantage by delivering early, simplifying communication and allowing the business to respond more quickly to the market by changing the software. Trying to distribute a development project in an agile way isn't easy and will involve compromises. The goal of this thesis is to determine the application of the AMs in several contexts so to define which of these can be used effectively in non traditional software projects as the distributed development.", "num_citations": "7\n", "authors": ["1207"]}
{"title": "Applications of neural networks in power distribution systems diagnosis and control\n", "abstract": " Applications of neural networks in power distribution systems diagnosis and control IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Univ. Cagliari Catalogo Ricerca Università di Cagliari 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno Applications of neural networks in power distribution systems diagnosis and control Italiano Italiano Italiano Italiano English English Applications of neural networks in power distribution systems diagnosis and control / G. Celli; M. Marchesi; F. Mocci; Pilo F. - (1997), pp. 523-526. ((Intervento presentato al convegno UPEC 1997 tenutosi a Manchester nel 10-12 September. Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte dell'ateneo …", "num_citations": "7\n", "authors": ["1207"]}
{"title": "Backpropagation without multiplier for multilayer neural networks\n", "abstract": " When multilayer neural networks are implemented with digital hardware, which allows full exploitation of the well developed digital VLSI technologies, the multiply operations in each neuron between the weights and the inputs can create a bottleneck in the system, because the digital multipliers are very demanding in terms of time or chip area. For this reason, the use of weights constrained to be power-of-two has been proposed in the paper to reduce the computational requirements of the networks. In this case, because one of the two multiplier operands is a power-of-two, the multiple operation can be performed as a much simpler shift operation on the neuron input. While this approach greatly reduces the computational burden of the forward phase of the network, the learning phase, performed using the traditional backpropagation procedure, still requires many regular multiplications. In the paper, a new learning …", "num_citations": "7\n", "authors": ["1207"]}
{"title": "An artificial neural network position estimator for a variable reluctance linear actuator\n", "abstract": " A neural network approach to the position estimation problem for a variable reluctance linear actuator is investigated. The inputs of the neural network are current ripple measurements and the switching pattern of the power converter. The neural network approach allows to account for iron saturation and iron losses effects resulting in an accurate position estimation. Numerical simulations are developed to show the feasibility of the proposed method, as well as the neural robustness. Finally, experimental measurements on a prototype are presented to validate the proposed approach.", "num_citations": "7\n", "authors": ["1207"]}
{"title": "A neural ASIC architecture for real-time classification\n", "abstract": " \"A Neural ASIC Architecture for Real-Time Classification\" IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Univ. Cagliari Catalogo Ricerca Università di Cagliari 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno \"A Neural ASIC Architecture for Real-Time Classification\" Italiano Italiano Italiano Italiano English English \"A Neural ASIC Architecture for Real-Time Classification\" / CAVIGLIA DD; VALLE M.; BARATTA D.; BAIARDO V.; MARCHESI M. - (1995). ((Intervento presentato al convegno EUROMICRO95, Como nel 4-7 Settembre. Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte dell'ateneo Scheda breve Scheda completa Titolo: \"A Neural ASIC Architecture for Real-Time Classification\" Autori: …", "num_citations": "7\n", "authors": ["1207"]}
{"title": "Linear data-driven architectures implementing neural networks models\n", "abstract": " This paper presents a digital implementation of neural network models, based on a linear array of processors provided with a local memory and! ocallt connected through two data buses, one of which is bi-directional. The main advantages of the proposed architecture are the localitel of its connections, a high e. fficiencl and the abilitl to be expanded and reconfigured easill. For these reasons, this architecture is very suitable both for VLSI implementation and for implementation through an arrant of DSP processors on a board. The implementation of the multilatter perceptron with back propagation learning algorithm and of the counterpropagation neural model is discussed in detail. It is shown that, despite the localitel of the connections, the degree of parallelism achieved is very high.", "num_citations": "7\n", "authors": ["1207"]}
{"title": "An adaptive neural network filter for evoked potentials\n", "abstract": " The possibility of using the multilayer perceptron (MLP) neural network for the processing of EEG evoked potentials (EPs) is examined. A structure composed of the cascade of a MLP and a linear combiner is proposed. Experimental results, both on synthetic and real data, show that the method provides good results with very few EP ensembles and without the necessity of prior knowledge of the signal characteristics.< >", "num_citations": "7\n", "authors": ["1207"]}
{"title": "The Future of Bitcoin: a Synchrosqueezing Wavelet Transform to Predict Search Engine Query Trends.\n", "abstract": " In recent years search engines have become the go-to methods for achieving many types of knowledge, spanning from detailed descriptions or general information interesting to the user. Likewise several reassignment techniques are capturing the attention of researchers in the field of signal analysis. Particularly, the Synchrosqueezing Wavelet Transform-SST allows signal decomposition and instantaneous frequency extrusion, at the same time promising consistent reconstruction capabilities, hence the possibility to contrive an SST assisted inference engine. We are going to test it using datasets extracted from search engine trends, using a cloud of keywords related to the Bitcoin topic. This could be useful to study the evolution of the cryptocurrency both in time and geographical terms, and to estimate the future number of queries. The importance of Bitcoin queries prediction goes beyond the academic and research environments and, as such, it could lead to valuable commercial applications, such as financial recommender systems or blockchain-based transaction managers development.", "num_citations": "6\n", "authors": ["1207"]}
{"title": "Performance improvement of a hybrid optimization algorithm for electromagnetic devices design\n", "abstract": " In this paper, an investigation of the behavior of a recently defined hybrid algorithm for continuous variables electromagnetic optimization problems is presented. This algorithm makes use of the nonlinear simplex method as a principal optimizator, and a greedy genetic algorithm to explore the search space. The algorithm is greatly affected by the tuning of some parameters. Referring to a solenoids system optimal design problem, a detailed comparison of performances obtained implementing a metaheuristic tuning is presented.", "num_citations": "6\n", "authors": ["1207"]}
{"title": "Wavelet analysis for diagnostic problems\n", "abstract": " In this paper the problem of off-line diagnosis of analog circuits affected by catastrophic multiple faults is considered. Information on the circuit behavior is given by the voltage measurements in a set of available test points. Because of the huge amount of data involved in each voltage acquisition, it is necessary to apply a compression technique to reduce the volume of the data to be given to the diagnostic system. Our diagnostic system consists of a neural network, trained to recognise catastrophic single faults, and used to diagnose multiple faults. The network has as many input nodes as the features extracted by each circuit image and the output nodes are as many as the number of circuit components. In this paper we investigate the suitability of the wavelet analysis to the problem of data compression of measurements for detecting faults in analog circuits. We also present some results obtained with the proposed …", "num_citations": "6\n", "authors": ["1207"]}
{"title": "Modified TEM cell design using mixed simulated annealing-deterministic optimization\n", "abstract": " A global optimization algorithm for TEM cell design is presented. It merges features from the simulated annealing algorithm and from the Hooke and Jeeves' (1961) pattern search method. The proposed method derives from the former algorithm the ability not to be trapped in local minima, while from the latter it derives a more efficient way to search in the cost function domain. Cost functions take into account field uniformity in large cell regions, and fields are computed by means of refined numerical conformal mapping procedures. Suitable aspect ratios are introduced in the cost function to control the dimensions of the cells.", "num_citations": "6\n", "authors": ["1207"]}
{"title": "Neural networks with self-adaptive topology\n", "abstract": " A method is presented to dynamically adapt the topology of a neural network using only the information of the learning set. The method, which simply consists of eliminating connections from an initial fully connected network, presents characteristics which can resemble some biological behavior. Several experimental results obtained with recurrent and multilayered networks are reported to demonstrate the capabilities of the proposed method.< >", "num_citations": "6\n", "authors": ["1207"]}
{"title": "A digital'snake'implementation of the back-propagation neural network\n", "abstract": " A digital implementation of a multilayer neural network model that has backpropagation as its learning algorithm is presented. This architecture is characterized by a set of elementary processors (neurons) and has the form of a linear sequence, where every processor communicates only with its two nearest neighbors. A sophisticated control of data exchange among neurons, by means of two data buses, ensures full pipelining in the forward mode. The proposed architecture is very flexible since, having only local connections, it can be easily expanded by simply adjoining more processors to it. Moreover, it can be programmed in terms of number and width of layers.< >", "num_citations": "6\n", "authors": ["1207"]}
{"title": "Security checklists for ethereum smart contract development: patterns and best practices\n", "abstract": " In recent years Smart Contracts and DApps are becoming increasingly important and widespread thanks to the properties of blockchain technology. In most cases DApps are business critical, and very strict security requirements should be assured. Developing safe and reliable Smart Contracts, however, is not a trivial task. Several researchers have studied the security issues, however none of these provide a simple and intuitive tool to overcome these problems. In this paper we collected a list of security patterns for DApps. Moreover, based on these patterns, we provide the reader with security assessment checklists that can be easily used for the development of SCs. We cover the phases of design, coding, and testing and deployment of the software lifecycle. In this way, we allow developers to easily verify if they applied all the relevant security patterns to their smart contracts. We focus all the analysis on the most popular Ethereum blockchain, and on the Solidity language.", "num_citations": "5\n", "authors": ["1207"]}
{"title": "Software Engineering for DApp Smart Contracts Managing Workers Contracts.\n", "abstract": " We present an application of the BOSE and ABCDE development methodology to build a DApp system for managing real world contracts for temporary workers so that, by design, agreements, commitments and rules are respected for the specific domain and employment sector and so that employers and employees are safeguarded by design. This includes the possibility to provide access from public regulatory bodies to all the information and employment history. Ethereum Solidity Smart Contracts are designed to manage all the steps and to keep track of all Commitments and Agreements, of Employers and Employees and of job history. We built a working prototype of application where the system management is automated by mean of an easy to use web interface acting as a front-end interacting with the blockchain back-end.", "num_citations": "5\n", "authors": ["1207"]}
{"title": "Empirical analysis of affect of merged issues on github\n", "abstract": " Pull-request based workflows are popular trends of modern software development platform such as GitHub. A pull-request notifies other developers that new changes are proposed, a code review process follows the pull-request that may be merged in the main branch if other developers accept the changes. Many factors influence the acceptance of pull-requests. Since open source software is based on collaboration, it is essential to discover how the affect expressed by developer discussing pull-request issues, namely how they collaborate, influences the acceptance of the pull-request proposed. In this study we analysed the relations with the affect expressed in pull-request issues'comments and whether an issue is merged in the main branch or not. We focused on pull-request issues and we found that issues with higher level anger, sadness, arousal and valence are less likely to be merged while issues with …", "num_citations": "5\n", "authors": ["1207"]}
{"title": "Web framework points: an effort estimation methodology for web application development using a content management framework\n", "abstract": " Web applications are among the most popular and relevant kinds of application. Most Web applications are developed using a content management framework (CMF). CMF helps to accelerate the publication of large amounts of information and the development of Web applications. However, developing Web applications through CMF is not exempt from cost and time overruns, as in traditional software projects. Currently, there is no estimation model able to adequately measure the effort of developing a Web application. This work presents a new methodology, called web framework points, to estimate the effort of Web applications developed with CMF. Web framework points is a hybrid methodology, composed of a sizing phase, which follows specific guidelines, and an effort estimation phase, obtained by applying a cost model to the size model of the project to estimate. The sizing of the project takes into account …", "num_citations": "5\n", "authors": ["1207"]}
{"title": "Agile Processes in Software Engineering and Extreme Programming: 15th International Conference, XP 2014, Rome, Italy, May 26-30, 2014, Proceedings\n", "abstract": " This book contains the refereed proceedings of the 15th International Conference on Agile Software Development, XP 2014, held in Rome, Italy, in May 2014. Because of the wide application of agile approaches in industry, the need for collaboration between academics and practitioners has increased in order to develop the body of knowledge available to support managers, system engineers, and software engineers in their managerial/economic and architectural/project/technical decisions. Year after year, the XP conference has facilitated such improvements and provided evidence on the advantages of agile methodologies by examining the latest theories, practical applications, and implications of agile and lean methods. The 15 full papers, seven short papers, and four experience reports accepted for XP 2014 were selected from 59 submissions and are organized in sections on: agile development, agile challenges and contracting, lessons learned and agile maturity, how to evolve software engineering teaching, methods and metrics, and lean development.", "num_citations": "5\n", "authors": ["1207"]}
{"title": "Study of the Competition between Proprietary Software Firms and Free/Libre Open Source Software Firms Using a Simulation Model\n", "abstract": " In recent years, a very important structural change in the software industry took place, with an increasing number of firms that got involved in Free/Libre Open Source Software (FLOSS) development communities. FLOSS communities and products have been studied as complementary to proprietary software companies and products. In this paper we propone a business model for the software market, and in particular we analyze the competition between proprietary software firms and FLOSS firms. Our software market is a system where each agent is independent of each other in the choice about buying or selling software products or services. The proposed work aims to analyze the influence of FLOSS firms producing both software and services in vertical software markets, nowadays mostly dominated by large proprietary firms. The findings show that FLOSS firms are able to compete with proprietary firms …", "num_citations": "5\n", "authors": ["1207"]}
{"title": "The fractal dimension metric and its use to assess object-oriented software quality\n", "abstract": " We present a study were software systems are considered as complex networks which have a self-similar structure under a length-scale transformation. On such complex software networks we computed a self-similar coefficient, also known as fractal dimension, using\" the box counting method\".", "num_citations": "5\n", "authors": ["1207"]}
{"title": "Extreme Programming and Agile Processes in Software Engineering: 7th International Conference, XP 2006, Oulu, Finland, June 17-22, 2006, Proceedings\n", "abstract": " Unbelievable, we have reached the seventh edition of the XP2k+ n conference! We started at the outset of the new millennium, and we are still proving that agile pr-esses were neither a millennium bug nor a YAF (yet another fad). In its first editions, this conference was a get-together of a few pioneers who-bated about how to make agile processes and methods accepted by the mainstream researchers and practitioners in software engineering. Now agile approach to software development has been fully accepted by the software engineering community and this event has become the major forum for understanding better the implications of agility in software development and proposing extensions to the mainstream approaches. These two aspects were fully reflected in this year’s conference. They were-flected in the keynote speeches, which covered the background work done starting as early as the early eighties by Barry Boehm, definition of the field by Kent Beck, a successful industrial application in a success story by Sean Hanly, the perspective and the future of agile methods in large corporations by Jack Järkvik, and even some-sightful views from a philosopher, Pekka Himanen.", "num_citations": "5\n", "authors": ["1207"]}
{"title": "Using extreme programming in a distributed team\n", "abstract": " Using extreme programming in a distributed team IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Univ. Cagliari Catalogo Ricerca Università di Cagliari 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno Using extreme programming in a distributed team Italiano Italiano Italiano Italiano English English Using extreme programming in a distributed team / Camplani R; Cau A; Concas G; Mannaro K; Marchesi M; Melis M; Pinna S; Serra N; Setzu A; Turnu I; Uras S. - (2006). ((Intervento presentato al convegno OSS 2005 ATTI WORKSHOP SESAMOSS'05 tenutosi a Genova, Italy nel July 2005. Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte dell'ateneo Scheda breve …", "num_citations": "5\n", "authors": ["1207"]}
{"title": "Self-organization in global stochastic models of production and inventory dynamics\n", "abstract": " This paper proposes an extension of the inventory production model developed in Bak, Chen, Scheinkman, and Woodford (BCSW, 1993). We show how the Pareto-Levy type of aggregate distributions emerge in global models as well as in local models. We extend the BCSW model by allowing random connections between firms. The distribution of production in the economy follows a power law probability distribution. In addition, the long-run frequency distribution follows the same law.", "num_citations": "5\n", "authors": ["1207"]}
{"title": "Tabu search coupled with deterministic strategies for the optimal design of MRI devices\n", "abstract": " A tabu search based strategy has been developed to achieve design optimisation of electromagnetic structures. Tabu Search (TS) is a metaheuristic that guides the search for the optimal solution making use of flexible memory systems which exploit the history of the search. It consists of systematically prohibiting some solutions to prevent cycling and, at the same time, avoiding to be trapped in local minima, and deeply explores the search space to minimise the objective function. Since the variables to be optimised are continuous in nature, we developed a continuous tabu search algorithm in which the range of variation of each variable is discretised by division into sub-ranges. In this way, it is possible to identify a finite alphabet and apply tabu search strategies. Best performances have been reached by coupling tabu search with other optimisation procedures, such as Golden Search (GS) and a non-linear Simplex …", "num_citations": "5\n", "authors": ["1207"]}
{"title": "Coarse-grained processor array implementing the multilayer neural network model\n", "abstract": " A coarse-grained processor array which tries to overcome the limitations encountered when a network composed by many neurons has to be mapped into a limited number of processing elements (PEs) is proposed. Given the total number of PEs, the proposed architecture can be configured to implement any particular multilayer perceptron (MLP) topology, and can simulate both the forward and learning phases of the network. Moreover, it has a small number of very local connections, and can exhibit a high efficiency under limited constraints on the number of neurons per layer.< >", "num_citations": "5\n", "authors": ["1207"]}
{"title": "Non Linear Adaptive Filter using Neural Networks\n", "abstract": " \"Non Linear Adaptive Filter using Neural Networks\" IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Univ. Cagliari Catalogo Ricerca Università di Cagliari 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno \"Non Linear Adaptive Filter using Neural Networks\" Italiano Italiano Italiano Italiano English English \"Non Linear Adaptive Filter using Neural Networks\" / UNCINI A.; MARCHESI M; ORLANDI G.; PIAZZA F.. - (1990), pp. 158-158. ((Intervento presentato al convegno Proc. INNC 90, Int. Neural Network Conf., Parigi nel 9-13 Luglio. Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte dell'ateneo Scheda breve Scheda completa Titolo: \"Non Linear Adaptive Filter using Neural Networks\" Autori: …", "num_citations": "5\n", "authors": ["1207"]}
{"title": "Study of the electrical field inside biological structures\n", "abstract": " A method to compute accurately the electric field behaviour inside spherical and cylindrical structures is presented. These structures model a living cell and a nerve axon, respectively, taking into account the non-linear electric properties of the lipidic bi-layer surrounding membrane. It is shown that, for most of the cases of practical interest, the linearisation of the membrane characteristic is correct, since the threshold for non-linear effects is very high. When large-size biological structures, such as squid giant axons, are considered, non-linear effects also arise in the case of relatively small applied fields.", "num_citations": "5\n", "authors": ["1207"]}
{"title": "Smart-corpus: an organized repository of ethereum smart contracts source code and metrics\n", "abstract": " Many empirical software engineering studies show that there is a great need for repositories where source code is acquired, filtered and classified. During the last few years, Ethereum block explorer services have emerged as a popular project to explore and search Ethereum blockchain data such as transactions, addresses, tokens, smart-contracts' source code, prices and other activities taking place on the Ethereum blockchain. Despite the availability of this kind of services, retrieving specific information useful to empirical software engineering studies, such as the study of smart-contracts' software metrics might require many sub-tasks, such as searching specific transactions in a block, parsing files in HTML format and filtering the smart-contracts to remove duplicated code or unused smart-contracts. In this paper we afford this problem creating Smart Corpus', a Corpus of Smart Contracts in an organized reasoned and up to date repository where Solidity source code and other metadata about Ethereum smart contracts can easily and systematically be retrieved. We present the Smart Corpus' design and its initial implementation and we show how the data-set of smart contracts' source code in a variety of programming languages can be queried and processed, get useful information on smart contracts and their software metrics. The Smart Corpus aims to create a smart-contracts' repository where smart contracts data (source code, ABI and byte-code) are freely and immediately available and also classified based on the main software metrics identified in the scientific literature. Smart-contracts source code has been validated by EtherScan and each …", "num_citations": "4\n", "authors": ["1207"]}
{"title": "Connecting the dots: measuring effectiveness and affectiveness in software systems\n", "abstract": " This paper highlights the results obtained in a four-years project aiming at analyzing the development process of software artifacts from two points of view: Effectiveness and Affectiveness. The first attribute is meant to analyze the productivity of the Open Source Communities by measuring the time required to resolve an issue, while the latter provides a novel approach for studying the development process by analyzing the affectiveness expressed by developers in their comments posted during the issue resolution phase. Affectivenes is obtained by measuring Sentiment, Politeness and Emotions.", "num_citations": "4\n", "authors": ["1207"]}
{"title": "Agent-based modelling and simulation of the software market, including open source vendors\n", "abstract": " Agent-Based Modelling and Simulation of the Software Market, Including Open Source Vendors, IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Univ. Cagliari Catalogo Ricerca Università di Cagliari 1 Contributo su Rivista 1.1 Articolo in rivista Agent-Based Modelling and Simulation of the Software Market, Including Open Source Vendors, Italiano Italiano Italiano Italiano English English Agent-Based Modelling and Simulation of the Software Market, Including Open Source Vendors, / Cocco L; Concas G.; Marchesi M.; Destefanis G.. - In: JOURNAL OF INFORMATION TECHNOLOGY MANAGEMENT. - ISSN 1042-1319. - (2013). Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte dell'ateneo Scheda breve Scheda completa Titolo: Agent-Based Modelling and …", "num_citations": "4\n", "authors": ["1207"]}
{"title": "Self-organized criticality and large crashes in financial markets\n", "abstract": " \" Self-organized criticality and large crashes in financial markets\"/FOCARDI S.; MARCHESI M.-(1999).((Intervento presentato al convegno 4th Workshop on Economics with Heterogeneous Interacting Agents, Genova nel 4-5 giugno.", "num_citations": "4\n", "authors": ["1207"]}
{"title": "Linear array architecture implementing the backpropagation neural network\n", "abstract": " A linear digital array architecture implementing the back-propagation neural network is proposed. It is characterized by true local connections, full expansibility and configurability in terms of number and width of layers. Moreover, it allows to pipeline the data to process, being able to reach up to 100% efficiency in forward mode.", "num_citations": "4\n", "authors": ["1207"]}
{"title": "A Modular System for Data Management in VLSI Design\n", "abstract": " A modular approach is presented for data management of an integrated VLSI CAD system. The core of the system is a commercial, relational DBMS (INGRES). A proper database schema, carefully designed using a formal methodology of information analysis and supported by automatic tools, helps to bridge the gap between CAD technique demands and the facilities offered by a commercial DBMS. Other characteristics of the system are a tool for managing information local to application programs using a high-level query language and a database interface, which is a set of procedures handling the communications between the database and the various tools.", "num_citations": "4\n", "authors": ["1207"]}
{"title": "Design of a sustainable blockchain-oriented software for building workers management\n", "abstract": " The building workers sector is one of the most challenging sectors for Human Resources (HR) management. In this work, we propose a solution relying on Blockchain technology and present the design of a Blockchain-Oriented Software system conceived for managing the building workers sector with a focus on workers’ safety, and it is guided by sustainable and Agile Methodologies in software design. The proposed approach takes advantage of different features of the Blockchain technology and provides transparency for labor inspectors, grants data integrity and immutability, relies on tamper-proof time stamps for any recorded activity, allows the implementation of Smart Contracts where clauses are automatically respected without the need of a trusted control authority, acknowledges the legal requirements in the field, including the possibility of creating an Operational Safety Plans, which construction companies have to provide, and finally implements the creation of vacant job positions that workers can find and apply to. In order to achieve these goals, we adopt the Blockchain-Oriented Software Engineering (BOSE) methodology to design Blockchain software applications and apply an Agile methodology centered on Blockchain Software development (called ABCDE) for the design and development of the decentralized application. Such a methodology allows us to center the software development around the actors of the system in the specific domain, such as Building Workers, Construction Companies, Labor Inspectors, and so on. In addition, we rely on the software sustainability analysis, based on the five dimensions of sustainability, to …", "num_citations": "3\n", "authors": ["1207"]}
{"title": "Managing CRM with Fabric Hyperledger blockchain technology\n", "abstract": " In this chapter we describe an application of the blockchain technology for managing CRM through security “by design” according to the “Defense In Depth” methodology, where protection is obtained through multiple protection layers applied independently.", "num_citations": "3\n", "authors": ["1207"]}
{"title": "Computing the fractal dimension-a global metrics for large software systems\n", "abstract": " A software system can be associated to a graph - called software network - whose nodes are the software modules (for instance, the classes in Object-oriented systems), and edges are the dependencies between modules. A recent paper demonstrated that the structure of software networks is also self-similar under a length-scale transformation, and calculated their fractal dimension using the \"box counting\" method. In this paper, we focus on describing and evaluating alternative approaches for the computation of the fractal dimension of networks. We show that a Merge Algorithm is the most efficient, while Simulated Annealing is the most accurate. However, the Greedy Coloring algorithm, based on the equivalence of the box counting problem with the graph coloring problem, looks the best compromise, having speed comparable to MA, and accuracy comparable with SA.", "num_citations": "3\n", "authors": ["1207"]}
{"title": "A dynamic model of software product generative process\n", "abstract": " We analyze the process of software development for large, object oriented, open source software systems. Such systems may be described as complex networks when suitable variables are properly identified. In particular we model the system growth through a Yule process which enable us to fit data extracted from freely available repositories. We consider quantities related to relevant properties of the software system itself, like methods names, instance variable names, number of subclasses of each class. As opposite to a plain analysis of a final product, we perform a dynamic analysis of the product evolution, since we look at how system properties change during the development along different releases. The final goal is to detect statistical features that may be related to software dependability.", "num_citations": "3\n", "authors": ["1207"]}
{"title": "NVAF: un Framework per una valutazione di tipo comparativo delle soluzioni software nelle Pubbliche Amministrazioni.\n", "abstract": " Attualmente, molte Pubbliche Amministrazioni stanno prendendo in considerazione l’opportunita di adottare delle soluzioni FLOSS per i propri sistemi IT. Poiche il FLOSSe un fenomeno abbastanza recente, riteniamo indispensabile l’adozione di una metodologia valida per permettere alle PP. AA. di effettuare una scelta consapevole della soluzione IT (FLOSS o proprietaria) piu idonea ai propri bisogni. In questo rapporto si propone un framework, l’NVAF, che fornisce un aiuto concreto in questa scelta, ed anche le linee guida per avere una completa strategia IT, che tenga conto di tutti i bisogni dell’ente in oggetto, in un modello di business assolutamente coerente.", "num_citations": "3\n", "authors": ["1207"]}
{"title": "Helping to develop an Open Source Curriculum: the case of TOSSAD EU funded project\n", "abstract": " Helping to develop an Open Source Curriculum: the case of TOSSAD EU funded project IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Univ. Cagliari Catalogo Ricerca Università di Cagliari 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno Helping to develop an Open Source Curriculum: the case of TOSSAD EU funded project Italiano Italiano Italiano Italiano English English Helping to develop an Open Source Curriculum: the case of TOSSAD EU funded project / ATTWELL G.; BARRETT S.; ERKAN K.; KURU S.; MARCHESI M; OUNAPUU E.; ULYBIN O.. - (2005), pp. 157-161. ((Intervento presentato al convegno Open Source for Educatin in Europe nel 14-15 Novembre 2005. Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte dell'…", "num_citations": "3\n", "authors": ["1207"]}
{"title": "Xmi for xp project data interchange\n", "abstract": " Abstract In recent years Extreme Programming and Agile Methodologies are becoming very popular among academics and practitioners of the software engineering. In order to create a knowledge base on XP and agile methodologies, a common standard for process data representation is needed. This standard may also be used for interchanging data among different tools supporting XP projects. In this paper we present XMI as a possible solution to this problem. We show the advantages of XMI for XP project data collection and interchange. XMI is an OMG standard for modelling data object semantics in XML syntax. It integrates XML and UML and requires the definition of a model for data that must be interchanged. In this context we have defined a UML model for a XP project. The XP project model is made of a set of UML class diagrams representing the XP project entities, their properties and relationships. The …", "num_citations": "3\n", "authors": ["1207"]}
{"title": "The Genoa artificial stock market: microstructure and preliminary simulations\n", "abstract": " In this paper, an artificial financial market based on heterogeneous agents is presented. The proposed market is composed of traders with limited amount of cash, one traded asset and a centralized mechanism, the market maker, matching buy and sell orders. The price formation process is given by the intersection of the demand and the supply curve.The artificial financial market has been implemented using advanced software engineering techniques, in particular extreme programming and object oriented technology. The resulting system is a powerful tool able to numerically simulate financial market operations in a realistic way. Preliminary results show that the price time series exhibits a random walk behaviour with fat tails distribution of returns.", "num_citations": "3\n", "authors": ["1207"]}
{"title": "NN models of hysteretic nonlinear electromagnetic devices under voltage or current supply\n", "abstract": " A numerically efficient model of nonlinear electromagnetic devices under different supply modes is presented. The model is based on feedforward neural networks (NNs) properly inputted for voltage and current supply. The NN model allows a close prediction of typical hysteretic behavior of these devices. Comparisons with other models (e.g. Chua-Stromsmoe and Jiles-Atherton) and experimental data are also reported.", "num_citations": "3\n", "authors": ["1207"]}
{"title": "A Digital MLP Architecture for Real-Time Hierarchical Classification\n", "abstract": " \"A Digital MLP Architecture for Real-Time Hierarchical Classification\" IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Univ. Cagliari Catalogo Ricerca Università di Cagliari 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno \"A Digital MLP Architecture for Real-Time Hierarchical Classification\" Italiano Italiano Italiano Italiano English English \"A Digital MLP Architecture for Real-Time Hierarchical Classification\" / CAVIGLIA DD; MARCHESI M; VALLE M.; BARATTA DANIELA; BAIARDO VALENTINA. - (1995). ((Intervento presentato al convegno WIRN Vietri _95, VII Italian Workshop on Neural Nets, Vietri (SA) nel 18-20 Maggio. Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte dell'ateneo Scheda breve Scheda completa Titolo: \"A Digital …", "num_citations": "3\n", "authors": ["1207"]}
{"title": "Some theoretical results on the behaviour of Na and K currents in excitable membranes under voltage waveforms of various shape and frequency\n", "abstract": " The ionic currents of an excitable membrane under low-intensity voltage waveshapes are studied on the basis of the equations of Hodgkin and Huxley (HH-model). Theoretical considerations show that, when the applied signals are small, the HH-model has an active behaviour, and that the ionic currents can be correctly computed if equivalent pump-fluxes are introduced. Some results are presented, which show non-trivial behaviour of the ionic currents when particular waveshapes and frequencies are chosen for the signals.", "num_citations": "3\n", "authors": ["1207"]}
{"title": "An optimization algorithm improving Hooke and Jeeves' pattern method\n", "abstract": " \"An optimization algorithm improving Hooke and Jeeves' pattern method\" IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Univ. Cagliari Catalogo Ricerca Università di Cagliari 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno \"An optimization algorithm improving Hooke and Jeeves' pattern method\" Italiano Italiano Italiano Italiano English English \"An optimization algorithm improving Hooke and Jeeves' pattern method\" / BARABINO B.; MARCHESI M. - (1979). ((Intervento presentato al convegno Proc. Optimization Days. Canada nel 23-25 Maggio. Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte dell'ateneo Scheda breve Scheda completa Titolo: \"An optimization algorithm improving Hooke and Jeeves' pattern method\" Autori: …", "num_citations": "3\n", "authors": ["1207"]}
{"title": "Predictions of bitcoin prices through machine learning based frameworks\n", "abstract": " The high volatility of an asset in financial markets is commonly seen as a negative factor. However short-term trades may entail high profits if traders open and close the correct positions. The high volatility of cryptocurrencies, and in particular of Bitcoin, is what made cryptocurrency trading so profitable in these last years. The main goal of this work is to compare several frameworks each other to predict the daily closing Bitcoin price, investigating those that provide the best performance, after a rigorous model selection by the so-called k-fold cross validation method. We evaluated the performance of one stage frameworks, based only on one machine learning technique, such as the Bayesian Neural Network, the Feed Forward and the Long Short Term Memory Neural Networks, and that of two stages frameworks formed by the neural networks just mentioned in cascade to Support Vector Regression. Results highlight higher performance of the two stages frameworks with respect to the correspondent one stage frameworks, but for the Bayesian Neural Network. The one stage framework based on Bayesian Neural Network has the highest performance and the order of magnitude of the mean absolute percentage error computed on the predicted price by this framework is in agreement with those reported in recent literature works.", "num_citations": "2\n", "authors": ["1207"]}
{"title": "How do you Propose Your Code Changes? Empirical Analysis of Affect Metrics of Pull Requests on GitHub\n", "abstract": " Software engineering methodologies rely on version control systems such as git to store source code artifacts and manage changes to the codebase. Pull requests include chunks of source code, history of changes, log messages around a proposed change of the mainstream codebase, and much discussion on whether to integrate such changes or not. A better understanding of what contributes to a pull request fate and latency will allow us to build predictive models of what is going to happen and when. Several factors can influence the acceptance of pull requests, many of which are related to the individual aspects of software developers. In this study, we aim to understand how the affect (e.g., sentiment, discrete emotions, and valence-arousal-dominance dimensions) expressed in the discussion of pull request issues influence the acceptance of pull requests. We conducted a mining study of large git software …", "num_citations": "2\n", "authors": ["1207"]}
{"title": "Insularity and economies of density: analyzing the efficiency of a logistic network using an econometric simulation-based approach\n", "abstract": " This paper explores the challenges posed by insularity to economic development and overall welfare from a novel viewpoint. Using a multidisciplinary approach, we investigated the additional burden that this permanent geographical condition poses to retailers whose profit-maximizing strategy relies upon the exploitation of the economies of density. The analysis results show that a retailer finds it convenient to develop its network on the mainland, exploiting the proximity of his stores and distribution centres. Further, it shows that insularity, an unlikely similar condition such as peripherality and remoteness, prevents retailers from expanding their network on an island, thus lowering competition and affecting consumers’ welfare.", "num_citations": "2\n", "authors": ["1207"]}
{"title": "A BLOCKCHAIN APPROACH FOR THE SUSTAINABILITY IN TOURISM MANAGEMENT IN THE SULCIS AREA\n", "abstract": " The Sardinia island is a well-known tourist destination for holidays, famous for its coasts and its beautiful sea but also for its food. Tourism is one of the most expanding sectors of the regional economy and the use of innovative technology becomes a key element to keep abreast of the times. The complexity of the tourist system is exemplary: it affects several activities and people and influences environmental protection. In this work, we propose a blockchain based platform to guarantee the traceability and the provenance certification of the local agri-food product, to manage and promote the tourism activities in the Sulcis area and to allow tourists to provide their feedback, designing a system that takes into account the sustainability as an objective and a systemic non-functional requirement. Given the complexity of the system and the novelty of the proposed solution, we adopt the Agile methodology, which stresses the attention in customer satisfaction and incorporates sustainability. The adopted approach and the efficiency of the technology due to the security of non-corruptible data, to the use of the cryptography, to the sharing of data between actors in the supply chain, make the proposed system sustainable, competitive and promising for the tourism sector.", "num_citations": "2\n", "authors": ["1207"]}
{"title": "113 times Tomcat: A dataset\n", "abstract": " Measuring software to get information about its properties and quality is one of the main issues in modern software engineering. The aim of this paper is to present a dataset of metrics associated to 113 versions of Tomcat. We describe the dataset along with the adopted criteria and the opportunities of research, providing preliminary results. This dataset can enhance the reliability of empirical studies, enabling their reproducibility, reducing their cost, and it can foster further research on software quality and software metrics.", "num_citations": "2\n", "authors": ["1207"]}
{"title": "Using measurement and simulation for understanding distributed development processes in the cloud\n", "abstract": " Organizations increasingly develop software in a distributed manner. The Cloud provides an environment to create and maintain software-based products and services. Currently, it is widely unknown which software processes are suited for Cloud-based development and what their effects in specific contexts are. This paper presents a process simulation to study distributed development in the Cloud. We contribute a simulation model, which helps analyzing different project parameters and their impact on projects carried out in the Cloud. The simulator helps reproducing activities, developers, issues and events in the project, and it generates statistics, eg, on throughput, total time, and lead and cycle time. The aim of this simulation model is thus to analyze the tradeoffs regarding throughput, total time, project size, and team size. Furthermore, the modified simulation model aims to help project managers select the most …", "num_citations": "2\n", "authors": ["1207"]}
{"title": "Simulation of the competition among traditional and on-demand software vendors\n", "abstract": " In this work, we propose a simulation model to study the software market, and in particular the competition among on-premise and on-demand vendors of customer relationship management software. In this market two kinds of vendors, on-premise and on-demand vendors, and corporate customers interact. Vendors have an initial capital and a specific number of developers. They invest a fraction of their capital in their product quality and try to sell their products making a profit. Corporate customers buy software products for their employees, trying to minimize their cost and maximize their utility. The proposed model is able to reproduce the real trends of the market as regards both the price of software and the market shares of the vendors, despite there is relatively little empirical evidence available about the various mechanisms at play, and few experimental data. Our model could be used as a tool to forecast future …", "num_citations": "2\n", "authors": ["1207"]}
{"title": "Understanding approval rating of agile project management tools using Twitter\n", "abstract": " The role of managing a software project can be extremely complicated, requiring many teams and organizational resources. Many people are acknowledging that Agile development is helpful to business, with an high increase over the last years in the number of people who believe that Agile helps companies to complete projects faster. Since there is a multitude of available tools that supports Agile methods, in this position paper we tried to understand which tools are most looked for using Web Search media, most mentioned and most appreciated through Social media. Furthermore, we applied automated Sentiment Analysis on shared short messages of users on Twitter, one of the most popular social networks, in order to analyze automatically developers' opinions, sentiments, evaluations and attitudes.", "num_citations": "2\n", "authors": ["1207"]}
{"title": "Can islands profit from economies of density? An application to the retail sector\n", "abstract": " This paper examines the additional costs borne by retailers whose strategy relies upon the exploitation of density economies when they decide to expand their network in an island. Insularity implies indeed being a non-connected node in the network, thus preventing economies of density to be entirely exploited. On this regard, such a discontinuity would entail lower profits due to a reduced efficiency in the distribution network. Starting from real data regarding an Italian large retailer, we evaluate the extent to which insularity represents a threat for the exploitation of economies of density by the retail industry. In this respect, the Italian peculiar geograph-ical configuration makes it an interesting case study. The main finding is that while stores located in the mainland are interested by a progressive reduction of transport costs, Sardinia, which is a remote island, is not interested by such a pattern. Indeed, a contiguous distribution network helps lowering distances covered to make deliveries, thus reducing the burden represented by distribution costs. On this regard, geographical permanent features connected to insularity-such as low accessibility and small size prevent retailers to expand their network in an island, thus lowering competition and affecting consumers welfare.", "num_citations": "2\n", "authors": ["1207"]}
{"title": "System performance analyses through object-oriented fault and coupling prisms\n", "abstract": " A fundamental aspect of a system's performance over time is the number of faults it generates. The relationship between the software engineering concept of\" coupling\"(ie, the degree of inter-connectedness of a system's components) and faults is still a research question attracting attention and a relationship with strong implications for performance; excessive coupling is generally acknowledged to contribute to fault-proneness. In this paper, we explore the relationship between faults and coupling. Two releases from each of three open-source Eclipse projects (six releases in total) were used as an empirical basis and coupling and fault data extracted from those systems. A contrasting coupling profile between fault-free and fault-prone classes was observed and this result was statistically supported. Object-oriented (OO) classes with low values of fan-in (incoming coupling) and fan-out (outgoing coupling) appeared to …", "num_citations": "2\n", "authors": ["1207"]}
{"title": "Transferring FAME, a methodology for assessing open source solutions, from university to SMEs\n", "abstract": " We present FAME (Filter, Analyze, Measure and Evaluate), a simplified approach for Open Source software assessment. This approach has been derived by more heavyweight, proven approaches developed in a University research environment, to match the needs of small organizations. The proposed approach has been developed by CC-ICT-SUD, a consortium for the delivery of technology transfer services, and for transferring advanced methodologies for software evaluation and assessment from academic to industrial contexts, in particular for Small and Medium Enterprises (SME). The FAME methodology is briefly described, and a case study involving the choice of a document management system for a SME is presented, showing how the approach can be used.", "num_citations": "2\n", "authors": ["1207"]}
{"title": "Empirical study on software metrics and issues in object oriented systems\n", "abstract": " We introduced a new approach to describe Java software as graph, where nodes represent a Java file-called compilation unit (CU)-and an edges represent a relations between them. The software system is characterized by the degree distribution of the graph properties, like in-or-out links, as well as by the distribution of Chidamber and Kemerer metrics computed on its CUs. Every CU can be related to one or more bugs during its life. We find a relationship among the software system and the bugs hitting its nodes. We found that the distribution of some metrics, and the number of bugs per CU, exhibit a power-law behavior in their tails, as well as the number of CUs influenced by a specific bug. We examine the evolution of software metrics across different releases to understand how relationships among CUs metrics and CUs faultness change with time.", "num_citations": "2\n", "authors": ["1207"]}
{"title": "Modelling specifications for EURACE\n", "abstract": " This work was supported by the European Union through its 6th Framework Programme, FET-IST’Complex Systems’. Funding for the STREP research project ‘EURACE’under contract no. 035086, is gratefully acknowledged. The following persons have contributed to this paper. Simon Coakley contributed to Section 2, Michele Marchesi contributed Section 4.2, Marco Raberto and Andrea Teglio contributed Section 4.3, and Herbert Dawid, Michael Neugart and collegues contributed Section 4.4. Discussions on the topics in this paper have been held at various stages of development, during two EURACE meetings: the first held in Ancona, 27 October 2006 and the second held in Nice, 26-28 January 2007. The usual disclaimer applies.", "num_citations": "2\n", "authors": ["1207"]}
{"title": "Communication Flow in Open Source Projects: An Analysis of Developers’ Mailing Lists\n", "abstract": " Team work is defined by different factors: team size, members role, interactions and communication. In Agile Methodologies communication plays a fundamental role. Some research studies have found that the involvement of team members in a project also depends on the information provided. Communication also depends on the tool employed. The aim of this paper is to analyze communication among team members of the 9 most active projects on Sourceforge provided of a developers’ mailing list. In particular we tried to investigate how and why members post to developers’ mailing list and the use that different members make of these mailing lists.", "num_citations": "2\n", "authors": ["1207"]}
{"title": "A comparison between co-located and distributed agile methodologies\n", "abstract": " A comparison between co-located and distributed agile methodologies IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Univ. Cagliari Catalogo Ricerca Università di Cagliari 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno A comparison between co-located and distributed agile methodologies Italiano Italiano Italiano Italiano English English A comparison between co-located and distributed agile methodologies / Camplani R; Cau A; Concas G; Mannaro K; Marchesi M; Melis M; Pinna S; Serra N; Setzu A; Turnu I; Uras S. - (2005). ((Intervento presentato al convegno OSS 2005 WORKSHOP SESAMOSS'05 tenutosi a Genova, Italy nel 11 Luglio 2005. Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte dell'ateneo …", "num_citations": "2\n", "authors": ["1207"]}
{"title": "A tabu search algorithm for optimal sizing of locally recurrent neural networks\n", "abstract": " A general purpose implementation of the Tabu Search metaheuristic, called Universal Tabu Search, is used to optimally design a Locally Recurrent Neural Network architecture. In fact, generally, the design of a neural network is a tedious and time consuming trial and error operation that leads to structures whose optimality is not guaranteed. In this paper, the problem of choosing the number of hidden neurons and the number of taps and delays in the FIR and IIR network synapses is formalised as an optimisation problem whose cost function to be minimised is the network error calculated on a validation data set. The performance of the algorithm have been tested on the difficult task to learn the chaotic behaviour of a non linear circuit proposed by Chua as a paradigm for studying chaos.", "num_citations": "2\n", "authors": ["1207"]}
{"title": "Tuning of the optimization strategies on the problem size\n", "abstract": " This paper is concerned with the problem of adapting the optimization algorithms to the dimension of the problem at the hand. As test case, the problem of designing the structure of a magnetic resonance imaging system is considered with different number of optimization variables. A greedy genetic algorithm for continuous variables electromagnetic optimization problems, already presented in literature, has been modified to consider different problem sizes. A detailed comparison of performances obtained implementing several strategies and tuning of optimization parameters is eventually presented.", "num_citations": "2\n", "authors": ["1207"]}
{"title": "Self-organized criticality and phase locking in models of production and inventory dynamics\n", "abstract": " \"Self-Organized Criticality and Phase Locking in Models of Production and Inventory Dynamics\" IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Univ. Cagliari Catalogo Ricerca Università di Cagliari 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno \"Self-Organized Criticality and Phase Locking in Models of Production and Inventory Dynamics\" Italiano Italiano Italiano Italiano English English \"Self-Organized Criticality and Phase Locking in Models of Production and Inventory Dynamics\" / FOCARDI S.; MARCHESI M. - (1998). ((Intervento presentato al convegno 3rd Workshop on Economics with Heterogeneous Interacting Agents, Ancona nel 29-30 maggio. Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte dell'ateneo Scheda breve …", "num_citations": "2\n", "authors": ["1207"]}
{"title": "Lowering inner conductor surface charge density in optimized TEM cells\n", "abstract": " Optimization of the shape of the cross-section of TEM cells was already shown very effective in providing both field uniformity in large regions and compact dimensions. The surface charge densities on the inner conductor and electrode shape are investigated, in order to secure maximal fields not exceeding those provided by traditional design practices. The optimization scheme already proposed is retained, and refined electrode shapes are introduced in the procedure. Some results are discussed.", "num_citations": "2\n", "authors": ["1207"]}
{"title": "IIR filter design using mixed simulated annealing-deterministic optimization\n", "abstract": " A new global optimization algorithm for electrical design is presented. It merges features from the simulated annealing algorithm and from R. Hooke's and T.A. Jeeves's pattern search method (1961). The proposed method derives from the former algorithm the ability not to be trapped in local minima, while from the latter it derives a more efficient way to search in the cost function domain. A comparison is made with classical simulated annealing and with J.A. Nelder's and R. Mead's (1964) simplex method for the design of infinite impulse response digital filters. The proposed algorithm was shown to have the best overall efficiency in terms of computational cost.< >", "num_citations": "2\n", "authors": ["1207"]}
{"title": "Complex neural networks for equalizing nonlinear digital radio links\n", "abstract": " In the last few years, due to their capabilities of classification, generalization, and learning-fromexamples, neural network models have been used in many DSP applications. However, in some DSP problems the available signals and desired outputs are in complex form; in these cases, many widely-used neural models cannot by directly applied because they require both input and target signals to be real-valued.In this paper, a novel Multi Layer Perceptron (MLP) structure is proposed which is able to process complex signals. Since the classical real-valued sigmoidal activation function, analytically extended to the complex plane, is not bounded everywhere (due to the Liouville's theorem), a new complex activation function is proposed which is always bounded and behaves in a way very close to its real-valued counterpart. However, this function is not analytic and the standard Back-Propagation (BP) learning …", "num_citations": "2\n", "authors": ["1207"]}
{"title": "A general optimization algorithm to design FIR filters with powers-of-two coefficients\n", "abstract": " \"A General Optimization Algorithm to Design FIR Filters with Powers-of-Two Coefficients\" IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Univ. Cagliari Catalogo Ricerca Università di Cagliari 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno \"A General Optimization Algorithm to Design FIR Filters with Powers-of-Two Coefficients\" Italiano Italiano Italiano Italiano English English \"A General Optimization Algorithm to Design FIR Filters with Powers-of-Two Coefficients\" / BENVENUTO N.; MARCHESI M; UNCINI A.. - (1990), pp. 565-568. ((Intervento presentato al convegno Atti EUSIPCO-90, Fifth European Signal Processing Conf., Barcellona, Spagna nel 18-21 Settembre. Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte dell'ateneo …", "num_citations": "2\n", "authors": ["1207"]}
{"title": "ASCETA: an expert system for passive network synthesis\n", "abstract": " An expert system for passive network synthesis and filter design, developed in an object-oriented environment, is presented. It has been implemented using a shell written in the language SMALL2ALK/V and is highly interactive. It has been conceived and developed mainly for educational purposes, and its implementation has demonstrated the suitability of the object-oriented approach and of the SMALLTALK environment for this kind of problem.", "num_citations": "2\n", "authors": ["1207"]}
{"title": "Parallel Architectures for Transforms in Digital Signal Processing\n", "abstract": " \"Parallel Architectures for Transforms in Digital Signal Processing\" IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Univ. Cagliari Catalogo Ricerca Università di Cagliari 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno \"Parallel Architectures for Transforms in Digital Signal Processing\" Italiano Italiano Italiano Italiano English English \"Parallel Architectures for Transforms in Digital Signal Processing\" / MARCHESI M; ORLANDI G.; PIAZZA F.. - (1988), pp. .775-778. ((Intervento presentato al convegno Proc. EUSIPCO-88, Grenoble nel , 5-8 Settembre. Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte dell'ateneo Scheda breve Scheda completa Titolo: \"Parallel Architectures for Transforms in Digital Signal Processing\" Autori: …", "num_citations": "2\n", "authors": ["1207"]}
{"title": "A module for improving data access and management in an integrated CAD environment\n", "abstract": " A modular system is presented for handling design data, centered around the relational DBMS Ingres, taking advantage of a very careful database schema generation and of the use of software modules to comply with the specific requirements of design data. This work is mainly concerned with one of these modules, called LIPS, which enables the system to handle design data local to an application program with a high level query language, interactive level performances and the ability to support complex design objects. LIPS is composed of two programs: a schema analyzer and a precompiler, and its query language (Loquel) must be embedded in Pascal source code.", "num_citations": "2\n", "authors": ["1207"]}
{"title": "An information analysis approach to the design of databases for VLSI CAD\n", "abstract": " An information analysis approach to the design of databases for VLSI CAD IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Univ. Cagliari Catalogo Ricerca Università di Cagliari 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno An information analysis approach to the design of databases for VLSI CAD Italiano Italiano Italiano Italiano English English An information analysis approach to the design of databases for VLSI CAD / BARABINO GP; BARABINO GS; BISIO G.; MARCHESI M. - (1984). ((Intervento presentato al convegno Proc. 4th Jerusalem Conference on Information Technology nel 21-25 maggio. Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte dell'ateneo Scheda breve Scheda completa Titolo: An information analysis …", "num_citations": "2\n", "authors": ["1207"]}
{"title": "Raising Sustainability Awareness in Agile Blockchain-Oriented Software Engineering\n", "abstract": " This paper presents a first investigation to join agile blockchain-oriented software development principles with sustainability software design principles. The development of blockchain-oriented software should always be performed in the awareness of the potential effects generated from its use, especially in a long-term life cycle perspective. In other terms in the awareness of its present and future sustainability. By using the principles of sustainability software design and recognized the role of blockchain-oriented Agile methodologies to manage changes in technology and requirements, we present a new Agile method for the development of blockchain-oriented systems that includes sustainability awareness practices within the development phases, in particular in the requirements and the acceptance tests. This allows to deal with blockchain-oriented systems sustainability immediately and during the incremental …", "num_citations": "1\n", "authors": ["1207"]}
{"title": "Describing software developers affectiveness through Markov chain models\n", "abstract": " In this paper, we present an analysis of more than 500K comments from open-sourcerepositories of software systems. Our aim is to empirically determine how developers interact with each otherunder certain psychological conditions generated by politeness, sentiment andemotion expressed within developers' comments. Developers involved in an open-source projects do not usually know each other; they mainly communicate through mailing lists, chat rooms, and tools such as issue tracking systems. The way in which they communicate affects the development process and the productivity of the people involved in the project. We evaluated politeness, sentiment and emotions of comments posted by developers and studied the communication flow to understand how they interacted in the presence of impolite and negative comments (and vice versa). Our analysis shows that when in presence of impolite or negative comments, the probability of the next comment being impolite or negative is 14% and 25%, respectively; anger however, has a probability of 40% of being followed by a further anger comment. The result could help managers take control the development phases of a system, since social aspects can seriously affect a developer's productivity. In a distributed environment this may have a particular resonance.", "num_citations": "1\n", "authors": ["1207"]}
{"title": "A digital voting system for the 21st century\n", "abstract": " We present Terminus, a voting system based on blockchain technology. Terminus relies on technology solutions pioneered by Monero, a privacy-focused Blockchain, and on specifically designed operational procedures: this guarantees full anonymity of the vote and addresses several concerns of digital voting systems. Terminus was tested at an event of an Italian political movement, and will be used to carry out polls to drive some of the political decisions of this movement. We also introduce an evaluation framework for DLT voting systems, and use it to compare existing systems.", "num_citations": "1\n", "authors": ["1207"]}
{"title": "Measuring affectiveness and effectiveness in software systems\n", "abstract": " The summary presented in this paper highlights the results obtained in a four-years project aiming at analyzing the development process of software artifacts from two points of view: Effectiveness and Affectiveness. The first attribute is meant to analyze the productivity of the Open Source Communities by measuring the time required to resolve an issue, while the latter provides a novel approach for studying the development process by analyzing the affectiveness ex-pressed by developers in their comments posted during the issue resolution phase. Affectivenes is obtained by measuring Sentiment, Politeness and Emotions. All the study presented in this summary are based on Jira, one of the most used software repositories.", "num_citations": "1\n", "authors": ["1207"]}
{"title": "Simulation of the on Demand Software Model, Including Vendors Offering Source Code Availability\n", "abstract": " In recent years, the power balance between software firms and enterprise customers has been heavily changing. The contractual power of customers is increasing and the firms must take this fact into account. Stated the common need to save money, the opportunities to adopt new software solutions with tight budgets, or with substantial savings, are limited. The better way to obtain operational savings seems to be shifting to the use of open source software, obtaining in this way all the benefits of this software typology: lower costs, greater adherence to open standards, a broader vendor choice and service suppliers, no vendor lock-in and flexible, incremental architectures. In this work, a business model is proposed to analyse the competition among on-demand customer relationship management (CRM) firms, in particular among firms offering CRM products with or without source code availability. The model can also …", "num_citations": "1\n", "authors": ["1207"]}
{"title": "Studies on the impact of the option market on the underlying stock market\n", "abstract": " In the past thirty years, options have become an important financial instrument, and now they account for a substantial percentage of total trading activity. From a research perspective, a lot of research have been carried out about the theoretical computation of option prices, starting from the seminal works of Black and Scholes (1973) and Merton (1973). Several researchers also examined the issue of to which extent options interact with their underlying stocks, and in particular their possible effects on stock returns and volatility, and on the overall quality of the underlying security market.", "num_citations": "1\n", "authors": ["1207"]}
{"title": "XMI for XP project data interchange\n", "abstract": " In recent years Extreme Programming and Agile Methodologies are becoming very popular among academics and practitioners of software engineering. In order to create a knowledge base on XP and agile methodologies, a common standard for process data representation is needed. This standard can also be used for interchanging data among different tools supporting XP projects. In this paper we present XMI as a possible solution to this problem. We show the advantages of XMI for XP project data collection and interchange. XMI is an OMG standard for modelling data object semantics in XML syntax. It integrates XML and UML and requires the definition of a model for data that must be interchanged. In this context we have defined a UML model for an XP project. The XP project model consists of a set of UML classes diagrams representing the XP project entities, their properties and relationships. The model …", "num_citations": "1\n", "authors": ["1207"]}
{"title": "Agile Methodologies and Quality Certification\n", "abstract": " • SQC audits and best practices have been first applied to very big projects, and retain their culture• SQC principles are good and acceptable• In practice, though, SQC certification is very heavy• Auditors require a lot of documentation, meetings and records that may hinder the process• The driving force behind efforts to develop a QS is certification itself, not the perception that currently existing processes need to be improved.• Many certified software firms actually do not follow their certification", "num_citations": "1\n", "authors": ["1207"]}
{"title": "Automated Neural Model Design for a CSTR Using a Tabu Search Algorithm\n", "abstract": " a general purpose implementation of the Tabu Search metaheuristic, called Universal Tabu Search, is used to optimally design a Locally Recurrent Neural Network architecture. In fact, generally, the design of a neural network is a tedious and time consuming trial and error operation that leads to structures whose optimality is not guaranteed. In this paper, the problem of choosing the number of hidden neurons and the number of taps and delays in the FIR and IIR network synapses is formalised as an optimisation problem whose cost function to be minimised is the network error calculated on a validation data set. The performances of the proposed approach have been tested on the problem of modelling non isothermal, continuously stirred tank reactor, in which a first order exothermic reaction is occurring. Comparison with alternative neural approaches are reported, showing the usefulness of the proposed method.", "num_citations": "1\n", "authors": ["1207"]}
{"title": "Testing for Nonlinearity in an Artificial Financial Market\n", "abstract": " We present a stochastic simulation model of a prototype financial market. The model covers a number of endogeneous interactions between economic agents: agents may change their mood with respect to the future price development under the influence of other traders’ obeserved behaviour and they may switch between strategies (chartist or fundamentalist) according to observed differences in profits. The particular behavioural variant adopted by an agent also determines her decision to enter on the long or short side of the market. Short-run imbalances between demand and supply lead to price adjustments by a market maker or auctioneer in the usual Walrasian manner. Our interest in this paper is in exploring the behaviour of our model when testing for the presence of chaos or non-linearity in the simulated data. First, attempts to determine the fractal dimension of the underlying process gave unsatisfactory results in that we experienced a lack of convergence of the estimate. Explicit tests for non-linearity and dependence (The BDS and Kaplan tests) also give very unstable results in that we can find both acceptance and strong rejection of IIDness in different realisations of our model. All in all, this behaviour is very similar to experience collected with empirical data and our results may point towards an explanation of why robustness of inference in this area is low. Estimating GARCH models, we also find that most of the nonlinearity is contained in second moments.", "num_citations": "1\n", "authors": ["1207"]}
{"title": "Parallel Implementation of Hybrid Algorithms for Electromagnetic Structures Optimal Design Problems\n", "abstract": " \"Parallel Implementation of Hybrid Algorithms for Electromagnetic Structures Optimal Design Problems\" IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Univ. Cagliari Catalogo Ricerca Università di Cagliari 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno \"Parallel Implementation of Hybrid Algorithms for Electromagnetic Structures Optimal Design Problems\" Italiano Italiano Italiano Italiano English English \"Parallel Implementation of Hybrid Algorithms for Electromagnetic Structures Optimal Design Problems\" / FANNI A.; MARCHESI M; SERRI A.; USAI M.. - (1997), pp. 556-559. ((Intervento presentato al convegno Proc. Int. Symp. on Theoretical Electrical Eng. (ISTE97), Palermo nel 9-11 giugno. Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a …", "num_citations": "1\n", "authors": ["1207"]}
{"title": "Neural networks for parsing natural language sentences\n", "abstract": " A neural network approach for parsing natural language sentences in English is presented. It is limited to technical sublanguages, and is based on a multilayer perceptron. The network is able to assign to each word of a sentence its syntactic category, with a low rate of errors. The network is part of a system including pre- and post-processors, and can be run also in parallel to traditional grammar parsing, with both approaches taking advantage of each other to decrease the overall error rate.", "num_citations": "1\n", "authors": ["1207"]}
{"title": "A Petri net simulator based on object-oriented programming\n", "abstract": " \"A Petri net simulator based on object-oriented programming\" IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Univ. Cagliari Catalogo Ricerca Università di Cagliari 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno \"A Petri net simulator based on object-oriented programming\" Italiano Italiano Italiano Italiano English English \"A Petri net simulator based on object-oriented programming\" / FANNI A.; GIUA A.; MARCHESI M; SANNA N.. - (1996). ((Intervento presentato al convegno Congresso AIRO '96, Perugia nel 17-20 settembrre. Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte dell'ateneo Scheda breve Scheda completa Titolo: \"A Petri net simulator based on object-oriented programming\" Autori: …", "num_citations": "1\n", "authors": ["1207"]}
{"title": "Object-oriented development of a railway simulator\n", "abstract": " Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS", "num_citations": "1\n", "authors": ["1207"]}
{"title": "An algorithm for dynamically adapting neural network topologies\n", "abstract": " Recently, it has been proposed that biological networks change not only the synaptic strengths of connection but also partially their internal topologies, according to either the received external stimuli or the pre-existent connection layouts. Following this idea, a method is presented to dynamically adapt the topology of neural networks with supervised learning, using only the information of the training set. The method eliminates connections from an initial fully connected network, concurrently with the learning algorithm. Several experimental results obtained with multilayered networks are also reported to demonstrate the capabilities of the proposed method.< >", "num_citations": "1\n", "authors": ["1207"]}
{"title": "Analysis of evoked potentials by adaptive neural network.\n", "abstract": " The purpose of this paper is to analyse the possibility of using the MLP neural network for the processing of the Evoked Potentials (EP). In this case the process can be conceived as deterministic low amplitude signal (damped sine waves), corresponding to the brain response to stimuli, embedded in strongly coloured noise, the EEG background activity. Typical values of the signal-to-noise ratio are less than 0dB.", "num_citations": "1\n", "authors": ["1207"]}
{"title": "A Global Optimization Algorithm for Electronic CAD\n", "abstract": " \"A Global Optimization Algorithm for Electronic CAD\" IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Univ. Cagliari Catalogo Ricerca Università di Cagliari 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno \"A Global Optimization Algorithm for Electronic CAD\" Italiano Italiano Italiano Italiano English English \"A Global Optimization Algorithm for Electronic CAD\" / MARCHESI M. - (1987), pp. 688-690. ((Intervento presentato al convegno Proc. Int. Symp. on Electronic Devices, Circuits and Systems, India nel 16-18 dicembre. Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte dell'ateneo Scheda breve Scheda completa Titolo: \"A Global Optimization Algorithm for Electronic CAD\" Autori: MARCHESI, MICHELE Data di pubbli…", "num_citations": "1\n", "authors": ["1207"]}
{"title": "Improving Data Management Performances of an Integrated System of CAD Tools\n", "abstract": " \"Improving Data Management Performances of an Integrated System of CAD Tools\" IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Univ. Cagliari Catalogo Ricerca Università di Cagliari 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno \"Improving Data Management Performances of an Integrated System of CAD Tools\" Italiano Italiano Italiano Italiano English English \"Improving Data Management Performances of an Integrated System of CAD Tools\" / BARABINO GP; BARABINO GS; BISIO G.; MARCHESI M. - (1985), pp. 401-405. ((Intervento presentato al convegno Proc. IEEE/ACM Compint 85, Computer Aided Technologies nel 8-12 Settembre. Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte dell'ateneo Scheda breve Scheda …", "num_citations": "1\n", "authors": ["1207"]}
{"title": "Improving Hooke and Jeeves' pattern search method\n", "abstract": " \"Improving Hooke and Jeeves' pattern search method\" IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Univ. Cagliari Catalogo Ricerca Università di Cagliari 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno \"Improving Hooke and Jeeves' pattern search method\" Italiano Italiano Italiano Italiano English English \"Improving Hooke and Jeeves' pattern search method\" / BARABINO G.; MARCHESI M. - (1979). ((Intervento presentato al convegno Proc. 10th International Symposium on Mathematical Programming, Canada nel 27-31 Agosto. Scheda prodotto non validato Attenzione! I dati visualizzati non sono stati sottoposti a validazione da parte dell'ateneo Scheda breve Scheda completa Titolo: \"Improving Hooke and Jeeves' pattern search method\" Autori: MARCHESI, MICHELE …", "num_citations": "1\n", "authors": ["1207"]}
{"title": "A Stochastic Model of Software Maintenance and Its Implications on XP Process\n", "abstract": " Maintenance is that phase of the software life cycle when existing software is modified to fix errors, restructure the system for greater efficiency, or ready it for future upgrades (Pressman, 1997); it accounts for well over 50% of the total cost of software development. Despite its contribution to costs, software maintenance and evolution has been the subject of a surprisingly small number of empirical studies (Kemerer and Slaughter, 1999); few models have been attempted and validated to describe the overall process and explain the effort required and the quality of the resulting system. However, more in depth research seems to be necessary to attain a higher level of empirical validation (Ramil and Lehman, 1999).", "num_citations": "1\n", "authors": ["1207"]}