{"title": "A guide to chi-squared testing\n", "abstract": " The first step-by-step guide to conducting successful Chi-squaredtests Chi-squared testing is one of the most commonly applied statisticaltechniques. It provides reliable answers for researchers in a widerange of fields, including engineering, manufacturing, finance, agriculture, and medicine. A Guide to Chi-Squared Testing brings readers up to date on recentinnovations and important material previously published only in theformer Soviet Union. Its clear, concise treatment and practicaladvice make this an ideal reference for all researchers andconsultants. Authors Priscilla E. Greenwood and Mikhail S. Nikulin demonstratethe application of these general purpose tests in a wide variety ofspecific settings. They also* Detail the various decisions to be made when applying Chi-squaredtests to real data, and the proper application of these tests instandard hypothesis-testing situations* Describe how Chi-squared type tests allow statisticians toconstruct a test statistic whose distribution is asymptoticallyChi-squared, and to compute power against various alternatives* Devote half of the book to examples of Chi-squared tests that canbe easily adapted to situations not covered in the book* Provide a self-contained, accessible treatment of themathematical requisites* Include an extensive bibliography and suggestions for furtherreading", "num_citations": "1224\n", "authors": ["1037"]}
{"title": "Accelerated life models: modeling and statistical analysis\n", "abstract": " The authors of this monograph have developed a large and important class of survival analysis models that generalize most of the existing models. In a unified, systematic presentation, this monograph fully details those models and explores areas of accelerated life testing usually only touched upon in the literature. Accelerated Life Models:", "num_citations": "610\n", "authors": ["1037"]}
{"title": "Estimation in degradation models with explanatory variables\n", "abstract": " Influence of covariates on degradationis modelled. Models which include dependence of the intensityof the process of traumatic events on the degradation level arealso discussed. Estimation of reliability and degradation characteristicsfrom data with covariates is considered in dynamic environments.", "num_citations": "240\n", "authors": ["1037"]}
{"title": "Analysis of variance for functional data\n", "abstract": " Functional data analysis has been a popular statistical research topic for the past three decades. Functional data are often obtained by observing a number of subjects over time, space, or other continua densely. They are frequently collected from various research areas, including audiology, biology, children’s growth studies, ergonomics, environmentology, meteorology, and women’s health studies among others in the form of curves, surfaces, or other complex objects. Statistical inference for functional data generally refers to estimation and hypothesis testing about functional data. There are at least two monographs available in the literature that are devoted to estimation and classification of functional data. This book mainly focuses on hypothesis testing problems about functional data, with topics including reconstruction of functional observations, functional ANOVA, functional linear models with functional …", "num_citations": "206\n", "authors": ["1037"]}
{"title": "Chi-squared goodness of fit tests with applications\n", "abstract": " Chi-Squared Goodness of Fit Tests with Applications provides a thorough and complete context for the theoretical basis and implementation of Pearson’s monumental contribution and its wide applicability for chi-squared goodness of fit tests. The book is ideal for researchers and scientists conducting statistical analysis in processing of experimental data as well as to students and practitioners with a good mathematical background who use statistical methods. The historical context, especially Chapter 7, provides great insight into importance of this subject with an authoritative author team. This reference includes the most recent application developments in using these methods and models. Systematic presentation with interesting historical context and coverage of the fundamentals of the subject Presents modern model validity methods, graphical techniques, and computer-intensive methods Recent research and a variety of open problems Interesting real-life examples for practitioners", "num_citations": "139\n", "authors": ["1037"]}
{"title": "Chi-squared goodness-of-fit test for right censored data\n", "abstract": " In this communication we consider chi-squared goodness-of-fit tests from censored data. Choice of random grouping intervals as data functions is considered. Simple formulas useful for computing of test statistics for mostly applied classes of survival distributions are given.", "num_citations": "108\n", "authors": ["1037"]}
{"title": "A Chi-Squared Test for the Generalized Power Weibull Family for the Head-and-Neck Cancer Censored Data.\n", "abstract": " We propose a chi-squared type statistic to test the validity of the generalized power Weibull family based on the Head-and-Neck cancer censored data. Bibliography: 18 titles.", "num_citations": "96\n", "authors": ["1037"]}
{"title": "Nonparametric tests for censored data\n", "abstract": " This book concerns testing hypotheses in non-parametric models. Generalizations of many non-parametric tests to the case of censored and truncated data are considered. Most of the test results are proved and real applications are illustrated using examples. Theories and exercises are provided. The incorrect use of many tests applying most statistical software is highlighted and discussed.", "num_citations": "88\n", "authors": ["1037"]}
{"title": "Targeted drugs\n", "abstract": " Targeted Drugs, as the second volume in the series Polymers in Biology and Medicine, was designed to provide an overview of that rapidly emerging field of biomedical polymer science which is concerned with the synthesis, properties, and clinical use of macromolecular drug carriers for targeting or localizing pharmacological activity. Although a single book could not possibly be comprehensive in addressing this topic, brought together here for the first time are original contributions by many of the pioneers in this still very young interdisciplinary field.", "num_citations": "83\n", "authors": ["1037"]}
{"title": "Несмещенные оценки и их применения\n", "abstract": " Сегодня в науке и технике при изучении различных явлений широко используются вероятностные модели. Как правило, эти модели зависят от неизвестных параметров, значения которых надлежит оценить экспериментальным путем. Основными методами обработки результатов наблюдений экспериментов являются методы математической статистики, в частности методы теории статисти-ческого оценивания. в книге рассматриваются вопросы теории и применения так называемых несмещенных точечных статистических оценок, играю-щих важную роль в современных научно-технических исследова-ниях. Серьезное внимание проблеме несмещенного Оценивания статистики начали уделять в конце сороковых годов и за истекший период времени в этом направлении проделана большая работа: Построена изящная теория, хорошо разработана техника получения несмещенных оценок и, кроме того, решено огромное число теоретических и прикладных задач. Однако воспользоваться сегодня всей этой информацией нелегко в силу ее разбросанности во все увеличивающемся потоке литературы по математической статистике и ее применениям.", "num_citations": "71\n", "authors": ["1037"]}
{"title": "Generalized proportional hazards model based on modified partial likelihood\n", "abstract": " The proportional hazards (Cox) model is generalized by assuming that at any moment the ratio of hazard rates is depending not only on values of covariates but also on resources used until this moment. Relations with generalized multiplicative, frailty and linear transformation models are considered. A modified partial likelihood function is proposed, and properties of the estimators are investigated.", "num_citations": "69\n", "authors": ["1037"]}
{"title": "On a modification of the standard statistics of Pearson\n", "abstract": " This communication is devoted to the problem of the statistical testing of the hypothesis as to whether the distribution function for the independent identically distributed random variables sc, so, belongs to a family ofcontinuous functions F (x; 0), Ixl<, 0-’-(01, Os) T EO C Rs, where O is an open set. We divide the real line into r intervals by the points x0< x<.< xr-< xr 0o, x,-x0 0o. Following Cram6r (see [1], Chapter 30), we suppose that", "num_citations": "63\n", "authors": ["1037"]}
{"title": "Transfer functions and semiparametric regresion models\n", "abstract": " A general approach to semiparametric regression model construction is proposed, using the notation of a transfer functional. Estimators of unknown regression parameters are proposed, generalising the estimators of the parameters of the proportional hazards and the additive risk models.", "num_citations": "58\n", "authors": ["1037"]}
{"title": "«Statistique des essais accélérés» by M. Nikulin, L. Gerville-Reache, V. Couallier\n", "abstract": " Archive ouverte HAL - « Statistique des essais accélérés » by M.Nikulin, L.Gerville-Reache, V.Couallier Accéder directement au contenu Accéder directement à la navigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data Documentation Episciences.org Episciences.org Revues Documentation Sciencesconf.org Support hal Accueil Dépôt Consultation Les derniers dépôts Par type de publication Par discipline Par année de publication Par structure de recherche Les portails de l'archive Recherche Documentation hal-00208058, version 1 Ouvrage (y compris édition critique et traduction) « Statistique des essais accélérés » by M.Nikulin, L.Gerville-Reache, V.Couallier Mikhail Nikulin 1 Léo Gerville-Réache 1 Vincent Couallier 1 Détails 1 IMB - Institut de Mathématiques de Bordeaux Type de document : Ouvrage (y compris édition critique et traduction) Domaine : …", "num_citations": "55\n", "authors": ["1037"]}
{"title": "Semiparametric models in accelerated life testing\n", "abstract": " The considered models are used in reliability theory analysing results of accelerated life testing. Really, many manufactured devices have a long life when used under normal conditions. Therefore much time is required to get sufficiently large data for reliability estimation. To avoid this, items can be tested under higher stress conditions. In this case all processes resulting in failures of items elapse more quickly. As a result, failures which in normal conditions would occur only after a long testing, can be observed and the size of data can be enlarged. Such reliability testing is called accelerated life testing. Using information about failures under higher stress conditions, inference about item reliability under normal stress must be made. The solution of this problem requires construction of a model relating the distribution of failure time on stress. In survival analysis the considered models are most used when the dependence of lifetime of individuals on concomitant variables is analysed. A number of such models was proposed by engineers who considered physics of failure formation process of certain products or by statistitians (see Andersen & others (1993), Aranda-Ordaz (1983), Cox & Oakes (1984), Dabrowska & Doksum (1988), Droesbeke & others (1989), Elandt-Johnson & Johnson (1980), Gertsbakh & Kordonskiy (1969), Hill & others (1990), Kalbfleisch & Prentice (1980), Kartashov (1979), Lawless (1982), Lee (1992), Lin & Ying (1994), Meeker & Escobar (1993), Miner (1945), Moreau & others (1985), Nelson (1980, 1990), Sedyakin (1966)).", "num_citations": "50\n", "authors": ["1037"]}
{"title": "The contribution of dementia to the disablement process and modifying factors\n", "abstract": " The objective of this study was to examine the impact of dementia on disability progression and mortality, and to analyze the modifying effect of risk factors and extra-individual factors. A sample of 3,403 participants in the PAQUID study was followed for 10 years. Disability was assessed on a 4-grade scale: no disability, disabled only on the Rosow-Breslau scale, disabled on the Rosow-Breslau scale and on instrumental activities of daily living (IADL) scales, and disabled on the Rosow-Breslau, IADL and activities of daily living (ADL) scales. A Markov model was used to estimate the effect of explanatory variables on disability and mortality. Controlling for age, gender, education, place of residence, medical care and informal support, dementia had a strong significant effect on progression to IADL and then to ADL disability. Dementia did not increase the risk of death, once disability was taken into account, except from …", "num_citations": "48\n", "authors": ["1037"]}
{"title": "Analysis of survival data with cross‐effects of survival functions\n", "abstract": " We present a model and semiparametric estimation procedures for analyzis of survival data with cross‐effects (CE) of survival functions. Finite sample properties of the estimators are analyzed by simulation. A goodness‐of‐fit test for the proportional hazards model against the CE model is proposed. The well known data concerning effects of chemotherapy and radiotherapy on the survival times of gastric cancer patients is analyzed as an example.", "num_citations": "43\n", "authors": ["1037"]}
{"title": "A new statistic for detecting outliers in exponential case\n", "abstract": " A generalization of Chauvenet's test (see Bol'shev, L. N. . On tests for rejecting outlying observations. Trudy In-ta prikladnoi Mat. Tblissi Gosudart. univ. 2:159–177. (In Russian); Voinov, V. G., Nikulin, M. N. . Unbaised Estimators and Their Applications. Vol. 2. Kluwer Academic Publishers.) suitable to applied the problem of detecting r outliers in an univariate data set is proposed. In the exponential case, the Chauvenet's test can be used. Various modifications of this test were considered by Bol'shev, Ibrakimov and Khalfina (Ibrakimov, I. A., Khalfina . Some asymptotic results concerning the Chauvenet test. Ter. Veroyatnost. i Primenen. 23(3):593–597.), Greenwood and Nikulin (Greenwood, Nikulin, P. E. . A Guide to Chi-Squared Testing. New York: John Wiley and Sons, Inc.) depending on the choice of the estimation method used: MLE or MVUE. As procedures for testing one outlier in exponential model have been …", "num_citations": "42\n", "authors": ["1037"]}
{"title": "Chi-squared goodness-of-fit tests for parametric accelerated failure time models\n", "abstract": " We give chi-squared goodness-of fit tests for parametric regression models such as accelerated failure time, proportional hazards, generalized proportional hazards, frailty models, transformation models, and models with cross-effects of survival functions. Random right censored data are used. Choice of random grouping intervals as data functions is considered.", "num_citations": "40\n", "authors": ["1037"]}
{"title": "Parametric inference for step-stress models\n", "abstract": " Applications of the additive accumulation of damages (AAD) or the accelerated failure time (AFT) and the proportional hazards (PH) models in accelerated life testing with step-stresses are discussed. A new model including AAD and PH models is proposed. It is more reasonable than the PH model and wider then the AAD model. Constructing the maximum likelihood function is discussed.", "num_citations": "39\n", "authors": ["1037"]}
{"title": "Chi-squared goodness-of-fit test for the family of logistic distributions\n", "abstract": " Let X\\,..., Xn be independent identically distributed random variables and suppose that according to the hypothesis Ho p {Xi< x}= F (x, e), e=(9\\,..., es) TeecRs, xeR\\(l) where 6 is an open set. We divide the real line into k intervals I\\,..., Ik: hu... uik= 1 1, U n/j= 0, i# j.", "num_citations": "38\n", "authors": ["1037"]}
{"title": "Analysis of joint multiple failure mode and linear degradation data with renewals\n", "abstract": " Non-parametric estimators of various competing modes intensities and failure probabilities from linear degradation–failure time data with partial renewals are given. Decompositions of counting processes associated with degradation and failure moments are obtained. Some of these decompositions imply estimation procedures. Others are used to obtain asymptotic properties of estimators. Conditions for the uniform consistency of the estimators are given. The limit law of the estimators is obtained.", "num_citations": "36\n", "authors": ["1037"]}
{"title": "Mathematical and Statistical Models and Methods in Reliability: Applications to Medicine, Finance, and Quality Control\n", "abstract": " The book is a selection of invited chapters, all of which deal with various aspects of mathematical and statistical models and methods in reliability. Written by renowned experts in the field of reliability, the contributions cover a wide range of applications, reflecting recent developments in areas such as survival analysis, aging, lifetime data analysis, artificial intelligence, medicine, carcinogenesis studies, nuclear power, financial modeling, aircraft engineering, quality control, and transportation. Mathematical and Statistical Models and Methods in Reliability is an excellent reference text for researchers and practitioners in applied probability and statistics, industrial statistics, engineering, medicine, finance, transportation, the oil and gas industry, and artificial intelligence.", "num_citations": "33\n", "authors": ["1037"]}
{"title": "Probability distributions of the Kolmogorov and omega-square statistics for continuous distributions with shift and scale parameters\n", "abstract": " The paper is devoted to the application of the statistical Kolmogorov and omega-square criteria to verification of a complex hypothesis H0 according to which the independent, identically and continuously distributed random variables X1,...,Xn have the law G[(x−θ 1)/θ 2].", "num_citations": "33\n", "authors": ["1037"]}
{"title": "Probability, statistics and modelling in public health\n", "abstract": " On September 23, 2003 Marvin Zelen was awarded the title of Docteur Honoris Causa de l’Université Victor Segalen Bordeaux 2, Bordeaux, France. Professor Zelen was the third biostatistician to receive this title after David Cox (1999) and Norman Breslow (2001). To mark the occasion and the importance of the contribution of Professor Zelen in development of biostatistics in public health and especially in the War on Cancer, a special symposium, Probabilités,", "num_citations": "32\n", "authors": ["1037"]}
{"title": "Statistical planning and inference in accelerated life testing using the CHSS model\n", "abstract": " Failures of highly reliable units are rare and it may be not possible to gather the failure time data needed for reliability estimation. One way of obtaining failures during the time given for experiments is to apply methods of accelerated life testing (ALT). In ALT units are tested at higher than usual (design) stress conditions. The purpose is to give estimators of the main reliability characteristics of units functioning under the usual stress using data of accelerated experiments. To treat such data accelerated life models are used. Here we consider special plans of experiments and the statistical analysis of the ALT data by numerical methods and simulation using the changing shape and scale (CHSS) model proposed by Bagdonavičius and Nikulin (1999). The CHSS model is a natural extension of the standard accelerated failure time (AFT) model. We give parametric and semiparametric estimation procedures for the CHSS …", "num_citations": "31\n", "authors": ["1037"]}
{"title": "Expériences accélérées: analyse statistique du modèle standard de vie accélérée\n", "abstract": " We consider parametric, semiparametric and nonparametric estimation in accelerated life testing. The accelerated failure time model is used to describe the dependence of the time-to-failure on a stress. Possible plan of experiments are considered.", "num_citations": "31\n", "authors": ["1037"]}
{"title": "Inverse Gaussian model and its applications in reliability and survival analysis\n", "abstract": " Statistical properties of the parametric family of inverse Gaussian distributions are studied. Different goodness-of-fit tests for this family are compared. Some applications of the inverse Gaussian model in survival analysis and reliability are considered.", "num_citations": "29\n", "authors": ["1037"]}
{"title": "Statistical analysis of general degradation path model and failure time data with multiple failure modes\n", "abstract": " This article considers degradation and failure time models with multiple failure modes which used to study the problem of longevity and aging in survival analysis and reliability. Degradation process is modeled using general nonparametric, nonlinear path models. Semi-parametric models for the intensities of the traumatic failures are used supposing that these intensities depend on degradation level. Semi-parametric estimators of various reliability characteristics are proposed and asymptotic properties of the estimators are obtained. The theoretical results are illustrated using simulated data.", "num_citations": "26\n", "authors": ["1037"]}
{"title": "On the power generalizedWeibull family: model for cancer censored data\n", "abstract": " On the power generalizedWeibull family: model for cancer censored data IDEAS home Advanced search Economic literature: papers, articles, software, chapters, books. Authors Institutions Rankings Help/FAQ MyIDEAS More options at page bottom Economic literature Authors Institutions Rankings Help/FAQ MyIDEAS (now with weekly email digests) Advanced (and improved) search Browse Econ Literature Working papers Journals Software components Books Book chapters JEL classification More features Subscribe to new research RePEc Biblio Author registration Economics Virtual Seminar Calendar NEW! FRED data IDEAS home Printed from https://ideas.repec.org/a/mtn/ancoec/090106.html My bibliography Save this article On the power generalizedWeibull family: model for cancer censored data Author & abstract Download 1 Citations Related works & more Corrections Author Listed: Mikhail Nikulin Firoozeh …", "num_citations": "25\n", "authors": ["1037"]}
{"title": "Statistical Mosels and Methods for Biomedical and Technical Systems\n", "abstract": " An outgrowth of the\" International Conference on Statistical Models for Biomedical and Technical Systems,\" this book is comprised of contributions from renowned experts, demonstrating the significance of current research on theory, methods, and applications of the field. The contributions, which deal with the mathematical aspects of survival analysis and reliability as well as other topics, are a careful selection of invited and contributed chapters, reflecting recent developments in the following areas:* Applications in epidemiology* Estimation and testing for stochastic processes* Generalizations of the Cox regression model* Probabilistic and statistical models and methods in reliability* Semi-parametric inference in survival analysis* Models and methods in survival analysis, longevity, aging, and degradation* Nonparametric estimation–Goodness-of-fit tests* Accelerated life models* Quality of life* Analysis of censored data* Adaptive and repeated measurements designs* Measures of divergence, model selection, and survival models* New statistical challenges in genomics The book will be useful to a broad interdisciplinary readership of researchers and practitioners in applied probability and statistics, industrial statistics, biomedicine, biostatistics, and engineering. Practitioners and researchers in academia will gain insight and new ideas for exploring this fertile area of research.", "num_citations": "25\n", "authors": ["1037"]}
{"title": "Chi-squared tests for general composite hypotheses from censored samples\n", "abstract": " We give chi-squared goodness-of-fit tests for parametric models including various regression models such as accelerated failure time, proportional hazards, generalized proportional hazards, frailty models, transformation models, models with cross-effects of survival functions. Choice of random grouping intervals as data functions is considered.", "num_citations": "24\n", "authors": ["1037"]}
{"title": "Statistical models to analyze failure, wear, fatigue, and degradation data with explanatory variables\n", "abstract": " Failures of highly reliable units are rare. One way of obtaining a complementary reliability information is to do accelerated life testing (ALT), i.e., to use a higher level of experimental factors, hence to obtain failures quickly. Another way of obtaining complementary reliability information is to measure some parameters which characterize the aging or wear of the product in time.             Statistical inference from ALT is possible if failure time regression models relating failure time distribution with external explanatory variables (covariates, stresses) influencing the reliability are well chosen. Statistical inference from failure time-degradation data with covariates needs even more complicated models relating failure time distribution not only with external but also with internal explanatory variables (degradation, wear) which explain the state of units before the failures. In the last case, models for degradation process …", "num_citations": "23\n", "authors": ["1037"]}
{"title": "Tests for equality of survival distributions against non-location alternatives\n", "abstract": " We propose new two andk-sample tests for evaluating the equality of survival distributions against alternatives that include crossing of survival functions, and proportional and monotone hazard ratios. The tests allow for right censored data. The asymptotic power against local alternatives is investigated. Simulation results demonstrate that the new tests are more powerful than known tests when survival functions cross. We apply the tests to a well known study of chemo- and radio-therapy conducted by the Gastrointestinal Tumor Study Group. TheP-values for both proposed tests are much smaller than for other known tests.", "num_citations": "23\n", "authors": ["1037"]}
{"title": "Life Testing.\n", "abstract": " This is an expository survey of the various procedures used in life testing, including those used in accelerated life testing. This survey was written at the invitation of Professors NL Johnson and S. Kotz, editors of the forthcoming Encyclopedia of Statistical Sciences, to be published by John Wiley and Sons, Inc., New York. AuthorDescriptors:", "num_citations": "21\n", "authors": ["1037"]}
{"title": "Goodness-of-fit for the Cox model from left truncated and right censored data\n", "abstract": " We propose a test for the proportional hazards (Cox) model which is oriented against wide classes of alternatives including monotone hazard ratios and crossings of survival functions and can be used when data are left truncated and right censored. The limit distribution of the test statistics is derived. The results are applied for statistical analysis of classical data considered by Stablein and Koutrouvelis [19], Klein and Moeschberger [12], Hosmer and Lemeshow [7], Hosmer, Lemeshow and May [8]. Bibl.–20 titles.", "num_citations": "20\n", "authors": ["1037"]}
{"title": "Additive and multiplicative semiparametric models in accelerated life testing and survival analysis\n", "abstract": " We consider classes of semiparametric regression models formulated by Bagdonavičius and Nikulin in the paper “Semiparametric models in accelerated life testing”(Queen's Papers in Pure and Applied Mathematics, 1995). These classes include the most of regression models used in accelerated life testing and survival analysis. Methods of estimation for the generalized additive and multiplicative semiparametric regression models were proposed in this work.Here we develop methods of the above mentioned publication. Application of stepstresses in accelerated life testing is thoroughly investigated, methods of estimation and asymptotic properties of estimators are done. Goodness-of-fit tests for heredity and generalized Sedyakin's hypotheses are proposed, estimation from accelerated experiments when the process of production is unstable is considered. Asymptotic properties of estimators in the generalized additive and multiplicative semiparametric regression models are done. Tests for equality of distributions of multicomponent systems are considered. In accelerated life testing data are obtained from several groups of items tested under different stresses. In survival analysis covariates are often different for various individuals. Methods of estimation and asymptotic analysis of properties of estimators are done for such data. Estimation from multivariate regression survival data is also considered.", "num_citations": "20\n", "authors": ["1037"]}
{"title": "Asymptotical analysis of semiparametric models in survival analysis and accelerated life testing\n", "abstract": " Classes of semiparametric models, generalizing the proportional and additive hazards, proportional odds and other models are considered. Asymptotical properties of estimators of regression parameters and baseline survival function arc investigated in the case of one of considered classes.", "num_citations": "20\n", "authors": ["1037"]}
{"title": "Semiparametric analysis of degradation and failure time data with covariates\n", "abstract": " The paper considers the semiparametric analysis of several new degradation and failure time regression models without and with time depending covariates. These joint models for survival and longitudinal data measured with errors can be applied in studies of longevity, aging and degradation in survival analysis, biostatistics, epidemiology, demography, oncology, biology and reliability.", "num_citations": "19\n", "authors": ["1037"]}
{"title": "Flexible regression models for carcinogenesis studies\n", "abstract": " Dynamic or flexible regression models are used more and more often in carcinogenesis studies to relate lifetime distribution to time-depending explanatory variables. In addition to the classical regression models, such as the Cox model, AFT model, Linear transformation model, Frailty model, etc., we expose so-called flexible regression models, which are well adapted to study cross-effects of survival functions. Such effects are sometimes observed in clinical trials. Classical examples are well-known data concerning effects of chemotherapy (CH) and chemotherapy plus radiotherapy (CH + R) on survival times of gastric cancers patients. In this paper, we give examples which illustrate possible applications of the Hsieh model (2001) and the SCE model proposed by Bagdonavicius and Nikulin and adapted to treat survival data with one crossing point. We compare both models. Biblipgraphy: 40 titles.", "num_citations": "17\n", "authors": ["1037"]}
{"title": "A variant of the generalized omega-square statistic\n", "abstract": " It is proved that one can construct a “spaced” variant of the omega-square statistic, making use only of order statistics, whose limit distribution will be chi-square with the number of degrees of freedom, depending on the number of selected order statistics.", "num_citations": "17\n", "authors": ["1037"]}
{"title": "On goodness‐of‐fit for homogeneity and proportional hazards\n", "abstract": " The classical goodness‐of‐fit tests for homogeneity and proportional hazards have small power in the case of alternatives when crossings of survival functions are possible. We give test statistics which are oriented against wide classes of alternatives including single or multiple crossings of survival functions. The limit distributions of the test statistics are derived. Power of some tests are investigated by simulation. Copyright © 2006 John Wiley & Sons, Ltd.", "num_citations": "16\n", "authors": ["1037"]}
{"title": "Early detection of epidemics as a sequential change-point problem\n", "abstract": " Recent results on APO rules for change-point detection are extended to discrete-time stochastic processes with nuisance pre-change and post-change parameters. Direct expressions for the APO rules under suitable risk functions are derived. Results are applied to the 1996–2004 influenza mortality data published by Centers for Disease Control and Prevention.", "num_citations": "16\n", "authors": ["1037"]}
{"title": "Unbiased estimation for a multivariate exponential whose components have a common shift\n", "abstract": " It is shown that for independent and identically distributed random vectors, for which the components are independent and exponentially distributed with a common shift, we can construct unbiased estimators of their density, derived from the Uniform Minimum Variance Unbiased Estimator (UMVUE) of their distribution function. As direct applications of the UMVUEs of the density functions we present a Chi-square goodness of fit test of the model, and give two tables of the UMVUEs of some commonly used functions of the unknown parameters of the multivariate exponential model considered in this paper.", "num_citations": "16\n", "authors": ["1037"]}
{"title": "Stochastic models of accelerated life\n", "abstract": " A general approach to the accelerated life model construction is proposed. The models, when a stress is constant, stepwise and more general, are described. The region of their applications is discussed. The estimators of unknown regression parameters, generalising the estimators of the model of Cox are proposed. Goodness-of-fit test for Sediakin's model is described.", "num_citations": "16\n", "authors": ["1037"]}
{"title": "On the linear degradation model with multiple failure modes\n", "abstract": " The purpose of this work is to develop statistical methods for using degradation measure to estimate a survival function for a linear degradation model. In this paper, we review existing methods and then describe a parametric approach. We focus on estimating the survival function. A simulation study is conducted to evaluate the performance of the estimating method and the method is illustrated using real data.", "num_citations": "15\n", "authors": ["1037"]}
{"title": "Modeling statistic distributions for nonparametric goodness-of-fit criteria for testing complex hypotheses with respect to the inverse Gaussian law\n", "abstract": " We give percentage point tables and statistic distribution models for non-parametric goodness-of-fit criteria for testing complex hypothesis with respect to the inverse Gaussian law in case of using maximal likelihood estimates.", "num_citations": "15\n", "authors": ["1037"]}
{"title": "Non-parametric estimation in degradation-renewal-failure models\n", "abstract": " Classical reliability theory and survival analysis parts give methods for analysis of failure time data.", "num_citations": "15\n", "authors": ["1037"]}
{"title": "Mathematical models in the theory of accelerated experiments\n", "abstract": " Mathematical models in the theory of accelerated experiments Page 284 Mathematics and the 21st Century 271 Eds. AA Ashour and A.-SF Obada © 2001 World Scientiﬁc Publishing Co.(pp. 27l—303) MATHEMATICAL MODELS IN THE THEORY OF ACCELERATED EXPERIMENTS V. BAGDONAVICIUS and M. NIKULIN Department of Statistics, Vilnius Universty, Vilnius, Lituhania Statistique Mathématique, Université Victor Segalen Bordeaux 2, Bordeaux, France EB’ Steklov Mathematical Institute, Saint Petersbourg, Russia AMS subject classiﬁcations: 62 F10, 62 J05, 62 G05, 62 N05 Keywords: Arrhenius model, accelerated life models, additive accumulation of damages model, changing shape and scale model, Cox model, covariable, cr0ss-effects of hazard rates, Eyring model, exponential distribution, frailty model, gamma frailty model, generalized probit model, generalized proportional hazards model, …", "num_citations": "15\n", "authors": ["1037"]}
{"title": "Characterizations and semiparametric regression estimation in Archimedean copulas\n", "abstract": " Characterizations and semiparametric regression estimation in Archimedean copulas — Saint Petersburg State University Skip to main navigation Skip to search Skip to main content Saint Petersburg State University Logo Help & FAQ русский English Home Profiles Research Units Projects Equipment Research Output Datasets Prizes Activities Impacts Characterizations and semiparametric regression estimation in Archimedean copulas V. Bagdonavicius, Сергей Васильевич Малов, MS Nikulin Лаборатория \"Центр геномной биоинформатики им.ФГДобржанского\" Research output Overview Original language English Pages (from-to) 137-154 Journal Journal of Applied Statistical Science Volume 8 Issue number 2/3 Publication status Published - 1999 Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Bagdonavicius, V., Малов, СВ, & Nikulin, MS (1999). Characterizations and semiparametric …", "num_citations": "15\n", "authors": ["1037"]}
{"title": "Accelerated life testing when a process of production is unstable\n", "abstract": " The developement of the heredity principle in reliability is discussed. The possible invariants in the generalized additive and multiplicative models were proposed. Estimation of these invariants with application in accelerated life testing is considered. A test for the heredity hypothesis is proposed.", "num_citations": "15\n", "authors": ["1037"]}
{"title": "A chi-square goodness-of-fit test for exponential distributions of the first order\n", "abstract": " Being the most often used the classical Pearson chi-square test is a convenient test if a broad class of alternatives is of interest. This 12-test is easily computed and has approximately the", "num_citations": "15\n", "authors": ["1037"]}
{"title": "The Cox model and its applications\n", "abstract": " Since Sir David Cox’s pioneering work in 1972, the proportional hazards (PH) model has become the most important model in survival analysis and in related applications. The success of the Cox model stimulated further studies in semiparametric and nonparametric theory, counting process models, study designs in epidemiology, and the development of many other regression models which could be more flexible or reasonable in data analysis. Flexible semiparametric regression models are used increasingly often in carcinogenesis studies to relate lifetime distributions to time-dependent explanatory variables. In addition to classical regression models such as the Cox PH model and the accelerated failure time (AFT) model, alternative models like the linear transformation model, the frailty model, and some varying-effect models are also considered by researchers (Martinussen and Scheike 2006; Scheike 2006 …", "num_citations": "14\n", "authors": ["1037"]}
{"title": "Chi-squared goodness of fit test for Doubly censored data with applications in survival analysis and reliability\n", "abstract": " We consider the problem of testing the goodness of fit of a parametric family F(·; θ) of the survival distributions from some doubly censored data. We investigate Pearson-type chi-squared statistics which compare the Tsai and Growly (1985) estimator F                 n(t) to the parametric MLE F(t),θ                 n).", "num_citations": "13\n", "authors": ["1037"]}
{"title": "On a subset sum algorithm and its probabilistic and other applications\n", "abstract": " An algorithm for constructing partitions of an integer by arbitrary positive integers has been considered. The algorithm helps in introducing a class of discrete probability distributions which are useful in a sampling survey of populations, in constructing probability models describing texture images, etc. It can also be used in integer programming, cryptography, and some other problems.", "num_citations": "13\n", "authors": ["1037"]}
{"title": "Statistical analysis of redundant systems with ‘warm’stand-by units\n", "abstract": " Mathematical formulation of fluent switching from ‘warm’ to ‘hot’ conditions of standby units is given using the well known Sedyakin's and accelerated failure time models. Non-parametric estimators of cumulative distribution function and mean failure time of a redundant system with several stand-by units are proposed. Goodness-of-fit tests for two given models are given.", "num_citations": "12\n", "authors": ["1037"]}
{"title": "On chi-squared type tests and their applications in survival analysis and reliability\n", "abstract": " The famous chi-square test of Pearson is well known, but different modifications of this test are not so well known. The theory of the chi-squared tests is developed very actively till now, especially in accelerated trials. We shall discuss here some applications of the theory of chi-squared tests in reliability and survival analysis for parametric regression models with time depending covariates when data are right censored.", "num_citations": "11\n", "authors": ["1037"]}
{"title": "A chi-squared test for power generalized Weibull family for the head-and-neck cancer censored data\n", "abstract": " We propose a chi-squared-type statistic to test the validity of the Power Generalized Weibull family based on Head-and-Neck cancer censored data.", "num_citations": "11\n", "authors": ["1037"]}
{"title": "Statistical modeling in survival analysis and its influence on the duration analysis\n", "abstract": " Publisher SummarySurvival-regression models relate lifetime distribution to the explanatory variables (covariates) and are used for the estimation of the effect of covariates on survival and for estimation of survival under given covariate values. Survival-regression models may also be used for the analysis of failure-time-regression data in reliability, applied in econometrics, demography, and any other field, where the effect of explanatory variables on the time up to occurrence of some event is observed. The distribution of survival under covariates can be defined by the survival, cumulative distribution, or probability-density function. Nevertheless, the sense of models is best seen if they are formulated in terms of the hazard-rate function. The most popular and most applied model is the proportional hazards model introduced by Cox. Usually, the proportional hazards model is considered semi-parametric, in which the …", "num_citations": "11\n", "authors": ["1037"]}
{"title": "Non-parametric estimation from simultaneous degradation and failure time data\n", "abstract": " The paper considers degradation and failure time models with multiple failure modes. Dependence of traumatic failure intensities on the degradation level are included into the models. Non-parametric estimators of various reliability characteristics are proposed. Theorems on simultaneous asymptotic distribution of random functions characterizing degradation and intensities of traumatic events are proposed. To cite this article: V. Bagdonavičius et al., C. R. Acad. Sci. Paris, Ser. I 335 (2002) 183–188.", "num_citations": "11\n", "authors": ["1037"]}
{"title": "Nonparametric goodness-of-fit tests for censored data\n", "abstract": " The problem of testing goodness-of-fit hypothesis for right censored data was widely discussed in the literature. The modifications of well known tests such as Kolmogorov, Cramer-von Mises-Smirnov and Anderson-Darling tests were constructed. These modifications are based on the difference between nonparametric Kaplan-Meier estimate and hypothetical survival function. In this paper we investigate statistical properties of these modified tests. Also we consider the classical goodness-of-fit tests based on using the transformation of censored data to” complete” sample by means of randomization. Another approach bases on modification of the standard chi-square statistic of Pearson. In this paper we consider the modified Nikulin-Rao-Robson chi-square statistic for right censored data. By means of computer simulation methods we investigate statistic distributions and the power of these tests in case of close competing hypotheses.", "num_citations": "10\n", "authors": ["1037"]}
{"title": "On semiparametric estimation of reliability from accelerated life data\n", "abstract": " Additive accumulation of damages model and its generalizations are considered. Semiparametric estimation procedure of the survival function under the normal stress from accelerated life testing data is proposed. Experiments with step-stresses with random switch up moments are considered. Asymptotic properties of estimation are investigated.", "num_citations": "10\n", "authors": ["1037"]}
{"title": "On power series, Bell polynomials, Hardy-Ramanujan-Rademacher problem and its statistical applications\n", "abstract": " The integer u might be a number of authors who published their researches during a given period of time in scientific journals, then x\\is the number of authors who published one paper, x-2 is that for authors who published two papers, etc. Many important examples of applications of Diophant's equations in algebra, group theory, analysis, etc. may be found in references cited below.", "num_citations": "10\n", "authors": ["1037"]}
{"title": "Application of tests of chi-square type\n", "abstract": " Some recent results on the theory of chi-square tests are given. Remarks of practical character on the use of these tests are made, reflecting on a large number of applied papers.", "num_citations": "10\n", "authors": ["1037"]}
{"title": "Application of Sedyakin’s model and Birnbaum-Saunders family for statistical analysis of redundant systems with one warm stand-by unit\n", "abstract": " The purpose of this paper is to determine the improve system reliability by introducing the redundancy of components. This paper considers one warm stand-by unit with one main unit. We study the reliability of such systems using probability models in terms of Sedyakin’s model. A parametric family of Birnbaum-Saunders distributions is considered as the distribution of failure times both of main and stand-by units. Parametric point and interval estimation is obtained from censored data. Bibliography: 17 titles.", "num_citations": "9\n", "authors": ["1037"]}
{"title": "Accelerated degradation model and its applications to statistical analysis of the role played by dementia and sex in the loss of functional autonomy in elderly patients.\n", "abstract": " The paper considers the statistical analysis of aging and degradation processes in the elderly. The role played by dementia and sex in the loss of functional autonomy in elderly patients, in terms of progression and recovery, through several stages of increasing disability is analysed. The conjoint accelerated degradation model for statistical analysis of survival and degradation data is discussed.", "num_citations": "9\n", "authors": ["1037"]}
{"title": "Statistical analysis of survival and reliability data with multiple crossings of survival functions\n", "abstract": " We present a statistical model and semiparametric estimation procedure for analysis of survival data with multiple cross-effects (MCE) of survival functions. A goodness-of-fit test for the proportional hazards model against the MCE model is proposed. To cite this article: V. Bagdonavičius, M. Nikulin, C. R. Acad. Sci. Paris, Ser. I 340 (2005).", "num_citations": "9\n", "authors": ["1037"]}
{"title": "Analysis of generalized additive semiparametric models\n", "abstract": " Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS", "num_citations": "9\n", "authors": ["1037"]}
{"title": "On the computation of chi-square-type statistics\n", "abstract": " L.(o)= Hf (xi, o)(2) i= 1 the likelihood function of the sample X=(X1,..., Z,) T. For the family {f (x, 8)) we assume that for sufficiently large n (n~ cx~) the LeCam conditions of the local asymptotic normality (LAN) and of the asymptotic differentiability of the likelihood function Ln (8) in point 0 are satisfied (see, for example,[16,", "num_citations": "9\n", "authors": ["1037"]}
{"title": "On evaluation of statistics of chi-square type tests\n", "abstract": " KO Dzhaparidze, MS Nikulin, “On evaluation of statistics of chi-square type tests”, Problems of the theory of probability distributions. Part 12, Zap. Nauchn. Sem. LOMI, 194, Nauka, St. Petersburg, 1992, 59–78; J. Math. Sci., 75:5 (1995), 1910–1921 Zapiski Nauchnykh Seminarov LOMI RUS ENG JOURNALS PEOPLE ORGANISATIONS CONFERENCES SEMINARS VIDEO LIBRARY PACKAGE AMSBIB General information Latest issue Archive Impact factor Search papers Search references RSS Latest issue Current issues Archive issues What is RSS Zap. Nauchn. Sem. POMI: Year: Volume: Issue: Page: Find Your organisation: Google Personal entry: Login: Password: Save password Enter Forgotten password? Register Powered by MathJax Zap. Nauchn. Sem. LOMI, 1992, Volume 194, Pages 59–78 (Mi znsl5006) This article is cited in 1 scientific paper (total in 1 paper) On evaluation of statistics of chi-square type …", "num_citations": "9\n", "authors": ["1037"]}
{"title": "The probability distributions of the Kolmogorov and ω^2 statistics for continuous distributions with shift and location parameters\n", "abstract": " The paper deals with applications of the statistical tests for testing complete hypothesis  according to which the independent identically continuously distributed random variables  have .", "num_citations": "9\n", "authors": ["1037"]}
{"title": "Modelling and testing of presence of hazard rates crossing under censoring\n", "abstract": " A new flexible and simple semiparametric model, including the cases when hazard rates cross, go away, are proportional, approach, or converge is proposed. Semiparametric estimation procedures are given. Tests for absence of hazard rates crossing and homogeneity are proposed.", "num_citations": "8\n", "authors": ["1037"]}
{"title": "Reliability estimation from failure-degradation data with covariates\n", "abstract": " Models and estimation methods for failure process parameters and various reliability characteristics using censored multi-mode failure time-degradation data with covariates. Degradation data is supposed to be measured at discrete times. Modified likelihood function which uses predictors of degradation process is defined. Examples of predictors when degradation process is modelled by various stochastic processes are given.", "num_citations": "8\n", "authors": ["1037"]}
{"title": "Testing absence of hazard rates crossing\n", "abstract": " A new flexible and simple semiparametric model, including the cases when hazard rates cross, go away, are proportional, approach or converge, is proposed. Semiparametric estimation procedures are given. A test for absence of hazard rates crossing is proposed. To cite this article: V. Bagdonavičius et al., C. R. Acad. Sci. Paris, Ser. I 347 (2009).", "num_citations": "8\n", "authors": ["1037"]}
{"title": "Statistical Analysis of a Redundant System with One Stand‐by Unit\n", "abstract": " This chapter contains sections titled:   Introduction   The models   The tests   Limit distribution of the test statistics   Bibliography", "num_citations": "8\n", "authors": ["1037"]}
{"title": "Statistical analysis of the generalized linear proportional hazards model\n", "abstract": " We analyze finite sample properties of modified partial likelihood estimators of parameters for the generalized proportional hazards model by simulation. A goodness-of-fit test for the proportional hazards model against the GPH model is proposed. Lung cancer data are analyzed. Bibliography: 7 titles.", "num_citations": "8\n", "authors": ["1037"]}
{"title": "Multivariate discrete distributions induced by an urn scheme, linear diophantine equations, unbiased estimating, testing and applications\n", "abstract": " A class of multivariate discrete distributions induced by an urn containing balls marked by vectors with arbitrary integer components is considered. An algorithm for probabilities and their unbiased estimators evaluating based on a solution of a system of linear diophantine equations in nonnegative integers is proposed. Unbiased estimators for probabilities and for variances of these estimators have been constructed. A chi-square goodness-of-fit test for the model is proposed. Applications of the model for describing radioactively contaminated lands are briefly discussed.", "num_citations": "8\n", "authors": ["1037"]}
{"title": "Modèle statistique de dégradation avec des covariables dépendant du temps\n", "abstract": " On étudie la dégradation quand elle est modélisée par un processus gamma dans lequel le temps est accéléré en fonction de covariables. Un processus de pannes lui-même dépendant de la dégradation joue un rôle de censure. On étudie successivement les modèles paramétrique et non paramétrique.", "num_citations": "8\n", "authors": ["1037"]}
{"title": "Sur l’application des stress en escalier dans les expériences accélérées\n", "abstract": " On considère dans cette Note le modèle de vie accélérée de fonction de base inconnue. On propose ensuite des estimateurs de la fonction de fiabilité correspondant aux conditions normales de fonctionnement, quand des stress en escalier sont utilisés pour les épreuves accélérées. Enfin, on étudie les propriétés asymptotiques des estimateurs.", "num_citations": "8\n", "authors": ["1037"]}
{"title": "Flexible regression models for dynamic prediction of survival in elderly in presence of cancer or other chronic diseases.\n", "abstract": " We consider degradation and failure time models with multiple failure modes adapted for the statistical analysis of survival in the elderly in presence of chronic diseases such as cancer, but also other conditions like dementia, Alzheimer, diabetes, etc... These models can be applied in gerontology, general medicine, biology and demography for the analysis of longevity and survival of highly complex biological systems as any human is.", "num_citations": "7\n", "authors": ["1037"]}
{"title": "Extended Cox and accelerated models in reliability, with general censoring and truncation\n", "abstract": " We review recent developments in reliability or survival analysis. We consider various models for the time to failure or survival time, by a law on IR                 + that may depend on one or more factors. Inhomogeneity is taken into account by way of frailty models. The presence of censoring and truncation of a general type, more complex than the usual simple case of right censoring, induced the most recent developments on these topics. In the case of clusters of items or families of patients implying a possible dependence between multiple failure times, shared frailty models or hierarchical dependency models are considered.", "num_citations": "7\n", "authors": ["1037"]}
{"title": "Acceleratd life testing when the hazard rate function has cup shape\n", "abstract": " This chapter contains sections titled:   Introduction   Estimation in the AFT‐GW model   Properties of estimators: simulation results for the AFT‐GW model   Some remarks on the second plan of experiments   Conclusion   Appendix   Bibliography", "num_citations": "7\n", "authors": ["1037"]}
{"title": "Some recent results on accelerated failure time models with time-varying stresses\n", "abstract": " The aim of this paper is to present some recent results on modelling in accelerated life testing with time-varying stresses, or according to the terminology of Singpurwalla [41], with dynamic environments. We consider also the class of degradation threshold-shock-models in which failure is due to the competing causes of degradation and traumatic event occurrence.", "num_citations": "7\n", "authors": ["1037"]}
{"title": "Non-parametric estimation from simultaneous renewal–failure–degradation data with competing risks\n", "abstract": " A joint model for linear degradation and competing failure data with partial renewals is proposed. Non-parametric estimation procedures for failure intensities and failure probabilities as functions of degradation level are given. Asymptotic properties of the estimators are investigated. To cite this article: V. Bagdonavičius et al., C. R. Acad. Sci. Paris, Ser. I 342 (2006).", "num_citations": "7\n", "authors": ["1037"]}
{"title": "Démence et perte d'autonomie fonctionnelle du sujet âgé\n", "abstract": " Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS", "num_citations": "7\n", "authors": ["1037"]}
{"title": "Testing problem for increasing function in a model with infinite dimensional nuisance parameter\n", "abstract": " We consider the next statistical problem arising, for example, in accelerated life testing. Let Xl be a random variable with density function f (t), Ψ (t) be an increasing absolutely continuous function, Φ(t)=Φ−1(t) be its inverse function, random variable X                 2 be defined as X                 2= Φ(X                 1). In order to test whether function Ψ(t) belongs to a given parametric family when function f is completely unknown, we take two independent nonparametric estimators of density function f and  of density function g of X2 and compare the function  with the function  for a minimum distance estimator . But at the begining we have to investigate the asymptotic behavior of the estimator . We consider a parametric minimum distance estimator for ill, when we observe (with a mechanism of independent censoring) two independent samples from the distributions of X1and X2 respectively.", "num_citations": "7\n", "authors": ["1037"]}
{"title": "A probabilistic description of radioactive contamination\n", "abstract": " A discrete probability model is used to aid in the description of gamma-ray spectroscopic data obtained from a radioactively contaminated territory. The approach gives a natural probability for distinguishing contaminated regions and is useful for describing spatial vector valued discrete random fields. Using the simplest variant of this model, a part of the territory adjoining the former Semipalatinsk's nuclear test site in Kazakhstan has been investigated. Probabilities of exceeding the safety limits for 137Cs and integral gamma-radiation have been estimated.", "num_citations": "7\n", "authors": ["1037"]}
{"title": "Analyse statistique du modele de Makeham\n", "abstract": " Archive ouverte HAL - Analyse statistique du modèle de Makeham Accéder directement au contenu Accéder directement à la navigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data Documentation Episciences.org Episciences.org Revues Documentation Sciencesconf.org Support hal Accueil Dépôt Consultation Les derniers dépôts Par type de publication Par discipline Par année de publication Par structure de recherche Les portails de l'archive Recherche Documentation hal-01355528, version 1 Article dans une revue Analyse statistique du modèle de Makeham Léo Gerville-Réache 1 Mikhail Nikulin 1 Détails 1 IMB - Institut de Mathématiques de Bordeaux Type de document : Article dans une revue Domaine : Mathématiques [math] / Statistiques [math.ST] Liste complète des métadonnées Voir https://hal.archives-ouvertes.fr/hal-01355528 Contributeur : Léo …", "num_citations": "7\n", "authors": ["1037"]}
{"title": "Statistical analysis of the generalized additive semiparametric survival model with random covariate\n", "abstract": " Generalizations of the additive hazards model are considered. Estimates of the regression parameters and baseline function are proposed, when covariates are random. The asymptotic properties of estimators are considered.", "num_citations": "7\n", "authors": ["1037"]}
{"title": "Goodness-of-fit test for the family of logistic distributions\n", "abstract": " Chi-squared goodness-of-fit test for the family of logistic distributions id proposed. Different methods of estimation of the unknown parameters θ of the family are compared. The problem of homogeneity is considered.", "num_citations": "7\n", "authors": ["1037"]}
{"title": "Unbiased estimators of multivariate discrete distributions and chi-square goodness-of-fit test\n", "abstract": " We consider the problem of estimation of the value of a real-valued function u(θ), θ = (θ1, ..., θk)T, on the basis of a sample from non-truncated or truncated multivariate Modified Power Series Distributions. Using the general theory of estimation and the results of Patil (1965) and Patel (1978) we give the tables of MVUE's for functions of parameter θ of trinomial, multinomial, negative-multinomial and left-truncated modified power series distributions. We have applied the properties of MVUE's and the results from the theory of MVU estimation to construct a goodness-of-fit chi-squared test for multivariate modified power series distributions.", "num_citations": "7\n", "authors": ["1037"]}
{"title": "Application of the model of two-factor analysis of variance without interactions\n", "abstract": " Within the framework of the linear Gauss-Markov regression model, which in the case under consideration reduces to the two-factor model of the analysis of variance without interactions, one solves the problem of the comparison of experts' estimates and also that of the comparison of the actions of the experts themselves.", "num_citations": "7\n", "authors": ["1037"]}
{"title": "Hypothesis testing for a parameter difference in binomial distributions\n", "abstract": " P {, m}= Cp’(1-pi)\"’-’, m E {0, 1,. hi}, 1, 2,..., k, where the probabilities pl, Pk are unknown (0< Pi< 1, 1,, k). We assume that the random variable tZk is a\" control\", and our goal is the testing of the hypothesis that all of the probabilities Pl,\", Pk-1, or some of them, are equal to Pk. This problem will be solved under the assumption that min (nl,’\", nk)--.", "num_citations": "7\n", "authors": ["1037"]}
{"title": "A solution to a problem on homogeneity(chi-square tests)\n", "abstract": " Consideration of the problem of testing the homogeneity of several independent samples whose elements are independent and identically continuously distributed, while the corresponding distribution functions belong to the same given parametric family. The homogeneity hypothesis consists in the statement that the same distribution function corresponds to all samples; the parameter values corresponding to this function are unknown. A criterion is constructed which, under unlimited growth of sample size, has a distribution converging to the chi-square distribution. The properties of this criterion are studied for solving problems of two samples on the assumption that the parametric family of distributions depends only on displacement and scale parameters.", "num_citations": "7\n", "authors": ["1037"]}
{"title": "On Chi‐Squared Goodness‐of‐Fit Test for Normality\n", "abstract": " This chapter considers the chi‐squared goodness‐of‐fit test based on the chi‐square statistic Y2n of Nikulin‐Rao‐Robson (NRR). For testing normality, the optimal choice of boundaries cells is considered. To construct a goodness‐of‐fit NRR test based on the statistic Y2n against composite hypothesis, one can use two Neyman–Pearson grouping classes I1, I2 so that the distribution limiting of Y2n belongs to chi‐squared distribution with one degree of freedom as n to ∞. The chapter analyzes the power of the NRR's test based on the statistic Y2n and compare it with the powers of the Shapiro–Wilk test based on the statistics W and the Shapiro–Francia test based on the statistic W′ in the cases of complete samples for the normal null hypothesis. To construct NRR's statistic, the authors use two grouping interval methods two Neyman– Pearson classes (2NPG) and equiprobable (EQPG) grouping cells.", "num_citations": "6\n", "authors": ["1037"]}
{"title": "Exact goodness-of-fit tests for shape-scale families and type II censoring\n", "abstract": " A survey of statistical methods for validation of shape-scale families of probability distributions from type II censored samples is given. We propose “integrated likelihood ratio tests” which are modifications of Zhang’s tests from complete to type II censored data. We also give modifications of Cramér–von-Mises and Anderson–Darling tests using integration with respect to non-parametric estimators of the cumulative distribution function. Explicit formulas for modified chi-squared tests from censored data with data driven choice of partitioning are given. Powers of tests against most used alternatives to the Weibull, loglogistic and lognormal distribution are compared.", "num_citations": "6\n", "authors": ["1037"]}
{"title": "Semiparametric regression estimation in copula models\n", "abstract": " We consider some methods of semiparametric regression estimation in multivariate models when the common distribution function is represented using a copula and the marginals satisfy a generalized regression model using a transfer functional. Sufficient conditions for consistency and joint asymptotic normality of the finite-dimensional parameters are obtained.", "num_citations": "6\n", "authors": ["1037"]}
{"title": "The power-generalized Webull probability distribution and its use in survival analysis\n", "abstract": " Modified chi-squared tests for the Power-Generalized Weibull Probability Distribution based on moment type estimates are introduced. Power of those tests is investigated.", "num_citations": "6\n", "authors": ["1037"]}
{"title": "Chi‐Squared Tests—II\n", "abstract": " Chi‐squared goodness‐of‐fit tests for parametric families of distributions are discussed. Different methods of unknown parameters estimating are compared and some modifications of the Pearson statistic depending on methods of estimation are discussed.", "num_citations": "6\n", "authors": ["1037"]}
{"title": "Bolshev's method of confidence limit construction\n", "abstract": " Confidence intervals and regions for the parameters of a distribution are constructed, following the method due to LN Bolshev. This construction method is illustrated with Poisson, exponential, Bernouilli, geometric, normal and other distributions depending on parameters.", "num_citations": "6\n", "authors": ["1037"]}
{"title": "On the problem of the means of weighted normal populations\n", "abstract": " An analitical problem, which arises in the statistical problem of comparing the means of two normal distributions, the variances of which as their ratio are unknown, is well-known in the mathematical statistics as the Behrens-Fisher problem. One generalization ofthe Behrens-Fisherproblem and different aspects concerning the estimation of the common mean of several independent normal distributions with different variances are considered and one solution is proposed.", "num_citations": "6\n", "authors": ["1037"]}
{"title": "On a quantile test\n", "abstract": " 1. In this note we study the construction of a certainmodification of the statistics of a quantile test which was proposed by LN Bol’shev [1]. From the results of LN Bol’shev [1] and DM Chibisov [2] it follows that the statistic of the quantile test Z2 has a well-studiedlimit distribution if the unknown parameter is estimated by the minimum chi-square method. If,", "num_citations": "6\n", "authors": ["1037"]}
{"title": "Comparison of hypertabastic survival model with other unimodal hazard rate functions using a goodness‐of‐fit test\n", "abstract": " We studied the problem of testing a hypothesized distribution in survival regression models when the data is right censored and survival times are influenced by covariates. A modified chi‐squared type test, known as Nikulin‐Rao‐Robson statistic, is applied for the comparison of accelerated failure time models. This statistic is used to test the goodness‐of‐fit for hypertabastic survival model and four other unimodal hazard rate functions. The results of simulation study showed that the hypertabastic distribution can be used as an alternative to log‐logistic and log‐normal distribution. In statistical modeling, because of its flexible shape of hazard functions, this distribution can also be used as a competitor of Birnbaum‐Saunders and inverse Gaussian distributions. The results for the real data application are shown. Copyright © 2017 John Wiley & Sons, Ltd.", "num_citations": "5\n", "authors": ["1037"]}
{"title": "On chi-squared testing in accelerated trials\n", "abstract": " The theory of the Chi-squared tests has been developed very actively till now, especially in accelerated trials. We discuss here some applications of this theory in the analysis of parametric accelerated life models (ALM) with time depending covariates when data are right censored.", "num_citations": "5\n", "authors": ["1037"]}
{"title": "Goodness-of-fit test for homogeneous Markov processes\n", "abstract": " We give chi-squared goodness-of-fit tests for homogeneous Markov processes with unknown transition intensities or with transition intensities of known form depending on a finite-dimensional parameter.", "num_citations": "5\n", "authors": ["1037"]}
{"title": "Chi-squared goodness of fit test for generalized Birnbaum-Saunders models for right censored data and its reliability applications\n", "abstract": " Generalized Birnbaum-Saunders (GBS) distributions are proposed by Díaz-García et al. ([15], [16]) based on the family of elliptically contoured univariate distributions. This model is well-known as the highly flexible lifetime model by the difference in the degrees of kurtosis and asymmetry and processes uni-modality and bimodality. In this paper, a modifier Chi-squared goodness-of-fit test based on Nikulin-Rao-Robson statistics 􀢅􀯡 􀬶 is developed for the family of GBS distributions for the right censored data with unknown parameters by using the maximum likelihood estimation (MLE). Some applications of this model in survival analysis discuss also in the section of real study.", "num_citations": "5\n", "authors": ["1037"]}
{"title": "On reliability approach and statistical inference in demography\n", "abstract": " In demography, Gompertz and Makeham models have significant role in modeling and in analysis of mortality and ageing. Till the end of the 20th century, researchers have used the tables of mortalities (also called life tables) for demographic analysis but in the end of the 20th century due to the development in statistical methods of survival analysis and reliability one can treat the individuals data even with the information of censoring. The Gompertz, Makeham, and Weibull models are compared with respect to the goodness-of-fit to the table of mortality and to the individuals data in the presence of censoring. For data from the table of mortality, the test statistic considered by Gerville-Reache and Nikulin (2000) is used. For censored individual data the chi-squared type test proposed by Bagdonavicius et al.(2010) is used.", "num_citations": "5\n", "authors": ["1037"]}
{"title": "Accelerated life models\n", "abstract": " Statistical models describing dependence of the lifetime distribution on the explanatory variables are considered. Such models are used in reliability and survival analysis to study the reliability of complex systems.", "num_citations": "5\n", "authors": ["1037"]}
{"title": "Step stress accelerated life testing: classical methods\n", "abstract": " We consider here the accelerated models describing dependence of the lifetime distribution on the step stresses. Such models are often used in reliability and survival analysis to study the reliability of highly reliable complex technical and bio-technical systems in dynamic environments. KeywordsAccelerated trials, AFT model, Arrhenius Model, Cox model, Models with finite supports, GPH model, Log-linear model, Power rule model, Resource, Step-stress, Weibull family 1. Introduction in Accelerated Life testing The failure time data are used for product reliability estimation. Failures of highly reliable units are rare and other information should be used than traditional censored failure time data. One way of obtaining this complementary reliability information is to apply the methods of the so-called accelerated life-testing (ALT) for improvements in reliability life testing, to obtain wished reliability results for the products more quickly then under normal operating conditions, given in terms of step-stresses. Step-stress ALT gives an interesting approach to study the possibility to take into account the cumulative effect of the applied stresses on aging, fatigue and degradation of testing items, systems, etc... The idea to use the step-stresses in ALT was proposed at first by Miner [17], Pieruschka [25], Sedyakin [26], Singpurwalla [30]. Later this idea was actively developed in publications of many statisticians, see, for example,[18],[28],[14],[27],[21-23],[32],[29],[31],[19],[1-12],[24], etc..., where one can find a list of references on applications and estimation in ALT. In ALT any accelerated life model is defined on a set E={x (·)} of all possible or admissible stresses for …", "num_citations": "5\n", "authors": ["1037"]}
{"title": "Independent  distributed in the limit components of some chi-squared tests\n", "abstract": " Non-parametric and parametric explicit decompositions of the classical Pearson, Pearson-Fisher, Hsuan-Robson-Mirvaliev and other tests on a sum of asymptotically independent chi-squared random variables with one degree of freedom in case of non-equiprobable cells are discussed. The parametric decompositions can be used for constructing more powerful tests, and can be considered as alternative proofs of limit theorems for some chi-squared type goodness-of-fit statistics.", "num_citations": "5\n", "authors": ["1037"]}
{"title": "On statistical modelling in accelerated life testing\n", "abstract": " Accelerated life models involve as soon as once wants to model lifetime data. In biomedical research, these modelling are grouped under the generic term of survival analysis and study the lifetime under the influence of covariables. In industrial research, these modelling are gathered under the name of reliability and study the lifetime under influence of stresses. The most traditional model is the Accelerated Failure Time model (AFT), see for example, Nelson (1990), Lawless (2003), Meeker and Escobar (1998), Bagdonavicius and Nikulin (2002). After some preliminary definition, we introduce AFT model, Sedyakin model, Power Generalized Weibull model and CHSS model.", "num_citations": "5\n", "authors": ["1037"]}
{"title": "Détection des observations aberrantes par des méthodes statistiques\n", "abstract": " We present here a modem point of view on outliers detection problem, in particular on Chauvenet’s rule applied to the normal model. Based on this rule, Bol’shev proposed a test to detect simultaneously several outliers. From a practical point of view, we created a program of the Bol’shev’s test in Fortran, in order to discover several outliers among the experimental data. As an example, we apply this test to Chauvenet’s data (1863).", "num_citations": "5\n", "authors": ["1037"]}
{"title": "On goodness-of-fit for accelerated life models\n", "abstract": " A goodness-of-fit test for the generalized Sedyakin's model is proposed when accelerated experiments are carried out under step-stresses. Various alternatives, such as the Cox proportional hazards model with time-varying stresses, are considered. The test power against the neighbouring alternatives is studied.", "num_citations": "5\n", "authors": ["1037"]}
{"title": "χ^2-goodness test for one-and multidimensional distributions\n", "abstract": " VG Voinov, MS Nikulin, “$\\chi^2$-goodness test for one- and multidimensional distributions”, Studies in mathematical statistics. Part 9, Zap. Nauchn. Sem. LOMI, 184, \"Nauka\", Leningrad. Otdel., Leningrad, 1990, 62–79; J. Math. Sci., 68:4 (1994), 438–450 Zapiski Nauchnykh Seminarov LOMI RUS ENG JOURNALS PEOPLE ORGANISATIONS CONFERENCES SEMINARS VIDEO LIBRARY PACKAGE AMSBIB General information Latest issue Archive Impact factor Search papers Search references RSS Latest issue Current issues Archive issues What is RSS Zap. Nauchn. Sem. POMI: Year: Volume: Issue: Page: Find Your organisation: Google Personal entry: Login: Password: Save password Enter Forgotten password? Register Powered by MathJax Zap. Nauchn. Sem. LOMI, 1990, Volume 184, Pages 62–79 (Mi znsl4806) $\\chi^2$-goodness test for one- and multidimensional distributions VG Voinov , MS Nikulin Full …", "num_citations": "5\n", "authors": ["1037"]}
{"title": "Distribution of a χ 2 statistic with additional observations used to estimate the unknown parameter\n", "abstract": " An explicit form of the Kambhampati statistic is given, which is a χ2 statistic with additional observations used to estimate the unknown parameter.", "num_citations": "5\n", "authors": ["1037"]}
{"title": "On a quantile test\n", "abstract": " MS Nikulin, “On a Quantile Test”, Teor. Veroyatnost. i Primenen., 19:2 (1974), 431–434; Theory Probab. Appl., 19:2 (1975), 410–413 RUS ENG JOURNALS PEOPLE ORGANISATIONS CONFERENCES SEMINARS VIDEO LIBRARY PACKAGE AMSBIB General information Latest issue Archive Impact factor Subscription Guidelines for authors Submit a manuscript Search papers Search references RSS Latest issue Current issues Archive issues What is RSS Teor. Veroyatnost. i Primenen.: Year: Volume: Issue: Page: Find Your organisation: Google Personal entry: Login: Password: Save password Enter Forgotten password? Register Powered by MathJax Teor. Veroyatnost. i Primenen., 1974, Volume 19, Issue 2, Pages 431–434 (Mi tvp2904) Short Communications On a Quantile Test MS Nikulin Moscow Full text: PDF file (267 kB) English version: Theory of Probability and its Applications, 1975, 19:2, 410–413 …", "num_citations": "5\n", "authors": ["1037"]}
{"title": "The Cox Proportional Hazards Model\n", "abstract": " The            proportional hazards (PH)          or                  Cox model                                 holds on E, if the hazard rate has the form $$\\begin{aligned} \\lambda _{x(\\cdot )}(t) = r\\{x(t)\\} \\;\\lambda _0(t), \\quad x(\\cdot ) \\in E, \\end{aligned}$$where  is an unspecified            baseline hazard rate function         , and  is a positive function on E. The function  explains the summing effect of all  on the distribution of T.", "num_citations": "4\n", "authors": ["1037"]}
{"title": "On the Validity of the Weibull‐Gnedenko Model\n", "abstract": " This chapter surveys the statistical methods for the validation of the two‐parameter Weibull‐Gnedenko distribution from type II censored samples. Likelihood ratio test statistics are used to test hypotheses and test statistics for the hypothesis. Michael used the arcsin transformation to stabilize the variances of the plotted points on the probability graphs associated with the Kolmogorov‐Smirnov test. Bagdonavicius and Nikulin presented the modified chi‐squared tests from arbitrary censored data with data‐driven choice of partitioning. The chapter investigates the power of the proposed tests against the most commonly used alternatives to the Weibull‐Gnedenko distribution such as lognormal distribution, loglogistic distribution and gamma distribution.   Controlled Vocabulary Terms Weibull distribution", "num_citations": "4\n", "authors": ["1037"]}
{"title": "Reliability analysis of redundant systems by simulation for data with unimodal hazard rate functions.\n", "abstract": " In Reliability, the distributions with unimodal or the so-called∩-shape hazard functions are used quiet often. Mostly people use log-normal, log-logistic and inverse Gaussian distributions. In this paper, we consider also an application of the inverse Gaussian, log-normal and log-logistic distribution in the reliability analysis of redundant system with one main unit and (m-1) stand-by units. Asymptotic properties of the point estimators and confidence intervals are studied.", "num_citations": "4\n", "authors": ["1037"]}
{"title": "Parametric estimation of redundant system reliability from censored data\n", "abstract": " Parametric point and interval estimators of the cumulative distribution function of redundant systems with several “warm” stand-by units are proposed. The data are supposed to be right censored. Accuracy of interval estimators obtained from complete data was investigated by simulation.", "num_citations": "4\n", "authors": ["1037"]}
{"title": "About one parametric degradation model used in reliability, survival analysis and quality of life\n", "abstract": " Archive ouverte HAL - About one parametric degradation model used in reliability, survival analysis and quality of life Accéder directement au contenu Accéder directement à la navigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data Documentation Episciences.org Episciences.org Revues Documentation Sciencesconf.org Support hal Accueil Dépôt Consultation Les derniers dépôts Par type de publication Par discipline Par année de publication Par structure de recherche Les portails de l'archive Recherche Documentation hal-00194767, version 1 Chapitre d'ouvrage About one parametric degradation model used in reliability, survival analysis and quality of life Mikhail Nikulin 1 Léo Gerville-Réache 1 Sébastien Orazio 1 Détails 1 IMB - Institut de Mathématiques de Bordeaux Type de document : Chapitre d'ouvrage Domaine : Mathématiques [math] / Statistiques […", "num_citations": "4\n", "authors": ["1037"]}
{"title": "Accelerated life and degradation models in reliability and safety: an engineering perspective\n", "abstract": " We consider here the accelerated models describing dependence of the lifetime distribution on the time-varying explanatory variables. Such models are used in reliability and survival analysis to study the reliability of bio-technical systems in dynamic environments. We shall discuss the problems of statistical modeling and of choice of design in accelerated life testing to obtain the statistical estimators of the main reliability characteristics.1. Introduction in accelerated life testing The failure time data are used for product reliability estimation. Failures of highly reliable units are rare and other information should be used than traditional censored failure time data. One way of obtaining this complementary reliability information is to apply the methods of the so-called accelerated life-testing (ALT). The ALT has been recognized as a necessary activity to ensure the reliability of electronic products used in military, aerospace, automotive and mobil (cellular, laptop computers) applications, from which one can see that accelerated testing of electronic products offers great potential for improvements in reliability life testing, to obtain wished reliability results for the products more quickly then under normal operating conditions, given in terms of covariates (stresses), which could be time-varying. It is interesting to study the possibility to take into account the cumulative effect of the applied stresses on aging, fatigue and degradation of testing items, systems, etc... The problem becomes to model effects of covariates on the hazard rate under operating conditions, see, Lehmann (2004). ALT methods can be either qualitative or quantitative. Qualitative ALT techniques …", "num_citations": "4\n", "authors": ["1037"]}
{"title": "Semiparametric estimation in the generalized additive-multiplicative model\n", "abstract": " The generalization of the additive-multiplicative model of Lin and Ying is considered. Estimators of the regression parameters, the baseline survival function, and the survival function under any stress are proposed. The asymptotic properties of estimators are investigated. Bibliography: 7 titles.", "num_citations": "4\n", "authors": ["1037"]}
{"title": "Estimation of system reliability from accelerated experiments\n", "abstract": " The accelerated life models models for the multivariate failure data are considered. Methods of estimation of system reliability under the normal conditions using results of accelerated experiments are proposed, when models are considered as semiparametric.", "num_citations": "4\n", "authors": ["1037"]}
{"title": "Chi-square goodness-of-fit test for one-and multidimensional discrete distributions\n", "abstract": " The problem of the construction of chi-square type tests for discrete (one- and multidimensional) distributions of exponential type is considered in detail. In particular, as an example, the Stirling distribution of the second kind is investigated a table of the best unbiased estimators of certain functions of the distribution parameters is given.", "num_citations": "4\n", "authors": ["1037"]}
{"title": "Statistical modelling, planning and inference in accelerated trials\n", "abstract": " We consider the problem of statistical modelling and planning in accelerated trials to obtain the statistical inference for the main reliability characteristics of the product.", "num_citations": "3\n", "authors": ["1037"]}
{"title": "Testing of the homogeneity of marginal distributions in copula models\n", "abstract": " A test for the equality of marginal distributions of bi-dimensional distribution functions represented by a parametric copula and completely unknown marginals is proposed. To cite this article: V. Bagdonavičius et al., C. R. Acad. Sci. Paris, Ser. I 346 (2008).", "num_citations": "3\n", "authors": ["1037"]}
{"title": "Estimation in generalized proportional hazards model\n", "abstract": " Generalization of the proportional hazards model taking into account dependence of the rate of resource using on the value of the used resource is considered. Modified partial likelihood approach for parameters estimation is proposed. The asymptotic properties of estimators are investigated.", "num_citations": "3\n", "authors": ["1037"]}
{"title": "Remarques sur le maximum de vraisemblance\n", "abstract": " La méthode du maximum de vraisemblance esta la fois l’une des plus utilisées et des plus controversées en statistique. Elle a en effet un attraita la fois intuitif, parce que la vraisemblance semble bien contenir toute l’information fournie par les observations, et théorique,a cause des bonnes propriétés asymptotiques des estimateurs correspondants sous certaines conditions de régularité. Cependant, cette méthode a plusieurs inconvénients qui ont été mis en évidence en particulier par L. Le Cam [1975] et PJ Huber [1980], mais aussi par d’autre auteurs tels que J. Berkson [1980], RR Bahadur [1958], D. Basu [1980], TS Ferguson [1982], M. Goldstein et JV Howard [1991], S. Dharmadhikari et K. Joag-Dev [1985], VG Voinov et MS Nikulin [1993] par exemple. Comme cette méthode est universellement applicable, on a tendancea l’utiliser parfois sans précautions, ce qui conduita des résultats désastreux. Un des exemples les plus célebres est celui de L. Le Cam qui exhibe un estimateur «du maximum de vraisemblance» qui converge vers deux fois la valeur du parametre qu’il est censé estimer, simplement parce que le nombre des parametres inconnus nuisibles croıta la même vitesse que la taille de l’échantillon [L. Le Cam, 1979]. La vraisemblance elle-même pose des problemes lorsqu’il y a plusieurs versions de la densité de probabilité sur laquelle repose cette vraisemblance. De plus, chaque fois qu’il n’y a pas de propriété de convexité, il est difficile, voire impossible de trouver un maximum global. Même dans ce cas particulierement favorable, le maximum de la vraisemblance peut être, et il l’est souvent, si «plat» que l’estimateur …", "num_citations": "3\n", "authors": ["1037"]}
{"title": "On some statistical and probability problems related to unipartite and multipartite partitions\n", "abstract": " Multivariate discrete distributions have found applications in many scientific fields–biology, sociology, epidemiology, etc.-, as well as in acci-dents analysis, insurance policy, etc. Many of the contagious distributions considered, eg, in biological sciences are members of the class of the multi-variate generalized power series distributions. Several distributions belong to the subclass of generalized binomial, multinomial as well as negative binomial and negative multinomial distributions. Among them, some discrete distribu-tions of order ka s well as the so-called cluster binomial and cluster multinomial distributions considered by Panaretos and Xekalaki (1986) are of interest. In Section 2 we give a brief review of discrete distributions of order k and in Section 3 we consider a generalization of the cluster binomial and negative cluster binomial distributions. The distributions proposed are of interest for sampling survey of populations, texture recognition of images, etc. Some problems related to these distributions arise: probabilities evaluating, parameters estimation, hypotheses test-ing, etc. We consider in detail only the problem of evaluating probabilities.", "num_citations": "3\n", "authors": ["1037"]}
{"title": "A review of the results on the Stein approach for estimators improvement\n", "abstract": " Since 1956, a large number of papers have been devoted to Stein's technique of obtaining improved estimators of parameters, for several statistical models. We give a brief review of these papers, emphasizing those aspects which are interesting from the point of view of the theory of unbiased estimation.", "num_citations": "3\n", "authors": ["1037"]}
{"title": "A Chi-Squared Goodness-of-Fit Test for Modified Power Series Distributions\n", "abstract": " Gupta (1974) have introduced a family of modified power series distributions (MPSD). This family contains the Binomial, Poisson, Negative Binomial, Logarithmic series, Generalized Poisson, Generalized Binomial, Borel-Tanner, Stirling and many probability distributions, including left, right and doubly truncated modification. In this paper we consider a chi-square test whether a random sample has come from a MPSD.", "num_citations": "3\n", "authors": ["1037"]}
{"title": "Dmitrii Konstantinovich Faddeev (on his eightieth birthday)\n", "abstract": " Dmitrii Konstantinovich Faddeev, Corresponding Member of the Academy of Sciences of the USSR, celebrated his eightieth birthday in 1987. Faddeev was born into the family of a Petersburg engineer on 17 (30) June 1907 in Yukhnov, in the district of Smolensk. From 1923, when he enrolled as a student of mathematics, until today all Faddeev's varied activity has been closely linked with the University of Leningrad, where he is now one of the oldest professors of mathematics, and where for many years he held the chair of higher algebra and number theory, and where he has been Dean of the Faculty of Mathematics and Mechanics. His links with the Academy of Sciences of the USSR are no less close. In 1932 he began research in the Steklov Institute of Mathematics and Physics and when in 1934 this institute moved from Leningrad to Moscow and became the Mathematical Institute, and the Leningrad Division of …", "num_citations": "3\n", "authors": ["1037"]}
{"title": "Chi-squared goodness-of-fit tests for censored data\n", "abstract": " This book is devoted to the problems of construction and application of chi-squared goodness-of-fit tests for complete and censored data. Classical chi-squared tests assume that unknown distribution parameters are estimated using grouped data, but in practice this assumption is often forgotten. In this book, we consider modified chi-squared tests, which do not suffer from such a drawback. The authors provide examples of chi-squared tests for various distributions widely used in practice, and also consider chi-squared tests for the parametric proportional hazards model and accelerated failure time model, which are widely used in reliability and survival analysis. Particular attention is paid to the choice of grouping intervals and simulations. This book covers recent innovations in the field as well as important results previously only published in Russian. Chi-squared tests are compared with other goodness-of-fit tests (such as the Cramer-von Mises-Smirnov, Anderson-Darling and Zhang tests) in terms of power when testing close competing hypotheses.", "num_citations": "2\n", "authors": ["1037"]}
{"title": "Cox model for degradation and failure time data\n", "abstract": " It is well known that traditionally the failure time data are used for product reliability estimation or for estimation of survival characteristics. Failures of highly reliable units are rare and other information should be used in addition to censored failure time data. One way of obtaining a complementary reliability information is to use higher levels of experimental factors or covariates (such as temperature, voltage, or pressure) to increase the number of failures and, hence, to obtain reliability information quickly. The accelerated life testing (ALT) of biotechnical systems is a simple practical method for estimation of reliability of new systems without having to wait for the operating lives of them.", "num_citations": "2\n", "authors": ["1037"]}
{"title": "Homogeneity tests for related samples under censoring\n", "abstract": " We propose nonparametric homogeneity tests for related samples against much wider than location (or scale) class of alternatives including possible crossings of marginal cumulative distribution functions. The tests can be used in the case of complete and censored samples. Asymptotic distribution of the test statistics is investigated.", "num_citations": "2\n", "authors": ["1037"]}
{"title": "Statistical models of longevity, aging and degradation in demography, gerontology and oncology.\n", "abstract": " Several interesting papers related with the problems of mathematical modelling in connection with a study of aging and longevity have been published recently in\" Advances of Gerontology\"; see, for example,[1-4, 10, 11]. Following the main idea of these papers we consider here some approaches for construction of statistical models used today in survival analysis and reliability, and which can be used in demography, gerontology and carcinogenesis studies. We expose the so called dynamic regression models, which are well adapted for studies of survival in dynamic environments.", "num_citations": "2\n", "authors": ["1037"]}
{"title": "A Decomposition of Pearson–Fisher and Dzhaparidze–Nikulin Statistics and Some Ideas for a More Powerful Test Construction\n", "abstract": " An explicit decomposition on asymptotically independent distributed as chi-squared with one degree of freedom components of the Pearson–Fisher and Dzhaparidze–Nikulin tests is presented. The decomposition is formally the same for both tests and is valid for any partitioning of a sample space. Vector-valued tests, components of which can be not only different scalar tests based on the same sample, but also scalar tests based on components or groups of components of the same statistic are considered. Numerical examples illustrating the idea are presented.", "num_citations": "2\n", "authors": ["1037"]}
{"title": "Statistical inference through AFT model for biotechnical systems\n", "abstract": " The objective of this paper is to model the phenomenon of degradation-to-failure for assemblies used for lumbar arthrodesis, starting from the analysis of their structure/geometry, the load applied and the kind of failure when several occur. An AFT model is proposed to model the joint effects of the applied load and the structural dimensions of the brand (namely length and diameter of the screw, presence of a connector or not) on the failure time due to a screw failure. The estimations of S–N curves and maximum permissible load (named critical load) values are provided as functions of the structural dimensions of the product. This allows comparisons of devices in terms of key factors determining product behavior and ageing under loading stress.", "num_citations": "2\n", "authors": ["1037"]}
{"title": "Estimation of reliability using failure-degradation data with explanatory variables\n", "abstract": " Semiparametric estimation of degradation and failure process characteristics using degradation and multi-mode failure time data with covariates is considered supposing that the component of hazard rate related with observable degradation is unknown function of degradation and may depend on covariates. Bibl.–17 titles.", "num_citations": "2\n", "authors": ["1037"]}
{"title": "Statistical methods to analyse failures of complex systems in presence of wear, fatigue and degradation: An engineering perspective in accelerated trials\n", "abstract": " Dynamic regression models are exposed. They are well adapted to study the phenomena of longevity, aging, fatigue and degradation of complex system, and hence to be used in organization of the efficient statistical process of quality control in dynamic environments.", "num_citations": "2\n", "authors": ["1037"]}
{"title": "On a generalization of the classical random sampling scheme and unbiased estimation\n", "abstract": " A generalization of the classical random sampling scheme is suggested. Based on the proposed generalization one can derive many new minimum variance unbiased estimators for probabilities, as well as for other functions of unknown parameters, for the multivariate Pólya, the multivariate negative Pólya, the multinomial, the multivariate hypergeometric, the multivariate Poisson, and the Wishart probability distributions.", "num_citations": "2\n", "authors": ["1037"]}
{"title": "The Impact of Dementia and Sex on the Disablement in the Elderly\n", "abstract": " The paper considers the analysis of disablement process of the elderly using the general path model with noise. The impact of dementia and sex on degradation is analysed. These joint model for survival and longitudinal data is discussed.", "num_citations": "2\n", "authors": ["1037"]}
{"title": "Tests d'égalité contre l'alternative de croisement de deux fonctions de survie\n", "abstract": " On propose deux tests pour tester l'hypothèse d'égalité de deux fonctions de survie contre l'alternative de croisement de ces fonctions pour des données censurées à droite. La loi asymptotique des statistiques de test est trouvée. La puissance des tests est calculée. Pour citer cet article : V. Bagdonavičius et al., C. R. Acad. Sci. Paris, Ser. I 339 (2004).", "num_citations": "2\n", "authors": ["1037"]}
{"title": "A probabilistic description of radioactive contamination: a multivariate model\n", "abstract": " A multivariate discrete probability model is used to facilitate the description of gamma-ray spectroscopic data obtained from radioactively contaminated territory, east of the former Semipalatinsk nuclear test site in Kazakhstan. Two possible estimators of probabilities of interest have been considered: maximum likelihood and unbiased estimators. We show that unbiased estimators are much easier to compute. The model was used in two variants: (i) several radionuclides in spatially independent measurements, (ii) a single radionuclide in spatially dependent measurements. We show that, in both cases, it is important to take into account the correlation for the accurate evaluation of probabilities of interest.", "num_citations": "2\n", "authors": ["1037"]}
{"title": "Goodness-of-Fit Tests for the Generalized Additive Risk Models\n", "abstract": " Goodness-of-fit tests for accelerated life models and generalizing or alternative to the additive risk model are proposed.", "num_citations": "2\n", "authors": ["1037"]}
{"title": "Estimation de l'âge du vin de Porto grâce au traitement des teneurs en certains composes volatils par des modèles mathématiques\n", "abstract": " Estimation de l' age du vin de Porto grace au traitement des teneurs en certains composes volatils par des modeles mathematiques - Dialnet Ayuda ¿En qué podemos ayudarle? × Buscar en la ayuda Buscar Consultar la ayuda ¿En qué podemos ayudarle? × Buscar en la ayuda Buscar Consultar la ayuda Ir al contenido Dialnet Buscar Revistas Tesis Congresos Ayuda Estimation de l' age du vin de Porto grace au traitement des teneurs en certains composes volatils par des modeles mathematiques Autores: L. Gerville-Réache, P. Barros, Antonio C. da Silva Ferreira, Mikhail Nikulin, Alain Bertrand Localización: La vitiviniculture mondiale de l'avenir. : XXIII congrès mondial de la vigne et du vin, Vol. 2, 1998, ISBN 972-8023-26-X, págs. 49-54 Idioma: francés Texto completo no disponible (Saber más ...) Fundación Dialnet Acceso de usuarios registrados Imagen de identificación Identificarse ¿Olvidó su contraseña? ¿Es …", "num_citations": "2\n", "authors": ["1037"]}
{"title": "Tables of the best possible unbalsed estimates for functions of parameters of multinomial and negative multinomial distributions\n", "abstract": " Tables of unbiased estimators with minimal variances for functions of the parameters of multinomial and negative multinomial distributions are collected. Bibliography: 10 titles.", "num_citations": "2\n", "authors": ["1037"]}
{"title": "-statistics with increasing powers\n", "abstract": " VS Korolyuk, Yu. V. Borovskikh, “$U$-statistics with increasing powers”, Dokl. Akad. Nauk SSSR, 314:3 (1990), 547–551; Dokl. Math., 42:2 (1991), 502–506 RUS ENG JOURNALS PEOPLE ORGANISATIONS CONFERENCES SEMINARS VIDEO LIBRARY PACKAGE AMSBIB General information Latest issue Archive Search papers Search references RSS Latest issue Current issues Archive issues What is RSS Dokl. Akad. Nauk: Year: Volume: Issue: Page: Find Your organisation: Google Personal entry: Login: Password: Save password Enter Forgotten password? Register Powered by MathJax Dokl. Akad. Nauk SSSR, 1990, Volume 314, Number 3, Pages 547–551 (Mi dan6409) MATHEMATICS $U$-statistics with increasing powers VS Korolyuk , Yu. V. Borovskikh Full text: PDF file (250 kB) English version: Doklady Mathematics, 1991, 42:2, 502–506 Bibliographic databases: UDC: 519.21 Received: 20.11.1989 …", "num_citations": "2\n", "authors": ["1037"]}
{"title": "Estimation of efficiency of the Bol'shev decision rule in the problem of distinguishing two hypotheses\n", "abstract": " Estimation of the efficiency of Bolshev's decision rule is discussed. There is one generalization in case of two composite hypothesis when the sufficient statistics existe.", "num_citations": "2\n", "authors": ["1037"]}
{"title": "Some probabilistic properties of the generalized omega-square statistic\n", "abstract": " One considers the properties of the statistic  , where   is the vector of the order statistics, constructed with respect to a sample of size n from a uniform distribution on the segment [0;I], ℂ is a positive definite matrix of order a, and n is an n-dimensional vector.", "num_citations": "2\n", "authors": ["1037"]}
{"title": "Computer versions of statistical procedures\n", "abstract": " One gives an analysis of certain tendencies in the accumulation process of rounding errors, occurring in statistics at the use of computers.", "num_citations": "2\n", "authors": ["1037"]}
{"title": "Some probabilistic properties of the generalized omega-square statistic\n", "abstract": " One considers the properties of the statistic , where  is the vector of the order statistics, constructed with respect to a sample of size  from a uniform distribution on the segment ,  is a positive definite matrix of order , and  is an -dimensional vector.", "num_citations": "2\n", "authors": ["1037"]}
{"title": "On computer verstions of statistical procedures\n", "abstract": " This paper contains a discription and a partial decision of problems connected with computer realization of statistical procedures. The main problem under consideration is the analysis of the influence of rounding operations on computer process when the number of observations is very large (). It is shown that the fundamental asymptotic theorems such as the law of large numbers and the lentral limit theorem cease to be true when “ideal” addition and norming are replaced by their rounding analogues.", "num_citations": "2\n", "authors": ["1037"]}
{"title": "DATA CLASSIFICATION BY COMPARING OP COMPUTER IMPLEMENTATIONS OP STATISTICAL ALGORITHMS\n", "abstract": " Using any statistical algorithm we deal with it's constructive implementation rather than it's ideal form. In particular, the discreteness of computing devices and physical constraints force us to restrict ourselves to finite sets of number values. If a theoretical model (statistical procedure) uses sets of higher power (for example, infinite sets) then any implementation is necrssary connected with approximations and therefore with computational errors.Let-(X,,...>) be a sample, and statistics under investigation, Q= a set of basic vector-functions corresponding to a given computer device (G may consist of arithmetical functions some standard functions like sqrt, sin etc.). Consider a representation of\" T^ in terms of the basic functions", "num_citations": "1\n", "authors": ["1037"]}
{"title": "Goodness-of-Fit for the Cox Model\n", "abstract": " Goodness-of-fit problem                      playes a key role in statistical inference because the validity of an assumed model ensures the subsequent inferential rationality.", "num_citations": "1\n", "authors": ["1037"]}
{"title": "On outliers detection for location-scale and shape-scale families\n", "abstract": " The problem of multiple upper outliers detection in samples from location-scale and shape-scale families is considered. A new test statistic is proposed. The critical values of the new test statistic are tabulated by simulation. The power of the new test and other available tests are compared by simulation.", "num_citations": "1\n", "authors": ["1037"]}
{"title": "Recent results in the analysis of redundant systems\n", "abstract": " In Reliability, the distributions with unimodal or the so-called -shape hazard functions are used quiet often. Mostly people use log-normal, log-logistic and inverse Gaussian distributions. In this paper, we consider also an application of the inverse Gaussian, log-normal and log-logistic distribution in the reliability analysis of redundant system with one main unit and  stand-by units. Properties of the point estimators and confidence intervals are studied.", "num_citations": "1\n", "authors": ["1037"]}
{"title": "Approximate confidence limits for a proportion of the Pólya distribution\n", "abstract": " The problem of constructing approximate confidence limits for a proportion parameter of the Pólya distribution is discussed. Three different methods for determining approximate one-sided and two-sided confidence limits for that parameter of the Pólya distribution have been proposed and compared. Particular cases of those confidence bounds are confidence intervals for the parameter of the binomial and the hypergeometric distributions.", "num_citations": "1\n", "authors": ["1037"]}
{"title": "Asymptotic analysis of a new dynamic semiparametric regression model with cross-effects of survivals\n", "abstract": " A new flexible and simple semiparametric model including the cases when hazard rates cross, go away, are proportional, approach or converge is proposed. Semiparametric estimation procedures for censored data are given. A test for absence of hazard rates crossing is proposed. Bibl. 11 titles.", "num_citations": "1\n", "authors": ["1037"]}
{"title": "Inverse Gaussian family and its applications in reliability. Study by simlulation\n", "abstract": " The inverse Gaussian distribution (IGD) is named so because it satisfies the relationship with normal distribution. The IGD was introduced first by Schrodinger in 1915 [Seshadri 1993], and its found to have many applications in a various fields such biology, economics, cardiology, demography, linguistic, etc. See for examples [Seshadri 1993],[Seshadri 1999],[Chhikara and Folks, 1989],[Voinov and Nikulin 1993],[Lawless 2003] for more details. The IGD is very competitor of Weibull, generalized Weibull and de lognormal distribution. We study the possibilities (Outlooks) of applications of the IGD in reliability and survival analysis, and we study by simulation the proprieties of dynamic regression models based on the family of IGD.", "num_citations": "1\n", "authors": ["1037"]}
{"title": "Estimation of Rescaled Distribution\n", "abstract": " In this chapter we propose a minimum distance estimator for rescaled density from a totally bounded class and prove that the rate of convergence depends only on Kolmogorov’s entropy of the class.", "num_citations": "1\n", "authors": ["1037"]}
{"title": "A test for the equality of marginal distributions\n", "abstract": " We present a test for the equality of marginals of bi-dimensional distribution functions under censoring. The asymptotic power of the test under approaching alternatives and the simulation analysis for finite samples are done. The test is more powerful than classical tests in situations where the marginals differ in shape parameters. To cite this article: V. Bagdonavičius et al., C. R. Acad. Sci. Paris, Ser. I 344 (2007).", "num_citations": "1\n", "authors": ["1037"]}
{"title": "Dementia and loss of functional autonomy in the elderly\n", "abstract": " Archive ouverte HAL - Dementia and loss of functional autonomy in the elderly Accéder directement au contenu Accéder directement à la navigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data Documentation Episciences.org Episciences.org Revues Documentation Sciencesconf.org Support hal Accueil Dépôt Consultation Les derniers dépôts Par type de publication Par discipline Par année de publication Par structure de recherche Les portails de l'archive Recherche Documentation hal-00224478, version 1 Article dans une revue Dementia and loss of functional autonomy in the elderly Pascale Barberger-Gateau 1 A. Alioum 1 S. Andrew 1 L. Lagalaye 1 Mikhail Nikulin 2 K. Pérès 1 Détails 1 Epidémiologie, santé publique et développement 2 IMB - Institut de Mathématiques de Bordeaux Keywords : aging dementia elderly functional autonomy Type de document …", "num_citations": "1\n", "authors": ["1037"]}
{"title": "Aging and degradation models in reliability and safety\n", "abstract": " The models describing dependance of thelifetime distribution on the time-depending explanatory variables are considered. Such models are useful in reliability and survival analysis to study the reliability of bio-medical systems.", "num_citations": "1\n", "authors": ["1037"]}
{"title": "Mathematical modelling of failure-time in dynamic environment\n", "abstract": " New classes of models describing dependance of the lifetime distribution on the timevarying covariate vectors are considered. Such models are used as in survival analysis as in reliability theory analysing results of accelerated life testing.", "num_citations": "1\n", "authors": ["1037"]}
{"title": "Analyse statistique de l’évaluation des sportifs par un jury\n", "abstract": " Archive ouverte HAL - Analyse statistique de l’évaluation des sportifs par un jury Accéder directement au contenu Accéder directement à la navigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data Documentation Episciences.org Episciences.org Revues Documentation Sciencesconf.org Support hal Accueil Dépôt Consultation Les derniers dépôts Par type de publication Par discipline Par année de publication Par structure de recherche Les portails de l'archive Recherche Documentation hal-01355543, version 1 Communication dans un congrès Analyse statistique de l’évaluation des sportifs par un jury Léo Gerville-Réache 1 Mikhail Nikulin 1 Détails 1 IMB - Institut de Mathématiques de Bordeaux Type de document : Communication dans un congrès Domaine : Mathématiques [math] / Statistiques [math.ST] Liste complète des métadonnées Voir https://hal.archives-…", "num_citations": "1\n", "authors": ["1037"]}
{"title": "The Heredity Principle in Accelerated Life Testing\n", "abstract": " The developpement of the heredity principle in reliability is discussed. The possible invariants in the generalized additive and multiplicative models were proposed. Estimation of these invariants with application in accelerated life testing is considered. A test for the heredity hypothesis is proposed.", "num_citations": "1\n", "authors": ["1037"]}
{"title": "A remark on the converse of Laplace's theorem\n", "abstract": " 1. At the beginning of the 1940's SN Bernshtein established that in the case of the binomial distribution the a posteriori distribution of the probability of positive outcome as the number of experiments increases without bound is practically independent of the a priori distribution. Bernshtein proved this fact under the assumption that the binomial distribution satisfies the hypotheses of the central limit theorem (in the present case, the hypotheses of Laplace's theorem). In this situation it was shown that the a posteriori distribution function of the probability of a positive outcome can be approximated by the normal approximation to the binomial distribution. Bernshtein called this theorem the converse of Laplace's theorem [1]. These facts were later included in an appendix to Bernshtein's famous textbook Theory of Probability, where in addition it was proved that when a consistent estimate exists for the random shift …", "num_citations": "1\n", "authors": ["1037"]}
{"title": "A chi-squared goodness-of-fit tests for the natural exponential families with power variance function\n", "abstract": " 266 MS Nikulin form (3) is called the class of NEF-PVF's. For example, if B-0, we have the family of normal distribucions. If B= 1, we obtain the family of Poisson distribucions, and for B= 2 wc oblain the family of gamma distribucion. As was shown by Hougaard (1986). Bar-Lev and Enis (1986), for Be (0.1) no NEF-PVF's exists, but for any BE (1.2) we obtain a NEF-PVF's of compound Poisson distributions generated by a gamma disoribucions. When B> 2, we obtain the subclass of NEF-PVF distributions generated by stable discribution on R'. which are unimodal and absolutely continuous with respect 10 Lebesguc measure on R'. We consider here namely this subclass of all NEF's on the positive numbers. As it is well known a stable distribution on R'has a stable index", "num_citations": "1\n", "authors": ["1037"]}
{"title": "Computer multiplication and division of independent random variables\n", "abstract": " One investigates the difference between the distribution functions of the rounded and the “ideal” products of independent, uniformly distributed random variables. In certain natural situations the problem has been considered in [1, 2]. One discusses the analogous problem of the comparison of the rounded and the “ideal” quotients of random variables.", "num_citations": "1\n", "authors": ["1037"]}
{"title": "A result of LN Bol'shev from the theory of the statistical testing of hypotheses\n", "abstract": " One gives a proof of L. N. Bol'shev's result on the existence of an optimal statistical test for the problem of the testing of two simple hypotheses under the condition that there exists the possibility to decline the taking of a decision.", "num_citations": "1\n", "authors": ["1037"]}
{"title": "About one result of LH Bolshev from the theory of statistical testing of hypothesis\n", "abstract": " In this paper there is given the proof of the Bolshev's result on the existence of the optimal test in the problem of testing of two simple hypothesis provided that the possibility of the refusal to take the decision is given.", "num_citations": "1\n", "authors": ["1037"]}
{"title": "A test for detecting the outlying observations in a multivariate normal family\n", "abstract": " One presents a test for the detection of outlaying observations in the multivariate normal case; it is a generalization of a test due to Bol'shev [1], intended for the one-dimensional case.", "num_citations": "1\n", "authors": ["1037"]}
{"title": "On S.N. Bernstein's regularity type conditions in a problem of empirical Bayes approach\n", "abstract": " It is proved that the aposteriorl distribution of a random success probability  in the binomial scheme can be approximated by a suitable beta-distrubution if the number  of trials tends to infinity and an apriori density function of  belongs to  for some .", "num_citations": "1\n", "authors": ["1037"]}