{"title": "Precoloring extension. I. Interval graphs\n", "abstract": " This paper is the first article in a series devoted to the study of the following general problem on vertex colorings of graphs. Suppose that some vertices of a graph G are assigned to some colors. Can this ‘precoloring’ be extended to a proper coloring of G with at most k colors (for some given k)? This question was motivated by practical problems in scheduling and VLSI theory. Here we investigate its complexity status for interval graphs and for graphs with a bounded treewidth.", "num_citations": "197\n", "authors": ["1361"]}
{"title": "The SPI manifesto and the ECQA SPI manager certification scheme\n", "abstract": " Software process improvement (SPI) can be seen as a profession having its own competence needs and its own community of interest. European projects EQN and EU Cert have defined skill sets and a common certification scheme for about 20 professions, mainly in the IT domain. European Certification and Qualification Association ECQA is created to manage certification and provide the necessary infrastructure. A common way to approach the IT domain from a process perspective is the ‘3S’ concept (Software, Systems, Services). Software process can be seen as the first spearhead among these. The first software process models, such as CMM and SPICE, have already existed for about 20 years. With all the experience that the models bring, it is reasonable to start the PI profession from the software process. Software Process Improvement Manager (SPI Manager) is one of the new topics in ECQA. The …", "num_citations": "88\n", "authors": ["1361"]}
{"title": "The people aspects in modern process improvement management approaches\n", "abstract": " It is well‐known that process improvement change requires “tools‐processes‐people.” Engineers have spent most energy on the tools and processes, but everything is done by people, and success depends on people and their competencies. The increasing focus on people is reflected in many change models; some are discussed in this paper.", "num_citations": "77\n", "authors": ["1361"]}
{"title": "The Impact of National Cultural Factors on the Effectiveness of Process Improvement Methods: The 3 rd dimension\n", "abstract": " Adopting the practices of the world’s leading economy is a desirable and sensible strategy, since these practices are based on the largest existing pool of experiences. The question is whether these practices will be equally effective in other areas of the world where different national cultures condition different value systems.CMMISM 2 (Capability Maturity Model (CMM®) IntegrationSM) is a framework from which models can be generated for different organizations. It is open to considerations regarding all kinds of circumstances including differences in cultural value systems which were characterized in his seminal work by G. Hofstede. The statistically identified clusters of characteristics of national cultures are the following:", "num_citations": "62\n", "authors": ["1361"]}
{"title": "Social responsibility aspects supporting the success of SPI\n", "abstract": " Software Process Improvement (SPI) activities aim at driving change in information technology development towards increased quality and productivity levels. The SPI Manifesto describes the key values and principles for a successful implementation of SPI. About two‐thirds of its principles relate to human, social, and organizational aspects and one‐third to technical aspects. This raises the question if these aspects have a relationship with ‘social responsibility’ principles. The new ISO 26000:2010 standard provides guidance about social responsibility (SR), describing the core subjects and issues an organization has to consider when implementing SR. In this paper, we describe how the values and principles of the SPI Manifesto have a relationship with the SR issues described in the ISO 26000. In addition, this paper describes about the steps taken in an industry group to exchange best practices about how …", "num_citations": "47\n", "authors": ["1361"]}
{"title": "Network flows and non-guillotine cutting patterns\n", "abstract": " Up till now there has been no exact and effective algorithm for the problem of finding optimal cutting patterns of rectangles which are not restricted to those with the ‘guillotine’ property. This problem can be interpreted in a resource constrained scheduling context. The contribution of this paper to this topic is a good characterization of the flow functions and graphs corresponding to cutting patterns.", "num_citations": "43\n", "authors": ["1361"]}
{"title": "Agile maturity model: analysing agile maturity characteristics from the SPICE perspective\n", "abstract": " The paper discusses structure, quality and content of the currently available agile maturity models. It presents two approaches on how to deal with such models. As a first step of the analysis, the paper contains a compilation of maturity level naming used by these agile maturity models because the variety of level naming is a sign of the variety of understanding and of definition of agile maturity.While many papers deal with agile from an inside perspective, this paper is written from the perspective of Software Process Improvement (SPI) and Capability Determination, the European Certification and Qualification Association PI Manager Certification Scheme and also the SPI Manifesto.The paper does not explicitly present its own agile maturity model.The analysis approaches presented in the paper show that the currently available agile maturity models are not fit for industrial use. The synthesis of an acceptable model …", "num_citations": "37\n", "authors": ["1361"]}
{"title": "Agile maturity model: oxymoron or the next level of understanding\n", "abstract": " From the agile camp you can hear someone to say that CMMI is the big American waterfall model monster, and is outright contra productive to agile methods. From the CMMI camp you can hear someone to say that agile methods is hackers from hell that uses the agile paradigm to enjoy anarchy with no rules. You can also hear some say that agile works the best in CMMI level 5 companies. The context of the dilemma however is slightly awkward. CMMI describes characteristics of good development practices, and agile is a lifecycle concept. So from a meta point of view they can easily co-exist. We would like to state that they do, and that you need both to support the best development performance. Starting in December 2011 three surveys were launched to get an idea about what could an agile maturity model deliver and what might be its added value. 67 Participants from several agile or/and CMMI® …", "num_citations": "36\n", "authors": ["1361"]}
{"title": "Döntéstámogató rendszerek\n", "abstract": " Tárgy neve: Page 1 Tárgy neve: Döntéstámogató rendszerek NEPTUN-kód: NSTDR1SANC Óraszám: nappali: 2 ea+0 gy+0 lab Kredit: 2 Követelmény : vizsga Előkövetelmény: NIRIR2SANC Intelligens rendszerek gyakorlata Tantárgyfelelős: Sántáné Tóth Edit Beosztás: Kar és intézet neve: Rejtő Sándor Könnyűipari Mérnöki Főiskolai Kar Informatikai és Matematikai Intézet Értékelési és ellenőrzési eljárások: - Az előadás anyagából félév végén kötelező zárthelyi dolgozatot írni. Pótolni és javítani szóban lehet, kijelölt időpontokban. A félévi aláírás megszerzésének ez a feltétele. A jó és jeles eredmények egyben megajánlott vizsgajegyek. További eljárások a Tanulmányi és vizsgaszabályzat szerint. Ismeretanyag leírása: A döntéselmélet alapjai: probléma, problémamegoldás, optimális és kielégítő döntések, normatív és leíró modellek, kapcsolatuk, állapottér reprezentáció, probléma-kategóriák. Az emberi tudás és a …", "num_citations": "36\n", "authors": ["1361"]}
{"title": "Virtual classrooms in educational provision: synchronous e-learning systems for European institutions\n", "abstract": " This book has two purposes: to provide information on synchronous elearning systems for European education and training providers and to provide a Manual of Good Practice for European trainers and training organisationsSynchronous elearning systems are also known as Live elearning or as Virtual Classroom systems. Although widely used in the United States of America these systems are little known and little used in Europe.", "num_citations": "30\n", "authors": ["1361"]}
{"title": "Agile maturity model: a synopsis as a first step to synthesis\n", "abstract": " The paper describes the current status of agile maturity models. It shows where such models can be found and it contains a structured top level compilation of the currently available agile maturity models. In the second section, the paper describes an approach to analyse these agile maturity models, extracts their content, maps it to a reference model and then synthesizes the real agile maturity issues. The paper also describes the needs for scientific research in this topic. The paper will not present its own Agile Maturity Model. This will be the task for further research. It intends however to compile current agile maturity model thinking linking it to philosophical issues partly also raised in recent initiatives like the SPI Manifesto, the ECQA PI Manager Certification Scheme and SEMAT.", "num_citations": "29\n", "authors": ["1361"]}
{"title": "Key Success Factors for Business Based Improvement\n", "abstract": " Key success factors for business based improvement - SZTAKI Publication Repository SZTAKI Publication Repository MTA SZTAKI ELKH SZTAKI Eötvös Loránd Research Network Institute for Computer Science and Control Home About Browse Login Magyar Clear Cookie - decide language by browser settings Key success factors for business based improvement Biró, M. and Messnarz, R. (1999) Key success factors for business based improvement. In: Proceedings of the EuroSPI '1999 conference. Pori, 1999. (Pori School of Technology and Economics. Ser. A., 25.). Full text not available from this repository. Item Type: Conference or Workshop Item (Paper) Subjects: Q Science > QA Mathematics and Computer Science > QA75 Electronic computers. Computer science / számítástechnika, számítógéptudomány Depositing User: Eszter Nagy Date Deposited: 11 Dec 2012 14:57 Last Modified: 11 Dec 2012 14:57 URI: …", "num_citations": "28\n", "authors": ["1361"]}
{"title": "Need for the continuous evolution of systems engineering practices for modern vehicle engineering\n", "abstract": " Cars of the future (ADAS – Autonomous self-driving assistant) will need to cover a number of new standards for mechatronic design and networking of the car in the cloud. This includes job roles for ISO 26262, IEC 61508 (functional safety), SAE J3061 (cybersecurity), etc. For instance, a car driving on a street will exchange information with neighbouring cars and learn the right steering angle, speed, etc. while the driver is using the car like a work place. Manufacturers plan to produce from 2030 only cars which have such a self-driving function incorporated. The design of new electric cars will require new infrastructures, new energy management, new battery concepts, and also new materials design (light weight and still resistant), and the job role pool will include these key skills as well. The production of cars will be with connected plants, robots to be programmed, and central production servers to …", "num_citations": "23\n", "authors": ["1361"]}
{"title": "The Software Process in the Context of Business Goals and Performance\n", "abstract": " The software process in the context of business goals and performance - SZTAKI Publication Repository SZTAKI Publication Repository MTA SZTAKI ELKH SZTAKI Eötvös Loránd Research Network Institute for Computer Science and Control Home About Browse Login Magyar Clear Cookie - decide language by browser settings The software process in the context of business goals and performance Biró, M. and Tully, C. (1999) The software process in the context of business goals and performance. In: - IEEE, Los Alamitos, pp. 15-27. Full text not available from this repository. Item Type: Book Section Subjects: Q Science > QA Mathematics and Computer Science > QA75 Electronic computers. Computer science / számítástechnika, számítógéptudomány Depositing User: Eszter Nagy Date Deposited: 11 Dec 2012 14:57 Last Modified: 11 Dec 2012 14:57 URI: http://eprints.sztaki.hu/id/eprint/2026 Update Item Update …", "num_citations": "16\n", "authors": ["1361"]}
{"title": "Pioneering process improvement experiment in Hungary\n", "abstract": " The PASS (Pay‐roll Accounting and Settlement System) project is the first Central and Eastern European ESSI PIE (European Systems and Software Initiative Process Improvement Experiment) project directly supported by the European Commission. The PASS project was carried out under the ESSI initiative with the financial support of the Commission of the European Communities under the ESPRIT Programme EP21223. The PASS (Pay‐roll Accounting and Settlement System) project started as a new business project of MemoLuX. Its business purpose is to develop a modular, platform independent, integrated networked software system satisfying functional requirements of EU standards in public accountancy and applicable for the Hungarian as well as for the international market. The system provides direct service among employers, employees and banks. The PASS project is the baseline project for the …", "num_citations": "15\n", "authors": ["1361"]}
{"title": "Aircraft and maintenance scheduling support, mathematical insights and a proposed interactive system\n", "abstract": " In this paper we first review the current practice of operative aircraft and maintenance scheduling at the Hungarian Airlines. The ideas to be included in the proposed operative scheduling support system mean new contributions from both the algorithmic and human‐computer interaction points of view. The algorithm is based on new graph theoretical results which were motivated by the necessity of combining a given flight schedule with the strict maintenance requirements of the aircraft. Aircraft rotation corresponds in mathematical terms to the coloring of an interval graph with colors representing the tail numbers in such a way that the vertices corresponding to maintenance checks are colored in advance. The human‐computer interface is built on the Microsoft Windows graphics environment, which allows a simultaneous, visual and active contact with all necessary information and methods.", "num_citations": "15\n", "authors": ["1361"]}
{"title": "BOOTSTRAP and ISCN: a current look at the European software quality network\n", "abstract": " BOOTSTRAP and ISCN | Proceedings of the conference on The challenge of networking : connecting equipment, humans, institutions: connecting equipment, humans, institutions ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleProceedingsCON '93BOOTSTRAP and ISCN: a current look at the European software quality network ARTICLE BOOTSTRAP and ISCN: a current look at the European software quality network Share on Authors: M. Biró profile image M. Biró View Profile , E Feuer profile image É. Feuer View Profile , Volkmar H Haase profile image VH Haase View Profile , Gunter R Koch profile image GR Koch View Profile , …", "num_citations": "12\n", "authors": ["1361"]}
{"title": "The Design of DINE: A DIstributed NEgotiation Support Shell\n", "abstract": " The paper discusses the integration of currently commercially available techniques and supporting tools for constructing a specialized groupware application namely a distributed negotiation support system. It presents the different aspects of the integration methods and analyzes the actual design of a DIstributed NEgotiation Support Shell (DINE). The DINE model supports simultaneous, multiple issue, independent, peer-to-peer negotiations. It allows the integration of existing negotiation support techniques which, as opposed to DINE, mostly focus on those scenarios where the negotiation issues are shared by all negotiators. The latter techniques will be used to support the independent peer-to-peer negotiations in DINE. Negotiators may in fact use any tool even without DINE, as long as it supports the same peer-to-peer information sharing protocol. At the same time, DINE is a generalized multiple criteria decision …", "num_citations": "12\n", "authors": ["1361"]}
{"title": "Optimizing resource utilization by combining activities across process instances\n", "abstract": " Resource-efficient business processes are a key asset of an organization in a competitive market environment. Current efforts address this issue either at the process schema level by specifying an optimal sequence of process activities or at the process instance level by optimizing resource utilization within a single running process instance.               In this paper, we present a novel approach for combining activities across process instances to optimize resource utilization. The proposed approach comprises the (i) definition of business processes and combinable activities, (ii) identification of possible combinations at runtime, (iii) determination of optimization potential, and (iv) actual combination of activities across process instances. The approach further supports partial activity combinations and dynamic resource selection for combined activities. The applicability of the approach is demonstrated by a case …", "num_citations": "11\n", "authors": ["1361"]}
{"title": "Forces affecting offshore software development\n", "abstract": " This paper identifies the forces affecting offshore software development based on a knowledge management perspective. The identified four major forces act along the dimensions of finance, individual education, organizational maturity, and culture. The analysis is validated on cases of European offshoring practice exhibited in the database of the EuroSPI (European Software Process Improvement) series of conferences.", "num_citations": "11\n", "authors": ["1361"]}
{"title": "Cross fertilisation of graph theory and aircraft maintenance\n", "abstract": " Cross fertilisation of graph theory and aircraft maintenance - SZTAKI Publication Repository SZTAKI Publication Repository MTA SZTAKI ELKH SZTAKI Eötvös Loránd Research Network Institute for Computer Science and Control Home About Browse Login Magyar Clear Cookie - decide language by browser settings Cross fertilisation of graph theory and aircraft maintenance Bíró, M. and Hujter, M. and Tuza, Zsolt (1992) Cross fertilisation of graph theory and aircraft maintenance. In: AGIFORS thirty-second annual symposium. Airline Group of the International Federation of Operational Research Societies. Budapest, 1992. Full text not available from this repository. Item Type: Conference or Workshop Item (Paper) Subjects: Q Science > QA Mathematics and Computer Science > QA75 Electronic computers. Computer science / számítástechnika, számítógéptudomány Divisions: Systems and Control Lab Depositing User…", "num_citations": "11\n", "authors": ["1361"]}
{"title": "Object-oriented interaction in resource constrained scheduling\n", "abstract": " The purpose of this paper is the presentation of ideas exploiting the rapidly evolving possibilities offered by presentation hardware and software for interactive resource constrained scheduling. Mathematical difficulties inherent in the object-oriented representation and connections to two-dimensional bin-packing and graph theory are highlighted. Decision problems and their usefulness in providing an answer to the representation problem are discussed.", "num_citations": "11\n", "authors": ["1361"]}
{"title": "SPI experiences and innovation for Global Software Development\n", "abstract": " • An annual EuroSPI conference supported by Software Process Improvement Networks from different European (EU) countries.• Establishing an Internet-based knowledge library, newsletters and a set of proceedings and recommended books.• Establishing an effective team of national representatives (from each EU country) growing step by step into more countries of Europe.• Establishing a European Qualification Framework for a pool of professions related to software process improvement (SPI) and management. This is supported by European certificates and exam systems.EuroSPI established an experience library (library. eurospi. net), which is continuously extended over the years and is made available to all attendees. EuroSPI also established an umbrella initiative European Certification and Qualification Association (ECQA), which is funded by the EU Life Long Learning Programme and establishes a", "num_citations": "10\n", "authors": ["1361"]}
{"title": "The Software Process Improvement Hype Cycle\n", "abstract": " Early software quality initiatives concentrated on the measurement of the quality of the software product. Boehm and McCall worked out their software quality models at the end of the 1970’s [1][2]. The recognition of the fact that the software development process itself is the factor having the most significant impact on software quality dates back to the end of the 1980’s and leads to the innovation embodied in the Capability Maturity Model for Software (also known as the CMM and SW-CMM) that emerged from work done primarily by Watts Humphrey [3] grounded in the tradition of Total Quality Management (TQM). The CMM was a real innovation expected to have a significant impact in overcoming the software crisis which has occupied our attention for a long time.", "num_citations": "9\n", "authors": ["1361"]}
{"title": "Using the eSourcing Capability Model to improve IT enabled business process outsourcing services\n", "abstract": " Memolux, a leading Hungarian accounting and software development firm has run software process improvement practice for more than ten years. The ICT department achieved maturity level 3 of Bootstrap methodology and ISO 9001 certification by 1998 and has been successfully participating in EU research projects. Based on the lessons learnt from process improvement, a development project called PASS3Mill was launched to support the company’s other main business activity, the payroll outsourcing service. The effects of the development on the outsourcing business environment were measured against the framework of the eSourcing Capability Model for IT-enabled Service Providers (e scm) and this article summarises the results and consequences by presenting practical knowledge management experiments. Specific attention is paid to focus on the specialities coming from the outsourcing type and the SME size of the service company. The authors present examples of the practical usage of the e scm practices and describe how the SPI knowledge and the supporting tools can be used to design and set up new business process outsourcing services like monitoring of collaborative projects in the accession countries.", "num_citations": "9\n", "authors": ["1361"]}
{"title": "Synergies Between the Common Criteria and Process Improvement\n", "abstract": " This paper summarizes multifaceted synergies discovered between the ISO/IEC 15408 (Common Criteria) IT Security Evaluation standard, software product quality evaluation standards and the Capability Maturity Model Integration (CMMI). In addition to serving research motivated interest, the usefulness of the synergies is demonstrated through case studies related to significant systems development projects.", "num_citations": "8\n", "authors": ["1361"]}
{"title": "The perception of quality based on different cultural factors and value systems\n", "abstract": " The perception of quality based on different cultural factors and value systems - SZTAKI Publication Repository SZTAKI Publication Repository MTA SZTAKI ELKH SZTAKI Eötvös Loránd Research Network Institute for Computer Science and Control Home About Browse Login Magyar Clear Cookie - decide language by browser settings The perception of quality based on different cultural factors and value systems O'Suilleabhain, G. and Jordan, M. and Messnarz, R. and Bíró, M. and Street, K. (2000) The perception of quality based on different cultural factors and value systems. In: Proceedings of the EuroSPI 2000 conference. European software process improvement. Copenhagen, 2000.. Full text not available from this repository. Item Type: Conference or Workshop Item (Paper) Subjects: Q Science > QA Mathematics and Computer Science > QA75 Electronic computers. Computer science / számítástechnika, …", "num_citations": "8\n", "authors": ["1361"]}
{"title": "Aspects of improvement of software development lifecycle management\n", "abstract": " The software development lifecycle management is a crucial aspect of software development, as it defines significantly the effectiveness of development and the maturity of the final product. A suitable management system is especially important in safety critical development, such as the development of medical devices, as these developments have to be well documented to prove the safe operation of the given instrument. This paper prepares a case study to help a company improving their existing lifecycle management system by establishing a group of requirements. In particular, the paper focuses on medical device software development aspects. The answering of these questions allows achieving an optimal choice among the possible management systems either by providing a quantitative comparison or by highlighting the grounds for exclusion.", "num_citations": "7\n", "authors": ["1361"]}
{"title": "Open services for software process compliance engineering\n", "abstract": " The paper presents an update of the change of expectations and most recent new approaches regarding software processes and their improvement following the Software Process Improvement Hype Cycle introduced earlier by the author as an extension of the Gartner Hype Cycle idea. Software process assessment and improvement can itself be considered on the more abstract level as a quest for compliance with best practices. Etics and regulatory regimes explicitly addressing safety-critical systems mean however stringent compliance requirements beyond the commitment to improve process capability. New approaches are necessary for software engineers to fulfill the considerably growing expectations regarding quality under much slower changing development budget and deadline constraints. Open Services for Lifecycle Collaboration (OSLC) is the emerging initiative inspired by the web which is …", "num_citations": "7\n", "authors": ["1361"]}
{"title": "From compliance to business success: Improving outsourcing service controls by adopting external regulatory requirements\n", "abstract": " The new generation of general models that refer either to IT or Internal Controls, like COBIT or COSO, are presented with an executive management perspective. Practice shows that this opening is solely not enough to reach a breakthrough, since models became so complicated that they could only be applied with difficulties. The best catalysts of improvement programs are the mandatory rules being issued, mainly from the financial reporting area. The Sarbanes–Oxley Act (SOX) for US SEC registrants and its affiliates, and the 8th Directive on company Law in the EU require strict internal controls for reporting processes. In this article we concentrate on the successful application of these rules in a situation where IT‐enabled services have a major effect on the compliance of the user organization. We investigate the effects of a high maturity level on compliance for both the service and the user organizations. The …", "num_citations": "7\n", "authors": ["1361"]}
{"title": "The Usability Approach in Software Process Improvement\n", "abstract": " In the past years, efforts in the field of Software Process Improvement were increasingly focusing on human aspects realizing that people participating in the processes have a high impact on the success of any improvement. While these aspects are included in newer models and methodologies, it is still vague how Software Process Improvement can be made suitable for different people. In this paper, we propose a new approach: the application of usability methodology for Software Process Improvement. We present an overview of the people aspects in Software Process Improvement and introduce a methodology to apply usability methodology in this context. We also formulate ideas on how to adapt concrete improvement methods based on the usability methodology.", "num_citations": "6\n", "authors": ["1361"]}
{"title": "Functional safety, traceability, and open services\n", "abstract": " There are clear business reasons why the achievement of the functionality of more and more industrial products is definitely shifted to the use of embedded software replacing earlier hardware solutions. It is commonly known that the elicitation, identification, analysis, specification, modeling, validation, and management of the requirements in general and of functional safety requirements in particular is a demanding process with special implications for the case of software also reflected in related general and industry specific standards. This chapter gives a brief overview of standard approaches to functional safety with examples from the medical domain. It is highlighted that one of the key requirements of all approaches is traceability. The emerging Open Services for Lifecycle Collaboration (OSLC) technology, exploiting the architecture of the World Wide Web, is shown to have a determining impact on the future of the satisfaction of traceability requirements of safety-critical software development among others.", "num_citations": "5\n", "authors": ["1361"]}
{"title": "The future of SPI knowledge and networking in Europe–a vision\n", "abstract": " Authors of this paper have been founders of the EuroSPI (1994 – now,                                             www.eurospi.net                                                             ) network with the first networking of SPI strategies published at CON’93 conference. They were also founders of the idea and establishment of a Europe wide certification network ECQA (                                            www.ecqa.org                                                             ) in 2005 (strategy development 2005 – 2007, online systems set up 2008 – 2009, Europe wide roll out since 2009). In a think tank and network of leading SPI experts we have developed the idea of a future European knowledge networking strategy and how the existing SPI paradigms will shift into a new SPI world applying new principles for collaboration, networking, and using new media which became available in the last 3-4 years.This vision will then impact about how we collaborate and implement SPI …", "num_citations": "5\n", "authors": ["1361"]}
{"title": "Graceful integration of process capability improvement, formal modeling and web technology for traceability\n", "abstract": " This paper discusses the need and leveraging potential of formal modeling and web technology for progressing towards the goal of automating the establishment, maintenance and assessment of the completeness of traceability and the consistency of the requirements. The generic Augmented Lifecycle Space method, devised in an earlier paper, is applied as the approach to improve the capability of software processes requiring bidirectional traceability as well as consistency of the requirements in either homogeneous or heterogeneous development environments capitalizing on the emerging Open Services for Lifecycle Collaboration (OSLC) initiative. One of the important features of the presented new approach is that it allows for the so called “graceful integration” of formal modeling. Formal modeling is fundamentally necessary for securing completeness and consistency, but customarily rejected due to …", "num_citations": "4\n", "authors": ["1361"]}
{"title": "Cultural environment protection in the information society\n", "abstract": " The major source of environmental problems nowadays is the disregard of the laws of nature which escalates even more in the globalizing industrial society. It is a natural question whether we are not facing similar dangers in the more rapidly globalizing information society. What are the most important factors which characterise software or information customers’ value systems in different national cultures and which have an impact on their perception of the quality of the software/information being their gateway to the information society? The question will be approached using the dimensions of national cultures which were identified applying statistical cluster analysis.", "num_citations": "4\n", "authors": ["1361"]}
{"title": "The use of deep knowledge from the perspectives of cooperative problem solving, systems modeling, and cognitive psychology\n", "abstract": " One of the points of the paper is that the exploitation of deep knowledge may well contribute to the appreciation of technology supporting small groups. The term deep knowledge is used in this paper for knowledge that is not only derived from rules acquired from experts, but is complemented with the application of usually numerical algorithms which incorporate a deep body of mathematical knowledge. A natural requirement in this context is the involvement of end-users in the mathematical modeling process. The selective usefulness of relational and functional modeling is analysed from this point of view. A graph theoretic algorithm is proposed for the support of relation building by end-users. The idea of spreadstructure is highlighted. Modeling is analysed from the perspective of cognitive psycholgy. Finally, a prototype modeling support system is presented which is built on the Microsoft Windows environment.", "num_citations": "4\n", "authors": ["1361"]}
{"title": "Shifting Paradigms in Innovation Management–Organic Growth Strategies in the Cloud\n", "abstract": " The industry is currently undergoing tremendous changes. In the automotive domain vehicles get connected and autonomous, the powertrain gets electrified. The CO2 emissions have to be reduced as a contribution to stop the global warming. Intelligent service architectures for future e-mobility services are created, and accessibility requirements and demographic developments need to be considered. The production is more and more automated, decentralized and controlled by robots. To meet the future requirements of an electric car in the future, it is essential to combine different approaches with each other. Also the Internet of Things (IoT) leads to complete networking of humans, machines, environment, medical systems, transport systems, etc. Can we under these circumstances still use the typical innovation strategies or do we need new paradigms for generating innovation and managing innovation? This paper will deal with new patterns and concepts that will substitute the previous patterns and concepts promoted by the innovation manager job role from ECQA.", "num_citations": "3\n", "authors": ["1361"]}
{"title": "Towards automated traceability assessment through augmented lifecycle space\n", "abstract": " The assessment and improvement of the satisfaction of traceability requirements during the development of software in general and of safety-critical software in particular is demanding and costly. The special requirements are reflected in software process related general and industry specific standards and the popular agile approaches as well. It is imminent, for practical and logical reasons, that there is a need for the automation of the assessment of the completeness and consistency of traceability as far as possible. In addition to highlighting experienced weaknesses of current either homogeneous or heterogeneous tool environments intending to support development lifecycle traceability, this paper outlines new solutions and suggests the exploitation of emerging technologies for the automation of traceability assessment and improvement.", "num_citations": "3\n", "authors": ["1361"]}
{"title": "Business Motivations for Software Process Improvement\n", "abstract": " Business motivations for software process improvement - SZTAKI Publication Repository SZTAKI Publication Repository MTA SZTAKI ELKH SZTAKI Eötvös Loránd Research Network Institute for Computer Science and Control Home About Browse Login Magyar Clear Cookie - decide language by browser settings Business motivations for software process improvement Biró, M. and Remzső, T. (1998) Business motivations for software process improvement. ERCIM NEWS (32). pp. 40-41. Full text not available from this repository. Item Type: Article Subjects: Q Science > QA Mathematics and Computer Science > QA75 Electronic computers. Computer science / számítástechnika, számítógéptudomány Depositing User: Eszter Nagy Date Deposited: 11 Dec 2012 14:54 Last Modified: 11 Dec 2012 14:54 URI: http://eprints.sztaki.hu/id/eprint/1743 Update Item Update Item EPrints Logo SZTAKI Publication Repository is …", "num_citations": "3\n", "authors": ["1361"]}
{"title": "Augmented Lifecycle Space for traceability and consistency enhancement\n", "abstract": " In software development application lifecycle management (ALM) systems are used to support the development process. As these products are tailored for best fitting the applied programs and their actual usage is diverse. Often, this means that products of different vendors are applied, which reduce the reachability between different artefacts and the overall consistency of the system. In this paper we are analyzing the applicability of Augmented Lifecycle Space as a new approach. This approach provides the capability to enhance the traceability and consistency while reducing human effort through automation both in homogeneous and heterogeneous tool environments.", "num_citations": "2\n", "authors": ["1361"]}
{"title": "Cross-Tool Interoperability in Heterogeneous Application Lifecycle Management Systems.\n", "abstract": " Application lifecycle management (ALM) systems, used to support software development processes, can be composed from various components depending on the need of company. In this paper we focus on benefits of establishment of cross-tool interoperability with specific regard to heterogeneous platforms. We discuss how the different components can be connected for systemic tool collaboration with the help of Open Services for Lifecycle Collaboration (OSLC). This helps to improve traceability and consistency. Furthermore, workflow can be generated to correct the traceability gaps, consistency problems and even to implement modifications. Moreover, we present how the workload of developers can be decreased by integrating revision control system and development environment with the existing ALM system.", "num_citations": "2\n", "authors": ["1361"]}
{"title": "Evaluation criteria for application life cycle management systems in practice\n", "abstract": " The effective use of (human) resources and a mature product assumes the application of a software development life cycle (SDLC) management system which actively supports the process of development. A well-adjusted SDLC system is a prerequisite in safety-critical developments, such as the development of medical devices. Otherwise, the intensive documentation needed proving the correct and safe operation of the equipment cannot be fulfilled. The aim of this paper is to provide structured and mostly quantified criteria for companies which plan to establish newly an application life cycle management system or improve an existing one. The answering of these question helps making an objective and optimal choice among the different systems. Finally, this paper prepares a case study, where the application of these criteria will be demonstrated in practice.", "num_citations": "2\n", "authors": ["1361"]}
{"title": "The SPI Manifesto and the corresponding ECQA certified SPI manager training\n", "abstract": " In order to define a modern approach for Software Process Improvement (SPI), the SPI Manifesto was developed, discussed, and finalized at the 16th EuroSPI Conference in 2009 in Alcala, Spain. The common understanding gained during the discussion and usage of the manifesto formed a nucleus from which the new ISO/IEC 33014 [ISO01] was derived. In parallel to the development of the SPI Manifesto, the SPI manager Training was developed by the European Certification and Quality Association (ECQA) under Sponsorship of the European Commission. The goal of the training was to address all topics mentioned in the SPI manifesto and also include additional topics seen as useful for mangers dealing with SPI.", "num_citations": "2\n", "authors": ["1361"]}
{"title": "Topics in Software, Systems and Services Process Improvement\n", "abstract": " EuroSPI established a newsletter series (newsletter. eurospi. net), an SPI Manifesto (SPI= Systems, Software and Services Process Improvement), an experience library (library. eurospi. net) which is continuously extended over the years and is made available to all attendees, and a Europewide certification for qualifications in the SPI area (www. ecqa. org, European Certification and Qualification Association).", "num_citations": "2\n", "authors": ["1361"]}
{"title": "Process improvement lessons learnt in small and large organizations worldwide\n", "abstract": " Process improvement lessons learnt in small and large organizations worldwide | Software Process: Improvement and Practice ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Software Process: Improvement and Practice Periodical Home Latest Issue Archive Authors Affiliations Award Winners More HomeBrowse by TitlePeriodicalsSoftware Process: Improvement and PracticeVol. , No. Process improvement lessons learnt in small and large organizations worldwide article Process improvement lessons learnt in small and large organizations worldwide Share on Authors: Miklós Biró View Profile , Richard Messnarz View Profile Authors Info & Affiliations Publication: Software Process: Improvement and …", "num_citations": "2\n", "authors": ["1361"]}
{"title": "European industrial experiences in process improvement and innovation\n", "abstract": " • Organizing an annual EuroSPI conference supported by Software Process Improvement Networks from different EU countries;• Establishing an Internet-based knowledge library, newsletters and a set of proceedings and recommended books;• Establishing an effective team of national representatives (from each EU country) growing step by step into more countries of Europe;• Establishing a European Qualification Framework for a pool of professionals related with SPI and management, and supported by European certificates and exam systems.EuroSPI has established an experience library (library. eurospi. net) that continuously expands over the years and is made available to all attendees. EuroSPI has also established an umbrella initiative, European Quality Network (EQN), which is funded by the EU Leonardo da Vinci Programme and has established a European certification and accreditation network for …", "num_citations": "2\n", "authors": ["1361"]}
{"title": "Special issue with selected industrial experience papers of EuroSPI22005\n", "abstract": " EuroSPI has established an experience library (library. eurospi. net) that is constantly extending over the years and is made available to all attendees. EuroSPI has also established an umbrella initiative European Quality Network (EQN) which is funded by the EU Leonardo da Vinci Programme and has a European certification and accreditation network for professions in the IT and Services sector. A typical characterisation of EuroSPI was stated by a company using the following words:‘... the biggest value of EuroSPI lies in its function as a European knowledge and experience exchange mechanism for SPI and innovation’.", "num_citations": "2\n", "authors": ["1361"]}
{"title": "Managing Multi-Cultural and Multi-Social Projects in SPI\n", "abstract": " This paper discusses the required competencies of EU project managers in general, and outlines that the success of projects by two thirds depends on human and social factors in the organisations when projects are running on a multinational basis.It will outline some major highlights of the underlying studies and a set of rules promoted for European projects (http://www. manageur. com) about how to be successful. Corvinus University, ISCN, and Memolux were partners in these projects and studies which involved many hundred firms from 1998–2003.", "num_citations": "2\n", "authors": ["1361"]}
{"title": "ManagEUr–Success Criteria for EU Project Management\n", "abstract": " This paper discusses success criteria of distributed multinational EU projects based on trials performed at 59 organisations in 13 countries in the EU IST-2000-28162 project TEAMWORK. In this project the typical working processes, the teamwork structures in multinational distributed EU projects have been analysed and configured into e-working spaces. These e-working spaces were then used in the trials.The experiences from these trials are leveraged in the design of an EU project manager skill card being developed in the framework of the EU Leonardo da Vinci project ManagEUr (2003–2006). This skill card is currently being configured into a skills portal and allows managers to browse the required skills, to do self assessment, and to receive guidance. It is a distinctive feature of ManagEUr that it puts equal emphasis on technology, content and human factors necessary for successful application.", "num_citations": "2\n", "authors": ["1361"]}
{"title": "Software Process Improvement in Central and Eastern Europe\n", "abstract": " Software process improvement in Central and Eastern Europe - SZTAKI Publication Repository SZTAKI Publication Repository MTA SZTAKI ELKH SZTAKI Eötvös Loránd Research Network Institute for Computer Science and Control Home About Browse Login Magyar Clear Cookie - decide language by browser settings Software process improvement in Central and Eastern Europe Biró, M. and Gorski, J. and Stoyan, YUG and Loyko, AF and Novozhilova, MV and Socol, I. and Bichir, D. and Vajde Horvat, R. and Rozman, I. and Györkös, J. (1998) Software process improvement in Central and Eastern Europe. IEEE TCSE SOFTWARE PROCESS NEWSLETTER (12). pp. 19-21. Full text not available from this repository. Item Type: Article Subjects: Q Science > QA Mathematics and Computer Science > QA75 Electronic computers. Computer science / számítástechnika, számítógéptudomány Depositing User: Eszter Nagy …", "num_citations": "2\n", "authors": ["1361"]}
{"title": "Reference Model for World Wide Web Voting and Rating Services\n", "abstract": " One of the purposes of the Web4Groups Telematics Applications Project of 4. Framework is to provide, develop, and demonstrate new standardized group communication services for European citizens. Voting and rating services are an important part of the tasks of Web4Groups. In this paper the generalization of the voting and rating architecture is provided in the form of a Reference Model. A Reference Model is an abstract computational model without any particular implementation issues. The main purpose of creating this Reference Model is the promotion of the basic understanding of the problem of voting and rating. The Reference Model is a specialized version of the Reference Model of Distributed Group Decision Support Systems (RM-DGDSS) developed previously. The RM-DGDSS defines a distributed architecture environment for supporting a group of decision makers connected via computer network. Entities of the Voting and Rating Reference Model and their relationship are presented as well.", "num_citations": "2\n", "authors": ["1361"]}
{"title": "Systems of decision criteria supporting software process improvement\n", "abstract": " Systems of decision criteria supporting software process improvement - SZTAKI Publication Repository SZTAKI Publication Repository MTA SZTAKI ELKH SZTAKI Eötvös Loránd Research Network Institute for Computer Science and Control Home About Browse Login Magyar Clear Cookie - decide language by browser settings Systems of decision criteria supporting software process improvement Bíró, M. and Turchányi, P. (1995) Systems of decision criteria supporting software process improvement. In: DSS - Galore. The fifth meeting of EURO Working Group on DSS. Abo/Turku, 1995. (Institute for Advanced Management Systems Research. Ser. A 427.). Full text not available from this repository. Item Type: Conference or Workshop Item (Paper) Subjects: Q Science > QA Mathematics and Computer Science > QA75 Electronic computers. Computer science / számítástechnika, számítógéptudomány Depositing User: …", "num_citations": "2\n", "authors": ["1361"]}
{"title": "Software Process Assessment and Improvement from a Decision Making Perspective\n", "abstract": " The quality of the process determines the quality of the product. This slogan is becoming more and more accepted in industrial production in general and in the software industry in particular. MTA SZTAKI recognized the importance of increasing the awareness of the benefits of software process improvement in Hungary. But managers making decisions need to be addressed in the language of business decisions which is mostly different from that of process quality experts. For this reason, we identified and analysed the business decision problems which are supported by various approaches to software quality. Our next objective is the application of multiple criteria decision making techniques to software process assessment and improvement.The evaluation of the quality of a software product is one of the basic issues in information technology. A system of product quality criteria is summarized in the ISO/IEC 9126 …", "num_citations": "2\n", "authors": ["1361"]}
{"title": "Protocols for Cooperative Multiple Criteria Decision Processes\n", "abstract": " In the group decision process a set of human decision makers work together to achieve common judgement on several issues. Decision conferences are usually synchronous, face-to-face meetings in decision room environments. If several similarly equipped remote decision rooms are connected via real-time video and/or audio links, a media space is created. In individual meeting rooms or multimedia technology created media spaces, meetings and decision making processes are supported by computer technology (eg network connected workstations) besides other forms of analog and/or digital communication technologies such as projected shared video screen, telephone, fax. This computational support usually covers different phases of the meeting (from brainstorming, through formal voting procedures to collaborative minutes writing), and uses computer network services for human participants and/or their software actors. In this paper a computational Reference Model of Distributed Group Decision Support Systems (RM-DGDSS) is presented within the framework of the Reference Model of Open Distributed Processing [RM-ODP 92]. The RM-DGDSS defines a distributed architecture for supporting a group of decision makers connected via computer network. Reference model defines a vision, a strategic outline for the standardization of this kind of distributed processing as well as the description and standardization of basic ideas, entities, algorithms of distributed group decision process. It provides a common language and basic understanding for researchers and developers of this area. The ultimate aim of this contribution is the initiation …", "num_citations": "2\n", "authors": ["1361"]}
{"title": "Deep knowledge for group decision support.\n", "abstract": " Deep knowledge generation using mathematical models is shown to be an essential feature of group decision support systems intended for widespread use by even small groups. End-user involvement in modeling is examined from the perspectives of the intervening technology, the decision making process, systems modeling, and psychology. New ideas are exhibited on a prototype of the modeling support system MOSSY taking advantage of the Microsoft Windows environment of IBM/PC compatible computers.", "num_citations": "2\n", "authors": ["1361"]}
{"title": "Efficient method applying incomplete ordering for solving the binary knapsack problem\n", "abstract": " The binary knapsack problem is one of the simplest models in integer programming. It is formulated as follows:~ ax~ x i'x~< b", "num_citations": "2\n", "authors": ["1361"]}
{"title": "Demonstration of augmented lifecycle space in heterogeneous environment\n", "abstract": " Safety-critical and other high reliability software developments cannot be created without additional support tools. The aim of these so called application lifecycle management systems are to make it possible to track every step of the development process and support the documentation created for customers and regulatory bodies. In such developments, it is crucial to prove that traceability is complete and there is no contradiction between the artifacts. In former papers, the idea of the general approach called Augmented Lifecycle Space was presented which can effectively support the detection of traceability gaps and inconsistencies. Furthermore, the application of this method was demonstrated in homogeneous systems. In this paper, the applicability of this approach is presented in heterogeneous environment where the theoretical problems are partially already solved and it is possible to give insight of the …", "num_citations": "1\n", "authors": ["1361"]}
{"title": "Enhanced traceability and consistency with Augmented Lifecycle Space\n", "abstract": " Modern software development is unimaginable without the help of Application lifecycle management systems (ALMs) due to the heavy documentation and communication needs, especially in safety-critical developments. In this paper the idea of Augmented Lifecycle Space is presented together with its use and benefits. The main target of application is to enhance traceability and consistency throughout the development with minimal or reduced human effort. The idea can be realized easily in homogeneous ALM systems. In case of heterogeneous systems, which is the main scope of this research, some kind of interoperability is required among the used tools. Open Services for Lifecycle Collaboration (OSLC) is a possible solution and it is used to illustrate a possible setup for further studies.", "num_citations": "1\n", "authors": ["1361"]}
{"title": "Historical Perspective on the State of Software Process Improvement\n", "abstract": " CMMI and ISO/IEC 15504 (SPICE), the international standard for the assessment and improvement of software processes, provides a framework for the improvement of the organization of software development, whose application became a prerequisite for a software organization to be considered as a reliable business partner already in the 1990’s. They are related in this sense to the ISO 9001 standard, they are however significantly more useable originally in the case of the software, but currently in the case of arbitrary processes as well.The paper presents an update of the change of our expectations regarding software processes and their improvement from a historical perspective following the Software Process Improvement Hype Cycle [1] introduced earlier by the author as an extension of the Gartner Hype Cycle idea.", "num_citations": "1\n", "authors": ["1361"]}
{"title": "Hungarian Experiences of Using an Ontology-based Adaptive Knowledge Evaluation Approach in Teaching Business Informatics in a Mobile Learning Environment\n", "abstract": " This paper describes a possible method of combining an ontology based, adaptive examination system with mobile technology. A detailed description is given about the main characteristics of the educational ontology, which was the domain of our research and also about the way it was implemented in the mainstream education with the help of current mobile learning technology. The experiences gained during the pilot courses are also depicted at the end of the paper.", "num_citations": "1\n", "authors": ["1361"]}
{"title": "Szoftverminőség\n", "abstract": " Szoftverminőség - SZTAKI Publication Repository SZTAKI Publication Repository MTA SZTAKI ELKH SZTAKI Eötvös Loránd Research Network Institute for Computer Science and Control Home About Browse Login Magyar Clear Cookie - decide language by browser settings Szoftverminőség Biró, M. (1997) Szoftverminőség. In: - OMFB, Miskolc, pp. 411-460. Full text not available from this repository. Item Type: Book Section Subjects: Q Science > QA Mathematics and Computer Science > QA75 Electronic computers. Computer science / számítástechnika, számítógéptudomány Depositing User: Eszter Nagy Date Deposited: 11 Dec 2012 14:53 Last Modified: 11 Dec 2012 14:53 URI: http://eprints.sztaki.hu/id/eprint/1414 Update Item Update Item EPrints Logo SZTAKI Publication Repository is powered by EPrints 3 which is developed by the School of Electronics and Computer Science at the University of Southampton. …", "num_citations": "1\n", "authors": ["1361"]}
{"title": "ISCN-The International Software Collaborative Network\n", "abstract": " ISCN - The International Software Collaborative Network - SZTAKI Publication Repository SZTAKI Publication Repository MTA SZTAKI ELKH SZTAKI Eötvös Loránd Research Network Institute for Computer Science and Control Home About Browse Login Magyar Clear Cookie - decide language by browser settings ISCN - The International Software Collaborative Network Messnarz, R. and Mac an Airxhinnigh, M. and Biró, M. (1996) ISCN - The International Software Collaborative Network. In: ISCN'96. (The International Software Collaborative Network). Practical improvement of software processes and products. Brighton, 1996.. Full text not available from this repository. Item Type: Conference or Workshop Item (Paper) Subjects: Q Science > QA Mathematics and Computer Science > QA75 Electronic computers. Computer science / számítástechnika, számítógéptudomány Depositing User: Eszter Nagy Date Deposited: …", "num_citations": "1\n", "authors": ["1361"]}
{"title": "The Hungarian quality scene-potential for co-operation\n", "abstract": " The objective of this paper is to encourage the mutually beneficial cooperation between software and systems development organizations of Hungary and other countries. The Strengths, Weaknesses, Opportunities and Threats (SWOT) are analysed from the perspective of the possible exploitation of achievable financial, operating, marketing, and production leverages with Hungarian software firms. The benefits for cooperating partners are the following for example: highly educated workforce, cultural proximity, relatively low cost. Nevertheless, cooperation is difficult to initiate because of perceived threats arising from the former neglect of the development of a quality culture. This paper highlights the emerging trends in the Hungarian quality scene, and introduces a new opportunity for establishing mutually beneficial cooperation projects. The idea is to make use of ISCN as a coordinating agent with the role of assessing and improving the quality systems of potential Hungarian partners, reducing in this way the risks of other partners to cooperate with them. In the following we give an overview of the Hungarian information technology market in general and the software market in particular in order to introducing the environment in which Hungarian software firms are operating. A short SWOT analysis of Hungary in the software development area is presented next, followed by the results of a survey of the quality awareness of Hungarian software producing firms.", "num_citations": "1\n", "authors": ["1361"]}
{"title": "Business decision problems supported by software product and process assessment\n", "abstract": " Bíró, M. and Feuer, Éva and Remzső, T. and Turchányi, P.(1995) Business decision problems supported by software product and process assessment. In: ESI-ISCN'95. Practical improvement of software processes and products. Measurement and training based process improvement. Vienna, 1995.", "num_citations": "1\n", "authors": ["1361"]}
{"title": "Distributed object management: a survey\n", "abstract": " Distributed object management | Proceedings of the conference on The challenge of networking : connecting equipment, humans, institutions: connecting equipment, humans, institutions ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleProceedingsCON '93Distributed object management: a survey Article Distributed object management: a survey Share on Authors: Miklós Biró View Profile , András Micsik View Profile , Tibor Remzső View Profile Authors Info & Affiliations Publication: CON '93: Proceedings of the conference on The challenge of networking : connecting equipment, humans, institutions: connecting equipment, humans, …", "num_citations": "1\n", "authors": ["1361"]}
{"title": "Spre adshe et-Based Model Building and Multiple Criteria Group Decision Support\n", "abstract": " . 1 The purpose of this paper is the description of a system that, while fully exploiting: and integrating the advanced features of the Nficrosoft Excel commercial spreadsheet software and Hewlett-Packard's NewWave otlice environment, extends them with new opt imisation and multiple criteria group decision model building capabilities.The new features include a mneta-model building language which allows the automatic generation of a class of mathematical programming spreadsheet models dynamically linked to public and private databases. These models can immediately be used for both intuitive experimentation and optimisation. Figure I shows a sample model.", "num_citations": "1\n", "authors": ["1361"]}
{"title": "Issues for the complex support of group decision situations\n", "abstract": " Issues for the complex support of group decision situations - SZTAKI Publication Repository SZTAKI Publication Repository MTA SZTAKI ELKH SZTAKI Eötvös Loránd Research Network Institute for Computer Science and Control Home About Browse Login Magyar Clear Cookie - decide language by browser settings Issues for the complex support of group decision situations Gelléri, P. and Bíró, M. and Danyi, P. and Martinez, F. (1993) Issues for the complex support of group decision situations. In: Proceedings of the third conference on artificial intelligence. Budapest, 1993. Full text not available from this repository. Item Type: Conference or Workshop Item (Paper) Subjects: Q Science > QA Mathematics and Computer Science > QA75 Electronic computers. Computer science / számítástechnika, számítógéptudomány Depositing User: Eszter Nagy Date Deposited: 11 Dec 2012 14:44 Last Modified: 11 Dec 2012 14:44 …", "num_citations": "1\n", "authors": ["1361"]}
{"title": "Factors influencing the design of a prototype decision support application for a distributed object management project\n", "abstract": " The development of decision support systems is motivated by socio-economic demand, and the opportunities offered by new hardware and software technologies. It goes without saying that these factors mutually stimulate each other as well. The purpose of this paper is to highlight some of the issues influencing the design of a prototype decision support application for a distributed object management project. Emphasis is put on features that are likely to gain widespread use since backed by mainstream companies. These are the role of deep knowledge processing tools, multimedia, and objectoriented approaches.", "num_citations": "1\n", "authors": ["1361"]}
{"title": "The interval subset sum problem\n", "abstract": " The transformation of bounded integer variables to binary ones has been considered as a solved problem for long. It is most of the time overlooked that the usual transformation is unacceptable in the case of the Knapsack problem. In this paper, all possible solutions to this problem are characterized. The characterization means that a newly defined decision problem (Interval Subset Sum) is poiynomialiy solvable. In addition the Subset Sum Search problem and a modification of the Kth Largest Subset problem are shown to be poiynomialiy solvable on the class of problems where the answerto the Interval Subset Sum question is “yes”.", "num_citations": "1\n", "authors": ["1361"]}
{"title": "CONDOR-GDSS: CONsensus Development and Operations Research tools Group Decision Support System.\n", "abstract": " The authors attempt to make the reader familiar with the group decision support concept and give a brief historical review of GDSS systems.", "num_citations": "1\n", "authors": ["1361"]}
{"title": "Graphical representations in DSS and resource constrained scheduling.\n", "abstract": " The purpose of this paper is twofold. On one hand it supports those opinions which argue for the necessity of investing more effort into the starting and the final phases of an operations research project, which are strongly related to user interface management. On the other hand a specific area, resource constrained scheduling is highlighted. First, questions related to the object-oriented representation of multiple resource constrained schedules are discussed. Second, it is shown that there are questions related to graphical representation that are mathematically as involved as questions related to other phases of an OR project. In particular, two graph theoretical problems (Interval Chromatic number and Graph Acyclic Orientability With Weighted Diameter K) are formulated and shown to be useful when constructing a graphical representation for a schedule.", "num_citations": "1\n", "authors": ["1361"]}
{"title": "Common Criteria for IT Security Evaluation-SPI Analogies\n", "abstract": " Analogies between complex systems are useful for helping those familiar with one of them to better understand the other one, and for establishing cost and resource effective unified systems. The principle is applied in this paper to the ISO/IEC 15408 (Common Criteria) IT Security Evaluation standard, software quality evaluation standards and the Capability Maturity Model Integration (CMMI â).", "num_citations": "1\n", "authors": ["1361"]}