{"title": "Systemic management of architectural decisions in enterprise architecture planning. four dimensions and three abstraction levels\n", "abstract": " This paper presents a process model for the management of architectural decisions in enterprise architecture planning. First, decisions are made at the enterprise level, with strategic business considerations on the enterprise information, systems and technology strategy and governance issues. The next step is to define the domains, to then go on with domain architecture decisions. At the systems level, the enterprise and domain architecture decisions are collected and converted into architecture descriptions accurate in precision, form and detail to be given as input to the information systems development process, following the architectural planning. The model is derived from previous work and empirical findings in three large organizations, where the enterprise architecture and enterprise systems have been developed. This case study contributes with considerations on the domains, their definition, and produces …", "num_citations": "150\n", "authors": ["1378"]}
{"title": "Managing information security in a business network of machinery maintenance services business–Enterprise architecture as a coordination tool\n", "abstract": " Today, technologies enable easy access to information across organizational boundaries, also to systems of partners in business networks. This raises, however, several complex research questions on privacy, information security and trust. The study reported here provides motivation and a roadmap for approaching integrated security management solutions in a business network of partners with heterogeneous information and communication technologies (ICT): Systems, platforms, infrastructures as well as security policies. Enterprise architecture (EA) is proposed as a means for comprehensive and coordinated planning and management of corporate ICT and the security infrastructure. The EA approach is proposed as a pre-requisite for transparent and secure inter-organizational information exchange and business process support crossing corporate boundaries. This study provides an example of security …", "num_citations": "116\n", "authors": ["1378"]}
{"title": "EA planning, development and management process for agile enterprise development\n", "abstract": " In this study, we suggest an enterprise architecture (EA) development process model suitable for EA projects limited in scope and time. Several EA process models have been put forward, which have in common the idea of comprehensive EA management and development that is generic, cyclic and ongoing in a user organization. The suggested models are of varying level of abstraction. It is not simple to select the right issues from them for a restricted development effort. An ICT services provider needs a process model to follow in EA consulting and development projects. This approach is also needed for incremental EA development by user organizations. Starting with the suggested EA process models and with findings in IS literature, we create a generic process model for EA management. Based on this model, and supported with a case study, we then develop a process model for discrete EA development …", "num_citations": "105\n", "authors": ["1378"]}
{"title": "A practical approach to EA planning and development: the EA management grid\n", "abstract": " Enterprise Architecture is gaining interest as a managerial tool for managing corporate ICT assets and their interplay. Our prior studies indicate that an ICT provider’s viewpoint on EA consulting, planning and development seems to be lacking in the proposed methodologies. Considering both literature and practical EA cases, we suggest an approach that supports restricted assignments in EA management. We present an EA Grid for the management of EA descriptions, requirements, constraints, as well as project tasks and deliverables, task preliminaries and dependencies in EA consulting and development.", "num_citations": "49\n", "authors": ["1378"]}
{"title": "Towards a contingency framework for engineering an enterprise architecture planning method\n", "abstract": " Enterprise architecture (EA) has a key role in managing and relating business strategies and processes, information systems, and IC technologies. EA planning devises an EA plan with development steps to make necessary enhancements to the current state of the affairs in EA. Accomplishing EA planning in a systematic and efficient manner requires the availability of frameworks and methods suitable to the situation at hand. The selection and adaptation of these methodical artifacts for the use of EA planning is often quite challenging in practice. We argue that the contingency approach can help in these activities of method engineering (ME), and present a contingency framework (named here EACon, EA Contingencies) for engineering an EA planning method. The framework is composed of three layers: the topmost layer pertains to a method engineering context, the next lower layer corresponds to an EA planning context, and the lowest layer stands for an EA development context. Due to the largeness of the framework, this paper focuses on the topmost layer. The contingency framework has been derived from ISD contingency factors, conceptualizations of the ME domain, EA critical success factors, and experience obtained from a large national project of engineering an EA planning method for state administration.", "num_citations": "39\n", "authors": ["1378"]}
{"title": "Enterprise architecture descriptions for enhancing local government transformation and coherency management: case study\n", "abstract": " Local governments cover multiple service sectors and are typically organized into diversified, deeply hierarchical organizations. Public services offered are tangible, mostly non-IT-critical, and heavily dependent on human resources. Information management is mainly manual in strategy and management processes. In this case study of a large Finnish local government organization, enterprise architecture (EA) is proposed as a tool for improving the coherency of the local government and its alignment to IT and other resources. We ask, what kind of EA descriptions local government agencies need for coherency management, and how to organize them. We apply action design research principles at the Kouvola City concern by adapting the Finnish Government EA Grid there. The business architecture is unfolded to evaluate the target state for a planned change. The results give new insights into transformation of the …", "num_citations": "28\n", "authors": ["1378"]}
{"title": "Evaluation of Enterprise IT Architecture Solutions–How can an ICT consultant tell what is best for you?\n", "abstract": " ICT has become a key business enabler and a competitive factor for enterprises. Enterprise architecture, developed by ICT consultants and ICT end-user organizations, is emerging as the management tool for intertwined business and IT planning. For managerial decisions, there is a need to evaluate the business value of architecture development results, but only a few models for this have so far been presented. Here we present the V-model for EA testing and validation that marks the evaluation points in EA management, and guides which evaluation tools could be used.", "num_citations": "19\n", "authors": ["1378"]}
{"title": "Enterprise architecture as a collaboration tool: discursive process for enterprise architecture management, planning and development\n", "abstract": " The information and communication technology (ICT) advancements change the role of ICT in organizational use to a central concern, since both business and public enterprises heavily depend on information systems and technological infrastructure. Management, planning and development of the organizational ICT are no more a task for the ICT experts only. The expertise of both business and ICT specialists is needed to align ICT deployment with organizational goals, ensuring appropriateness of related investments with respect to the enterprise resources. However, collaboration between the business and ICT communities of practice is perceived as a challenge. Enterprise architecture (EA) proposes a holistic approach to the management of organizational ICT systems and infrastructure.By structuring the collaboration, it interlinks the contributions from different communities of practice to the decision making process. From both IS and EA literature, a common framework of reference is derived and validated through practitioner experience. Distinct levels of abstraction in the framework accommodate the concerns of different decision makers: managerial overview for the whole enterprise, business operations management at the level of the activity domains, and the systems design and development concerns for the implementers. An understanding of the ICT management and planning in the context of a deploying organization is deduced as a prerequisite for an eligible EA methodology. An EA process meta-model is constructed to guide the overall EA process for well-informed strategies and decisions on the organizational ICT and, as well, for …", "num_citations": "17\n", "authors": ["1378"]}
{"title": "Key issues in enterprise architecture adoption in the public sector\n", "abstract": " This paper examines the challenges of enterprise architecture (EA) adoption in public sector organisations. So far, demonstrating the benefits of EA has appeared difficult in this context, and the results in transforming public sector remain modest: Both the penetration and the maturity of EA appear rather low. In the academia, however, the adoption of EA has gained less interest than the EA development and methodologies. Hence, there is a need for research on what are the challenges of EA adoption, and how to overcome them. This paper presents the results of an expert survey on the challenges of EA adoption in the Finnish public sector. The analysis of quantitative data, supported with a qualitative data, reveals three interrelated factors: Resistance towards EA, Relevant EA goals, and the EA practices in use. Managing the identified key issues classified in these three broad concepts would be the prerequisite for institutionalising EA and making it a legitimate practice. The findings extend the current knowledge of the public sector EA with practicable ideas how to increase the level of penetration and maturity.", "num_citations": "13\n", "authors": ["1378"]}
{"title": "The Gap between Strategies and Implementation–Methodic Support for EA Projects as a Bridge\n", "abstract": " This casestudyconductedwithin thefourthlargest European ICT services provider, TietoEnator, explores thearea ofEnterpriseArchitecture (EA) and methodologies for EA consulting and development. EA managementis gainingattention, as the importance ofinformation systems grows from restrictedinternalusetoan all-encompassing inter-organisationaluseatcustomerinterfaces and in supply chain management between business partners. This evolution of both businesses and information technology has created an immense challengeforICT suppliers attemptingtoprovide thefullscaleofservices fortoday‘s businesses. The diverseand complex information systems needed fortoday‘s enterprises make ICT managementa daunting task also to the business organisations themselves. ICT serviceproviders haverecognised thedemandforEA managementanddevelopment methodologies, as they serve their clients in …", "num_citations": "13\n", "authors": ["1378"]}
{"title": "Systems Approaches in the enterprise architecture field of research: a systematic literature review\n", "abstract": " This study explores the use of the systems approaches (systems thinking and systems theories) as the theoretical underpinnings for Enterprise Architecture (EA) research. Both the academic and the practitioner communities have maintained an interest in EA due to its potential benefits, promising for the recent technological and business advances. EA as a research area is, however, characterized by diversified views depicted in different definitions of the concept, and no acknowledged common theoretical foundation. A number of prior studies have noticed this gap in the EA field of research, and called for a strengthening of the theory of EA. Variegated systems approaches have been suggested as a theory base. The aim of this study is to examine if, and to what extent the systems approaches could provide a common theoretical foundation. We contribute with a systematic literature review on the state-of-art …", "num_citations": "12\n", "authors": ["1378"]}
{"title": "Selection criteria for enterprise architecture methods\n", "abstract": " This study proposes key selection criteria for enterprise architecture methods based on a case study of the Finnish National Enterprise Architecture (NEA). Enterprise Architecture (EA) planning is increasingly important as ICT is today a strategic business enabler. Enterprise Architecture is a managerial tool to align ICT with business development and a communication tool to ensure commitment and to prepare for organizational change. A multitude of EA methods have been proposed and some of them have also been adopted in practice. However, no market leaders or standard EA methods have emerged. The approaches of different EA methods vary, and their support for EA planning varies accordingly. Therefore, the EA method selection has substantial consequences for the organization. Evaluating and selecting the best suitable method is the highly important first step in EA planning initiatives. This case study collects evidence from a large EA method development project within a government ICT management program for the entire organization of the Finnish Government. The conducted requirements analysis for the EA method in this project as well as previous studies in EA and method development indicate that the most important criteria for EA method selection are related to the fundamental role of EA as a communication tool. Complexity and abstraction level of an EA method should strongly correlate with the EA experience of the future EA method users. We assume that these key requirements are common to most organizations, because they are related to the main purpose of the EA method and framework: communication. This study is …", "num_citations": "12\n", "authors": ["1378"]}
{"title": "User participation in consulting projects: client and provider role variations\n", "abstract": " This study presents a variation scheme of participation roles in consulting projects. Typical consulting assignments in the area known as IS planning involve strategic planning and information systems management, enterprise architecture, information management or information technology governance. Participation is a crucial issue in consulting on these issues. In the literature on participation, different roles and tasks have been found, but it is not always specified, on what types of projects or systems the results are based. The literature on consulting suggests some models for work division. In a two-phase qualitative study, we first collect possible tasks in ICT consulting projects, and then, based on further explorations, create a model for role variations in consulting. We compare roles suggested in the literature on participation and on consulting to our findings. The suggested variation model gives a common …", "num_citations": "9\n", "authors": ["1378"]}
{"title": "Defining complexity factors for the architecture evaluation framework\n", "abstract": " The design and implementation of telecommunication systems is an incremental and iterative process, and system architectures may need to be revised and refined several times during their lifetime. Formal evaluation facilitates the identification of the weak points, where improvements are due in these architectures. In the domain of telecommunications, such evaluation can be based on the Architecture Evaluation Framework (AEF). During the evaluation, a deep understanding of the processes within a system is needed. Meanwhile, the systems being designed are usually complex systems encompassing a large number of components with an intricate pattern of interaction between them. As a result, it is extremely difficult to understand, predict and control the behavior of such systems. Theoretical studies in the field of complex systems describe potential reasons of system complexity, and explain its possible …", "num_citations": "8\n", "authors": ["1378"]}
{"title": "Overview of telecom operator software market\n", "abstract": " Telecommunications is an essential enabler of modern societies and a global vertical industry, providing communication and information services, with its annual revenue of over trillion euros. In this book, a company providing these services is referred to as a telecom operator or communications service provider (CSP). CSPs create value by offering connectivity to and via an infrastructure of networks for transferring signals. The core business processes in a telecom operator company therefore revolve, on one hand, around physical networks and their maintenance, and on the other, managing their customers and their use of the connectivity services over the networks.               In the past, CSPs’ operations focused more on the development and management of network infrastructure. Eventually, as the need for standardization of the systems and operations became apparent, International Telecommunication …", "num_citations": "7\n", "authors": ["1378"]}
{"title": "Support for knowledge and innovations in software development–Community within company: Inner source environment\n", "abstract": " This case study considers a software development support portal adapted from open source developer communities into a company internal, so called inner-source development environment. With theoretical insights into knowledge management (KM) models, recent advancements in KM theory building, and observations of the inner source platform we make observations as regarding the KM approach and suggestions for its further development. Both technological and human components of KM are considered. The results of this study, can be generally applicable to the knowledge creation and innovation support in software development. We believe that many software companies are following the example and building virtual environments to support the knowledge processes and innovation in their activities. The case company, Nokia, is a pioneer in KM efforts for the software organization.", "num_citations": "7\n", "authors": ["1378"]}
{"title": "Collaborative EA information elicitation method: the IEM for business architecture\n", "abstract": " This study contributes to the enterprise architecture (EA) methodologies by suggesting a method for eliciting architecture requirements: gathering both the current architecture information, and the development needs and requirements for the business architecture (BA) dimension in EA planning. Most of all EA dimensions, the developing of the BA requires collaboration with various non-IT stakeholders. It presents thus challenges to the IT department, or the consultancy involved in EA related efforts. The contribution of the various stakeholder groups as informants is, however, crucial to well founded EA design decisions. The suggested method takes related IS development fields as starting points. Collaborative approaches are well established in the fields of requirements engineering and business process design. However, EA specific issues remain to be explicated and incorporated to the collaboration. A BA …", "num_citations": "6\n", "authors": ["1378"]}
{"title": "A root cause analysis method for preventing erratic behavior in software development: PEBA\n", "abstract": " Measures taken to prevent faults from being introduced or going undetected can secure development of highly reliable software systems. One such measure is analyzing root causes of recurring faults and preventing them from appearing again. Previous methods developed for this purpose have been reactive in nature and relied heavily on fault reporting mechanisms of ogranizations. Additionally, previous efforts lack a defined mechanism for innovating corrective actions. In this study, we strive to complement the existing methods by introducing a proactive and qualitative method that does not rely on fault data. During the course of the research, in addition to an extensive literature search, an empirical field study is conducted with representatives of companies active in safety-critical and business-critical domains. Our proposed method relies on identifying mismatches between development practices and …", "num_citations": "4\n", "authors": ["1378"]}
{"title": "The Profiles of Projects Supplied by a Full-Scale ICT-Services Provider.\n", "abstract": " The role of modern ICT-services providers has changed from easily defined system engineers to full-scale providers. The types, or profiles, of projects supplied by such providers are not very well understood. In this article a company specific analysis of a set of projects is presented. The analysis clarifies the types of projects and discusses the features of those types. Five distinctive profiles of projects were found excluding the maintenance. Some of the profiles were unexpected and seem to reflect the changing nature of the system engineering market. This change shows that changes to existing methodologies and new methodologies are required in order to offer proper methodological support for modern full-scale ICT-services providers.", "num_citations": "4\n", "authors": ["1378"]}
{"title": "An integrated model for evaluating ICT impact in the education domain\n", "abstract": " New technology enablers as the cloud computing paradigm, the Web 2.0 tools and learning games, seem to carry strong potential to tackle the challenges of the education sector: Employment market requires flexible competency development, social skills, lifelong learning, while public resources are diminishing. ICT and information management in educational institutions is a continuously developing area. New software and systems offered for the domain should be considered with a portfolio approach to systems and technologies. This paper investigates the questions of how to evaluate the value created with ICT, and how to assess the value of solutions proposed for the education sector. This requires research collaboration across disciplines, but also attending to the relevant bodies of knowledge both in pedagogy, didactics and institution management, but also, and to a greater extent, in ICT management and solution development. This paper investigates the possibilities to evaluate the value of ICT in education, taking as starting point existing evaluation models. These are adapted for the education domain, supported with case evidence from individual solutions (consisting of hard-and/or software) currently offered to educational institutions. These range from software applications to infrastructure solutions. A guiding frame for the impact evaluation is constructed for different stakeholders making decisions on ICT deployment. The research method, design science (DS) applied here, supports an effort that requires collaboration of different fields of research in both education and in information systems (IS). In this study, the reference discipline is …", "num_citations": "3\n", "authors": ["1378"]}
{"title": "ISURE: Report on implementation and validation of a standardized model for learning needs analysis and the provision of learning opportunities\n", "abstract": " This deliverable reports on prototypical implementation and validation of standardized models for learning needs, learning outcomes and learning opportunities.The report first (Section 2) introduces a study, analysis and discussion on learning needs for learners involved with higher education institutions. A survey with interviews was developed to give an initial understanding of the current practice of analysis of learning needs. The aim of this work was to draw a picture on how learners think of their own learning needs, and how learning opportunity designers see themselves as providing for learners' learning needs. Requirements for good practice on connecting learning needs and opportunities are discussed and the main requirement is that the overall process clearly needs to involve both the learner and the provider. The overall patterns visible in the responses suggested that there were two separate kinds of relevant learning opportunities, each with a different way of relating to differing learning needs. The first kind of learning is where a specific qualification is necessary in order for the learner to pursue his or her chosen career path. The second kind is where it is not a specific qualification, but a specific skill, competence, or set of skills that are perceived to be needed by the learner. In the first kind of learning, participants, made it explicit that the detailed learning outcomes were not significant, and did not play a part in the selection of the learning opportunity. Rather, other published factors, such as the location and cost of the learning opportunity, the hours required for attendance and learning opportunity work, the learning methods, were …", "num_citations": "3\n", "authors": ["1378"]}
{"title": "Identity and Access Management for Remote Maintenance Services in Business Networks\n", "abstract": " Access to information systems across corporate boundaries with high demands to privacy and trust result into ambitious research and development targets. This study provides motivation and a roadmap for approaching integrated security management solutions in a business network of partners with heterogeneous ICT and security infrastructures. We aim at describing specifics of identity and access management in inter-organizational collaboration, and a vision and arguments for identity and access management in a business network. A case study with Metso Paper, Inc., the leading manufacturer of paper machinery and related services, validates the results, thus providing a motivating example of the possibilities of e-services.", "num_citations": "3\n", "authors": ["1378"]}
{"title": "Organizational processes in ICT Management and Evaluation. Experiences with large organizations.\n", "abstract": " In this study, we describe the managerial and administrative processes relevant in the assessment of cost, efficiency and value of ICT support within and around an end user organisation. Systems of interdependent processes have been proposed to guide the management of ICT, without looking at the organizational activities, outcomes and interdependencies closer. The changed role of ICT in organizations’ activities does no more allow for isolated management of business and ICT domains. Despite of a lot of talk about business alignment of ICT, a permanent link between the mandates of business and IT management remains yet to be established, even in organisations well aware of their information management and the business alignment issue. In our study we found that appreciated approaches of IT governance, e.g. ITIL and CobIT, and Information Systems Management models could profit from a supplementing comprehensive, architectural view of the ICT in organizations and from an enterprise architecture management process. We attempt to clarify the concept with the results of a three-year project where client organisations of an ICT provider were looked at from an ICT architecture management point of view. As complementary data, we study narratives on organizations that have some success in joint business and ICT planning and management. A map of managerial processes, and a model for different areas of ICT evaluation are results of the study. The enterprise architecture concept can be seen as a shared platform to enable efficient joint management and development of business and ICT. To steer the organization towards …", "num_citations": "3\n", "authors": ["1378"]}
{"title": "The Actual Adoption and Use of Mobile Apps: The Case of a Higher Education Context\n", "abstract": " Mobile applications have gained wide acceptance in several sectors, including eCommerce and education. In higher education, mobile apps are being used not only for mobile learning but also for creating smart campus environments in which physical campuses are augmented with digital services. Mobile apps for smart campus initiatives usually have several features that students and educators are expected to adopt and use. However, although prior studies have investigated the adoption of mobile apps, most of such studies are on the user's intention to use or continue using mobile apps, leaving gaps in our understanding of how actual use occurs. Drawing on a case study of a mobile app for a smart campus in a university in Finland, this study unravels the factors that influence actual adoption and post-adoption use of mobile apps in higher education context, and how the influence occurs. The implications for research and practice are discussed.", "num_citations": "2\n", "authors": ["1378"]}
{"title": "Software Business in the Telecommunications Sector.\n", "abstract": " Operations and Business Support Systems (OSS/BSS) software of Communication Service Providers (CSP’s) can be developed internally within the CSP or acquired from a Software Vendor. The software industry lifecycle model hypothesizes that software development is internal in the beginning of the industry’s lifecycle, and that the share of external products increases when it matures. Empirical evidence shows signs of the OSS/BSS software industry approaching maturity. Current and future developments of the industry include the possibilities of utilizing the Software-as-a-Service (SaaS) model and Open Source software (OSSw). Both have gained increasing interest by the CSP’s. However, the relatively small markets (number of CSP’s), added with complex and proprietary interfaces of technology and software, seem to hinder this development. The results of scenarios on the future of the industry propose that the adoption of SaaS and OSSw could be motivated by general cost-cutting, by alliances within the industry or by a focus of CSP’s business on either providing network capacity or value-added services.", "num_citations": "2\n", "authors": ["1378"]}
{"title": "Software and Standards in an Emerging Domain\n", "abstract": " This paper considers the software market in the field of e-Learning and Technology Enhanced Learning (TEL) through observing standardization developments in the domain. A model of software market evolution suggests that observations on development and deployment of standards in the domain indicate the status on the market. As the model holds, in a mature phase, level of standardization is high and the number of competing standards low. The result of the study is, there appears to be a market, but a heterogeneous one, with hesitation on dominant designs and an overall modest level of standards adoption. Content standardization enables the (re)use of the learning content in multiple formats with diverse learning management systems (LMS), virtual learning environments (VLEs), learning platforms, HRM and administration systems. A number of initiatives to develop specifications or standards …", "num_citations": "2\n", "authors": ["1378"]}
{"title": "Evaluation of Enterprise IT Architecture Solutions: How Can An ICT Consultant Tell What Is Best for You?\n", "abstract": " ICT has become a key business enabler and a competitive factor for enterprises. Enterprise architecture, developed by ICT consultants and ICT end-user organizations, is emerging as the management tool for intertwined business and IT planning. For managerial decisions, there is a need to evaluate the business value of architecture development results, but only a few models for this have so far been presented. Here we present the V-model for EA testing and validation that marks the evaluation points in EA management, and guides which evaluation tools could be used.", "num_citations": "2\n", "authors": ["1378"]}
{"title": "Using Groupware Technologies to Facilitate Organisational Learning and Software Process Improvement–A Case Study\n", "abstract": " This paper provides suggestions for software process improvement with respect to communication and the use of groupware for distributed teams. The focus is on facilitating software improvement efforts from a bottom-up perspective, considering individual and team levels. The case study was conducted in a Finnish, rapidly growing software development company with activities at six locations. The utilisation and capabilities of electronic communication tools are analysed, and implications of their use to facilitate process improvement initiatives in a distributed development setting are evaluated. It was found that using a variety of communication tools can provide a learning organisational environment suitable for process improvement activities and facilitate in performing selected improvement practices.", "num_citations": "2\n", "authors": ["1378"]}
{"title": "Managing a Software Development Organization with a TQM Approach for Balance in a Period of Rapid Growth\n", "abstract": " Software organizations rely on quality models designed for their specific purposes, the Capability Maturity Model Integration (CMMI) being the most prominent model to follow. However, in striving for both product and process quality in their activities, small and medium sized enterprises with a limited legacy of organizational culture and tradition in quality work, may profit from quality frameworks following the Total Quality Management (TQM) principles. The ISO quality standards (the 9000 series) provide such principles. A further framework suggested by the European Forum for Quality Management (EFQM) also gives a set of principles to follow. In a case study, we investigate how the principles of the EFQM model can be translated into practical use in a relatively young but rapidly growing software company. We suggest a “double bladed” quality tool to be used by small and medium sized software organizations …", "num_citations": "1\n", "authors": ["1378"]}