{"title": "Healthcare data breaches: Insights and implications\n", "abstract": " The Internet of Medical Things, Smart Devices, Information Systems, and Cloud Services have led to a digital transformation of the healthcare industry. Digital healthcare services have paved the way for easier and more accessible treatment, thus making our lives far more comfortable. However, the present day healthcare industry has also become the main victim of external as well as internal attacks. Data breaches are not just a concern and complication for security experts; they also affect clients, stakeholders, organizations, and businesses. Though the data breaches are of different types, their impact is almost always the same. This study provides insights into the various categories of data breaches faced by different organizations. The main objective is to do an in-depth analysis of healthcare data breaches and draw inferences from them, thereby using the findings to improve healthcare data confidentiality. The study found that hacking/IT incidents are the most prevalent forms of attack behind healthcare data breaches, followed by unauthorized internal disclosures. The frequency of healthcare data breaches, magnitude of exposed records, and financial losses due to breached records are increasing rapidly. Data from the healthcare industry is regarded as being highly valuable. This has become a major lure for the misappropriation and pilferage of healthcare data. Addressing this anomaly, the present study employs the simple moving average method and the simple exponential soothing method of time series analysis to examine the trend of healthcare data breaches and their cost. Of the two methods, the simple moving average method …", "num_citations": "48\n", "authors": ["251"]}
{"title": "User experience framework that combines aspects, dimensions, and measurement methods\n", "abstract": " Successful software products necessitate users’ satisfaction when experiencing the use of the software. This is not only determined by the software functionalities and completeness, but also with the overall user experience when using the software product. Although user experience is widely adopted by practitioners and in industry, there is no scientific consensus on a definition or a theoretical model of UX. The dynamic nature of user experience is challenging both UX design and evaluation activities. Accordingly, further research is needed to study four non-orthogonal UX issues: definition, modeling, method selection, and the interplay between evaluation and development. Moreover, UX professionals need to identify means for compromising the difficulties of evaluating UX in a holistic manner. The purpose of this research is to consolidate the findings related to UX aspects and dimensions along with the identified …", "num_citations": "43\n", "authors": ["251"]}
{"title": "Evaluating the impact of blockchain models for secure and trustworthy electronic healthcare records\n", "abstract": " Blockchain technology is among the most significant developments and revolutionary innovations of the Information Technology industry. It corners a crucial space in the present digital era and has already made significant differences in human life. Moreover, it is anticipated that the Blockchain technology will improvise the existing IT facilities in the next several years in many domains. Recent technological developments are allowing for a major advancement in Healthcare sectors. Information security and accessibility are critical considerations for the integration and communication with Electronic Healthcare Record (EHR) systems when sharing private medical information. In this context, selecting the most effective blockchain model for secure and trustworthy EHRs in the healthcare sector requires an accurate mechanism for evaluating the impact of different available blockchain models for its features. The present …", "num_citations": "30\n", "authors": ["251"]}
{"title": "Online integrity and authentication checking for Quran electronic versions\n", "abstract": " The ability to control data and information through the Internet can be challenging. Preliminary analysis showed that some tampering and forgery may occur to some words of the Quran in the electronic versions that span the Internet. Such small modifications may not be noticed by public audience. The holy book of Quran includes a unique feature in that its worldwide copies are all identical. The 114 chapters (Suras) and all their verses and words are preserved in the exact form. As such, we designed and evaluated a model and a tool to evaluate the integrity of the wording in the e-versions of the Quran through generating a Meta data related to all words in the Quran preserving the counts and locations. Such Meta data can be used in the same way hash algorithms are used in security to check the integrity of a disk and its data files where any small change in the data will result in a different hash value. We …", "num_citations": "26\n", "authors": ["251"]}
{"title": "SECDEP: Software engineering curricula development and evaluation process using SWEBOK\n", "abstract": " Context: Software engineering (SE) has a multidisciplinary and dynamic nature that makes it challenging to design its educational material. Guide to the software engineering body of knowledge (SWEBOK) which has evolved to become ISO/IEC 19759 standard has identified various knowledge areas to be part of any SE curricula. Although there is a number of studies that address the gap between SE curricula and software industry, the literature lacks defining a process that can be leveraged for continuously improving SE curricula to fulfill the software development market demands.Objective: In this paper, we propose a Software Engineering Curricula Development and Evaluation Process (SECDEP) that takes advantage of the SWEBOK guidelines to improve the quality of SE programs based on objective and subjective evidences.Method: Our process consists of multi-steps in which the local software market …", "num_citations": "26\n", "authors": ["251"]}
{"title": "A Research on DevOps Maturity Models\n", "abstract": " Despite the big number of software process models currently available which have been used and practiced for many years, we could not till now totally solve the problem of projects’ late submissions! Meanwhile Software have constantly become bigger, more complex, and require high quality. A recently developed model, called DevOps, aims at producing fast and high-quality releases by bringing the development and operation team to work together. Unfortunately, DevOps is still lacking a clear definition as well as empirical studies that document the experience in implementing and enhancing it. Maturity models are used as a tool to assess the effectiveness of an organizational processes on adopting certain practices and identify what capabilities they need to acquire next in order to improve their performance and reach higher maturity level. However, there are few DevOps maturity models which have been emerged as means to assess DevOps adopted practices. This research aims to identify and benchmark the DevOps maturity models available in literature. We were able to identify several maturity models and compare among them.", "num_citations": "14\n", "authors": ["251"]}
{"title": "Building an Islamic financial information system based on policy managements\n", "abstract": " For many banks and customers in the Middle East and Islamic world, the availability and the ability to apply Islamic Shariah rules on financial activities is very important. In some cases, business and technical barriers can limit the ability to apply and offer financial services that are implemented according to Shariah rules.In this paper, we discuss enforcing Shariah rules from information technology viewpoint and show how such rules can be implemented and enforced in a financial establishment. Security authorization standard XACML is extended to consider Shariah rules. In this research XACML architecture, that is used and applied in many tools and system architectures, is used to enforce Shariah rules in the banking sector rather than its original goal of enforcing security rules where policy management systems such as XACML are usually used.We developed a model based on XACML policy management to …", "num_citations": "14\n", "authors": ["251"]}
{"title": "Estimating the size of Arabic indexed web content\n", "abstract": " Various initiatives designed to increase Arabic Web content have been undertaken in recent years, and now search engines are reporting that the Arabic portion of Web content has grown relative to the overall Web content. An accurate estimate of Arabic Web content is crucial for those interested in studying it and enriching it. In this paper, we propose a statistics-based system to estimate the size of Arabic indexed Web content using three popular search engines; Google, Yahoo and Bing. Our system relies on selecting sample words from an Arabic corpus to estimate the size of the Arabic Web content indexed by the search engines and the overlap among them. We have used Arabic Wikipedia as a corpus, as it provides diversified content accessed by a large number of Internet users. Our results show that, as of December 2010, the size of the Arabic indexed Web content was estimated at 2 to 2.1 billion pages …", "num_citations": "13\n", "authors": ["251"]}
{"title": "Cybersecurity programs in Saudi Arabia: issues and recommendations\n", "abstract": " Many countries worldwide are integrating the internet and web technologies into their social, educational, economic and military systems. Connecting to the cyber world is growing exponentially. With software systems suffering from various vulnerabilities that can affect our privacy and availability of systems, we, at all levels, are struggling to maintain our cybersecurity, availability, and confidentiality. Education has been always seen as the cornerstone to provide the industry with professionals at all levels. With the immense market needs for cybersecurity professionals, the need for new educational cybersecurity programs is evolving. In this path, NICE Cybersecurity education framework has been introduced recently. In this paper, we explore the cybersecurity programs in the Arabic region and particularly in Saudi Arabia in the scope of NICE and provide some recommendations.", "num_citations": "12\n", "authors": ["251"]}
{"title": "Modularity measurement and evolution in object-oriented open-source projects\n", "abstract": " Throughout the software evolution, several maintenance actions such as adding new features, fixing problems, improving the design might negatively or positively affect the software design quality. Quality degradation, if not handled in the right time, can accumulate and cause serious problems for future maintenance effort. In this work, we study the modularity evolution of two open-source systems by answering two main research questions namely: what measures can be used to measure the modularity level of software and secondly, did the modularity level for the selected open source software improves over time. By investigating the modularity measures, we have identified the main measures that can be used to measure software modularity. Based on our analysis, the modularity of these two systems is not improving over time.", "num_citations": "9\n", "authors": ["251"]}
{"title": "Does software structures quality improve over software evolution? Evidences from open-source projects\n", "abstract": " Throughout the software evolution, several maintenance actions such as adding new features, fixing problems, improving the design might negatively or positively affect the software design quality. Quality degradation, if not handled in the right time, can accumulate and cause serious problems for future maintenance effort. Several researchers considered modularity as one of the success factors of Open Source Software (OSS) Projects. The modularity of these systems is influenced by some software metrics such as size, complexity, cohesion, and coupling. In this work, we study the modularity evolution of four open-source systems by answering two main research questions namely: what measures can be used to measure the modularity level of software and secondly, did the modularity level for the selected open source software improves over time. By investigating the modularity measures, we have identified the main measures that can be used to measure software modularity. Based on our analysis, the modularity of these two systems is not improving over time. However, the defect density is improving over time.", "num_citations": "8\n", "authors": ["251"]}
{"title": "An empirical study of bad smells during software evolution using designite tool\n", "abstract": " Bad smells are not uncommon in software systems. Such problems arise as a result of incomplete, inconsistent or incorrect requirements followed, accordingly, by bad design decisions which travel to the construction phase ending up with malfunctioning software. Such problems are expected to be handled and resolved during the evolution of the software which may result in more complicated systems that are difficult to maintain, and the software starts aging. Various tools are available to help in uncovering, analyzing, and visualizing various bad smells. Once the bad smells are uncovered, a remedial action should be taken such as refactoring. One of the new tools to detect and measure a big number of bad smells is Designite. In this paper, the authors have used Designite to analyze six open source systems and see if bad smells are resolved while software is evolving or systems keep stinking. They found that …", "num_citations": "6\n", "authors": ["251"]}
{"title": "Process improvement in governmental agencies: Toward CMMI certification\n", "abstract": " Software process improvement (SPI) approaches are highly mature within both product and service development enterprises. Among SPI approaches, particularly within large enterprises, CMMI is widely used and demonstrated its influence in leading the application of performance improvement methods in industry. In this paper, we test the readiness of government agencies by conducting internal CMMI appraisals on two selected government agencies. Using CMMI as a benchmark, we aim to determine how well do these agencies apply sound processes. We chose a sample of two large organizations from Saudi Arabia, a young but fast growing software market. We found that process areas such as requirements development, technical solution, configuration management, and verification follow well-defined processes with some areas of weaknesses. While both agencies have very limited knowledge of process …", "num_citations": "5\n", "authors": ["251"]}
{"title": "Online banking security and usability-towards an effective evaluation framework\n", "abstract": " Convenience and the ability to perform advanced transactions encourage banks clients to use online banking. As security and usability are two growing concerns for online banking users, banks have invested heavily in improving their web portals security and user experience and trust in them. Despite considerable efforts to evaluate particular security and usability features in online banking, a dedicated security and usability evaluation framework that can be used as a guide in online banking development remains much less explored. In this work, we first extract security and usability evaluation metrics from the conducted literature review. We then include several other evaluation metrics that were not previously identified in the literature. We argue that the proposed online banking security and usability evaluation frameworks in the literature in addition to the existing standards of security best practices (eg, NIST and ISO) are by no means comprehensive and lack some essential and key evaluation metrics that are of particular interest to online banking portals. In order to demonstrate the inadequacy of existing frameworks, we use some frameworks to evaluate five major banks. The evaluation reveals several shortcomings in identifying both missing or incorrectly implemented security and privacy features. Our goal is to encourage other researchers to build upon our work.", "num_citations": "5\n", "authors": ["251"]}
{"title": "On the relationship between software complexity and security\n", "abstract": " This work aims at discussing the complexity aspect of software while demonstrating its relationship with security. Complexity is an essential part of software; however, numerous studies indicate that they increase the vulnerability of the software systems and introduce bugs in the program. Many developers face difficulty when trying to understand the complex components of software. Complexity in software increases when objects in the software are used to design a more complex object while creating a hierarchical complexity in the system. However, it is necessary for the developers to strive for minimum complexity, as increased complexity introduces security risks in the software, which can cause severe monetary and reputational damage to a government or a private organization. It even causes bodily harm to human beings with various examples found in previous years where security breaches led to severe consequences. Hence it is vital to maintain low complexity and simple design of structure. Various developers tend to introduce deliberate complexities in the system so that they do not have to write the same program twice; however, it is getting problematic for the software organizations as the demands of security are continually increasing.", "num_citations": "4\n", "authors": ["251"]}
{"title": "Software vulnerabilities detection based on security metrics at the design and code levels: empirical findings\n", "abstract": " Vulnerabilities detection using source code metrics, such as size and complexity, has been studied thoroughly in the literature. Few studies are concerned in detecting vulnerabilities during the software design phase before implementing the solution. Most of the research in the literature is interested in studying software vulnerabilities at the code level. Less research work has considered the architectural metrics to predict security vulnerabilities. Hence, in this paper, we try to consider the main metrics of software architecture in conjunction with the popular code level metrics to study software vulnerabilities and the relationship among these metrics. The literature has been reviewed to identify various security metrics to be used in studying nine common Java libraries. Understand and SonarCube tools are used to collect metrics of the specified libraries, The WEKA tool is used to apply the ReliefF algorithm, a feature selection algorithm, to decide which of the specified metrics are good predictors of software vulnerability.We investigated whether software design metrics can be used in predicting vulnerable classes, and guide actions for code improvement, hence can help development team to prioritize validation and verification efforts. We found that metrics like Number of Children (NOC), Count of Base Classes (CBC), Response for a Class (RFC), Coupling Between Objects (CBO), Lines of Code (LOC) and McCabe’s Cyclomatic Complexity are good vulnerabilities’ predictors.", "num_citations": "4\n", "authors": ["251"]}
{"title": "Design and implementation of lightweight software process assessment methods: Survey of best practices\n", "abstract": " Design and implementation of lightweight software process assessment methods : survey of best practices - Espace ÉTS ENGLISH Logo La vitrine de diffusion des publications et contributions des chercheurs de l'ÉTS RECHERCHER Se connecter Accueil Déposer Nouveautés Recherche Repérage À propos Conditions d'utilisation Politique de dépôt Mémoires et thèses Nous joindre Design and implementation of lightweight software process assessment methods : survey of best practices Zarour, Mohammad, Abran, Alain, Desharnais, Jean-Marc et Buglione, Luigi. 2010. « Design and implementation of lightweight software process assessment methods : survey of best practices ». In 10th International Conference on Process Improvement and Capability Determination (SPICE) (Pisa, Italy, May 19-20, 2010) p. 39-50. Compte des citations dans Scopus : 4. Le plein texte de ce document n'est pas hébergé sur ce . dans l…", "num_citations": "4\n", "authors": ["251"]}
{"title": "Ensuring data integrity of healthcare information in the era of digital health\n", "abstract": " Data integrity continues to be a persistent problem in the current healthcare sector. It ensures that the data is correct and has not even in any manner been improperly changed. Incorrect data might become significant health threats for patients and a big responsibility for clinicians, resulting in problems such as scam, misconduct, inadequate treatment and data theft. This sort of endangering scenario causes tremendous difficulty in handling healthcare data. This research intends to describe the threat plot of data integrity in healthcare through numerous attack statistics from around the world and Saudi Arabia and identify the criticality in Saudi Arabia in particular. A literature review by descriptive analysis, unit analysis and rating analysis to achieve the planned systematic literature review goal is outlined. The outcome of ranking analysis using a fuzzy analytical hierarchy process methodology offers a route for Saudi …", "num_citations": "3\n", "authors": ["251"]}
{"title": "Software Security Specifications and Design: How Software Engineers and Practitioners Are Mixing Things up\n", "abstract": " Huge numbers of worldwide-deployed software suffer from poor quality and possess vulnerabilities with serious impact. Meanwhile, people are using such software to save and manage their valuable information including their monetary data. This has increased the hackers' appetite to attack software. Henceforth, researchers and practitioners are convinced that software security is not an added value or a gold-plating need. Consequently, security requirements specification and implementation become vital during the software development process. Unfortunately, researchers and practitioners are doing so in a rush. This has made them mix concepts and practices up in a way that can terribly make the problem of delivering software overdue more chronic which will result in a security and technical debt. This research represents a corrective study that sheds light on what has been achieved in analyzing and …", "num_citations": "3\n", "authors": ["251"]}
{"title": "Using Categorical features in mining bug tracking systems to assign bug reports\n", "abstract": " Most bug assignment approaches utilize text classification and information retrieval techniques. These approaches use the textual contents of bug reports to build recommendation models. The textual contents of bug reports are usually of high dimension and noisy source of information. These approaches suffer from low accuracy and high computational needs. In this paper, we investigate whether using categorical fields of bug reports, such as component to which the bug belongs, are appropriate to represent bug reports instead of textual description. We build a classification model by utilizing the categorical features, as a representation, for the bug report. The experimental evaluation is conducted using three projects namely NetBeans, Freedesktop, and Firefox. We compared this approach with two machine learning based bug assignment approaches. The evaluation shows that using the textual contents of bug reports is important. In addition, it shows that the categorical features can improve the classification accuracy.", "num_citations": "3\n", "authors": ["251"]}
{"title": "Empirical Investigation of Factors that Hamper Pursuing Software Process Improvement: Analyses of Saudi Practitioners' Views\n", "abstract": " Software product quality is affected by the quality of the process used to develop it. Improving process quality helps software organizations in developing better software products on time and within budget. To achieve these benefits, software organizations are becoming more interested to pursue Software Process Improvement (SPI) initiatives. The failure in pursuing such initiatives is affected by several factors. The literature reports many studies that document different factors impacting the success of SPI initiatives. Very few of these studies have been conducted in the Middle East and particularly in Saudi Arabia. In this study, we report the results of a survey-based empirical study that identify factors that hamper the SPI initiatives conducted by 26 organizations located in Saudi Arabia. A survey has been sent to various organizations. Responses have been collected and analyzed. Results from the literature review and from our survey have been synthesized and presented in this study along with a comparative analysis of similar factors reported in similar studies worldwide. Knowing, prioritizing and understanding these factors can help both researchers and software development organizations avoid them to successfully plan and execute SPI initiatives.", "num_citations": "2\n", "authors": ["251"]}
{"title": "Using DEMATEL for Contextual Learner Modelling in Personalised and Ubiquitous Learning\n", "abstract": " With the popularity of e-learning, personalization and ubiquity have become important aspects of online learning. To make learning more personalized and ubiquitous, we propose a learner model for a query-based personalized learning recommendation system. Several contextual attributes characterize a learner, but considering all of them is costly for a ubiquitous learning system. In this paper, a set of optimal intrinsic and extrinsic contexts of a learner are identified for learner modeling. A total of 208 students are surveyed. DEMATEL (Decision Making Trial and Evaluation Laboratory) technique is used to establish the validity and importance of the identified contexts and find the interdependency among them. The acquiring methods of these contexts are also defined. On the basis of these contexts, the learner model is designed. A layered architecture is presented for interfacing the learner model with a query-based personalized learning recommendation system. In a ubiquitous learning scenario, the necessary adaptive decisions are identified to make a personalized recommendation to a learner.", "num_citations": "1\n", "authors": ["251"]}
{"title": "DEVOPS PROCESS MODEL ADOPTION IN SAUDI ARABIA: AN EMPIRICAL STUDY\n", "abstract": " Nowadays, IT organizations are not seeing DevOps as a competitive advantage or added value, but how can organizations survive if not adopting it? Many software development organizations are adopting DevOps software processes to foster better collaboration between development and operation teams, to improve the software development process’s quality and efficiency; therefore, it's very important to measure the adoption of DevOps by these organizations. Maturity models are used as a tool to assess the effectiveness of organizational processes on adopting certain practices and identify what capabilities they need to acquire next to improve their performance and reach a higher maturity level. Few DevOps maturity models have, recently, emerged as a means to assess DevOps adopted practices. This research aims to conduct an empirical field study to assess the DevOps adoption level in seven Saudi organizations using one of the published DevOps maturity models; namely, the Bucena model. The findings show that the adoption of DevOps in the surveyed Saudi organizations is promising; despite that, some factors related to DevOps culture, process and technology are weak and need more attention to enhance them to achieve better performance and continuous delivery.", "num_citations": "1\n", "authors": ["251"]}
{"title": "DevOps Development Process Awareness and Adoption -The Case of Saudi Arabia\n", "abstract": " Software development success depends on various factors, one of which is the adopted software process. Although the focus in software engineering is to engineer the development process in a way that guarantees higher process and product quality, the focus has recently been shifted toward extending the software process to consider other phases from the business process such as delivery and integration in what is known as DevOps. As the culture of doing business in general and developing software, in particular, varies across the world, it becomes interesting to report and discuss local experiences in different regions. Such reporting in the Information Technology (IT) domain is scarce in the literature, which will provide researchers with fertile resources to have a closer look at the cultural issues and how they affect the development process. This paper is focusing on exploring the Saudi IT organizations which …", "num_citations": "1\n", "authors": ["251"]}
{"title": "Google N-Gram Viewer does not Include Arabic Corpus! Towards N-Gram Viewer for Arabic Corpus\n", "abstract": " Google N-gram viewer is one of those newly published Google services. Google archived or digitized a large number of books in different languages. Google populated the corpora from over 5 million books published up to 2008. This Google service allows users to enter queries of words. The tool then charts time-based data that show the frequency of usage of query words. Although Arabic is one of the top spoken language in the world, Arabic language is not included as one of the corpora indexed by the Google n-gram viewer. This research work discusses the development of large Arabic corpus and indexing it using N-grams to be included in Google N-gram viewer. A showcase is presented to build a dataset to initiate the process of digitizing the Arabic content and prepare it to be incorporated in Google N-gram viewer. One of the major goals of including Arabic content in Google N-gram is to enrich Arabic public content, which has been very limited in comparison with the number of people who speak Arabic. We believe that adopting Arabic language by Google N-gram viewer can significantly benefit researchers in different fields related to Arabic language and social sciences.", "num_citations": "1\n", "authors": ["251"]}
{"title": "The use of evaluation theory and square standards to develop user needs experience evaluation method\n", "abstract": " Introduction: Technology is changing the way we used to live. Software applications including mobile applications are widely spread nowadays. The increased competitive advantage in application industry gradually led to increasing the challenges in dealing with growing user requirements as well as their demand for high quality. In order to survive in the highly competitive market, the software development companies should not only work to satisfy user requirements but also seek to satisfy user experience. Accordingly, studying, measuring and improving user experience is crucial for the success of any software product.Method: This research focuses on evaluating user experience needs by developing user experience needs evaluation method based on three main disciplines: the user experience framework, the evaluation theory concept and the SQuaRE standards in ISO/IEC 25022 and ISO/IEC 25023. Although these disciplines are available in the literature, they are not linked together to complete the mosaic picture of developing a UX evaluation methods. Linking these three disciplines led to systematically identify the necessary evaluation criteria to evaluate user needs experience. Results: A user experience needs evaluation method is developed in this paper and used to conduct a case study to evaluate user needs experience of a mobile application. Conclusion: Using the evaluation theory, UX frameworks and the SQuaRE standard to develop UX evaluation method was very useful. The proposed user experience needs evaluation method is promising to evaluate various software applications including mobile applications. More …", "num_citations": "1\n", "authors": ["251"]}
{"title": "Incorporating Arabic Corpus into Google N-gram Viewer: Initial Results\n", "abstract": " Google N-gram Viewer is a graphing tool that charts time-based data to show the frequency of usage of words or phrases. The tool is based on a large dataset from books collected by Google from open sources. Although Arabic is the fifth spoken language in the world with speakers more than French, German, Russian and Italian languages, unfortunately, Arabic language is not included as one of the corpora indexed by the Google n-gram viewer. This paper illustrates the possibility of building a big Arabic corpus and indexing it to be included in Google N-gram viewer. A case study is presented to build a dataset to initiate the process of digitizing the Arabic content and prepare it to be incorporated in Google N-gram viewer. One of the major goals of including Arabic content in Google N-gram is to enrich Arabic public content which has been very limited in comparison with the size of Arabic speakers. We believe that adopting Arabic language by Google N-gram viewer can significantly benefit researchers in different fields related to Arabic language and its speakers’ history.", "num_citations": "1\n", "authors": ["251"]}