{"title": "Learning scrum by doing real-life projects\n", "abstract": " Being Scrum the agile software development framework most commonly used in the software industry, its applicability is attracting great attention to the academia. That is why this topic is quite often included in computer science and related university programs. In this article, we present a course design of a Software Engineering course where an educational framework and an open-source agile project management tool were used to develop real-life projects by undergraduate students. During the course, continuous guidance was given by the teaching staff to facilitate the students' learning of Scrum. Results indicate that students find it easy to use the open-source tool and helpful to apply Scrum to a real-life project. However, the unavailability of the client and conflicts among the team members have negative impact on the realization of projects. The guidance given to students along the course helped identify five …", "num_citations": "16\n", "authors": ["2006"]}
{"title": "Reserved, on demand or serverless: Model-based simulations for cloud budget planning\n", "abstract": " Cloud computing providers offer a variety of pricing models, complicating the client decision, as no single model is the cheapest in all scenarios. In addition, small to medium-sized organizations frequently lack personnel that can navigate the intricacies of each pricing model, and as a result, end up opting for a sub-optimal strategy, leading to overpaying for computing resources or not being able to meet performance goals. In this paper, we: (1) present the results of a study that shows that, in Ecuador, a considerable percentage of companies choose conservative pricing strategies, (2) present a case study that shows that the conservative pricing strategy is suboptimal under certain workloads, and (3) propose a set of models, a tool and a process that can be used by tenants to properly plan and budget their cloud computing costs. Our tool is based on M (t)/M/* queuing theory models and is easy to configure and use …", "num_citations": "13\n", "authors": ["2006"]}
{"title": "Estudio estadístico exploratorio de las empresas desarrolladoras de software asentadas en Guayaquil, Quito y Cuenca\n", "abstract": " Con el objetivo de conocer las características más relevantes de las empresas desarrolladoras de software, se administró un cuestionario de 31 preguntas a 77 de las 160 empresas ubicadas en las tres ciudades más pobladas del Ecuador. Para probar su validez de contenido, se trabajó con un grupo de expertos en el área de computación quienes asesoraron para una adecuada orientación de las preguntas. Para verificar la confiabilidad del cuestionario, se utilizó el coeficiente Alfa de Cronbach estandarizado, considerando que las preguntas son de distintas escalas, obteniéndose un 82, 36% de confiabilidad en el instrumento. Los resultados indican que en Quito se encuentra la mayoría de estas empresas (61, 1%). En general, las empresas se dedican al desarrollo y venta de software y en menor medida a consultorías/auditorias informáticas. Existe un número reducido de empresas grandes, siendo éstas las que más exportan los productos de software desarrollado. El principal mercado objetivo lo constituyen los sectores comercial y financiero a nivel nacional. La mayoría de las empresas conocen la existencia de normas de calidad internacionales; sin embargo, utilizan sus propios métodos que los han desarrollados en base a la experiencia acumulada. A la fecha del estudio, tan solo cinco empresas cuentan con certificación ISO9001-2000.Los resultados obtenidos en el presente estudio evidencian una falta de preparación de este sector productivo para afrontar apropiadamente la apertura del libre comercio entre las Américas, ALCA. Se presentan tablas y gráficos que reflejan la realidad de la industria del software en el Ecuador.", "num_citations": "12\n", "authors": ["2006"]}
{"title": "A survey of agile software development methodologies in Ecuador\n", "abstract": " Agile methodologies have been increasingly used in software development projects worldwide. However, there is little information about the adoption of these methodologies in Latin America. In this paper, we present a study conducted in Ecuador about the use, usefulness and causes of stop using agile methodologies in medium and large organizations. The results show that a considerable percentage of professionals do not receive formal training before adopting agile methodologies, and that a high percentage of organizations, especially public, decide to abandon its use. However, private companies from the Banking sector are the ones that keep using agile.", "num_citations": "8\n", "authors": ["2006"]}
{"title": "Aplicación de Scrum en la construcción de un simulador de Redis\n", "abstract": " Este artículo expone un caso de estudio sobre cómo la metodología Scrum puede ser aplicada en proyectos científicos, específicamente un simulador Redis. Los resultados de este estudio, en conjunto con la experiencia profesional de quienes participaron en el proyecto, permitieron establecer diferencias de la aplicabilidad de Scrum en dos tipos de proyectos: desarrollo de aplicaciones para empresas y desarrollo de aplicaciones científicas para la academia. La contribución de este artículo se basa en presentar dichas diferencias. Más casos de estudio son requeridos para confirmar el conjunto de diferencias que fueron identificadas de forma empírica.", "num_citations": "7\n", "authors": ["2006"]}
{"title": "Application of formal methods to verify business processes\n", "abstract": " Formal specifications and modeling languages can be used to provide support for Business Process (BP) analysts and designers to verify the behavior of BPs with respect to business performance indicators (i.e., service time, waiting time or queue size). This article presents the application of the Timed Automata (TA) formal language to check BPs modeled with Business Process Model and Notation (BPMN) using the model checking verification technique. Also, a set of transformation rules and two algorithms are introduced to obtain TA-networks from BPMN models, allowing the formal specification of a BP-task model equivalent to the BPMN model. The approach presented here contributes to conduct the qualitative analysis of BPMN models.", "num_citations": "5\n", "authors": ["2006"]}
{"title": "Formal verification of business processes as timed automata\n", "abstract": " Despite the representation of a business process (BP) with Business Process Model and Notation (BPMN) can provide support for business designers, BPMN models lack of a formal semantics to conduct qualitative analysis. In this work, we describe the use of timed automata (TA) formal language to check BPs modelled with BPMN using the model checking verification technique. Two algorithms are introduced to transform a BPMN model into TA to obtain the formal specification of a BP-task model tantamount to a BPMN model. Our approach allows business analysts and designers to perform evaluation of BPMN models with respect to business performance indicators (e.g., service time, waiting time or queue size) derived from business needs. Our approach also incorporates the UPPAAL MC tool, as it is shown in an instance of an enterprise-project.", "num_citations": "4\n", "authors": ["2006"]}
{"title": "Linguistic profiles on microblogging platforms to characterize political leaders: the ecuadorian case on twitter\n", "abstract": " Social interaction on microblogging platforms is becoming a reliable instrument for studying political communication characteristics. Microblogging platforms, such as Twitter, let citizens to engage in the political debate generating well-defined profiles in the platform. Using publicly available tweets it is possible to build a linguistic profile to compare leaders and average citizens. We describe the linguistic analysis of 330,000 tweets collected from 221 Ecuadorian tweeters classified into three different profiles: political leaders, leaders' followers, and average local users. We build a feature vector for each user's tweets using 12 psychological dimensions included in the LIWC (Linguistic Inquiry Word Count) text analysis software and compare users with different profiles using those vectors. Our findings show that the leaders group exhibits a different linguistic profile from the others two groups: around 30% of leader …", "num_citations": "4\n", "authors": ["2006"]}
{"title": "Towards the evaluation of open educational resources for learning software engineering\n", "abstract": " Educational resources have been around for quite some time; yet, the growing of internet and the development of information technologies have contributed to their evolution and massive distribution. The present work is in an initial state of a larger-scope project that aims to identify, classify and evaluate open educational resources (OER) useful for self or guided learning of software engineering topics. As a result, a list of OERs addressing topics like requirements, planning, design, testing and refactoring was developed. Moreover, a set of criteria for evaluating such OERs is also proposed for choosing valuable resources, suitable for university courses or training programs. The methodology used in this study can be applied to other OERs and even other disciplines.", "num_citations": "4\n", "authors": ["2006"]}
{"title": "Canny edge detection in cross-spectral fused images\n", "abstract": " SUAREZ, Patricia and VILLAVICENCIO, Mónica. Canny Edge Detection in Cross-Spectral Fused Images. Enfoque UTE [online]. 2017, vol. 8, suppl. 1, pp. 16-30. ISSN 1390-6542. https://doi. org/10.29019/enfoqueute. v8n1. 127.", "num_citations": "3\n", "authors": ["2006"]}
{"title": "Development of a framework for the education of software measurement in software engineering undergraduate programs\n", "abstract": " Software measurement programs are hardly adopted in organizations and there is a lack of attention to software measurement in higher education. This research work aims at creating the basis for the enhancement of software measurement education in universities, specifically in software engineering programs at the undergraduate level. The ultimate goal of this work is to facilitate the adoption of software measurement programs in software related organizations.  This research project tackles this issue by identifying the software measurement topics that should be prioritized for undergraduate students and developing an educational Framework on the basis of the constructivist approach and the Bloom`s taxonomy to provide guidelines to university teachers. By doing so, university teachers will be provided with tools and approaches to pursue the achievement of learning outcomes by students being introduced to software measurement tasks.  This research project required a number of investigations: a comprehensive literature review and a web survey to identify current practices in the teaching of software measurement; a Delphi study to identify priorities in software measurement education for undergraduate students; and an evaluation of the proposed educational framework by university teachers to determine the extent to which it can be adopted.  The key results are: • Experts in the field agreed in identifying five essential software measurement topics (priorities) that should be taught to undergraduate students: basic concepts of software measurement; the measurement process; software measurement techniques; software management …", "num_citations": "3\n", "authors": ["2006"]}
{"title": "Detección de Contornos utilizando el Algoritmo Canny en Imágenes Cross-Espectrales Fusionadas\n", "abstract": " Considerando que las imágenes de diferentes espectros proporcionan una amplia información que ayuda mucho en el proceso de identificación y distinción de objetos que tienen firmas espectrales únicas. En este trabajo se evalúa el uso de imágenes cross-espectrales en el proceso de detección de bordes. Este estudio evalua el detector de bordes Canny con dos variantes. La primera se refiere al uso de imágenes cross-espectrales fusionadas, y la segunda al uso de filtros morfológicos. Para garantizar la calidad de los datos utilizados en este estudio se aplicó el marco de trabajo GQM (Goal-Question-Metrics), la cual fue utilizada como marco de trabajo para reducir el ruido y aumentar la entropía en las imágenes. Después de realizar los experimentos. Las métricas obtenidas en los experimentos confirman que la cantidad y calidad de los bordes detectados aumenta significativamente después de la inclusión de un filtro morfológico y un canal de espectro infrarrojo cercano en las imágenes fusionadas.", "num_citations": "2\n", "authors": ["2006"]}
{"title": "Systematic Mapping of the Literature on Secure Software Development\n", "abstract": " The accelerated growth in exploiting vulnerabilities due to errors or failures in the software development process is a latent concern in the Software Industry. In this sense, this study aims to provide an overview of the Secure Software Development trends to help identify topics that have been extensively studied and those that still need to be. Therefore, in this paper, a systematic mapping review with PICo search strategies was conducted. A total of 867 papers were identified, of which only 528 papers were selected for this review. The main findings correspond to the Software Requirements Security, where the Elicitation and Misuse Cases reported more frequently. In Software Design Security, recurring themes are security in component-based software development, threat model, and security patterns. In the Software Construction Security, the most frequent topics are static code analysis and vulnerability detection …", "num_citations": "1\n", "authors": ["2006"]}
{"title": "Application of Methodologies and Process Models in Big Data Projects.\n", "abstract": " The concept of Big Data is being used in different business sectors; however, it is not certain which methodologies and process models have been used for the development of these kind of projects. This paper presents a systematic literature review of studies reported between 2012 and 2017 related to agile and nonagile methodologies applied in Big Data projects. For validating our review process, a text mining method was used. The results reveal that since 2016 the number of articles that integrate the agile manifesto in Big Data project has increased, being Scrum the agile framework most commonly applied. We also found that 44% of articles obtained from a manual systematic literature review were automatically identified by applying text mining.", "num_citations": "1\n", "authors": ["2006"]}
{"title": "A Survey of Big Data use in large and medium Ecuadorian Companies\n", "abstract": " Big data has become a subject of great interest among a variety of organizations, both from the scientific and business sectors. In this line, it is important to know the focus of attention that companies have on big data. This paper presents a study conducted in Ecuador about big data initiatives among large and medium companies. Results indicate that companies do not have a clear understanding of the implications of big data for their own benefits. Also, higher interest on big data initiatives comes from the private rather than the public sector. And, companies have a preference for contracting big data services from third-parties instead of hiring specialized personnel.", "num_citations": "1\n", "authors": ["2006"]}
{"title": "Looking for usability and functionality issues: a case study\n", "abstract": " Looking for quality issues in a system can be a very demanding activity. In this article, we propose an approach based on text mining techniques to quickly identify usability and functionality drawbacks in a learning management system - LMS. The techniques were performed to 421 comments written by university students who frequently use a LMS. Results indicate that a dendrogram is a suitable tool to have a quick look of the issues faced by LMS’ users as well as their expectations about new functionalities that the system should provide. By using these techniques, we identified more than ten usability issues and the need for seven new functionalities to be implemented in the system.", "num_citations": "1\n", "authors": ["2006"]}