{"title": "Network of ECUs Software Update in Future vehicles\n", "abstract": " Nowadays, the modern vehicles use numerous Electric Control Units (ECUs) which have a complex software architecture. Updating the software in a given ECU is a major challenge since these connected vehicles are prone to security vulnerabilities and cyber-attacks. Another problem is that updating an ECU is a time consuming process and the owners of these vehicles cannot use important features of their cars during this update process. Different software architectures for the ECUs are proposed but none of the existing techniques allow the vehicle driver to use the car during the update. In this paper, we propose an enhanced architecture for the ECUs. The proposed architecture makes use of a delta file which is the actual update in the software. This delta file is placed in the extended RAM and the modules of the software which needs to be updated are run from the delta file. After successful executing of the …", "num_citations": "3\n", "authors": ["1567"]}
{"title": "Fuzzy Logic-Based Novel Hybrid Fuel Framework for Modern Vehicles\n", "abstract": " The transport sector has proven to be the largest contributor to global     emissions. To reduce     emissions and improve mileage, the existing research has proposed different fuel models for vehicles such as Plug-in Hybrid Electric Vehicles (PHEVs), Electric Vehicles (EVs), solar and hydrogen Vehicles. However, these vehicles suffer from a range of issues and solutions are required to increase range, and improve charging. In this context, we propose A Novel Hybrid Fuel Framework for Modern Vehicles, to reduce     emissions and increase vehicle mileage, by managing energy resources efficiently through the application of Fuzzy Logic. It considers three different energy sources i.e., gasoline, solar and electric power, to charge a vehicle, and suggest a modification in the architecture of EVs is made for the availability of all these energy resources. We use Visual Studio to implement fuzzy logic based algorithm …", "num_citations": "2\n", "authors": ["1567"]}
{"title": "Barriers of Requirement Change Management Process in the Context of Global Software Development\n", "abstract": " Global Software Development (GSD) is gaining fame every day, we need to understand the GSD environment to make project management more effective and successful. There are many difficulties and challenging activities in GSD environment and one of them is Requirement Change Management (RCM) process. Previous research shows that RCM process is very vague and cannot be used properly in GSD context due to numerous reasons. To address these issue, this study investigates the barriers of RCM Process in context of GSD. Firstly, we identify all the barriers of RCM process in GSD environment. Then we validate these barriers from industry. Finally, we quantify these barriers by using statistical tools.", "num_citations": "1\n", "authors": ["1567"]}