{"title": "Investigation of code smells in different software domains\n", "abstract": " The increasing need of developing high quality software defines the necessity of deep understanding of the problems that may occur on different levels of abstraction in the software. Code smells investigate the signs of potential problems that may occur in the software. These signs may be used for automatic detection and prevention of often occurring software problems.", "num_citations": "10\n", "authors": ["1344"]}
{"title": "Towards a Technical Debt Management Framework based on Cost-Beneﬁt Analysis\n", "abstract": " Technical debt (TD) is a metaphor of bad software design or immature artifacts of a software system. The metaphor has been quite intensively researched especially on how to identify the TD symptoms,(eg, system deficiencies or architecture violations) explicitly. Although the TD identification is quite important in the TD management process, a systematic management of TD and how to reduce it should also be considered important in each release of the development project. Otherwise, the software becomes more and more unmaintainable. In this paper, we introduce a framework to manage and reduce the TD of software systems. As it is based on quantification and a costbenefit analysis, it is called Cost-Benefit based Technical Debt Management (CoBeTDM). CoBeTDM defines explicit phases focusing on the most important aspects of TD management: identification, monitoring, and prioritization. Overall, CoBeTDM should support managers to take the right decisions regarding the software evolution and the reduction of the collected TD at the right time.", "num_citations": "8\n", "authors": ["1344"]}
{"title": "A study of cost-benefit analysis of technical debt\n", "abstract": " Since Ward Cunningham introduced the term of technical debt in his report at the OOPSLA’92 conference, the metaphor has spread across the community, helping translate technical decisions into financial ones. In such, business models for managing technical decisions have risen with it. This research work overviews a number of papers that present, as a decision model, the cost-benefit analysis, and discusses possible parameters for such a model, as well as the benefits their results would bring to the decision-making process.", "num_citations": "1\n", "authors": ["1344"]}