{"title": "Exploring the relationship between software process adaptive capability and organisational performance\n", "abstract": " Software development is a complex socio-technical activity, with the result that software development organisations need to establish and maintain robust software development processes. While much debate exists regarding the effectiveness of various software development approaches, no single approach is perfectly suited to all settings and no setting is unchanging. The capability to adapt the software process is therefore essential to sustaining an optimal software process. We designed an exploratory study to concurrently examine software process adaptive capability and organisational performance in 15 software development organisations, finding that companies with greater software process adaptive capability are shown to also experience greater business success. While our exploratory study of the complex relationship between these phenomena is limited in some respects, the findings indicate that …", "num_citations": "54\n", "authors": ["1366"]}
{"title": "A serious game for improving the decision making skills and knowledge levels of Turkish football referees according to the laws of the game\n", "abstract": " Digital game-based learning environments provide emerging opportunities to overcome learning barriers by combining newly developed technologies and traditional game design. This study proposes a quantitative research approach supported by expert validation interviews to designing a game-based learning framework. The goal is to improve the learning experience and decision-making skills of soccer referees in Turkey. A serious game was developed and tested on a group of referees (N = 54). The assessment results of these referees were compared with two sample t-test and the Wilcoxon signed-ranked test for both the experimental group and the control group. The findings of the current study confirmed that a game-based learning environment has greater merit over the paper-based alternatives.", "num_citations": "14\n", "authors": ["1366"]}
{"title": "A Literature Survey: Is it Necessary to Develop a New Software Development Methodology for Virtual Reality Projects?\n", "abstract": " Software development is a complex human endeavour with high failure rates. Although a variety of software development methodologies have been proposed to improve the software development process, there is no universal model for all software development organizations. Virtual reality (VR) is an emerging trend especially for the gaming industry, which should prepare itself for VR development. The goal of this study is to explore potential software development activities and determine whether designing a new software development methodology for VR projects is an important topic for software development organizations working on VR software development. For this purpose, a literature survey has been completed and 71 academic studies have been examined in detail. This study shows that no work is being conducted in the field of developing a new methodology for VR projects. However, the study does …", "num_citations": "11\n", "authors": ["1366"]}
{"title": "An Exploratory Study to Assess Analytical and Logical Thinking Skills of the Software Practitioners using a Gamification Perspective\n", "abstract": " The link between analytical and logical thinking skills and success of software practitioners attracted an increasing attention in the last decade. Several studies report that the ability to think logically is a requirement for improving software development skills, which exhibits a strong reasoning. Additionally, analytical thinking is a vital part of software development for example while dividing a task into elemental parts with respect to basic rules and principles.  Using the basic essence of gamification, this study proposes a mobile testing platform for assessing analytical and logical thinking skills of software practitioners as well as computer engineering students. The assessment questions were taken from the literature and transformed into a gamified tool based on the software requirements. A focus group study was conducted to capture the requirements. Using the Delphi method, these requirements were discussed by a group of experts to reach a multidisciplinary understanding where a level of moderate agreement has been achieved. In light of these, an assessment tool was developed, which was tested on both software practitioners from the industry and senior computer engineering students. Our results suggest that individuals who exhibit skills in analytical and logical thinking are also more inclined to be successful in software development.", "num_citations": "8\n", "authors": ["1366"]}
{"title": "Designing games for improving the software development process\n", "abstract": " With the proliferation of relevant technologies that enables interactive social engagements, games became a strong driving power for next generation social environments. One of the reason for this is that there is an engaging nature in both digital and non-digital games, which is also suitable for creating serious kind of interactions such as teaching, training, learning, etc. Recently, researchers have started developing games or game-like applications in particular domains such as education, management, medicine. Although there are loads of empirical studies about game-based learning in general, scholars from information systems, computer science and software engineering domains have only a few attempts to develop and use the specific properties of games in their context-dependent environments. This workshop paper takes a look at some of these efforts and discusses about the pros and cons of …", "num_citations": "8\n", "authors": ["1366"]}
{"title": "The Design Process of a Board Game for Exploring the Territories of the United States\n", "abstract": " The paper reports the design experience of a board game with an educational aspect, which takes place on the location of states and territories of the United States. Based on a territorial acquisition dynamic, the goal was to articulate the design process of a board game that provides information for individuals who are willing to learn the locations of the US states by playing a game. The game was developed using an iterative design process based on focus groups studies and brainstorming sessions. A mechanic-driven design approach was adopted instead of a theme or setting-driven alternative and a relatively abstract game was developed. The initial design idea was formed and refined according to the player feedback. The paper details play-testing sessions conducted and documents the design experience from a qualitative perspective. Our preliminary results suggest that the initial design is moderately balanced and despite the lack of quantitative evidence, our subjective observations indicate that participants’ knowledge about the location of states was improved in an entertaining and interactive way.", "num_citations": "7\n", "authors": ["1366"]}
{"title": "Assessing personality traits in a large scale software development company: exploratory industrial case study\n", "abstract": " Software development methodologies become increasingly more people and team-oriented. However, many software projects fail due to conflicts of team members. Formation of an effective software development team may be particularly challenging given the differences inherent across an individual’s personality. This paper explores personality traits of agile software development teams by using a context-specific interactive assessment. Concerning the assessment, we have conducted a questionnaire with 110 participants from a large-scale software development company. We have visualized personality traits with team radar charts showing the personality traits of 18 project teams and analyzed the results by validation interviews. Our preliminary results indicate that higher introversion is observed most commonly in isolated teams that has less contact with customers. Moreover, high levels of …", "num_citations": "5\n", "authors": ["1366"]}
{"title": "Software Development Overall Efficiency Improvement in a CMMI Level 5 Organization within the scope of a Case Study\n", "abstract": " Due to globalization and increase in the level of technology requirements, managing expectation and customer demand for software development projects becomes more challenging. Therefore, the notion of quality and productivity gain importance for software development. In order to improve the quality and productivity, CMMI capability model has been widely adopted within software development organizations. This paper presents an overall software efficiency improvement project, which is implemented within the scope of organizational performance management which covers all process areas of CMMI level 5. Within the scope of the project, our organization targeted software productivity increase and it is achieved by improving code creation productivity of the organization. The result of the paper can be a reference for other organizations in software development industry seeking to improve software …", "num_citations": "5\n", "authors": ["1366"]}
{"title": "Oyun Kuramı Kullanarak Yazılım Takımlarının Üretkenliğini Artırmak İçin Geliştirilen Bir Yazılım Süreç Mühendisliği Yaklaşımı\n", "abstract": " azılım geliştirme süreçleri bilgi ve insan tabanlı aktivitelerdir. Sosyal açından değerlendirildiğinde yazılım geliştiren bireylerin sosyal etkileşimi ve işbirliğine yatkınlığı takım ve organizasyon üretkenliğinin artırılmasını destekleyecek en önemli unsurlar arasındadır. Bu sebeple, özellikle son zamanlarda, yazılım mühendisliği konusunda yapılan birçok çalışma yazılım geliştirme faaliyetlerinde insan faktörünün kritik rolünü vurgulamaktadır. Ekonomi ve sosyoloji bilimlerinde aktif olarak araştırılmakta olan sosyal ağ yapısı ve buna bağlı olarak incelenen davranış analizi kavramları yazılım mühendisliği araştırmalarında henüz yaygın bir uygulama alanı bulamamıştır. Özellikle sosyal ve ekonomik karar ve kişilik analizlerinde sıkça kullanılan bu kavramların yazılım mühendisliğine uygulanması yazılım firmalarının üretkenliğini, dolayısı ile yatırım karlılıklarının artırılmasını mümkün kılacaktır. Bu makalede, ekonomi alanında birçok uygulaması bulunan oyun kuramının bir alt dalı olan mekanizma tasarımı kullanılarak geliştirmekte olduğumuz bir süreç mühendisliği yaklaşımı anlatılmaktadır. Bu yaklaşım kullanılarak, yazılım geliştiren organizasyonların yapısının iyileştirilmesi ve buna bağlı olarak üretkenliklerinin artırılması hedeflenmektedir.", "num_citations": "5\n", "authors": ["1366"]}
{"title": "Towards a Role Playing Game for Exploring the Roles in Scrum to Improve Collaboration Problems\n", "abstract": " Scrum is the most popular, useful and lightweight framework based on agile software development philosophy. In particular, software development organizations are willing to transform their software development culture to benefit from its fruitful practices. In addition, it is almost inevitable for the organizations with historical development practices to face many dysfunctions during transformation phase, which is normal and expected. It is important to uncover, analyze and solve these dysfunctions, which may take some time. One of the problems organizations may encounter is the confusion and misapplication of the roles in Scrum. This dysfunction creates problems from task creation, follow-up, taking responsibility to collaboration problems in the project. The goal of this study is to address such situations using an interactive role playing game-based approach among team members to improve collaboration.", "num_citations": "4\n", "authors": ["1366"]}
{"title": "Understanding personality differences in software organizations using Keirsey Temperament Sorter\n", "abstract": " In recent years, there has been an increasing interest in exploring personality differences to improve work experience in software organisations. This study presents a personality assessment process conducted on 382 software practitioners using the Keirsey temperament sorter II. The primary goal of this assessment is to explore the personality temperaments of software practitioners working in different types of software development organisations. In addition, a novel visualisation approach is proposed for arranging temperaments using a periodic table-like structure. The results suggest that the authors approach provides an effective means to investigate an organisation's personality profile while assessing personality types.", "num_citations": "4\n", "authors": ["1366"]}
{"title": "Towards a process management life-cycle model for graduation projects in computer engineering\n", "abstract": " Graduation projects play an important role in computer engineering careers in which students are expected to draw upon their knowledge and skills that were acquired since admission. To manage the activities of graduation projects, an iterative and incremental approach which aims continuous improvement is proposed as an alternative to a controversial delivery model. However, such integration brings up a set of challenges to be taken into account: e.g. multiple project deliveries, more labor-intensive effort from instructors, and ultimately continuous learning for all participants. One promising way to achieve such an integrated and continuous deployment velocity is to eliminate potential bottlenecks by giving student teams to receive early and continuous feedback. To this end, we propose a continuous feedback and delivery mechanism for managing the life-cycle of a graduation project through draft proposal, literature review, requirements gathering, design, implementation and testing which should produce intermediate outputs at predefined intervals. Most importantly, our approach makes it possible to quantify most of the activities involved in life-cycle process with various rubrics (i.e. measurement scales) that have been purposefully developed. The proposed model promotes the fact that all improvements should be monitored, evaluated and documented. The results of this study indicate that students who were managed using this approach produced better project deliverables and ultimately have delivered better and successful projects.", "num_citations": "3\n", "authors": ["1366"]}
{"title": "Gamifying the Onboarding Process for Novice Software Practitioners\n", "abstract": " As the software development process becomes more complex, the adaptation challenges for novice software practitioners become magnified. In particular, an invisible adaptation barrier could have emerged between a software project and newly hired software engineers. This barrier needs to be overcome as soon as possible for the new comers to be productive and effective. To address this issue, we propose a tailored gamification process especially for novice software engineers so as to improve their onboarding process. The approach aims to provide the novice practitioners more motivation and less struggling, which promotes the utilization of “6D Gamification Framework” that is discussed as an example.", "num_citations": "3\n", "authors": ["1366"]}
{"title": "Observed Effects of Software Processes Change in Three Software Firms: Industrial Exploratory Case Study\n", "abstract": " Software development processes require continuous improvement in line with emerging new technologies and the possibilities it provides. A new generation of software development models based on product demands of software customers with marketable functions aims to increase the intermediate product production speed and thus the number of interim versions. In the light of these needs, software companies need to oversee their development processes to meet their customers' needs. But more importantly, companies are forced to change their processes in line with innovative practices in order not to cut back on the software production line. In this article, the software development methods of the three companies that develop software are examined in detail by the case study method, and the process change activities are systematically detailed. In the light of the information obtained, the experiences of the three firms in the software development methods are questioned and the effects of these acquisitions on the processes are discussed. As a result of the study, it has been observed that the software development success has a significant impact on the well-being of the process, and the software development teams are trying to design their own processes in the light of the gains they acquire.", "num_citations": "2\n", "authors": ["1366"]}
{"title": "Virtual Reality-Based Daily Scrum Meetings.\n", "abstract": " Software development is a social endeavor where quality of social interactions among practitioners directly affects the quality and complexity of software development (Yilmaz and O’Connor 2011b). In particular, software development encourages more diverse teams of individuals and highlights the importance of practitioners’ soft skills (Yilmaz 2013). These skills usually developed by the experience of practitioners while working on several different teams and interacting software practitioners with various personality traits (Yilmaz and O’Connor 2012). However, it is technically not that easy to encounter these situations if an individual has been working with a single team of professionals for a long period of time.In this entry, an industrial case study on a virtual reality training environment for humanvirtual persona interaction been discussed to reveal ways to train software professionals for daily scrum meetings with 3D virtual characters which have the ability to mimic verbal and nonverbal behaviors and therefore convey distinctive personality characteristics.", "num_citations": "2\n", "authors": ["1366"]}
{"title": "Using Adapted Version of Hoshin Matrix for Selection of Agile Software Development Processes\n", "abstract": " According to Capability Maturity Model Integration for Development (CMMI-DEV), organizational process performance (OPP) area aims to establish and maintain a quantitative understanding of performance of selected processes. Many organizations have started their agile transformation to leverage the capabilities of their software development processes. In order to measure the effects of agile transformation, it is important to understand to what extent agile methods contribute to business objectives. Hoshin Matrix is a tool that provides a rationale for selecting processes identified for process performance analyses. Moreover, this rationale includes traceability from software development execution to business objectives. This study describes the implementation example of an adapted version of Hoshin Matrix at Huawei Turkey Research and Development Center which aims to establish its organizational quantitative quality and process performance objectives based on a set of business objectives. Our preliminary findings suggest that our OPP design may provide a guideline for software development organizations who are willing to adopt agile transformation and for those who would like to improve their software development processes.", "num_citations": "1\n", "authors": ["1366"]}
{"title": "An industrial case study to improve the onboaring process in software management (Yazılım Yönetiminde İşe Alıştırma Süreçlerinin İyileştirilmesi İçin Düşünülmüş Bir Endüstriyel …\n", "abstract": " In this study, we investigate expert information about soft- ware process known to experienced software developers and study how this is to be transferred to the newly recruited software developers. By this means, the developers who are recruited to a software project should understand better the software development organization and especially its social structure more effectively. Through this work, along with structural and algorithmic improvements of the software product, problems related to adaptation to team culture, adaptation to company  culture, and adaptation to software development tools used are also investigated. This study aims to find the requirements in the market so that the recruitment processes can be explored using serious game mechanics. With the help of an industrial case study, we question the applicability a serious game for recruitment in the industry by improving the on-boarding process which has been identified as a problem for many software companies.  Özet. Bu çalışmada, tecrübeli yazılım geliştiricilerden, yeni katılan geliştiricilere aktarılmasını beklenen bilgileri, ve bu bilginin katılımcıya olan değerini anlatmak için neler yapıldığı araştırılacaktır. Bu sayede, işe veya projeye yeni başlayan geliştiricilerin organizasyonu ve sosyal yapıyı daha verimli bir şekilde tanıması ve anlaması öngörülmektedir. Bu çalışma yardımıyla, özellikle, yazılım ürününün yapısal ve algoritmik iyileştirmelerin yanı sıra ekip kültürüne alışma, şirket kültürüne alışma ve kullanılan yazılım geliştirme araçlarına alışma ile ilgili problemler araştırılacaktır. Bu çalışma, işe alıştırma süreçlerinin bir ciddi oyuna dönüştürülebilmesi için piyasadaki …", "num_citations": "1\n", "authors": ["1366"]}