{"title": "High speed, high temperature electrical characterization of phase change materials: metastable phases, crystallization dynamics, and resistance drift\n", "abstract": " During the fast switching in Ge2Sb2Te5 phase change memory devices, both the amorphous and fcc crystalline phases remain metastable beyond the fcc and hexagonal transition temperatures respectively. In this work, the metastable electrical properties together with crystallization times and resistance drift behaviour of GST are studied using a high-speed, device-level characterization technique in the temperature range of 300 K to 675 K.", "num_citations": "59\n", "authors": ["1541"]}
{"title": "Electrical Resistivity of LiquidBased on Thin-Film and Nanoscale Device Measurements\n", "abstract": " The electrical resistivity of liquid Ge 2 Sb 2  Te 5  (GST) is obtained from dc-voltage measurements performed on thin GST films as well as from device-level microsecond-pulse voltage and current measurements performed on two arrays (thicknesses: 20 ± 2 nm and 50 ± 5 nm) of lithographically defined encapsulated GST nano-/microwires (length: 315 to 675 nm; width: 60 to 420 nm) with metal contacts. The thin-film measurements yield 1.26 ±0.15 mΩ·cm (thicknesses: 50, 100, and 200 nm); however, there is significant uncertainty regarding the integrity of the film in liquid state. The device-level measurements utilize the melting of the encapsulated structures by a single voltage pulse while monitoring the current through the wire. The melting is verified by the stabilization of the current during the pulse. The resistivity of liquid GST is extracted as 0.31 ± 0.04 and 0.21 ±0.03 mΩ·cm from 20- and 50-nm-thick wire arrays.", "num_citations": "38\n", "authors": ["1541"]}
{"title": "Self-heating of silicon microwires: Crystallization and thermoelectric effects\n", "abstract": " We describe experiments on self-heating and melting of nanocrystalline silicon microwires using single high-amplitude microsecond voltage pulses, which result in growth of large single-crystal domains upon resolidification. Extremely high current densities (>20 MA/cm2) and consequent high temperatures (1700 K) and temperature gradients (1 K/nm) along the microwires give rise to strong thermoelectric effects. The thermoelectric effects are characterized through capture and analysis of light emission from the self-heated wires biased with lower magnitude direct current/alternating current voltages. The hottest spot on the wires consistently appears closer to the lower potential end for n-type microwires and to the higher potential end for p-type microwires. The experimental light emission profiles are used to verify the mathematical models and material parameters used for the simulations. Good agreement between …", "num_citations": "37\n", "authors": ["1541"]}
{"title": "A modified genetic algorithm for the generalized assignment problems\n", "abstract": " In this paper, a specialized Genetic Algorithm is proposed and applied for the solution of the Generalized Assignment Problem. Special crossover and the mutation operators called Common Element Crossover (CEX) and In-Pool Mutation (IPM) respectively has been defined by focusing on the special needs and nature of the Generalized Assignment Problem. The performance of the proposed method has been investigated in details via some test cases constructed for the multi-target tracking problems.", "num_citations": "11\n", "authors": ["1541"]}
{"title": "High Temperature Seebeck Coefficient and Electrical Resistivity of Ge2Sb2Te5 Thin Films\n", "abstract": " Phase-change memory (PCM) is a promising memory technology in which a small volume of a chalcogenide material can be reversibly and rapidly switched between amorphous and crystalline phases by an electrical pulse that brings it above crystallization (̃ 150-200 C) or melting (̃ 700 C) temperature. The large temperature levels involved and small dimensions of PCM devices give rise to very large temperature gradients (̃ 10 K/nm and higher) which result in strong thermoelectric effects. High-temperature characterization of the temperature-dependent thermoelectric properties of these materials is therefore critical to understand for the operation of these devices but to date there is only limited experimental data available. We have performed simultaneous measurements of Seebeck coefficient and electrical resistance of thin films of GST with different thicknesses, deposited on silicon dioxide, from room …", "num_citations": "10\n", "authors": ["1541"]}
{"title": "Scaling of silicon phase-change oscillators\n", "abstract": " Scalability of silicon-based phase-change oscillators is investigated through experimental and computational studies. These relaxation oscillators are composed of a small volume of silicon, dc biased through a load resistor and a capacitor, which melts due to self-heating and resolidifies upon discharge of the load capacitor. These phase changes lead to high-amplitude current spikes with oscillation frequency that scales with supply voltage,  RC  time constant, power delivery condition, and heating and cooling rates of the wire. Experimental results are obtained from structures fabricated using silicon-on-insulator substrates. Scaling effects of various parameters are explored using 3-D finite-element simulations coupled with SPICE models.", "num_citations": "7\n", "authors": ["1541"]}
{"title": "Analysis of self-heating of thermally assisted spin-transfer torque magnetic random access memory\n", "abstract": " Thermal assistance has been shown to significantly reduce the required operation power for spin torque transfer magnetic random access memory (STT-MRAM). Proposed heating methods include modified material stack compositions that result in increased self-heating or external heat sources. In this work we analyze the self-heating process of a standard perpendicular magnetic anisotropy STT-MRAM device through numerical simulations in order to understand the relative contributions of Joule, thermoelectric Peltier and Thomson, and tunneling junction heating. A 2D rotationally symmetric numerical model is used to solve the coupled electro-thermal equations including thermoelectric effects and heat absorbed or released at the tunneling junction. We compare self-heating for different common passivation materials, positive and negative electrical current polarity, and different device thermal anchoring and boundaries resistance configurations. The variations considered are found to result in significant differences in maximum temperatures reached. Average increases of 3 K, 10 K, and 100 K for different passivation materials, positive and negative polarity, and different thermal anchoring configurations, respectively, are observed. The highest temperatures, up to 424 K, are obtained for silicon dioxide as the passivation material, positive polarity, and low thermal anchoring with thermal boundary resistance configurations. Interestingly it is also found that due to the tunneling heat, Peltier effect, device geometry, and numerous interfacial layers around the magnetic tunnel junction (MTJ), most of the heat is dissipated on the lower potential side of …", "num_citations": "6\n", "authors": ["1541"]}
{"title": "Three-dimensional computational analysis of accumulated body MOSFETs\n", "abstract": " Accumulated body approach for short- and narrow-channel (10-nm scale) bulk Si MOSFETs is analyzed through 3-D finite-element studies. Accumulation of the side interfaces is achieved by a side-gate structure surrounding the body of the transistor, which leads to the accumulation of the body for narrow structures. A separately controlled top gate is used for transistor action. The simulation results show the suppression of leakage currents by 10 6  times for no side-interface charges, and by 10 10  times for an interface positive fixed charge density of 10 12  cm -2 . The threshold voltage (VT) can be dynamically increased by over 1 V with the accumulation of the body (V side  = 0 to -3 V) for W × L = 10-nm × 15-nm structures, enabling electrostatic VT control and reliable high-temperature (>600 K) operation. Improvements in subthreshold slope and drain-induced barrier lowering are significant for narrower channel …", "num_citations": "5\n", "authors": ["1541"]}
{"title": "Crystallization times of Ge2Sb2Te5 nanostructures as a function of temperature\n", "abstract": " Phase-change memory is a promising non-volatile memory technology in which a small volume of a phase change material is reversibly and rapidly switched between amorphous and crystalline phases by a suitable electrical pulse. Amorphization is achieved by fast cooling after a melting pulse while crystallization is achieved through electrical breakdown of the amorphous element that leads to heating above the crystallization temperature for a sufficient period. Significant difference between the crystallization behavior of phase-change materials in bulk, thin films and in nanostructures have been observed [1, 2]. We have studied the crystallization times of nanoscale Ge2Sb2Te5 line structures using 50-500 ns voltage pulses with a baseline offset in the 500 K to 625 K range under high-vacuum. The baseline voltage allows measurement of resistance before and after the pulse and crystallization time. Current and …", "num_citations": "5\n", "authors": ["1541"]}
{"title": "Virtual fabrication using directed self-assembly for process optimization in a 14nm DRAM\n", "abstract": " For Directed Self-Assembly (DSA) to be deployed in advanced semiconductor technologies, it must reliably integrate into a full process flow. We present a methodology for using virtual fabrication software, including predictive DSA process models, to develop and analyze the replacement of SAQP patterning with LiNe chemoepitaxy on a 14nm DRAM process. To quantify the impact of this module replacement, we investigate a key process yield metric for DRAM: interface area between the capacitor contacts and transistor source/drain. Additionally, we demonstrate virtual fabrication of the DRAM cell’s hexagonally-packed capacitors patterned with an array of diblock copolymer cylinders in place of LE4 patterning.", "num_citations": "4\n", "authors": ["1541"]}
{"title": "Narrow-channel accumulated-body bulk Si MOSFETs with wide-range dynamic threshold voltage tuning\n", "abstract": " Side-gated bulk Si nMOSFETs with Si 3 N 4  shallow trench isolation (STI) have been previously demonstrated to have significantly reduced off-currents and improved subthreshold characteristics [1, 2]. The improvement is shown to be due to accumulation of the Si body with the holes as the polysilicon side-gate surrounding the body as a guard ring is negatively biased (Fig 1). The threshold voltage (V T ) of the narrow channel devices can be dynamically controlled by the side-gate (Fig 2) voltage (V side ) in a wide range [2, 3], mainly due to the increase in the channel energy barrier (Fig. 3) [4]. Here, we report experimental results on narrow bulk Si accumulated body n-channel FETs with SiO 2  side-gate dielectric and STI and p-type side-gates (Fig 2). The fabrication is compatible with established front and back end-of-line processes with only an added side-gate formation and side-gate contact step over …", "num_citations": "3\n", "authors": ["1541"]}
{"title": "Electrical Resistivity of Liquid Ge2Sb2Te5 in Patterned Nanostructures\n", "abstract": " Phase change memory devices are based on the electrical resistivity contrast between the amorphous and the crystalline phases of chalcogenide materials [1]. Since melting is required to amorphize the material, knowledge of the liquid state properties is critical for device design. Ge2Sb2Te5 (GST) is the most studied phase change material. However, the two experimental values reported to date for electrical resistivity of liquid GST (one on a thin film [2], the other in bulk [3]) differ by an order of magnitude. We have extracted the electrical resistivity of liquid GST from single pulse measurements on a large number of encapsulated GST line structures with varying lengths, widths and thicknesses. Each structure is self-heated to melt by the microsecond voltage pulse while voltage and current are monitored using an oscilloscope. The liquid state resistivity is calculated from slopes of liquid state resistance versus 1/width …", "num_citations": "3\n", "authors": ["1541"]}
{"title": "Numerical modeling of electrothermal effects in silicon nanowires\n", "abstract": " Asymmetric melting was observed in electrically pulsed n-type (phosphorus) nanocrystalline silicon (nc-Si) wires fabricated lithographically. Scanning electron microscope (SEM) images taken from the pulsed wires showed that melting initiates from the ground terminal end of the wires instead of the center as initially expected. Asymmetry in the temperature profile is caused by heat exchanged between charge carriers and phonons when an electrical current is passed along a temperature gradient. This effect is known as Thomson effect, a thermoelectric heat transfer mechanism. One dimensional (1D) time dependent heat diffusion equation including Thomson heat term was solved to model the temperature profile on our structures. The modeling results show that Thomson effect introduces significant shifts in the temperature distribution. The effect of Thomson heat is modeled for various electrical pulse conditions …", "num_citations": "3\n", "authors": ["1541"]}
{"title": "Nanoscale Accumulated Body Si nMOSFETs\n", "abstract": " Narrow- and short-channel inversion-mode nMOSFETs with an accumulated body are experimentally demonstrated down to W × L = 17-nm × 37-nm scale. Accumulation of holes on the p-type body is achieved by applying a negative bias on an independently controlled p+ polysilicon side-gate structure surrounding the FET body. Affecting the channel from two sides, electrical characteristics of the transistor can be modified, especially the threshold voltage (V T ). V T  sensitivity to the side-gate bias (V side ) shows a strong dependence on the device width for W <; 40 nm, exponentially increasing to above 1 V/V for W = 17 nm. This sensitivity is significantly larger than what is predicted by 3-D Technology Computer Aided Design simulations. The devices exhibit very low leakage, good subthreshold slope, and improved drain-induced barrier lowering with the accumulation of the body.", "num_citations": "1\n", "authors": ["1541"]}
{"title": "Investigation of 3D photoresist profile effect in self-aligned patterning through virtual fabrication\n", "abstract": " The effects of photoresist sidewall profile and LER on two representative integration schemes were studied through 3D virtual fabrication: Front-End of Line (FEOL) Fin formation and Back-End of Line (BEOL) Metal line definition. Both of these processes use self-aligned double patterning (SADP) in pattern definition, and affect the circuit performance through MOSFET channel shape and parasitic capacitance respectively. In both cases we imposed LER and sidewall roughness on the photoresist that defines the mandrel at the initial step of the SADP flow using SEMulator3D. The LER followed a Gaussian correlation function for a number of amplitude and correlation length values. The sidewall profile emulated the bulb-shaped pattern that is reported in experimental works. The taper angle and roughness amplitude of this shape were varied to isolate its components. In each of these cases, we have found direct …", "num_citations": "1\n", "authors": ["1541"]}
{"title": "Narrow Channel Accumulated Body MOSFETs: Design, Modeling and Experimental Verification\n", "abstract": " Current leakage on a planar field effect transistor (FET) channel’s side surfaces is more significant as the channel width decreases. Traps and positive fixed charges at the interface of Silicon and the isolation dielectric (STI) are mainly responsible for this. An accumulated body approach introduces a side-gate structure surrounding the body of the transistor, which can be used to accumulate the body in narrow structures to suppress the leakage. A separately controlled top gate is used for transistor action.", "num_citations": "1\n", "authors": ["1541"]}