{"title": "An investigation on learning performance among disabled people using educational multimedia software: A case study for deaf people\n", "abstract": " The increasing number of people with hearing-impaired in Malaysia attracts to produce a variety of technologies, which can assist the deaf people in carrying out their tasks in everyday life as normal people. New technology can help to decrease the difficulty that hearing-impaired people faces in daily life to use the information services like normal people. Thus, this paper focuses on: i) developing a new multimedia courseware for pre-school students with hearing problem, and ii) comparing the deaf student’s learning performance before and after using the courseware. Four modules were developed for e-MSL courseware consist of alphabets, numbers, words and quizzes with colorful text, animation, sounds, video and pictures using Malaysian Sign Language (MSL). Sekolah Rendah Pendidikan Khas (SRPK) Indera Mahkota II, Kuantan has been chosen as the case study for data collection and for investigating the student learning performance on the courseware. The survey results show that 100% of the respondents have agreed that using e-MSL courseware managed to reduce the student learning time more than 80%. The result has indicated that students have shown better learning performance using e-MSL compared to traditional learning.", "num_citations": "15\n", "authors": ["408"]}
{"title": "Managing building checklist plans using busclis\n", "abstract": " This paper presents the software namely Building Submission Checklist System (BUSCLIS). It has been developed to manage the submission of building checklist plans process in the construction industry. BUSCLIS helps to simplify the management for acquiescence data of building plan approval for the Local Authority (LA) and Country Planning in Malaysia through the web based system. BUSCLIS facilitates user through the computerization forms, which provides fast, efficient and effective service to the engineer, architect and contractor. Relevant and timely information manage by sophisticated BUSCLIS with the database management system MySQL.", "num_citations": "3\n", "authors": ["408"]}