{"title": "Accuracy weighted diversity-based online boosting\n", "abstract": " Target distributional change occurring in a data stream known as concept drift, causes a challenging task for an online learning method, as the accuracy of an online learning method may decrease due to these changes. In this paper, the Accuracy Weighted Diversity-based Online Boosting (AWDOB) method has been proposed, which is based on Adaptable Diversity-based Online Boosting (ADOB) and, other modifications. More precisely, AWDOB uses the proposed accuracy weighting scheme which is based on previous expert’s results of the sums of correctly classified and incorrectly classified instances to calculate the weight of current expert, which improved the overall accuracy of the AWDOB. Experiments were conducted to compare the accuracy results of AWDOB against other methods using ten real-world datasets and thirty-two artificial datasets. Artificial datasets were generated by the four artificial data …", "num_citations": "3\n", "authors": ["1115"]}
{"title": "Bhattacharyya Distance based Concept Drift Detection Method For evolving data stream\n", "abstract": " The majority of online learners assume that the data distribution to be learned is established in advance. There are many real-world problems where the distribution of the data changes as a function of time. Variations in data streams data distributions can sufficiently reduce the skill of the learning algorithm on new data, if the learning algorithm is not equipped to track such changes. Therefore, the algorithm should initiate required actions to make sure that the new information is learned properly. In this article, we propose Bhattacharyya Distance-based Concept Drift Detection Method (BDDM) which uses Bhattacharyya distance to identify gradual or abrupt variations in the distribution. Experiments executed in the MOA framework using three artificial data generators and ten real-world datasets suggest that BDDM improves the detections and accuracies in many scenarios.", "num_citations": "2\n", "authors": ["1115"]}