{"title": "More isn't always better: The curvilinear relationship between inquiry-based teaching and student achievement in science\n", "abstract": " Previous studies have assumed a linear relationship between inquiry-based teaching and student achievement in science. However this assumption may be questionable. Recent evidence on the effectiveness of inquiry-based teaching has yielded conflicting findings. To test the linearity assumption, the present study investigated the relation between inquiry-based teaching and achievement by taking into account the possible existence of nonlinear relations using Norwegian TIMSS 2015 data. A multilevel structural equation modeling analysis showed that the relationship was curvilinear. Inquiry-based teaching was positively correlated with achievement, but high frequency of inquiry activities was negatively related to achievement. Furthermore, we found that classroom SES did not affect the strength of the relationship between inquiry and achievement. These findings challenge the linearity assumption and …", "num_citations": "72\n", "authors": ["1243"]}
{"title": "I know I can, but do I have the time? The role of teachers’ self-efficacy and perceived time constraints in implementing cognitive-activation strategies in science\n", "abstract": " Considerable research has demonstrated that teachers’ self-efficacy plays a major role in implementing instructional practices in classroom lessons. Only few studies, however, have examined the interplay between how teachers’ self-efficacy and the challenges that lie outside their influence are related to their implementation of cognitive-activation strategies (CAS), especially in science classrooms. Using the Trends in Mathematics and Science Study (TIMSS) 2015 data from Grades 4, 5, 8, and 9, we explored the extent to which teachers’ self-efficacy in teaching science and the perceived time constraints explained variation in the enactment of general and inquiry-based CAS. Overall, the findings revealed that highly self-efficacious teachers reported more frequent implementation of both general and inquiry-based CAS, whereas those who perceived strong time constraints reported a less frequent use of inquiry-based CAS. We further found that these relations differed significantly between primary- and secondary-school teachers and discuss these findings in light of teachers’ professional competences and the resources for science activities in primary and secondary education. We point to the theoretical implications of this study for enhancing the conceptual understanding of generic and specific aspects of CAS and the practical implications for teacher education, professional development, and educational policy.", "num_citations": "16\n", "authors": ["1243"]}
{"title": "Bringing formal and informal reasoning together—A new era of assessment?\n", "abstract": " Scientific reasoning represents a set of skills students need to acquire in order to successfully participate in scientific practices. Hence, educational research has focused on developing and validating assessments of student learning that capture the two different components of the construct, namely formal and informal reasoning. In this opinion paper, we explain why we believe that it is time for a new era of scientific reasoning assessments that bring these components together, and how computer-based assessments (CBAs) might accomplish this. Reasoning is a mental process that enables people to construct new representations from existing knowledge (Rips, 2004). It includes cognitive processing that is directed at finding solutions to problems by drawing conclusions based on logical rules or rational procedures (Mayer and Wittrock, 2006). When people reason, they attempt to go “beyond the information given” to create a new representation that is assumed to be true (Bruner, 1957). The process of scientific reasoning comprises formal and informal reasoning (Galotti, 1989; Kuhn, 1993). Formal reasoning is characterized by rules of logic and mathematics, with fixed and unchanging premises (Perkins et al., 1991; Sadler, 2004). It encompasses the ability to formulate a problem, design scientific investigations, evaluate experimental outcomes, and make causal inferences in order to form and modify theories related to the phenomenon under investigation (Zimmerman, 2007). Formal scientific reasoning can be applied not only within the context of science, but in almost every other domain of society (Han, 2013). It can be used to make informed …", "num_citations": "15\n", "authors": ["1243"]}
{"title": "Identifying patterns of students' performance on simulated inquiry tasks using PISA 2015 log‐file data\n", "abstract": " Previous research has demonstrated the potential of examining log‐file data from computer‐based assessments to understand student interactions with complex inquiry tasks. Rather than solely providing information about what has been achieved or the accuracy of student responses (product data), students' log files offer additional insights into how the responses were produced (process data). In this study, we examined students' log files to detect patterns of students' interactions with computer‐based assessment and to determine whether unique characteristics of these interactions emerge as distinct profiles of inquiry performance. Knowledge about the characteristics of these profiles can shed light on why some students are more successful at solving simulated inquiry tasks than others and how to support student understanding of scientific inquiry through computer‐based environments. We analyzed the …", "num_citations": "7\n", "authors": ["1243"]}
{"title": "Teachers’ role in enhancing equity: A multilevel structural equation modeling with mediated moderation.\n", "abstract": " Even though equity is an important aim for the Nordic countries, for many of these countries, the effect of a student’s home background on their achievement seems to increase over time. If the aim is to reduce the effect of SES (socioeconomic status) on student outcomes, there is a need to identify the factors that moderate this relation. One such factor could be teachers and their instruction because they have been found to be key to student outcomes. However, few have linked teachers and their instruction to equity, and fewer still have made this link in Nordic countries. The aim of the present study is to identify the aspects of teacher quality and their instruction that may reduce the relationship between SES and student achievement in the Nordic countries. Eighth-grade students from the only two Nordic countries participating in TIMSS 2015 (Norway and Sweden) were selected. Multigroup, multilevel (students and classes) structural equation models with random slopes were employed to investigate which aspects of teacher quality moderate the relation between SES and student science achievement via instructional quality. The findings show that teacher professional development and specialisation reduce the relation between SES and science achievement via instructional quality in Sweden, while there were no significant findings for Norway. This study contributes to the fields of equity and teacher effectiveness, demonstrating that teachers may make a difference in reducing inequity through their competence and instruction.", "num_citations": "3\n", "authors": ["1243"]}
{"title": "Scientific inquiry in TIMSS and PISA 2015: Inquiry as an instructional approach and the assessment of inquiry as an instructional outcome in science\n", "abstract": " This article-based thesis draws on research in the fields of science education and international large-scale assessments. It investigates theoretical, methodological, and empirical aspects of inquiry as an instructional approach (means) and the assessment of inquiry as an instructional outcome (ends). The empirical investigations used latent variable modeling in order to analyze data from student and teacher questionnaires, student assessment, and student log files in the Trends in International Mathematics and Science Study (TIMSS) and the Programme for International Student Assessment (PISA) 2015. Article 1 focuses on inquiry as an instructional approach and outcome by exploring the relationship between inquiry-based science teaching and student achievement in science. This article attempts to resolve conflicting findings of inquiry–achievement relationships by demonstrating the existence of curvilinear rather than linear patterns, as previously assumed. Article 2 addresses the research gaps in comparing inquiry as an instructional approach between primary and secondary education. It examines the interplay between teachers’ self-efficacy in teaching science and perceived time constraints in explaining the opportunities for students to engage in cognitively challenging learning activities in Grades 4, 5, 8, and 9. Article 3 presents an investigation on the assessment of inquiry as an instructional outcome. It identifies distinct profiles of students’ performance on simulated inquiry tasks that require the skills to coordinate the effects of multiple variables and to coordinate theory with evidence. While Article 3 takes a micro approach, focusing …", "num_citations": "2\n", "authors": ["1243"]}
{"title": "Inquiry in science education\n", "abstract": " Inquiry has played a major role in the past and present science education reforms around the world. Despite a great number of studies leveraging TIMSS and PISA data to investigate inquiry in science education, there is little effort to synthesize their findings. The present study aims to systematically review how TIMSS and PISA data were used to investigate inquiry and discuss how the findings contributed to the overall research on inquiry in science education. Patterns and findings from the TIMSS and PISA research were synthesized across the three strands of inquiry research to identify the relevant factors that explain (1) teachers’ frequent implementation of inquiry as an instructional approach,(2) students’ performance in inquiry or inquiry as an instructional outcome, and (3) the relationships between inquiry as an instructional approach and outcome. Findings indicated that the majority of the studies emphasized the third strand of inquiry research by examining the relationships between inquiry and student achievement. Although these studies used similar data, their conceptualizations and measurements of inquiry as an instructional approach varied considerably. This review provides an overview of the assessment of inquiry in TIMSS and PISA targeted to science education researchers who are unfamiliar with this field in the hope of encouraging them to utilize these data. It also encourages other researchers to reflect upon the knowledge gained from harnessing TIMSS and PISA data as well as the challenges and opportunities that lie ahead.", "num_citations": "1\n", "authors": ["1243"]}