{"title": "The effect of investor bias and gender on portfolio performance and risk\n", "abstract": " We survey 84 finance and accounting majors to determine the behavioral factors that males and females exhibit when making investment decisions. The survey results are linked to student performance in the Stock-Trak Global Portfolio Trading Simulation. We find that males and females exhibit different behavioral biases and these behavioral biases can ultimately affect investment performance. We also find evidence to support previous research showing that males are more risk tolerant than females. However, our findings indicate that this behavior may be due to a difference in the perception of the actual risk being taken rather than an inherent desire to engage in more risky behavior.", "num_citations": "44\n", "authors": ["1949"]}
{"title": "Research for practice: the DevOps phenomenon\n", "abstract": " An executive crash course.", "num_citations": "42\n", "authors": ["1949"]}
{"title": "Encouraging knowledge contribution in IT support: social context and the differential effects of motivation type\n", "abstract": " Purpose                – This paper aims to investigate how to promote two types of knowledge contribution tasks. The authors focus on the role of supervisor and coworker support on motivation, and their effects on two different contribution tasks. Motivating employees to contribute knowledge is quite challenging. While previous studies have tried to understand how to promote knowledge contribution, few have differentiated between knowledge contribution tasks.                                        Design/methodology/approach                – Information technology support was chosen as the context of this study, and data were collected from system administrators within a Fortune 500 company via a web-based survey.                                        Findings                – Results show the differential effects of two forms of motivation on different contribution tasks, and supervisor support is positively associated with intrinsic motivation …", "num_citations": "37\n", "authors": ["1949"]}
{"title": "Work practices of system administrators: implications for tool design\n", "abstract": " System administrators are specialized workers and computer users. As skilled workers in complex and high-risk environments, intuition tells us this unique user group may have requirements of the systems and software they use that differ from the requirements of regular computer users. An examination of system administrator work practices sheds light on the system attributes and characteristics they need to do their jobs. Through shadowing, interviews, and a review of previous system administrator studies, we present information and system quality attributes that appear to be important to system administrators. Following a discussion of these attributes, we present a model of user satisfaction that provides actionable guidance and an integration of the attributes. We close with a discussion of the research findings and a call for future research in this area.", "num_citations": "35\n", "authors": ["1949"]}
{"title": "The integrated user satisfaction model: Assessing information quality and system quality as second-order constructs in system administration\n", "abstract": " While many studies have investigated the relationship between information systems (IS) characteristics and IS use, the results have been inconsistent. We argue that this inconsistency may be due to the modeling of information and system quality and the importance of the system usage context. We extend Wixom and Todd’s (2005) integrated model of IS satisfaction by proposing and modeling information and system quality as second-order constructs and by testing the model in the system administration context. Our findings provide support for modeling information and system quality as second-order constructs in the integrated model. Furthermore, our findings support using additional constructs, unique to the context studied, in the integrated model. We contribute to current literature by 1) enhancing the construct validity of information and system quality, which ultimately improves statistical conclusion validity and internal validity for studies that focus on information and system quality; and 2) testing the extended model in the system administration context. Our findings suggest that future research should measure information quality and system quality as second-order constructs and that including context-specific information and system characteristics provides researchers and practitioners with a better understanding of IS characteristics important in system administration.", "num_citations": "33\n", "authors": ["1949"]}
{"title": "Learning fractions by splitting: Using learning analytics to illuminate the development of mathematical understanding\n", "abstract": " The struggle with fraction learning in kindergarten through Grade 12 in the United States is a persistent problem and one of the major stumbling blocks to succeeding in higher mathematics. Research into this problem has identified several areas where students commonly struggle with fractions. While there are many theories of fraction learning, none of the research on these theories employs samples large enough to test theories at scale or nuanced enough to demonstrate how learning unfolds over time during instructional activities based on these theories. The work reported here uses learning analytics methods with fine-grained log data from an online fraction game to unpack how splitting (i.e. partitioning a whole into equal-sized parts) impacts learning. Study 1 demonstrated that playing the game significantly improved students’ fraction understanding. In addition, a cluster analysis suggested that exploring …", "num_citations": "33\n", "authors": ["1949"]}
{"title": "Studying knowledge management system success in system administration\n", "abstract": " Significant temporal and monetary costs are associated with the development and implementation of a knowledge management system (KMS). To justify this investment, it is important for organizations to measure the success of such systems. To help achieve this objective, this paper proposes a KMS success model, which is based on prior success models for information systems (IS) and KMS. This model extends previous models by investigating two modes of KMS use - knowledge sourcing and sharing. Additionally, individual impact is extended to include both merit (perceived usefulness) and worth (productivity) metrics. By also taking into account the effects of other knowledge sources, such as Google, email, and instant messaging, we are able to explore the contribution of KMS use. This research in progress proposes testing the model in the context of system administrators, technical experts who work in …", "num_citations": "32\n", "authors": ["1949"]}
{"title": "DevOps metrics\n", "abstract": " Your biggest mistake might be collecting the wrong data.", "num_citations": "31\n", "authors": ["1949"]}
{"title": "Novice programmers talking about projects: What automated text analysis reveals about online Scratch users' comments\n", "abstract": " In this paper we examine the possibilities of applying predictive analysis to users' written communication via comments in an open-ended online social networking forum: Scratch.mit.edu. Scratch is primarily used by youth ages 8-16 years to program software like games, animations, and stories; their social interactions take place around commenting, remixing, and sharing computer programs (called projects). This exploratory work contributes to work in educational data mining by broadly describing and comparing comments about projects versus other topics in Scratch. Referencing communication accommodation theory, we found that user comments about projects exhibited different linguistic cues than other comments, and these cues were successfully used to classify comment topic. Further, results also suggest that project comments embody richer language than other comments. This suggests several future …", "num_citations": "24\n", "authors": ["1949"]}
{"title": "Examining IS curriculum profiles and the IS 2010 model curriculum guidelines in AACSB-accredited schools\n", "abstract": " The IS 2010 Model Curriculum Guidelines were developed to provide recommendations for standardized information systems curricula while simultaneously allowing for customization within individual programs. While some studies have examined program adherence to the IS 2010 Model Curriculum Guidelines, a more detailed analysis of IS curriculum profiles has not yet been conducted. The purpose of this study is to identify and describe IS curriculum profiles that exist among 127 AACSB IS programs using the IS 2010 guidelines as a framework for analysis. A cluster analysis reveals four distinct profiles of IS program structure: Independent, Focused, Adoptive, and Flexible. Prototypes of each profile are described along with significant differences between each profile as revealed by a discriminant analysis. Identifying and describing these curriculum profiles offers a snapshot of the state of the IS curriculum as a whole and provides a resource for programs seeking to examine and modify their respective curriculum models.", "num_citations": "22\n", "authors": ["1949"]}
{"title": "Designing Tools for System Administrators: An Empirical Test of the Integrated User Satisfaction Model.\n", "abstract": " System administrators are unique computer users. As power users in complex and high-risk work environments, intuition tells us that they may have requirements of the tools they use that differ from those of regular computer users. This paper presents and empirically validates a model of user satisfaction within the context of system administration that accounts for the needs of system administrators. The data were collected through a survey of 125 system administrators and analyzed using structural data modeling techniques. The empirical results of this preliminary investigation demonstrate that user satisfaction models are appropriate in the context of system administration and support the idea that system administrators have unique system and information needs from the tools they use.", "num_citations": "22\n", "authors": ["1949"]}
{"title": "The role of continuous delivery in IT and organizational performance\n", "abstract": " This study investigates the impacts of continuous delivery practices in organizations. Continuous delivery is a set of practices designed to optimize the process of taking changes from version control to production or release to manufacturing. Key elements include comprehensive use of version control, automation of the test and deployment process, and the application of continuous integration to rapidly validate the correctness of every change through running the automated build and test process. When viewed through the lens of organizational capabilities theory, CD is an inside-out spanning process. We propose that the use of CD in organizations affects factors that impact the tech workforce today (eg, perceived burnout and deployment pain), and software delivery performance (eg, change fail rates and IT performance). We also propose that it indirectly influences organizational performance through IT performance (which is itself a spanning process). We empirically test our model with survey data collected from 4,976 respondents around the world, and find that our hypotheses are supported. The paper’s implications for research and practice are discussed.", "num_citations": "20\n", "authors": ["1949"]}
{"title": "DevOps: Profiles in ITSM performance and contributing factors\n", "abstract": " This paper describes IT performance using the Economic Order Quantity (EOQ) model, and presents the key factors of effective information technology (IT) team performance in the context of DevOps and IT service management. It then presents the development of a construct to measure IT team performance in the context of DevOps, based on three factors, two throughput measures (lead time to deploy and deployment frequency) and a stability measure (mean time to recover); these correspond to EOQ variables batch size (measured as deployment frequency) and transaction cost (lead time to deploy and mean time to recover). Based on a sample of 7,522 IT professionals worldwide, we conduct a hierarchical cluster analysis and find that the throughput and stability measures move together, consistent with EOQ. The analysis reveals three IT performance profiles: high, medium, and low. Further analysis shows that innovations can be used to impact these IT performance profiles. Implications for research and practice are discussed.", "num_citations": "18\n", "authors": ["1949"]}
{"title": "A service delivery platform for server management services\n", "abstract": " Computer server management is an important component of the global IT (information technology) services business. The providers of server management services face unrelenting efficiency challenges in order to remain competitive with other providers. Server system administrators (SAs) represent the majority of the workers in this industry, and their primary task is server management. Since system administration is a highly skilled position, the costs of employing such individuals are high, and thus, the challenge is to increase their efficiency so that a given SA can manage larger numbers of servers. In this paper, we describe a widely deployed Service Delivery Portal (SDP) in use throughout the Server Systems Operations business of IBM that provides a set of well-integrated technologies to help SAs perform their tasks more efficiently. The SDP is based on three simple design principles: 1) user interface …", "num_citations": "17\n", "authors": ["1949"]}
{"title": "Sysadmins and the need for verification information\n", "abstract": " Traditional usability measures may not be sufficient for some specialized users, such as system administrators. Because of their broad range of responsibilities for highly complex and risky business environments, these users also need tools that are powerful, informative, and credible. To do their work, system administrators need the ability to verify the work they have done. That verification comes from accurate and available information that we refer to as information credibility. This exploratory research aims to address the relationship between task complexity, task risk, and verification information seeking in GUI tools used by system administrators. Potential antecedents of information verification are identified and a model is proposed that addresses how aspects of the task and environment affect the need for verification. Findings suggest that task complexity is a significant indicator of the need for verification …", "num_citations": "17\n", "authors": ["1949"]}
{"title": "Detecting deception in synchronous computer-mediated communication using speech act profiling\n", "abstract": " Detecting deception is a complicated endeavor. Previous attempts at deception detection in computer-mediated communication have met with some success. This study shows how speech act profiling [1] can be used to aid deception detection in synchronous computer-mediated communication (S-CMC). Chat logs from an online group game where deception was introduced were subjected to speech act profiling analysis. The results provide some support to previous research showing greater uncertainty in deceptive S-CMC. Also shown is that deceivers in the specific task tend to engage in less strategizing than non-deceivers.", "num_citations": "16\n", "authors": ["1949"]}
{"title": "System administrators as broker technicians\n", "abstract": " This research investigates the work practices of system administrators. Using semi-structured interviews and an analysis of existing system administrator literature, we theorize that system administrators act as technical brokers who bridge two communities, the end users they support and their own technical community. We also show that system administrators, like other technical workers, rely on contextual knowledge. This knowledge is largely acquired through practice and less through formal education and certification. Through a discussion of common reactive and proactive system administrator duties, we present system administrators as broker technicians who must mediate between the end users they support and their technical community. We end with a discussion of the changing role of sysadmins as their tools and users get more sophisticated.", "num_citations": "14\n", "authors": ["1949"]}
{"title": "Who's Learning? Using Demographics in EDM Research.\n", "abstract": " The growing use of machine learning for the data-driven study of social issues and the implementation of data-driven decision processes has required researchers to re-examine the often implicit assumption that datadriven models are neutral and free of biases. The careful examination of machine-learned models has identified examples of how existing biases can inadvertently be perpetuated in fields such as criminal justice, where failing to account for racial prejudices in the prediction of recidivism can perpetuate or exasperate them, and natural language processing, where algorithms trained on human languages corpora have been shown to reproduce strong biases in gendered descriptions. These examples highlight the importance of thinking about how biases might impact the study of educational data and how data-driven models used in educational contexts may perpetuate inequalities. To understand this question, we ask whether and how demographic information, including age, educational level, gender, race/ethnicity, socioeconomic status (SES), and geographical location, is used in Educational Data Mining (EDM) research. Specifically, we conduct a systematic survey of the last five years of EDM publications that investigates whether and how demographic information about the students is reported in EDM research and how this information is used to 1) investigate issues related to demographics, 2) use the information as input features for data-driven analyses, or 3) to test and validate models. This survey shows that, although a majority of publications reported at least one category of demographic information, the frequency of …", "num_citations": "12\n", "authors": ["1949"]}
{"title": "Encrypting data in volatile memory\n", "abstract": " Provided are a computer program product, system, and method to allocate blocks of memory in a memory device having a plurality of blocks. At least one unencrypted memory allocation function coded in an application is executed to request allocation of unencrypted blocks in the memory device. An encrypted memory allocation function coded in the application is executed to request allocation of encrypted blocks in the memory device. At least one unencrypted Input/Output (I/O) request function coded in the application indicating an I/O operation to perform against the unencrypted blocks in the memory device is executed. At least one encrypted I/O request function coded in the application indicating an I/O operation to perform against the encrypted blocks in the memory device is executed. An operating system uses an encryption key associated with the encrypted blocks to encrypt or decrypt data in the encrypted …", "num_citations": "11\n", "authors": ["1949"]}
{"title": "Automated determination of the veracity of interview statements from people of interest to an operational security force\n", "abstract": " In deception detection research validity issues have been raised when subjects are used in controlled laboratory experiments. Studying real-life deception detection is a complicated endeavor because researchers do not have the control in field studies that exist in laboratory experiments so determining ground truth is challenging. This study reports the findings of the combination of some successful previous attempts at automated deception detection in computer-mediated communication results of a study of real-world data from an operation security force. Message feature mining is used to evaluate the effectiveness of technology as an aid to deception detection in actual stressful situations with unpleasant long term consequences. The study analyzes 18 statements (9 truthful, 9 deceptive) from a military service’s investigative unit using message feature mining. The analysis resulted in a 72% rate of accuracy in …", "num_citations": "11\n", "authors": ["1949"]}
{"title": "DevOps delivers\n", "abstract": " In many organizations across all industries, the core value of the business is now being delivered through software. For decades, software was carefully planned and then developed and delivered in lockstep processes (called phase gate or waterfall) that mirrored other disciplines such as architecture: planning, followed by design, then development, which was then handed off to testing and QA, and finally to operations for maintenance. This carefully orchestrated process with predefined deliverables and several strict hand-offs worked well enough for a time but did not allow for flexibility, changing requirements, or—most importantly—an increasingly competitive landscape that demanded speed in the way we deliver software that allows us to respond to customer demands and security threats.DevOps is a software development and delivery methodology that provides exactly this: increased speed and stability while …", "num_citations": "10\n", "authors": ["1949"]}
{"title": "The impact of a secondary market on video game purchase intentions\n", "abstract": " The secondary market for video game purchases is a multi-billion dollar industry that some believe is unfair to video game developers. Using the Theory of Reasoned Action (TRA), we investigated user attitudes and subjective norms and their affect on a consumers intention to buy new video games. While TRA has been used to study purchase intentions of material goods and digital goods, our study extends this work to investigate video games, which have both a physical and digital component. Based on a survey of 118 undergraduate students, two of the hypothesized relationships are significant predictors of intention to purchase: previous experience in the primary market and access to the secondary market. The results of this study highlight the applicability of TRA to the video game market, suggest marketing strategies for video game developers, and caution against criminalizing the resale of video games.", "num_citations": "10\n", "authors": ["1949"]}
{"title": "Knowledge exchange roles and EKR performance impact: extending the theory of knowledge reuse\n", "abstract": " Organisations are spending considerable resources on electronic knowledge repositories (EKRs) that should have a positive effect on employees’ EKR performance impact. Seeking to build on and extend the theory of knowledge reuse, this paper focuses on the various roles individuals play in knowledge exchange, and how the knowledge exchange role mediates the effect of previously studied individual perceptual variables (perceived time pressure, extrinsic and intrinsic rewards, and knowledge contribution self-efficacy) on EKR performance impact. In order to identify the various knowledge exchange roles, we simultaneously consider both knowledge contribution process (embedded vs. separate activity) and knowledge reuse (internal EKR, external EKR, colleagues, manuals, knowledge self-reliance). When work is highly specialised and technical as in the context of system administrators, we observed four …", "num_citations": "9\n", "authors": ["1949"]}
{"title": "DORA platform: DevOps assessment and benchmarking\n", "abstract": " In today’s business environment, organizations are challenged with changing customer demands andQuery expectations, competitor pressures, regulatory environments, and increasingly sophisticated outside threats at a faster rate than in years past.", "num_citations": "7\n", "authors": ["1949"]}
{"title": "Accounting information systems (AIS) course design: Current practices and future trajectories\n", "abstract": " The accounting information systems (AIS) course is a core component of most accounting programs, but what it typically covers and how it’s typically taught is as varied as the number of instructors. As the AACSB Standard A7 indicates:“accounting degree programs include learning experiences that develop skills and knowledge related to the integration of information technology in accounting and business”. In this panel presentation, we looked at the approach of five experienced AIS instructors and compared and contrasted them. We highlight lessons learned and best practices.", "num_citations": "7\n", "authors": ["1949"]}
{"title": "2019 accelerate state of devops report\n", "abstract": " The Accelerate State of DevOps Report represents six years of work and data from over 31,000 professionals worldwide. It is the largest and longest-running research of its kind, providing an independent view into the practices and capabilities that drive high performance. The results enable us to understand the practices that lead the powerful business outcomes that result from excellence in technology delivery.", "num_citations": "6\n", "authors": ["1949"]}
{"title": "Examining system administrators’ verification information to enhance IT training design\n", "abstract": " System administrators are faced with a broad range of responsibilities for highly complex environments. They need the ability to verify the work they have done. That verification comes from accurate and available information that we refer to as information credibility. This exploratory research aims to address the relationship between task complexity, task risk, and verification information seeking in graphical user interface (GUI) tools used by system administrators. This research also illustrates the use of verification information as a starting point for a content-centered training design. Potential antecedents of verification information are identified and a model is proposed that addresses how aspects of the task and environment affect the need for verification. Findings suggest that task complexity is a significant indicator of the need for verification information. In addition, findings also suggest that this verification …", "num_citations": "5\n", "authors": ["1949"]}
{"title": "Business intelligence system use as levers of control and organizational capabilities: Effects on internal and competitive benefits\n", "abstract": " This study investigates the organizational benefits of business intelligence (BI) systems. BI systems are management control systems (MCS) that leverage operational and market data. We draw upon levers of control and capability theory, and distinguish among three aspects of BI systems (intelligence, benchmarking, and integration) and two types of organizational benefits: internal (inward-facing) and competitive (outward-facing). We propose that intelligence use of BI (diagnostic use and an inside-out capability) provides internal benefits, whereas benchmarking use of BI,(interactive use and an outside-in capability) provides competitive benefits. We propose that BI integration with other technologies, a spanning capability, contributes to both internal and competitive benefits. Finally, we investigate the effects of information culture, a clan control, on these aspects of BI. We test our model using structural equation modeling with survey data collected from 175 global organizations, and find our hypotheses to be largely supported. Research and practice implications are discussed.", "num_citations": "5\n", "authors": ["1949"]}
{"title": "Using “off‐topic” presentations to engage students and create a sense of community in the classroom\n", "abstract": " Purpose – The purpose of this paper is to present a straightforward technique for engaging students and building a sense of community in the university classroom by allowing students to give brief extra‐credit presentations on topics of personal interest.Design/methodology/approach – The paper includes an overview of the literature related to engagement and “sense of community,” a discussion of the motivation for incorporating “off‐topic” presentations in the university classroom, a description of the presentation requirements and grading practices, and comments on the results of employing the presentations. Because individual perceptions were the goal of this research, survey methodology was used. All items were measured on a five‐point Likert scale and administered to students at the end of the most recent term.Findings – Using survey results, factor analysis, and regression, the paper finds that the …", "num_citations": "5\n", "authors": ["1949"]}
{"title": "Segmenting lecture videos by topic: From manual to automated methods\n", "abstract": " More and more universities and corporations are starting to provide videotaped lectures online for knowledge sharing and learning. Segmenting lecture videos into short clips by topic can extract the hidden information structure of the videos and facilitate information searching and learning. Manual segmentation has high accuracy rates but is very labor intensive. In order to develop a high performance automated segmentation method for lecture videos, we conducted a case study to learn the segmentation process of humans and the effective segmentation features used in the process. Based on the findings from the case study, we designed an automated segmentation approach with two phases: initial segmentation and segmentation refinement. The approach combines segmentation features from three information sources of video (speech text transcript, audio and video) and makes use of various knowledge …", "num_citations": "5\n", "authors": ["1949"]}
{"title": "Adoption of an electronic knowledge repository: A feature-based approach\n", "abstract": " Many organizations dedicate money and time to implement electronic knowledge repositories (EKRs). To better implement these systems and motivate users to contribute knowledge, we must better understand how different types of users actually employ an EKR. While a simplistic view might consider an individual's level of EKR usage as high, medium, or low, a richer, feature-based approach allows us a more developed understanding of EKR usage. To achieve this objective, this paper develops an empirical taxonomy of EKR adoption profiles when other knowledge sources are available through surveys of 108 system administrators at a Fortune 500 Company. The three EKR user profiles - enthusiastic knowledge seeker, thoughtful knowledge provider, and reluctant non-adopter - are distinct in terms of knowledge sourcing behaviors and context.", "num_citations": "4\n", "authors": ["1949"]}
{"title": "Soul of the community: an attempt to assess attachment to a community\n", "abstract": " In this article, we work with data from the Soul of the Community survey project that was conducted by the Knight Foundation from 2008 to 2010. Overall, 26 communities across the United States with a total of more than 47,800 participants took part in this study. Each year, around 200 different questions were posed to each participant. One key variable is attachment to one’s community. In our article, we provide an assessment via various machine learning algorithms which factors may have an effect on attachment.", "num_citations": "3\n", "authors": ["1949"]}
{"title": "Learning aid use patterns and their impact on exam performance in online developmental mathematics\n", "abstract": " Developmental mathematics is a college course aimed to remediate areas missed in high school mathematics. These courses are often offered online, which offers new opportunities to deliver content and learning aids to students. We utilize cluster analysis to identify learning aid use patterns, and then investigate their correlation to subsequent exam performance.", "num_citations": "3\n", "authors": ["1949"]}
{"title": "Enhancing Integrity by Integrating Business Rules, Triggers, and Active Database Techniques\n", "abstract": " Integrity, in database terms, is the quality of trustworthiness that the data in a database is imbued with; high levels of integrity reassure all users of a database system that they can rely on the information they retrieve from the system. It is axiomatic that integrity is crucial to accountants that use and audit such systems because no one would use or rely on a suspect accounting system. One of the most interesting types of integrity concerns is adherence to business rules; those standard operating procedures and policies that dictate how an organization conducts transactions in its business environment. While such rules can be enforced in programs that use the database, if the business rules are implemented within the database, they need not be recreated when new applications are developed but will be automatically enforced for all applications. This practice is ever more widely adopted both because it saves programmers' wages and because it inherently increases the overall integrity of systems adopting it. Two mechanisms for enforcement of business rules at the database level are constraints and triggers. These may be of particular interest and importance to auditors who, given that they are confident of their understanding of the function of such mechanisms, may simply review the triggers and constraints and possibly decide to place greater reliance on the system itself, saving auditor time and increasing the quality of the audit. This paper explains and illustrates trigger and constraint design approaches so as to inform the auditor and facilitate audits involving such systems.", "num_citations": "3\n", "authors": ["1949"]}
{"title": "DevOps Metrics: Your biggest mistake might be collecting the wrong data.\n", "abstract": " Delivering value to the business through software requires processes and coordination that often span multiple teams across complex systems, and involves developing and delivering software with both quality and resiliency. As practitioners and professionals, we know that software development and delivery is an increasingly difficult art and practice, and that managing and improving any process or system requires insights into that system. Therefore, measurement is paramount to creating an effective software value stream. Yet accurate measurement is no easy feat.", "num_citations": "2\n", "authors": ["1949"]}
{"title": "Soul of the community: a first attempt to assess attachment to a community\n", "abstract": " In this article, we work with data from the Soul of the Community survey project that was conducted by the Knight Foundation from 2008 to 2010. Overall, 26 communities across the United States with a total of more than 47,800 participants took part in this study. Each year, around 200 different questions had to be answered by each participant. One key variable is attachment to one’s community. In our article, we provide an initial assessment via various Machine Learning Algorithms which factors may have an effect on attachment.", "num_citations": "2\n", "authors": ["1949"]}
{"title": "Municipal Information Systems: Current Practices and Issues\n", "abstract": " Interesting strategic and creative uses of IT in municipalities has been under-reported as there has been a major emphasis on for-profit entities. System integration, GIS, and other applications of IT create challenges and opportunities that seem unique to local governments. With the new GASB 34 that mandates state and local government information reporting, smart and creative IT application is critical. We discuss these points and our observations from interviewing the IT managers from some local governments.", "num_citations": "2\n", "authors": ["1949"]}
{"title": "Theories in Flux: Reimagining Theory Building in the Age of Machine Learning\n", "abstract": " Researchers employ methodologies that rely on contemporary technologies to study phenomenon. Recent advances in artificial intelligence (AI), particularly machine learning (ML), have intensified the speed, and our abilities, to create and deploy new knowledge for constructing theories (Abbasi et al. 2016). The availability of big data and ML tools is no longer the sole domain of academics. Business processes generate large amounts of data and now practitioners also deploy ML-enabled methodologies to create new knowledge through working theories.This presents an opportunity for Information Systems (IS) academics to collaborate with practitioners by addressing their business problems while also creating new theories that have the potential to serve as building blocks toward a generalizable theoretical contribution. As IS is an applied discipline, IS academics must uphold methodological rigor when new technologies, such as ML, offer new methods of knowledge creation.", "num_citations": "1\n", "authors": ["1949"]}
{"title": "A Taxonomy of Software Delivery Performance Profiles: Investigating the Effects of DevOps Practices\n", "abstract": " This research develops a taxonomy of Software Delivery Performance Profiles for DevOps development settings. We base the underlying Software Delivery Performance measure on the application of the Economic Order Quantity (EOQ) model to software development. Consistent with the objectives of both, development and operations departments, the measure includes attributes for throughput (release frequency and lead-time to delivery) and for stability (mean time to restore). Hierarchical cluster analysis on a global sample of 7,522 DevOps professionals results in three distinct Software Delivery Performance Profiles; in addition, the results indicate that the measures for throughput and stability move in tandem. Further analysis will show how the use of individual DevOps practices impacts Performance Profiles of development settings. When completed, the study will support the utility of DevOps and the effectiveness of individual DevOps practices.", "num_citations": "1\n", "authors": ["1949"]}
{"title": "GEM: A General E-Commerce Data Model for Strategic Advantage\n", "abstract": " This paper includes a general data model that supports e-commerce activity. Numerous data models have been presented which support traditional business activities, but none has yet addressed the specific needs of e-commerce systems. An e-commerce system has unique opportunities to capture information about the entire online experience of each customer. Our general e-commerce data model (GEM) captures information such as the length of time a customer spends on a given web page, pictures that are examined or are “clicked on”, and the characteristics of visits which lead to customer purchases. GEM will be extremely useful to many e-commerce personnel including marketing strategists as they will be able to determine which parts of a web page visit lead to successful and unsuccessful visits. Additionally, GEM is designed to facilitate business intelligence (BI), which concerns the area of electronically …", "num_citations": "1\n", "authors": ["1949"]}