{"title": "Understanding service-oriented software\n", "abstract": " Many hail service-oriented software as the next revolution in software development. Web services' capabilities are constantly expanding from simple message passing toward the construction of full-fledged applications such as those envisaged by the UK's Pennine Group in their Software as a Service (SaaS) framework. These new, service-oriented approaches appear to many to solve the significant issue of software inflexibility that arises during maintenance and evolution. While they address sonic aspects of the problem, however, understanding the software still poses some difficulty. This shift toward service orientation compels us to consider its implications for software understanding, which is potentially the primary cost in software engineering. Using an example of on-the-fly software services construction, we discuss the problems software engineers still face when working with service-oriented software. We …", "num_citations": "314\n", "authors": ["567"]}
{"title": "An architectural model for service-based software with ultra rapid evolution\n", "abstract": " There is an urgent industrial need for new approaches to software evolution that will lead to far faster implementation of software changes. For the past 40 years, the techniques, processes and methods of software development have been dominated by supply side issues, and as a result the software industry is oriented towards developers rather than users. Existing software maintenance processes are simply too slow to meet the needs of many businesses. To achieve the levels of functionality, flexibility and time to market of changes and updates required by users, a radical shift is required in the development of software, with a more demand-centric view leading to software which will be delivered as a service, within the framework of an open marketplace. Although there are some signs that this approach is being adopted by industry, it is in a very limited and restricted form. We summarise research that has resulted …", "num_citations": "76\n", "authors": ["567"]}
{"title": "Motive, gesture and the analysis of performance\n", "abstract": " This chapter also reverses a common tendency to assign the status of musical gestures to conventional musical motives. 2 In contrast, we regard the gestures created in and through performance as potentially having motivic functions within the performed music. Such ‘motives’ are defined not in terms of pitch, harmony or rhythm, however, but as expressive patterns in timing, dynamics, articulation, timbre and/or other performative parameters that maintain their identity upon literal or varied repetition. 3 The essential point has to do with the nature and function of the given patterns. By way of example, the following discussion focuses on select", "num_citations": "62\n", "authors": ["567"]}
{"title": "Lessons learned in exploring the Leap Motion™ sensor for gesture-based instrument design\n", "abstract": " The Leap Motion™ sensor offers fine-grained gesture-recognition and hand tracking. Since its release, there have been several uses of the device for instrument design, musical interaction and expression control, documented through online video. However, there has been little formal documented investigation of the potential and challenges of the platform in this context. This paper presents lessons learned from work-in-progress on the development of musical instruments and control applications using the Leap Motion™ sensor. Two instruments are presented: Air-Keys and Air-Pads and the potential for augmentation of a traditional keyboard is explored. The results show that the platform is promising in this context but requires various challenges, both physical and logical, to be overcome.", "num_citations": "61\n", "authors": ["567"]}
{"title": "The form of performance: analyzing pattern distribution in select recordings of Chopin's Mazurka Op. 24 No. 2\n", "abstract": " Performances of the same piece can differ from one another in innumerable ways and for many different reasons. The aim of the current study is to analyze the timing and dynamic patterns of a large sample of performances in order to explore the musical reasons for both the occurrence of such patterns and the differences in their location and characteristics. The investigation focuses on twenty-nine performances of Chopin's Mazurka Op. 24 No. 2, which features clear four-bar phrases and correspondingly consistent sectional units, but which also has characteristics such as a steady crotchet accompaniment that remain constant throughout. This results in a potential tension between “through-performed” and sectionalized features. In this study we examine the performances accordingly, investigating the relationship between the work's structural and thematic characteristics on the one hand and the timing and …", "num_citations": "35\n", "authors": ["567"]}
{"title": "Musically informed sonification for chronic pain rehabilitation: Facilitating progress & avoiding over-doing\n", "abstract": " In self-directed chronic pain physical rehabilitation it is important that the individual can progress as physical capabilities and confidence grow. However, people with chronic pain often struggle to pass what they have identified as safe boundaries. At the same time, over-activity due to the desire to progress fast or function more normally, may lead to setbacks. We investigate how musically-informed movement sonification can be used as an implicit mechanism to both avoid overdoing and facilitate progress during stretching exercises. We sonify an end target-point in a stretch exercise, using a stable sound (ie, where the sonification is musically resolved) to encourage movements ending and an unstable sound (ie, musically unresolved) to encourage continuation. Results on healthy participants show that instability leads to progression further beyond the target-point while stability leads to a smoother stop beyond this …", "num_citations": "34\n", "authors": ["567"]}
{"title": "Hypothesis-based concept assignment to support software maintenance\n", "abstract": " Software maintenance is typically the most expensive part of the software lifecycle, with program comprehension forming the most costly part of software maintenance. This paper outlines a method for assisting program comprehension by addressing the concept assignment problem. The method, termed Hypothesis-Based Concept Assignment, uses informal information contained within source code to reason plausibly about the concepts contained within the code. An extensive evaluation has shown that the method can accurately recognise concepts in a range of real-world programs.", "num_citations": "34\n", "authors": ["567"]}
{"title": "Spatial complexity metrics: an investigation of utility\n", "abstract": " Software comprehension is one of the largest costs in the software lifecycle. In an attempt to control the cost of comprehension, various complexity metrics have been proposed to characterize the difficulty of understanding a program and, thus, allow accurate estimation of the cost of a change. Such metrics are not always evaluated. This paper evaluates a group of metrics recently proposed to assess the \"spatial complexity\" of a program (spatial complexity is informally defined as the distance a maintainer must move within source code to build a mental model of that code). The evaluation takes the form of a large-scale empirical study of evolving source code drawn from a commercial organization. The results of this investigation show that most of the spatial complexity metrics evaluated offer no substantially better information about program complexity than the number of lines of code. However, one metric shows …", "num_citations": "33\n", "authors": ["567"]}
{"title": "A framework for understanding conceptual changes in evolving source code\n", "abstract": " As systems evolve, they become harder to understand because the implementation of concepts (e.g. business rules) becomes less coherent. To preserve source code comprehensibility, we need to be able to predict how this property will change. This would allow the construction of a tool to suggest what information should be added or clarified (e.g. in comments) to maintain the code's comprehensibility. We propose a framework to characterize types of concept change during evolution. It is derived from an empirical investigation of concept changes in evolving commercial COBOL II files. The framework describes transformations in the geometry and interpretation of regions of source code. We conclude by relating our observations to the types of maintenance performed and suggest how this work could be developed to provide methods for preserving code quality based on comprehensibility.", "num_citations": "32\n", "authors": ["567"]}
{"title": "Hypothesis-based concept assignment in software maintenance\n", "abstract": " Software maintenance accounts for a significant proportion of the lifetime cost of a software system. Software comprehension is required in many parts of the maintenance process and is one of the most expensive activities. Many tools have been developed to help the maintainer reduce the time and cost of this task, but of the numerous tools and methods available one group has received relatively little attention: those using plausible reasoning to address the concept assignment problem. We present a concept assignment method for COBOL II: hypothesis-based concept assignment (HB–CA). An implementation of a prototype tool is described, and the results from a comprehensive evaluation using commercial COBOL II sources summarised. In particular, we identify areas of a standard maintenance process where such methods would be appropriate, and discuss the potential cost savings that may result.", "num_citations": "32\n", "authors": ["567"]}
{"title": "Allowing overlapping boundaries in source code using a search based approach to concept binding\n", "abstract": " One approach to supporting program comprehension involves binding concepts to source code. Previously proposed approaches to concept binding have enforced non-overlapping boundaries. However, real-world programs may contain overlapping concepts. This paper presents techniques to allow boundary overlap in the binding of concepts to source code. In order to allow boundaries to overlap, the concept binding problem is reformulated as a search problem. It is shown that the search space of overlapping concept bindings is exponentially large, indicating the suitability of sampling-based search algorithms. Hill climbing and genetic algorithms are introduced for sampling the space. The paper reports on experiments that apply these algorithms to 21 COBOL II programs taken from the commercial financial services sector. The results show that the genetic algorithm produces significantly better solutions than …", "num_citations": "28\n", "authors": ["567"]}
{"title": "Program comprehension for web services\n", "abstract": " Web services provide programmatic interaction between organisations within large heterogeneous distributed systems. Using recent experiences of constructing and enhancing a data integration system for the health domain, based on Web services, we draw conclusions about new problems for program comprehension. These derive from the fundamentally dynamic and distributed nature of the environment. We suggest several key research topics for program comprehension, arguing that these are crucial if software constructed from Web services is to be supportable over a long period. Finally, we briefly summarise some wider conclusions about understanding Web services at the application domain level.", "num_citations": "26\n", "authors": ["567"]}
{"title": "The digital music lab: A big data infrastructure for digital musicology\n", "abstract": " In musicology and music research generally, the increasing availability of digital music, storage capacities, and computing power enable and require new and intelligent systems. In the transition from traditional to digital musicology, many techniques and tools have been developed for the analysis of individual pieces of music, but large-scale music data that are increasingly becoming available require research methods and systems that work on the collection-level and at scale. Although many relevant algorithms have been developed during the past 15 years of research in Music Information Retrieval, an integrated system that supports large-scale digital musicology research has so far been lacking. In the Digital Music Lab (DML) project, a collaboration among music librarians, musicologists, computer scientists, and human-computer interface specialists, the DML software system has been developed that fills this …", "num_citations": "25\n", "authors": ["567"]}
{"title": "Hypothesis-based concept assignment to support software maintenance\n", "abstract": " Software comprehension is one of the most expensive activities in software maintenance and many tools have been developed to help the maintainer reduce the time and cost of the task. Of the numerous tools and methods available, one group has received relatively little attention: those using plausible reasoning to address the concept assignment problem. This problem is defined as the process of assigning descriptive terms to their implementation in source code, the terms being nominated by a user and usually relating to computational intent. It has two major research issues: Segmentation: finding the location and extent of concepts in the source code.Concept Binding', determining which concepts are implemented at these locations. This thesis presents a new concept assignment method: Hypothesis-Based Concept Assignment (HB-CA). A framework for the activity of software comprehension is defined using elements of psychological theory and software tools. In this context, HB-CA is presented as a successful concept assignment method for COBOL II, employing a simple knowledge base (the library) to model concepts, source code indicators, and inter-concept relationships. The library and source code are used to generate hypotheses on which segmentation and concept binding are performed. A two-part evaluation is presented using a prototype implementation of HB-CA. The first part shows that HB-CA has linear computational growth in the length of program under analysis. Other characteristics addressed include HB-CA's scalability, its applicability to other languages, the contribution made by different information sources, domain …", "num_citations": "25\n", "authors": ["567"]}
{"title": "The Meaning of\" legacy Systems\"\n", "abstract": " To facilitate research under the SEBPC programme’s theme on legacy systems, some agreement must be reached on what the term\" legacy system\" means, what problems such systems have, and what the characteristics of solutions may be. This report addresses these points providing a possible definition of the term “legacy system”, and discussing failures and solutions. The definition is approached from three levels to elicit a clearer understanding of the problems facing the various parts of an organisation with respect to its legacy systems.", "num_citations": "24\n", "authors": ["567"]}
{"title": "A reference architecture and score representation for popular music human-computer music performance systems\n", "abstract": " Popular music (characterized by improvised instrumental parts, beat and measure-level organization, and steady tempo) poses challenges for human-computer music performance (HCMP). Pieces of music are typically rearrangeable on-the-fly and involve a high degree of variation from ensemble to ensemble, and even between rehearsal and performance. Computer systems aiming to participate in such ensembles must therefore cope with a dynamic high-level structure in addition to the more traditional problems of beat-tracking, score-following, and machine improvisation. There are many approaches to integrating the components required to implement dynamic human-computer music performance systems. This paper presents a reference architecture designed to allow the typical sub-components (e.g. beat-tracking, tempo prediction, improvisation) to be integrated in a consistent way, allowing them to be combined and/or compared systematically. In addition, the paper presents a dynamic score representation particularly suited to the demands of popular music performance by computer.", "num_citations": "23\n", "authors": ["567"]}
{"title": "Analysing symbolic music with probabilistic grammars\n", "abstract": " Recent developments in computational linguistics offer ways to approach the analysis of musical structure by inducing probabilistic models (in the form of grammars) over a corpus of music. These can produce idiomatic sentences from a probabilistic model of the musical language and thus offer explanations of the musical structures they model. This chapter surveys historical and current work in musical analysis using grammars, based on computational linguistic approaches. We outline the theory of probabilistic grammars and illustrate their implementation in Prolog using PRISM. Our experiments on learning the probabilities for simple grammars from pitch sequences in two kinds of symbolic musical corpora are summarized. The results support our claim that probabilistic grammars are a promising framework for computational music analysis, but also indicate that further work is required to establish their …", "num_citations": "19\n", "authors": ["567"]}
{"title": "Programming style changes in evolving source code\n", "abstract": " As programs evolve they become harder to maintain as the source code becomes more difficult to comprehend. One aspect of comprehensibility is related to the programming style exhibited by the program. However, as this aspect itself is changed during the maintenance process, we must attempt to maintain the original programming style quality to maintain the comprehensibility of the program. This paper presents the initial findings of an investigation of how one area of programming style (typographical style), changes over the lifetime of a program. The aim is to draw upon these findings to indicate how typographical style should be measured, and where necessary changed, to ensure program comprehensibility.", "num_citations": "18\n", "authors": ["567"]}
{"title": "Methods and prospects for human–computer performance of popular music\n", "abstract": " Computers are often used in performance of popular music, but most often in very restricted ways, such as keyboard synthesizers where musicians are in complete control, or pre-recorded or sequenced music where musicians follow the computer's drums or click track. An interesting and yet little-explored possibility is the computer as highly autonomous performer of popular music, capable of joining a mixed ensemble of computers and humans. Considering the skills and functional requirements of musicians leads to a number of predictions about future human–computer music performance (HCMP) systems for popular music. We describe a general architecture for such systems and describe some early implementations and our experience with them.", "num_citations": "17\n", "authors": ["567"]}
{"title": "From system comprehension to program comprehension\n", "abstract": " Program and system comprehension are vital parts of the software maintenance process. We discuss the need for both perspectives and describe two methods that may be integrated to provide a smooth transition in understanding from the system level to the program level. Results from a qualitative survey of expert industrial software maintainers, their information needs and requirements when comprehending software are initially presented. We then review existing software tools which facilitate system level and program comprehension. Two successful methods from the fields of data mining and concept assignment are discussed, each addressing some of these requirements. We also describe how these methods can be coupled to produce a broader software comprehension method which partly satisfies all the requirements. Future directions including the closer integration of the techniques are also identified.", "num_citations": "16\n", "authors": ["567"]}
{"title": "Active Scores: Representation and Synchronization in Human–Computer Performance of Popular Music\n", "abstract": " Computers have the potential to significantly extend the practice of popular music based on steady tempo and mostly determined form. There are significant challenges to overcome, however, due to constraints including accurate timing based on beats and adherence to a form or structure despite possible changes that may occur, possibly even during performance. We describe an approach to synchronization across media that takes into account latency due to communication delays and audio buffering. We also address the problem of mapping from a conventional score with repeats and other structures to an actual performance, which can involve both “flattening” the score and rearranging it, as is common in popular music. Finally, we illustrate the possibilities of the score as a bidirectional user interface in a real-time system for music performance, allowing the user to direct the computer through a digitally …", "num_citations": "15\n", "authors": ["567"]}
{"title": "A flexible method for segmentation in concept assignment\n", "abstract": " Software comprehension is one of the most expensive activities in software maintenance and many tools have been developed to help the maintainer reduce the time and cost of the task. Of the numerous tools and methods available, one group has received relatively little attention: those using plausible reasoning to address the concept assignment problem. This problem is defined as the process of assigning descriptive terms to their implementation in source code, the terms being nominated by a maintainer and usually relating to computational intent. We present a new concept assignment method for COBOL II: Hypothesis-Based Concept Assignment (HB-CA). It employs a simple knowledge base to model concepts, source code indicators, and inter-concept relationships. An implementation of a prototype tool is described, and the results from a comprehensive evaluation using COBOL II sources summarised.", "num_citations": "15\n", "authors": ["567"]}
{"title": "Musical expectancy in squat sonification for people who struggle with physical activity\n", "abstract": " Physical activity is important for a healthy lifestyle. However, it can be hard to stay engaged with exercise and this can often lead to avoidance. Sonification has been used to support physical activity through the optimisation/correction of movement. Though previous work has shown how sonification can improve movement execution and motivation, the specific mechanisms of motivation have yet to be investigated in the context of challenging exercises. We investigate the role of music expectancy as a way to leverage people’s implicit and embodied understanding of music within movement sonification to provide information on technique while also motivating continuation of movement and rewarding its completion. The paper presents two studies showing how this musically informed sonification can be used to support the squat movement. The results show how musical expectancy impacted people’s perception of their own movement, in terms of reward, motivation and movement behaviour and the way in which they moved.", "num_citations": "12\n", "authors": ["567"]}
{"title": "Comparing models of symbolic music using probabilistic grammars and probabilistic programming\n", "abstract": " We conduct a systematic comparison of several probabilistic models of symbolic music, including zeroth and first order Markov models over pitches and intervals, a hidden Markov model over pitches, and a probabilistic context free grammar with two parameterisations, all implemented uniformly using a probabilistic programming language (PRISM). This allows us to take advantage of variational Bayesian methods for learning parameters and assessing the goodness of fit of the models in a principled way. When applied to a corpus of Bach chorales and the Essen folk song collection, we show that, depending on various parameters, the probabilistic grammars sometimes but not always out-perform the simple Markov models. On looking for evidence of overfitting of complex models to small datasets, we find that even the smallest dataset is sufficient to support the richest parameterisation of the probabilistic grammars. However, examining how the models perform on smaller subsets of pieces, we find that the simpler Markov models do indeed out-perform the best grammar-based model at the small end of the scale.", "num_citations": "10\n", "authors": ["567"]}
{"title": "Motivating students in Software Engineering group projects: an experience report\n", "abstract": " Motivating students to engage with their subject is an ongoing challenge in higher education, particularly in science and engineering. This paper presents experiences gained in introducing robotics as a means to increase engagement with a second-year undergraduate software-engineering group-project module forming part of a computer science degree programme. Robotics is well-established as an effective platform for teaching parts of the computer science curriculum. Nonetheless, the approach is not universally adopted and experience reports are helpful to those introducing robotics to the curriculum for the first time, particularly where robotics itself is not a main curriculum focus. This report presented here aims to identify strengths and weaknesses, and expose lessons learned from what was a broadly successful experience, of which students reported high motivation and enjoyment. Nonetheless some …", "num_citations": "10\n", "authors": ["567"]}
{"title": "Plus ça change: Analyzing performances of chopin’s mazurka op. 24 no. 2\n", "abstract": " Performances of the same piece can differ from one another in innumerable ways and for many different reasons. Such differences are of considerable interest to musicologists and psychologists. The aim of the current study is to analyze the timing and dynamic patterns of numerous performances in order to explore the musical reasons for use as well as differences in use of those patterns. More specifically it investigates the relationship between 1) structural and thematic characteristics of a piece and the timing and dynamic characteristics of performances of that work and 2) the relationship between patterns of timing and those of dynamics. A new methodology is developed and applied which enables the systematic analysis and comparison of different performances by identifying patterns of performance, or performance motives, and their location in performance. The results show that, in general, the structure of a …", "num_citations": "10\n", "authors": ["567"]}
{"title": "Change effects and legacy information systems: A framework to aid our understanding\n", "abstract": " What does a business do when its computer systems grow old, making them hard to maintain and alter? Software engineering has provided some useful answers, but these are entirely focused on the technology, ignoring the organizational and human context. This paper describes the early results of a project to find wider solutions to the problems of legacy systems. It outlines a proposed method for such solutions, based on a dynamic interrelationship between organizational and technical change processes. We discuss tools for the codevelopment, by all stakeholders, of a number of scenarios for the future of the organization; and then of more detailed technical support for those possible futures. An example of the form of the technical change approach is given. Keywords: Legacy systems, scenarios, organizational context, change management, stakeholder involvement, software engineering, organizational analysis. 490 Part II: Theory The Problems of Legacy Systems There is a growi...", "num_citations": "10\n", "authors": ["567"]}
{"title": "Big data for musicology\n", "abstract": " Digital music libraries and collections are growing quickly and are increasingly made available for research. We argue that the use of large data collections will enable a better understanding of music performance and music in general, which will benefit areas such as music search and recommendation, music archiving and indexing, music production and education. However, to achieve these goals it is necessary to develop new musicological research methods, to create and adapt the necessary technological infrastructure, and to find ways of working with legal limitations. Most of the necessary basic technologies exist, but they need to be brought together and applied to musicology. We aim to address these challenges in the Digital Music Lab project, and we feel that with suitable methods and technology Big Music Data can provide new opportunities to musicology.", "num_citations": "8\n", "authors": ["567"]}
{"title": "Synaesthetic traces: Digital acquisition of musical shapes\n", "abstract": " In this paper we describe two projects aiming to shed light on the notion of shape, a concept widely used by musicians to refer to various musical characteristics but one that has so far been almost entirely neglected by the research community. Project 1 is a study examining how musicians and non-musicians represent sound visually, making use of an electronic graphics tablet and tailored capturing software to gain insight into visualised musical shapes and the processes that produce that visualization. Project 2 aims to measure people’s shaped responses to music as expressed through hand, arm and whole body movements using Microsoft’s® Kinect technology and a Wii remote controller. The digitally acquired data and methodologically advanced analyses from both projects have already influenced and will continue to inform other, humanities-and social science-driven projects, to the same extent as the latter have enhanced the progress of the former. We are convinced that the overarching investigation of ‘Shaping music in performance’can only benefit from such a collaboration.", "num_citations": "8\n", "authors": ["567"]}
{"title": "In search of motive: Identification of repeated patterns in performances and their structural contexts\n", "abstract": " Motives are short melodic, rhythmic, and/or harmonic patterns repeated either exactly or in varied forms and have long been recognized as important elements of musical structure. Less well explored is the relationship between motives and their manifestation in performance, and the perception thereof. Expressive motives originating in performance–which we term “performance motives”–are also of considerable interest but have received scant theoretical attention.In this paper, we present a method that combines a patternmatching approach with Formal Concept Analysis to allow the exploration of repeating timing patterns in performance. We present the initial results of applying this method to quaver beat-timing data from performances of Chopin’s Etude Op. 10, No. 3. The results identify repetitions in timing patterns in several contexts: those occurring with motivic material identifiable in the score, those with the same structural positions, those in parts played very quickly, and those not directly coinciding with any of the above.", "num_citations": "8\n", "authors": ["567"]}
{"title": "An initial approach to assessing program comprehensibility using spatial complexity, number of concepts and typographical style\n", "abstract": " Software evolution can result in making a program harder to maintain, as it becomes more difficult to comprehend. This difficulty is related to the way the source code is formatted, the complexity of the code, and the amount of information contained within it. This work presents an initial approach that uses measures of typographical style, spatial complexity and concept assignment to measure these factors, and to model the comprehensibility of an evolving program. The ultimate aim of which is to identify when a program becomes more difficult to comprehend, triggering a corrective action to be taken to prevent this. We present initial findings from applying this approach. These findings show that this approach, through measuring these three factors, can model the change in comprehensibility of an evolving program. Our findings support the well-known claim that programs become more complex as they evolve …", "num_citations": "8\n", "authors": ["567"]}
{"title": "Achieving ultra rapid evolution using service-based software\n", "abstract": " There is an urgent industrial need for new approaches to software evolution that will lead to far faster implementation of software changes. Existing software maintenance processes are simply too slow to meet the needs of many businesses. To achieve the levels of functionality, flexibility and time to market of changes and updates required by users, a radical shift is required in the development of software, with a more demand-centric view leading to software which will be delivered as a service, within the framework of an open marketplace. Although there are some signs that this approach is being adopted by industry, it is in a very limited and restricted form. We see ultra rapid evolution, in\" internet time\" as a grand challenge for software engineering. In this position paper, we describe recent work that has resulted in an innovative demand-led model for the future of software. We describe a service architecture in …", "num_citations": "8\n", "authors": ["567"]}
{"title": "CHIMERA: a service oriented computing approach for archaeological research\n", "abstract": " Archaeological data is available in greater complexity and volume than ever before, which presents significant challenges and opportunities. In this position paper, we describe how a Service Oriented Architecture (SOA) could be deployed not only to bring federated resources together with a unified searching capability, but also how those capabilities could themselves be used to create a ‘bottom up’ domain ontology for the resources’ subject area or areas. By linking with Virtual Research Environment (VRE) technology, this system could deliver access to a range of digital resources for excavators in the field, and at the same time provide a valuable body of semantic information about the archaeological research workflow, as expressed in the natural language archaeologists use to conduct their collection searches.", "num_citations": "7\n", "authors": ["567"]}
{"title": "Knitting music and programming: Reflections on the frontiers of source code analysis\n", "abstract": " Source Code Analysis and Manipulation (SCAM) underpins virtually every operational software system. Despite the impact and ubiquity of SCAM principles and techniques in software engineering, there are still frontiers to be explored. Looking \"inward\" to existing techniques, one finds frontiers of performance, efficiency, accuracy, and usability, looking \"outward\" one finds new languages, new problems, and thus new approaches. This paper presents a reflective framework for characterizing source languages and domains. It draws on current research projects in music program analysis, musical score processing, and machine knitting to identify new frontiers for SCAM. The paper also identifies opportunities for SCAM to inspire, and be inspired by, problems and techniques in other domains.", "num_citations": "6\n", "authors": ["567"]}
{"title": "Cut the biggest IT cost\n", "abstract": " Software maintenance gobbles up the lion's share of the total cost of software over its lifetime. Why is this so, and how can these costs be controlled and even reduced? Keith Bennett FBCS, Nicolas Gold MBCS and Andrew Mohan MBCS offer some advice", "num_citations": "6\n", "authors": ["567"]}
{"title": "Movement sonification expectancy model: leveraging musical expectancy theory to create movement-altering sonifications\n", "abstract": " When designing movement sonifications, their effect on people’s movement must be considered. Recent work has shown how real-time sonification can be designed to alter the way people move. However, the mechanisms through which these sonifications alter people’s expectations of their movement is not well explained. This is especially important when considering musical sonifications, to which people bring their own associations and musical expectation, and which can, in turn, alter their perception of the sonification. This paper presents a Movement Expectation Sonification Model, based on theories of motor-feedback and expectation, to explore how musical sonification can impact the way people perceive their movement. Secondly, we present a study that validates the predictions of this model by exploring how harmonic stability within sonification interacts with contextual cues in the environment to impact …", "num_citations": "5\n", "authors": ["567"]}
{"title": "Musically informed sonification for self-directed chronic pain physical rehabilitation\n", "abstract": " Chronic pain is pain that persists past the expected time of healing. Unlike acute pain, chronic pain is often no longer a sign of damage and may never disappear. Remaining physically active is very important for people with chronic pain, but in the presence of such persistent pain it can be hard to maintain a good level of physical activity due to factors such as fear of pain or re-injury. This paper introduces a sonification methodology which makes use of characteristics and structural elements of Western tonal music to highlight and mark aspects of movement and breathing that are important to build confidence in peoples body capability in a way that is easy to attend to and devoid of pain. The design framework and initial conceptual design that uses musical elements such as melody, harmony, texture and rhythm for improving the efficiency of the sonification used to support physical activity for people with chronic pain is here presented and discussed. In particular, we discuss how such structured sonification can be used to facilitate movement and breathing during physical rehabilitation exercises that tend to cause anxiety in people with chronic pain. Experiments are currently being undertaken to investigate the use of these musical elements in sonification for chronic pain.", "num_citations": "5\n", "authors": ["567"]}
{"title": "Automatic Transcription and Pitch Analysis of the British Library World and Traditional Music Collections\n", "abstract": " Music research, particularly in fields like systematic musicology, ethnomusicology, or music psychology has developed as “data oriented empirical research”(Parncutt, 2007), which benefits from the development of computing methods and infrastructure. In ethnomusicology there has been a recent growing interest in computational methods and their application to audio data collections (Gómez et al., 2013),(Canazza et al., 2010), and in the degree to which such methods may reveal insights into musical practice which may not be evident from the participantobservation paradigms that have otherwise characterised the discipline. For technological and legal reasons research in this area was previously limited to small datasets, but this is changing in part due to the contribution of research projects such as CompMusic 1 and cultural preservation projects such as Europeana Sounds 2. The authors of this paper collaborate in the UK AHRC-funded project Digital Music Lab-Analysing Big Music Data (DML) 3 to develop methods and technologies to support the use of Big Data in musicology (Weyde et al., 2014). As part of the project, we have developed software/hardware infrastructure for exploring and analysing large-scale audio collections, aiming to assist research in systematic and empirical (ethno) musicology. A major partner of the DML project is The British Library (BL), which holds several million audio recordings in its Sound Archive, spanning oral history interviews, environmental & nature sounds, as well as over 3 million recordings from classical, popular, world and traditional music (of which approximately 10% are digitized). A portion of these …", "num_citations": "5\n", "authors": ["567"]}
{"title": "Human-computer music performance: From synchronized accompaniment to musical partner\n", "abstract": " Live music performance with computers has motivated many research projects in science, engineering, and the arts. In spite of decades of work, it is surprising that there is not more technology for, and a better understanding of the computer as music performer. We review the development of techniques for live music performance and outline our efforts to establish a new direction, Human-Computer Music Performance (HCMP), as a framework for a variety of coordinated studies. Our work in this area spans performance analysis, synchronization techniques, and interactive performance systems. Our goal is to enable musicians to ncorporate computers into performances easily and effectively through a better understanding of requirements, new techniques, and practical, performance-worthy implementations. We conclude with directions for future work.", "num_citations": "5\n", "authors": ["567"]}
{"title": "Service-oriented software in the humanities: A software engineering perspective\n", "abstract": " Software Engineering, as a sub-discipline of the broader field of computer science, is concerned with the production, use, and maintenance of large, complex software systems. On first inspection, the set of managerial and technical activities involved in software engineering appears to be somewhat orthogonal to core research activity in the humanities, being concerned more with the production of research-enabling software systems than the research itself. However, as the scale of software used in digital humanities has increased, it is becoming clear that there are ways in which software engineering can inform, inspire, and aid in the management of the larger-scale software systems now being constructed in these disciplines. In particular, the development of service technology to aid in the production of flexible software systems for business now offers opportunities, not only for collaborative data sharing, but also …", "num_citations": "5\n", "authors": ["567"]}
{"title": "Managing supply chains of software as a service through agent negotiations\n", "abstract": " This paper introduces a new mediation mechanism into agent negotiations. The negotiation mechanism takes a supply-chain perspective to the construction of software services, attempting to co-optimize individual negotiations between services providers and service consumers along the chain. Parties negotiate acceptable ranges of values for either independent or multi-linked issues. This enables mediator agents to collect negotiation information throughout a supply chain and formulate it as sets of optimization objectives and constraints. Two examples are presented to demonstrate how the model operates.", "num_citations": "5\n", "authors": ["567"]}
{"title": "Guest editor's introduction: 10th conference on software maintenance and reengineering\n", "abstract": " Editorial: Guest Editor's Introduction: 10th Conference on Software Maintenance and Reengineering: Journal of Systems and Software: Vol 81, No 4 ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Journal of Systems and Software Periodical Home Latest Issue Archive Authors Affiliations Award Winners More HomeBrowse by TitlePeriodicalsJournal of Systems and SoftwareVol. , No. Editorial: Guest Editor's Introduction: 10th Conference on Software Maintenance and Reengineering article Editorial: Guest Editor's Introduction: 10th Conference on Software Maintenance and Reengineering Share on Authors: Giuseppe Antonio Di Di Lucca profile image Giuseppe A. Di Lucca RCOST - Research Centre on …", "num_citations": "4\n", "authors": ["567"]}
{"title": "Performance motives: Analysis and comparison of performance timing repetitions using pattern matching and Formal Concept Analysis\n", "abstract": " A method combining a pattern-matching approach with Formal Concept Analysis is used to explore repeated timing patterns in performance in order to analyze characteristics of performances and differences among them. Initial analysis of timing data from performances of Chopin’s Etude Op. 10, No. 3 suggests that repetitions in timing patterns occur in several contexts: with motivic material identifiable in the score, with the same structural positions, in parts played very quickly, and not directly coinciding with any of the above. The paper explores the relation between these contexts and the roles of such repetitions in different performances of the same piece.", "num_citations": "4\n", "authors": ["567"]}
{"title": "Digital music lab: A framework for analysing big music data\n", "abstract": " In the transition from traditional to digital musicology, large scale music data are increasingly becoming available which require research methods that work on the collection level and at scale. In the Digital Music Lab (DML) project, a software system has been developed that provides large-scale analysis of music audio with an interactive interface. The DML system includes distributed processing of audio and other music data, remote analysis of copyright-restricted data, logical inference on the extracted information and metadata, and visual web-based interfaces for exploring and querying music collections. A system prototype has been set up in collaboration with the British Library and I Like Music Ltd, which has been used to analyse a diverse corpus of over 250,000 music recordings. In this paper we describe the system requirements, architecture, components, and data sources, explaining their interaction. Use …", "num_citations": "3\n", "authors": ["567"]}
{"title": "Getting the shapes\" right\" at the expense of creativity? How musicians' and non-musicians' visualizations of sound differ\n", "abstract": " BackgroundMusical training has an impact on the development and enhancement of a number of perceptual, cognitive, sensory-motor and social skills. Whereas some of these skills may be context-or instrument-specific, others are likely to be more generalizable. The focus of this paper is on two particularly well-developed characteristics of musicians: processing of auditory-visual information and sensory-motor integration. The former has been investigated from many different angles (Schutz, 2008), for instance cross-modal correspondences (Walker, 1987) and music cognition (Tan & Kelly, 2004), while the latter is often associated with structural and functional brain imaging studies (Zatorre, Chen, & Penhune, 2007) and especially instrument-specific motor skills (eg Jabusch, Alpers, Kopiez, Vauth, & Altenmüller, 2009). Although behavioural studies investigating generalizable sensory-motor skills in musicians are still sparse, they promise to provide a broader picture of sensory-motor integration (Spilka, Steele, & Penhune, 2010).", "num_citations": "3\n", "authors": ["567"]}
{"title": "A Framework to Evaluate the Adoption Potential of Interactive Performance Systems for Popular Music\n", "abstract": " Popular music plays a central role in the lives of millions of people. It motivates beginners, engages experienced musicians, and plays both functional (e.g. churches) and non-functional (e.g. music festivals) roles in many contexts. Forming and maintaining a popular music ensemble can be challenging, particularly for part-time musicians who face other demands on their time. Where an ensemble has a functional role, performing music of consistent style and quality becomes imperative yet the demands of everyday life mean that it is not always possible to have a full complement of musicians. Interactive music technology has the potential to substitute for absent musicians to give a consistent musical output. However, the technology to achieve this (for popular music) is not yet mature, or in a suitable form for adoption and use by musicians who are not experienced with interactive music systems, or who are unprepared to work in experimental music or with experimental systems (a particular concern for functional ensembles). This paper proposes a framework of issues to be considered when developing interactive music technologies for popular music ensemble performance. It explores aspects that are complementary to technological concerns, focusing on adoption and practice to guide future technological developments.", "num_citations": "3\n", "authors": ["567"]}
{"title": "Capturing Visitor Experiences for Study and Preservation.\n", "abstract": " Capturing Visitor Experiences for Study and Preservation. Page 185 159 History Review. Most of these studies are, however, largely concerned with quantitative, social sciencebased approaches to historical research. This paper explores how approaches based on other sources such as texts and images can be used to allow GIS to be applied across the disciplines of the humanities. Early research is already suggesting that it can and indeed a new field, spatial humanities, is increasingly being recognised. This paper will explore one example of this approach focusing on how we can use GIS techniques to integrate historical texts and modern'born-digital'photographs to gain a better understanding of landscape appreciation in the Lake District. The paper starts by looking at two early tours of the Lake District, Thomas Gray's proto-Picturesque tour of 1769 and Samuel Taylor Coleridge's 'circumcursion'of 1802. We are …", "num_citations": "3\n", "authors": ["567"]}
{"title": "Musical motives in performance: A study of absolute timing patterns\n", "abstract": " Musical motives are short melodic, rhythmic and/or harmonic patterns repeated either exactly or in varied form. They have long been recognised as important elements of musical structure. Less well-explored is how musical motives are manifested in performance, and how they are perceived in that context. Expressive motives originating in performance—which we term “performance motives”—are also of considerable interest, but they have received scant theoretical attention despite their potential significance in music performance and perception. Performance motives may go some way to addressing questions of listener preference for particular performers' interpretation of the same work over others. In this chapter, we discuss a method that seeks to locate and to characterise performance motives. It combines a simple pattern-matching approach with Formal Concept Analysis to allow the exploration of repeated …", "num_citations": "2\n", "authors": ["567"]}
{"title": "The digital music lab: A big data infrastructure for digital musicology\n", "abstract": " In music research, many tools and techniques for the analysis of individual pieces exist, while far fewer are available on the collection level. Such methods and tools are increasingly necessary as more data is being made available, and the Digital Music Library helps fill that gap. Based on parallel server-side processing with Music Information Retrieval techniques, Semantic Web knowledge representation, and specifically designed interactive visualisations, an infrastructure has been developed, which allows webbased processing, querying, visualisation, and musicological analysis of large music collections. By analysing large, user-defined collections, we enable the investigation of questions such as whether or not a geographical bias for orchestral tuning pitch exists or the examination of trends in musical key and tempo. We particularly support comparisons between multiple music collections.", "num_citations": "2\n", "authors": ["567"]}
{"title": "Using Twitter Data in Research Guidance for Researchers and Ethics Reviewers\n", "abstract": " Twitter was founded in 2006 to provide micro blogging services and is an established part of the contemporary social media landscape. It is a corporate entity and its interactions with users (those who post or consume its data) are governed by contracts and agreements.Twitter data (among other things) consists of Tweets: short messages posted by its users to the site, often using official or third-party apps on mobile or fixed devices. Such messages may be accompanied by, or contain, metadata (data about the message such as the user’s geolocation or the time it was posted), and are organised in terms of accounts. Users interact with Twitter via these registered accounts and can determine the public visibility of their Tweets at their discretion. Unregistered users may only view Tweets designated as public. Accounts may be ‘followed’to receive all Tweets posted by that account. Accounts may be personal or corporate. Twitter data can be accessed by reading it on Twitter’s own website, through the official Twitter app, or via the Developer API that Twitter makes available.", "num_citations": "2\n", "authors": ["567"]}
{"title": "The AffectMove 2021 Challenge-Affect Recognition from Naturalistic Movement Data\n", "abstract": " We ran the first Affective Movement Recognition (AffectMove) challenge that brings together datasets of affective bodily behaviour across different real-life applications to foster work in this area. Research on automatic detection of naturalistic affective body expressions is still lagging behind detection based on other modalities whereas movement behaviour modelling is a very interesting and very relevant research problem for the affective computing community. The AffectMove challenge aimed to take advantage of existing body movement datasets to address key research problems of automatic recognition of naturalistic and complex affective behaviour from this type of data. Participating teams competed to solve at least one of three tasks based on datasets of different sensors types and reallife problems: multimodal EmoPain dataset for chronic pain physical rehabilitation context, weDraw-1 Movement dataset for maths problem solving settings, and multimodal Unige-Maastricht Dance dataset. To foster work across datasets, we also challenged participants to take advantage of the data across datasets to improve performances and also test the generalization of their approach across different applications.", "num_citations": "1\n", "authors": ["567"]}
{"title": "Form-Aware, Real-Time Adaptive Music Generation for Interactive Experiences Data\n", "abstract": " This archive contains data in support of the Sound and Music Computing 2016 paper: “FORM-AWARE, REAL-TIME ADAPTIVE MUSIC GENERATION FOR INTERACTIVE EXPERIENCES”.", "num_citations": "1\n", "authors": ["567"]}
{"title": "Form-Aware, Real-Time Adaptive Music Generation for Interactive Experiences\n", "abstract": " Many experiences offered to the public through interactive theatre, theme parks, video games, and virtual environments use music to complement the participants’ activity. There is a range of approaches to this, from straightforward playback of ‘stings’, to looped phrases, to on-the-fly note generation. Within the latter, traditional genres and forms are often not represented, with the music instead being typically loose in form and structure. We present work in progress on a new method for realtime music generation that can preserve traditional musical genres whilst being reactive in form to the activities of participants. The results of simulating participant trajectories and the effect this has on the music generation algorithms are presented, showing that the approach can successfully handle variable length forms whilst remaining substantially within the given musical style.", "num_citations": "1\n", "authors": ["567"]}
{"title": "Exploring probabilistic grammars of symbolic music using PRISM\n", "abstract": " In this paper we describe how we used the logic-based probabilistic programming language PRISM to conduct a systematic comparison of several probabilistic models of symbolic music, including 0th and 1st order Markov models over pitches and intervals, and a probabilistic grammar with two parameterisations. Using PRISM allows us to take advantage of variational Bayesian methods for assessing the goodness of fit of the models. When applied to a corpus of Bach chorales and the Essen folk song collection, we found that, depending on various parameters, the probabilistic grammars sometimes but not always out-perform the simple Markov models. Examining how the models perform on smaller subsets of pieces, we find that the simpler Markov models do out-perform the best grammar-based model at the small end of the scale.", "num_citations": "1\n", "authors": ["567"]}
{"title": "Support for Learning Synthesiser Programming\n", "abstract": " When learning an instrument, students often like to emulate the sound and style of their favourite performers. The learning process takes many years of study and practice. In the case of synthesisers the vast parameter space involved can be daunting and unintuitive to the novice making it hard to define their desired sound and difficult to understand how it was achieved. Previous research has produced methods for automatically determining an appropriate parameter set to produce a desired sound but this can still require many parameters and does not explain or demonstrate the effect of particular parameters on the resulting sound. As a first step to solving this problem, this paper presents a new approach to searching the synthesiser parameter space to find a sound, reformulating it as a multi-objective optimisation problem (MOOP) where two competing objectives (closeness of perceived sonic match and number of parameters) are considered. As a proofof-concept a pareto-optimal search algorithm (NSGA-II) is applied to CSound patches of varying complexity to generate a pareto front of non-dominating (ie” equally good”) solutions. The results offer insight into the extent to which the size and nature of parameter sets can be reduced whilst still retaining an acceptable degree of perceived sonic match between target and candidate sound.", "num_citations": "1\n", "authors": ["567"]}
{"title": "An approach to understanding program comprehensibility using spatial complexity, concept assignment and typographical style\n", "abstract": " This paper has briefly presented an approach to identifying the comprehensibility of a program and initial results from its application. The results obtained so far, indicate that this approach is useful in modelling the comprehensibility of a program as it evolves. However further work is required to calibrate this approach to more accurately reflect comprehensibility and to identify at what point corrective action should be undertaken to maintain the quality of the program.", "num_citations": "1\n", "authors": ["567"]}
{"title": "FACT: An Assessment Framework for Model-Based Program Comprehension Tools\n", "abstract": " Model-based program comprehension tools are those that use some model of a domain to assist in analysing software, and represent a large proportion of support environments for software maintainers. Such tools have widely differing characteristics that affect their suitability for software maintenance tasks. Existing evaluations of these tools take many forms, often addressing only a small part of the information needed by a maintainer to decide which tool or type of tool to apply. Consequently, comparison can be difficult. Existing approaches can be broadly divided into those that address the nature of the tool (in terms of technical characteristics and ability), and those that address the application of the tool (eg the psychological support provided).We present a new framework, applicable to model-based program comprehension tools, that allows a maintainer to analyse systematically the properties of their tool and determine its suitability for a given task. We explain the ten areas the framework covers, explaining why each is important, and demonstrating its application to the Hypothesis-Based Concept Assignment System (HB-CAS). In addition to its application by software maintainers, we anticipate the framework being useful to other researchers as a basis for evaluating and comparing their work with others.", "num_citations": "1\n", "authors": ["567"]}