{"title": "Individual and combined in vitro effects of deoxynivalenol and zearalenone on boar semen\n", "abstract": " Mycotoxins deoxynivalenol (DON) and zearalenone (ZEN) can negatively affect pig health. However, little is known about their effects on boar semen. We assessed the individual and combined effects of DON and ZEN on boar semen in vitro. In a pretrial, we determined the minimum dose (MiD) of each mycotoxin that induces a significant alteration of sperm progressive motility, as investigated using computer-assisted semen analysis (CASA). In the main trial, the individual and combined effects of each mycotoxin’s MiD on sperm motility and kinetics (CASA analysis), morphology (SpermBlue staining), viability (calcein-propidium iodide staining), membrane functional status (hypoosmotic swelling test), and chromatin integrity (acridine orange staining) were analyzed. Pretrial results suggested a MiD of 50.6 μM and 62.8 μM for DON and ZEN, respectively. In the main trial, DON and ZEN administered at MiD significantly affected CASA parameters (eg, increase of immotile spermatozoa, reduction of progressive motile spermatozoa), decreased sperm viability, and affected sperm morphology (head abnormalities) and membrane functional status. DON and ZEN showed less than additive effects on most parameters tested and a synergistic effect on viability and on two CASA parameters. In conclusion, DON and ZEN showed individual and combined toxic effects on boar semen in vitro. View Full-Text", "num_citations": "7\n", "authors": ["240"]}
{"title": "Further improvement, validation, and application of CymoSkew biotic index for the ecological status assessment of the Greek coastal and transitional waters\n", "abstract": " The CymoSkew index, a quantitative expression of Cymodocea’s photosynthetic leaf length (PLL) asymmetry, has been used as an early warning response indicator of coastal ecosystem status and trends. Besides its strengths, the number (N) of PLL used and the fact that they are chosen randomly, as well as the difficulty of its application in low-density meadows, were CymoSkew’s main weaknesses. A new version of the index (CymoSkew m) was developed using previous and new monitoring studies in eight meadows of the North Aegean Sea. It was also validated on another dataset carried out at six coastal and two transitional meadows and tested against MA-LUSI anthropogenic stress index. To avoid the effect of randomness on the index’s accuracy, a random subsampling resampling technique in all PLL values of a meadow has been developed, producing a large number of different subsamples of N= 20 …", "num_citations": "5\n", "authors": ["240"]}
{"title": "Linking personality traits and interpersonal skills to gamification awards\n", "abstract": " Software repositories and Question & Answer sites constitute promising and ever-increasing sources of information for software analytics and for the identification of the role of the human factor in software engineering. Empirical evidence suggests that studying the human factor in software-related issues is multifaceted. Although analyses on different levels of developer networks have been performed, there is no existing work that moves beyond developer technical skills to take into account other important factors that might affect development work, such as personality and non-technical skills. For this reason, in this work we propose an approach that aims at finding links between badges - a sort of gamification awarded for developer's participation - personality traits, and interpersonal skills from Stack Overflow developers' community. The Generalized Linear Models (GLM) approach is adopted in order to examine …", "num_citations": "5\n", "authors": ["240"]}
{"title": "Evaluating the Performances of Software Cost Estimation Models through Prediction Intervals.\n", "abstract": " The task of predicting accurately the cost required for the completion of a new software project is a challenging issue in the Software Cost Estimation area, since it is closely related with the activities of project management and the wise decision-making of organizations in order to bid, plan and budget a forthcoming system. However, the accurate prediction of the cost is often obtained with great uncertainty and for this reason there has been noted a lack of convergence in experimental studies. The main reason for the discrepancy can be derived from the inherent characteristic of prediction methodologies, since they produce point estimates without taking into account the risk covering the whole process. In this study, we propose a statistical framework, so as to focus on the construction of Prediction Intervals which provide an “optimistic” and a “pessimistic” guess for the true magnitude of the cost. The proposed framework that incorporates different accuracy indicators, formal hypothesis testing and graphical inspection of the predictive performance is applied on a dataset with real software projects.", "num_citations": "2\n", "authors": ["240"]}