{"title": "Studying reuse of out-dated third-party code in open source projects\n", "abstract": " Using existing source code as third-party code to build new software systems becomes very popular in these days. However, many existing code is keeping on updating during their life circle. Different versions of code, even out-dated, is reused by other software and spreading all over the world. This paper presents an empirical study on the reuse of out-dated third-party source code of several famous open source libraries. Given target source code, using repository mining techniques and file clone detection techniques, we identified the different versions of code in other user projects, and discovered the vulnerability information of the out-dated versions. We also investigated how user projects manage their code. The result shows that a large proportion of open source projects are reusing out-dated third-party code, and many of them are not well managed.", "num_citations": "24\n", "authors": ["88"]}
{"title": "How do github users feel with pull-based development?\n", "abstract": " Modern OSS projects have adopted Git to manage versions of their source code and GitHub for hosting their Git repositories. GitHub provides a characteristic feature notably pull request, and many projects adopt pull-based development model by using it. This development model offers an opportunity to review the source code before merging it into the mainstream. Getting acceptance of the pull request, any developer should strictly follow the flow of pull-based development. To follow the flow, she/he needs to use correctly Git commands. However, using these commands is complicated and requires further knowledge of them. In this paper, we conducted a large-scale survey of 1552 developers on GitHub to investigate the difficulty of the Git from the aspect of the pull request. The result shows developers struggle with 'git rebase -i' command tends not to perform re-ordering, compressing and dividing their commits.", "num_citations": "12\n", "authors": ["88"]}
{"title": "A cohesion metric approach to dividing source code into functional segments to improve maintainability\n", "abstract": " During software maintenance, understanding source code is one of time-consuming activities. Good programming practice suggests that programmers should insert blank lines to divide source code into functional segments, and a comment at the beginning of each functional segment. Those help developers to understand functional segmentation of source code, such as start and end points of each functional segment. Unfortunately, programmers do not always follow this practice. In this paper, we propose an approach to dividing source code into functional segments. Our approach uses cohesion metric for code portion to identify start and end points of each functional segment.", "num_citations": "12\n", "authors": ["88"]}
{"title": "Assessing refactoring instances and the maintainability benefits of them from version archives\n", "abstract": " For the development of high quality software, process quality assessment should be applied into development organization. So far, several process quality assessment methodologies are proposed and applied into a lot of organizations. In this paper, we propose an approach to assess instances of refactoring that is one of the key processes for quality improvement. The proposed approach can be done semi-automatically by investigating version archives in a configuration management system. We applied our proposed method to the Columba project which is an open source software project. The result of our preliminary case study shows that the frequency of defect introduction tends to decrease in the term after frequent refactoring.", "num_citations": "10\n", "authors": ["88"]}
{"title": "Scalable Detection of Semantic Clones Based on Two-stage Clustering\n", "abstract": " We propose a scalable technique to detect semantic clones (ie semantically identical or similar code fragments) based on two-stage clustering, and show an example of detected clones.", "num_citations": "9\n", "authors": ["88"]}
{"title": "情報検索技術に基づく高速な関数クローン検出\n", "abstract": " 論文抄録ソフトウェア保守における問題の 1 つとしてコードクローン (ソースコード中に存在する同一または類似した部分を持つコード片) が指摘されている. これまでの研究において様々なコードクローン検出手法が提案されてきたが, 多くの手法がプログラムの構造的な類似性のみに着目している. また, プログラムの意味的な処理の類似性に着目した手法では, 検出時間に膨大な時間がかかるという問題点がある. そこで本研究では, 情報検索技術を利用した関数クローン (関数単位のコードクローン) の検出手法を提案する. 関数単位のコードクローンは処理の内容がまとまっているため, コード片単位のコードクローンに比べてライブラリ化などの集約の対象になりやすいと考えられる. 本手法では, ソースコード中の識別子や予約語に利用される単語に対して重み付けを行うことによって, 関数を特徴ベクトルに変換する. そして, 特徴ベクトル間の類似度を求めることによって関数クローンの検出を行う. 評価実験では, 既存のコードクローン検出手法と比較を行い, 高速に高い精度で検出を行うことができた.", "num_citations": "8\n", "authors": ["88"]}
{"title": "コードクローン変更管理システムの開発と実プロジェクトへの適用\n", "abstract": " ソフトウェア保守における大きな問題の1つとしてコードクローンが指摘されている.コードクローンとは,ソースコード中に,互いに一致または類似した部分を持つコード片のことである.コードクローンに対する主な保守作業として,クローンセット(互いにコードクローンとなっているコード片の集合)に含まれるすべてのコード片を一貫して編集する同時修正と,クローンセットを1つのサブルーチンにまとめる集約があげられる.本研究では,コードクローンに対する保守作業を支援することを目的としたコードクローン変更管理システムの開発を行った.そして,企業で行われているソフトウェア開発に適用することによって,本システムの有用性を確かめることができた.", "num_citations": "7\n", "authors": ["88"]}
{"title": "Achievement of new quantum limit by switching of pump frequency of squeezer\n", "abstract": " In this paper, we have shown an realization method for the quantum state switch system which can provide the optical communication system beyond the SQL. The original idea of our proposed system is the frequency shift of pumping light of DPA by the application of the injection locking phenomena. This enables us to get the conditional unitary communication system. Furthermore an example of the design of our system has been given. As a result, we would like to emphasize that our system can be constructed by the current technology, because the new device is only squeezer and we can get the squeezer in near future.", "num_citations": "7\n", "authors": ["88"]}
{"title": "Why novice programmers fall into a pitfall?: coding pattern analysis in programming exercise\n", "abstract": " It is crucial for educators to understand pitfalls for novice programmers in programming education at computer science course. By giving well-timed advice to students who fall into a pitfall, educators are able to achieve efficient teaching and keep up their students' motivation. However, so far, it is less well-understood how novice students edit source code and why they fall into a pitfall. In this paper, we analyzed coding patterns of novice students empirically. We collected programming activities by students on exercises of programming course, and then performed qualitative and quantitative analysis. In qualitative analysis, experienced programmers analyzed patterns of the novice programmers manually. In quantitative analysis, we focused on transtions of the edit distance between a source code of each student under development and a correct source code in a programming class. As a result, we confirmed coding …", "num_citations": "6\n", "authors": ["88"]}
{"title": "プログラミング演習における初学者を対象としたコーディング傾向の分析\n", "abstract": " あらまし 高等教育機関等で実施される初学者を対象としたプログラミング教育において, 学習者が陥りやすい誤りを事前に把握することは重要である. 一方で, これまでプログラミング初学者がどのようにソースコードを編集し, 誤りに陥っているか, その傾向は十分に明らかになっていない. 本稿ではプログラミング演習時に取得した初学者のソースコード編集履歴を分析し, その傾向を明らかにする. 分析にあたってはプログラミング熟練者の目視による定性的分析と, ソースコードの編集に関わるメトリクス計測に基づく定量的分析を実施した. 分析の結果, 初学者が陥りやすい誤りのパターンを観測した. また, 演習において理解困難な状態に陥っている場合, ソースコードの編集距離に着目したメトリクスの変動にある種の傾向があることを確認した.", "num_citations": "6\n", "authors": ["88"]}
{"title": "情報検索技術に基づく細粒度ブロッククローン検出\n", "abstract": " 本研究では情報検索技術を利用したブロッククローン (コードブロック単位のコードクローン) の検出手法を提案する. 既存研究において関数単位でコードクローンを検出する手法を提案したが, この手法は検出粒度が大きいため検出漏れが起きるという問題点があった. この問題を解決するために, 本手法では, ソースコード中の識別子や予約語に利用される単語に対して重み付けを行い, コードブロックから変換された特徴ベクトル間の類似度を求め, ブロック単位でクローンの検出を行う. この手法は, クラスタリングの手法や特徴ベクトルのデータ構造の工夫を行うことにより. 既存手法と比較して, より小さい粒度でコードクローンを検出することができ, かつ検出時間とメモリ使用量を削減できるという利点がある. また評価実験では, 既存のコードクローン検出手法と比較を行い, 高速に高い精度で検出を行うことができた.", "num_citations": "5\n", "authors": ["88"]}
{"title": "組込みソフトウェアを対象とした状態遷移表抽出手法\n", "abstract": " It is hard to understand legacy code for an embedded software system. It leads much cost for maintaining and reusing the system. Real-time control for an embedded software system can be represented as a state transition model. Developers are able to use the state transition model for understanding the state transitions of the system and detecting inconsistency from the transitions. In this study, we propose an approach to extracting state transition tables from legacy code for the understanding of an embedded software system.", "num_citations": "5\n", "authors": ["88"]}
{"title": "問題の早期発見・改善を支援するインプロセスプロジェクト管理手法の実プロジェクトへの適用\n", "abstract": " 本論文では,複雑化するソフトウェア開発プロジェクトの組織・体制に適したプロジェクト管理を支援する手法,EASEインプロセスメソッドを実プロジェクトに適用し,その有用性を評価した結果について述べる.本手法は,CASEツールからの自動データ収集・分析・可視化ツールを包含し,複数組織による複雑な体制のプロジェクトでも組織間の機密を保持しながらリアルタイムでの詳細なデータ収集・分析が可能で,プロジェクトを統括するマネージャが対策を必要とする問題を早期発見・対処することを支援する.我々は,マルチベンダ開発プロジェクトのプロジェクト管理に本手法を適用し,プロジェクトで発生する変更管理や要員管理などに関する問題の発見に有用であることを確認した.", "num_citations": "5\n", "authors": ["88"]}
{"title": "スナップショットを用いたプログラミング演習における行き詰まり箇所の特定\n", "abstract": " 本論文では, プログラミング演習時に収集したソースコードのスナップショットを分析することで, 受講生がいつ, どのような箇所で行き詰まっていたのかを特定する手法を提案する. 提案手法では, 受講生のある時点におけるソースコードと, その受講生が提出したソースコードの差分を求めることで, 受講生の演習における作業量を定量化する. そして, 定量化した作業量にもとづいて受講生の行き詰まり箇所を特定し講師へ提示する. 提案手法を実際のプログラミング演習において収集したスナップショットに適用することで, 37 名の受講者のスナップショットから 46 件の行き詰まり箇所を特定することができた. また, 適用結果からは受講生のプログラミング言語の仕様に対する理解不足, 課題におけるアルゴリズムの理解不足, 課題に対する誤解といった原因の行き詰まりを確認することができた. プログラミング演習時に受講生のソースコードを記録し, 提案手法を用いた分析を行うことで, 講師は受講生に対して適切なフィードバックを行える.", "num_citations": "4\n", "authors": ["88"]}
{"title": "初学者向けプログラミング演習のための探索的プログラミング支援環境 Pockets の提案\n", "abstract": " 論文抄録ソフトウェア開発では, 開発者が不慣れな言語や API を用いる場合などに, 複数種類の実装を試行・評価しながら開発を進めていくことが多い. このようなプログラミングスタイルを探索的プログラミングと呼び, 初学者の学習モデルとしても適しているといわれている. 実際に初学者向けのビジュアルプログラミング環境などは探索的に開発を進めることを想定して開発されているものも多い. 一方で, Java や C といったプログラミング言語を対象とした初学者教育において, 探索的プログラミングの支援を目的とした研究・開発はあまり行われていない. 我々は学生に対し, ソースコードの変更履歴を可視化およびリスト化し, ボタン 1 つで過去の特定のリビジョンに手戻りが可能な探索的プログラミング支援環境 Pockets を提案する. 2 種類のケーススタディにおいて学生に Pockets を使用して課題を解いてもらった結果, Pockets を使用した場合に, 使用しなかった場合と比較して探索的プログラミングを行う回数が増加したことが確認された. また, 実施後のアンケートにおいて, 38 名の学生のうち 21 名が, Pockets 固有の機能によって課題が解きやすくなったと回答した.", "num_citations": "4\n", "authors": ["88"]}
{"title": "An approach for fine-grained detection of refactoring instances using repository with syntactic information\n", "abstract": " Publisher site {{this. onShowPLink (\" テキストリンク| 文献| EN| PC\",\" 出版者サイト\",\" https://ipsj. ixsq. nii. ac. jp/ej/index. php? action= pages_view_main&active_action= repository_view_main_item_snippet&index_id= 581&page_no= 1&list_view_num= 20&sort_order= 7&page_id= 13&block_id= 8\",\" U0452AA\")}} Copy service {{this. onShowCLink (\" テキストリンク| 文献| EN| PC\",\" 複写サービス\",\" http://jdream3. com/copy/? sid= JGLOBAL&noSystem= 1&documentNoArray= 16A0242694©= 1\")}}Access JDreamⅢ for advanced search and analysis.{{this. onShowJLink (\" テキストリンク| 文献| EN| PC\",\" JDreamIII\",\" http://jdream3. com/lp/jglobal/index. html? docNo= 16A0242694&from= J-GLOBAL&jstjournalNo= U0452A\")}}", "num_citations": "4\n", "authors": ["88"]}
{"title": "メソッド抽出リファクタリングが行われるメソッドの特徴調査\n", "abstract": " メソッド抽出とは, 既存のメソッドの一部を新たにメソッドとして抽出する作業のことである. メソッド抽出は, 長すぎるメソッドや, 凝集性の低いメソッドを分割するために有効であるとされているが, 実際に開発者がどのようなメソッドを対象にしているかは調査されていない. しかし, メソッド抽出作業の支援を行うためには, 開発者がどのようなメソッドを抽出の対象としているかを定量的に調査する必要がある. 本研究では, オープンソースソフトウェアから, 抽出が行われたメソッドと行われなかったメソッドの間で, サイズと凝集度に違いがあるか調査した. 調査の結果, 多くの場合に有意差があることが確認できた.", "num_citations": "4\n", "authors": ["88"]}
{"title": "Process Fragment Based Process Complexity with Workflow Management Tables\n", "abstract": " The actual software development processes deviate from initial model planned at early stage. One of the reasons is that additional processes get triggered by urgent changes of software specifications. Such additional processes increase the complexity of the whole development process, and possibly decrease the product quality. In this paper, we propose a novel complexity measure of software process, which based on the number of process fragments, the number of simultaneous process fragments, and the number of developers’ groups. Proposed process complexity is applied to two industrial projects in order to show the usefulness of this measure. As a result, we found that the higher value of process complexity indicates higher risk of products' faults.", "num_citations": "4\n", "authors": ["88"]}
{"title": "類似メソッドの集約のための差分抽出支援\n", "abstract": " コードクローンとは, ソースコード中に存在する同一, または類似したコード片のことである. 例えばあるコード片に欠陥が含まれている場合, そのコードクローン全てに対し修正を検討する必要が生じる. コードクローンの保守を容易にする方法の1つとして, コードクローンの集約が挙げられるが, 差分を含むコードクローンの集約は比較的困難である. 本論文では, 差分を含むコードクローンである類似メソッドを集約するために, 差分の抽出を支援する手法を提案し, 有効性を確認した.", "num_citations": "4\n", "authors": ["88"]}
{"title": "Cytokine expression in GERD\n", "abstract": " The mechanism of esophageal mucosal injury has gradually been understood at the microbiological level. It is particularly important that pro-inflammatory factors, such as inflammatory cytokines, leukocytes and oxidative stress, have been demonstrated to be involved in the development of gastroesophageal reflux disease (GERD) including nonerosive reflux disease (NERD). Our present study reveals that expression of IL-8 mRNA, a potent neutrophil chemotactic and activating peptide, is correlated with the endoscopic grade of esophagitis or with inflammatory cell infiltration. In addition, it has been shown that bile acids and trypsin can promote IL-8 production from human esophageal epithelial cells via NFkappaB-and AP-1-dependent mechanism. Nociceptors such as acid-sensitive vanilloid receptors, protease-activated receptors and neuropeptides such as substance P have also been implicated in the pathogenesis of neurogenic inflammation in NERD patients with esophageal hypersensitivity. The development of new therapy with antiinflammatory and anti-oxidant effects is expected to assist in the treatment of intractable NERD/GERD and the prevention of carcinogenesis.", "num_citations": "4\n", "authors": ["88"]}
{"title": "Magnetic properties and microstructure of Co‐Cr‐Pr vertically magnetized films\n", "abstract": " The effect of Pr on both the magnetic properties and microstructure of Co‐Cr alloys is discussed. The saturation magnetization Ms and perpendicular magnetic anisotropy Ku at room temperature is found to increase with Pr, becoming maximum at about 0.5 wt. % Pr, and then decreases monotonously. The microstructure is also changed with Pr, leading to a less‐defined columnar structure. However, no significant change is found in the Auger spectra for various contents.", "num_citations": "4\n", "authors": ["88"]}
{"title": "構文情報リポジトリを用いた細粒度リファクタリング検出手法\n", "abstract": " 論文抄録本稿はソフトウェアのリファクタリング実施履歴をリビジョン単位で復元する手法を提案する. 提案手法は, 構文情報の変更を追跡可能なリポジトリを用いることで, 計算時間の削減を行っている. 提案手法をツールとして実装し, オープンソースソフトウェアである jEdit に適用した. その結果, 従来手法である Ref-Finder, UMLDiff と比較してより高速かつ高精度にリファクタリングの実施履歴を復元可能であることを確認した. 提案手法を用いてリファクタリングの実施履歴を分析することで, リファクタリングがソフトウェアの品質に与える影響の調査, 有効なリファクタリング支援手法の検討に役立つことが期待できる.", "num_citations": "3\n", "authors": ["88"]}
{"title": "OJL による実践的組込みシステム教育\n", "abstract": " 産業界は, 情報系学生に対して主体的に活動できる能力を要求している. この要求に応えるために, 我々は PBL (Project-Based Learning) を発展させた OJL (On the Job Learning) という手法で, 大学院生を対象に組込みシステム技術の教育を実施している. OJL では, 仮想の技術課題ではなく, 企業の持つ実際の開発テーマを題材にして, 実際のソフトウェア開発プロジェクトの中で, 仕事 (開発) の進め方を学生に体験学習させる. 2013 年度は修了生の 96% から有益であったなどのポジティブな意見が見られ, 就職後に実際に役立ったとの意見も得られている. 本稿では, OJL 教育の内容と現状について述べる.", "num_citations": "3\n", "authors": ["88"]}
{"title": "スライスに基づく凝集度を用いて自動分割を行うプログラム理解支援手法\n", "abstract": " ソフトウェア開発では, ソフトウェアの保守に多くの時間とコストが費やされている. 開発者は保守作業において, ソースコードを実現している機能ごとに区切りながら, 各コード片が実現している機能を理解する. 本稿では, プログラムスライスに基づく凝集度を用いて協調し合う複数の文を求めることで, ソースコードを実現している機能ごとに分割・提示する理解支援手法を提案する. 提案手法をツールとして実装し, 複数の機能を含むメソッドに対してケーススタディを行った. その結果, 機能と考えられるコード片を検出できる場合があることを確認できた.", "num_citations": "3\n", "authors": ["88"]}
{"title": "Accuracy of calibrated depth by delta-doped reference materials in shallow depth profiling\n", "abstract": " The influence of the initial surface roughness and the structure (crystalline/amorphous) of delta-doped reference materials (fabricated with molecular beam epitaxy (MBE) and magnetron sputtering) for depth-scale calibration of secondary ion mass spectrometry (SIMS) depth profiles on the sputtering rate and shift length under low-energy ion bombardment was investigated. The influence of the properties of the reference materials on the sputtering rate under normal oxygen ion bombardment is negligible, and the depth scale can be calibrated accurately using the sputtering rate. However, the shift length under normal oxygen ion bombardment and the sputtering rate under oblique cesium ion bombardment depend on the properties of the reference materials.", "num_citations": "3\n", "authors": ["88"]}
{"title": "UML モデルを対象としたリファクタリング候補検出の試み\n", "abstract": " ソフトウェアの設計を行う際によく用いられる言語としてUML (Unified Modeling Language)が挙げられる. また近年ソフトウェアの外部に対する振る舞いを変えずに内部構造を整理するリファクタリングをUMLモデルに対して行う研究が盛んである. リファクタリングを行う箇所として, 様々なプログラムで再利用できる汎用的な設計パターンであるデザインパターンの適用可能箇所が挙げられる. しかし大規模なソフトウェアでは, 開発者がUMLモデルからリファクタリング箇所を特定するのは困難である. 本稿では, この問題を解決するために, UMLモデルを解析することで, UMLモデル上のデザインパターン適用可能箇所を検出し, デザインパターン適用後のUMLモデルを提示する手法を提案する.さらに, 本手法を実現したツールを作成し, リファクタリング候補検出を行えることを確認した.", "num_citations": "3\n", "authors": ["88"]}
{"title": "Document History System and its Application to Abnormal Document Access Pattern Detection with a Probabilistic Model\n", "abstract": " We present a design and implementation of tracing document history and its application to detecting abnormal document access patterns. We have been working on document history system, which enables us to trace complete access history of operations for both electronic and paper documents. Document history system organizes access pattern trees based on dependency of user operations on documents. We also present a new probabilistic model, multi-layered tree Markov model (MTMM), in order to analyze access pattern trees of documents. The main feature of MTMM is to conduct tree pattern summarization and multilevel structural abstraction for trees. Our contribution is multi-level structural abstraction by incorporating hierarchical inner-state structure of Markov model. Abnormal patterns, such as sending documents to unexpected users, can be detected by applying MTMM to access pattern trees of …", "num_citations": "3\n", "authors": ["88"]}
{"title": "Progress in study for mechanism of gastric mucosal injury\n", "abstract": " Inflammatory reactions mediated by leukocytes, cytokines, adhesion molecules, active oxygen species, nitric oxide (NO) or prostaglandins have been implicated in the pathogenesis of gastric mucosal injury induced by Helicobacter pylori (H. pylori) or nonsteroidal anti-inflammatory drugs (NSAID). The molecular mechanism of gastric mucosal injury has been investigated in view of cell proliferation, apoptosis or necrosis. Eradication therapy of H. pylori, Cox2 inhibitors or NO-releasing NSAID may become new strategy for protection against gastric mucosal injury.", "num_citations": "3\n", "authors": ["88"]}
{"title": "組込みシステムを対象とした要求仕様書からの状態遷移記述の抽出\n", "abstract": " システム開発における要求仕様書は多くの場合, 自然言語で記述される. そのため, 目視による確認のみでは発見できない抜けや漏れが存在しうる. この問題を軽減するために, 状態遷移モデルが考えられている. しかし, 膨大な量のドキュメントから状態遷移モデルを手作業で作成する場合, 開発者は状態遷移モデル作成に必要な状態遷移記述 (状態名・状態値・イべント・状態値の判定・遷移・処理) を手作業で抽出する必要があるため, 多大な時間を要する. そこで, 本稿では誤字脱字や表現のゆらぎなどの日本語の誤りと曖昧さが除去されている要求仕様 1 文ずつに対して, 状態遷移記述を含む要素の抽出・分類手法を説明する. 提案手法は要求仕様 1 文ずつを入力として, 状態遷移記述を含む要素とその分類結果を出力する. まず, 状態遷移記述を含む要素や状態遷移記述を容易に抽出するために必要な要件・仕様を考察した. 次に, 要件・仕様を満たす解析木を導出し, 解析木から状態遷移記述を含む要素の抽出を行った. その後, ツールにより抽出した状態遷移記述を含む要素に対して …", "num_citations": "2\n", "authors": ["88"]}
{"title": "局所性鋭敏型ハッシュを用いたコードクローン検出のためのパラメータ決定手法\n", "abstract": " 抄録 (和) 局所性鋭敏型ハッシュ (LSH) とは, 高次元なデータを確率的にハッシュし, 近傍点を見つけるアルゴリズムである. クローン検出において LSH の処理に大きな時間を占めており, LSH の処理速度を向上させることが求められている. 本研究では, 検出精度を変えずに高速に LSH の処理をするために, LSH に与えるパラメータを, 対象ソースコードから決定する手法を提案する.(英) LSH (Locality-Sensitive Hashing) is a near neighbor search algorithm that performs probabilistic hashing of high-dimensional data. For reducing the detection time of code clones, the execution time of LSH needs to be speeded up. In this study, we propose an approach to determine LSH parameters based on source code analysis in order to not only speed up code clone detection but also keep the preciseness of it.", "num_citations": "2\n", "authors": ["88"]}
{"title": "プログラミングコンテスト参加者を対象とした編集作業の特徴調査\n", "abstract": " 論文抄録現在, プログラミングコンテストはプログラミング初級者から上級者まで世界中から多くの参加者が利用している. 本研究では, 世界最大規模のプログラミングコンテストシステムである Codeforces の提出履歴データをもとに構築したデータセットを用いて, 参加者のソースコード修正箇所や修正回数を調査した. また, コンテストにおけるイロレーティングと修正情報との間にどのような相関があるかを分析した. 結果, イロレーティングが上がるほど修正量が減少するという相関があることを確認した.", "num_citations": "2\n", "authors": ["88"]}
{"title": "情報検索技術に基づくブロッククローン検出 (ソフトウェアサイエンス)\n", "abstract": " CiNii 論文 - 情報検索技術に基づくブロッククローン検出 (ソフトウェアサイエンス) CiNii 国立情報学 研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす 大学図書館の本をさがす 日本の博士論文を さがす 新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者 ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版年 年から 年まで 検索 検索 検索 CiNii窓口業務の再開について 情報検索技術に基づくブロッククローン検出 (ソフトウェアサイエンス) Block Clone Detection Based on Information Retrieval Techniques 横井 一輝 崔恩瀞 吉田則裕 井上 克郎 著者 横井 一輝 崔 恩瀞 吉田 則裕 井上 克郎 収録刊行物 電子情報通信学会技術研究 報告 = IEICE technical report : 信学技報 電子情報通信学会技術研究報告 = IEICE technical report : 信学技報 117(136), 109-116, 2017-07-19 電子情報通信学会 Tweet キーワード コード クローン ソフトウェア保守 情報検索 各種コード NII論文ID(NAID) 40021284744 本文言語コード -ID /…", "num_citations": "2\n", "authors": ["88"]}
{"title": "組込みソフトウェアを対象とした状態遷移表の抽出と分析支援の検討\n", "abstract": " 山本 椋太† 吉田 則裕† 青木 奈央†† 高田 広章†† 名古屋大学大学院情報学研究科〒 464–8603 愛知県名古屋市千種区不老町†† 組込みシステム技術協会〒 103–0011 東京都中央区日本橋大伝馬町 E-mail:†{muku, yoshida, hiro}@ ertl. jp,†† nao@ zipc. com あらまし レガシー化した組込みソフトウェアの理解が困難になっており, 保守や再利用に大きなコストがかかる. リアルタイム制御を行う組込みソフトウェアを状態遷移モデルで表現可能な場合が多く存在する. 本研究では, 組込みソフトウェアのレガシーコードから状態遷移表を抽出し, ソースコードの理解を支援する手法を提案する. また, 状態遷移表が大規模になる可能性があるため, 状態遷移表の分析を支援するための手法について検討する.", "num_citations": "2\n", "authors": ["88"]}
{"title": "メタヒューリスティクスを用いた集約可能コードクローン量の推定\n", "abstract": " コードクローンの集約はソフトウェア保守の対象となるソースコードを減少させる. しかし, 集約に要する期間, 費用の推定が困難であるために集約の計画が立ちにくいという問題がある. 研究では, 集約可能コードクローン量の推定が開発者の集約を支援することを目的としている. オーバーラップしているコードクローンから集約する組み合わせを推定するためにメタヒューリスティクスを用いた.", "num_citations": "2\n", "authors": ["88"]}
{"title": "パターンマイニング技術を用いた C 言語プログラムからのコーディングパターン抽出\n", "abstract": " 中村 勇太† 崔 恩瀞†† 吉田 則裕††† 春名 修介† 井上 克郎†† 大阪大学 大学院情報科学研究科〒 565-0871 大阪府吹田市山田丘 1 番 5 号†† 大阪大学 大学院国際公共政策研究科〒 560-0043 大阪府豊中市待兼山町 1 番 31 号††† 名古屋大学 大学院情報科学研究科〒 464-8601 名古屋市千種区不老町 E-mail:†{n-yuuta, haruna, inoue}@ ist. osaka-u. ac. jp,†† ejchoi@ osipp. osaka-u. ac. jp,††† yoshida@ ertl. jp あらまし コーディングパターンとは複数のモジュールに分散する定型的なコードである. コーディングパターンは守らなければいけないルールを表しているため, そのルール通りにプログラムが記述されているか検査することでバグの検出ができる. 本研究では, 組込みシステム開発など高い信頼性が要求されるドメインで頻繁に用いられる C 言語を対象として, シーケンシャルパターンマイニングを用いてコーディングパターンを抽出する手法を提案する. 適用実験では, 提案手法を用いて抽出したコーディングパターンが対象ソフトウェアの仕様の一部を表していることを確認した.", "num_citations": "2\n", "authors": ["88"]}
{"title": "機械学習を用いたメソッド抽出リファクタリングの推薦手法\n", "abstract": " 論文抄録リファクタリングとは “外部から見たときの振舞いを保ちつつ, 理解や修正が簡単になるように, ソフトウェアの内部構造を整理すること” であり, ソフトウェア開発における重要な活動の 1 つである. 本研究では, メソッド抽出というリファクタリングパターンについて, 実際にリファクタリングが行われたメソッドを収集し, それらの特徴量を用いた機械学習によって, メソッド抽出リファクタリングの対象を推薦する手法を提案する. 実験として, 5 つのオープンソースソフトウェアに提案手法を適用した結果, メソッド抽出の対象となるメソッドのうち, 57% から 96% を特定することができていることが分かった. また, 実験の結果から, メソッド抽出が行われるか否かに, メソッドの文の数と凝集度が大きく関与していることが分かった.", "num_citations": "2\n", "authors": ["88"]}
{"title": "日本とタイにおけるプログラミング初学者のプログラミング行動の比較\n", "abstract": " 抄録 (和) 教育工学における研究の一環として, プログラミング演習において初学者がとる行動の分析が行われている. このような分析は, 研究者が所属する大学において実施されることが多い. そのため, 大学を跨いで初学者の行動を比較した研究は少ない. 我々は, 日本とタイの大学間において初学者がとる行動の差異について比較を行うことを計画している. 本稿では, これら大学間における教育活動の比較を行い, その後初学者が行う探索的プログラミングについて説明する. そして, 日本・タイの大学それぞれで初学者がとる行動を比較する方法について述べ, 最後に現在得られている結果について報告と考察を行う.(英) In the educational technology field, several studies have been done on the analysis of programming behaviors of novices. Typically, this analysis is performed in the university that researchers belong to. Therefore, only a few studies have been done on the comparison of programming behaviors of novices among different universities. We plan to …", "num_citations": "2\n", "authors": ["88"]}
{"title": "Towards an analysis of who creates clone and who reuses it\n", "abstract": " Code clone analysis is valuable because it can reveal reuse behaviours efficientlyfrom software repositories. Recently, some code reuse analyses using clonegenealogies and code clones over multiple projects were conducted. However, mostof the conventional analyses do not consider the developers’ individual difference toreuse behaviors. In this paper, we propose a method for code reuse analysis whichtakes particular note of the differences among individuals. Our analysis methodclarifies who reused whose source code across multiple repositories. We believethe result might provide us with constructive perceptions such as characteristics ofreused code itself by multiple developers, and developers who implement reusablecode.", "num_citations": "2\n", "authors": ["88"]}
{"title": "初学者向けプログラミング演習における探索的プログラミングの実態調査と支援手法の提案, 日本ソフトウェア科学会第 21 回ソフトウェア工学の基礎ワークショップ\n", "abstract": " あらまし 開発者が不慣れな言語や API を利用する際等に, ソースコードの編集, コンパイル, 実行を繰り返しながらプログラミングを進めることが知られている. このようなプログラミング手法を探索的プログラミングと呼び, インタラクティブデバッガ等の支援環境が提案されている. 一方で, 初学者がプログラミング演習において, 探索的プログラミングをどのように行うかは必ずしも分析されていない. そこで本研究では, 実際のプログラミング演習において初学者が行っている探索的プログラミングの実態を調査した. さらに, 調査結果にもとづいて, 初学者向け探索的プログラミング支援環境 「Pockets」 を提案した.", "num_citations": "2\n", "authors": ["88"]}
{"title": "差分を含む類似メソッドの集約支援ツール\n", "abstract": " 論文抄録ソースコード中で互いに一致または類似した部分を持つコード片のことをコードクローンと呼び, 特にメソッド単位のコードクローンを類似メソッドという. もし, 類似メソッドを持つメソッドに欠陥が含まれている場合, 類似メソッドとなっている他のメソッドにも同様の欠陥が含まれている可能性が高く, それらを修正するのは大きなコストとなる. この問題の解決策として, 類似メソッドの集約が有効であるが, 類似メソッド間に差分が存在する場合, その集約は難しい. そこで, 本研究では, リファクタリング作業者が選択した類似メソッド対に対して, その集約候補を提示することにより, 作業を支援する手法を提案する. また, 提案手法を統合開発環境 Eclipse のプラグインとして実装した. 実験では, オープンソースソフトウェア上の類似メソッド対に対して本手法を適用した. また, ツールによって提示された集約候補が開発者の考えに近いものであるかアンケート評価を行い, 提案手法が有効であることを確認した.", "num_citations": "2\n", "authors": ["88"]}
{"title": "Coding Pattern Analysis for Novice Programmer in Programming Exercise\n", "abstract": " All rights are reserved and no part of this publication may be reproduced or transmitted in any form or by any means, electronic or mechanical, including photocopy, recording, or any information storage and retrieval system, without permission in writing from the publisher. Notwithstanding, instructors are permitted to photocopy isolated articles for noncommercial classroom use without fee.(License No.: 10GA0019/12GB0052/13GB0056/17GB0034/18GB0034)", "num_citations": "2\n", "authors": ["88"]}
{"title": "コードクローンの特徴に基づくメソッド引き上げリファクタリングパターンの提案\n", "abstract": " 論文抄録コードクローンとはソースコード中に存在する同一, または類似したコード片のことである. あるコード片に欠陥が含まれていた場合, そのコード片のコードクローンすべてに対し, 修正を検討しなければならない. これには大きなコストが必要になる. コードクローンを除去, 集約する方法の一つとしてリファクタリングパターンの適用が挙げられる. リファクタリングとは, 外部的動作に変更を加えずに内部の構造を理解や修正がしやすいよう変更することである. 特に繰り返し行われるものを適用する状況と手順をまとめたものをリファクタリングパターンという. しかし, 既存のリファクタリングパターンはコードクローンに対して, 詳細に分類していない. そこで, 本研究では細かく特徴毎に分類されたコードクローンに対して, 詳細なコードクローンのリファクタリングの手順を考案し, パターンとして提案する. 適用実験として, コードクローン検出ツールを用いて発見した, オープンソースソフトウェアに存在するコードクローンに対して, 被験者にリファクタリングを行ってもらった. 提案したパターンと既存のパターンの比較を行い, 外部的動作に変更を加えずにメソッドの引き上げを行えることにより妥当性を, 提案したパターンが既存のパターンよりも分類された特徴を持つコードクローンに対しての優位性が確認できたために, 本手法の有効性を確認できた.", "num_citations": "2\n", "authors": ["88"]}
{"title": "コードの生存期間を考慮したコードクローンと欠陥修正の関係調査\n", "abstract": " これまでにコードクローンと欠陥修正の関係について様々な報告がある. 近年の研究においてコードクローンはソフトウェアの欠陥を引き起こす要因に当たらないという報告がされているが, この調査ではコードの生存期間について考慮していないという問題がある. そこで本稿では, コードの生存期間に着目してコードクローンが欠陥修正に含まれる割合の調査を行った. その結果, 生存期間が短いクローンの方が欠陥修正に多く含まれることが分かった.", "num_citations": "2\n", "authors": ["88"]}
{"title": "Supporting difference extraction for merging similar methods\n", "abstract": " All rights are reserved and no part of this publication may be reproduced or transmitted in any form or by any means, electronic or mechanical, including photocopy, recording, or any information storage and retrieval system, without permission in writing from the publisher. Notwithstanding, instructors are permitted to photocopy isolated articles for noncommercial classroom use without fee.(License No.: 10GA0019/12GB0052/13GB0056/17GB0034/18GB0034)", "num_citations": "2\n", "authors": ["88"]}
{"title": "テンプレートメソッドの形成に基づく類似メソッド集約支援\n", "abstract": " あらまし ソフトウェア保守のコストを増大させる要因として, コードクローンが指摘されている. 類似メソッド対 (コードクローンを共有するメソッドの対) 間のコードクローンは,“テンプレートメソッドの形成” リファクタリングを行うことで集約できる. 本研究では, このような集約作業を支援する手法を提案する.", "num_citations": "2\n", "authors": ["88"]}
{"title": "類義語の特定に基づく類似コード片検索法\n", "abstract": " 論文抄録ソースコード中に類似した部分 (類似コード片) が散在していると, ソースコードの一部分を修正したときにその類似部分に対しても同様の修正をする必要が生じることがあるため, 保守作業が困難になるという問題がある. 一般に, ソフトウェア開発者は類似コード片を調査する際には, grep などのキーワード検索ツールを用いる. しかし, 類似コード片には様々な差異が存在するため, 修正の必要がある類似コード片の多くを列挙できるキーワードを与えることは困難である. 本研究では, 入力したコード片の類似コード片を, コード片に含まれる識別子の類似性に基づいて検索する手法を提案する. 本手法は, まず, 共起関係に基づいて語 (識別子を分割・正規化した後の文字列) をクラスタリングすることで類義語を求める. その後, 入力コード片に含まれるすべての語について, 同一もしくは類義語である語を含むコード片を検出し, 類似コード片として提示する. 適用実験として, 提案手法を用いて類似した欠陥を含むコード片の検索を行ったところ, 類似した欠陥の多くを提示できることを確認した. また, 提案手法と既存ツール (grep およびコードクローン検出ツール CCFinder) との比較実験を行い, それぞれの検索結果が持つ特徴を確認した.", "num_citations": "2\n", "authors": ["88"]}
{"title": "識別子の共起関係に基づく類似コード検索法の提案と欠陥検出への適用\n", "abstract": " ソフトウェアの保守を行う際に, 複数箇所に同様の修正を加える必要が生じることがある. 例えば, ソースコード中にある欠陥が見つかった際は, 他の箇所に存在する同様の欠陥を修正しなければならない. このような場合, grep等を使ったキーワード検索やコードクローン検出法を用いて, 修正を検討すべき箇所を検索する方法が考えられる. しかし, これらの方法は, キーワードをクエリ(検索質問)として考案する必要があるという問題点や, 字句解析後のトークン列が連続して一致もしくは類似する箇所でなければ, 同様の修正を検討するべき箇所として提示できないという問題点がある. 本稿では, これらの問題点を解決するために, クエリとしてコード片(ソースコードの一部)を与えると識別子の共起関係に基づいて類似コードを検索する手法を提案する. 提案手法は, まず修正を検討すべきコード片を1つ選択しクエリとして与えると, そのコード片から特徴語(頻出する語)を自動的に抽出する. 次に, 抽出した特徴語の含むコード片をソフトウェア中から検出する. 提案手法は2つのソフトウェアに含まれていた欠陥の多くを提示できることを確認した.", "num_citations": "2\n", "authors": ["88"]}
{"title": "Hepatitis B virus and epidemiological study on efficacy of HBIG and vaccine for the prevention of type B hepatitis after accidental exposures among medical staffs (2)\n", "abstract": " The best method of preventing HBV is accurate perception on the part of the patient. There is a need for sufficient care regarding patient blood with HBsAg (+), HBeAg (+) and HBc high-antibody titer. The following is a report on a follow-up survey regarding antibody titer following dosages of HBIG 2 V and 1 V and administration of a vaccine along with dosage of HBIG 1 V. 1. Dosage of HBIG 2V:(Female) Antibody titer was recognized two days following dosage. It continued for two weeks and disappeared after four weeks.(2)(Male) Antibody titer was recognized one day following dosage but disappeared after two weeks. 2. Dosage of HBIG 1 V:(Female) Antibody titer (-) was recognized two days after dosage and nine days after dosage. It continued for about one month and disappeared after five months. 3. Administration of three vaccines and dosage of HBIG 1 V:(Female) Antibody titer was recognized two days after HBIG 1 V dosage and continued for 18 days but disappeared after three months. Antibody titer was recognized again after about eight months and showed signs of continuing for 13 months.", "num_citations": "2\n", "authors": ["88"]}
{"title": "Symbolic execution-based approach to extracting a micro state transition table\n", "abstract": " During embedded system development, developers frequently change and reuse the existing C source code for the development of a new but behaviorally similar product. Such frequent changes generally decrease the understandability of C source code although the developers have to understand how it behaves and how to reuse it. So far, much research has been done on symbolic execution techniques that statically analyze the behavioral aspect of given source code. In this paper, we propose a symbolic execution-based approach to extracting a Micro State Transition Table (MSTT) that helps developers understanding the behavioral aspect of embedded C source code based on a fine-grained state transition model. As a case study, we applied the proposed approach to a collection of source files and then confirmed the correctness of the extracted MSTTs.", "num_citations": "1\n", "authors": ["88"]}
{"title": "Towards static recovery of micro state transitions from legacy embedded code\n", "abstract": " During the development of an embedded system, state transition models are frequently used for modeling at several abstraction levels. Unfortunately, specification documents including such model are often lost or not up to date during maintenance/reuse. Based on our experience in industrial collaboration, we present Micro State Transition Table (MSTT) to help developers understanding embedded code based on a fine-grained state transition model. We also discuss the challenges of static recovery of an MSTT.", "num_citations": "1\n", "authors": ["88"]}
{"title": "組込みシステムの要求仕様書を対象とした状態遷移モデル作成支援\n", "abstract": " 抄録 (和) 要求仕様書は多くの場合, 自然言語で記述される. そのため, 目視による確認では発見できない記述漏れや不整合が存在しうる.", "num_citations": "1\n", "authors": ["88"]}
{"title": "順伝播型ニューラルネットワークを用いた類似コードブロック検索の試み\n", "abstract": " Ichi Tracker は, 入力として与えられたコード片と類似し, 再利用可能なコード片をオープンソースソフトウェアから高い精度で検索するシステムである. しかし, このシステムは入力コード片に類似しているコード片でも, 構文上の差異が存在する場合, 検索結果から削除されてしまう可能性がある. 本研究では, この問題を解決するために順伝播型ニューラルネットワークを用いて, 入力コード片と類似したコードブロックの検索を試みる. 本検索手法は, 事前にソースコードに対してミューテーションを行い, 様々な種類の類似ソースコードを作成した後, 元ソースコード及び類似ソースコードのコードブロックを抽出する. また, 抽出した各コードブロックを特徴ベクトルに変換し, 類似ソースコードのグループ毎にユニークなラベルを付与し, 教師あり学習で順伝播型ニューラルネットワークのモデルを作成する. 入力コード片の類似コードブロックを検索する際は, 作成したモデルへ, 入力コード片から作成した特徴ベクトルを与え, モデルが出力したラベルに該当するグループのコードブロックを出力する. 評価実験 …", "num_citations": "1\n", "authors": ["88"]}
{"title": "プログラミング演習における探索的プログラミング行動の自動検出手法の提案\n", "abstract": " プログラミング演習において, リアルタイムに教員が各学生の進捗を把握し, 適切なアドバイスを与えることは困難である. 本研究では, 探索的プログラミングと呼ばれる, 実装が不明確な箇所に対して, 修正・コンパイル・実行を繰り返すプログラミング行動に着目する. 学生がプログラムのどの箇所に対して探索を行っているかを検出し, 課題に対する取り組みや難所をリアルタイムに特定することを目指す. 提案手法を実際のプログラミング演習に適用したところ, 同一課題における学生間のアプローチの違いや, エラーが生じた原因の特定が容易になることが確認できた.", "num_citations": "1\n", "authors": ["88"]}
{"title": "組込みシステムの要求仕様書に対する修正候補の定量的調査\n", "abstract": " あらまし ソフトウェア開発においては様々な文書が作成されるが, 文書作成者によっては, 文書中に曖昧さや誤りが生じることがあり, その文書を使用するプロセスにおける障害となることがある. そこで本研究では, 組込みシステムの要求仕様書から修正候補を目視で抽出する. 各修正項目を分類し, 分類ごとの出現回数についてまとめた. 自動抽出が容易な分類の内, 一部の誤りや曖昧さについて, 形態素解析ツールによる自動抽出を試みた. その結果, 一部の誤りや曖昧さについて目視の場合とは異なる抽出結果となったが, 同一格助詞の不正な連続出現パターンについては, 目視の結果と 97% 程度一致した.", "num_citations": "1\n", "authors": ["88"]}
{"title": "ソフトウェア開発 PBL におけるビルドエラーの調査\n", "abstract": " 論文抄録ソフトウェア開発においてビルドは重要な工程の 1 つである. 多くの既存研究が企業のソフトウェア開発においてビルドが成果物の品質へ与える影響やビルドの支援手法を調査している. 一方, 高等教育機関で開講されている, ソフトウェア開発 PBL 演習における学生のビルド活動の実態調査は十分に行われていない. そこで, 我々はアジャイル開発を取り入れたソフトウェア開発 PBL において, 学生のビルドエラーの実態調査を行い, 学生が陥りやすいビルドエラーの特徴を分析した. 具体的には, 学生が個人の開発環境において行うローカルビルドと, チーム共用開発環境で行われるリモートビルドを調査した. ローカル/リモートビルドにおけるエラーの種類, 各種エラーの回数や解決時間を調査・比較したところ, 学生も実務家同様ファイル間の要素の依存関係によるエラーが多いことや, ローカルでビルドを頻繁に実行・結果を確認することでリモートでのエラー発生を防ぐことが可能なエラー種類などが判明した. これらの結果は, ソフトウェア開発 PBL において教員が優先的に指導・確認すべき項目として扱うことが可能である.", "num_citations": "1\n", "authors": ["88"]}
{"title": "Detecting exploratory programming behaviors for introductory programming exercises\n", "abstract": " Developers often perform the repeating cycle of implementation and evaluation when they need to deal with the unfamiliar portion of the source code. This cycle is named as exploratory programming. We regard exploratory programming as an effective way not only to improve novice's programming skill but also to support educators in programming exercise in University. Because when novices often use the exploratory programming, it means novices struggle to solve their assignments. Therefore, educators should grasp which elements, APIs or blocks novices often used exploratory programming for. In this paper, firstly we propose the definition of novice's exploratory programming to collect logs of exploratory based on various granularity by novices. Secondly, we propose an algorithm based on our proposed definition to automatically detect exploratory programming behaviors. We also conducted a small case …", "num_citations": "1\n", "authors": ["88"]}
{"title": "Code Smell の深刻度がリファクタリングに与える影響の調査\n", "abstract": " 論文抄録リファクタリングとは, ソフトウェアの外部から見た振る舞いを変えずに, 内部構造を整理する作業である. リファクタリングすべき箇所を特定することの支援の 1 つとして, 開発者へ Code Smell を提示することでソースコードの問題を可視化することが行なわれている. Code Smell とは, ソースコードの設計上の問題を示す指標であり, リファクタリングの実施が推奨されている. どのような Code Smell に対して実際に開発者がリファクタリングを実施するかを知ることは支援方法の考察に有用である. そのため, 各種類の Code Smell がリファクタリングの実施に与える影響の調査が行なわれている. しかし, 一方で Code Smell の示す問題の大きさを考慮した研究は現在までに行なわれていない. リファクタリングの実施にはコストがかかるため, Code Smell を修正するコストと効果は, リファクタリングを実施するかの判断に影響すると推測できる. この推測が正しければ, 同種類の Code Smell でも軽度なものと重度なものでは, リファクタリングが実施されるかの傾向が異なると考えられる. 本研究では, Java で書かれた 3 つのオープンソースソフトウェアの開発履歴を調査対象として, Code Smell 検出ツールが提示する深刻度という重要さの指標と, リファクタリングの実施された頻度の関係について調査を行なった. 一部の Code Smell について, リファクタリングされるクラスの深刻度がされないものと比べて有意に高いことがわかった.", "num_citations": "1\n", "authors": ["88"]}
{"title": "Chromium プロジェクトにおけるレビュー・パッチ開発経験がレビューに要する時間に与える影響の分析\n", "abstract": " 本研究の目的は, OSS におけるパッチのレビュー経験および開発経験がレビューに要する時間に与える影響を分析することである. 影響の分析には Chromium プロジェクトのバージョン管理およびレビュー管理システムから得られるデータを用いた. 分析の結果, レビュー経験 (回数), パッチ開発経験 (投稿回数) のどちらもレビューにかかる時間と強い負の相関がある事が分かった. またバグ管理システムから得られるデータを追加し, 前述のデータを組合わせて分析を行った結果, レビュー時間の短縮はパッチに含まれるバグの見逃されやすさに対して有意な影響を及ぼさない事が分かった.", "num_citations": "1\n", "authors": ["88"]}
{"title": "変更履歴解析に基づくリファクタリング検出技術の調査\n", "abstract": " リファクタリングとは, ソフトウェアの外部的振る舞いを変化させることなく, 内部の構造を改善するプロセスを指す. 研究者・実務者ともに, 開発プロジェクトにおいて過去に実施されたリファクタリングを知りたいという要求がある. そこで, リファクタリングの実施を自動的に検出する手法 (リファクタリング検出手法) が数多く提案されている. これらの手法は, 多様な国際会議や論文誌において発表されており, 研究者や実務者にとって研究成果を概観することは容易ではない. 本稿では, リファクタリング検出手法の中でも, 盛んに研究が行われている成果物の変更履歴解析に基づく手法を中心に紹介を行う. まず, 本稿におけるリファクタリング検出の定義および分類について述べる. その後, 成果物の変更履歴解析に基づく手法を紹介し, 今後行われる研究の方向性について考察を行う.", "num_citations": "1\n", "authors": ["88"]}
{"title": "Eosinophilic chronic rhinosinusitis\n", "abstract": " Eosinophilic chronic rhinosinusitis — Okayama University Skip to main navigation Skip to search Skip to main content Okayama University Logo Home Researcher Profiles Research Units Research output Activities Press / Media Prizes Search by expertise, name or affiliation Eosinophilic chronic rhinosinusitis Shigeharu Fujieda, Masafumi Sakashita, Takahiro Tokunaga, Mitsuhiro Okano, Takenori Haruna, Mamoru Yoshikawa, Nobuyoshi Ohtori, Daiya Asaka, Shinichi Haruna, Tsuguhisa Nakayama, Junichi Ishitoya, Yasunori Sakuma, Katsuhiro Hirakawa, Sachio Takeno, Tetsuo Himi, Nobuhiko Seki, Yukiko Lino, Naohiro Yoshida, Masayoshi Kobayashi, Hiroshi Sakaida Show 20 more Show less Kenji Kondo, Tatsuya Yamasoba, Takaki Miwa, Kanako Yamada, Ryo Kawata, Tetsuya Terada, Hideyuki Kawauchi, Ichiro Morikura, Katsuhisa Ikeda, Junko Murata, Hiroki Ikeda, Emiko Noguchi, Mayumi Tamari, Tomomitsu , .…", "num_citations": "1\n", "authors": ["88"]}
{"title": "コードクローン編集者数に着目した開発履歴の分析\n", "abstract": " 論文抄録コードクローンとは, 互いに一致もしくは類似したコード片のことである. 一般的に, あるコードクローンが編集されると, 同じクローンセット (コードクローンの関係となっている全てのコード片の集合) に属されている他のコードクローンも同様に編集される必要がある. しかし, 異なる開発者がクローンセット内の各コードクローンの編集を担当している場合は, コードクローンに対する一貫した編集が困難である. この問題を防ぐために, 開発者間でのコードクローンの編集情報の共有を支援ツールが開発されている. しかし, このツールは複数人でコードクローンを編集する体制を前提としたものであり, 実際のソフトウェア開発現場でのコードクローン編集管理が複数人によって行われているとは限らない. 従って, コードクローンを編集している開発者の人数について調査する必要がある. 本研究ではある成果物に対して最も編集を行っている開発者がどの程度編集を行っているかを示す Ownership メトリックを用いてオープンソース開発履歴に対してクローンセット毎の編集者の傾向を分析した.", "num_citations": "1\n", "authors": ["88"]}
{"title": "産学連携によるソフトウェア進化パターン収集の試み\n", "abstract": " 論文抄録ソフトウェア進化を実践する上での指針や慣例がソフトウェア進化パターンである. 我々は, Demeyer らのオブジェクト指向リエンジニアリングパターンを補完することを目的に, 産学連携でパターンの収集を試みた. 本稿では, その結果として, ソフトウェアプロダクトライン, コードクローン, ソフトウェア変更支援, プログラム理解支援, リファクタリングプロセスに関する進化パターンを提案する.", "num_citations": "1\n", "authors": ["88"]}
{"title": "組み合わせて実施されたリファクタリングの調査\n", "abstract": " 雜賀 翼† 崔 恩瀞† 後藤 祥† 吉田 則裕†† 井上 克郎†† 大阪大学 大学院情報科学研究科〒 565-0871 大阪府吹田市山田丘 1 番 5 号†† 名古屋大学 大学院情報科学研究科〒 464-8601 名古屋市千種区不老町 E-mail:†{t-saika, ejchoi, a-gotoh, inoue}@ ist. osaka-u. ac. jp,†† yoshida@ ertl. jp あらまし リファクタリングを支援するツールが研究されているが, 組み合わせて実施されるリファクタリングについてはあまり研究されておらず, 既存ツールでは複数のリファクタリングをまとめて実施することができない. ソフトウェア開発履歴中のリファクタリングを対象に, 90 秒以内に連続して実施されたリファクタリングの組み合わせを調査した結果, 3 つのパターン (Move, Rename),(Rename, Rename),(Extract, Move) の実施される頻度が高いことが分かった. さらに, それらの組み合わせがどのような作業を行っているかを, リファクタリングの実施履歴の詳細から調べ, その調査結果からリファクタリングの組み合わせをまとめて実施するための, Eclipse のリファクタリング機能の改善を考案した.", "num_citations": "1\n", "authors": ["88"]}
{"title": "トピック抽出を用いたソフトウェア開発履歴の可視化ツール\n", "abstract": " 近年, 企業が開発するソフトウェアプロダクト中に, OSS が組み込まれることが多くなった. 企業の開発者は, OSS を採用するかどうか判断する際に, 関心のある機能に貢献している開発者に連絡をとり, その機能に関するバグ修正や拡張の保守計画を知りたいと考える. しかし, 個々の機能に貢献している開発者を特定することは, OSS がボランティア活動で成り立っていることから難しい場合が多い. 本研究では, 開発履歴に対してトピック抽出を行うことで, 個々の OSS 開発者の活動を可視化するツールを開発する. 本ツールを用いることで, 個々の機能に貢献している OSS 開発者を特定する作業を支援できると期待される.", "num_citations": "1\n", "authors": ["88"]}
{"title": "Reviewer Recommendation for Peer Review based on File Path Similarity: A Case Study of the Android Open Source Project\n", "abstract": " (in English) Peer Review is regarded as an important quality assurance mechanism in Open Source Software (OSS) development. Every change and its impact need to be assessed by developers to assure the quality of software. For effective code review, experience and skilled reviewers are required. However, in OSS peer review process, there is no explicit policy for selecting appropriate reviewers among available developers. The manual selection of those reviewers can be a costly and time-consuming task. To ease developers in OSS peer review process, we propose a reviewer recommendation algorithm determining similarity of file paths. As a case study, we recommended reviewers for the Android Open Source Project (AOSP). For this case study, our proposed algorithm obtained an accuracy of 75% while a previous approach obtained an accuracy of 30%.", "num_citations": "1\n", "authors": ["88"]}
{"title": "テキストマイニング技術を応用したメソッドクローン検出手法の提案\n", "abstract": " 論文抄録ソフトウェア保守における問題の 1 つとしてコードクローン (ソースコード中に存在する同一または類似した部分を持つコード片) が指摘されている. コードクローンを検出し, 共通する処理に対して親クラスへの引上げやライブラリ化といった集約を行うことによって, ソフトウェアの保守性や可読性を向上させることが可能となる. これまでの研究において様々なコードクローン検出手法が提案されてきたが, 多くの手法がプログラムの構造的な類似性に着目しており, 意味的に類似したコードクローンを検出することを目的とした手法は少ない. また, プログラムの意味的な類似性に着目した手法では, 検出時間に膨大な時間がかかるという問題点がある. そこで本研究では, テキストマイニング技術を応用したメソッドクローン (メソッド単位のコードクローン) を検出する手法を提案する. テキストマイニングは文字列を対象としたデータマイニングのことであり, 自然言語で書かれた文書の分類などに利用される. 本手法ではこの技術を利用し, ソースコード中の識別子や予約語に利用される単語に対して重要度の重み付けを行うことによって, 各メソッドの特徴ベクトルを計算する. そして, 特徴ベクトル間の類似度を求めることによってメソッドクローンの検出を行う. 本手法によって, 類似した処理を行うメソッドを高速に検出することが可能であると考えられる.", "num_citations": "1\n", "authors": ["88"]}
{"title": "A study of egg breaking motion by single robot arm\n", "abstract": " In this study, we aim to achieve a robot motion to break an egg by a single robot arm. Eggs are often used for cooking. The study of the egg breaking by a dual arm robot has been done until now. We considered an adequate motion to break an egg by using a single robot arm. The arm makes a crack on the egg by hitting it to the edge of a frying pan, opens the shell of the egg by hooking it to the edge of the pan, and the content of the egg is dropped into the pan. We confirmed that this task was successfully executed only by using a single robot arm with the generated motion.", "num_citations": "1\n", "authors": ["88"]}
{"title": "ソフトウェアリポジトリにおけるコードクローン作成者・利用者関係分析手法とその適用\n", "abstract": " 一般に,ソースコードやライブラリの再利用はソフトウェア開発における生産性や信頼性,コスト等の改善に繋がると言われている.一方でソースコードの再利用は,対象となるソースコードを十分に理解し,利用する必要があるため,非常に困難なタスクであると考えられている.そのため,再利用しやすいソースコードの特徴や開発者がどのようなときに再利用を行うかといった既存の再利用動向の分析は,再利用支援において非常に重要である.しかしながら,複数のプロジェクトを対象とした再利用分析において,具体的に誰がどのような再利用を行っているかを定量的に分析した事例は非常に限られているのが現状である.そこで本研究では,コードクローン検出ツールと版管理システムを用い,複数プロジェクトを対象としたコードクローン利用者と作成者の分析手法を提案し,実際にOSSを対象とした分析を行った.その結果,開発者ごとに再利用動向が異なり,分析を進める価値があることを示した.", "num_citations": "1\n", "authors": ["88"]}
{"title": "ソフトウェア品質の第三者評価を目的としたメトリクス基準値導出法の提案\n", "abstract": " 抄録 (和) ソフトウェア開発現場では, 定量的指標による品質評価が行われている. この手段として, 構成管理データなどから計測可能なメトリクスに対する基準値を用いた手法が知られている. 一方で, 基準値は経験的, 慣習的に決定されるため, 現場への導入時や第三者評価に用いる際の説得力に欠ける. そこで本研究では, ソースコードデータセットから計測したメトリクス値の分布に依る基準値の導出法を検討した. また, 複数の OSS を対象に評価実験を行った結果, 提案手法で導出したメトリクス基準値により低品質なメソッドを含むファイルを発見できた.(英) Quantitative indicators have been used for quality assessment during actual software development. During the quality assessment, metric values are computed from configuration management system, and then compared with baseline metric values. However, because the baseline metric values are often determined from the convention and experience of a team, it is difficult to convince outsiders …", "num_citations": "1\n", "authors": ["88"]}
{"title": "構文情報を付加したリポジトリによるメソッド抽出リファクタリングの検出\n", "abstract": " 抄録 (和) 近年, ソフトウェア開発履歴を分析することでリファクタリングが品質に与える影響を明らかにすることを目的とした研究が多数実施されている.", "num_citations": "1\n", "authors": ["88"]}
{"title": "細粒度作業履歴を用いた Task Level Commit 支援手法の提案\n", "abstract": " あらまし バージョン管理システム (VCS) を利用した開発では, 単一のタスクに関連する小さな変更ごとにソースコードを VCS のリポジトリに格納 (コミット) すること (Task Level Commit と呼ばれる) が望ましいとされている. 一方で, コミット忘れや複数タスクの同時実施等により, 1 回のコミットに複数のタスクに関連する大きな変更が含まれてしまうことがある. このような場合, どの変更がどのタスクに関連するかを開発者が把握しにくくなり, 結果として変更内容の理解が難しくなることがある. そこで本稿では開発者がコミットを行う際に, ソースコードに対する変更内容をタスク単位で再構成できるよう支援する手法を提案する. 提案手法によってタスクごとのコミットがどの程度実施できるようになるかを評価する実験を行ったところ, 4 名の被験者全員について改善が見られた.", "num_citations": "1\n", "authors": ["88"]}
{"title": "トピック抽出に基づく開発者の活動に着目したリポジトリ可視化手法\n", "abstract": " 論文抄録ソフトウェア開発プロジェクトでは, 個々の開発者の活動がソフトウェアの品質に影響を与えると考えられており, 開発プロセスの改善にはプロジェクト全体ではなく開発者単位でも行われるべきと考えられている. しかし, 開発者の活動を逐一記録するのは困難である. 通常ソフトウェア開発では構成管理システムが利用されており, 開発で作成・編集されるソースコードや開発における不具合の修正履歴などを記録している. そこで, 構成管理システムの 1 つであるバージョン管理システムに記録されたデータから活動を可視化する手法を提案する. まず, ソースコードのコメントや識別子名, システムのコミットログからコミット単位でドキュメントを作成し, それを LDA (latent Dirichlet allocation) を用いてトピックの抽出を行う. 次にドキュメントの基になったコミットを行った開発者とドキュメントのトピック分布を用いてトピックの変化を可視化する. 最後に抽出されたトピックと可視化されたトピックの変化から開発者の活動を推定する. 本論文ではオープンソースソフトウェアプロジェクトの Columba に提案手法を適用し得られた一部の特徴的なトピックを中心に結果と考察を述べる.", "num_citations": "1\n", "authors": ["88"]}
{"title": "差分を含む類似メソッドの集約支援ツール\n", "abstract": " ソースコード中で互いに一致または類似したメソッドを類似メソッドという.可読性や保守性の向上を目的として,類似メソッドを 1 つに集約する作業がよく行われるが,類似メソッド間に差分が存在する場合,その集約は難しい.そこで,本研究では,差分を含む類似メソッドの集約作業を,集約候補を提示することで支援する手法を提案する.また,提案手法を統合開発環境 Eclipse のプラグインとして実装した.実験では,オープンソースソフトウェア上の類似メソッドに対して提案手法を適用した.そして,適用結果をもとにアンケートを行い,結果に有用な集約候補が含まれていることを確認した.", "num_citations": "1\n", "authors": ["88"]}
{"title": "コードクローン変更管理システムの開発と実プロジェクトへの適用\n", "abstract": " ソフトウェア保守における大きな問題の一つとしてコードクローンが指摘されている.コードクローンとは,ソースコード中に,互いに一致または類似した部分を持つコード片のことである.コードクローンに対する主な保守作業として,クローンセット(互いにコードクローンとなっているコード片の集合)に含まれる全てのコード片を一貫して編集する同時修正と,クローンセットを1つのサブルーチンにまとめる集約が挙げられる.本研究では,コードクローンに対する保守作業を支援することを目的としたコードクローン変更管理システムの開発を行った.そして,企業で行われているソフトウェア開発に適用することによって,本システムの有用性を確かめることができた.", "num_citations": "1\n", "authors": ["88"]}
{"title": "凝集度メトリクス COB を用いた Template Method パターン適用候補の順位付け手法\n", "abstract": " ソフトウェアの保守を困難にしている要因として,コードクローンが挙げられる.この問題を解決する方法として,コードクローンの集約が挙げられるが,リファクタリングの熟練者でない限り難しい.これを支援する手法を政井らが提案している.この手法は,不一致部分を含み,メソッドとして抽出することが可能なコード片の候補を提示すが,候補の順序に意味を持たないため,本研究では,凝集度メトリクスを用いて候補の順位付け手法を提案する.実験では,メソッド間クローン率の高いオープンソースソフトウェアに対して本手法を適用し,利用者にとって有用な候補が上位に現れていることを確認できた.", "num_citations": "1\n", "authors": ["88"]}
{"title": "プログラム依存グラフの一貫性検査に基づく欠陥候補の検出手法\n", "abstract": " 本稿では, プロジェクト内の各ソースファイルから構築したプログラム依存グラフに対し一貫性検査を行うことで, ソースコードから欠陥候補を検出する手法を提案する. プログラム依存グラフとは, 文を頂点とし, 制御依存辺とデータ依存辺の2種類の辺をもつ有向グラフである. まず, 構築したプログラム依存グラフの集合から, 頻出部分グラフを抽出する. 次に, 頻出部分グラフの一部が欠落した部分グラフを検出し, 対応するソースコードを欠陥候補として開発者に提示する.", "num_citations": "1\n", "authors": ["88"]}
{"title": "シーケンシャルパターンマイニングに基づくオブジェクト指向プログラムのための欠陥検出手法\n", "abstract": " 論文抄録シーケンシャルパターンマイニングとよばれるデータマイニングの手法をソースコードに適用し, その結果を用いた欠陥検出手法についての研究が行われている. しかし, それらをオブジェクト指向言語に適用した研究は確認されていない. 本研究では, その欠陥検出手法をオブジェクト指向言語に適用した. 実際に欠陥を検出するツールを作成し, オープンソースプログラムに適用したところ, 欠陥を検出することができた.", "num_citations": "1\n", "authors": ["88"]}
{"title": "ソフトウェア保守性を評価するメトリクス間の関連分析\n", "abstract": " 概要ソフトウェア開発の大規模化, 複雑化, 開発期間の短縮化に伴い保守性の高いソフトウェアを開発することの重要性が高まっている. 保守性の評価としては, これまでサイクロマチック数をはじめとした複雑度メトリクスやソースコード中の同一または類似した部分を指すコードクローンに関連したメトリクスが用いられることが多かった. しかし, これらのメトリクスの評価結果がどのような関連にあるかは確認されていなかった. そこで, 本研究では複数社で共同開発された中規模情報システムを対象とし, 複雑度メトリクスと, コードクローンに関連したメトリクスの相関を調査した. その結果, 各メトリクスの間には相関が見られず, 保守性の別の側面をそれぞれ評価していることがわかった.", "num_citations": "1\n", "authors": ["88"]}
{"title": "API の使用に伴うコードクローンの特徴分析\n", "abstract": " 論文抄録本稿では, ある特定の API を使うときに現れやすいコードクローンを見つけ出し, その特徴を分析することを目的とする. 分析の対象としてある開発会社 A 社が開発した Web アプリケーションを選択した. この実プロジェクトで開発された Java ソースコードを分析し, Servlet や Web Service API XML SAX Parser, XML DOM Parser などの API やフレームワークを使うときにコードクローンが現れることを確認した. そして, そこに使用している API 固有の特徴が現れていることを確認した.", "num_citations": "1\n", "authors": ["88"]}