{"title": "A Look into Programmers' Heads\n", "abstract": " Program comprehension is an important, but hard to measure cognitive process. This makes it difficult to provide suitable programming languages, tools, or coding conventions to support developers in their everyday work. Here, we explore whether functional magnetic resonance imaging (fMRI) is feasible for soundly measuring program comprehension. To this end, we observed 17 participants inside an fMRI scanner while they were comprehending source code. The results show a clear, distinct activation of five brain regions, which are related to working memory, attention, and language processing, which all fit well to our understanding of program comprehension. Furthermore, we found reduced activity in the default mode network, indicating the cognitive effort necessary for program comprehension. We also observed that familiarity with Java as underlying programming language reduced cognitive effort during …", "num_citations": "34\n", "authors": ["2170"]}
{"title": "On the Nature of Programmer Expertise\n", "abstract": " Many experts in fields such as mathematics, medicine, and chess display intellectual marvels undiminished with age. However, software engineers, much like athletes, seem to have a limited lifetime for applying their expertise. Compared to other areas of expertise, the elements of which programming expertise is built upon is unstable, short-lived, and often non-transferable. In this position paper, we derive insights from psychology, cognitive neuroscience, and decades of software engineering research on expertise. Using these insights, we strive to understand what representations, strategies, and cognitive processes and mechanisms experts use when performing exceptional programming feats. In particular, we want to understand how expertise shapes an expert’s mind, and understand the intricate patterns and strategies that expert programmers hone over the years. To answer these questions, we propose to use several brain-imaging techniques to study expert software engineers. Finally, based on these results, we wish to derive guidelines in order to help companies and teachers in identifying and training programmers to quickly adapt to changes in terms of languages, projects, teams, and techniques.", "num_citations": "10\n", "authors": ["2170"]}
{"title": "Enhancing fMRI Studies of Program Comprehension with Eye-Tracking\n", "abstract": " Understanding program comprehension is a fundamental research question, which requires multiple methods to fully understand it. In this paper, we propose to combine eyetracking and functional magnetic resonance imaging (fMRI) study to gain additional data for interpreting programmers’ cognitive processes during top-down comprehension. In this paper, we present a proposal for such a combined approach.", "num_citations": "5\n", "authors": ["2170"]}
{"title": "A Neuro-Cognitive Perspective of Program Comprehension\n", "abstract": " Program comprehension is the cognitive process of understanding code. Researchers have proposed several models to describe program comprehension. However, because program comprehension is an internal process and difficult to measure, the accuracy of the existing models are limited. Neuro-imaging methods, such as functional magnetic resonance imaging (fMRI), provide a novel neuro-cognitive perspective to program-comprehension research. With my thesis work, we aim at establishing fMRI as a new tool for program-comprehension and software-engineering studies. Furthermore, we seek to refine our existing framework for conducting fMRI studies by extending it with eye tracking and improved control conditions. We describe how we will apply our upgraded framework to extend our understanding of program comprehension. In the long-run, we would like to contribute insights from our fMRI studies …", "num_citations": "4\n", "authors": ["2170"]}
{"title": "Summary of the Sixth Edition of the International Workshop on Eye Movements in Programming\n", "abstract": " The study of eye gaze data has great potential for research in computer programming, computing education, and software engineering practice. To highlight its role for the software engineering community, the Sixth Edition of the International Workshop on Eye Movements in Programming (EMIP 2019) was co-located with the 41st International Conference on Software Engineering. The goal of the workshop was to advance the methodology of using eye tracking for programming, both theoretically and in applications.", "num_citations": "2\n", "authors": ["2170"]}
{"title": "Exploration of competitive market behavior using near-real-time sentiment analysis\n", "abstract": " Master's Thesis from the year 2014 in the subject Computer Science-Commercial Information Technology, grade: 1.1, Otto-von-Guericke-University Magdeburg (Faculty of Computer Science), language: English, abstract: Emotions are not only the foundation of human life, but also influence all decisions in modern markets. Grasping the reasoning behind our choices is a key element in econom-ic sciences. Sentiment analysis, a tool to extract emotions from text, is used in this thesis to analyze customers’ opinions in various markets. The calculations are done on a server architecture that is designed to be scalable for massive input directly from social net-works. It computes the sentiment score in a flexible multi-stage process and provides several methods of accessing the results. Subsequently, it is demonstrated how to use the system’s capabilities by implementing various commercial use cases. This includes geographical and demographic analysis. Additionally, the system is able to provide near-real-time results. Lastly, the thesis concludes by performing several correlation analyses on the collected data. This illustrates how the intensity of emotions vary by the maturity and form of the economic market and affects the participating companies in these markets.", "num_citations": "2\n", "authors": ["2170"]}
{"title": "GeoPointing on indoor maps: enhancing compass sensor accuracy to enable interactive digital object selection in smartphone-based map applications\n", "abstract": " Indoor geopointing is a mobile computing field of application where high resolution compass data is required, in order to reliably identify digital objects on a map or within a scene. When mobile application developers wish to implement geopointing applications, they are hindered by the limited accuracy and reliability of the orientation sensors that are included in today's smartphones. Calibration issues and magnetic field interference are the two major influence factors that distort the data which is generated by the compass sensor.", "num_citations": "2\n", "authors": ["2170"]}