{"title": "SpaceEx: Scalable verification of hybrid systems\n", "abstract": " We present a scalable reachability algorithm for hybrid systems with piecewise affine, non-deterministic dynamics. It combines polyhedra and support function representations of continuous sets to compute an over-approximation of the reachable states. The algorithm improves over previous work by using variable time steps to guarantee a given local error bound. In addition, we propose an improved approximation model, which drastically improves the accuracy of the algorithm. The algorithm is implemented as part of SpaceEx, a new verification platform for hybrid systems, available at spaceex.imag.fr. Experimental results of full fixed-point computations with hybrid systems with more than 100 variables illustrate the scalability of the approach.", "num_citations": "987\n", "authors": ["1870"]}
{"title": "Prom timed to hybrid systems\n", "abstract": " We propose a framework for the formal specification and verification of timed and hybrid systems. For timed systems we propose a specification language that refers to time only through age functions which measure the length of the most recent time interval in which a given formula has been continuously true.             We then consider hybrid systems, which are systems consisting of a non-trivial mixture of discrete and continuous components, such as a digital controller that controls a continuous environment. The proposed framework extends the temporal logic approach which has proven useful for the formal analysis of discrete systems such as reactive programs. The new framework consists of a semantic model for hybrid time, the notion of phase transition systems, which extends the formalism of discrete transition systems, an extended version of Statecharts for the specification of hybrid behaviors, and an …", "num_citations": "547\n", "authors": ["1870"]}
{"title": "Robust satisfaction of temporal logic over real-valued signals\n", "abstract": " We consider temporal logic formulae specifying constraints in continuous time and space on the behaviors of continuous and hybrid dynamical system admitting uncertain parameters. We present several variants of robustness measures that indicate how far a given trajectory stands, in space and time, from satisfying or violating a property. We present a method to compute these robustness measures as well as their sensitivity to the parameters of the system or parameters appearing in the formula. Combined with an appropriate strategy for exploring the parameter space, this technique can be used to guide simulation-based verification of complex nonlinear and hybrid systems against temporal properties. Our methodology can be used for other non-traditional applications of temporal logic such as characterizing subsets of the parameter space for which a system is guaranteed to satisfy a formula with a …", "num_citations": "490\n", "authors": ["1870"]}
{"title": "Symbolic model checking with rich assertional languages\n", "abstract": " The paper shows that, by an appropriate choice of a rich assertional language, it is possible to extend the utility of symbolic model checking beyond the realm of BDD-represented finite-state systems into the domain of infinite-state systems, leading to a powerful technique for uniform verification of unbounded (parameterized) process networks. The main contributions of the paper are a formulation of a general framework for symbolic model checking of infinite-state systems, a demonstration that many individual examples of uniformly verified parameterized designs that appear in the literature are special cases of our general approach, verifying the correctness of the Futurebus+ design for all single-bus configurations, and extending the technique to tree architectures.", "num_citations": "338\n", "authors": ["1870"]}
{"title": "Efficient computation of reachable sets of linear time-invariant systems with inputs\n", "abstract": " This work is concerned with the problem of computing the set of reachable states for linear time-invariant systems with bounded inputs. Our main contribution is a novel algorithm which improves significantly the computational complexity of reachability analysis. Algorithms to compute over and under-approximations of the reachable sets are proposed as well. These algorithms are not subject to the wrapping effect and therefore our approximations are tight. We show that these approximations are useful in the context of hybrid systems verification and control synthesis. The performance of a prototype implementation of the algorithm confirms its qualities and gives hope for scaling up verification technology for continuous and hybrid systems.", "num_citations": "292\n", "authors": ["1870"]}
{"title": "Reachability analysis via face lifting\n", "abstract": " In this paper we discuss the problem of calculating the reachable states of a dynamical system defined by ordinary differential equations or inclusions. We present a prototype system for approximating this set and demonstrate some experimental results.", "num_citations": "271\n", "authors": ["1870"]}
{"title": "Systematic simulation using sensitivity analysis\n", "abstract": " In this paper we propose a new technique for verification by simulation of continuous and hybrid dynamical systems with uncertain initial conditions. We provide an algorithmic methodology that can, in most cases, verify that the system avoids a set of bad states by conducting a finite number of simulation runs starting from a finite subset of the set of possible initial conditions. The novelty of our approach consists in the use of sensitivity analysis, developed and implemented in the context of numerical integration, to efficiently characterize the coverage of sampling trajectories.", "num_citations": "200\n", "authors": ["1870"]}
{"title": "Efficient robust monitoring for STL\n", "abstract": " Monitoring transient behaviors of real-time systems plays an important role in model-based systems design. Signal Temporal Logic (STL) emerges as a convenient and powerful formalism for continuous and hybrid systems. This paper presents an efficient algorithm for computing the robustness degree in which a piecewise-continuous signal satisfies or violates an STL formula. The algorithm, by leveraging state-of-the-art streaming algorithms from Signal Processing, is linear in the size of the signal and its implementation in the Breach tool is shown to outperform alternative implementations.", "num_citations": "196\n", "authors": ["1870"]}
{"title": "Verification of analog and mixed-signal circuits using hybrid system techniques\n", "abstract": " In this paper we demonstrate a potential extension of formal verification methodology in order to deal with time-domain properties of analog and mixed-signal circuits whose dynamic behavior is described by differential algebraic equations. To model and analyze such circuits under all possible input signals and all values of parameters, we build upon two techniques developed in the context of hybrid (discrete-continuous) control systems. First, we extend our algorithm for approximating sets of reachable sets for dense-time continuous systems to deal with differential algebraic equations (DAEs) and apply it to a biquad low-pass filter. To analyze more complex circuits, we resort to bounded horizon verification. We use optimal control techniques to check whether a Δ-Σ modulator, modeled as a discrete-time hybrid automaton, admits an input sequence of bounded length that drives it to saturation.", "num_citations": "158\n", "authors": ["1870"]}
{"title": "Orthogonal polyhedra: Representation and computation\n", "abstract": " In this paper we investigate orthogonal polyhedra, i.e. polyhedra which are finite unions of full-dimensional hyper-rectangles. We define representation schemes for these polyhedra based on their vertices, and show that these compact representation schemes are canonical for all (convex and non-convex) polyhedra in any dimension. We then develop efficient algorithms for membership, face-detection and Boolean operations for these representations.", "num_citations": "146\n", "authors": ["1870"]}
{"title": "On the learnability of infinitary regular sets\n", "abstract": " In this paper we extend the automaton synthesis paradigm to infinitary languages, that is, to subsets of the set Σω of all infinite sequences over some alphabet Σ. Our main result is a polynomial algorithm for learning a sub-class of the ω-regular sets from membership queries and counter-examples based on the framework suggested by Angluin (Angluin, D. (1987), Inform. and Comput.75, 87-106) for learning regular subsets of Σ*.", "num_citations": "132\n", "authors": ["1870"]}
{"title": "Accurate hybridization of nonlinear systems\n", "abstract": " This paper is concerned with reachable set computation for non-linear systems using hybridization. The essence of hybridization is to approximate a non-linear vector field by a simpler (such as affine) vector field. This is done by partitioning the state space into small regions within each of which a simpler vector field is defined. This approach relies on the availability of methods for function approximation and for handling the resulting dynamical systems. Concerning function approximation using interpolation, the accuracy depends on the shapes and sizes of the regions which can compromise as well the speed of reachability computation since it may generate spurious classes of trajectories. In this paper we study the relationship between the region geometry and reachable set accuracy and propose a method for constructing hybridization regions using tighter interpolation error bounds. In addition, our construction …", "num_citations": "130\n", "authors": ["1870"]}
{"title": "Timing analysis of asynchronous circuits using timed automata\n", "abstract": " In this paper we present a method for modeling asynchronous digital circuits by timed automata. The constructed timed automata serve as “mechanical” and verifiable objects for asynchronous sequential machines in the same sense that (untimed) automata do for synchronous machines. These results, combined with recent results concerning the analysis and synthesis of timed automata provide for the systematic Treatment of a large class of problems that could be treated by conventional simulation methods only in an ad-hoc fashion. The problems that can be solved due to the results presented in this paper include: the reachability analysis of a circuit with uncertainties in gate delays and input arrival times, inferring the necessary timing constraints on input signals that guarantee a proper functioning of a circuit and calculating the delay characteristics of the components required in order to meet some given …", "num_citations": "125\n", "authors": ["1870"]}
{"title": "Preemptive job-shop scheduling using stopwatch automata\n", "abstract": " In this paper we show how the problem of job-shop scheduling where the jobs are preemptible can be modeled naturally as a shortest path problem defined on an extension of timed automata, namely stopwatch automata where some of the clocks might be freezed at certain states. Although general verification problems on stopwatch automata are known to be undecidable, we show that due to particular properties of optimal schedules, the shortest path in the automaton belongs to a finite subset of the set of acyclic paths and hence the problem is solvable. We present several algorithms and heuristics for finding the shortest paths in such automata and test their implementation on numerous benchmark examples.", "num_citations": "108\n", "authors": ["1870"]}
{"title": "Computer aided verification\n", "abstract": " This volume contains the proceedings of the 21st International Conference on Computer-Aided Verification (CAV) held in Grenoble, France, between June 28 and July 2, 2009. CAV is dedicated to the advancement of the theory and practice of computer-aided formal analysis methods for hardware and software systems. Its scope ranges from theoretical results to concrete applications, with an emphasis on practical verification tools and the underlying algorithms and techniques.Every instance of a conference is special in its own way. This CAV is special for at least two reasons: first, it took place in Grenoble, the place where the CAV series started 20 years ago. Secondly, there was a particularly large number of paper submissions: 135 regular papers and 34 tool papers, summing up to 169 submissions. They all went through an active review process, with each submission reviewed by four members of the Program …", "num_citations": "105\n", "authors": ["1870"]}
{"title": "Approximating the pareto front of multi-criteria optimization problems\n", "abstract": " We propose a general methodology for approximating the Pareto front of multi-criteria optimization problems. Our search-based methodology consists of submitting queries to a constraint solver. Hence, in addition to a set of solutions, we can guarantee bounds on the distance to the actual Pareto front and use this distance to guide the search. Our implementation, which computes and updates the distance efficiently, has been tested on numerous examples.", "num_citations": "104\n", "authors": ["1870"]}
{"title": "Computing reachable states for nonlinear biological models\n", "abstract": " In this paper we describe reachability computation for continuous and hybrid systems and its potential contribution to the process of building and debugging biological models. We then develop a novel algorithm for computing reachable states for nonlinear systems and report experimental results obtained using a prototype implementation. We believe these results constitute a promising contribution to the analysis of complex models of biological systems.", "num_citations": "101\n", "authors": ["1870"]}
{"title": "Fast and flexible difference constraint propagation for DPLL (T)\n", "abstract": " In the context of DPLL(T), theory propagation is the process of dynamically selecting consequences of a conjunction of constraints from a given set of candidate constraints. We present improvements to a fast theory propagation procedure for difference constraints of the form x – y ≤c. These improvements are demonstrated experimentally.", "num_citations": "82\n", "authors": ["1870"]}
{"title": "On syntactic congruences for ω-languages\n", "abstract": " In this paper we investigate several questions related to syntactic congruences and to minimal automata associated with ω-languages. In particular we investigate relationships between the so-called simple (because it is a simple translation from the usual definition in the case of finitary languages) syntactic congruence and its infinitary refinement (the iteration congruence) investigated by Arnold (Theoret. Comput. Sci. 39 (1985) 333–335). We show that in both cases not every ω-language having a finite syntactic monoid is regular and we give a characterization of those ω-languages having finite syntactic monoids.Among the main results we derive a condition which guarantees that the simple syntactic congruence and Arnold's syntactic congruence coincide and show that all (including infinitestate) ω-languages in the Borel class Fσ∩Gδ satisfy this condition. We also show that all ω-languages in this class are …", "num_citations": "76\n", "authors": ["1870"]}
{"title": "Achilles and the tortoise climbing up the arithmetical hierarchy\n", "abstract": " In this paper we show how to construct for every setPof integers in the arithmetical hierarchy a dynamical system H with piecewise-constant derivatives such that deciding membership inPcan be reduced to solving the reachability problem between two rational points for H. The ability of such apparently simple dynamical systems, whose definition involves onlyrationalparameters, to “solve” highly unsolvable problems is closely related to Zeno's paradox, namely the ability to pack infinitely many discrete steps in a bounded interval of time.", "num_citations": "74\n", "authors": ["1870"]}
{"title": "Robustness analysis and behavior discrimination in enzymatic reaction networks\n", "abstract": " Characterizing the behavior and robustness of enzymatic networks with numerous variables and unknown parameter values is a major challenge in biology, especially when some enzymes have counter-intuitive properties or switch-like behavior between activation and inhibition. In this paper, we propose new methodological and tool-supported contributions, based on the intuitive formalism of temporal logic, to express in a rigorous manner arbitrarily complex dynamical properties. Our multi-step analysis allows efficient sampling of the parameter space in order to define feasible regions in which the model exhibits imposed or experimentally observed behaviors. In a first step, an algorithmic methodology involving sensitivity analysis is conducted to determine bifurcation thresholds for a limited number of model parameters or initial conditions. In a second step, this boundary detection is supplemented by a global robustness analysis, based on quasi-Monte Carlo approach that takes into account all model parameters. We apply this method to a well-documented enzymatic reaction network describing collagen proteolysis by matrix metalloproteinase MMP2 and membrane type 1 metalloproteinase (MT1-MMP) in the presence of tissue inhibitor of metalloproteinase TIMP2. For this model, our method provides an extended analysis and quantification of network robustness toward paradoxical TIMP2 switching activity between activation or inhibition of MMP2 production. Further implication of our approach is illustrated by demonstrating and analyzing the possible existence of oscillatory behaviors when considering an extended open configuration of the …", "num_citations": "71\n", "authors": ["1870"]}
{"title": "Hybrid and Real-Time Systems: International Workshop, HART'97, Grenoble, France, March 26-28, 1997, Proceedings\n", "abstract": " This book constitutes the refereed proceedings of the International Workshop on Hybrid and Real-Time Systems, HART'97, held in Grenoble, France, in March 1997. The volume presents 18 revised full papers and 9 short presentations carefully selected during a highly competitive evaluation process; also included are full versions or abstracts of 7 invited papers or tutorials. Hybrid Systems consist of digital devices interacting with analog environments; thus the emerging area lies at the crossroads of computer science and control theory. This book focusses on mathematically sound methods for the rigorous and systematic design and analysis of hybrid systems and real-time systems.", "num_citations": "67\n", "authors": ["1870"]}
{"title": "Approximating continuous systems by timed automata\n", "abstract": " In this work we develop a new technique for over-approximating (in the sense of timed trace inclusion) continuous dynamical systems by timed automata. This technique refines commonly-used discrete abstractions which are often too coarse to be useful. The essence of our technique is the partition of the state space into cubes and the allocation of a clock for each dimension. This allows us to get much better approximations of the behavior. We specialize this technique to multi-affine systems, a class of nonlinear systems of primary importance for the analysis of biochemical systems and demonstrate its applicability on an example taken from synthetic biology.", "num_citations": "66\n", "authors": ["1870"]}
{"title": "Learning regular languages over large ordered alphabets\n", "abstract": " This work is concerned with regular languages defined over large alphabets, either infinite or just too large to be expressed enumeratively. We define a generic model where transitions are labeled by elements of a finite partition of the alphabet. We then extend Angluin's L* algorithm for learning regular languages from examples for such automata. We have implemented this algorithm and we demonstrate its behavior where the alphabet is a subset of the natural or real numbers. We sketch the extension of the algorithm to a class of languages over partially ordered alphabets.", "num_citations": "61\n", "authors": ["1870"]}
{"title": "Control from computer science\n", "abstract": " This paper presents some of the principles underlying verification and controller synthesis techniques for discrete dynamical systems developed within Computer Science along with some ideas to extend them to continuous and hybrid systems. Hopefully, this will provide control theorists and engineers with an additional perspective of their discipline as seen by a sympathetic outsider, uncommitted to the customs and traditions of the domain. Inter-cultural experience can be frustrating but sometimes fun.", "num_citations": "59\n", "authors": ["1870"]}
{"title": "Stochastic local search for falsification of hybrid systems\n", "abstract": " Falsification techniques for models of embedded control systems automate the process of testing models to find bugs by searching for model-inputs that violate behavioral specifications given by logical and quantitative correctness requirements. A recent advance in falsification is to encode property satisfaction as a cost function based on a finite parameterization of the (bounded-time) input signal, which allows formulating bug-finding as an optimization problem. In this paper, we present a falsification technique that uses a local search technique called Tabu search to search for optimal inputs. The key idea is to discretize the space of input signals and use the Tabu list to avoid revisiting previously encountered input signals. As local search techniques may converge to local optima, we introduce stochastic aspects such as random restarts, sampling and probabilistically picking suboptimal inputs to guide the …", "num_citations": "53\n", "authors": ["1870"]}
{"title": "Sensitive state-space exploration\n", "abstract": " In this paper, we describe a simulation-based approach to the verification of high dimensional nonlinear systems subject to disturbances and uncertainty in the initial conditions. Standard simulation can only sample finitely many initial states and disturbance signals and cannot verify correctness in an exhaustive manner. The alternative approach of computing all the reachable states of the system using set-based simulation, can provide, in principle, correctness proofs but is computationally expensive especially for high dimensional and nonlinear systems. In this paper we propose an approach that provides a good compromise between set-based computation and simulation by combining guided random exploration of the state space together with sensitivity analysis. The exploration technique is used to choose input signals that guarantee good coverage of the reachable set, while sensitivity information is used to …", "num_citations": "51\n", "authors": ["1870"]}
{"title": "Computing reachable sets: An introduction\n", "abstract": " This paper provides a tutorial introduction to reachability computation, a new class of computational techniques developed in order to export verification technology toward continuous and hybrid systems.", "num_citations": "38\n", "authors": ["1870"]}
{"title": "Some progress in satisfiability checking for difference logic\n", "abstract": " In this paper we report a new SAT solver for difference logic, a propositional logic enriched with timing constraints. The main novelty of our solver is a tighter integration of the incremental analysis of numerical conflicts with the process of Boolean conflict analysis. This and other improvements lead to significant performance gains for some classes of problems.", "num_citations": "38\n", "authors": ["1870"]}
{"title": "Many-core scheduling of data parallel applications using SMT solvers\n", "abstract": " To program recently developed many-core systems-on-chip two traditionally separate performance optimization problems have to be solved together. Firstly, it is the parallel scheduling on a shared-memory multi-core system. Secondly, it is the co-scheduling of network communication and processor computation. This is because many-core systems are networks of multi-core clusters. In this paper, we demonstrate the applicability of modern constraint solvers to efficiently schedule parallel applications on many-cores and validate the results by running benchmarks on a real many-core platform.", "num_citations": "35\n", "authors": ["1870"]}
{"title": "Multi-criteria optimization for mapping programs to multi-processors\n", "abstract": " Finding tradeoffs in design space is naturally formulated as a multicriteria optimization problem. In this paper, we model tradeoffs between communication cost and the balance of processor workloads for the problem of mapping applications to processors in a multicore environment. We formulate several query strategies for finding Pareto optimal and approximately Pareto optimal solutions to the mapping problem using a constraint solver as a time-bounded oracle. Each of the strategies directs the oracle through the search space in a different manner. We evaluate the efficiency of these strategies on a series of synthetic benchmarks, and on two industrial applications, a video noise reduction, and an image demosaic color filtering. The results indicate a significant tradeoff between precision and computation time, and a corresponding benefit to time-bounded queries.", "num_citations": "35\n", "authors": ["1870"]}
{"title": "Optimizing explicit data transfers for data parallel applications on the cell architecture\n", "abstract": " In this paper we investigate a general approach to automate some deployment decisions for a certain class of applications on multi-core computers. We consider data-parallelizable programs that use the well-known double buffering technique to bring the data from the off-chip slow memory to the local memory of the cores via a DMA (direct memory access) mechanism. Based on the computation time and size of elementary data items as well as DMA characteristics, we derive optimal and near optimal values for the number of blocks that should be clustered in a single DMA command. We then extend the results to the case where a computation for one data item needs some data in its neighborhood. In this setting we characterize the performance of several alternative mechanisms for data sharing. Our models are validated experimentally using a cycle-accurate simulator of the Cell Broadband Engine architecture.", "num_citations": "32\n", "authors": ["1870"]}
{"title": "From control loops to real-time programs\n", "abstract": " This article discusses what we consider one of the central aspects of embedded systems: the realization of control systems by software. Although computers are today the most popular medium for implementing controllers, we feel that the state of understanding of this topic is not satisfactory, mostly due to the fact that it is situated in the frontier between two different cultures and world views (control and informatics) which are not easy to reconcile. The purpose of this article is to clarify these issues and present them in a uniform and, hopefully, coherent manner.               The article is organized as follows. We start with a short high-level discussion of the two phenomena involved, control and computation. In Section 2 we explain the basic issues related to the realization of controllers by software using a simple proportional-integral-derivative (PID) controller as an example. In Section 3 we move to more complex multi …", "num_citations": "31\n", "authors": ["1870"]}
{"title": "On recognizable timed languages\n", "abstract": " In this work we generalize the fundamental notion of recognizability from untimed to timed languages. The essence of our definition is the existence of a right-morphism from the monoid of timed words into a bounded subset of itself. We show that the recognizable languages are exactly those accepted by deterministic timed automata and argue that this is, perhaps, the right class of timed languages, and that the closure of untimed regular languages under projection is a positive accident that cannot be expected to hold beyond the finite-state case.", "num_citations": "31\n", "authors": ["1870"]}
{"title": "Tight bounds on the complexity of cascaded decomposition of automata\n", "abstract": " Exponential upper and lower bounds on the size of the cascaded (Krohn-Rhodes) decomposition of automata are given. These results are used to obtain elementary algorithms for various translations between automata and temporal logic, where the previously known translations were nonelementary. The relevance of the result is discussed.< >", "num_citations": "31\n", "authors": ["1870"]}
{"title": "Reachability analysis of pushdown automata\n", "abstract": " Systems are commonly modeled by various types of transition systems, including nite automata, pushdown automata, Petri nets, timed or hybrid automata, etc. In this framework, most of the system analysis problems (model-checking, synthesis) reduce to (various kinds of)\\reachability problems\" on these models. Thus, a fundamental ingredient for system analysis algorithms is calculating the set of all predecessors of a given set of states, say S, ie, calculating the set of states from which it is possible to reach S. This set is the smallest solution of the equation X= S pre (X) where pre is the function which gives, for any set of states, the set of its immediate predecessors. In other words, the set of predecessors of a set S is its image by the re exive-transitive closure of the function pre, denoted by pre. By de nition, pre (S) is the limit of the in nite increasing sequence fXigi 0 such that X0= S and Xi+ 1= Xi pre (Xi) for every i 0. Then, the problem is how to calculate e ectively pre (S) and obtain a nite representation of this set. For nite-state systems this can be done by straightforward graph algorithms. In the case of in nite-state systems, the main problem to address is, given a class of systems, nd a class of structures having the following properties:", "num_citations": "30\n", "authors": ["1870"]}
{"title": "STL-based analysis of TRAIL-induced apoptosis challenges the notion of type I/type II cell line classification\n", "abstract": " Extrinsic apoptosis is a programmed cell death triggered by external ligands, such as the TNF-related apoptosis inducing ligand (TRAIL). Depending on the cell line, the specific molecular mechanisms leading to cell death may significantly differ. Precise characterization of these differences is crucial for understanding and exploiting extrinsic apoptosis. Cells show distinct behaviors on several aspects of apoptosis, including (i) the relative order of caspases activation, (ii) the necessity of mitochondria outer membrane permeabilization (MOMP) for effector caspase activation, and (iii) the survival of cell lines overexpressing Bcl2. These differences are attributed to the activation of one of two pathways, leading to classification of cell lines into two groups: type I and type II. In this work we challenge this type I/type II cell line classification. We encode the three aforementioned distinguishing behaviors in a formal language, called signal temporal logic (STL), and use it to extensively test the validity of a previously-proposed model of TRAIL-induced apoptosis with respect to experimental observations made on different cell lines. After having solved a few inconsistencies using STL-guided parameter search, we show that these three criteria do not define consistent cell line classifications in type I or type II, and suggest mutants that are predicted to exhibit ambivalent behaviors. In particular, this finding sheds light on the role of a feedback loop between caspases, and reconciliates two apparently-conflicting views regarding the importance of either upstream or downstream processes for cell-type determination. More generally, our work suggests that these three …", "num_citations": "28\n", "authors": ["1870"]}
{"title": "Using redundant constraints for refinement\n", "abstract": " This paper is concerned with a method for computing reachable sets of linear continuous systems with uncertain input. Such a method is required for verification of hybrid systems and more generally embedded systems with mixed continuous-discrete dynamics. In general, the reachable sets of such systems (except for some linear systems with special eigenstructures) are hard to compute exactly and are thus often over-approximated. The approximation accuracy is important especially when the computed over-approximations do not allow proving a property. In this paper we address the problem of refining the reachable set approximation by adding redundant constraints which allow bounding the reachable sets in some critical directions. We introduce the notion of directional distance which is appropriate for measuring approximation effectiveness with respect to verifying a safety property. We also …", "num_citations": "28\n", "authors": ["1870"]}
{"title": "On timed models of gene networks\n", "abstract": " We present a systematic translation from timed models of genetic regulatory networks into products of timed automata to which one can apply verification tools in order learn about the possible qualitative behaviors of the network under a whole range of uncertain delay parameters. We have developed a tool chain starting from a high-level description of the network down to an exhaustive analysis of its behavior. We have demonstrated the potential applicability of this framework on several examples.", "num_citations": "28\n", "authors": ["1870"]}
{"title": "Bio-Inspired Systems: Computational and Ambient Intelligence: 10th International Work-Conference on Artificial Neural Networks, IWANN 2009, Salamanca, Spain, June 10-12, 2009 …\n", "abstract": " This volume presents the set of final accepted papers for the tenth edition of the IWANN conference “International Work-Conference on Artificial neural Networks” held in Salamanca (Spain) during June 10–12, 2009. IWANN is a biennial conference focusing on the foundations, theory, models and applications of systems inspired by nature (mainly, neural networks, evolutionary and soft-computing systems). Since the first edition in Granada (LNCS 540, 1991), the conference has evolved and matured. The list of topics in the successive Call for-pers has also evolved, resulting in the following list for the present edition: 1. Mathematical and theoretical methods in computational intelligence. C-plex and social systems. Evolutionary and genetic algorithms. Fuzzy logic. Mathematics for neural networks. RBF structures. Self-organizing networks and methods. Support vector machines. 2. Neurocomputational formulations. Single-neuron modelling. Perceptual m-elling. System-level neural modelling. Spiking neurons. Models of biological learning. 3. Learning and adaptation. Adaptive systems. Imitation learning. Reconfig-able systems. Supervised, non-supervised, reinforcement and statistical al-rithms. 4. Emulation of cognitive functions. Decision making. Multi-agent systems. S-sor mesh. Natural language. Pattern recognition. Perceptual and motor functions (visual, auditory, tactile, virtual reality, etc.). Robotics. Planning motor control. 5. Bio-inspired systems and neuro-engineering. Embedded intelligent systems. Evolvable computing. Evolving hardware. Microelectronics for neural, fuzzy and bio-inspired systems. Neural prostheses. Retinomorphic …", "num_citations": "26\n", "authors": ["1870"]}
{"title": "On optimal and reasonable control in the presence of adversaries\n", "abstract": " This paper constitutes a sketch of a unified framework for posing and solving problems of optimal control in the presence of uncontrolled disturbances. After laying down the general framework we look closely at a concrete instance where the controller is a scheduler and the disturbances are related to uncertainties in task durations.", "num_citations": "26\n", "authors": ["1870"]}
{"title": "A unified approach for studying discrete and continuous dynamical systems\n", "abstract": " The goal of the paper is to present discrete transition systems and continuous dynamical systems in a uniform manner, stressing the fundamental differences as well as the commonalities between these two fundamental models. Such a framework seems to be a pre-requisite to any theory and methodology for hybrid systems. For both types of systems we introduce three models (a closed system, a system with one type of input, and a system with two types of input) such that the problems associated with them correspond respectively to the tasks of simulation, verification and control synthesis. We discuss some of the computational problems associated with building control CAD tools that out carry these tasks.", "num_citations": "23\n", "authors": ["1870"]}
{"title": "Symmetry breaking for multi-criteria mapping and scheduling on multicores\n", "abstract": " Multiprocessor mapping and scheduling is a long-old difficult problem. In this work we propose a new methodology to perform mapping and scheduling along with buffer memory optimization using an SMT solver. We target split-join graphs, a formalism inspired by synchronous data-flow (SDF) which provides a compact symbolic representation of data-parallelism. Unlike the traditional design flow for SDF which involves splitting of a big problem into smaller heuristic sub-problems, we deal with this problem as a whole and try to compute exact Pareto-optimal solutions for it. We introduce symmetry breaking constraints in order to reduce the run-times of the solver. We have tested our work on a number of SDF graphs and demonstrated the practicality of our method. We validate our models by running an image decoding application on the Tilera multicore platform.", "num_citations": "22\n", "authors": ["1870"]}
{"title": "Efficient parametric identification for STL\n", "abstract": " We describe a new algorithm for the parametric identification problem for signal temporal logic (STL), stated as follows. Given a dense-time real-valued signal w and a parameterized temporal logic formula φ, compute the subset of the parameter space that renders the formula satisfied by the signal. Unlike previous solutions, which were based on search in the parameter space or quantifier elimination, our procedure works recursively on φ and computes the evolution over time of the set of valid parameter assignments. This procedure is similar to that of monitoring or computing the robustness of φ relative to w. Our implementation and experiments demonstrate that this approach can work well in practice.", "num_citations": "20\n", "authors": ["1870"]}
{"title": "Optimizing two-dimensional DMA transfers for scratchpad Based MPSoCs platforms\n", "abstract": " Reducing the effects of off-chip memory access latency is a key factor in exploiting efficiently embedded multi-core platforms. We consider architectures that admit a multi-core computation fabric, having its own fast and small memory to which the data blocks to be processed are fetched from external memory using a DMA (direct memory access) engine, employing a double- or multiple-buffering scheme to avoid processor idling. In this paper we focus on application programs that process two-dimensional data arrays and we determine automatically the size and shape of the portions of the data array which are subject to a single DMA call, based on hardware and applications parameters. When the computation on different array elements are completely independent, the asymmetry of memory structure leads always to prefer one-dimensional horizontal pieces of memory, while when the computation of a data element …", "num_citations": "19\n", "authors": ["1870"]}
{"title": "Computer Aided Verification\n", "abstract": " Computer Aided Verification - NASA/ADS Now on home page ads icon ads Enable full ADS view NASA/ADS Computer Aided Verification Bouajjani, Ahmed ; Maler, Oded Abstract Publication: Lecture Notes in Computer Science Pub Date: 2009 DOI: 10.1007/978-3-642-02658-4 Bibcode: 2009LNCS......B Keywords: Computer Science; Logics and Meanings of Programs; Software Engineering; Mathematical Logic and Formal Languages; Artificial Intelligence (incl. Robotics); Logic Design full text sources Publisher | © The SAO/NASA Astrophysics Data System adshelp[at]cfa.harvard.edu The ADS is operated by the Smithsonian Astrophysical Observatory under NASA Cooperative Agreement NNX16AC86A NASA logo Smithsonian logo Resources About ADS ADS Help What's New Careers@ADS Social @adsabs ADS Blog Project Switch to full ADS Is ADS down? (or is it just me...) Smithsonian Institution Smithsonian …", "num_citations": "19\n", "authors": ["1870"]}
{"title": "On the representation of timed polyhedra\n", "abstract": " In this paper we investigate timed polyhedra, i.e. polyhedra which are finite unions of full dimensional simplices of a special kind. Such polyhedra form the basis of timing analysis and in particular of verification tools based on timed automata. We define a representation scheme for these polyhedra based on their extreme vertices, and show that this compact representation scheme is canonical for all (convex and non-convex) polyhedra in any dimension. We then develop relatively efficient algorithms for membership, boolean operations, projection and passage of time for this representation.", "num_citations": "19\n", "authors": ["1870"]}
{"title": "Hybrid systems and real-world computations\n", "abstract": " In a preface to a book on computational geometry, JT Schwartz Sc87] wrote: Till now, computer science has been largely combinatorial and symbolic having the manipulation of patterns and tables of data as its principal content. In robotics, however, computer science makes contact with real-world geometric and physical phenomena such as compliance of elastic bodies, the frictional phenomena that occur when two bodies come in contact, errors in modeling which are inevitable in the real world, the sudden changes of state which occur when two bodies collide unexpectedly, and so forth. It is to be expected that much interesting new computer science will emerge from contact with these rich conceptual domains and, in particular, that computer science will become more traditionally mathematical and\\continuous\". The theory of hybrid systems (HS), can be considered as an important step toward the realization of this vision. By a hybrid system I mean a system which is a product of the interaction between a discrete state-transition system (an automaton, a program) and a continuous di erential dynamical system. In this informal talk I will try to explain what this theory is about and in what aspects it di ers from other computational theories. In order to do so I will first (section 2) point out explicitly the underlying assumptions of traditional computability theory concerning the phenomena it is supposed to model. In section 3 I will show how these assumptions are not valid in what I call\\real-life\" computations, where the computer is embedded in the physical world. In section 4 I will show how reactive and real-time systems can be considered as preliminary …", "num_citations": "19\n", "authors": ["1870"]}
{"title": "Algorithmic Verification of Continuous and Hybrid Systems\n", "abstract": " We provide a tutorial introduction to reachability computation, a class of computational techniques that exports verification technology toward continuous and hybrid systems. For open under-determined systems, this technique can sometimes replace an infinite number of simulations.", "num_citations": "18\n", "authors": ["1870"]}
{"title": "Some thoughts on runtime verification\n", "abstract": " Some reflections on verification and runtime verification in general and of cyber-physical systems in particular.", "num_citations": "17\n", "authors": ["1870"]}
{"title": "A decomposition theorem for probabilistic transition systems\n", "abstract": " In this note we prove that every finite Markov chain can be decomposed into a cascade product of a Bernoulli process and several simple permutation-reset deterministic automata. The original chain is a state-homomorphic image of the product. By doing so we give a positive answer to an open question stated in (Paz, 1971) concerning the decomposability of probabilistic systems. Our result is based on the observation that in probabilistic transition systems, “randomness” and “memory” can be separated so as to allow the non-random part to be treated using common deterministic automata-theoretic techniques. The same separation technique can be applied to other kinds of non-determinism as well.", "num_citations": "17\n", "authors": ["1870"]}
{"title": "On the krohn-rhodes cascaded decomposition theorem\n", "abstract": " The Krohn-Rhodes theorem states that any deterministic automaton is a homomorphic image of a cascade of very simple automata which realize either resets or permutations. Moreover, if the automaton is counter-free, only reset automata are needed. In this paper we give a very constructive proof of a variant of this theorem due to Eilenberg.", "num_citations": "15\n", "authors": ["1870"]}
{"title": "Meeting deadlines cheaply\n", "abstract": " We develop a computational framework for solving the problem of finding the cheapest configuration (in terms of the number of processors and their respective speeds) of a multiprocessor architecture on which a task graph can be scheduled within a given deadline. We then extend the problem in three orthogonal directions: taking communication volume into account, considering the case where a stream of instances of the task graph arrives periodically and reformulating the problem as a bi-criteria optimization for which we approximate the Pareto front.", "num_citations": "14\n", "authors": ["1870"]}
{"title": "On the Cascaded Decomposition of Automata, its Complexity and its Application to Logic, unpublished manuscript available at http://www-verimag. imag. fr/PEOPLE/maler/uabst. html\n", "abstract": " The primary decomposition theorem due to Krohn and Rhodes ([KR65]), which has been considered as one of the fundamental results in the theory of automata and semigroups, states that every automaton is homomorphic to a cascaded decomposition (wreath-product) of simpler automata of two kinds: reset automata and permutation automata. If the automaton is non-counting (and correspondingly its transformation semigroup is group-free) then it can be decomposed using only reset components. There exist various proofs and partial proofs for the primary decomposition", "num_citations": "14\n", "authors": ["1870"]}
{"title": "A generic algorithm for learning symbolic automata from membership queries\n", "abstract": " We present a generic algorithmic scheme for learning languages defined over large or infinite alphabets such as bounded subsets of  and , or Boolean vectors of high dimension. These languages are accepted by deterministic symbolic automata that use predicates to label transitions, forming a finite partition of the alphabet for every state. Our learning algorithm, an adaptation of Angluin’s , combines standard automaton learning by state characterization, with the learning of the static predicates that define the alphabet partitions. We do not assume a helpful teacher who provides minimal counter-examples when the conjectured automaton is incorrect. Instead we use random sampling to obtain PAC (probably approximately correct) learnability. We have implemented the algorithm for numerical and Boolean alphabets and the preliminary performance results show that languages over large or infinite …", "num_citations": "13\n", "authors": ["1870"]}
{"title": "Strictly periodic scheduling of acyclic synchronous dataflow graphs using SMT solvers\n", "abstract": " We consider compile-time multi-core mapping and scheduling problem for synchronous dataflow (SDF) graphs, proved an important model of computation for streaming applications, such as signal/image processing and video/image coding. In general the real-time constraints for these applications include both the task periods/throughput and the deadlines/latency. The deadlines are typically larger than the periods, which enables pipelined scheduling, allowing concurrent execution of different iterations of an application. A majority of algorithms for scheduling SDF graphs on a limited number of processors do not consider both latency and period real-time constraints at the same time. For this problem, we propose an efficient method based on SMT (satisfiability modulo theory) solvers. We restrict ourselves to strictly periodic scheduling and acyclic graphs, giving up some efficiency for the sake of simplicity. We also upgrade and integrate two alternative methods–unfolding and modulo scheduling–into our scheduling framework. Experiments for different methods are performed for a set of application benchmarks and advantages of the proposed method is demonstrated empirically.", "num_citations": "13\n", "authors": ["1870"]}
{"title": "On hybrid control of under-actuated mechanical systems\n", "abstract": " In this work we present a novel control design methodology for under-actuated mechanical systems. As part of the design process we use the reachability analysis tool d/dt [ABDM99,D00] to see whether there is a switching sequence which can drive the system to a desired periodic orbit. Much of the work in the design of the control law is done manually using classical control techniques (unlike the fully-automatic approach advocated in [ABD+00]), and d/dt is used to complement these techniques. We hope this work will contribute to the proliferation of reachability-based techniques to the control engineer’s tool box.", "num_citations": "13\n", "authors": ["1870"]}
{"title": "On the programming of industrial computers\n", "abstract": " This report, which is part of the deliverable IP. 1 of the Esprit project VHS (Veri cation of Hybrid Systems), analyzes some software engineering aspects of industrial computers such as PLCs (programmable logic controllers) and DCS (distributed control systems). The report starts with a comparison between the development of software engineering for general-purpose computers and the programming of control computers. Then it critically surveys the ve programming languages de ned by the IEC 1131-3 standard which is intended to unify PLC programming languages. Finally several potential contributions of the consortium toward improving the state-of-the-art in this domain are suggested.", "num_citations": "12\n", "authors": ["1870"]}
{"title": "On the effects of noise and speed on computations\n", "abstract": " In this paper we propose a model that captures the influence of noise and speed on the correct behavior of a computing device situated in a dynamic environment. Within this model we analyze the relation between structural properties of automata and their immunity to noise. We prove upper and lower bounds on the effect of noise for various classes of finite automata. In addition, we show similar relationships between relative speeds of the automaton and the environment and the accuracy of computation. Our model, combining basic notions from algebraic automata theory and the theory of stochastic processes, can serve as a starting point for a rigorous theory of computational systems embedded in the real world.", "num_citations": "11\n", "authors": ["1870"]}
{"title": "Reachability analysis of a switched buffer network\n", "abstract": " Many situation in various application domains can be formalized as switched buffer networks, that is, networks of containers in which quantities of some substances are stored and transported at various rates to other buffers. A mode of such a system is defined by the channels that are active at a given time, which determine the rates of change in the quantities of the substances in all the buffers. Switching occurs while opening or closing channels, starting or stopping a reaction, thus causing the system to move from one mode to another. Hybrid automata provide a natural modeling formalism for such systems, a model on which one can verify properties (lack of overflow or deadlock, arrival of products to certain buffers at pre-specified times and quantities) and even automatically synthesize switching controllers that achieve such goals in an efficient manner. Such verification and synthesis techniques can …", "num_citations": "10\n", "authors": ["1870"]}
{"title": "Amir Pnueli and the dawn of hybrid systems\n", "abstract": " In this talk I present my own perspective on the beginning (I refer mostly to the period 1988-1998) of hybrid systems research at the computer science side, focusing on the contributions of the late Amir Pnueli, mildly annotated with some opinions of mine.", "num_citations": "9\n", "authors": ["1870"]}
{"title": "A new approach for introducing Prolog to naive users\n", "abstract": " Most Prolog textbooks are based on gradual presentation of Prolog's concepts, as well as some concepts from logic. We think that this order of presentation used in most books is inadequate for readers with little prior experience with logic, mathematics or programming. In this paper we introduce a new approach for teaching Prolog to these “naive” users. Within our framework, the order of concept introduction is based upon the order used in teaching logic: from propositions to predicates. We believe that this approach will ease the difficulties encountered by newcomers to Prolog, and will provide a good basis for better understanding of logic, programming, data-base theory, and perhaps also other relevant disciplines.             The choice of Prolog as a first programming language is also discussed, and we argue that it is a better choice than conventional languages in the same sense that those languages are …", "num_citations": "8\n", "authors": ["1870"]}
{"title": "On under-determined dynamical systems\n", "abstract": " Under-determined dynamical systems are those that need additional information in order to produce simulation traces. This information may correspond to initial conditions, parameter values or dynamic external influences. The paper discusses this issue and surveys some common approaches to reconcile this fact with the practice of simulation.", "num_citations": "7\n", "authors": ["1870"]}
{"title": "On scheduling policies for streams of structured jobs\n", "abstract": " We study a class of scheduling problems which combines the structural aspects associated with task dependencies, with the dynamic aspects associated with ongoing streams of requests that arrive during execution. For this class of problems we develop a scheduling policy which can guarantee bounded accumulation of backlog for all admissible request streams. We show, nevertheless, that no such policy can guarantee bounded latency for all admissible request patterns, unless they admit some laxity.", "num_citations": "7\n", "authors": ["1870"]}
{"title": "Satisfiability modulo theory chains with DPLL (T)\n", "abstract": " We extend the DPLL (T) framework for satisfiability modulo theories to address richer theories by means of increased flexibility in the interaction between the propositional and theoryspecific solvers. We decompose a rich theory into a chain of increasingly more complex subtheories, and define a corresponding propagation strategy which favors the simpler subtheories using two mechanisms. First, subtheory propagation is prioritized so that more expensive propagation is avoided whenever possible. Second, constraints are filtered along the path from simpler to more complex propagation, thus easing the task of propagation for each subtheory. We present this strategy formally in a refined abstract DPLL (T) system and provide a concrete algorithmic skeleton with a proof of correctness.", "num_citations": "6\n", "authors": ["1870"]}
{"title": "The Unmet Challenge of Timed Systems\n", "abstract": " Timed systems constitute a class of dynamical systems that live in an extremely useful level of abstraction. The paper stresses their importance in modeling without necessarily endorsing the orthodox approach for reasoning about them which is practiced in the theoretical and applied branches of formal verification.", "num_citations": "5\n", "authors": ["1870"]}
{"title": "Hybrid Systems: Computation and Control\n", "abstract": " Hybrid Systems | Guide books ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleBooksHybrid Systems: Computation and Control ABSTRACT No abstract available. Comments Login options Check if you have access through your login credentials or your institution to get full access on this article. Sign in Full Access Get this Publication Information Contributors Published in Guide books cover image Hybrid Systems: Computation and Control May 2003 558 pages ISBN:3540009132 Authors: Freek Wiedijk, Amir Pnueli, Oded Maler Copyright © 2003 Publisher Springer-Verlag Berlin, Heidelberg Publication History Published: 1 May 2003 …", "num_citations": "5\n", "authors": ["1870"]}
{"title": "Guest Editorial: Verification of Hybrid Systems.\n", "abstract": " This special issue of The European Journal of Control is dedicated to some of the results of the European Community Esprit-LTR Project 26270 VHS (Veri cation of Hybrid Systems). It consists of 5 papers dealing with various aspects of one of the case studies treated in the project, the Experimental Batch Plant at the university of Dortmund. Before presenting the papers themselves, it is worthwhile to say something about hybrid systems in general and the VHS project in particular.", "num_citations": "5\n", "authors": ["1870"]}
{"title": "Set-based analysis for biological modeling\n", "abstract": " The understanding of biological systems and processes requires the development of dynamical models characterized by nonlinear laws and often intricate regulation architectures. Differential and difference equations are common formalisms to characterize such systems. Hybrid dynamical systems come in handy when the modeled system combines continuous and discrete evolutions or different evolution modes such as where slow evolution phases are interrupted by fast ones. Biological data with kinetic content are often scarce, thus it can be appropriate to reason in terms of sets of (parametrized) models and sets of trajectories. In doing so, uncertainties and lack of knowledge are explicitly taken into account and more reliable predictions can be made. A crucial problem in Systems Biology is thus to identify regions of parameter space for which model behavior is consistent with experimental observations …", "num_citations": "4\n", "authors": ["1870"]}
{"title": "Learning monotone partitions of partially-ordered domains (work in progress)\n", "abstract": " We present an algorithm for learning the boundary between an upward-closed set X and its downward-closed complement. The algorithm selects sampling points for which it submits membership queries x ∈ X. Based on the answers and relying on monotonicity, it constructs an approximation of the boundary. The algorithm generalizes binary search on the continuum from one-dimensional (and linearly-ordered) domains to multi-dimensional (and partially-ordered) ones. Applications include the approximation of Pareto fronts in multi-criteria optimization and parameter synthesis for predicates where the influence of parameters is monotone.", "num_citations": "4\n", "authors": ["1870"]}
{"title": "Reducing power with activity trigger analysis\n", "abstract": " In this paper we propose and implement a methodology for power reduction in digital circuits, closing the gap between conceptual (by designer) and local (by EDA) clock gating. We introduce a new class of coarse grained local clock gating conditions and develop a method for detecting such conditions and formally proving their correctness. The detection of these conditions relies on architecture characterization and statistical analysis of simulation, all done at the RTL. Formal verification is performed on an abstract circuit model. We demonstrate a significant power reduction from 33 to 40% of total power on a clusterized circuit design for video processing.", "num_citations": "4\n", "authors": ["1870"]}
{"title": "A runtime environment for real-time streaming applications on clustered multi-cores\n", "abstract": " Dataflow graphs with static rates, such as synchronous and cyclo-static dataflow models, can be used for multi-core programming of so-called streaming applications, which include a wide range of signal processing and coding. Given soft and firm realtime constraints on throughput, buffer size, and latency, many scheduling optimizers have been proposed for mapping dataflow models on multi-cores. However, not many of them are equipped with runtime environments that can deploy and execute the optimized schedule on the target platform. Among the publicly available runtimes, one can hardly find any that inherently support clustered multi-cores. Those are on-chip multiprocessors that consist of ‘clusters’, ie groups of multiple processors that share a local memory with each other and communicate via a global networkon-chip. This is an important possibility to ensure scalability in the number of cores, making it possible to provide a large (more than) number of processors on a single chip. Along with our ‘StreamExplorer’open-source scheduling optimizer for static dataflow models we propose a runtime environment that deploys optimized scheduling solutions on a clustered multi-core platform.", "num_citations": "4\n", "authors": ["1870"]}
{"title": "Exploring synthetic mass action models\n", "abstract": " In this work we propose a model that can be used to study the dynamics of mass action systems, systems consisting of a large number of individuals whose behavior is influenced by other individuals that they encounter. Our approach is rather synthetic and abstract, viewing each individual as a probabilistic automaton that can be in one of finitely many discrete states. We demonstrate the type of investigations that can be carried out on such a model using the Populus toolkit. In particular, we illustrate how sensitivity to initial spatial distribution can be observed in simulation.", "num_citations": "4\n", "authors": ["1870"]}
{"title": "Computer Aided Verification: 21st International Conference, CAV 2009, Grenoble, France, June 26-July 2, 2009, Proceedings\n", "abstract": " This volume contains the proceedings of the 21st International Conference on Computer-Aided Veri? cation (CAV) held in Grenoble, France, between June 28 and July 2, 2009. CAV is dedicated to the advancement of the theory and practice of computer-aided formal analysis methods for hardware and software systems. Its scope ranges from theoretical results to concrete applications, with an emphasis on practical veri? cation tools and the underlying algorithms and techniques. Everyinstanceofaconferenceisspecialinitsownway. ThisCAVisspecialfor at least two reasons:? rst, it took place in Grenoble, the place where the CAV series started 20 years ago. Secondly, there was a particularly large number of paper submissions: 135 regular papers and 34 tool papers, summing up to 169 submissions. They all went through an active review process, with each submissionreviewedbyfourmembersoftheProgramCommittee. Wealsosought external reviews from experts in certain areas. Authors had the opportunity to respond to the initial reviews during an author response period. All these inputs wereusedbytheProgramCommitteeinselectinga? nalprogramwith36 regular papers and 16 tool papers. In addition to the presentation of these papers, the program included the following:–Four invited tutorials:• Rachid Guerraoui (EPFL Lausanne, Switzerland): Transactional M-ory: Glimmer of a Theory.• Jaeha Kim (Stanford, USA): Mixed-Signal System Veri? cation: A High-Speed Link Example.• Jean Krivine (Institut des Hautes Etudes Scienti? ques, France): M-elling Epigenetic Information Maintenance: A Kappa Tutorial.• JosephSifakis (CNRS-VERIMAG, France …", "num_citations": "4\n", "authors": ["1870"]}
{"title": "ParetoLib: a python library for parameter synthesis\n", "abstract": " This paper presents ParetoLib, a Python library that implements a new method for inferring the Pareto front in multi-criteria optimization problems. The tool can be applied in the parameter synthesis of temporal logic predicates where the influence of parameters is monotone. ParetoLib currently provides support for the parameter synthesis of standard (STL) and extended (STLe) Signal Temporal Logic specifications. The tool is easily upgradeable for synthesizing parameters in other temporal logics in the near future. An example illustrates the usage and performance of our tool. ParetoLib is free and publicly available on Internet.", "num_citations": "3\n", "authors": ["1870"]}
{"title": "Double archive Pareto local search\n", "abstract": " Many real-world problems have multiple, conflicting objectives and a large complex solution space. The conflicting objectives give rise to a set of non-dominating solutions, known as the Pareto front. In the absence of any prior information on the relative importance of the objectives, none of these solutions can be said to be better than others, and they should all be presented to the decision maker as alternatives. In most cases, the number of Pareto solutions can be huge and we would like to provide a good representative approximation of the Pareto front. Moreover, the search space can be too large and complex for the problem to be solved by exact methods. Therefore efficient heuristic search algorithms are needed that can handle such problems. In this paper, we propose a double archive based Pareto local search. The two archives of our algorithm are used to maintain (i) the current set of non-dominated …", "num_citations": "3\n", "authors": ["1870"]}
{"title": "On Switching Aware Synthesis for Combinational Circuits\n", "abstract": " We propose a synthesis algorithm for combinational circuits which optimizes the expected number of gate switchings induced by typical sequences of input vectors. Our algorithm, which is based on simple observations concerning AND gates, performs quite well on sequences produced by the same probabilistic models used to generate the training sequences.", "num_citations": "3\n", "authors": ["1870"]}
{"title": "Pipelined Scheduling of Acyclic SDF Graphs using SMT Solvers\n", "abstract": " We consider compile-time multi-core mapping and scheduling problem for synchronous dataflow (SDF) graphs, proved an important model of computation for streaming applications, such as signal/image processing and video/image coding. In general the real-time constraints for these applications include both the task periods/throughput and the deadlines/latency. The deadlines are typically larger than the periods, which enables pipelined scheduling, allowing concurrent execution of different iterations of an application. A majority of algorithms for scheduling SDF graphs on a limited number of processors do not consider both latency and period real-time constraints at the same time. For this problem, we propose an efficient method based on SMT (satisfiability modulo theory) solvers. We restrict ourselves to periodic scheduling and acyclic graphs, giving up some efficiency for the sake of simplicity. We present an approach to encode the pipelined scheduling problem and demonstrate its practicality on Kalray MPPA-256 multi-core platform by executing various benchmarks according to the optimal schedules.", "num_citations": "3\n", "authors": ["1870"]}
{"title": "Cellular iron regulation in animals: need and use of suitable models\n", "abstract": " As with virtually all biologically essential transition metals, but probably in a more acute way than most, iron excess and deficiency underlie a range of pathological conditions in animals. Accordingly, regulatory systems maintain the proper iron amount to fulfill the needs of the whole body and of each individual cell, while avoiding deleterious effects. The latter may be due to lack of iron availability, eg at the active site of iron enzymes, or to", "num_citations": "3\n", "authors": ["1870"]}
{"title": "Analog circuit verification: a state of an art\n", "abstract": " Extending formal verification methodology toward analog circuits is a very challenging task that will occupy researchers for some time. To put this challenge in context we sketch some of the history of digital circuit verification as well as more recent attempts to adapt it to continnuous and hybrid systems.", "num_citations": "3\n", "authors": ["1870"]}
{"title": "Optimal control for timed automata\n", "abstract": " Timed automata enrich discrete event systems with quantitative timing information, incorporating information about delays and durations into discrete models. In this paper our previous work on controller synthesis for timed automata, which dealt with qualitative properties such as avoidance of forbidden states, is extended to the following problem: given a timed game automaton, find a strategy (=controller) which brings it to a desired set of stales as fast as possible.", "num_citations": "3\n", "authors": ["1870"]}
{"title": "Why should we build artificial worms and how?\n", "abstract": " In this paper it is argued that a certain class of intelligent systems is worth being investigated and developed. This class consists of elastic robots composed of many components having relatively-simple sensory-motor capabilities, whose most prominent biological realizations are worms, molluscs, elephant trunks and tongues. Understanding how such mechanisms are controlled is an important stage (not to say, a prerequisite) toward the development of\\truely-intelligent\" autonomous agents. As a preliminary step in this direction I describe a simple elastic object considered as a rst approximation of an arti cial worm and discuss its control principles.", "num_citations": "3\n", "authors": ["1870"]}
{"title": "A Framework for control strategies in uncertain inference networks\n", "abstract": " Control Strategies for hierarchical tree-like probabilistic inference networks are formulated and investigated. Strategies that utilize staged look-ahead and temporary focus on subgoals are formalized and refined using the Depth Vector concept that serves as a tool for defining the 'virtual tree' regarded by the control strategy. The concept is illustrated by four types of control strategies for three-level trees that are characterized according to their Depth Vector, and according to the way they consider intermediate nodes and the role that they let these nodes play. INFERENTI is a computerized inference system written in Prolog, which provides tools for exercising a variety of control strategies. The system also provides tools for simulating test data and for comparing the relative average performance under different strategies.", "num_citations": "2\n", "authors": ["1870"]}
{"title": "What is verification?\n", "abstract": " What is Verification? Page 1 What is Verification? Oded Maler CNRS-Verimag, Grenoble August, 2008 Page 2 Plan of the Talk ► Context: model-based system design (mathematical models) Page 3 Plan of the Talk ► Context: model-based system design (mathematical models) ► Example: how to have your coffee, drink it too (and write a paper about it) Page 4 Plan of the Talk ► Context: model-based system design (mathematical models) ► Example: how to have your coffee, drink it too (and write a paper about it) ► Major issues in discrete verification Page 5 Plan of the Talk ► Context: model-based system design (mathematical models) ► Example: how to have your coffee, drink it too (and write a paper about it) ► Major issues in discrete verification ► New challenges: Timed and Hybrid systems Page 6 Context: Building Systems and Mechansims ► We want to build something (a “system”) that works ► The …", "num_citations": "2\n", "authors": ["1870"]}
{"title": "Théorie algébrique des langages formels temps réel\n", "abstract": " A timed automaton is an automaton augmented with several clocks that measure the time passage and may influence state changes in the system. Timed automata were introduced as a formal model for real-time systems hoping that their role in the verification of such systems will be similar to the role of finite automata in the systematic search of errors in the design of untimed systems. In our thesis we are concerned with several theoretical questions related to timed automata and timed languages. In the first part of the thesis we investigate a simple sub-class of timed automata with one clock which is reset at each transition. We show that for this sub-class we can obtain simple analogs of the classical results of automata theory, namely Kleene and Myhill-Nerode theorems and closure under complementation. The second and main part of the thesis is motivated by the timed regular expressions of Asarin, Caspi and Maler where it was shown that, in order to match the expressive power of timed automata, one needs to introduce intersection into the expressions. We investigate an alternative to intersection by using colored parentheses for defining timing restrictions on overlapping parts of a sequence. This idea leads to an alternative representation of languages of timed automata, which is based on a new class of languages called here. We develop the theory of regular expressions over regminoes and prove that their emptiness problem is undecidable in general, and decidable for a large subclass of languages. From these results we develop new data-structures and algorithms for solving emptiness and reachability problems for timed automata …", "num_citations": "2\n", "authors": ["1870"]}
{"title": "On the Cascaded Decomposition of Automata, its Complexity and its Application to Logic (Draft)\n", "abstract": " The primary decomposition theorem due to Krohn and Rhodes (KR65]), which has been considered as one of the fundamental results in the theory of automata and semigroups, states that every automaton is homomorphic to a cascaded decomposition (wreath-product) of simpler automata of two kinds: reset automata and permutation automata. If the automaton is non-counting (and correspondingly its transformation semigroup is group-free) then it can be decomposed using only reset components.There exist various proofs and partial proofs for the primary decomposition theorem eg, HS66, Ze67a, Ze67b, Gi68, MT69, La71, We76, Ei76]. None of them give explicit bounds on the size of the decomposition. 1 In this paper we give tight exponential bounds on the size of the decomposition as a function of the size of the original automaton. For the upper-bound we give an exponential algorithm by modifying the implicit construction appearing in Ei74]. Our algorithm is constructive enough to allow implementation??]. We apply the algorithm to give an exponential upper-bound on transforming star-free regular (resp.!-regular) sets expressed by counter-free automata (resp.!-automata) into past (resp. future) temporal logic formulae. These upper bounds improve upon previously-known non-elementary translations (MNP71, LPZ85, Zu86).", "num_citations": "2\n", "authors": ["1870"]}
{"title": "Learning pareto front from membership queries\n", "abstract": " We present a new method for inferring the Pareto front in multi-criteria optimization problems. The approach is grounded on an algorithm for learning the boundary between valid and invalid configurations of a multi-dimensional space (X). The algorithm selects sampling points for which it submits membership queries x ∈ X to an oracle. Based on the answers and relying on monotonicity, it constructs an approximation of the boundary. The algorithm generalizes binary search on the continuum from one-dimensional (and linearly-ordered) domains to multi-dimensional (and partially-ordered) ones. The procedure explained in this paper has been applied for the parameter synthesis of extended Signal Temporal Logic (STLe) expressions where the influence of parameters is monotone. Our method has been implemented in a free and publicly available Python library.", "num_citations": "1\n", "authors": ["1870"]}
{"title": "On universal search strategies for multi-criteria optimization using weighted sums\n", "abstract": " We develop a stochastic local search algorithm for finding Pareto points for multi-criteria optimization problems. The algorithm alternates between different single-criterium optimization problems characterized by weight vectors. The policy for switching between different weights is an adaptation of the universal restart strategy defined by [LSZ93] in the context of Las Vegas algorithms. We demonstrate the effectiveness of our algorithm on multi-criteria quadratic assignment problem benchmarks and prove some of its theoretical properties.", "num_citations": "1\n", "authors": ["1870"]}
{"title": "Safety Analysis of Hybrid Systems with SpaceEx\n", "abstract": " Safety Analysis of Hybrid Systems with SpaceEx Page 1 1 Safety Analysis of Hybrid Systems with SpaceEx Goran Frehse, Alexandre Donzé, Scott Cotton, Rajarshi Ray, Olivier Lebeltel, Manish Goyal, Rodolfo Ripado, Thao Dang, Oded Maler Université Grenoble 1 Joseph Fourier / CNRS – Verimag, France Colas Le Guernic New York University CIMS Antoine Girard Laboratoire Jean Kuntzmann, France CMACS Seminar, Pittsburgh, PA, July 20, 2011 Page 2 2 Outline SpaceEx Verification Platform SpaceEx Reachability Algorithm – Time Elapse Computation with Support Functions – Transition Successors Mixing Support Functions and Polyhedra – Fixpoint Algorithm: Clustering & Containment Examples Page 3 3 SpaceEx Verification Platform Platform for developing verification algorithms – Analysis Core (90kloc C++) – Model Editor – Web Interface Provides data structures, operators, infrastructure – proprietary …", "num_citations": "1\n", "authors": ["1870"]}
{"title": "Hybrid Systems: Computation and Control: 6th International Workshop, HSCC 2003 Prague, Czech Republic, April 3-5, 2003, Proceedings\n", "abstract": " This volume contains the proceedings of the Sixth Workshop on Hybrid Systems: Computation and Control (HSCC 2003), which was held in Prague, during April 3–5, 2003. The Hybrid Systems workshops attract researchers interested in the modeling, analysis, control, and implementation of systems which involve the interaction of both discrete and continuous state dynamics. The newest results and latest developments in hybrid system models, formal methods for analysis and control, computational tools, as well as new applications and examples are presented at these annual meetings. The Sixth Workshop continued the series of workshops held in Grenoble, France (HART’97), Berkeley, California, USA (HSCC’98), Nijmegen, The Neth-lands (HSCC’99), Pittsburgh, Pennsylvania, USA (HSCC 2000), Rome, Italy (HSCC 2001), and Stanford, California, USA (HSCC 2002). Proceedings of these workshops have been published by Springer-Verlag in the Lecture Notes in C-puter Science (LNCS) series. This year we assembled a technical program committee with a broad expertise in formal methods in computer science, control theory, applied mathematics, and arti? cial intelligence. We received a set of 75 high-quality submitted papers. After detailed review and discussion of these papers by the program committee, 36 papers were accepted for presentation at the workshop, and the? nal versions of these papers appear in this volume.", "num_citations": "1\n", "authors": ["1870"]}
{"title": "Hybrid systems applications: An oxymoron?\n", "abstract": " Hybrid systems are richly expressive models for a large variety of potential ap- plications. However, being so rich as to include continuous nonlinear dynamical systems, discrete-event systems and other models of computation (unite-state machines and data ow come to mind here), they are not amenable to com- putationally attractive techniques for synthesis and analysis and present hard numerical problems to simulation. Hence, applying the methods typical of this technology requires non trivial amount of approximation and abstraction. And approximation and abstraction are effective only if the domain of application is deeply understood. Thus, significant applications of hybrid systems require a great deal of work both to select the right abstraction level and to derive algo- rithms that exploit the particularities of the domain of application. In addition, one needs to motivate and document convincingly why …", "num_citations": "1\n", "authors": ["1870"]}
{"title": "A decomposition theorem for probabilistic transition systems\n", "abstract": " In this paper we prove that every finite Markov chain can be decomposed into a cascade product of a Bernoulli process and several simple permutation-reset deterministic automata. The original chain is a statehomomorphic image of the product. By doing so we give a positive answer to an open question stated in [Paz71] concerning the decomposability of probabilistic systems. Our result is based on the surprisingly-original observation that in probabilistic transition systems, “randomness” and “memory” can be separated in such a way that allows the non-random part to be treated using common deterministic automata-theoretic techniques. The same separation technique can be applied as well to other kinds of non-determinism.", "num_citations": "1\n", "authors": ["1870"]}