{"title": "The impact of the COVID-19 pandemic on self-harm and suicidal behaviour: update of living systematic review\n", "abstract": " Background: The COVID-19 pandemic has caused considerable morbidity, mortality and disruption to people’s lives around the world. There are concerns that rates of suicide and suicidal behaviour may rise during and in its aftermath. Our living systematic review synthesises findings from emerging literature on incidence and prevalence of suicidal behaviour as well as suicide prevention efforts in relation to COVID-19, with this iteration synthesising relevant evidence up to 19 th October 2020.Method: Automated daily searches feed into a web-based database with screening and data extraction functionalities. Eligibility criteria include incidence/prevalence of suicidal behaviour, exposure-outcome relationships and effects of interventions in relation to the COVID-19 pandemic. Outcomes of interest are suicide, self-harm or attempted suicide and suicidal thoughts. No restrictions are placed on language or study type …", "num_citations": "59\n", "authors": ["2007"]}
{"title": "Reproducibility of studies on text mining for citation screening in systematic reviews: evaluation and checklist\n", "abstract": " ContextIndependent validation of published scientific results through study replication is a pre-condition for accepting the validity of such results. In computation research, full replication is often unrealistic for independent results validation, therefore, study reproduction has been justified as the minimum acceptable standard to evaluate the validity of scientific claims. The application of text mining techniques to citation screening in the context of systematic literature reviews is a relatively young and growing computational field with high relevance for software engineering, medical research and other fields. However, there is little work so far on reproduction studies in the field.ObjectiveIn this paper, we investigate the reproducibility of studies in this area based on information contained in published articles and we propose reporting guidelines that could improve reproducibility.MethodsThe study was approached in two …", "num_citations": "35\n", "authors": ["2007"]}
{"title": "A critical analysis of studies that address the use of text mining for citation screening in systematic reviews\n", "abstract": " Background: Since the introduction of the systematic review process to Software Engineering in 2004, researchers have investigated a number of ways to mitigate the amount of effort and time taken to filter through large volumes of literature.Aim: This study aims to provide a critical analysis of text mining techniques used to support the citation screening stage of the systematic review process.Method: We critically re-reviewed papers included in a previous systematic review which addressed the use of text mining methods to support the screening of papers for inclusion in a review. The previous review did not provide a detailed analysis of the text mining methods used. We focus on the availability in the papers of information about the text mining methods employed, including the description and explanation of the methods, parameter settings, assessment of the appropriateness of their application given the size and …", "num_citations": "31\n", "authors": ["2007"]}
{"title": "Reproducibility in machine Learning-Based studies: An example of text mining\n", "abstract": " Reproducibility is an essential requirement for computational studies including those based on machine learning techniques. However, many machine learning studies are either not reproducible or are difficult to reproduce. In this paper, we consider what information about text mining studies is crucial to successful reproduction of such studies. We identify a set of factors that affect reproducibility based on our experience of attempting to reproduce six studies proposing text mining techniques for the automation of the citation screening stage in the systematic review process. Subsequently, the reproducibility of 30 studies was evaluated based on the presence or otherwise of information relating to the factors. While the studies provide useful reports of their results, they lack information on access to the dataset in the form and order as used in the original study (as against raw data), the software environment used, randomization control and the implementation of proposed techniques. In order to increase the chances of being reproduced, researchers should ensure that details about and/or access to information about these factors are provided in their reports.", "num_citations": "25\n", "authors": ["2007"]}
{"title": "The impact of the COVID-19 pandemic on self-harm and suicidal behaviour: protocol for a living systematic review\n", "abstract": " Background: The COVID-19 pandemic has caused widespread morbidity and mortality as well as disruption to people’s lives and livelihoods around the world; this has occurred as a result of both infection with the virus itself and the health protection measures taken to curb its spread. There are concerns that rates of suicide, suicidal behaviours and self-harm may rise during and in the aftermath of the pandemic. Given the likely rapidly expanding research evidence base on the pandemic’s impact on rates of suicide, suicidal behaviours and self-harm and emerging evidence about how best to mitigate such effects, it is important that the best available knowledge is made readily available to policymakers, public health specialists and clinicians as soon as is possible. To facilitate this, we plan to undertake a living systematic review focusing on suicide prevention in relation to COVID-19.   Method: Regular automated searches will feed into a web-based screening system which will also host the data extraction form for included articles. Our eligibility criteria are wide and include aspects of incidence and prevalence of suicidal behaviour, effects of exposures and effects of interventions in relation to the COVID-19 pandemic, with minimal restrictions on the types of study design to be included. The outcomes assessed will be death by suicide; self-harm or attempted suicide (including hospital attendance and/or admission for these reasons); and suicidal thoughts/ideation. There will be no restriction on study type, except for single case reports. There will be no restriction on language of publication. The review will be updated at three-monthly intervals if a …", "num_citations": "10\n", "authors": ["2007"]}
{"title": "Evaluation of convertibility issues between IFPUG and COSMIC function points\n", "abstract": " Software industry has matured with time, from small application of few lines of codes to software application of millions of lines of code. In the past few years, the concern of the industry regarding software size estimation has been the convertibility issue between the International Function Point User Group (IFPUG) and the COmmon Software Measurement International Consortium (COSMIC) in order to leverage their huge investment on the IFPUG. Since there is still no cost and effort estimation tool for COSMIC function points. IFPUG is one of the early estimation methods, however, with the introduction of a more scientific method like COSMIC which has a wider applicability than the IFPUG and both method using the same measuring unit and principle, the continued relevancy of the IFPUG is called to question. Due to similar underlining principle of the two methods and for organizations that have invested so much in …", "num_citations": "7\n", "authors": ["2007"]}
{"title": "Data extraction methods for systematic review (semi) automation: A living review protocol\n", "abstract": " Background: Researchers in evidence-based medicine cannot keep up with the amounts of both old and newly published primary research articles. Support for the early stages of the systematic review process–searching and screening studies for eligibility–is necessary because it is currently impossible to search for relevant research with precision. Better automated data extraction may not only facilitate the stage of review traditionally labelled ‘data extraction’, but also change earlier phases of the review process by making it possible to identify relevant research. Exponential improvements in computational processing speed and data storage are fostering the development of data mining models and algorithms. This, in combination with quicker pathways to publication, led to a large landscape of tools and methods for data mining and extraction.Objective: To review published methods and tools for data extraction to …", "num_citations": "6\n", "authors": ["2007"]}
{"title": "The use of bibliography enriched features for automatic citation screening\n", "abstract": " ContextCitation screening (also called study selection) is a phase of systematic review process that has attracted a growing interest on the use of text mining (TM) methods to support it to reduce time and effort. Search results are usually imbalanced between the relevant and the irrelevant classes of returned citations. Class imbalance among other factors has been a persistent problem that impairs the performance of TM models, particularly in the context of automatic citation screening for systematic reviews. This has often caused the performance of classification models using the basic title and abstract data to ordinarily fall short of expectations.ObjectiveIn this study, we explore the effects of using full bibliography data in addition to title and abstract on text classification performance for automatic citation screening.MethodsWe experiment with binary and Word2vec feature representations and SVM models using 4 …", "num_citations": "6\n", "authors": ["2007"]}
{"title": "The impact of the COVID-19 pandemic on self-harm and suicidal behaviour: update of living systematic review\n", "abstract": " Background: The COVID-19 pandemic has caused considerable morbidity, mortality and disruption to people's lives around the world. There are concerns that rates of suicide and suicidal behaviour may rise during and in its aftermath. Our living systematic review synthesises findings from emerging literature on incidence and prevalence of suicidal behaviour as well as suicide prevention efforts in relation to COVID-19, with this iteration synthesising relevant evidence up to 19 th October 2020. Method: Automated daily searches feed into a web-based database with screening and data extraction functionalities. Eligibility criteria include incidence/prevalence of suicidal behaviour, exposure-outcome relationships and effects of interventions in relation to the COVID-19 pandemic. Outcomes of interest are suicide, self-harm or attempted suicide and suicidal thoughts. No restrictions are placed on language or study type, except for single-person case reports. We exclude one-off cross-sectional studies without either pre-pandemic measures or comparisons of COVID-19 positive vs. unaffected individuals. Results: Searches identified 6,226 articles. Seventy-eight articles met our inclusion criteria. We identified a further 64 relevant cross-sectional studies that did not meet our revised inclusion criteria. Thirty-four articles were not peer-reviewed (eg research letters, pre-prints). All articles were based on observational studies. There was no consistent evidence of a rise in suicide but many studies noted adverse economic effects were evolving. There was evidence of a rise in community distress, fall in hospital presentation for suicidal behaviour and early …", "num_citations": "4\n", "authors": ["2007"]}
{"title": "Performance Comparison of dynamic Web scripting Language: A case Study of PHP and ASP .NET\n", "abstract": " With security, performance, manageability, and scalability requirements for enterprise applications rapidly increasing, choosing the best scripting language in today’s competitive environment remains imperative. Scripting language are improving on every front, but enterprises continue to face the arduous but necessary task of evaluating solutions to find the best fit for their unique needs. The paper tends to analyse and compare the performance of the two most popular dynamic scripting languages used in web development, the PHP and ASP .NET. The comparison is based on testing and comparing the performance of the two technologies using software called WAPT. We measure the performance of these two languages using one application benchmarks; an online bookstore. This similarity helps to establish realistic comparison of applications performance. WAPT provides a load and stress testing a tool that provides an easy to use, consistent and cost effective way of testing websites and intranet applications with web interface.", "num_citations": "3\n", "authors": ["2007"]}
{"title": "Informal Aggregation Technique for Software Engineering Experiments\n", "abstract": " One of the bases for development and standardization in any discipline is continuous empirical verification of knowledge. Thus, empirical replication is required to validate or establish experimental results. When these replications occur, there is also a need to synthesize the different results for a common result. Software Engineering experiments usually fall short of the requirements of the meta-analysis techniques currently in use for this purpose either in number, report or even design. Therefore, there is a need for a less rigorous technique that could serve even as a temporary tool but suitable to software engineering studies and also usable. This study presents an alternative less rigorous aggregation techniques that systematically synthesize the statistic ANOVA results by grouping treatments with seemingly equal level of evidence together. Each group is then ranked on an ordinal scale, grouped and interpreted.", "num_citations": "3\n", "authors": ["2007"]}
{"title": "Data extraction methods for systematic review (semi) automation: A living systematic review [version 1; peer review: awaiting peer review]\n", "abstract": " Background: The reliable and usable (semi)automation of data extraction can support the field of systematic review by reducing the workload required to gather information about the conduct and results of the included studies. This living systematic review examines published approaches for data extraction from reports of clinical studies. Methods: We systematically and continually search MEDLINE, Institute of Electrical and Electronics Engineers (IEEE), arXiv, and the dblp computer science bibliography databases. Full text screening and data extraction are conducted within an open-source living systematic review application created for the purpose of this review. This iteration of the living review includes publications up to a cut-off date of 22 April 2020. Results: In total, 53 publications are included in this version of our review. Of these, 41 (77%) of the publications addressed extraction of data from abstracts, while 14 (26%) used full texts. A total of 48 (90%) publications developed and evaluated classifiers that used randomised controlled trials as the main target texts. Over 30 entities were extracted, with PICOs (population, intervention, comparator, outcome) being the most frequently extracted. A description of their datasets was provided by 49 publications (94%), but only seven (13%) made the data publicly available. Code was made available by 10 (19%) publications, and five (9%) implemented publicly available tools. Conclusions: This living systematic review presents an overview of (semi)automated data-extraction literature of interest to different types of systematic review. We identified a broad evidence base of publications describing data …", "num_citations": "2\n", "authors": ["2007"]}
{"title": "Reporting statistical validity and model complexity in machine learning based computational studies\n", "abstract": " Background:: Statistical validity and model complexity are both important concepts to enhanced understanding and correctness assessment of computational models. However, information about these are often missing from publications applying machine learning.Aim: The aim of this study is to show the importance of providing details that can indicate statistical validity and complexity of models in publications. This is explored in the context of citation screening automation using machine learning techniques.Method: We built 15 Support Vector Machine (SVM) models, each developed using word2vec (average word) features---and data for 15 review topics from the Drug Evaluation Review Program (DERP) of the Agency for Healthcare Research and Quality (AHRQ).Results: The word2vec features were found to be sufficiently linearly separable by the SVM and consequently we used the linear kernels. In 11 of the …", "num_citations": "2\n", "authors": ["2007"]}
{"title": "APRIVACY CONTROL OPTION FOR CALL CENTERS IN NIGERIA’S CASHLESS ECONOMY\n", "abstract": " Customers’ trust has been identified as a factor that must exist for customers to embrace e-commerce. An effective, reachable and responsive call center is one key to gaining this trust for organizations or banks that rely on e-commerce. However, an issue with call centers is the proper identification of the caller so that sensitive information is not divulged to wrong persons. Thus, a second level security check is needed before resolving any issue or divulging any account or transaction related information to the caller. This is seen as a necessary step to guard against privacy intrusion, scam or identity theft. Therefore, this paper proposes the use of a 7-digit identification code issued to customers solely for the purpose of remote communication with the bank. At the point of service rendering, the customer will only need to supply the digits occupying two or three randomly selected positions out of the seven. We believe this will further strengthen the privacy of customers in the banks through the call centers.", "num_citations": "1\n", "authors": ["2007"]}
{"title": "Summarizing the Results of a Series of Experiments: Application to the Effectiveness of Three Software Evaluation Techniques\n", "abstract": " Software quality has become and persistently remains a big issue among software users and developers. So, the importance of software evaluation cannot be overemphasized. An accepted fact in software engineering is that software must undergo evaluation process during development to ascertain and improve its quality level.", "num_citations": "1\n", "authors": ["2007"]}