{"title": "Exploring how pervasive computing can support situated learning\n", "abstract": " Pervasive computing offers new ranges of possibilities when it comes to supporting learning and collaboration. The design of educational activities in these environments is a challenging task that raises the question of how pervasive computing can be used to support new modes of collaborative learning. In this paper we discuss those aspects related to the design of situated learning activities supported by pervasive computing and the collaboration modes that may emerge as a result of these activities. Additionally, we discuss how activity theory can be used as a framework for designing such educational activities. We present the results of a trial we conducted while introducing pervasive computing in an elementary school activity. In conclusion we open the discussion about the relation between the design of innovative learning activities supported by pervasive computing and new collaboration possibilities that may arise in these environments.", "num_citations": "34\n", "authors": ["763"]}
{"title": "Providing flexibility in learning activities systems by exploiting the multiple roles of mobile devices\n", "abstract": " The wide adoption of mobile and wireless technologies allow for users to have access to learning resources and generate digital content at any location and time. An immediate implication of this latest trend is the need to create and deploy learning activity systems that offer a high level of flexibility. This flexibility can allow for the creation of adaptive activities, something highly required in dynamic learning environments such as those in the field of M-learning. Mobile devices can provide flexibility to activity systems by adapting their behavior on a context basis. To give an example of flexibility in the mobile device behavior, we present the FLexible Activity Client (FLAC). FLAC is a mobile application that allows the mobile device to switch from client-role to service-provider-role behavior. We describe our proposed architecture and its implementation and present the results of our initial tests.", "num_citations": "30\n", "authors": ["763"]}
{"title": "On the Issue of Reusability and Adaptability in M-learning Systems\n", "abstract": " This paper presents a brief overview over some of the conceptual and technical issues associated with reusability and adaptability. The specific orientation of our efforts is oriented towards systems supporting Mobile Learning. The field of M-learning domain has during recent years been suffering from severe configuration problems caused by the plethora of mobile devices present on the market. This paper presents a conceptual architecture that has been conceived to remedy some of these issues. Furthermore, a possible instantiation of this architecture with self-adaptivity features is discussed and a first prototype implementation is presented. The notion of ecosystems is introduced, as we believe it is an important building block towards increasing the reusability of components and content in this field where composition is one of the major issues to be addressed.", "num_citations": "17\n", "authors": ["763"]}
{"title": "Reusability and interoperability in mobile learning: A study of current practices\n", "abstract": " The amount of software developed for educational purposes has steadily increased over the last years. A growing subset of these developments is intended for use in mobile devices. This puts special requirements on implementations that need to be overcome before mobile learning can be more widely adopted. In this paper we investigate how educational software development community can be encouraged to develop more sustainable and interoperable applications. This investigation is done by first surveying the different aspects of reuse to give a background and motivation. Then, a survey of current practice is performed. The survey provides initial insights into how reuse and interoperability is used in authentic practice. Findings indicate that there is much to be done in terms of interoperability and reuse for mobile learning applications. The result of this study confirms that two of the main challenges that …", "num_citations": "16\n", "authors": ["763"]}
{"title": "Trade-offs between didactical and technological design requirements affecting the robustness of a mobile learning activity\n", "abstract": " Guided by design research we develop an innovative mathematical mobile learning activity for 12 year old students, who are asked to coordinate themselves physically in terms of given distances with respect to two given points in an outdoor setting. The development of the outdoor activity poses didactical as well as technological design challenges. We elaborate on two critical incidents that occurred during the implementation of the activity. Such incidents call for increasing attention to the negotiation of didactical and technological requirements during the design process. We argue that the efficient development of innovative mobile learning activities aiming at supporting learning in outdoors and indoors settings requires effective negotiation and coordination of didactical and technological strategies and requirements during the entire design process.", "num_citations": "15\n", "authors": ["763"]}
{"title": "Pinetree: a learning content repository based on semantic web technologies\n", "abstract": " During the last few years, mobile devices such as cellular phones and PDAs have become sophisticated tools for creating digital content. Moreover, their built-in or attachable sensor capabilities make it possible to derive metadata that denote the context of the user. The challenge of annotating digital content with contextual metadata is a central part of our current research efforts and the main rationale for the development of Pinetree. Pinetree is a learning content repository based on semantic Web technologies. The aim of the article is to explore the utility of using RDF (resource description framework) as a data model in a learning content repository. We describe the different components of Pinetree and illustrate its use in a specific learning scenario. Our initial results indicate that a learning content repository based on RDF can be a flexible solution for digital content storage in terms of metadata expressivity …", "num_citations": "14\n", "authors": ["763"]}
{"title": "Software ecosystems and e-learning: Recent developments and future prospects\n", "abstract": " This paper presents an overview of commonly used E-learning systems and the way developers of such systems try to incorporate the notion of Software Ecosystems (SECOs) for design and deployment. Utilizing the power of crowds is a popular notion on today's web and many companies let others extend their core products and to generate profit from that. Is this process something that could applicable in the area of E-learning? This paper aims to serve as a stepping-stone for further work into this area by providing a survey into recent research in both E-learning and Software Ecosystems. The paper also surveys the already existing SECOs in E-learning and discusses current and future efforts in this field.", "num_citations": "13\n", "authors": ["763"]}
{"title": "Making use of user-generated content and contextual metadata collected during ubiquitous learning activities\n", "abstract": " During the last years significant research efforts have been conducted looking at how to standardize digital educational content. Due to better connectivity and computational power of mobile devices, new opportunities have emerged for collecting user-generated data based on the context and the environment where the content has been generated. While metadata standards for learning objects such as IEEE LOM make it possible to annotate digital content with pre-defined metadata tags, the ability to store custom user-generated or contextual metadata is not yet fully supported. The need for developing a flexible solution to deal with these problems motivated the design of our activity controller system (ACS), a rapid prototyping system and a task manager, which interprets, reacts to and stores contextual metadata and content extracted during learning activities. This paper presents how ACS facilitates coordination …", "num_citations": "12\n", "authors": ["763"]}
{"title": "Utilizing gesture based interaction for supporting collaborative explorations of visualizations in TEL\n", "abstract": " In this paper, we present our efforts related to the implementation of the prototype that utilizes gesture based interaction for supporting collaborative explorations of visualizations in technology-enhanced learning activities. The prototype enables the visualization of different types of geo-tagged content and sensor data collected using mobile devices. In order to test the novelty and interactivity of our prototype we conducted a user testing study involving university students. The results of this study indicate that participants experienced this prototype as easy to use, with an acceptable overall level of satisfaction. Outcomes from this study show that gesture based interaction become useful when it comes to collaborative explorations of visualizations for supporting learning activities.", "num_citations": "9\n", "authors": ["763"]}
{"title": "Mobile collaboration tools and systems to support ubiquitous learning\n", "abstract": " Current developments in mobile, wireless and positioning technologies combined with contextual computing are contributing to the advance of new mobile applications and services. Educational environments are being subject to these changes providing an opportunity for curriculum development that can use these socially based mobile devices for supporting different aspects of learning and teaching. But these new technologies raise crucial questions about what features and capabilities collaborative mobile tools and systems should provide to support different learning activities. In this paper we present our current work related to the development of a system that use web and mobile technologies to support collaborative and ubiquitous learning. We also illustrate three specific collaborative learning scenarios supported by our tools. The results of our activities provide us with valuable insights that can help us to identify future challenges related to the design and implementation of this kind of collaborative systems.", "num_citations": "7\n", "authors": ["763"]}
{"title": "Designing pervasive games to support university studies in media technology\n", "abstract": " New media technology students at university face many challenges from social to pedagogical when they start academic studies. One of the programs initial goals for these new students is to introduce them to some of the key social Web services that they will need to use for their schoolwork. The use of pervasive games to reach this specific purpose may help new students acclimate to these challenges. This paper presents a pervasive game that helps teams of students work together with new technologies to solve a mystery about a missing fictional professor. Our particular research interest relates to how pervasive games can be used to introduce social Web technologies and support team building for a university courses. The game presented in this paper show promise as a tool to get new university students in media technology actively involved in exploring social media web services.", "num_citations": "5\n", "authors": ["763"]}
{"title": "Real-time interactive visualization aiding pronunciation of English as a second language\n", "abstract": " Some studies have been reporting encouraging results concerning the possibilities of combining voice and its visual representation for language learning. Following this line of investigation this paper explores the potential impact of two distinct visualization styles for the learning of English pronunciation of syllables for non-native speakers: a) highlighting syllables and b) the visualization of the produced sound wave. In order to evaluate the benefits of the two different styles three distinct digital tool prototypes were created in order to test four study conditions. The conditions under evaluation were a) teaching syllables without the support of any digital tool, b) teaching using a prototype that highlighted the syllables under study, c) using a prototype that displayed the sound wave of the syllable to be learnt and d) a prototype that combined the functionality of b) and c). Results suggest that the combined approach seems …", "num_citations": "4\n", "authors": ["763"]}
{"title": "Towards a Mobile Learning Software Ecosystem\n", "abstract": " The last decades have seen significant changes in computing. Computers have gone from being a device to be used only by experts and occupying several rooms to being a pervasive artifact in many aspects of society (Ceruzzi, 1986). Technological development has put communication devices into our pockets with a computational power that was fantasy some years ago. The popularity of the Internet has changed the way we use communication technology and services in our daily lives (Alexander, 2006). We are now more interconnected than ever before. A device’s physical dimensions have decreased while its computational power has increased. This has, in turn, paved the way for powerful mobile devices which increases still further the connectivity of the world (McQueen, 2009). Some have claimed schools and universities have been very slow in implementing technology in their daily activities, save the occasional PowerPoint presentation (Cross, 2010). Be that as it may, research on how to utilize technology in education has been around for a long time (Suppes, 1966). As computers made their way into the public space, more and more researchers began to show an interest in the field of utilizing technology to support learning. This also prompted efforts in hardware development; Sweden for example, decided to develop its own “school computer” during the 1980s, called the Compis (Kaiserfeld, 2000). The Internet gained much popularity during the 1990s and this prompted distance education via computers to become an attractive notion to pursue (Bates and Bates, 2005). Efforts such as Moodle (Cole and Foster, 2007) and Sakai …", "num_citations": "2\n", "authors": ["763"]}
{"title": "Identifying the potential needs to provide mobile context-aware hints to support students’ learning\n", "abstract": " In recent years, mobile and context-aware technologies have been used in an attempt to enhance students‟ formal and informal learning experiences both in the classroom and outdoor settings. Such technologies have supported teaching and learning in a variety of subjects. In this paper, we present the ongoing research efforts in our Geometry Mobile (GeM) project, where we conducted a number of trials in the last two years with primary and secondary school students in Sweden. The current trial of our GeM project (April 2011) is discussed together with the data collection method we have used for exploring how Context-Aware learning hints (CA hints) can be utilized to support the different stages of the learning activity. Insights and preliminary results from this trial are described. We also present the motivation of our proposed CA hints, the definition of the requirements of those, and the formulation of a classification thereof.", "num_citations": "2\n", "authors": ["763"]}
{"title": "Case study: Extending content metadata by appending user context\n", "abstract": " Recent developments in modern computing and wireless networks allow mobile devices to be connected to the Internet regardless of their physical location. These mobile devices, such as smart phones and PDAs, have turned into powerful multimedia units allowing users to become producers of rich media content. This latest development contributes to the ever-growing amount of digital material existing on the World Wide Web, and at the same time creates a new information landscape that combines content coming from both, the wired and mobile Internet. Thus, it is important to understand the context or settings in which mobile devices are used, and what is the digital content produced by the different users. In order to gain more knowledge about this domain, we have investigated how to extend the standard metadata related to content with a metadata domain describing the context, or settings in which the content has been created. In order to limit the scope of our work, we have focused our efforts in a specific case taking place in a project called AMULETS. The AMULETS-project contains all of the elements we need in order to resemble the contextual setting in a metadata model. Combined with the technical metadata associated to the digital content, we try to display the benefits of capturing the different attributes of the context that were present when the content was generated. Additionally, we have created a proof-of-concept Entity Relation (ER)-diagram which proposes how the metadata models can be implemented in a relational database. As the nature of the thesis is design-oriented, a model has been developed and it will be illustrated …", "num_citations": "2\n", "authors": ["763"]}
{"title": "Exploring interaction supported by recent technology in ubiquitous learning environments\n", "abstract": " The purpose of this paper is to investigate how technology of today can be used to support interaction when performing location-based activities by describing a particular trial within a project called Advanced Mobile and Ubiquitous Learning Environments for Teachers and Students (AMULETS). AMULETS consists of a series of trials run by the Center for Learning and Knowledge Technologies (CeLeKT) at the University of Växjö focusing on ubiquitous computing within game-like collaborative learning activities. The experiment described in this paper was named AMULETS Stortorget, in which the participants used cellular phones and a laptop computer to complete tasks assigned for them. In this trial the technology was developed to explore how collaboration, interaction, and learning can be bridged between the different groups.", "num_citations": "1\n", "authors": ["763"]}