{"title": "Extending BPMN 2.0: method and tool support\n", "abstract": " There are two major pitfalls in the development of extensions to the BPMN 2.0 metamodel. First, there is a lack of methodological guides considering the extensibility approach supported by the extension mechanism of the language. Second, BPMN does not provide any graphical notation for the representation of extensions. This work proposes a method based on Model-Driven Architecture for the development of extensions to the BPMN 2.0 metamodel. It enables the conceptual modeling of extensions by using UML, their graphical representation in terms of the BPMN extension mechanism, and their transformation into XML Schema documents that can be processed by BPMN tools. A tool supporting the proposed method is also presented.", "num_citations": "99\n", "authors": ["618"]}
{"title": "A BPMN 2.0 Extension to Define the Resource Perspective of Business Process Models.\n", "abstract": " One of the primary motivations of BPMN is to provide an easy to understand standard way to define and visualize business process models. This goal is addressed with respect to the control flow perspective. However, the support it provides to the resource perspective is poor. This work presents an extension to the BPMN 2.0 metamodel and notation to support the modeling and visualization of resource perspective requirements. It considers three aspects of the resource perspective: resource structure, authorization and work distribution. This extension is validated against the Workflow Resource Patterns that define recurrent requirements regarding this perspective. The aim of this BPMN extension is to improve the communication of the resource perspective requirements between business analysts and technical developers.", "num_citations": "84\n", "authors": ["618"]}
{"title": "Modeling and Specification of Collaborative Business Processes with a MDS Approach and a UML Profile\n", "abstract": " This chapter describes the application of MDA (Model-Driven Architecture) and UML for the modeling and specification of collaborative business processes, with the purpose of enabling enterprises to establish Business-to-Business collaborations. The proposed MDA approach provides the components and techniques required for the development of collaborative processes, from their conceptual modeling to the specifications of these processes and the partners’ interfaces in a B2B standard. As part of this MDA approach, a UML Profile is provided, which extends the semantics of UML 2 to support the analysis and design of collaborative processes. This UML Profile is based on the use of interaction protocols to model collaborative processes. The application of this UML Profile in a case study is presented. Also, an overview is provided about the automatic generation of B2B specifications from conceptual models of …", "num_citations": "39\n", "authors": ["618"]}
{"title": "A modeling approach for collaborative business processes based on the up-colbpip language\n", "abstract": " The modeling of collaborative business processes is an important issue in order to allow enterprises to implement B2B collaborations with their business partners. We have proposed an MDA-based methodology for the modeling, verification and implementation of collaborative processes. Since collaborative process models are the main artifacts in this MDA-based methodology, a suitable modeling approach is required to design collaborative processes. In this work we describe a modeling approach for collaborative processes based on the UP-ColBPIP language, which is oriented to support the model-driven development of collaborative processes and B2B information systems. The behavior of collaborative processes is modeled through interaction protocols. Enhances to the control flow constructors of interaction protocols are introduced. In addition, we describe an Eclipse-based tool that supports this …", "num_citations": "37\n", "authors": ["618"]}
{"title": "Tolerance to ultraviolet radiation of psychrotolerant yeasts and analysis of their carotenoid, mycosporine, and ergosterol content\n", "abstract": " Yeasts colonizing the Antarctic region are exposed to a high ultraviolet radiation evolving mechanisms to minimize the UV radiation damages, such as the production of UV-absorbing or antioxidant compounds like carotenoid pigments and mycosporines. Ergosterol has also been suggested to play a role in this response. These compounds are also economically attractive for several industries such as pharmaceutical and food, leading to a continuous search for biological sources of them. In this work, the UV-C radiation tolerance of yeast species isolated from the sub-Antarctic region and their production of carotenoids, mycosporines, and ergosterol were evaluated. Dioszegia sp., Leuconeurospora sp. (T27Cd2), Rhodotorula laryngis, Rhodotorula mucilaginosa, and Cryptococcus gastricus showed the highest UV-C radiation tolerance. The yeasts with the highest content of carotenoids were Dioszegia sp …", "num_citations": "28\n", "authors": ["618"]}
{"title": "Extended Resource Perspective Support for BPMN and BPEL.\n", "abstract": " This work provides support to the modeling and execution of the Resource Perspective of Business Processes with BPMN and BPEL. It is based on an extension developed to BPMN 2.0 in order to define and visualize the Resource Structure, Work Distribution and Authorization aspects of this perspective. This work proposes a mapping of extended BPMN process models to BPEL processes applying the BPEL4People and WS-HumanTask extensions. It also proposes the structure of people directories enabling BPEL4People and WS-HumanTask implementations to distribute work to the resources based on Resource Structure models defined by using the proposed BPMN extension.", "num_citations": "28\n", "authors": ["618"]}
{"title": "Defining the resource perspective in the development of processes-aware information systems\n", "abstract": " ContextThe resource perspective has impact on the performance of business processes. However, current Workflow Management Systems (WfMSs) provide disparate support to its implementation and business process modeling languages provide limited capabilities for its definition. Thus, it is difficult to specify requirements regarding this perspective and to select an appropriate WfMS to support them in order to obtain a technological solution aligned with the organizational needs.ObjectiveTo provide support to the definition, implementation, verification and validation of resource perspective requirements in the development of Process-Aware Information Systems (PAISs) based on WfMSs.MethodThe following activities were carried out: (i) identification of resource perspective aspects in executable workflow specifications, (ii) analysis of the elements provided by the BPMN modeling language to represent these …", "num_citations": "23\n", "authors": ["618"]}
{"title": "A distributed repository for managing business process models in cross-organizational collaborations\n", "abstract": " Cross-organizational collaborations require the management of models for: collaborative business processes (CBPs), which define the collaboration's behavior; and integration business processes (IBPs), which define the behavior that supports the role an organization performs in a CBP. Managing these business process models becomes a complex task when organizations integrate collaborative networks and set up several cross-organizational collaborations. This paper presents a distributed repository that provides the functionalities required to manage conceptual business process models involved in cross-organizational collaborations. A service-oriented architecture is proposed for the distributed repository. This architecture enables organizations to access a global repository for managing collaborative networks, cross-organizational collaborations, and their CBP models. Organizations can also maintain …", "num_citations": "23\n", "authors": ["618"]}
{"title": "A verification method for collaborative business processes\n", "abstract": " The verification of collaborative processes is a key issue to consider in cross-organizational modeling methodologies. Some of the existing verification approaches provide only partial support, whereas others impose some restrictions to verify models with advanced control flow, compromise (completely or partially) the enterprise autonomy, or are focused on technology-dependent specifications. In order to deal with these issues we introduce Global Interaction Nets, which are based on Hierarchical and Colored Petri Nets, and the Global Interaction Soundness property, which was adapted from the classical definition of soundness, as the main correctness criterion. The method can be used to formalize and verify models defined with different modeling languages. In addition, we apply the method through a case study modeled with UP-ColBPIP, which is a modeling language for collaborative processes, and …", "num_citations": "20\n", "authors": ["618"]}
{"title": "A preliminary study of Hello Barbie in Brazil and Argentina\n", "abstract": " A smart city is an urban development vision based on Information and Communication Technology (ICT) and the Internet of things (IoT) for the city’s management and operations. The smart city concept is raised simultaneously in many modern societies. IoT is always playing an important role as smart devices to support complex scenarios in smart cities. A smart toy, such as “Hello Barbie,” is a smart device consisting of a physical toy component that connects to a computing system with online services through networking to enhance the functionality of a traditional toy. In this research, we particularly studied Brazilian and Argentinian consumers’ perceived innovativeness, risks and benefits of smart toys and their purchase intention toward such toys. Results indicate that Brazilian consumers have better perception and evaluation of the toy and thus higher purchase intention than Argentinian consumers do. Such …", "num_citations": "15\n", "authors": ["618"]}
{"title": "A MDA-based development process for collaborative business processes\n", "abstract": " The modeling and specification of collaborative business processes is a key issue in order to enterprises can implement Business-to-Business collaborations with their partners. These processes have to be defined first in a business level using a technology-independent language and then in a technological level using a Business-to-Business standard. Both definitions must have a mutual correspondence. To support the above issues, the Model-Driven Architecture (MDA) Initiative has been identified as a key enabler to build a modeldriven development method. In this paper, we describe a MDA approach for collaborative business processes. We present the phases, artifacts (models and code), languages, mappings and transformation techniques that make up the development process of this MDA approach. We identify the issues to be taken into account in a MDA approach for collaborative processes, in order to guarantee that the generated B2B specifications fulfill the collaborative processes agreed between the partners in a business level.", "num_citations": "14\n", "authors": ["618"]}
{"title": "Transforming collaborative business process models into web services choreography specifications\n", "abstract": " Languages for web services choreography are becoming more and more important for B2B integration. However, the development of web services-based systems is complex and time-consuming. Enterprises have to agree on collaborative business processes and then derive their respective web services choreographies in order to implement B2B collaboration. To support it, this paper presents a MDA approach for collaborative processes. We describe the components and techniques of this approach. We show how collaborative process models defined with the UP-ColBPIP language can be used as the main development artifact in order to derive choreography specifications based on WS-CDL. The transformations to be carried out are also discussed. The main advantage of this MDA approach is that it guarantees that the generated web services choreographies fulfill the collaborative processes agreed …", "num_citations": "12\n", "authors": ["618"]}
{"title": "Specification of behavioral anti-patterns for the verification of block-structured collaborative business processes\n", "abstract": " Context: The verification of the control flow of a Collaborative Business Process (CBP) is important when developing cross-organizational systems, since the control flow defines the behavior of the cross-organizational collaboration. Behavioral anti-patterns have been proposed to improve the performance of formal verification methods. However, a systematic approach for the discovery and specification of behavioral anti-patterns of CBPs has not been proposed so far.Objective: The aim of this work is an approach to systematically discover and specify the behavioral anti-patterns of block-structured CBP models.Method: The approach proposes using the metamodel of a CBP language to discover all possible combinations of constructs leading to a problem in the behavior of block-structured CBPs. Each combination is called minimal CBP. The set of all minimal CBPs with behavioral problems defines the …", "num_citations": "10\n", "authors": ["618"]}
{"title": "Behavior Alignment and Control Flow Verification of Process and Service Choreographies.\n", "abstract": " The representation of process and service choreographies has been recognized as an important requirement in service-oriented methodologies. The guarantee of alignment between process and service choreographies and the verification of the behavior of choreographies represent an important improvement for such methodologies, since they enable the automatic generation of choreography service specifications from well-defined choreography process models. To deal with these issues, we propose a transformation pattern that guarantees behavior alignment between process and service choreographies, and a verification method for the control flow of choreographies, which can be applied to any choreography language. These approaches make use of the Global Interaction Nets (GI-Nets) language to formalize the behavior of process and service choreographies. This formal representation can then be used …", "num_citations": "10\n", "authors": ["618"]}
{"title": "An MDA-based Method for Designing Integration Process Models in B2B Collaborations.\n", "abstract": " The design of integration processes is a key issue for implementing collaborative business processes in Business-to-Business collaborations. A collaborative process is executed through the enactment of the integration process of each organization, which contains the public and private logic required to support the role an organization performs in the collaborative process. Integration process models must be aligned with and derived from their corresponding collaborative process models to guarantee interoperability among organizations. In this work, we propose a method based on a Model-Driven Architecture to enable organizations to support and automate the design of integration process models. This method provides a model transformation process that uses Workflow Activity Patterns to generate the public/private activities required in integration processes to support cross-organizational message exchanges.", "num_citations": "10\n", "authors": ["618"]}
{"title": "A survey on purchase intention of hello Barbie in Brazil and Argentina\n", "abstract": " Children’s toys have become increasingly sophisticated over the years, with a growing shift from simple physical products to toys that engage the digital world by the use of software and hardware. A smart toy, such as Hello Barbie, is defined as a device consisting of a physical toy component that connects to a computing system with online services through networking to enhance the functionality of a traditional toy. Hello Barbie is introduced by Mattel as “the first fashion doll that can have a two-way conversation with girls” with speech recognition and online connection to Cloud computing technologies. While the doll is made by Mattel, the online English conversation software is powered by ToyTalk.com. The targeted players are 7–13 years old children. Adding the ability of speech recognition and online connection raises the risk of privacy breaches in children. Since its introduction in February 2015, Hello …", "num_citations": "9\n", "authors": ["618"]}
{"title": "Ontology-based heuristics for process behavior: formalizing false positive scenarios\n", "abstract": " Verification methods to detect errors in the behavior of process models can be formal or informal. The former are based on formal languages, whereas the latter are based on heuristics. The main advantage of informal methods with respect to the formal ones is their short run-time. However, heuristics may lead to false positives, i.e. they may detect errors in a process model even though such model is correct. In this work, we propose using ontologies to formalize heuristics that avoid false positive scenarios. With ontologies it is possible to avoid ambiguities in heuristics that may lead to inaccurate implementations and to enable their execution by ontology reasoners. To this aim, we propose a set of false positive scenarios and define SWRL rules and SPARQL queries to formalize heuristics for such scenarios by means of ontologies. In addition, we identified three requirements that should be met in order to …", "num_citations": "9\n", "authors": ["618"]}
{"title": "Approaches for the analysis and design of multi-agent systems\n", "abstract": " This work firstly presents an approach based on the organizational concept of business processes to identify roles and protocols as part of the analysis stage of a methodology for agent-oriented analysis and design. Secondly, the work presents an approach to help to decide when using a mobile agent in a multi-agent architecture is better than using a static one. This approach is based on both the quality attributes specified for the multi-agent architecture and the execution environments of the multi-agent system. A real case is used to exemplify these approaches.", "num_citations": "9\n", "authors": ["618"]}
{"title": "Cloud-based platform for collaborative business process management\n", "abstract": " With the wide adoption of the Internet, organizations establish collaborative networks to execute Collaborative Business Processes (CBPs). Current approaches of Process-Aware Information Systems (PAISs) to implement and execute CBPs have shortcomings: high costs and complexity of IT infrastructure to deploy the PAISs; poor support for autonomy, decentralization, global view of message exchange and peer-to-peer interactions; and rigid platforms for generating and deploying PAISs on-demand according with the CBPs agreed in collaborative networks. To overcome these issues, this work proposes a cloud-based platform for the management of CBPs. The platform provides cloud services that enable the generation and deployment on-demand of the PAISs required to implement the agreed CBPs, as well as the execution on-demand of CBPs by fulfilling the abovementioned issues. To deal with privacy …", "num_citations": "8\n", "authors": ["618"]}
{"title": "Applying Model-Driven Development to Collaborative Business Processes.\n", "abstract": " Currently enterprises are focusing on the setting up of Business-to-Business collaborative relationships with their partners. One of the main challenges in these relationships is the definition of the Collaborative Business Processes. These processes have to be defined first in a business level using a technologyindependent language, and then in a technological level using a Business-to-Business standard. Both definitions must have a mutual correspondence. Therefore, in this paper we present a model-driven development method to support the design of collaborative processes. As part of this method we describe the modeling language UP-ColBPIP to design technology-independent collaborative processes. This language supports the definition of these processes through interaction protocols. In addition, we provide a model transformation method that defines how from UP-ColBPIP collaborative process models we can generate specifications based on the ebXML standard for implementing collaborative processes.", "num_citations": "8\n", "authors": ["618"]}
{"title": "Detection of anti-patterns in the control flow of collaborative business processes\n", "abstract": " The verification of the behavior of Collaborative Business Processes is an important aspect to consider when developing inter-organizational systems. In this work, a verification approach for the control flow of collaborative processes based on anti-patterns is proposed to improve the performance of verification. The approach supports the verification of complex constructs for advanced synchronization, multiple instances, and exception management. To this aim, 10 anti-patterns were defined from a repository of process models, and a tool which implements the anti-patterns was developed to evaluate the verification approach. Results indicate that, at worst, the verification time is less than half a millisecond, even for models with complex control flow constructs.", "num_citations": "7\n", "authors": ["618"]}
{"title": "Transforming collaborative process models into interface process models by applying an MDA approach\n", "abstract": " Collaborative business models among enterprises require defining collaborative business processes. Enterprises implement B2B collaborations to execute these processes. In B2B collaborations the integration and interoperability of processes and systems of the enterprises are required to support the execution of collaborative processes. From a collaborative process model, which describes the global view of the enterprise interactions, each enterprise must define the interface process that represents the role it performs in the collaborative process in order to implement the process in a Business Process Management System. Hence, in this work we propose a method for the automatic generation of the interface process model of each enterprise from a collaborative process model. This method is based on a Model-Driven Architecture to transform collaborative process models into interface process models …", "num_citations": "7\n", "authors": ["618"]}
{"title": "B2B relationships: Defining public business processes using interaction protocols\n", "abstract": " Several collaborative business models have appeared recently to improve supply chain management. They are supported by Business-to-Business (B2B) relationships among enterprises. The challenge of B2B applications is to fulfill the requirements of autonomy, decentralization, peer-to-peer interactions and negotiation imposed by collaborative models to manage public processes. In this work we describe the use of interaction protocols to define and manage public processes in B2B relationships. Different aspects for representing interaction protocols in the context of B2B relationships are discussed. In addition, we provide an example of a public process modeled with an interaction protocol, which is defined graphically using AUML and textually using ebXML BPSS. Finally, we include a discussion of the benefits of the interaction protocols for modeling public processes in B2B relationships.", "num_citations": "7\n", "authors": ["618"]}
{"title": "Perceived innovativeness and privacy risk of smart toys in Brazil and Argentina\n", "abstract": " A smart toy, such as \"Hello Barbie,\" is a device consisting of a physical toy component that connects to a computing system with online services through networking to enhance the functionality of a traditional toy. Whilst these are new educational and entertaining values of smart toys, experts in western countries such as U.S. and Germany have warned consumers of the data security and privacy issues of these toys. In this preliminary research study, we particularly studied Brazilian and Argentinian consumers’ perceived innovativeness, risks and benefits of smart toys and their purchase intention toward such toys. Results indicate that Brazilian consumers have better perception and evaluation of the toy and thus higher purchase intention than Argentinian consumers do. Such difference may be explained by the cultural differences be-tween the two countries, such as relatively low vs. high uncertainty avoidance.", "num_citations": "6\n", "authors": ["618"]}
{"title": "Verification of Models in a MDA Approach for Collaborative Business Processes.\n", "abstract": " The application of a MDA approach for the automatic generation of B2B specifications from collaborative business process models enables enterprises to implement B2B collaborations with their partners, reducing the costs, time and complexity in the generation of technological solutions. Because of collaborative processes describe the behavior of the interactions between the partners, an important issue is the verification of the correctness of these processes, such as the absence of deadlocks and livelocks. In this work we describe how collaborative process models can be verified exploiting the benefits of a MDA approach. We describe the formalization of collaborative process models defined with the UP-ColBPIP language by using Petri Nets and the transformations of UP-ColBPIP models into Petri Nets specifications. Thus, a formal semantics for collaborative process models is provided, which enables the verification of these models through tools for verification of Petri Nets.", "num_citations": "6\n", "authors": ["618"]}
{"title": "MDA Approach for Collaborative Business Processes: Generating Technological Solutions based on Web Services Composition.\n", "abstract": " In order to establish B2B Collaborations with their partners, enterprises have to focus on the modeling and specification of collaborative business processes and partners’ interfaces that compose the B2B information system. Currently, standards for web services composition are having more and more interest to specify and implement these processes and interfaces. In this paper, we propose a MDA approach to support the modeling of collaborative processes and the automatic generation of technological solutions based on web services composition. Particularly, we discuss the generation of specifications based on the BPEL standard, from collaborative process models defined with the language UP-ColBPIP. This language supports the conceptual modeling of technology-independent collaborative processes as interaction protocols. The rules to transform UP-ColBPIP models into BPEL specifications are defined.", "num_citations": "6\n", "authors": ["618"]}
{"title": "On the capabilities of bpmn for workflow activity patterns representation\n", "abstract": " This paper provides a complete version of the Workflow Activity Patterns (WAP) in the Business Process Modeling Notation (BPMN) as well as an extended evaluation of the capabilities of BPMN and their strengths and weaknesses when being utilizing for representing WAPs. When implementing the activity patterns in existing Business Process Modeling tools, it is fundamental to represent them in BPMN. This representation may facilitate the adoption of the WAPs by BPMN tools as well as the use of the WAPs in process design.", "num_citations": "5\n", "authors": ["618"]}
{"title": "Decentralized management model of a partner-to-partner collaborative relationship\n", "abstract": " In this work we describe a Partner-to-Partner integration model (P2P) for a collaborative relationship (n-1), whose objective is to allow the enterprise to jointly manage the material flow between them. In this model four main hierarchical collaboration processes are identified according to the planning level:(1) Collaboration frame agreement (clauses and rules definition),(2) Agreement on the production planning definition,(3) Agreement on the master production scheduling definition, and (4) Agreement on the material provision orders definition.The purpose is to define a continuous collaboration process between enterprises along all hierarchical planning levels, preserving the autonomy of enterprises. To this aim, the proposed collaboration process is managed in a decentralized way for each partner. The participation of each partner enterprise in the collaboration process, the information type and the decision flow to be exchanged in each process are defined in this work.", "num_citations": "5\n", "authors": ["618"]}
{"title": "Architecture to Support the Resource Perspective of BPEL Processes\n", "abstract": " This work proposes an extension to the WS-HumanTask architecture developed to provide support to the Resource Perspective of BPEL processes. The extension is aimed to overcome limitations identified in the support of BPEL4People and WS-HumanTask to recurrent Resource Perspective requirements described by the Workflow Resource Patterns and well known reference models of workflow management systems. These limitations have been identified through an assessment of BPEL4People and WS-HumanTask against a conceptual model enabling the representation of Resource Perspective requirements by defining three aspects: Resource Structure, Work Distribution and Authorization. The proposed extension specifies an autonomous People Directory component to be integrated with the Task Processor and the Task Client WS-HumanTask components. The behavior of the Task Processor and the Task Client is also extended in order to enable their interactions with the People Directory and to improve their support to the stated Resource Perspective aspects.Spanish abstractEste trabajo propone una extensión a la arquitectura WS-HumanTask desarrollada para proveer soporte a la Perspectiva de Recursos de procesos BPEL. La extensión fue definida para superar limitaciones identificadas en el soporte provisto por BPEL4People y WS-HumanTask a requerimientos recurrentes de la Perspectiva de Recursos descriptos por los Workflow Resource Patterns y modelos de referencia de sistemas de gestión de workflow ampliamente difundidos. Estas limitaciones fueron identificadas a través de una evaluación de BPEL4People y …", "num_citations": "4\n", "authors": ["618"]}
{"title": "An agent-based B2B collaboration platform for executing collaborative business processes\n", "abstract": " Nowadays, organizations establish Business-to-Business (B2B) collaborations with their business partners. Inter-organizational collaboration is carried out through the execution of collaborative business processes. Organizations are requiring and undergoing the setting up of dynamic B2B collaborations, instead of conducting face-to-face negotiations and agreements for executing collaborative processes. This implies that business partners, maybe without a previous relationship, agree dynamically on the execution of collaborative processes based on predefined models of these processes. In this work, we propose an B2B collaboration platform which provides agent-based systems and interaction mechanisms in order to enable organizations to establish dynamic agreements with their partners and carry out the decentralized execution of collaborative processes. Agents use models of collaborative …", "num_citations": "4\n", "authors": ["618"]}
{"title": "Decision support systems generator for industrial companies Module IV: Forecasting support system\n", "abstract": " In this work we present the architecture of a forecasting support system. This system is a part of a global decision support system generator that the GIDSATD is developing (Rico et al., 1997). First, we briefly describe the forecasting support system model base conformation, then we present an object oriented analysis and design of the forecasting support system.", "num_citations": "4\n", "authors": ["618"]}
{"title": "Institutional violence complaints in Argentina: A privacy study\n", "abstract": " Argentina is a federal republic located in South America. Despite Argentina’s redemocratization in 1983, conditions favoring human rights abuses still persist. Institutional violence refers to structured practices of human rights violation by state officials belonging to public institutions. In this paper, we outline and discuss privacy issues in institutional violence complaints in Argentina. To this aim, we defined a BPMN process model for registering victims’ complaints in a database, and proposed an approach to investigate the privacy of such process from a threat modeling perspective. With the approach, we identified privacy threats of information disclosure and content unawareness, and defined privacy requirements and controls needed to mitigate these threats.", "num_citations": "3\n", "authors": ["618"]}
{"title": "Towards Ontology-Based Anti-patterns for the Verification of Business Process Behavior\n", "abstract": " A business process model defines how an organization perform its activities. Since the incorrect definition of business processes behavior may increase costs and development time, it is required the verification of process behavior. Verification methods based on anti-patterns are a promising approach to deal with this issue, but their informal definition may lead to ambiguities and different interpretations of what problem a given anti-pattern represents, and how it should be applied or implemented to detect behavioral errors in process models. The aim of this paper is to assess the feasibility of business process behavior verification by means of the ontological specification of behavioral anti-patterns. The study is based on the detection of anti-patterns in a BPMN process model by exploiting a set of standard ontological reasoning services.", "num_citations": "3\n", "authors": ["618"]}
{"title": "A Tool for Model-Driven Development of Collaborative Business Processes\n", "abstract": " New management models encourage enterprises setting up collaborative relationships with their partners through Business-to-Business (B2B) solutions. This requires the modeling and specification of collaborative business processes that define the global view and behavior of the interenterprise collaboration. In order to provide a development environment that enables the development of B2B solutions, in this work we propose a tool that supports a model-driven development method for modeling, verification and specification of collaborative business processes. The tool consists of a set of plug-ins for the Eclipse platform. On one hand, we discuss the development of a set of graphical editor plug-ins that support the visual modeling of collaborative processes by using the UP-ColBPIP Language. On the other hand, we discuss the implementation of a model transformation machine that supports the model transformations required to generate Petri Net specifications for verifying the correctness of collaborative process models.", "num_citations": "3\n", "authors": ["618"]}
{"title": "Collaborative Business Process Management Through a Platform Based on Cloud Computing\n", "abstract": " With the wide adoption of the Internet, organizations establish collaborative networks to executeCollaborative Business Processes (CBPs). Current approaches to implement Process-AwareInformation Systems (PAISs) for executing CBPs have shortcomings: high costs and complexityof IT infrastructure to deploy the PAISs; poor support for organization autonomy, decentralizedexecution, global view of message exchange, and peer-to-peer interactions; and rigid platformsfor generating and deploying PAISs on-demand according to the CBPs agreed in collaborativenetworks. To overcome these issues, this work proposes a cloud-based platform for the executionof CBPs. The architecture of the platform with the components and interactions between themare described. The architecture enables the generation and deployment on-demand of the PAISsof the organizations required to implement the agreed CBPs, as well as the execution on-demandof these CBPs by fulfilling the above mentioned issues. The platform also provides approachesto deal with elasticity, privacy, and portability concerns.", "num_citations": "2\n", "authors": ["618"]}
{"title": "Agents for managing business-to-business interactions\n", "abstract": " Current market opportunities and the growth of new Internet technologies encourage organizations to dynamically establish Business-to-Business (B2B) collaborations. B2B interactions are carried out by executing collaborative business processes among the parties. In this work we propose B2B collaboration agents for managing B2B interactions that allow organizations to dynamically establish collaborations and execute collaborative processes with their partners. The planning and execution of the actions of the agents that execute collaborative processes are driven by a Petri Net engine embedded in these agents. The role an organization fulfills in a collaborative process is represented by a high-level Petri Net model which is used to drive the behavior of the B2B collaboration agents representing the organization. Moreover, interaction protocols representing collaborative processes are executed by these agents without the need for protocols defined at design-time. Finally, an implementation of the B2B agents is presented.", "num_citations": "2\n", "authors": ["618"]}
{"title": "Verification of Structured Processes: A Method Based on an Unsoundness Profile\n", "abstract": " The verification of business processes has been widely studied in the last two decades achieving significant results. Despite this, existing verification techniques based on state space exploration suffer, for large processes, the state space explosion problem. New techniques improved verification performance by structuring processes as trees. However, they do not support complex constructs for advanced synchronization and exception management. To cope with this issue we propose the definition of an unsoundness profile of a given process language, which specifies all possible combinations of control flow constructs that can lead to errors in the behavior of structured processes defined with such a language. In addition, we introduce the sequential and hierarchical soundness properties, which make use of this profile to determine soundness of a structured process with complex constructs in polynomial time. As an example, we defined an unsoundness profile for a subset of the BPMN language and verified the behavior of a BPMN process model.", "num_citations": "1\n", "authors": ["618"]}
{"title": "Método para el modelado y especificación de procesos de negocio colaborativos\n", "abstract": " El modelado y la especificación de los procesos de negocio colaborativos constituyen un desafío importante para que las empresas puedan establecer colaboraciones Business-to-Business. El objetivo de esta tesis es definir y proponer un método robusto y sistemático que de soporte al desarrollo de procesos colaborativos, desde el modelado de los mismos, hasta la especificación de dichos procesos y de las interfaces de las empresas que conforman el sistema de información Business-toBusiness, en una tecnología particular. El método está basado en la filosofía del desarrollo conducido por modelos y fundamentalmente, en los principios y guías de la Arquitectura Conducida por Modelos. Como parte de este método, se propone el lenguaje de modelado UP-ColBPIP, para dar soporte al análisis y diseño de los procesos colaborativos. El lenguaje está basado en el concepto de protocolos de interacción para definir procesos colaborativos independientes de la tecnología. Además, se propone un método y una herramienta para definir y ejecutar transformaciones de modelos de procesos colaborativos en especificaciones basadas en un estándar Business-toBusiness. Finalmente, se definen las transformaciones que posibilitan generar, a partir de modelos definidos con UP-ColBPIP, soluciones tecnologías con dos tipos diferentes de estándares Business-to-Business.", "num_citations": "1\n", "authors": ["618"]}