{"title": "Secure tropos: a security-oriented extension of the tropos methodology\n", "abstract": " Although security plays an important role in the development of multiagent systems, a careful analysis of software development processes shows that the definition of security requirements is, usually considered after the design of the system. One of the reasons is the fact that agent oriented software engineering methodologies have not integrated security concerns throughout their developing stages. The integration of security concerns during the whole range of the development stages can help in the development of more secure multiagent systems. In this paper we introduce extensions to the Tropos methodology to enable it to model security concerns throughout the whole development process. A description of the new concepts and modelling activities is given together with a discussion on how these concepts and modelling activities are integrated to the current stages of Tropos. A real life case study from the …", "num_citations": "453\n", "authors": ["1449"]}
{"title": "A goal-based framework for contextual requirements modeling and analysis\n", "abstract": " Requirements engineering (RE) research often ignores or presumes a uniform nature of the context in which the system operates. This assumption is no longer valid in emerging computing paradigms, such as ambient, pervasive and ubiquitous computing, where it is essential to monitor and adapt to an inherently varying context. Besides influencing the software, context may influence stakeholders’ goals and their choices to meet them. In this paper, we propose a goal-oriented RE modeling and reasoning framework for systems operating in varying contexts. We introduce contextual goal models to relate goals and contexts; context analysis to refine contexts and identify ways to verify them; reasoning techniques to derive requirements reflecting the context and users priorities at runtime; and finally, design time reasoning techniques to derive requirements for a system to be developed at minimum cost and …", "num_citations": "278\n", "authors": ["1449"]}
{"title": "Goal-oriented requirement analysis for data warehouse design\n", "abstract": " Several surveys indicate that a significant percentage of data warehouses fail to meet business objectives or are outright failures. One of the reasons for this is that requirement analysis is typically overlooked in real projects. In this paper we propose a goal-oriented approach to requirement analysis for data warehouses, based on the Tropos methodology. Two different perspectives are integrated for requirement analysis: organizational modeling, centered on stakeholders, and decisional modeling, focused on decision makers. Our approach can be employed within both a demand-driven and a mixed supply/demand-driven design framework: in the second case, while the operational sources are still explored to shape hierarchies, user requirements play a fundamental role in restricting the area of interest for analysis and in choosing facts, dimensions, and measures. The methodology proposed, supported by a …", "num_citations": "272\n", "authors": ["1449"]}
{"title": "GRAnD: A goal-oriented approach to requirement analysis in data warehouses\n", "abstract": " Several surveys indicate that a significant percentage of data warehouses fail to meet business objectives or are outright failures. One of the reasons for this is that requirement analysis is typically overlooked in real projects. In this paper we propose GRAnD, a goal-oriented approach to requirement analysis for data warehouses based on the Tropos methodology. Two different perspectives are integrated for requirement analysis: organizational modeling, centered on stakeholders, and decisional modeling, focused on decision makers. Our approach can be employed within both a demand-driven and a mixed supply/demand-driven design framework.", "num_citations": "257\n", "authors": ["1449"]}
{"title": "When security meets software engineering: a case of modelling secure information systems\n", "abstract": " Although security is a crucial issue for information systems, traditionally, it is considered after the definition of the system. This approach often leads to problems, which most of the times translate into security vulnerabilities. From the viewpoint of the traditional security paradigm, it should be possible to eliminate such problems through better integration of security and software engineering. This paper firstly argues for the need to develop a methodology that considers security as an integral part of the whole system development process, and secondly it contributes to the current state of the art by proposing an approach that considers security concerns as an integral part of the entire system development process and by relating this approach with existing work. The different stages of the approach are described with the aid of a real-life case study; a health and social care information system.", "num_citations": "168\n", "authors": ["1449"]}
{"title": "Integrating security and systems engineering: Towards the modelling of secure information systems\n", "abstract": " Security is a crucial issue for information systems. Traditionally, security is considered after the definition of the system. However, this approach often leads to problems, which translate into security vulnerabilities. From the viewpoint of the traditional security paradigm, it should be possible to eliminate such problems through better integration of security and systems engineering. This paper argues for the need to develop a methodology that considers security as an integral part of the whole system development process. The paper contributes to the current state of the art by proposing an approach that considers security concerns as an integral part of the entire system development process and by relating this approach with existing work. The different stages of the approach are described with the aid of a case study; a health and social care information system.", "num_citations": "166\n", "authors": ["1449"]}
{"title": "Separation of concerns in multi-agent systems: An empirical study\n", "abstract": " With multi-agent systems (MASs) growing in size and complexity, the separation of their concerns throughout the different development phases is crucial to MAS engineers. Separation of concerns is a well-known principle in software engineering to achieve improved reusability and maintainability of complex software. Hence it is necessary to investigate systematically whether abstractions from object-oriented (OO) software engineering are able to isolate explicitly MAS concerns. This paper presents an empirical study that evaluates the degree to which abstractions associated with two OO techniques enable modularization of MAS concerns. The selected techniques involve basic OO abstractions, such as classes and objects, and more sophisticated ones, namely design patterns and aspects. The gathered results shown that the use of aspects allowed the construction of a MAS with a significant …", "num_citations": "124\n", "authors": ["1449"]}
{"title": "Modelling risk and identifying countermeasure in organizations\n", "abstract": " Modelling and analysing risk is one of the most critical activity in system engineering. However, in literature approaches like Fault Tree Analysis, Event Tree Analysis, Failure Modes and Criticality Analysis focus on the system-to-be without considering the impact of the associated risks to the organization where the system will operate. The Tropos framework has been proved effective in modelling strategic interests of the stakeholders at organizational level. In this paper, we introduce the extended Tropos goal model to analyse risk at organization level and we illustrate a number of different techniques to help the analyst in identifying and enumerating relevant countermeasures for risk mitigation.", "num_citations": "102\n", "authors": ["1449"]}
{"title": "Modelling secure multiagent systems\n", "abstract": " Security plays an important role in the development of multiagent systems. However, a careful analysis of software development processes shows that the definition of security requirements is, usually, considered after the design of the system. This is, mainly, due to the fact that agent oriented software engineering methodologies have not integrated security concerns throughout their developing stages. The integration of security concerns during the whole range of the development stages could help towards the development of more secure multiagent systems. In this paper we introduce extensions to the Tropos methodology to enable it to model security concerns throughout the whole development process. A description of the new concepts is given along with an explanation of how these concepts are integrated to the current stages of Tropos. An example from the health care sector is used to illustrate the above.", "num_citations": "93\n", "authors": ["1449"]}
{"title": "A formal definition of culture\n", "abstract": " Globalization makes culture no more bound to a geographical area, race or religion as was previously considered in anthropology. With the advent of Web 2.0 it becomes appropriate to speak about the culture of online communities in general, without specific ties to country or nation. Multi-national companies, software developers, scientists need to take into account cultural differences when delivering products to people. The first step in dealing with culture consists in defining and representing culture of the targeted community. AI literature addressed issues of sociality, collaboration, and coordination in agent societies, but did not target the problem of defining and representing culture of a community. This chapter presents a formal definition of culture of a set of agents. The proposed definition generalizes existing definitions of culture and it is operational in the sense that it can be applied for characterization …", "num_citations": "92\n", "authors": ["1449"]}
{"title": "Implicit an agent-based recommendation system for web search\n", "abstract": " The number of web pages available on Internet increases day after day, and consequently finding relevant information becomes more and more a hard task. However, when we consider communities of people with common interests, it is possible to improve the quality of the query results using knowledge extracted from the observed behaviors of the single users. In this paper we propose an agent-based recommendation system for supporting communities of people in searching the web by means of a popular search engine. Agents use data mining techniques in order to learn and discover users' behaviors, and they interact one another to share knowledge about their users. The paper presents also a set of experimental results showing, in terms of precision and recall, how agents interaction increases the performance of the overall system.", "num_citations": "87\n", "authors": ["1449"]}
{"title": "A natural extension of tropos methodology for modelling security\n", "abstract": " Although security is an important issue when developing complex computerised systems, very little work has been done in integrating security concerns in the agentoriented methodologies. This paper introduces extensions to the Tropos methodology to accommodate security. A description of new concepts is given along with an explanation of how these concepts are integrated to the current stages of Tropos. The above is illustrated using an agent-based health and social care information system as a case study.", "num_citations": "82\n", "authors": ["1449"]}
{"title": "Modelling security and trust with secure tropos\n", "abstract": " Although the concepts of security and trust play an important issue in the development of information systems, they have been mainly neglected by software engineering methodologies. In this chapter, we present an approach that considers security and trust throughout the software development process. Our approach integrates two prominent software engineering approaches, one that provides a security-oriented process and one that provides a trust management process. The result is the de-velopment of a methodology that considers security and trust issues as part of its development process. Such integration represents an advance over the current state of the art by providing the? rst effort to consider security and trust issues under a single software engineering methodology. A case study from the health domain is employed to illustrate our approach.", "num_citations": "81\n", "authors": ["1449"]}
{"title": "An ontology for modelling security: The tropos approach\n", "abstract": " It has been argued that security concerns should inform all the stages of the development process of an agent-based system. However, this is not the case since current agent-oriented methodologies do not, usually, consider security concepts within their modelling ontology. In this paper we present extensions to the Tropos ontology to enable it to model security.", "num_citations": "81\n", "authors": ["1449"]}
{"title": "Reasoning with contextual requirements: Detecting inconsistency and conflicts\n", "abstract": " ContextThe environment in which the system operates, its context, is variable. The autonomous ability of a software to adapt to context has to be planned since the requirements analysis stage as a strong mutual influence between requirements and context does exist. On the one hand, context is a main factor to decide whether to activate a requirement, the applicable alternatives to meet an activated requirement as well as their qualities. On the other hand, the system actions to reach requirements could cause changes in the context.ObjectivesModelling the relationship between requirements and context is a complex task and developing error-free models is hard to achieve without an automated support. The main objective of this paper is to develop a set of automated analysis mechanisms to support the requirements engineers to detect and analyze modelling errors in contextual requirements models.MethodWe …", "num_citations": "77\n", "authors": ["1449"]}
{"title": "Improving web service discovery with usage data\n", "abstract": " Service-oriented computing and Web services are becoming more popular, enabling organizations to use the Web as a market for selling their own services and consuming existing services from others. Nevertheless, the more services are available, the more difficult it becomes to find the most appropriate service for a specific application. Existing approaches to Web service discovery tend to address different information-processing styles. However, Web services have functional and nonfunctional characteristics that can be difficult to present and control. Service behavior and quality-of-service (QoS) parameters can vary over time, and new services can emerge in certain business areas.", "num_citations": "69\n", "authors": ["1449"]}
{"title": "Security Attack Testing (SAT)—testing the security of information systems at design time\n", "abstract": " For the last few years a considerable number of efforts have been devoted into integrating security issues into information systems development practices. This has led to a number of languages, methods, methodologies and techniques for considering security issues during the developmental stages of an information system. However, these approaches mainly focus on security requirements elicitation, analysis and design issues and neglect testing. This paper presents the Security Attack Testing (SAT) approach, a novel scenario-based approach that tests the security of an information system at the design time. The approach is illustrated with the aid of a real-life case study involving the development of a health and social care information system.", "num_citations": "67\n", "authors": ["1449"]}
{"title": "Applying the Tropos methodology for analysing web services requirements and reasoning about Qualities of Services\n", "abstract": " The shift in software engineering from the design, implementation and management of isolated software elements towards a network of autonomous interoperable service is calling for a shift in the way software is designed. We propose the use of the agent-oriented methodology Tropos for the analysis of web service requirements. We show how the Tropos methodology adapts to the case of web services and in particular how it can be used to model quality of service requirements.   We base the investigation on a representative case study in the retailing industry.", "num_citations": "62\n", "authors": ["1449"]}
{"title": "Modeling and verifying security policies in business processes\n", "abstract": " Modern information systems are large-sized and comprise multiple heterogeneous and autonomous components. Autonomy enables decentralization, but it also implies that components providers are free to change, retire, or introduce new components. This is a threat to security, and calls for a continuous verification process to ensure compliance with security policies. Existing verification frameworks either have limited expressiveness—thereby inhibiting the specification of real-world requirements—, or rely on formal languages that are hardly employable for modeling and verifying large systems. In this paper, we overcome the limitations of existing approaches by proposing a framework that enables: (1) specifying information systems in SecBPMN, a security-oriented extension of BPMN; (2) expressing security policies through SecBPMN-Q, a query language for representing security policies; and (3 …", "num_citations": "61\n", "authors": ["1449"]}
{"title": "Belief revision through the belief-function formalism in a multi-agent environment\n", "abstract": " The abilities of detecting contradictions and rearranging the cognitive space in order to cope with them are important to be embedded in the BDI architecture of an agent acting in a complex and dynamic world. However, to be accomplished in a multi-agent environment, “belief revision” must depart considerably from its original definitions. According to us, the main changes should be the following ones:                                    1.                                         replacing the “priority to the incoming information principle” with the “recoverability principle”: any previously believed piece of information must belong to the current cognitive state whenever it is possible                                                                        2.                                         dealing not just with pieces of information but with couples <source, information> since the reliability of the source affects the credibility of the information and vice-versa …", "num_citations": "61\n", "authors": ["1449"]}
{"title": "A goal modeling framework for self-contextualizable software\n", "abstract": " Self-contextualizability refers to the system ability to autonomously adapt its behaviour to context in order to maintain its objectives satisfied. In this paper, we propose a modeling framework to deal with self-contextualizability at the requirements level. We use Tropos goal models to express requirements; we provide constructs to analyse and represent context at each variation point of the goal model; and we exploit the goal and context analysis to define how the system satisfies its requirements in different contexts. Tropos goal analysis provides constructs to hierarchically analyse goals and discover alternative sets of tasks the system can execute to satisfy goals; our framework extends Tropos goal model by considering context at its variation points, and provides constructs to hierarchically analyse context and discover alternative sets of facts the system has to monitor to verify a context. A self …", "num_citations": "59\n", "authors": ["1449"]}
{"title": "Security patterns for agent systems\n", "abstract": " Security patterns capture the experiences of experts, allowing novices to rely on expert knowledge and solve security problems in a more systematic and structured way. So far, literature provides many examples of security patterns for object-oriented systems. However, no attempt has been made to document security patterns for multiagent systems. In this paper we present a set of patterns for secure agent systems that, currently, consisting of four patterns.", "num_citations": "57\n", "authors": ["1449"]}
{"title": "Business processes contextualisation via context analysis\n", "abstract": " Context-awareness has emerged as a new perspective for business process modelling. Even though some works have studied it, many challenges have not been addressed yet. There is a clear need for approaches that (i) facilitate the identification of the context properties that influence a business process and (ii) provide guidance for correct modelling of contextualised business processes. This paper addresses this need by defining an approach for business process contextualisation via context analysis, a technique that supports reasoning about context and discovery of its relevant properties. The approach facilitates adequate specification of context variants and of business process execution for them. As a result, we obtain business processes that fit their context and are correct.", "num_citations": "45\n", "authors": ["1449"]}
{"title": "Agent-oriented methodologies: an introduction\n", "abstract": " As an introduction to agent-oriented (AO) methodologies, we first describe the characteristics of both agents and multi-agent systems (MASs). This leads to a discussion of what makes an AO methodology that can be used to build an MAS. Finally, we briefly introduce the ten methodologies that are described in the remaining chapters in this book.", "num_citations": "43\n", "authors": ["1449"]}
{"title": "Implicit culture for multi-agent interaction support\n", "abstract": " Implicit Culture is the relation between a set and a group of agents such that the elements of the set behave according to the culture of the group. Earlier work claimed that supporting Implicit Culture phenomena can be useful in both artificial and human agents. In this paper, we recall the concept of Implicit Culture, present an implementation of a System for Implicit Culture Support (SICS) for multi-agent systems, and show how to use it for supporting agent interaction. We also present the application of the SICS to the eCulture Brokering System, a multi-agent system designed to mediate access to cultural information.", "num_citations": "41\n", "authors": ["1449"]}
{"title": "Distributed belief revision versus distributed truth maintenance\n", "abstract": " This paper outlines a distinction between distributed truth maintenance and distributed belief revision. The latter has a more complex conceptualization than the former and it needs the evaluation of special features as the relationship between the informant's reliability and the information's credibility. We point out some criteria to judge the qualities of a distributed belief revision strategy from a global perspective. However, the performances of such a strategy can be estimated only on a simulation basis. The general framework for assumption-based distributed belief revision that we present has been tested on our specific \"CLUEDO\" multi-agent simulation testbed. The model has been continuously improved during many cycles of modification of the model, simulation, and evaluation of the performances, till the results presented in this paper are achieved.< >", "num_citations": "39\n", "authors": ["1449"]}
{"title": "Requirements evolution: from assumptions to reality\n", "abstract": " Requirements evolution is a main driver for systems evolution. Traditionally, requirements evolution is associated to changes in the users’ needs and environments. In this paper, we explore another cause for requirements evolution: assumptions. Requirements engineers often make assumptions stating, for example, that satisfying certain sub-requirements and/or correctly executing certain system functionalities would lead to reach a certain requirement. However, assumptions might be, or eventually become, invalid. We outline an approach to monitor, at runtime, the assumptions in a requirements model and to evolve the model to reflect the validity level of such assumptions. We introduce two types of requirements evolution: autonomic (which evolves the priorities of system alternatives based on their success/failure in meeting requirements) and designer-supported (which detects loci in the requirements …", "num_citations": "38\n", "authors": ["1449"]}
{"title": "Mental states recognition from communication\n", "abstract": " In order to perform effective communication, agents must be able to foresee the effects of their utterances on the addressee's mental state. In this paper we study the consequences of an utterance on the mental state of a hearer. Given an agent communication language with a STRIPS‐like semantics, we propose a set of criteria that allow the binding of the speaker's mental state to its uttering of a certain sentence. On the basis of these criteria, we give an abductive procedure that the hearer can adopt to partially recognize the speaker's mental state that led to a specific utterance.", "num_citations": "38\n", "authors": ["1449"]}
{"title": "An approach to using degrees of belief in BDI agents\n", "abstract": " The past few years have seen a rise in the popularity of the use of mentalistic attitudes such as beliefs, desires and intentions to describe intelligent agents. Many of the models which formalise such attitudes do not admit degrees of belief, desire and intention. We see this as an understandable simplification, but as a simplification which means that the resulting systems cannot take account of much of the useful information which helps to guide human reasoning about the world. This paper starts to develop a more sophisticated system based upon an existing formal model of these mental attributes.", "num_citations": "38\n", "authors": ["1449"]}
{"title": "Analyzing business continuity through a multi-layers model\n", "abstract": " Business Continuity Management (BCM) is a process to manage risks, emergencies, and recovery plans of an organization during a crisis. It results in a document called Business Continuity Plans (BCP) that specifies the methodology and procedures required to backup and recover the functional unit of a disrupted business. Traditionally, the BCP assessment is based only on the continuity of IS infrastructures and does not consider possible relations with the business objectives and business processes. This traditional approach assumes that the risk of business continuity is resulted from the disruption of the IS infrastructures. However, we believe there are situations where the risk emerges even the infrastructures up and running. Moreover, the lack of modeling framework and the aided-tool make the process even harder.               In this paper, we propose a framework to support modeling and analysis of …", "num_citations": "37\n", "authors": ["1449"]}
{"title": "Agent based digital libraries: decentralization and coordination\n", "abstract": " This article describes agent-based systems and explains why digital libraries should be built with this type of architecture. The primary advantage of agent-based architecture is decentralization, which enables scaling, flexibility, and extensibility. The corresponding requirement is the need to coordinate agent activity. We describe the approach taken by the University of Michigan Digital Library project.", "num_citations": "37\n", "authors": ["1449"]}
{"title": "Modeling and reasoning about information quality requirements in business processes\n", "abstract": " Information Quality (IQ) is particularly important for the successful and efficient execution of any Business Process (BP). Despite this, most existing BP approaches either ignore IQ needs, or they deal with them as mere technical issues, without considering the social and organizational aspects that underlie such needs. In this paper, we propose a goal-oriented approach to capture IQ requirements (needs) and map these requirements into workflow net (WFA-net) that is a formal language for modeling and analyzing IQ requirements in BP. We illustrate our approach with an example concerning a stock market system.", "num_citations": "36\n", "authors": ["1449"]}
{"title": "Location-based software modeling and analysis: Tropos-based approach\n", "abstract": " The continuous growth of interest in mobile applications makes the concept of location essential to design and develop software systems. Location-based software is supposed to be able to monitor the surrounding location and choose accordingly the most appropriate behavior. In this paper, we propose a novel conceptual framework to model and analyze location-based software. We mainly focus on the social facets of location adopting concepts such as actor, resource, and location-based behavior. Our approach is based on Tropos methodology and allows the analyst to elicit and model software requirements according to the different locations where the software will operate. We propose an extension of Tropos modeling and adapt its process to suit well with the development of location-based software. The proposed framework also includes automated analysis techniques to reason about the relation …", "num_citations": "36\n", "authors": ["1449"]}
{"title": "Designing secure business processes with SecBPMN\n", "abstract": " Modern information systems are increasingly large and consist of an interplay of technical components and social actors (humans and organizations). Such interplay threatens the security of the overall system and calls for verification techniques that enable determining compliance with security policies. Existing verification frameworks either have a limited expressiveness that inhibits the specification of real-world requirements or rely on formal languages that are difficult to use for most analysts. In this paper, we overcome the limitations of existing approaches by presenting the SecBPMN framework. Our proposal includes: (1) the SecBPMN-ml modeling language, a security-oriented extension of BPMN for specifying composite information systems; (2) the SecBPMN-Q query language for representing security policies; and (3) a query engine that enables checking SecBPMN-Q policies against SecBPMN-ml …", "num_citations": "34\n", "authors": ["1449"]}
{"title": "Distributed belief revision\n", "abstract": " In this paper, a distributed approach to belief revision is presented. It is conceived as a collective activity of a group of interacting agents, in which each component contributes with its own local beliefs. The integration of the different opinions is performed not by an external supervisor, but by the entire group through an election mechanism. Each agent exchanges information with the other components and uses a local belief revision mechanism to maintain its cognitive state consistent. We propose a model for local belief revision/integration based on what we called: “Principle of Recoverability.” Computationally, our way to belief revision consists of three steps acting on the symbolic part of the information, so as to deal with consistency and derivation, and two other steps working with the numerical weight of the information, so as to deal with uncertainty. In order to evaluate and compare the characteristics and …", "num_citations": "34\n", "authors": ["1449"]}
{"title": "From collaborative filtering to implicit culture\n", "abstract": " Collaborative Filtering bases its e ectiveness as a recommender system on ratings about a set of items provided by a set of users. In our perspective, an agent behaves as a member of a group would do (the agent implicitly belongs to the same\\culture\" of the group) without extra-e ort or direct interaction. In this paper, we introduce the concept of Implicit Culture and propose a general architecture for Systems for Implicit Culture Support. We show how Collaborative Filtering can be considered as an instance of our architecture, and nally, we consider the related work.", "num_citations": "34\n", "authors": ["1449"]}
{"title": "IC-Service: A service-oriented approach to the development of recommendation systems\n", "abstract": " Recommendation systems have proven to be useful in various application domains. However, current solutions are usually ad-hoc systems which are tightly-coupled with the application domain. We present the IC-Service, a recommendation service that can be included in any system in a loosely coupled way. The implementation follows the principles of service oriented computing and provides a solution to various problems arising in recommendation systems, eg to the problem of meta-recommendation systems development. Moreover, when properly configured, the IC-Service can be used by different applications (clients), and several independent instances of the IC-Service can collaborate to produce better recommendations. Service architecture and communication protocols are presented. The paper describes also ongoing work and applications based on the IC-Service.", "num_citations": "33\n", "authors": ["1449"]}
{"title": "Context for goal-level product line derivation\n", "abstract": " Product line engineering aims at developing a family of products and facilitating the derivation of product variants from it. Context can be a main factor in determining what products to derive. Yet, there is gap in incorporating context with variability models. We advocate that, in the first place, variability originates from human intentions and choices even before software systems are constructed, and context influences variability at this intentional level before the functional one. Thus, we propose to analyze variability at an early phase of analysis adopting the intentional ontology of goal models, and studying how context can influence such variability. Below we present a classification of variation points on goal models, analyze their relation with context, and show the process of constructing and maintaining the models. Our approach is illustrated with an example of a smarthome for people with dementia problems.", "num_citations": "32\n", "authors": ["1449"]}
{"title": "Multi-agent systems and security requirements analysis\n", "abstract": " Agent Oriented Software Engineering (AOSE) is a software paradigm that has grasped the attention of researchers the last few years. As a result, many different methods have been introduced to help developers in the development of multi-agent systems. However, so far, these methods have mainly neglected security requirements. The common approach towards the inclusion of security within a system is to identify security requirements after the definition of the system. However, this approach has provoked the emergence of computer systems afflicted with security vulnerabilities. In this paper we propose an analysis, based on the measures of criticality (how critical an actor of the system is) and complexity (represents the effort required by the actors of the system to achieve the requirements that have been imposed to them), which aims to identify possible bottlenecks of a multi-agent system with respect to …", "num_citations": "32\n", "authors": ["1449"]}
{"title": "Revising beliefs received from multiple sources\n", "abstract": " During the last decade, the logical framework layed down by Alchourrón, Gärdenfors and Makinson [1985] deeply influenced the notion of belief revision. Conceiving both, the knowledge space K and incoming information p, as sentences of a propositional language L, they introduced three rational principles for the revision operator (*):                      AGM1 Consistency: K*p must be consistent                     AGM2 Minimal Change: K*p should alter as little as possible K                                          AGM3 Priority to the Incoming Information: p must belong to K*p", "num_citations": "31\n", "authors": ["1449"]}
{"title": "Using security attack scenarios to analyse security during information systems design\n", "abstract": " It has been widely argued in the literature that security concerns should be integrated with software engineering practices. However, only recently work has been initiated towards this direction. Most of this work, however, only considers how security can be analysed during the development lifecycles and not how the security of an information system can be tested during the analysis and design stages. In this paper we present results from the development of a technique, which is based on the use of scenarios, to test the reaction of an information system against potential security attacks.", "num_citations": "29\n", "authors": ["1449"]}
{"title": "Using risk analysis to evaluate design alternatives\n", "abstract": " Recently, multi-agent systems have proved to be a suitable approach to the development of real-life information systems. In particular, they are used in the domain of safety critical systems where availability and reliability are crucial. For these systems, the ability to mitigate risk (e.g., failures, exceptional events) is very important. In this paper, we propose to incorporate risk concerns into the process of a multi-agent system design and describe the process of exploring and evaluating design alternatives based on risk-related metrics. We illustrate the proposed approach using an Air Traffic Management case study.", "num_citations": "28\n", "authors": ["1449"]}
{"title": "Enhancing Agent OPEN with concepts used in the Tropos methodology\n", "abstract": " Object technology has been supporting the development of information systems for many years but is now slowly evolving to encompass more recent ideas relating to the concept of “agent”. Integrating agent concepts into existing OO methodologies has resulted in several agent-oriented methodologies, one of which is Agent OPEN. In this paper, we evaluate the existing Agent OPEN description against ideas formulated within Tropos, an agent-oriented software development methodology.", "num_citations": "28\n", "authors": ["1449"]}
{"title": "Toward GDPR-compliant socio-technical systems: modeling language and reasoning framework\n", "abstract": " Privacy is a key aspect for the European Union (EU), where it is regulated by a specific law, the General Data Protection Regulation (GDPR). Compliance to the GDPR is a problem for organizations, it imposes strict constraints whenever they deal with personal data and, in case of infringement, it specifies severe consequences such as legal and monetary penalties. Such organizations frequently are complex systems, where personal data is processed by humans and technical services. Therefore, it becomes fundamental to consider privacy from the social perspective when designing such system, i.e., when relations between different components are specified. This is, indeed, also specified in the GDPR, which encourages to apply privacy-by-design principles. This paper proposes a method to support the design of GDPR compliant systems, based on a socio-technical approach composed of a modeling …", "num_citations": "27\n", "authors": ["1449"]}
{"title": "Enhancing secure tropos to effectively deal with security requirements in the development of multiagent systems\n", "abstract": " The consideration of security requirements in the development of multi-agent systems is a very difficult task. However, only few approaches have been proposed that try to integrate security issues as internal part of the development process. Amongst them, secure Tropos has been proposed as a structured approach towards the consideration of security issues in the development of multiagent systems. In this paper we enhance secure Tropos by integrating to its stages: (i) a process for selecting amongst alternative architectural styles using as criteria the security requirements of the system; (ii) a pattern-based approach to transform security requirements to design, and (iii) a security attack scenarios approach to test the developed solution. The electronic single assessment process (eSAP) case study is used to illustrate our approach.", "num_citations": "27\n", "authors": ["1449"]}
{"title": "Using tropos methodology to model an integrated health assessment system\n", "abstract": " This paper presents a case study to illustrate the features and the stages of the Tropos methodology. Tropos is an agent-oriented software engineering methodology that covers four development stages: early and late requirements analysis, architectural design and detail design. The electronic Single Assessment Process (eSAP), and electronic system to deliver the integrated health assessment of health and social care needs of older people is used as the case study throughout the paper. Furthermore, a preliminary analysis on extending Tropos to accommodate security concerns is presented.", "num_citations": "27\n", "authors": ["1449"]}
{"title": "COMPRO: a methodological approach for business process contextualisation\n", "abstract": " Context-awareness has emerged as a new perspective for business process modelling. Business processes are strongly influenced by context, the environment where they are executed, and thus context should not be ignored when modelling them. This calls for new approaches that facilitate contextualisation, i.e. identification and representation of the way context influences a business process. In addition, detailed methodological guidance for correct business process contextualisation should be provided. However, existing works on context-aware business process modelling do not deal with these challenges. This paper addresses them by presenting COMPRO, a methodological approach for business process contextualisation. Starting from an initial business process model, context is analysed in order to discover its relevant variations and specify their effect on a business process. Our approach helps …", "num_citations": "25\n", "authors": ["1449"]}
{"title": "Auctions negotiation for mobile rideshare service\n", "abstract": " Rideshare systems allow a substantial number of people to mutually benefit from using less cars in a specific region. This would rationalize energy consumption, save money, and decrease traffic jams and pollution. However, accessibility issues have prevented these architectures from being widely spread. In this paper, we present an agent-based rideshare system that is accessible via lightweight devices. We use auction mechanism as a method of negotiation among autonomous and proactive agents, by this we aim at accelerating agents' interactions while resolving end-user composite tasks.", "num_citations": "25\n", "authors": ["1449"]}
{"title": "A multi-agent system that facilitates scientific publications search\n", "abstract": " It is very difficult for beginners to define and find the most relevant literature in a research field. They can search on the web or look at the most important journals and conference proceedings, but it would be much better to receive suggestions directly from experts of the field. Unfortunately, this is not always possible and systems like CiteSeer and GoogleScholar become extremely useful for beginners (and not only). In this paper, we present an agent-based system that facilitates scientific publications search. Users interacting with their personal agents produce a transfer of knowledge about relevant publications from experts to beginners. Each personal agent observes how publications are used and induces behavioral patterns that are used to create more effective recommendations. Feedback exchange allows agents to share their knowledge and virtual communities of cloned experts can be created to support …", "num_citations": "24\n", "authors": ["1449"]}
{"title": "Self-configuring socio-technical systems: Redesign at runtime\n", "abstract": " Modern information systems are becoming more and more socio-technical systems, namely systems composed of human (social) agents and software (technical) systems operating together in a common environment. The structure of such systems has to evolve dynamically in response to the changes of the environment. When new requirements are introduced, when an actor leaves the system or when a new actor comes, the socio-technical structure needs to be redesigned and revised. In this paper, an approach to dynamic reconfiguration of a socio-technical system structure in response to internal or external changes is proposed. The approach is based on planning techniques for generating possible alternative configurations, and local strategies for their evaluation. The reconfiguration mechanism is presented, which makes the socio-technical system self-configuring, and the approach is discussed and analyzed on a simple case study.", "num_citations": "24\n", "authors": ["1449"]}
{"title": "Lung ultrasonography for early management of patients with respiratory symptoms during COVID-19 pandemic\n", "abstract": " COVID-19 pandemic is representing a serious challenge to worldwide public health. Lung Ultrasonography (LUS) has been signaled as a potential useful tool in this pandemic contest either to intercept viral pneumonia or to foster alternative paths. LUS could be useful in determining early lung involvement suggestive or not of COVID-19 pneumonia and potentially plays a role in managing decisions for hospitalization in isolation or admission in general ward. In order to face pandemic, in a period in which a large number of emergency room accesses with suspicious symptoms are expected, physicians need a standardized ultrasonographic approach, fast educational processes in order to be able to recognize both suggestive and not suggestive echographic signs and shared algorithms for LUS role in early management of patients.", "num_citations": "23\n", "authors": ["1449"]}
{"title": "From secure business process modeling to design-level security verification\n", "abstract": " Tracing and integrating security requirements throughout the development process is a key challenge in security engineering. In socio-technical systems, security requirements for the organizational and technical aspects of a system are currently dealt with separately, giving rise to substantial misconceptions and errors. In this paper, we present a model-based security engineering framework for supporting the system design on the organizational and technical level. The key idea is to allow the involved experts to specify security requirements in the languages they are familiar with: business analysts use BPMN for procedural system descriptions; system developers use UML to design and implement the system architecture. Security requirements are captured via the language extensions SecBPMN2 and UMLsec. We provide a model transformation to bridge the conceptual gap between SecBPMN2 and UMLsec …", "num_citations": "23\n", "authors": ["1449"]}
{"title": "Risk analysis as part of the requirements engineering process\n", "abstract": " In software engineering, risk is usually considered and analyzed during, or even after, the system design. Countermeasures are elaborated and then accommodated as a refinement of the design, when a limited number of changes are still possible and they may introduce the problem of revisiting the initial requirements. In this paper, we propose a goal-oriented approach for modeling and reasoning about risk during the requirements analysis process. Risks are introduced and analyzed along the stakeholders' goals and countermeasures are introduced as part of the system's requirements. The approach extends the Tropos formal framework with new concepts and qualitative risk reasoning mechanisms. We use a case study on loan origination process to illustrate the proposal.", "num_citations": "23\n", "authors": ["1449"]}
{"title": "Toothagent: a multi-agent system for virtual communities support\n", "abstract": " People tend to form social networks within geographical areas. This can be explained by the fact that generally geographical localities correspond to common interests (e.g. students located in a university could be interested to buy or sell textbooks adopted for a specific course, to share notes, or just to meet together to play basketball). Cellular phones and more in general mobile devices are currently widely used and represent a big opportunity to support social communities. In this paper, we present a general architecture for multi-agent systems accessible via mobile devices (cellular phones and PDAs), where Bluetooth technology has been adopted to reflect users locality. We illustrate ToothAgent, an implemented prototype of the proposed architecture, and discuss the opportunities offered by the system.", "num_citations": "23\n", "authors": ["1449"]}
{"title": "Towards a unified framework for contextual variability in requirements\n", "abstract": " Context is a significant factor in deciding the set of requirements relevant to a system (i.e., software product construction), the alternatives the system can adopt to satisfy these requirements, and the quality assessment of each alternative. By context we mean the conditions in the operating environment of an system that influences how the system should behave in different situations. However, the relationship between context and requirements can be challenging to capture and analyze. Presently this area of requirements engineering is largely under-researched. In this position paper, we discuss several ways by which context can be related to requirements and subsequently used for product derivation. We outline an approach that facilitates better understanding and use of contextual information in requirements. Our approach integrates three requirements engineering approaches - goal modeling, feature modeling …", "num_citations": "22\n", "authors": ["1449"]}
{"title": "Distributed belief revision vs. belief revision in a multi-agent environment: First results of a simulation experiment\n", "abstract": " We propose a distributed architecture for belief revision-integration, where each element is conceived as a complex system able to exchange opinions with the others. Since nodes can be affected by some degree of incompetence, part of the information running through the network may be incorrect. Incorrect information may cause contradictions in the knowledge base of some nodes. To manage these contradictions, each node is equipped with a belief revision module which makes it able to discriminate among more or less credible information and more or less reliable information sources. Our aim is that of comparing on a simulation basis the performances and the characteristics of this distributed system vs. those of a centralised architecture. We report here the first results of our experiments.", "num_citations": "21\n", "authors": ["1449"]}
{"title": "Modeling and reasoning about contextual requirements: Goal-based framework\n", "abstract": " Most of requirements engineering (RE) research ignores, or presumes a uniform nature of, the context in which the system operates. This assumption is no longer valid in emerging computing paradigms, such as Ambient, Pervasive and Ubiquitous Computing, where it is essential to monitor and adapt to an inherently varying context. There is a strong relationship between  requirements and context.  Context  might be considered to determine the set of requirements relevant to a system, to derive the alternatives the system can adopt to reach these requirements, and to assess the quality of each alternative. A RE framework that explicitly captures and analyzes this relationship is still missing.  Before influencing the behavior of  software, context influences the behavior of users. It influences users' goals and their choices to reach these goals. Capturing this latest influence is essential for  a software developed to meet users' requirements in different contexts. In this thesis, we propose a goal-oriented RE modeling and reasoning framework for systems operating in  and reflecting varying contexts. To this end, we develop a conceptual modeling language, the \\emph{contextual goal model}, that captures the relationship between context and requirements at the goal level and provides constructs to analyze context. We develop a set of reasoning mechanisms to analyze contextual goal models addressing various problems: the consistency of context, the derivation of requirements in different contexts, the detection of conflicts between requirements happening as a consequence of changes in the context they lead to, and the derivation of a set of …", "num_citations": "20\n", "authors": ["1449"]}
{"title": "From actions to affordances: supporting the work of biologists through laboratory notebooks.\n", "abstract": " The paper presents an approach and a technology to support the work of biologists in their laboratories. By means of analysis of related literature, informal discussions with people working in laboratory, and experience of one the authors with laboratory work in genomic research, we identified different biologists’ information needs and different strategies in order to satisfy them. A relevant part of biologists’ work practice is about the continuous annotation of their work in their personal notebooks. We claim that observing notebooks can boost a technology which is a generalization of recommendation systems and provides biologists with suggestions concerning their work. These suggestions are generated by combining the observation of biologists performed actions in the past with actions patterns incorporating biologists’ work practices that are discovered by the system out of the transcriptions of biologists’ notebooks.", "num_citations": "20\n", "authors": ["1449"]}
{"title": "The TROPOS analysis process as graph transformation system\n", "abstract": " Tropos is an agent-oriented methodology that covers software development from early requirements analysis to detailed design, allowing for a deeper understanding of the operational environment of the new software system. In earlier work we have characterized the process of early requirements analysis in terms of transformation applications. In this paper we redefine the Tropos analysis process in terms of a Graph Transformation System and we provide an algorithm for driving the process of Tropos diagram generation. An example execution of the algorithm is also presented.", "num_citations": "20\n", "authors": ["1449"]}
{"title": "Implicit: a multi-agent recommendation system for web search\n", "abstract": " For people with non-ordinary interests, it is hard to search for information on the Internet because search engines are impersonalized and are more focused on “average” individuals with “standard” preferences. In order to improve web search for a community of people with similar but specific interests, we propose to use the implicit knowledge contained in the search behavior of groups of users. We developed a multi-agent recommendation system called Implicit, which supports web search for groups or communities of people. In Implicit, agents observe behavior of their users to learn about the “culture” of the community with specific interests. They facilitate sharing of knowledge about relevant links within the community by means of recommendations. The agents also recommend contacts, i.e., who in the community is the right person to ask for a specific topic. Experimental evaluation shows that Implicit …", "num_citations": "19\n", "authors": ["1449"]}
{"title": "On using degrees of belief in BDI agents\n", "abstract": " The past few years have seen a rise in the popularity of the use of mentalistic attitudes such as beliefs, desires and intentions to describe intelligent agents. Many of the models which formalise such attitudes do not admit degrees of belief, desire and intention. We see this as an understandable simpli cation, but as a simpli cation which means that the resulting systems cannot take account of much of the useful information which helps to guide human reasoning about the world. This paper starts to develop a more sophisticated system based upon an existing formal model of beliefs desires and intentions.", "num_citations": "19\n", "authors": ["1449"]}
{"title": "Requirements-driven deployment\n", "abstract": " Deployment is a main development phase which configures a software to be ready for use in a certain environment. The ultimate goal of deployment is to enable users to achieve their requirements while using the deployed software. However, requirements are not uniform and differ between deployment environments. In one environment, certain requirements could be useless or redundant, thereby making some software functionalities superfluous. In another environment, instead, some requirements could be impossible to achieve and, thus, additional functionalities would be required. We advocate that ensuring fitness between requirements and the system environment is a basic and critical step to achieve a comprehensive deployment process. We propose a tool-supported modelling and analysis approach to tailor a requirements model to each environment in which the system is to be deployed. We …", "num_citations": "18\n", "authors": ["1449"]}
{"title": "Implicit: A recommender system that uses implicit knowledge to produce suggestions\n", "abstract": " The number of accessible web pages in Internet increases every day and it becomes very difficult to deal with such a huge source of information. There exist several approaches aimed to provide user with high-quality links extracted from the thousands of irrelevant ones. We present a system Implicit that combines recommender system and multi-agent system approaches and is intended to be used within community of people with similar interests. It produces suggestions by using implicit knowledge of the members of a community and complementing these suggestions with results from search engines. Agents within the system interact one another and share knowledge in order to increase quality of the recommendations by using similarities in the behavior of different users.", "num_citations": "18\n", "authors": ["1449"]}
{"title": "Secure Tropos: dealing effectively with security requirements in the development of multiagent systems\n", "abstract": " The consideration of security requirements in the development of multi-agent systems is a very difficult task. However, only few approaches have been proposed that try to integrate security issues as internal part of the development process. Amongst them, secure Tropos has been proposed as a structured approach towards the consideration of security issues in the development of multiagent systems. In this paper we enhance secure Tropos by integrating to its stages:(i) a process for selecting amongst alternative architectural styles using as criteria the security requirements of the system;(ii) a pattern-based approach to transform security requirements to design, and (iii) a security attack scenarios approach to test the developed solution. The electronic single assessment process (eSAP) case study is used to illustrate our approach.", "num_citations": "17\n", "authors": ["1449"]}
{"title": "Goal-based self-contextualization\n", "abstract": " System self-contextualizability is the system ability to autonomously adapt its behavior to the uncontrollable relevant context to keep its objectives satisfied. Self-contextualizable system must have alternative behaviors each fitting to a set of contexts. We propose to start considering context at the level of requirements engineering, adopting Tropos goal model to express requirements and complementing it with our proposed context analysis. We define variation points on goal model where a context-based decision might need to be taken, and propose constructs to analyze context. While goal analysis provides constructs to hierarchically analyze goals and discover alternative sets of tasks to be executed to satisfy a goal, our proposed context analysis provides constructs to hierarchically analyze context and discover alternative sets of facts to be monitored to verify a context.", "num_citations": "16\n", "authors": ["1449"]}
{"title": "Location-based variability for mobile information systems\n", "abstract": " Advances in size, power, and ubiquity of computing, sensors, and communication technology make possible the development of mobile or nomadic information systems. Variability of location and system behavior is a central issue in mobile information systems, where software behavior has to change and re-adapt to the different location settings. In this paper, we motivate the need for integration of variable location and variable software behavior. We adapt the goal-oriented framework i*/Tropos to model and analyze the alternative goal satisfaction strategies and the location where each alternative can be adopted. We introduce analysis techniques for the proposed location-based models.", "num_citations": "16\n", "authors": ["1449"]}
{"title": "Analysing security requirements of information systems using tropos\n", "abstract": " Security is an important issue when developing complex information systems, however very little work has been done in integrating security concerns during the analysis of information systems. Current methodologies fail to adequately integrate security and systems engineering, basically because they lack concepts and models as well as a systematic approach towards security. We believe that security should be considered during the whole development process and it should be defined together with the requirements specification. This paper introduces extensions to the Tropos methodology to accommodate security. A description of new concepts is given along with an explanation of how these concepts are integrated to the current stages of Tropos. The above is illustrated using an agent-based health and social care information system as a case study.", "num_citations": "16\n", "authors": ["1449"]}
{"title": "Belief revision as applied within a descriptive model of jury deliberations\n", "abstract": " Belief revision is a well-researched topic within Artificial Intelligence (AI). We argue that the new model of belief revision as discussed here is suitable for general modelling of judicial decision making, along with the extant approach as known from jury research. The new approach to belief revision is of general interest, whenever attitudes to information are to be simulated within a multi-agent environment with agents holding local beliefs yet by interacting with, and influencing, other agents who are deliberating collectively. The principle of 'priority to the incoming information', as known from AI models of belief revision, is problematic when applied to factfinding by a jury. The present approach incorporates a computable model for local belief revision, such that a principle of recoverability is adopted. By this principle, any previously held belief must belong to the current cognitive state if consistent with it. For the purposes …", "num_citations": "16\n", "authors": ["1449"]}
{"title": "Simulating bdi-based wireless sensor networks\n", "abstract": " ``Autonomic systems'' merge advancements in the field of multi-agent software design, dynamic analysis, and decentralized control in order to assist designers in constructing complex distributed systems. Wireless Sensor Networks (WSN) represent such systems, and may benefit from autonomic system designs that target distributed nodes in diverse and changing environments that interact over a wireless communication channel for decentralized problem solving. Multi-agent system techniques have been recently applied to WSN's; however, due to hardware limitations nodes (agents) are not fully deliberative (or strong) reasoning systems. Since hardware increases rapidly it is expected that such systems may eventually be viable. In this paper we provide a generic, extensible, and deliberative simulator for testing interactions in autonomous WSN's. The belief, desire, intention (BDI) agent model of Rao is used, as …", "num_citations": "15\n", "authors": ["1449"]}
{"title": "Applying tropos to socio-technical system design and runtime configuration\n", "abstract": " Recent trends in Software Engineering have introduced the importance of reconsidering the traditional idea of software design as a socio-tecnical problem, where human agents are integral part of the system along with hardware and software components. Design and runtime support for Socio-Technical Systems (STSs) requires appropriate modeling techniques and non-traditional infrastructures. Agent-oriented software methodologies are natural solutions to the development of STSs, both humans and technical components are conceptualized and analyzed as part of the same system. In this paper, we illustrate a number of Tropos features that we believe fundamental to support the development and runtime reconfiguration of STSs. Particularly, we focus on two critical design issues: risk analysis and location variability. We show how they are integrated and used into a planning-based approach to support the designer in evaluating and choosing the best design alternative. Finally, we present a generic framework to develop self-reconfigurable STSs.", "num_citations": "15\n", "authors": ["1449"]}
{"title": "Andiamo: A multiagent system to provide a mobile-based rideshare service\n", "abstract": " A diverse range of architectures and concepts has been proposed by scholars within the theme of Car Pooling. Most of these studies have attempted to tie together two major elements: the need for people to move from a place to another, and the resources used to accomplish this action. Based on the use of location and available car seats, Rideshare systems allow a substantial number of people to share car rides. These systems would, among other advantages, rationalize energy consumption, save money, and decrease traffic jams and human stress, and eventually make a significant improvement in human life. However, system accessibility has prevented these architectures from being widely reached. In this paper, we present an agent-based Rideshare system that is accessible via lightweight devices (mobile phones and PDAs), where Bluetooth technology is adopted to reflect users’ locality. The paper illustrates the overall infrastructure of the system, the specific protocols it uses, and the algorithms that it implements to recognize the Multiagent System (MAS) negotiations.", "num_citations": "15\n", "authors": ["1449"]}
{"title": "On security requirements analysis for multi-agent systems\n", "abstract": " Agent Oriented Software Engineering (AOSE) is a software paradigm that has grasped the attention of researchers the last few years. As a result, many different methods have been introduced to enable developers develop multi-agent systems. However, so far, security requirements have been mainly neglected, and the common approach towards the inclusion of security within a system is to identify security requirements after the definition of the system. This approach has provoked the emergence of computer systems afflicted with security vulnerabilities. In this paper we propose an analysis, based on the measures of criticality (how critical an actor of the system is) and complexity (represents the effort required by the actors of the system to achieve the requirements that have been imposed to them), which aims to identify possible bottlenecks of a multi-agent system with respect to security. An integrated agent-based health and social care information system is used as a case study throughout this paper.", "num_citations": "15\n", "authors": ["1449"]}
{"title": "Optimizing monitoring requirements in self-adaptive systems\n", "abstract": " Monitoring the system environment is a key functionality of a self-adaptive system. Monitoring requirements denote the information a self-adaptive system has to capture at runtime to decide upon whether an adaptation action has to be taken. The identification of monitoring requirements is a complex task which can easily lead to redundancy and uselessness in the set of information to monitor and this, consequently, means unjustified instalment of monitoring infrastructure and extra processing time. In this paper, we study the optimization of monitoring requirements. We discuss the case of contextual goal model, which is a requirements model that weaves between variability of goals (functional and non-functional requirements) and variability of context (monitoring requirements) and is meant to be used for modelling mobile and self-adaptive systems requirements. We provide automated analysis —based …", "num_citations": "13\n", "authors": ["1449"]}
{"title": "Method construction by goal analysis\n", "abstract": " Method engineering proposes the construction of methodologies by selecting method fragments from a repository and assembling them in an appropriate way. However, the rules by which the “optimal” method fragments are chosen are not clear, and such chores are usually done manually by an expert. This paper presents a goal analysis technique for the selection of the optimal method fragments from a repository, using backward reasoning to obtain the set of fragments that satisfy the desired goals with minimum effort. By using this technique, a methodologist can determine the goals that the organisation wants the methodology to satisfy, and then, preferably, rely on automated tools for the selection of the optimal solution.", "num_citations": "13\n", "authors": ["1449"]}
{"title": "MEnSA Project-Methodologies for the Engineering of complex Software systems: Agent-based approach\n", "abstract": " In this deliverable we present an initial version of the MEnSA integrated meta-model together with the methodological approach we used to devise the meta-model. The meta-model incorporates concepts from four agentoriented methodologies: Gaia, PASSI, SODA and Tropos. The focus of the first version of the meta-model is on requirements analysis and design phases rather than on implementation. The approach used to create this meta-model consists of the identification of requirements for the integrated agent-oriented methodology, the creation of a glossary of terms for each of the methodologies under consideration, the definition of a conceptual map of terms, and, finally, the definition of the meta-model itself.", "num_citations": "13\n", "authors": ["1449"]}
{"title": "Choosing the right design pattern: an implicit culture approach\n", "abstract": " Design patterns represent solutions to problems that have been proved to be useful in different contexts and can be reused. An experienced programmer can choose a suitable pattern for a given problem effectively. However, for an inexperienced programmer this is a very hard task. We propose a multi-agent system that supports programmers in choosing the design pattern suitable for the given problem. Personal agents in our system produce knowledge transfer among users, allowing for the reuse of experience in choosing design patterns.", "num_citations": "13\n", "authors": ["1449"]}
{"title": "Information access in implicit culture framework\n", "abstract": " The goal of a System for Implicit Culture Support (SICS) is to establish an implicit culture phenomenon, namely when the elements of a set behave according to the culture of a generally different group of agents. Earlier work claimed that Implicit Culture support can be seen as a generalization of Collaborative Filtering. In this paper, we recall the concept of Implicit Culture, show how it is useful for automatically exploit tacit knowledge and we present an implementation of a System for Implicit Culture Support.", "num_citations": "13\n", "authors": ["1449"]}
{"title": "Analyzing trust requirements in socio-technical systems: a belief-based approach\n", "abstract": " The Requirements Engineering (RE) community recognizes the importance of trust proposing several approaches to model and analyze trust requirements. However, such approaches mainly focus on trust as social relations without relating them to the requirements of the system’s components. We propose a belief-based trust approach based on an extended version of Secure Tropos, where social relations are modeled and analyzed along with beliefs concerning capabilities and motivations of system’s components. An example concerning US stock market crash (the Flash Crash) is used to illustrate our approach.", "num_citations": "12\n", "authors": ["1449"]}
{"title": "Analysing security in information systems\n", "abstract": " The last few years there is a tendency to integrate security issues during the development of information systems with the aim to develop more secure information systems. In this paper we propose an analysis, based on the measures of criticality (how critical a component of the system is) and complexity (represents the effort required by the components of the system to achieve the requirements that have been imposed to them), which aims to identify possible bottlenecks of an information system with respect to security. An integrated health and social care information system is used as a case study throughout this paper.", "num_citations": "12\n", "authors": ["1449"]}
{"title": "Multi-objective risk analysis with goal models\n", "abstract": " Risks of software projects are often ignored and risk analysis is left for later stages of project life-cycle, resulting in serious financial losses. This paper proposes a goal-oriented risk analysis framework that includes inter-dependencies among treatments and risks in terms of likelihood and generate optimal solutions with respect to multiple objectives such as goal rewards, treatment costs, or risk factor. The Loan Origination Process illustrates our approach and a detailed analysis of the visual notation is provided.", "num_citations": "11\n", "authors": ["1449"]}
{"title": "From secure business process models to secure artifact-centric specifications\n", "abstract": " Making today’s systems secure is an extremely difficult and challenging problem. Socio and technical issues interplay and contribute in creating vulnerabilities that cannot be easily prevented without a comprehensive engineering method. This paper presents a novel approach to support process-aware secure systems modeling and automated generation of secure artifact-centric implementations. It combines social and technical perspectives in developing secure systems. This work is the result of an academic and industrial collaboration, where SecBPMN2, a research prototype, has been integrated with SAP River, an industrial artifact-centric language.", "num_citations": "11\n", "authors": ["1449"]}
{"title": "Transforming Socio-Technical Security Requirements in SecBPMN Security Policies.\n", "abstract": " Socio-Technical Systems (STSs) are complex systems composed of both social (ie, humans and organizations) and technical (ie, hardware and software) elements. Security requirements for STSs define constraints for the sociotechnical interactions and can be specified as a set of security policies that have to be satisfied by the components of the system during their interactions. In this paper, we present how security requirements molded in STS-ml are transformed in security policies expressed in SecBPMN, an extension of BPMN with security annotations.", "num_citations": "11\n", "authors": ["1449"]}
{"title": "Software self-reconfiguration: a BDI-based approach.\n", "abstract": " Software self-reconfiguration is the capability of software systems to change autonomously their current configuration to a better one. This is a more and more requested feature, particularly for software systems that operate in critical domains when human intervention is not possible or not convenient. The Belief-Desire-Intention (BDI) architecture proposes a structured Monitor-Diagnose-Compensate cycle that partially meets self-reconfiguration requirements. We propose a realization of the abstract BDI control loop and we draw generic solutions to support the self-reconfiguration process. We aim at supporting traceability and runtime monitoring of requirements and we base our solution on Tropos goal models to structure agents’ internal state.", "num_citations": "11\n", "authors": ["1449"]}
{"title": "From early to late requirements: a goal-based approach\n", "abstract": " The Software Engineering community is placing increasing emphasis on understanding the organizational context of a new software system before its development. In this context, several research projects focus on mechanisms that facilitate the generation of a software system from early requirements specifications. However, none of these has proposed so far a systematic process for transforming an organizational model into a late requirements one. This paper presents a methodological approach to precisely this problem. In the proposed method, business goals constitute the basis for determining the relevant plans to be supported by the system-to-be. A pattern language is then used to systematically carry out the transformation from an organizational model into a late requirements model. The Tropos framework serves as baseline for this work. However, our work extends Tropos by proposing rules that …", "num_citations": "11\n", "authors": ["1449"]}
{"title": "Service-oriented computing and software agents\n", "abstract": " Service-Oriented Computing (SOC) is the computing paradigm that utilizes services as fundamental elements for developing applications/solutions. To build the service model, SOC relies on the Service Oriented Architecture (SOA), which is a way of reorganizing software applications and infrastructure into a set of interacting services. However, the basic SOA does not address overarching concerns such as management, service orchestration, service transaction management and coordination, security, and other concerns that apply to all components in a services architecture.             In this paper we introduce an Extended Service Oriented Architecture that provides separate tiers for composing and coordinating services and for managing services in an open marketplace by employing grid services and discuss how agent technology can be used to support the functions of the Extended SOA.", "num_citations": "11\n", "authors": ["1449"]}
{"title": "Modelling an agent-based integrated health and social care information system for older people\n", "abstract": " This paper argues the potential of agent technology to support delivery of integrated information systems for the health and social care sector. In doing so, it points out the similarities and the mutual characteristics (such as distribution of expertise) of integrated health and social care information systems and agent technology. On the other hand, it identifies the need to develop a mature and complete agent-oriented software engineering methodology tailored to the analysis and design of agent-based medical systems. The electronic Single Assessment Process (eSAP), an electronic system to deliver the integrated assessment of health and social care needs of older people, is modelled using the Tropos methodology.", "num_citations": "11\n", "authors": ["1449"]}
{"title": "Learning agents' reliability through Bayesian Conditioning: A simulation experiment\n", "abstract": " This paper reports the first results of a simulation experiment. There are two databases, one containing true propositions and the other containing their respective negations. Five agents in turn access one of them. Each agent has a “capacity” that will be used as the frequency with which the agent accesses (unconsciously) the database with the correct knowledge. Agents randomly exchange information with the others. Since they have limited degrees of capacity, their “cognitive state” quickly becomes inconsistent. Each agent is equipped with the same belief revision mechanism to detect and solve these contradictions. This adopts the Dempster's Rule of Combination to evaluate the credibility of the various pieces of information and Bayesian Conditioning to estimate the relative degrees of reliability of the agents (itself included). The purpose of the experiments was that of evaluating on a statistical basis, the …", "num_citations": "11\n", "authors": ["1449"]}
{"title": "A holistic approach for privacy protection in E-government\n", "abstract": " Improving e-government services by using data more effectively is a major focus globally. It requires Public Administrations to be transparent, accountable and provide trustworthy services that improve citizen confidence. However, despite all the technological advantages on developing such services and analysing security and privacy concerns, the literature does not provide evidence of frameworks and platforms that enable privacy analysis, from multiple perspectives, and take into account citizens' needs with regards to transparency and usage of citizens information. This paper presents the VisiOn (Visual Privacy Management in User Centric Open Requirements) platform, an outcome of a H2020 European Project. Our objective is to enable Public Administrations to analyse privacy and security from different perspectives, including requirements, threats, trust and law compliance. Finally, our platform-supported …", "num_citations": "10\n", "authors": ["1449"]}
{"title": "Dealing with information quality requirements\n", "abstract": " Information Quality (IQ) has been a growing concern for most organizations, since they depend on information for managing their daily tasks, make important decisions, etc., and relying on low quality information may negatively influence their overall performance. Despite this, most of the Requirements Engineering approaches either ignore or loosely define such requirements, i.e., they deal with them as generic non-functional requirements. In this paper, we propose a goal-oriented framework that is based on an extended version of secure Tropos methodology for modeling and reasoning about IQ requirements since the early phases of the system development, and refine these requirements until reaching their operational specifications. Moreover, the framework offers a methodological process along with several reasoning techniques to help designers during the different phases of the system design. We …", "num_citations": "10\n", "authors": ["1449"]}
{"title": "Implicit Culture-Based Personal Agents for Knowledge Management\n", "abstract": " We present an implementation of a multi-agent system that aims at solving the problem of tacit knowledge transfer by means of experiences sharing. In particular, we consider experiences of use of pieces of information. Each agent incorporates a system for implicit culture support (SICS) whose goal is to realize the acceptance of the suggested information. The SICS permits a transparent (implicit) sharing of the information about the use, e.g., requesting and accepting pieces of information.", "num_citations": "10\n", "authors": ["1449"]}
{"title": "Detecting Conﬂicts in Information Quality Requirements: the May 6, 2010 Flash Crash\n", "abstract": " Information Quality (IQ) is a key success factor for the efficient performance of any system, and it becomes a vital issue for critical systems, where low-quality information may lead to disasters. Despite this, most of the Requirements Engineering frameworks loosely define, or simply ignore such requirements, which may lead to different conflicts among the stakeholders' IQ requirements. In this paper, we propose a novel conceptual framework for modeling and reasoning about IQ at requirements level. The proposed framework is based on the secure Tropos methodology and extends it with the required concepts for modeling and analyzing IQ requirements since the early phases of software development. A running example concerning a U.S stock market crash (the May 6, 2010 Flash Crash) is used throughout the paper.", "num_citations": "9\n", "authors": ["1449"]}
{"title": "Exploring alternative designs for sociotechnical systems\n", "abstract": " Sociotechnial systems (STSs) consist of a complex interplay of technical components, humans, and organizations. As other types of systems, STSs need to evolve in response to changing requirements and operational environments. Evolving STSs is a complex activity, which requires reconfiguration of technical components as well as rerouting of interactions among human and social actors. Moreover, reconfiguration has to respect participant autonomy, while coping with conflicting goals and noncooperation in identifying a configuration that minimizes changes relative to the current configuration. In this paper, we present a framework that supports design and evolution of STSs. The framework includes (i) the DEST language for modeling STSs as goal-oriented actors that interact via social commitments; (ii) techniques for building a network of interactions that fulfills participant requirements; and (iii) techniques for …", "num_citations": "9\n", "authors": ["1449"]}
{"title": "Balanced goalcards: combining balanced scorecards and goal analysis\n", "abstract": " Today’s Information Systems are complex systems that have to deal with a variety of different and potentially conﬂicting needs. Capturing their strategic requirements is a critical activity, as it must answer at the same  time to software and corporate goals. In this paper, we introduce the economic foundations of strategic requirements. We propose a novel conceptual framework for requirements modeling and validation, based on economic and business strategy theory. The soundness of the framework is also evaluated, by presenting the result of its application to a real case study.", "num_citations": "9\n", "authors": ["1449"]}
{"title": "An evaluation of business solutions in manufacturing enterprises\n", "abstract": " Evaluating business solutions before their deployment is essential for any organisation. Risk is emerging as one of the most preeminent and accepted metrics for the evaluation of business solutions. In this paper, we present a comprehensive case study where the Tropos Goal-Risk framework is used to assess and treat risk on the basis of the likelihood and severity of failures within organisational settings. We present an analysis and evaluation of the business solutions within manufacturing enterprises.", "num_citations": "9\n", "authors": ["1449"]}
{"title": "An implemented prototype of bluetooth-based multi-agent system\n", "abstract": " People tend to form social networks within specific geographical areas. This is motivated by the fact that the geographical locality corresponds generally to common interests and opportunities offered by the people active in the area (e.g., students of a university could be interested to buy or sell text books adopted for a specific course, to share notes, or just to meet together to play basketball). Cellular phones and more in general mobile devices are currently widely used and represent a big opportunity to support social communities. We present an application of multi-agent systems accessible via mobile devices (cellular phones and PDAs), where Bluetooth technology has been adopted to reflect users locality. We illustrate an implemented prototype of the proposed architecture and we discuss the opportunities offered by the system.", "num_citations": "9\n", "authors": ["1449"]}
{"title": "Sensor data validation for nuclear power plants through bayesian conditioning and dempster's rule of combination\n", "abstract": " Sensor data fusion and interpretation, sensor failure detection, isolation and identification are extremely important activities for the safety of a nuclear power plant. In particular, they become critical in case of conflicts among the data. If the monitored system's description model is correct and its components work properly, then incompatibilities among data may only be attributed to temporary deterioration or permanent breakage of one or more sensors. This paper introduces and discusses three simple ideas:", "num_citations": "9\n", "authors": ["1449"]}
{"title": "Modeling structured and unstructured processes: An empirical evaluation\n", "abstract": " Imperative process languages, such as BPMN, describe business processes in terms of collections of activities and control flows among them. Despite their popularity, such languages remain useful mostly for structured processes whose flow of activities is well-known and does not vary greatly. For unstructured processes, on the other hand, the verdict is still out as to the best way to represent them. In our previous work, we have proposed Azzurra, a specification language for business processes founded on social concepts, such as roles, agents and commitments. In this paper, we present the results of an experiment that comparatively evaluates Azzurra and BPMN in terms of their ability to represent structured and unstructured processes. Our results suggest that Azzurra is better suited than BPMN for unstructured business processes.", "num_citations": "8\n", "authors": ["1449"]}
{"title": "Solving the next adaptation problem with prometheus\n", "abstract": " Dealing with multiple requirement failures is an essential capability for self-adaptive software systems. This capability becomes more challenging in the presence of conflicting goals. This paper is concerned with the next adaptation problem: the problem of finding the best next adaptation in the presence of multiple failures. `Best' here means that the adaptation chosen optimizes a given set of objective functions, such as the cost of adaptation or the degree of failure for system requirements. The paper proposes a formal framework for defining the next adaptation problem, assuming that we can specify quantitatively the constraints that hold between indicators that measure the degree of failure of each requirement and control parameters. These constraints, along with one or several objective functions, are translated into a constrained multi-objective optimization problem that can be solved by using an OMT/SMT …", "num_citations": "8\n", "authors": ["1449"]}
{"title": "Aligning service-oriented architectures with security requirements\n", "abstract": " Aligning requirements and architectures is a long-standing concern in software engineering. Alignment is crucial in the area of systems evolution, wherein requirements and system architectures keep changing after system deployment. We address a specific alignment problem, namely, checking the compliance of a service-oriented architecture—representing a composite service—with security requirements. Service-oriented architectures are dynamic (services can be replaced on-the-fly), and assessing compliance with security requirements is key, since non-compliance may lead to sanctions as well as privacy violation. After motivating and describing the problem, we propose algorithms to check two specific security requirements: non-disclosure and non-repudiation. We illustrate the approach using an e-government scenario.", "num_citations": "8\n", "authors": ["1449"]}
{"title": "Modeling and verification of ATM security policies with SecBPMN\n", "abstract": " High Performance Computing (HPC) techniques are essential in complex systems such as Socio-Technical Systems (STSs), where humans and organizations are elements of the same system along with technical infrastructures and hardware/software components. For example, several HPC approaches have been successfully applied to support and facilitate distribution or aggregation of computation power among independent and atomic components (e.g., smart meters to solve and/or simulate complex models). However, HPC techniques have to be studied and developed without underestimating the problem of security that, given the interaction-centric nature of STSs, has to be considered not only from the single component perspective but for the system as a whole. In our previous work, we have proposed SecBPMN, a framework to support the design of secure STSs. It is used to model the interaction design …", "num_citations": "7\n", "authors": ["1449"]}
{"title": "Implicit Culture Framework for behavior transfer\n", "abstract": " People belong to different communities: business communities, Web 2.0 communities, just to name a few. In this chapter the authors show that experience acquired by people in communities constitute community culture. The authors introduce the problem of culture transfer between or within communities and propose a domain-independent approach for transferring community culture. First, the authors formalize the notion of culture, which includes behavior, knowledge, artifacts, best practices, etc. Second, using this formalism, the authors propose the Implicit Culture Framework, which is an agent-based framework for transferring behavior between community members or between communities. Finally, the authors present and evaluate a system for web service discovery developed using the Implicit Culture Framework.", "num_citations": "7\n", "authors": ["1449"]}
{"title": "Modeling and analyzing variability for mobile information systems\n", "abstract": " Advances in size, power, and ubiquity of computing, sensors, and communication technology made possible the development of mobile or nomadic information systems. Variability of location and system behavior is a central issue in mobile information systems, where behavior of software has to change and re-adapt to the different location settings. This paper concerns modeling and analysis of the complementary relation between software and location variability. We use graphical and formal location modeling techniques, show how to elicit and use location model in conjunction with Tropos goal-oriented framework, and introduce automated analysis on the location-based models.", "num_citations": "7\n", "authors": ["1449"]}
{"title": "Implicit culture as a tool for social navigation\n", "abstract": " Very often people tend to behave as other people behaved previously. This happens in many different situations, for instance when one has to choose the path in a forest or when she/he has to select a link in the web. Social Navigation aims at providing assistance in such situations supporting the decision making process. Implicit Culture is a recent approach in which people are encouraged (induced) to behave according to usual behavior of the community. This paper shows similarities between Social Navigation and Implicit Culture and it presents a case study about user preferences learning.", "num_citations": "7\n", "authors": ["1449"]}
{"title": "Locating Agents in RFID Architectures\n", "abstract": " The use of software agents can create an “intelligent” interface between users’ preferences and the back‐end systems. Agents are now able to interact and communicate with each other, forming a virtual community and feeding back the user with suggestions. Innovative systems related to Asset Tracking, Inventory and Shelving architectures are more often involving advanced communication techniques (e.g., RFID); these systems are responsible for user authentication and objects verification. RFID systems could have jamming situations where many objects are moving at the same time and in the same direction. Moreover, other disadvantages have also been observed, such as hindering further implementations, privacy and security issues problems, in addition to the system’s disruptive behavior in case of crowd checkouts (e.g., Supermarket and Airports). Addressing these disadvantages, this paper proposes a possible integration between a Multi‐Agent framework and an RFID‐based application (back‐end). This integration would allow objects (such as passports or goods) with RFID tags to better check‐out through airports or supermarket gates that contain RFID‐readers.", "num_citations": "7\n", "authors": ["1449"]}
{"title": "Data mining, decision support and meta-learning: towards an implicit culture architecture for KDD\n", "abstract": " During data mining process users and algorithms could take advantage of the experiences other users or algorithms (agents) had. Implicit Culture is the relation between a set and a group of agents such that the elements of the set behave according to the culture of the group. The goal of a System for Implicit Culture Support (SICS) is to establish an implicit culture phenomenon, namely when the elements of a set behave according to the culture of a generally different group of agents. Supporting Implicit Culture phenomena can be useful for both artificial and human agents that is the kind of agents (miners and learners) that are involved in the data mining process. The architecture of a SICS relies on the solution of two learning problems:(i) induction of a cultural theory on the behavior patterns of the group and (ii) prediction of a scene such that the elements of the set will behave consistently with the cultural theory. An implemented SICS solves the latter problem exploiting a generalization of a Collaborative Filtering algorithm. In this paper, we recall the concept of Implicit Culture, present the architecture of a System for Implicit Culture Support (SICS) and argue that the application of a SICS to data mining process could be an interesting way of dealing with some of the problems that the practice of data mining presents.", "num_citations": "7\n", "authors": ["1449"]}
{"title": "Copri-a core ontology for privacy requirements engineering\n", "abstract": " In their daily practice, most enterprises collect, store, and manage personal information for customers in order to deliver their services. In such a setting, privacy has emerged as a key concern as companies often neglect or even misuse personal data. In response to this, governments around the world have enacted laws and regulations for privacy protection. These laws dictate privacy requirements for any system that acquires and manages personal data. Unfortunately, these requirements are often incomplete and/or inaccurate as many RE practitioners might be unsure of what exactly are privacy requirements and how are they different from other requirements, such as security. To tackle this problem, we developed a comprehensive ontology for privacy requirements. To make it comprehensive, we base our ontology on a systematic review of the literature on privacy requirements. The contributions of this work …", "num_citations": "6\n", "authors": ["1449"]}
{"title": "In-time explainability in multi-agent systems: Challenges, opportunities, and roadmap\n", "abstract": " In the race for automation, distributed systems are required to perform increasingly complex reasoning to deal with dynamic tasks, often not controlled by humans. On the one hand, systems dealing with strict-timing constraints in safety-critical applications mainly focused on predictability, leaving little room for complex planning and decision-making processes. Indeed, real-time techniques are very efficient in predetermined, constrained, and controlled scenarios. Nevertheless, they lack the necessary flexibility to operate in evolving settings, where the software needs to adapt to the changes of the environment. On the other hand, Intelligent Systems (IS) increasingly adopted Machine Learning (ML) techniques (e.g., subsymbolic predictors such as Neural Networks). The seminal application of those IS started in zero-risk domains producing revolutionary results. However, the ever-increasing exploitation of ML …", "num_citations": "6\n", "authors": ["1449"]}
{"title": "Modelling the interplay of security, privacy and trust in sociotechnical systems: a computer-aided design approach\n", "abstract": " Personal data have become a central asset for multiple enterprise applications and online services offered by private companies, public organisations or a combination of both. The sensitivity of such data and the continuously growing legislation that accompanies their management dictate the development of methods that allow the development of more secure, trustworthy software systems with focus on privacy protection. The contribution of this paper is the definition of a novel requirements engineering method that supports both early and late requirements specification, giving emphasis on security, privacy and trust. The novelty of our work is that it provides the means for software designers and security experts to analyse the system-to-be from multiple aspects, starting from identifying high-level goals to the definition of business process composition, and elicitation of mechanisms to fortify the system from external …", "num_citations": "6\n", "authors": ["1449"]}
{"title": "Towards a Real-Time BDI Model for ROS 2.\n", "abstract": " In the race for automation, electronic devices are required to become more and more intelligent in order to make the correct choices in unforeseen situations without any need of human intervention. AI proposes basically two different approaches: machine learning algorithms and multi-agent systems. While the former perform very well when dealing with single, independent, computing units, multi-agent systems are more suitable in case of different components interacting with one another. In this paper, we propose a real-time multi-agent approach to improve practical reasoning, integrating the Belief-Desire-Intention model into one of the most popular robotics framework, ROS 2.", "num_citations": "6\n", "authors": ["1449"]}
{"title": "Applying social norms to high-fidelity pedestrian and traffic simulations\n", "abstract": " Smart cities are founded on complex interactions among architectural and urban designs, sensors, actuators and crowds of people with their devices. In this context, simulation becomes essential to study the effects of the technology and to understand how to improve its effectiveness on the social environment. The majority of the current pedestrian and traffic simulations adopt a bird-eye view and are driven by statistical models. While this is enough in many cases, e.g. to study traffic flow under common conditions assuming average cases, it is not appropriate when a higher level of fidelity is required. Simulated people need to show both a plausible behavior and mechanisms to coordinate with human participants in a natural way. Much of this coordination happens silently and is driven by social norms, that may vary according to culture and context. In this paper, we propose an approach to represent social norms in …", "num_citations": "6\n", "authors": ["1449"]}
{"title": "Requirements Engineering for Social Applications.\n", "abstract": " We characterize social applications as those involving interaction among multiple autonomous agents. We are interested in the essential concepts and approaches for modeling such applications. We make the case that i* has some limitations with respect to the modeling of social applications. The problem is in the intentional nature of i*. The deeper roots though lie in the centralized machine-oriented approach of current requirements engineering approaches. We recommend an interaction-oriented approach to requirements modeling, modeling in terms of social commitments rather than dependencies, and in general, accommodating a distributed perspective right from the earliest phases of software engineering. For clarity, we also distinguish social commitments from various similar-sounding notions in the literature.", "num_citations": "6\n", "authors": ["1449"]}
{"title": "Talos: an architecture for self-configuration\n", "abstract": " Autonomic computing concerns the design and development of software systems with self-maintenance capabilities and behaviors that conform to high-level policies. Self-reconfiguration is a key feature of an autonomic system. It enables self-transition from the current configuration, which may have failed or be under-performing, to a new configuration that better addresses system goals. In this paper, we propose Talos, a conceptual architecture based on the Belief-Desire-Intention (BDI) paradigm that supports various forms of self-reconfiguration. We also present a first realization of Talos in Jason, a BDI infrastructure based on the AgentSpeak programming language. Our approach follows software engineering principles and is founded on goal-oriented analysis from Requirements Engineering.", "num_citations": "6\n", "authors": ["1449"]}
{"title": "Integrating Security and Software Engineering\n", "abstract": " This chapter serves as an introduction to this book. It introduces software engineering, security engineering, and secure software engineering, providing definitions and explanation of terms necessary for readers to understand the subsequent chapters. Characteristics of each of the above areas are presented followed by an overview of the current advances in these areas. Finally, the 10 approaches described in the remaining chapters of the book are briefly introduced. tion, telecommunications, entertainment, health care, military, education, and so on; the list is almost endless. These systems are used not only by major corporations and governments but also by individual users. Such wide use of information systems has resulted in these systems containing a large amount of critical information, which inevitably need to remain secure. Therefore, although it is important to ensure that software systems are developed according to the user needs (functional requirements), it is equally important to ensure that these systems are secure. However, traditionally, security is considered after the definition of the system, meaning that security mechanisms are fitted into pre-existing designs. Usually, in practise, a fit-all solution is assumed where security mechanisms, such as authentication, are inserted into the system", "num_citations": "6\n", "authors": ["1449"]}
{"title": "Evaluating the potential for integrating the OPEN and Tropos metamodels\n", "abstract": " Methodologies involves both process elements and product elements. The OPEN Process Framework (OPF) focusses largely on process elements in the context of object-oriented systems development. The Tropos metamodel, on the other hand, focusses on early requirements engineering support for agent-oriented development. In a project to extend the OPF to support agent-oriented developments, we investigate the potential for amalgamation of these two methodological approaches and their metamodels, describing how the metamodel integration has been initiated.", "num_citations": "6\n", "authors": ["1449"]}
{"title": "Information quality requirements engineering with STS-IQ\n", "abstract": " ContextInformation Quality (IQ) is particularly important for organizations: they depend on information for managing their daily tasks and relying on low-quality information may negatively influence their overall performance. Despite this, the literature shows that most software development approaches do not consider IQ requirements during the system design, which leaves the system open to different kinds of vulnerabilities.ObjectiveThe main objective of this research is proposing a framework for modeling and analyzing IQ requirements for Socio-Technical Systems (STS).MethodWe propose STS-IQ, a goal-oriented framework for modeling and analyzing IQ requirements in their social and organizational context since the early phases of the system design. The framework extends and refines our previous work, and it consists of: (i) a modeling language that provides concepts and constructs for modeling IQ …", "num_citations": "5\n", "authors": ["1449"]}
{"title": "From security-by-design to the identification of security-critical deviations in process executions\n", "abstract": " Security-by-design is an emerging paradigm that aims to deal with security concerns from the early phases of the system development. Although this paradigm can provide theoretical guarantees that the designed system complies with the defined processes and security policies, in many application domains users are allowed to deviate from them to face unpredictable situations and emergencies. Some deviations can be harmless and, in some cases, necessary to ensure business continuity, whereas other deviations might threat central aspects of the system, such as its security. In this paper, we propose a tool supported method for the identification of security-critical deviations in process executions using compliance checking analysis. We implemented the approach as part of the STS-Tool and evaluated it using a real loan management process of a Dutch financial institute.", "num_citations": "5\n", "authors": ["1449"]}
{"title": "Analysing Information Integrity Requirements in Safety Critical Systems.\n", "abstract": " Organizations’ assets are subject to different threats; which are addressed, usually, by different security solutions. Nonetheless i* modeling language was not developed with security in mind, which motivated the development of other languages (eg, SI*) that focused on capturing the security requirements (eg, privacy) of the system-to-be, but far less attention has been paid for capturing information integrity requirements. Capturing information integrity requirements represents an important need for safety critical systems, where depending on incorrect or inconsistent information may lead to disasters and loss of humans’ lives (eg, Air Traffic Control Management Systems). In this paper we present a novel methodology for developing safety critical systems that extends i*/SI* modeling languages with the required concepts and primitives for modeling and analyzing the requirements of safety critical systems, with a special emphasis on information integrity requirements.", "num_citations": "5\n", "authors": ["1449"]}
{"title": "Requirements as Goals and Commitments too\n", "abstract": " In traditional software engineering research and practice, requirements are classified either as functional or non-functional. Functional requirements consist of all functions the system-to-be ought to support, and have been modeled in terms of box-and-arrow diagrams in the spirit of SADT. Non-functional requirements include desired software qualities for the system-to-be and have been described either in natural language or in terms of metrics. This orthodoxy was challenged in the mid-90 s by a host of proposals that had a common theme: all requirements are initially stakeholder goals and ought to be elicited, modeled and analyzed as such. Through systematic processes, these goals can be refined into specifications of functions the system-to-be needs to deliver, while actions assigned to external actors need to be executed. This view is dominating Requirements Engineering (RE) research and is …", "num_citations": "5\n", "authors": ["1449"]}
{"title": "Reasoning about contextual requirements for mobile information systems: a goal-based approach\n", "abstract": " Mobile information systems are characterized by their ability to adapt to varying contexts. There is a strong relationship between the requirements of a mobile information system and its operational context. On the one hand, context can be considered to determine the requirements, the alternatives that can be adopted to satisfy these requirements, and qualities of the systems. On the other hand, the system itself may cause changes in the context during its operational activities. More fundamentally, context influences users' goals and the way they achieve these goals. In previous work, we introduced contextual goal modeling, a systematic way to analyze and specify contexts. The key idea was to associate variants for goal satisfaction with contexts. In this paper, we propose analysis techniques and automated reasoning mechanisms to verify properties of contextual goal models. We show how to detect inconsistent context specifications and how to analyze possible runtime conflicts originated by context changes. Also, we present an analysis process to construct and reason about contextual goal models. We illustrate and evaluate our framework through a case study of a mobile information system for supporting the life of people with dementia.", "num_citations": "5\n", "authors": ["1449"]}
{"title": "Contextual Goal Models\n", "abstract": " In emerging computing paradigms, such as mobile, ubiquitous, and pervasive computing, the relation between context and requirements is evident. Context might be a main factor to determine the set of requirements relevant to a system, the alternatives that can be adopted to meet these requirements, and the quality of each of such alternatives. In spite of that, most requirements engineering (RE) research ignores, or presumes a uniform nature of, the context where the system operates. A RE framework specialized for systems reflecting their context is still missing. Before influencing the behavior of software, context influences the behavior of users. It influences user's goals and their choices to reach these goals. Capturing this latest influence is an essential step towards software developed to meet user's requirements in different contexts. In this report, we develop a goal-based RE modeling framework for systems operating in and reflecting varying contexts. We propose the contextual goal model that captures the relation between alternatives for goal salification and context. Moreover, it provides constructs to hierarchically analyze context and identify alternative ways to judge if a context holds. We illustrate our proposed model via a scenario of promotion mobile information system.", "num_citations": "5\n", "authors": ["1449"]}
{"title": "Analyzing Risk-Countermeasure in Organizations: a Quantitative Approach\n", "abstract": " Risk is one of inherent problems in all software systems. It becomes more significant if the software system is operated in a critical system (e.g., air traffic control, nuclear plant). It is because in this domain the software system is expected to be always dependable all the time of its operation. The system is dependable when all its risks are suppressed until acceptable level. Therefore, in such setting analysts must carefully analyze the socio-technical system (i.e., organizational-setting and software systems) and understand how uncertain events may affect the systems. By means of the Tropos Goal-Risk, we model the socio-technical system including its risks. Essentially, the framework consists of goal, event, and treatment modeling. The goal layer represents what the stakeholders' interests are and how to achieve them. The event layer depicts how uncertain events occur and impact the goals of stakeholders. The treatment layer represents what the possible measures that are available to treat the events. By quantifying the evidence value of the model, analysts can reason about the level of risk and choose the most appropriate alternative to achieve the stakeholders' interests and the necessary treatment that should be employed to mitigate the risks. We use a case study on Air Traffic Management to illustrate the proposal.", "num_citations": "5\n", "authors": ["1449"]}
{"title": "From Early Requirements to Late Requirements: A goal-based approach\n", "abstract": " At present, the software engineering community places emphasis on the relevance of understanding the organizational context before starting the development of an information system. In this context, several research works focus on proposing mechanisms to generate information systems from early requirements specifications in an agent-based approach. However, only a few research works offer a guided process for carrying out the equivalence between the organizational and requirements models. In this paper, a methodological approach for deriving the software system functionality from organizational models is presented. In the proposed method, the organizational goals are the basis for determining the relevant plans to be automated with a software system. A pattern language is also used to systematically carry out the equivalence between the organizational and late requirements models. The Tropos Framework (which is one of the most well-founded, agent-oriented methodologies) is used to represent the organizational environment. By proposing rules to perform the model transformation process, we go a step further in the process of including organizational modeling as a key piece in the software production process", "num_citations": "5\n", "authors": ["1449"]}
{"title": "Requirements analysis for socio-technical systems: Exploring and evaluating alternatives\n", "abstract": " Early requirements analysis focuses on stakeholders and their goals, and explores alternative ways of fulfilling them through networks of actor delegations. The i* modeling framework is a popular way of modeling and analyzing early requirements. This paper frames the problem of designing actor dependency networks as a multi-agent planning problem and adopts off-the-shelf planners to offer a tool that generate alternative actor dependency networks, and evaluate them in terms of metrics derived from Game Theory literature. The paper presents in detail how planning can generate alternative networks, also describes the tool (P-Tool) that supports the planning process and generates alternatives. As well, we offer preliminary experimental results on the scalability of the approach.", "num_citations": "5\n", "authors": ["1449"]}
{"title": "Agent-Oriented software engineering report on the 4th AOSE workshop (AOSE 2003)\n", "abstract": " Agent-Orientation is emerging as a powerful new paradigm in computing. Concepts, methodologies and tools from the agents paradigm are one of the best candidates for the foundations of the next generation of mainstream software systems. The Agent-Oriented Software Engineering (AOSE) workshop is an international event that brings together researchers and groups active in the area of agent-based software development. Here we briefly report on the fourth edition of the AOSE workshop.", "num_citations": "5\n", "authors": ["1449"]}
{"title": "Distributed knowledge revision/integration\n", "abstract": " We propose a distributed architecture for knowledge revisionintegration, where each element is conceived as a knowledge-based system able to exchange information with the others. since nodes can be affected by some degree of incompetence, part of the information running through the network may be incorrect and might cause contradictions in the knowledge base of some nodes. To manage these contradictions, each node is equipped with a belief revision module which makes it able to discriminate among more or less credible information and more or less reliable information sources. Our aim is that of comparing on a simulation basis the performances and the characteristics of this distributed system vs. those of a centralised architecture. We report here the fmt results of our experiments.", "num_citations": "5\n", "authors": ["1449"]}
{"title": "PRESTO Script: scripting for serious games\n", "abstract": " PRESTO, a recently concluded R&D project, has developed a tool suite for the creation of behavioral AI for serious games, with a focus on 3D games for emergency training. This paper focuses on its scripting language, meant to ease development of games by instructional designers and to enable run-time control by trainers supervising a training session. The purpose of the scripting language is to control the choreography of NPCs in the game according to the situations occurring in the game and the trainer’s decisions. Scripts describe graphs of potential stories, whose progress and ramifications are determined by events occurring in the game, including trainer’s choices. We provide an overview of PRESTO Script, its semantics and its implementation, and compare it with a few commercial and research languages with similar purposes for games and other uses.", "num_citations": "4\n", "authors": ["1449"]}
{"title": "Towards an integrated platform for adaptive socio-technical systems for smart spaces\n", "abstract": " The widespread availability of mobile devices equipped with sensors on board is strongly pushing towards the development of smart spaces -- offices, streets, hospital, airports, homes and shops equipped with sensing systems to help people find relevant information quickly and use services comfortably, often in a collaborative way. A common aspect in these scenarios is that the technology complexity is amplified by the organisational and procedural complexity of the application domain: this is in fact typical of socio-technical systems -- kinds of systems that inherently need to be conceived, designed and developed taking into account both the technological and the human/organisational aspects from the earliest stages. In this paper, we select and discuss some challenges in the definition and development of adaptive socio-technical systems for smart spaces, the selected challenges aim at focusing in particular on …", "num_citations": "4\n", "authors": ["1449"]}
{"title": "Modeling and Analyzing Information Quality Requirements of Socio-technical Systems: Experience Report.\n", "abstract": " Research ObjectiveObjectives: proposing a framework that is able to model and reason about IQ requirements since the early phases of the system development.Research questions:", "num_citations": "4\n", "authors": ["1449"]}
{"title": "The evolution of Tropos: Contexts, commitments and adaptivity\n", "abstract": " Software evolution is the main research focus of the Tropos group at University of Trento (UniTN): how do we build systems that are aware of their requirements, and are able to dynamically reconfigure themselves in response to changes in context (the environment within which they operate) and requirements. The purpose of this report is to offer an overview of ongoing work at UniTN. In particular, the report presents ideas and results of four lines of research: contextual requirements modeling and reasoning, commitments and goal models, developing self-reconfigurable systems, and requirements awareness.", "num_citations": "4\n", "authors": ["1449"]}
{"title": "A formal definition of culture of a set of agents\n", "abstract": " Globalization makes culture no more bound to a geographical area, race or religion as was previously considered in anthropology. With the advent of Web 2.0 it becomes more appropriate to speak about the culture of online communities in general, without specific ties to country or nation. Most current approaches to the development of systems for online communities implement some pre-defined culture rather than supporting the actual culture of the community for which the system is being developed. In this paper we eliminate this shortcoming by presenting and formalizing a definition of the notion of culture of a set of agents. We show how our definition covers many previous definitions existing in anthropology, and how it can be used to model the culture of online communities. We also introduce the classification of problems involving culture and show how these problems can be applied for dealing with culture in different contexts: pure artificial agents, human agents, and mixed situations.", "num_citations": "4\n", "authors": ["1449"]}
{"title": "Modeling and Analyzing Contextual Requirements\n", "abstract": " The relation between contexts and requirements can be very complex to analyze. A context can motivate a requirement, a requirement can be satisfied only in a specific context, and a context can influence the quality of each possible alternative of satisfying a requirement. To capture and deeply understand this relation, we need to start from the reasons of a requirement, namely stakeholders goals, and analyze at this level the system variability with respect to the context. In this paper, we propose a goal-based approach to model and analyze contextual requirements. We adopt Tropos goal modeling framework where we introduce contextual variation points and provide a set of constructs to hierarchically analyze contexts. We also articulate a new problem, the context interaction problem; we study its influence on both monitoring and functional requirements, and we finally provide a SAT-based approach to deal with it. We show the process for creating our models and illustrate our approach on a museum-guide scenario.", "num_citations": "4\n", "authors": ["1449"]}
{"title": "Reasoning about risk in agent’s deliberation process: A Jadex implementation\n", "abstract": " Autonomous agents and multi-agent systems have been proved to be useful in several safety-critical applications. However, in current agent architectures (particularly BDI architectures) the deliberation process does not include any form of risk analysis. In this paper, we propose guidelines to implement Tropos Goal-Risk reasoning. Our proposal aims at introducing risk reasoning in the deliberation process of a BDI agent so that the overall set of possible plans is evaluated with respect to risk. When the level of risk results too high, agents can consider and introduce additional plans, called treatments, that produce an overall reduction of the risk. Side effects of treatments are also considered as part of the model. To make the discussion more concrete, we illustrate the proposal with a case study on the Unmanned Aerial Vehicle agent.", "num_citations": "4\n", "authors": ["1449"]}
{"title": "Integrating Security and Software Engineering: Future Vision and Challenges\n", "abstract": " The previous chapters of this book have presented promising approaches in the secure software engineering? eld. However, the? eld is still in its infancy and a number of challenges still need to be answered. The main aim of this chapter is to list and discuss nine challenges that we? nd important for the advance of the secure software engineering? eld. The main idea behind each challenge is presented in a short sentence followed by a discussion, which indicates why the challenge is important. In some cases, the discussion provides some ideas of how the challenge could be met.", "num_citations": "4\n", "authors": ["1449"]}
{"title": "Smart ride seeker (srs) an introductory plan\n", "abstract": " A diverse range of architectures and concepts was proposed by scholars within the theme of Car Pooling Problem solving. Most of these scholars have attempted to put together two major elements: the need for people to move from a place to another, and the resources used to accomplish this action. Based on the use of location and available car seats, Car sharing systems allowed a substantial number of people to share car rides. These systems would, among other advantages, rationalize energy consumption, save money, and decrease traffic jams and human stress, and eventually make a significant improvement in human life. This paper proposes the initial phase of Smart Ride Seeker (SRS), which is a Car Pooling-like technique for distributing resources among a community that shares the same goals. This SRS technique will be developed through a mobile-based application that allows the mapping of ride seekers’ locations along with the locations of available cars on a graphical interface/map, giving the possibility to calculate the fastest and simplest path for both the ride giver and seeker to meet and fulfill their demand.", "num_citations": "4\n", "authors": ["1449"]}
{"title": "Ensuring dependability in socio-technical system by risk analysis\n", "abstract": " Organizations and individuals are becoming more and more dependent on computer systems to achieve their goals and to deliver their responsibilities. This introduces at design time the need of considering humans as part of the system and consequently dependability becomes a critical issue to take into consideration during the development of the system. Traditionally, dependability is measured in terms of availability, reliability, and integrity of the system. However, in this new scenario dependability of a software system has to be closely related with the organizational-setting where the system will operate. In this paper, we briefly introduce a framework, based on Tropos methodology, to model/analyse risk and assess the dependability of a system in a particular organizational-setting. The framework supports the analyst in eliciting the necessary countermeasures to mitigate risks and, consequently, ensure the dependability of the system within a certain level of risk.", "num_citations": "4\n", "authors": ["1449"]}
{"title": "Modelling and analysing risk at organizational level\n", "abstract": " Modeling and analyzing risk is one of the most critical activity in system engineering and approaches like Fault Tree Analysis, Event Tree Analysis, Failure Modes and Criticality Analysis have been proposed in literature. All these approaches focus on the system-to-be without considering the impact of the associated risks to the organization where the system will operate. On the other hand, the tendency is more and more to consider software development as a part of organizational development. In this paper, we propose a framework to model and reason about risk at organizational level, namely considering the system-to-be along the organizational setting. The framework extends Tropos, a methodology that has been proved effective in modeling strategic interests of the stakeholders at organizational level. We introduce a number of different means that help the analyst to identify and enumerate relevant treatments for risk mitigation. Experimental results are finally presented and discussed.", "num_citations": "4\n", "authors": ["1449"]}
{"title": "Implicit culture for information agents\n", "abstract": " Earlier work introduced the concept of Implicit Culture and its use in multi-agent systems. Implicit culture support can be seen as a generalization of Collaborative Filtering and it can improve agents’ performances. In this paper, we present an implementation of a System for Implicit Culture Support, results obtained in a recommendation-problem domain, and an application to the eCulture Brokering System, a multiagent system aimed to mediate the access to cultural information.", "num_citations": "4\n", "authors": ["1449"]}
{"title": "Personal agents for implicit culture support\n", "abstract": " We present an implementation of a multi-agent system that aims at solving the problem of tacit knowledge transfer by means of experiences sharing. In particular, we consider experiences of use of pieces of information. Each agent incorporates a system for implicit culture support (SICS) whose goal is to realize the acceptance of the suggested information. The SICS permits a transparent (implicit) sharing of the information about the use, eg, requesting and accepting pieces of information.", "num_citations": "4\n", "authors": ["1449"]}
{"title": "Socio-Intentional Architectures for Multi-Agent Systems: the Mobile Robot Control case.\n", "abstract": " This paper proposes architectural styles for multi-agent systems (MAS) which adopt concepts from organization theory and strategic alliances. These styles are socio-intentional in the sense that they consist of actors who have goals to fulfil and social dependencies describing their obligations. They are represented in i*, a framework designed to model social and intentional primitives and formalized in terms of Formal Tropos. Each proposed style is evaluated with respect to a set of agent software qualities, such as predictability, adaptability and openness. The use of the styles is illustrated and contrasted with a software architecture for mobile robots reported in the literature.", "num_citations": "4\n", "authors": ["1449"]}
{"title": "Updating mental states from communication\n", "abstract": " In order to perform effective communication agents must be able to foresee the effects of their utterances on the addressee’s mental state. In this paper we investigate the update of the mental state of a hearer agent as a consequence of the utterance performed by a speaker agent. Given an agent communication language with a STRIPS-like semantics, we propose a set of criteria that allow the binding of the speaker’s mental state to its uttering of a certain sentence. On the basis of these criteria, we give an abductive procedure that the hearer can adopt to partially recognize the speaker’s mental state, on the basis of its utterances. This procedure can be adopted by the hearer to update its own mental state and its image of the speaker’s mental state.", "num_citations": "4\n", "authors": ["1449"]}
{"title": "Self-Monitoring Distributed Monitoring System For Nuclear Power Plants\n", "abstract": " This paper introduces and discusses three simple ideas: 1. classical\" Model-Based Diagnosis\" can be extended straightforwardly to encompass the sensors' models into the system's description in order to diagnose even their own faults 2. from the\" log-file\" of the diagnosed minimal conflicts among the sensors, one can draw interesting conclusion regarding their relative reliability (eg, through Bayesian Conditioning) 3. the estimated reliability of the sensors is useful when assessing (eg, through Dempster's Rule of Combination) the actual state of the monitored physical system, even in cases of conflicting data. These ideas lead to the conception of a distributed monitoring system able to attach each sensor a statistically-evaluated relative reliability, which is especially useful for devices situated in dangerous zones or areas, difficult to reach inside huge and complex production plants. 1 INTRODUCTION", "num_citations": "4\n", "authors": ["1449"]}
{"title": "Applying Social Norms to Implicit Negotiation among Non-Player Characters in Serious Games.\n", "abstract": " Believable Non Player Characters (NPCs), ie artificial characters simulating rational entities, are a great addition to videogames, no matter if used for entertainment or serious reasons. Especially NPCs that represent people in realistic settings need to show plausible behaviors; to this end, one of main issues to be tackled is coordination with other participants, either other NPCs or human players, when performing everyday tasks such as crossing doors, queuing at an office, picking the first free object up from a set, and so on. Much of this coordination happens silently and is driven by social norms that may vary according to culture and context. In this paper, we propose an approach to represent social norms in autonomous agents and enable implicit coordination driven by observations of others’ behavior. Our approach does not use central coordinators or a coordination protocol, but rather let each agent take its own decision so to support more realistic interactions with human players. A software architecture and initial experimental results are presented and discussed.", "num_citations": "3\n", "authors": ["1449"]}
{"title": "A goal-based approach for automated specification of information quality policies\n", "abstract": " Organizational and social aspects are key factors for the analysis of Information Quality (IQ) requirements. This is particularly true in the case of complex socio-technical systems where computerized components coexist with humans and social structures and effective IQ policies can be defined only as a combination of all these factors. Although, several policy-based approaches have been proposed in the literature, none of them offer an adequate conceptual support to combine the technical and organizational perspective in the analysis of IQ requirements. In this paper, we propose a goal-based approach based on an extended version of Secure Tropos to model and analyze IQ requirements from a socio-technical perspective. Our approach provides mechanisms for an automatic derivation of IQ policies, which are specified in terms of permitted, forbidden and obligated activities. Verification of correctness and …", "num_citations": "3\n", "authors": ["1449"]}
{"title": "Modeling and analyzing information integrity in safety critical systems\n", "abstract": " Preserving information integrity represent an urgent need for safety critical systems, where depending on incorrect or inconsistent information may leads to disasters. Typically, information integrity is a problem handled at technical level (e.g., checksumming). However, information integrity has to be analyzed in the social-technical context of the system, since information integrity related problems might manifest themselves in the business processes and actors interactions. In this paper, we propose an extended version of i*/ secure Tropos modeling languages to capture information integrity requirements. We illustrate the Datalog formalization of the proposed concepts and analysis techniques to support the analyst in the verification of integrity related properties. Air Traffic Management (ATM) case study is used throughout the paper.", "num_citations": "3\n", "authors": ["1449"]}
{"title": "Aligning software configuration with business and IT context\n", "abstract": " An important activity to maximize Business/IT alignment is selecting a software configuration that fits a given context. Feature models represent the space of software configurations in terms of distinguished characteristics (features). However, they fall short in representing the effect of context on the adoptability and operability of features and, thus, of configurations. Capturing this effect helps to minimize the dependency on analysts and domain experts when deriving a software for a given business and IT environment. In this paper, we propose contextual feature models as a means to explicitly represent and reason about the interplay between the variability of both features and context. We devise a formal framework and automated analyses which enable to systematically derive products aligned with an organizational context. We also propose FM-Context, a support tool for modeling and analysis.", "num_citations": "3\n", "authors": ["1449"]}
{"title": "Multi-dimensional uncertainty analysis in secure and dependable domain\n", "abstract": " Most of the critical aspects for secure and dependable systems, such as safety, integrity, availability, are related to uncertainty. Literature proposes many approaches to deal with uncertainty, mainly in the area of risk management and safety and reliability engineering. However, what is still missing is a clear understanding of the nature of uncertainty that very often has produced mistreatments in the design. In this paper, we propose a conceptual model for uncertainty that can be used to deal with systems' qualities such as security and dependability. Particularly, we will consider the relation between uncertainty risk and how risk affects quality attributes of the system. We use a case study in Air Traffic Management to illustrate our approach.", "num_citations": "3\n", "authors": ["1449"]}
{"title": "A formal definition of culture of a set of agents: The version without states\n", "abstract": " Globalization makes culture no more bound to a geographical area, race or religion as was previously considered in anthropology. With the advent of Web 2.0 it becomes appropriate to speak about the culture of online communities in general, without specific ties to country or nation. Most current approaches to the development of systems for online communities implement some pre-defined culture rather than supporting the actual culture of the community for which the system is being developed. This technical report presents a formal definition of culture of a set of agents. Our definition covers many previous definitions existing in anthropology, and it can be used to model the culture of online communities. This is the first version of the formalism and it does not introduce states. However, representing a snapshot of the culture in a certain moment is the first step towards a more complex formalism that includes states (the work on the latter is ongoing).", "num_citations": "3\n", "authors": ["1449"]}
{"title": "Cooperative Information Systems: 9th International Conference, CoopIS 2001, Trento, Italy, September 5-7, 2001. Proceedings\n", "abstract": " This book constitutes the refereed proceedings of the 8th International Conference on Cooperative Information Systems, CoopIS 2001, held in Trento, Italy in September 2001. The 29 revised full papers presented together with three invited contributions were carefully reviewed and selected from 79 submissions. The papers are organized in topical sections on agent and systems; information integration; middleware, platforms, and architectures; models; multi and federated database systems; Web information systems; workflow management systems; and recommendation and information seeking systems.", "num_citations": "3\n", "authors": ["1449"]}
{"title": "Sistemi di Monitoraggio Distribuiti Automonitoranti\n", "abstract": " La fusione e l’interpretazione di dati provenienti da sensori, sono operazioni critiche in caso di conflitto. Se il modello descrittivo del sistema monitorato è corretto ed i componenti lavorano correttamente, allora le incompatibilità tra i dati possono essere imputate solo al deterioramento, oa rotture permanenti, di uno o più sensori. L’articolo introduce e discute tre semplice idee: 1. La “Model-Based Diagnosis” classica può essere estesa direttamente per incorporare il modello dei sensori nella descrizione del sistema, in modo tale da diagnosticare anche i malfunzionamenti degli stessi (sensors’ faults)2. dall’analisi storica dei conflitti minimali diagnosticati tra i sensori, si possono trarre interessanti conclusioni riguardanti la loro attendibilità relativa (attraverso il Condizionamento Bayesiano) 3. l’attendibilità stimata dei sensori è utile per valutare (attraverso la Regola di Combinazione di Dempster) lo stato attuale del sistema fisico monitorato, anche in caso di dati conflittuali e non ridondanti.", "num_citations": "3\n", "authors": ["1449"]}
{"title": "COPri v. 2—A core ontology for privacy requirements\n", "abstract": " Nowadays, most enterprises collect, store, and manage personal information of customers to deliver their services. In such a setting, privacy has emerged as a key concern since companies often neglect or even misuse personal data. In response to multiple massive breaches of personal data, governments around the world have enacted laws and regulations for privacy protection. These laws dictate privacy requirements for any system that acquires and manages personal data. Unfortunately, these requirements are often incomplete and/or inaccurate as many RE practitioners are insufficiently versed with privacy requirements and how are they different from other requirements, such as security. To tackle this problem, we developed a comprehensive ontology for privacy requirements. In particular, the contributions of this work include the derivation of an ontology from a previously conducted systematic literature …", "num_citations": "2\n", "authors": ["1449"]}
{"title": "RT-BDI: A Real-Time BDI Model\n", "abstract": " Currently, distributed cyber-physical systems (CPS) rely upon embedded real-time systems, which can guarantee compliance with time constraints. CPS are increasingly required to act and interact with one another in dynamic environments. In the last decades, the Belief-Desire-Intention (BDI) architecture has proven to be ideal for developing agents with flexible behavior. However, current BDI models can only reason about time and not in time. This lack prevents BDI agents from being adopted in designing CPS, and particularly in safety-critical applications. This paper proposes a revision of the BDI model by integrating real-time mechanisms into the reasoning cycle of the agent. By doing so, the BDI agent can make decisions and execute plans ensuring compliance with strict timing constraints also in dynamic environments, where unpredictable events may occur.", "num_citations": "2\n", "authors": ["1449"]}
{"title": "Integrating BPMN-and UML-based Security Engineering via Model Transformation\n", "abstract": " We present our paper from the proceedings of 2017 edition of the MODELS conference. Tracing and integrating security requirements throughout the development process is a key challenge in security engineering. In socio-technical systems, security requirements for the organizational and technical aspects of a system are currently dealt with separately, giving rise to substantial misconceptions and errors. In this paper, we present a model-based security engineering framework for supporting the system design on the organizational and technical level. The key idea is to allow the involved experts to specify security requirements in the languages they are familiar with: business analysts use BPMN for procedural system descriptions; system developers use UML to design and implement the system architecture. Security requirements are captured via the language extensions SecBPMN2 and UMLsec. We provide a model transformation to bridge the conceptual gap between SecBPMN2 and UMLsec. Using UMLsec policies, various security properties of the resulting architecture can be verified. In a case study featuring an air traffic management system, we show how our framework can be practically applied.", "num_citations": "2\n", "authors": ["1449"]}
{"title": "Secure and Trustworthy Service Composition: The Aniketos Approach\n", "abstract": " The Future Internet will provide an environment in which a diverse range of services are offered by multiple suppliers, and users are likely to unknowingly invoke underlying services in a dynamic and ad hoc manner. Moving from today’s static services, we will see service consumers that transparently mix and match service components depending on service availability, quality, price, and security attributes. Consequently, the applications that end users see may be composed of multiple services from many different providers, and the end user may have little assurance about the compliance of a particular service supplier with the declared security policies.Thus, there is the need for services platforms that build the foundation of a Future Internet that is responsive to threats and changes in services. This book presents the Aniketos platform that was developed during the Aniketos project, and that is the central element …", "num_citations": "2\n", "authors": ["1449"]}
{"title": "Security and trustworthiness threats to composite services: Taxonomy, countermeasures, and research directions\n", "abstract": " This chapter studies not only how traditional threats may affect composite services, but also some of the new challenges that arise from the emerging Future Internet. For instance, while atomic services may, in isolation, comply with privacy requirements, a composition of the same services could lead to violations due to the combined information they manipulate. Furthermore, with volatile services and evolving laws and regulations, a composite service that seemed secure enough at deployment time, may find itself unacceptably compromised some time later. Our main contributions are a taxonomy of threats for composite services in the Future Internet, which organises thirty-two threats within seven categories, and a corresponding taxonomy of thirty-three countermeasures. These results have been devised from analysing service scenarios and their possible abuse with participants from seventeen …", "num_citations": "2\n", "authors": ["1449"]}
{"title": "BarterCell: An agent-based bartering service for users of pocket computing devices\n", "abstract": " The rising integration of pocket computing devices in our daily life duties has taken the attention of researchers from different scientific backgrounds. Today’s amount of software applications bringing together advanced mobile services and literature of Artificial Intelligence (AI) is quite remarkable and worth investigating. In our research, software agents of BarterCell can operate in wireless networks on behalf of nomadic users, cooperate to resolve complex tasks and negotiate to reach mutually beneficial bartering agreements. In this paper, we introduce BarterCell that is an agent-based service application for users of pocket computing devices. We introduce new negotiation algorithms dedicated to bartering services in specific. We examine our approach in a scenario wherein it is essential for a multi-agent system to establish a chain of mutually attracted agents seeking to fulfill different bartering desires. And …", "num_citations": "2\n", "authors": ["1449"]}
{"title": "From intentions to social commitments: Adaptation in multiagent systems\n", "abstract": " Runtime adaptation of software systems is an area of software engineering that is gaining increasing attention from researchers. Adaptive software can successfully cope with failures and the volatility of the environment it operates in. Researchers in software requirements and architecture are especially interested in modeldriven adaptation. The idea is that software would reflect upon its own model in order to reason about adaptation.This chapter represents a summary of our recent work for supporting adaptation in multiagent systems. Our key contribution is to exploit the notion of social commitment in order to reason about adaptation in multiagent systems. While other approaches for adaptation assume cooperation or some form of logical centralization, our approach works for open multiagent systems wherein agents are autonomous and heterogeneously constructed. We conceive adaptation from the perspective of an intentional agent, who needs to interact with other agents in the multiagent system—by engaging in social commitments—to achieve its goals.", "num_citations": "2\n", "authors": ["1449"]}
{"title": "BALANCED GOALCARDS Combining Goal Analysis and Balanced Scorecards\n", "abstract": " Today’s Information Systems are complex systems that have to deal with a variety of different and potentially conflicting needs. Capturing their strategic requirements is a critical activity, as it must answer at the same time to software and corporate goals. In this paper, we introduce the economic foundations of strategic requirements. We propose a novel conceptual framework for requirements modeling and validation, based on economic and business strategy theory. The soundness of the framework is also evaluated, by presenting the result of its application to a real case study. 1", "num_citations": "2\n", "authors": ["1449"]}
{"title": "Agent Oriented AmI Engineering\n", "abstract": " Ambient Intelligence (AmI) refers to an environment that is sensitive, responsive, interconnected, contextualized, transparent, intelligent, and acting on behalf of humans. This environment is coupled with ubiquity of computing devices that enables it to transparently sense context changes, to react accordingly, and even to take the initiative towards fulfilling human needs. Security, privacy, and trust challenges are amplified with AmI computing model and need to be carefully engineered. From software engineering perspective, the shift towards AmI can be seen abstractly similar to the shift from object paradigm towards agent one. Objects provide functionality to be exploited, while agents possess functionality and know how and when to use and offer it autonomously. Agent paradigm is suitable for implementing AmI considering AmI as an open complex system. Moreover, we argue that agent paradigm is …", "num_citations": "2\n", "authors": ["1449"]}
{"title": "Agent-Oriented Information Systems II\n", "abstract": " Information systems have become the backbone of all kinds of organizations today. In almost every sector–manufacturing, education, health care, government and businesses large and small–information systems are relied upon for everyday work, communication, information gathering and decision-making. Yet, the inflexibilities in current technologies and methods have also resulted in poor performance, incompatibilities and obstacles to change. As many organizations are reinventing themselves to meet the challenges of global competition and e-commerce, there is increasing pressure to develop and deploy new technologies that are flexible, robust and responsive to rapid and unexpected change. Agent concepts hold great promise for responding to the new realities of information systems. They offer higher-level abstractions and mechanisms which address issues such as knowledge representation and …", "num_citations": "2\n", "authors": ["1449"]}
{"title": "Task coordination for non-cooperative planning agents\n", "abstract": " We consider task planning problems where a number of noncooperative agents have to work on a joint problem. Such a problem consists in completing a set of interdependent, hierarchically ordered tasks. Each agent is assigned a subset of tasks to perform for which it has to construct a plan. Since the agents are non-cooperative, they insist on planning independently and do not want to revise their individual plans when the joint plan has to be assemled from the individual plans. We present a formal framework to study some computational aspects of this non-cooperative coordination problem.", "num_citations": "2\n", "authors": ["1449"]}
{"title": "Una possibile estensione del sistema “balanced scorecard”\n", "abstract": " Il sistema delle Balanced Scorecard, proposto da Norton e Kaplan, ha riscosso negli ultimi anni un notevole interesse nel mondo manageriale. In particolare tale sistema si è rilevato efficace per il controllo delle performance in relazione alle strategie aziendali. Il sistema si basa su una serie di obiettivi strategici dell’azienda e un insieme di relazioni causa-effetto che mettono in relazione tali obiettivi. Scopo di questo articolo è quello di proporre un estensione del sistema delle Balanced Scorecard che prevede un più raffinato insieme di relazioni tra obiettivi. La formalizzazione di tali relazioni permetterà, inoltre, di esplicitare tipi di ragionamento e logiche manageriali automatizzabili mediante sistemi software in grado si supportare il lavoro dirigenziale.", "num_citations": "2\n", "authors": ["1449"]}
{"title": "Towards the development of secure information systems: Security Reference Diagram and Security Attack Scenarios\n", "abstract": " Security is one of the main challenges that developers of information systems face. However, current methodologies for information system development do not provide enough evidence of integrating successfully security concerns throughout the whole range of the development process. In this paper, we provide an approach towards the solution of two of the problems associated with the integration of security. Moreover, we describe how our approach can be integrated within the Tropos methodology and we illustrate it with the aid of a real-life example.", "num_citations": "2\n", "authors": ["1449"]}
{"title": "Supporting tropos concepts in agent OPEN\n", "abstract": " The growth of interest in agent-orientation as a new paradigm has introduced the need for developing concepts, tools and techniques for modeling and engineering agent-based software systems. Object technology has been supporting the development of information systems for many years but is now slowly evolving to encompass more recent ideas relating to the concept of “agent”. Integrating agent concepts into existing OO methodologies has resulted in several agent-oriented methodologies, one of which is Agent OPEN. In this paper, we evaluate the existing Agent OPEN description against ideas formulated within Tropos, an agent-oriented software development methodology.", "num_citations": "2\n", "authors": ["1449"]}
{"title": "Collaborative Filtering via Implicit Culture Support\n", "abstract": " This report has been submitted forpublication outside of ITC and will probably be copyrighted if accepted for publication. It has been issued as a Technical Report forearly dissemination of its contents. In view of the transfert of copy right tothe outside publisher, its distribution outside of ITC priorto publication should be limited to peer communications and specificrequests. After outside publication, material will be available only inthe form authorized by the copyright owner.", "num_citations": "2\n", "authors": ["1449"]}
{"title": "Implicit culture and multi-agent systems\n", "abstract": " Agents' autonomy and incoming agents can prevent a multi-agent system from ful lling its requirements. Given a group of autonomous agents acting in an environment it should be useful to exploit information about their actions in order to improve the single agent's knowledge and behavior, and guarantee the realization of the requirements. In this paper, we introduce the concept of implicit culture and propose a general architecture for Systems for Implicit Culture Support (SICS). We show how it is possible to use a SICS to guarantee the persistence of the multi-agent system's requirements; we present some existing systems that can be considered as instances of our architecture; andnally, we consider the related work.", "num_citations": "2\n", "authors": ["1449"]}
{"title": "Distributed knowledge elicitation through the Dempster-Shafer theory of evidence: a simulation study\n", "abstract": " This paper reports the results of an experiment carried on MASSIM, a specific multi-agent simulation testbed. There are two files, one containing true propositions and the other containing their correspective negations. Five agents in turn access one of these files. Each agent has a “capacity” that will be used as the frequency with which the agent accesses the file with the correct knowledge. Agents randomly exchange information with the others. Since they have limited degrees of capacity, their knowledge bases quickly become inconsistent. Each agent is equipped with the same belief revision mechanism to detect and solve these contradictions. This embodies the Dempster-Shafer theory of evidence to evaluate the credibility of the various pieces of information and estimate the reliability of the other agents. In this way, the agents learn from the others and about the others’ trustworthiness and capability. We call this global process “Distributed Knowledge Elicitation”. The purpose of the experiments was that of evaluating on a statistical basis, the emergent global performances of the local belief revision mechanism. This Distributed Knowledge Elicitation increases the amount of information available at each agent and flattens their degree of correctness.", "num_citations": "2\n", "authors": ["1449"]}
{"title": "From Secure Business Process Modeling to Design-Level Security Verification (long version)\n", "abstract": " Tracing and integrating security requirements throughout the development process is a key challenge in security engineering. In socio-technical systems, security requirements for the organizational and technical aspects of a system are currently dealt with separately, giving rise to substantial misconceptions and errors. In this paper, we present a model-based security engineering framework for supporting the system design on the organizational and technical level. The key idea is to allow the involved experts to specify security requirements in the languages they are familiar with: business analysts use BPMN for procedural system descriptions; system developers use UML to design and implement the system architecture. Security requirements are captured via the language extensions SecBPMN2 and UMLsec. We provide a model transformation to bridge the conceptual gap between SecBPMN2 and UMLsec. Using UMLsec policies, various security properties of the resulting architecture can be verified. In a case study featuring an air traffic management system, we show how our framework can be practically applied.", "num_citations": "2\n", "authors": ["1449"]}
{"title": "An Ontology for Privacy Requirements via a Systematic Literature Review\n", "abstract": " Privacy has emerged as a key concern for business and social computing as security breaches have compromised personal data for millions. Despite this, much of existing work on privacy requirements deal with them as a special case of security requirements, thereby missing essential traits of such requirements. In this context, wrong design decisions may be made due to an insufficient understanding of privacy. The main contribution of this paper is an ontology for privacy requirements that subsumes whatever proposals exist in the literature. The ontology was obtained through a systematic literature review concerning the literature on privacy, conducted in two phases, and followed by a consolidation phase where similar concepts were combined. The proposed ontology has been developed to be used by software engineers when dealing with privacy requirements, and since it is based on a systematic literature …", "num_citations": "1\n", "authors": ["1449"]}
{"title": "Applying Acceptance Requirements to Requirements Modeling Tools via Gamification: A Case Study on Privacy and Security\n", "abstract": " Requirements elicitation, analysis and modeling are critical activities for software success. However, software systems are increasingly complex, harder to develop due to an ever-growing number of requirements from numerous and heterogeneous stakeholders, concerning dozens of requirements types, from functional to qualitative, including adaptation, security and privacy, ethical, acceptance and more. In such settings, requirements engineers need support concerning such increasingly complex activities, and Requirements Engineering (RE) modeling tools have been developed for this. However, such tools, although effective, are complex, time-consuming and requiring steep learning curves. The consequent lack of acceptance and abandonment in using such tools, by engineers, paves the way to the application of RE techniques in a more error-prone, low-quality way, increasing the possibility to have failures …", "num_citations": "1\n", "authors": ["1449"]}
{"title": "Next Release Tool\n", "abstract": " In this paper we present Next Release Tool (NRT), a software tool that supports modeling and reasoning to solve the next release problem. NRT supports a goal-oriented modeling language and uses an underlying satisfiability modulo theorem (SMT) solver with optimization capabilities.", "num_citations": "1\n", "authors": ["1449"]}
{"title": "Designing Sociotechnical Systems with Protos.\n", "abstract": " Traditional requirements engineering approaches give little emphasis on the engineering of interactions. Increasingly, the software systems of today are developed independently and integrated with each other, as in sociotechnical systems, where several technical systems support the interaction between the social systems. We propose the Protos methodology as a set of refinement rules which, once applied to the stakeholder requirements, produce multiple specifications as a solution to the requirements problem of sociotechnical systems. We use the London Ambulance System as an example domain.", "num_citations": "1\n", "authors": ["1449"]}
{"title": "Tax and Revenue Service Scenario for Ontology Matching.\n", "abstract": " In this paper we present a scenario for ontology matching posed by the Trentino Riscossioni SpA data integration system focusing the opportunity to enhance the level of data integration over a large set of Tax and Revenue industry-specific data sources.Introduction. The mission of Trentino Riscossioni SpA 1, a company owned by the Autonomous Province of Trento, is to promote simplification processes and harmonize the activity of more than 250 public entities in the province, creating policies for fair taxation and for operating costs reduction. The need for consistent and contextual use of the heterogeneous information sources between its offices, the municipalities and the other public bodies is a fundamental requirement for the implementation of an accurate and balanced taxation system. In this paper we want to focus on the possibility offered by matching technology [1] to enhance the in the present day data integration architecture and increase its flexibility in managing hundreds of new data sources with reduced software development for each new sources added. Besides, even if the data integration has been extensively studied in the database community, according to some recent research works [2, 3, 4, 5], the issue to improve the automatic schema matching in a data integration scenario for the Tax and Revenue market is a relative new ground of application. The contribution of this paper includes a specific scenario focusing several of the basic requirements that have to be considered in order to build a data integration system capable to support dynamically hundreds of data sources.", "num_citations": "1\n", "authors": ["1449"]}
{"title": "Modelling and Analyzing Location-based Requirements: Goal-oriented Approach\n", "abstract": " In emerging computing paradigms, such as mobile information systems, there is a strong relation between the system requirements and location. The system may operate in various locations and location can be a main factor in deciding the requirements to meet and the way to meet them. In this paper, we propose a goal-oriented requirements engineering approach to model and analyze location-based requirements. We propose a set of modelling constructs to represent location, show how to capture location-based requirements via location-based goal model, and present a set of analysis and reasoning techniques about the formalized models.", "num_citations": "1\n", "authors": ["1449"]}
{"title": "Balancing Business Perspectives in Requirements Analysis\n", "abstract": " In modern organisations, the development of an Information System answers to strategic needs of the business. As such, it must be aligned at the same time with software and corporate goals. Capturing its requirements is a complex task as it have to deal with a variety of different and potentially conflicting needs. In this paper, we propose a novel conceptual framework for requirements modelling and validation, based on economic and business strategy theory.", "num_citations": "1\n", "authors": ["1449"]}
{"title": "Bartercell: an agent-based bartering service for users of pocket computing devices\n", "abstract": " On behalf of nomadic users and through the use of computing pocket devices, agents can efficiently operate in wireless networks, cooperate to resolve complex tasks and negotiate to reach agreements while attempting to maximize their utilities. However, the negotiation protocols intelligent agents use are hardly considering several of the requirements evolved after the increasing reliance on mobility. In this paper we present a new negotiation protocol that avoids the use of mediating agents and applies a voting-like mechanism to handle service requests of nomadic users in wireless networks. We examine our approach in a scenario where it is essential for a multi-agent system to establish a chain of mutually attracted agents seeking to fulfill different bartering desires. We compare the results obtained with those produced after using an adjusted version of the Strategic Negotiation Model.", "num_citations": "1\n", "authors": ["1449"]}
{"title": "Applying Tropos to Socio-Technical System Design and Runtime Configuration\n", "abstract": " Recent trends in Software Engineering have introduced the importance of reconsidering the traditional idea of software design as a socio-tecnical problem, where human agents are integral part of the system along with hardware and software components. Design and runtime support for Socio-Technical Systems (STSs) requires appropriate modeling techniques and non-traditional infrastructures. Agent-oriented software methodologies are natural solutions to the development of STSs, both humans and technical components are conceptualized and analyzed as part of the same system. In this paper, we illustrate a number of Tropos features that we believe fundamental to support the development and runtime reconﬁguration of STSs. Particularly, we focus on two critical design issues: risk analysis and location variability. We show how they are integrated and used into a planning-based approach to support the designer in evaluating and choosing the best design alternative. Finally, we present a generic framework to develop self-reconﬁgurable STSs.", "num_citations": "1\n", "authors": ["1449"]}
{"title": "Uncertainty dimensions of risks in secure and dependable domain\n", "abstract": " Most of the critical aspects for secure and dependable systems, such as safety, integrity, availability, are related to uncertainty. Literature proposes many approaches to deal with uncertainty, mainly in the area of risk management and safety&reliability engineering. However, what is still missing is a clear understanding of the nature of uncertainty that very often has produced mistreatments in the design. In this paper, we propose a conceptual model for uncertainty that can be used to deal with systems’ qualities such as security and dependability. Particularly, we will consider the relation between uncertainty-risk and how risk affects several quality attributes of the system. This understanding is necessary for the evaluation of design alternatives. We use a case study in Air Traffic Management to illustrate our approach.", "num_citations": "1\n", "authors": ["1449"]}
{"title": "A multi-agent system for knowledge management based on the implicit culture framework\n", "abstract": " We present an implementation of a multi-agent system whose goal is to solve the problem of tacit knowledge transfer by means of sharing of experiences. In particular, we consider experiences of use of pieces of information. Each agent incorporates a systems for implicit culture support (SICS) whose goal is to realize the acceptance of the information suggested. The SICS permits a transparent, namely implicit, sharing of the information about the use, e.g. requesting and accepting, of pieces of information.", "num_citations": "1\n", "authors": ["1449"]}
{"title": "Toward a revision for multi-context systems\n", "abstract": " The behavior of agents acting on an external world strongly depends on their ability of changing opinions and intentions with respect to changes in the environment. Although, multi-context systems have been successfully applied for defining agents mental states’ architecture, no revision methods for multi-context systems have been proposed to deal with the dynamicity of the environment. In this paper we first introduce BDI agents modeled by multi-context systems, and then we propose an extension of a basic belief revision framework to multi-context systems.", "num_citations": "1\n", "authors": ["1449"]}
{"title": "A self-diagnosing distributed monitoring system for nuclear power plants\n", "abstract": " Sensor data fusion and interpretation, sensor failure detection, isolation and identification are extremely important activities for the safety of a nuclear power plant. In particular, they become critical in cases of conflicts among the data. If the monitored system's description model is correct and its components work properly, then incompatibilities among data may only be attributed to temporary deterioration or permanent breakage of one or more sensors. This paper introduces and discusses the conception of a distributed monitoring system able to attach each sensor with a statistically-evaluated relative degree of reliability, which is especially useful for devices situated in dangerous zones or areas, difficult to reach inside huge and complex power plants.", "num_citations": "1\n", "authors": ["1449"]}