{"title": "PKLot–A robust dataset for parking lot classification\n", "abstract": " Outdoor parking lot vacancy detection systems have attracted a great deal of attention in the last decade due the large number of practical applications. However, a common problem that researchers in this field very often face is the lack of a representative dataset to perform their experiments. To mitigate this difficulty, in this paper we introduce a new parking lot dataset composed of 695,899 images captured from two parking lots with three different camera views. The acquisition protocol allows obtaining static images showing illumination variance related to sunny, overcast and rainy days. We believe that researchers will find this dataset a very useful tool since it allows future benchmarking and evaluation. The dataset is currently available for research purposes upon request. To gain a better insight into this dataset we have evaluated two textural descriptors, Local Binary Patterns and Local Phase Quantization …", "num_citations": "201\n", "authors": ["1091"]}
{"title": "Adapting dynamic classifier selection for concept drift\n", "abstract": " One popular approach employed to tackle classification problems in a static environment consists in using a Dynamic Classifier Selection (DCS)-based method to select a custom classifier/ensemble for each test instance according to its neighborhood in a validation set, where the selection can be considered region-dependent. This idea can be extended to concept drift scenarios, where the distribution or the a posteriori probabilities may change over time. Nevertheless, in these scenarios, the classifier selection becomes not only region but also time-dependent. By adding a time dependency, in this work, we hypothesize that any DCS-based approach can be used to handle concept drift problems. Since some regions may not be affected by a concept drift, we introduce the idea of concept diversity, which shows that a pool containing classifiers trained under different concepts may be beneficial when dealing with …", "num_citations": "57\n", "authors": ["1091"]}
{"title": "Parking space detection using textural descriptors\n", "abstract": " In this paper we assess the use of textural de-scriptors for the problem of parking space detection. We focus our experiments on two descriptors (Local Binary Patterns and Local Phase Quantization) that have attracted a great deal of attention because of their outstanding performance in a number of applications. We show through a series of comprehensive experiments that both descriptors are able to achieve very low error rates on a database composed of 105,837 images of parking spaces. We also show that the combination of the diverse classifiers developed in this work can bring further improvement achieving an error rate of 0.16%. The results reached in this work compare favorably to other published methods.", "num_citations": "23\n", "authors": ["1091"]}
{"title": "Handling concept drifts using dynamic selection of classifiers\n", "abstract": " This work describes the Dynse framework, which uses dynamic selection of classifiers to deal with concept drift. Basically, classifiers trained on new supervised batches available over time are add to a pool, from which is elected a custom ensemble for each test instance during the classification time. The Dynse framework is highly customizable, and can be adapted to use any method for dynamic selection of classifiers given a test instance. In this work we propose a default configuration for the framework which has provided promising results in a range of problems. The experimental results have shown that the proposed framework achieved the best average rank when considering all datasets, and outperformed the state-of-the-art in three of four tested datasets.", "num_citations": "17\n", "authors": ["1091"]}
{"title": "Music genre classification using dynamic selection of ensemble of classifiers\n", "abstract": " This paper presents a dynamic ensemble selection method for music genre classification which employs two pools of diverse classifiers. The pools of classifiers are created by using different features types extracted from three distinct segments of each music piece. From these initial pools of weak classifiers, ensembles of classifiers are dynamically selected for each test pattern using the k-nearest oracles method. The experiments compare the performance of different selection strategies on the Latin Music Database to those related to the use of best single classifier, and to the combination of all classifiers in the pool. It was possible to observe that the most promising selection strategy evaluated allows improving the classification accuracy from 63.71% to 70.31%.", "num_citations": "13\n", "authors": ["1091"]}