{"title": "Vibration based condition monitoring: a review\n", "abstract": " Vibration based condition monitoring refers to the use of in situ non-destructive                 sensing and analysis of system characteristics –in the time, frequency or                 modal domains –for the purpose of detecting changes, which may indicate                 damage or degradation. In the field of civil engineering, monitoring systems have                 the potential to facilitate the more economical management and maintenance of modern                 infrastructure. This paper reviews the state of the art in vibration based condition                 monitoring with particular emphasis on structural engineering applications.", "num_citations": "1679\n", "authors": ["1062"]}
{"title": "Three-dimensional modelling and full-scale testing of stone arch bridges\n", "abstract": " Existing test results of full-scale in-service masonry arch bridges are analysed to determine appropriate material properties for the modelling of this structural type. Three-dimensional nonlinear finite element models of three masonry arch bridges are generated using a commercially available finite element package. The behaviour of the masonry is replicated by use of a solid element that can have its stiffness modified by the development of cracks and crushing. The fill is modelled as a Drucker–Prager material, and the interface between the masonry and the fill is characterised as a frictional contact surface. The bridges are modelled under service loads, and the model results are compared to the results of a program of field testing of the structures. It is found that the assumption of a reasonable set of material properties, based on visual observations of the material and construction of the structure, implemented …", "num_citations": "289\n", "authors": ["1062"]}
{"title": "Nonlinear models of reinforced and post-tensioned concrete beams\n", "abstract": " Commercial finite element software generally includes dedicated numerical models for the nonlinear response of concrete under loading. These models usually include a smeared crack analogy to account for the relatively poor tensile strength of concrete, a plasticity algorithm to facilitate concrete crushing in compression regions and a method of specifying the amount, the distribution and the orientation of any internal reinforcement. The numerical model adopted by ANSYS is discussed in this paper. Appropriate numerical modelling strategies are recommended and comparisons with experimental load-deflection responses are discussed for ordinary reinforced concrete beams and post-tensioned concrete T-beams.", "num_citations": "221\n", "authors": ["1062"]}
{"title": "Ultimate response of RC beams strengthened with CFRP plates\n", "abstract": " Poststrengthening and retrofitting is a growing reality, as existing structures are required to meet the demands of modern society. Apart from the need to increase load capacity, upgrading of a structure may be necessitated through deterioration of the structure by corrosion or accidental damage, a change in the structural system, or to rectify initial design and construction faults. A commonly observed mode of failure for beams strengthened using carbon-fiber-reinforced polymer composite material plates is one due to the plate peeling off prematurely and unpredictably at relatively low magnitudes of applied loading. End plate anchorages and long unanchored plate lengths, which can add significantly to the overall cost of a strengthening solution, overcome this problem. This paper presents the results of flexural tests on ten reinforced concrete beams strengthened with different plate configurations. A strain …", "num_citations": "186\n", "authors": ["1062"]}
{"title": "Longitudinal and transverse effects in masonry arch assessment\n", "abstract": " Recent advances in the analysis of masonry arch bridges, substantiated by extensive testing programs in the United States and Europe, provide bridge engineers and inspectors with increasing confidence that reasonable estimates can be made of the capacity of these structures. Observations of ultimate strength testing indicate that spandrel walls and fill contribute greatly to the strength and stiffness of these structures, and that loads approaching the plastic collapse load can often be obtained. Observations from service load testing indicate that the development of cracking and non-linearity under service loads can be a significant indicator of the capacity of the structure. Modeling of these structures has shown the importance of restraint of the abutment to the overall resistance of the structure, and has recently shown the importance of transverse effects in diminishing the strength of structures with high spandrel …", "num_citations": "117\n", "authors": ["1062"]}
{"title": "Testing and long-term monitoring of a curved concrete box girder bridge\n", "abstract": " Capital investment in national infrastructure is significant. The need to maintain and protect critical infrastructure links has led in recent years to significant developments in the area of structural health monitoring. The objective is to track a structure’s long-term performance, typically using sensors, and to successively compare the most recently measured responses with prior response history. During construction of the West Street On-Ramp, a curved concrete box girder bridge, located in the city of Anaheim (California), eleven accelerometers were permanently installed on its bridge deck. The associated data acquisition system was configured to record once a specified threshold acceleration response was exceeded; during the period 2002–2010 a total of 1350 datasets including six earthquakes, for each of the eleven sensors, were acquired. This automatically acquired data was supplemented, during the summer …", "num_citations": "87\n", "authors": ["1062"]}
{"title": "Mechanical behaviour and 3D stress analysis of multi-layered wooden beams made with welded-through wood dowels\n", "abstract": " This paper presents experimental and numerical investigations on multi-layered timber beams using welded-through wood dowels in place of traditional poly(vinyl acetate) (PVAc)-adhesives (or metallic nails). Four-layer beams were constructed with varying numbers of dowels, in each, and then loaded using four-points bending tests to evaluate the mechanical performance of these beams. The practical difficulties encountered in constructing deeper multi-layer beams are discussed and possible solutions which have been employed for the purpose of this work, and proved successful are presented. In order to investigate thoroughly the full potential of multi-layered beams with a very limited number of experimental studies, a 3D FE model has been presented, validated against experimental results and then used to study some influential parameters. The results showed that a reasonable bending stiffness of multi …", "num_citations": "79\n", "authors": ["1062"]}
{"title": "Enhancement factors for the vertical response of footbridges subjected to stochastic crowd loading\n", "abstract": " The vertical acceleration response of a hypothetical footbridge is predicted for a sample of single pedestrians and a crowd of pedestrians using a probabilistic approach. This approach uses statistical distributions to account for the fact that pedestrian parameters are not identical for all pedestrians. Enhancement factors are proposed for predicting the response due to a crowd based on the predicted accelerations of a single pedestrian. The significant contribution of this work is the generation of response curves identifying enhancement factors for a range of crowd densities and synchronization levels.", "num_citations": "54\n", "authors": ["1062"]}
{"title": "System identification of a building from multiple seismic records\n", "abstract": " This paper describes the identification of finite dimensional, linear, time‐invariant models of a 4‐story building in the state space representation using multiple data sets of earthquake response. The building, instrumented with 31 accelerometers, is located on the University of California, Irvine campus. Multiple data sets, recorded during the 2005 Yucaipa, 2005 San Clemente, 2008 Chino Hills and 2009 Inglewood earthquakes, are used for identification and validation. Considering the response of the building as the output and the ground motion as the input, the state space models that represent the underlying dynamics of the building in the discrete‐time domain corresponding to each data set are identified. The time‐domain Eigensystem Realization Algorithm with the Observer/Kalman filter identification procedure are adopted in this paper, and the modal parameters of the identified models are consistently …", "num_citations": "51\n", "authors": ["1062"]}
{"title": "2-D analysis of arch bridges using an elasto-plastic material model\n", "abstract": " A general method for the static determination of the continuous distribution of internal forces and displacements in arbitrarily shaped arch bridges under different load conditions is proposed. The basis of the elasto-plastic model are three equations of equilibrium: horizontal equilibrium, vertical equilibrium and equilibrium of moments. Boundary conditions are added to impose restrictions on the horizontal and vertical movement and on rotations at the abutments of the arch. For masonry arches, it is necessary to include material properties that allow the occurrence of cracks and the subsequent formation of hinges. This theory has been implemented in a computer program that was subsequently used to calculate the results of the two examples presented here, an arch loaded with a vertical point load and under the influence of a horizontal displacement of one abutment.", "num_citations": "47\n", "authors": ["1062"]}
{"title": "Characteristic vertical response of a footbridge due to crowd loading.\n", "abstract": " The characteristic vertical vibration of a flexible footbridge subject to crowd loading is examined in this paper. Typically, bridge vibrations produced from a crowd of pedestrians are estimated by using an enhancement factor applied to the effect caused by a single pedestrian. In this paper, a single pedestrian model, represented by a spring mass damper, which incorporates variables such as pedestrian mass and body stiffness, is used to calibrate a computationally efficient moving force model. This calibrated moving force model is further used in Monte Carlo simulations of non-homogenous crowds to estimate characteristic vertical vibration levels. Enhancement factors, which could be applied to simple single pedestrian moving force models in estimating the response due to a crowd are thus derived. Such enhancement factors are then compared to previously published values. It is found that the greatest difference between the spring mass damper and moving force models respectively occurs when the bridge frequency is at the mean crowd pacing frequency. For bridges with frequencies even slightly removed from this mean, moving force models appear adequate.", "num_citations": "45\n", "authors": ["1062"]}
{"title": "Experimental study of timber-to-timber composite beam using welded-through wood dowels\n", "abstract": " This paper presents exploratory research related to novel full-scale multi-layered timber beams with composite action achieved with welded-through wood dowels. Different multi-layer beam designs, where the timber layers were interconnected with welded wood dowels providing interlayer shear resistance, were tested in bending with different dowel densities. The main originality of this study is the achievement of dowel welds through greater depths of sections than has previously proved possible. The practical difficulties encountered in constructing deeper multi-layer beams, and the successful solutions arrived at, are discussed. The significance of the research reported is the demonstrated ability to produce multilayered timber sections which are structurally efficient and do not require non timber based joining agents such as nails or adhesive.", "num_citations": "41\n", "authors": ["1062"]}
{"title": "Smeared crack models of RC beams with externally bonded CFRP plates\n", "abstract": " Concrete, a complex mix of variously sized aggregates, sand, water, additives and cement binder, is one of the more common engineering materials used for the design and construction of structures and bridges. Concrete is characterised by good compressive strength properties but it demands the use of internal reinforcement, generally in the form of round steel bars, to carry tensile stresses. The strength of the resulting element is dependent on the amount and distribution of steel reinforcement included during construction. It is not however possible to include additional internal reinforcement after construction in the event of the applied loading being increased and therefore consideration must be given to strengthening the structure externally, demolishing it, or confining it to specific usage, for example a maximum weight restriction on a bridge. In circumstances where restricted usage is not practicable …", "num_citations": "37\n", "authors": ["1062"]}
{"title": "Load testing and model simulations for a stone arch bridge\n", "abstract": " Service and high level load tests on a typical single span stone arch bridge in the south of Ireland and an associated set of three-dimensional nonlinear numerical analyses are discussed in this paper. The three-dimensional finite element models, which were generated using a commercially available finite element package, include the arch fill and a frictionless contact interface between this fill and the spandrel walls modelled with a nonlinear smeared crack material model. While this modelling strategy has been previously corroborated for service load levels, the results of the numerical model (which are compared with results from the experimental tests) also demonstrate the suitability of this modelling strategy at higher load levels. Finally, the suitability of three-dimensional solid models in the context of stone arch bridge assessment is discussed.", "num_citations": "34\n", "authors": ["1062"]}
{"title": "A novel interactive pedestrian load model for flexible footbridges\n", "abstract": " This paper describes the modelling strategies employed to simulate the interaction between a flexible and perceptibly moving ultra-lightweight composite material footbridge and a crossing pedestrian. Initially a finite element model of the footbridge, validated by comparison with measured modal data, was analysed under transient load conditions, using existing vertical load models, to simulate the measured vertical responses from single pedestrian crossings of this bridge. Comparison of the measured and predicted bridge responses displayed good agreement for most cases. The exceptions were when the pacing frequency of the test subjects was close to the resonant frequency of the bridge, where it was found that the simulations overestimated the actual response. These initial vertical simulations used moving load models, consistent with current codes of practice, which do not consider any interaction between the pedestrian and the excited structure. In this paper a moving spring-mass-damper, representing a pedestrian, with stiffness and damping characteristics based on reported biomechanical studies, is proposed as an improved alternative. This spring-mass-damper approach to modelling the crossing pedestrians allows for interaction between the pedestrian and the footbridge. Using this interactive model the measured and predicted bridge responses are shown to display good agreement for all pacing frequencies.", "num_citations": "34\n", "authors": ["1062"]}
{"title": "Experimentally validated added mass identification algorithm based on frequency response functions\n", "abstract": " A methodology is presented for detecting added mass in structural systems maintaining a linear response. A single frequency response function measured at several frequencies along with a correlated analytical model of the structure in its original state are used to detect and quantify the added mass. A computationally efficient method of recalculating a single frequency response function is utilized in the identification algorithm. Experimental results from a frame structure are presented to validate and assess the proposed approach.", "num_citations": "28\n", "authors": ["1062"]}
{"title": "Modelling effect of non-structural partitions on floor modal properties\n", "abstract": " Non-structural cladding and partitions can have significant stiffening effects on the vertical vibration behaviour of floors in buildings. Such effects are currently difficult to quantify and use in design. To quantify them, modal properties of two structurally identical full-scale floors in a real fitted-out building were measured and compared to results for the same floors prior to installation of internal partitions and cladding panels. In its bare frame state the modal properties of both floors were found to be nominally identical. However, when tested after the installation of internal partitions and external cladding panels, it was found that the addition of these non-structural elements increased the stiffness of both floors and also altered significantly their modes of vibration, in particular natural frequencies and mode shapes. The fundamental natural frequencies increased by 30% for both fitted out floors relative to their bare state …", "num_citations": "27\n", "authors": ["1062"]}
{"title": "Auto-regression and statistical process control techniques applied to damage indication in telecommunication masts\n", "abstract": " The authors and ESAT Digifone, a telecommunication company in the Republic of Ireland are examining the potential of using measured vibration data for structural integrity assessment of telecommunication masts and towers. At present'climb-down'inspections, which are nonscientific, qualitative and relatively expensive, are undertaken. ESAT Digifone currently owns and maintains approximately 200 telecommunication towers. It is anticipated that this number will rise to 1000 over the next few years and more quantitative methods of assessment, which could assist in prioritising these structures for repair and maintenance work, would be attractive management and quality control tools.This paper discusses auto-regressive and statistical pattern recognition techniques for damage identification in the context of telecommunication masts. An auto regressive function, developed using optimisation techniques, is used to …", "num_citations": "27\n", "authors": ["1062"]}
{"title": "Load rating of masonry arch bridges: refinements\n", "abstract": " In a paper previously published by the first writer, a procedure for load-rating masonry arch bridges was introduced. The procedure uses the Load Factor Method of the 1994 American Association of State Highway and Transportation Officials Manual for the Condition Evaluation of Bridges, applied to a frame analysis model of a masonry arch spanning from abutment to abutment. The procedure is based on the assumption of the arch barrel having no tensile strength. The objective of this technical note is to complement the initial procedure by enabling the assessing engineer to exercise discretion in deciding whether or not a small value of tensile strength should be allowable in determining a suitable rating for masonry arch bridges. In addition the initially proposed strength values, which are considered overly conservative, are increased. The introduction of these refinements will allow a more accurate assessment of …", "num_citations": "24\n", "authors": ["1062"]}
{"title": "A parametric study of pedestrian vertical force models for dynamic analysis of footbridges.\n", "abstract": " Footbridge vibration has received much attention in recent years. However, stochastic models for crowd loading are not common, and estimation of crowd-induced vibration is typically done through enhancement factors applied to single pedestrian loading models. This work compares two such models, a moving force model and a spring-mass-damper model (SMD). Typical ranges for various pedestrian parameters are examined, and it is found that the pacing frequency has by far the greatest influence on bridge vibration response. It is also found that the magnitude of the response for pacing frequencies near the bridge natural frequency is lower for the SMD model, but otherwise the results prove similar. This suggests that moving SMD models may be more suitable than moving force models when the bridge natural frequency is in the critical frequency range.", "num_citations": "23\n", "authors": ["1062"]}
{"title": "Damage detection based on single-input-single-output measurements\n", "abstract": " A methodology is presented for detecting damage of structural systems maintaining a linear response. A single frequency response function measured at several frequencies along with a correlated analytical model of the undamaged structure are used to detect and assess damage. The method is directed toward situations where the number of damaged elements is generally known to be limited. A computationally efficient method of recalculating a single receptance is presented. Numerical results for a two-dimensional structural frame are presented to validate and assess the proposed approach. Issues for the development of the approach are discussed.", "num_citations": "20\n", "authors": ["1062"]}
{"title": "The evolving dynamic response of a four storey reinforced concrete structure during construction\n", "abstract": " Structures include elements designated as load bearing and non-load bearing. While non-load bearing elements, such as facades and internal partitions, are acknowledged to add mass to the system, the structural stiffness and strength is generally attributed to load bearing elements only. This paper investigates the contribution of non-load bearing elements to the dynamic response of a new structure, the Charles Institute, in the grounds of University College Dublin (UCD) Ireland. The vertical vibration response of the first floor and the lateral response at each floor level were recorded at different construction stages. The evolution of the structural response as well as the generation of a finite element (FE) model is discussed. It was found that the addition of the non-load bearing facades increased the first floor natural frequency from 10.7 Hz to 11.4? Hz, a change of approximately+ 6.5%. Similarly these external …", "num_citations": "17\n", "authors": ["1062"]}
{"title": "The deployment analysis of a large space antenna\n", "abstract": " The volume constraints imposed by current launch modules and the desirability of large reflectors and communication booms for space applications has given rise to active research in the field of deployable systems. These systems are stowed in a compact package for launch before being deployed into their operating configurations in orbit.A new concept for a deployable antenna is presented. The deployment of one such 5.0 m antenna is investigated. The antenna is deployed by a number of mechanical joints. The energy stored in these joints is quantified and the deployment times and stresses at ‘latch-up’ are predicted.", "num_citations": "17\n", "authors": ["1062"]}
{"title": "Traditional and operational modal testing of masonry vaults\n", "abstract": " This paper discusses the practical and technical differences between the usual form of experimental modal analysis (EMA) and operational modal analysis (OMA), as applied to Gothic-style masonry vaulted structures. In situ vibration measurements were collected from the masonry fan vaults of the National Cathedral in Washington, DC, USA. Instrumented impact hammer excitation was used during the experimental traditional modal analysis (TMA) tests, while excitation by peal bells, carillon bells, organ, an orchestra and chorus, and ambient noise were exploited for OMA. The acoustic inputs of the first four excitation types were measured using a microphone and were found to approximate a uniform acoustic excitation across the frequency bandwidth of interest during the carillon and the orchestra and chorus excitations. For both TMA and OMA, system identification was completed by the least-squares complex …", "num_citations": "15\n", "authors": ["1062"]}
{"title": "Experimentally-based assessment of masonry arch bridges\n", "abstract": " This paper presents a summary of a continuing research programme intended for the development of generally applicable assessment procedures for masonry arch bridges, for which the assumptions and assessment results can be justified by experimental observations. The research is being undertaken in three phases. Phase I consists of experimental testing of bridges under service loads for the purpose of observation of bridge behaviour. A further purpose of the experimental programme is to provide data for the validation of three-dimensional non-linear finite-element models. In Phase II, three-dimensional non-linear finite-element models capable of capturing the principal features of the bridge response, based on a prescribed procedure and using standardised values of strength and stiffness, were developed. In Phase III the application of a two-dimensional model for the assessment of stone masonry bridges …", "num_citations": "14\n", "authors": ["1062"]}
{"title": "Nonlinear finite element analysis of semi-rigid bolted end-plate connections\n", "abstract": " Pascal 001 Exact sciences and technology/001A Sciences and techniques of general use/001A02 Mathematics/001A02I Numerical analysis. Scientific computation/001A02I02 Methods of scientific computing (including symbolic computation, algebraic computation)", "num_citations": "14\n", "authors": ["1062"]}
{"title": "Impact of nonstructural components on modal response and structural damping\n", "abstract": " Damping in a building has significant impact on the amplitude of structural response. The trend towards lighter primary and secondary structural elements in modern buildings has led to structures being more susceptible to vibration. The level of vibration is largely dependent on the structure’s total damping, which includes structural and non-structural damping along with other factors. This paper discusses the effect of non-structural elements, on the damping characteristics of a four storey reinforced concrete structure. The dynamic properties of the test structure considered, a new build on the campus of University College Dublin, were determined by post-processing ambient and forced vibration response data measured in-situ on the first floor at various stages of construction, including prior to and post installation of non-structural elements. Post-processing of measured ambient responses was undertaken …", "num_citations": "13\n", "authors": ["1062"]}
{"title": "Pedestrian bridge vibration serviceability: a case study in testing and simulation\n", "abstract": " Pedestrian bridges are increasingly becoming landmark structures designed to promote a modern vibrant image of their surrounding landscape. Designs are becoming more daring; spans are increasing and becoming more slender and the use of lightweight materials is more prevalent. The net result is that it is often the serviceability limit state, rather than the ultimate limit state, that controls the bridge design. Sean O'Casey Bridge, Dublin, is the most recently constructed pedestrian bridge over the River Liffey. This articulated steel bridge, designed by O'Connor Sutton Cronin Consulting Engineers following an international design competition, is located in Dublin's docklands and spans approximately 88m across the river. This paper describes the pedestrian crossing tests, experimental modal analyses, and associated numerical modelling undertaken to assess vibration serviceability. The results of these analyses …", "num_citations": "12\n", "authors": ["1062"]}
{"title": "Investigation of the rail-induced vibrations on a masonry historical building\n", "abstract": " Increasingly historic masonry buildings are subjected to higher levels of traffic and rail vibrations due to urbanization and population growth. Deterioration and destabilisation of these buildings may result, especially if they were previously damaged (eg earthquakes or settlement problems). To better understand building response, vibration measurements were conducted on the Little Hagia Sophia Mosque, located adjacent to Istanbul’s Sirkeci-Halkali railway line. Transport-induced vibrations were recorded at several points on the ground and building. Attenuation characteristics in the ground and amplification features on the building were examined. Peak particle velocities often exceeded previously established thresholds for human perception and in some cases for structural damage. These are evaluated with respect to the building’s condition.", "num_citations": "12\n", "authors": ["1062"]}
{"title": "Rationalising assessment approaches for masonry arch bridges\n", "abstract": " Masonry arch bridges, most of which have far exceeded modern design lives, have demonstrated themselves to be sustainable structures with low life-cycle costs. However, increased traffic loading and material deterioration over time necessitate periodic reassessment of these structures. There are numerous different analytical methods available for the assessment of masonry arch bridges. The expectation is that for increasing levels of assessment complexity an increase in load capacity converging on the ultimate capacity would be achieved. In this paper it is demonstrated that this is not always the case. This has cost implications for both the bridge assessment itself and for costs associated with load restrictions and strengthening measures. Five different assessment methods were selected to assess a set of 11 single-span bridges, ranging in span from 2·4 m to 15·2 m, with the objective of reviewing and …", "num_citations": "11\n", "authors": ["1062"]}
{"title": "Nonstructural partitions and floor vibration serviceability\n", "abstract": " Nonstructural vertical partitions and cladding can have a significant effect on the vibration serviceability of floor systems. A typical modern office building, consisting of steel–concrete composite floor systems, was created to investigate the potential beneficial effects of integrating nonstructural partitions into structural floor systems to reduce floor vibrations due to walking excitation. Two models of this building are presented: one to represent the completed building with an open-plan layout and another with partitions added in a beneficial pattern to enhance the floor’s vibration performance. The addition of nonstructural partitions successfully reduced floor accelerations due to walking excitation and helped the floor to satisfy the vibration serviceability criterion for office floors. The potential of vertical full-height nonstructural partitions and cladding to transmit vibrations between floors was also investigated. A vibration …", "num_citations": "10\n", "authors": ["1062"]}
{"title": "Non-structural elements and the dynamic response of buildings: a review\n", "abstract": " The primary structural system of a building is designed to resist a variety of loads. In addition to this primary system, there are secondary systems or so-called ‘non-structural’elements. These elements include such components as cladding panels, internal partitions, services, furniture and others. Non-structural elements are usually attached to the primary structural system using connections designed to prevent transfer of vertical loads, such as superimposed live loads on floors, or lateral loading, such as wind or seismic excitation on entire buildings. It is therefore assumed that non-structural elements are detached from the primary structural system and do not affect the stiffness and dynamic response of structures. However, recent experimental studies of the actual dynamic response of buildings have highlighted that non-structural components can in fact have significant impact on the stiffness and dynamic response …", "num_citations": "9\n", "authors": ["1062"]}
{"title": "An added mass identification algorithm based on frequency response functions\n", "abstract": " Publisher SummaryThis chapter presents a methodology for detecting the added mass in structural systems maintaining a linear response. A computationally efficient method of recalculating a single frequency response function (FRF) is also discussed in the chapter. A single FRF measured at several frequencies along with a correlated analytical model of the structure in its original state—is used to detect and quantify the added mass. The method has been demonstrated for a single lumped mass located at a single joint. The method relies on measurable shifts in the FRFs at multiple excitation frequencies. If the added mass is very near the base, the shift in the FRF may be too small to be feasibly measurable with accuracy as to give an accurate estimation of the added mass. The proposed approach to identification of an added mass is economically feasible in a remote monitoring scenario as only a single …", "num_citations": "9\n", "authors": ["1062"]}
{"title": "Transient response simulation of a composite material footbridge to crossing pedestrians\n", "abstract": " Loads applied by pedestrians, and crowds of pedestrians, are particularly important for footbridges with natural frequencies close to footfall frequencies of moving pedestrians. Recorded response data from Aberfeldy Bridge, an advanced composite material footbridge in Scotland, for numerous pedestrian crossings reveals both vertical and lateral response components. No provision is made in existing codes of practice for the calculations of actual dynamic responses of pedestrian footbridges to lateral pedestrian-induced load. The authors are seeking to develop an appropriate pacing frequency-dependent lateral load model, to be used in conjunction with existing vertical load models that would account for such lateral excitation. This is done by correlation of the measured bridge dynamic response with the results of the simulations where a validated numerical model has been utilised. The modelling techniques …", "num_citations": "8\n", "authors": ["1062"]}
{"title": "Progressive cracking of masonry arch bridges\n", "abstract": " Numerous methods are available for the assessment of masonry arch bridges at the ultimate limit state. However, there is a lack of suitable methods for assessing behaviour at service levels of loading. To address this, non-linear three-dimensional finite element (FE) models that consider constitutive material models enabling progressive cracking and failure of the complete structural system were used to investigate the development of damage for three masonry arch bridges at both service levels and at the ultimate capacity. All of the elements contributing to the strength of the structure were represented in the models, including the arch barrel, spandrel, abutments, fill and surrounding soil. This allowed for consideration of the longitudinal and transverse capacities, the stiffening effects of the spandrel walls, the restraint and load distribution provided by the fill, the frictional behaviour between the masonry and fill …", "num_citations": "7\n", "authors": ["1062"]}
{"title": "Ten stone masonry arch bridges and five different assessment approaches\n", "abstract": " Internationally masonry arch bridges constitute a substantial portion of bridge stocks. An estimated 40% of railway bridges in Europe are of masonry arch construction while in China arch construction of various forms comprises 70% of all bridges. In Ireland an estimated 80% of bridges are of masonry arch construction. Under the National Road Authority’s (NRA) Eirspan Bridge Management Programme, the 877 masonry arch bridges on the national road network are being assessed. However there are a number of different assessment methods available with a corresponding number of different results for the load capacity of these structures. This has cost implications for both the bridge assessment itself and for the costs associated with load restrictions and strengthening measures. To address this issue, research is being carried out under the NRA’s Research Fellowship Programme to develop a hierarchical …", "num_citations": "7\n", "authors": ["1062"]}
{"title": "Non-load bearing elements and their contribution to a structure’s dynamic response\n", "abstract": " Structures include elements designated as load bearing and non-load bearing. While the non-load bearing elements, such as facades and internal partitions, are acknowledged to add mass to the system, the structural stiffness and strength is generally attributed to the load bearing elements only. This paper investigates the contribution of non-loading bearing elements to the dynamic response of a new structure, the Charles Building, in the grounds of University College Dublin (UCD). The ambient vibration response of the structure was recorded at different construction stages. The evolution of the structural response and the generation of a finite element (FE) model are discussed. It was found that the addition of the non-load bearing facades and partitions resulted in additional restraint to the floor slabs, altering the various modes of vibration and increasing the natural frequencies by up to 26% and it is concluded that accounting for non-load bearing elements as added masses only in numerical models is not appropriate.", "num_citations": "5\n", "authors": ["1062"]}
{"title": "Traditional and operational modal testing of the Washington National Cathedral\n", "abstract": " This paper investigates differences between traditional and operational modal analysis as applied to a masonry-vaulted structure. For this purpose, we applied the techniques of both traditional and operational modal analyses to the choir fan vaults of the Washington National Cathedral (DC), a monumental church of Indiana limestone, vaulted in the 1930's in the Gothic style. Impact hammer excitation was used during traditional modal analyses tests, while five different excitation sources:(1.) peal bells,(2.) carillon bells,(3.) orchestra and chorus,(4.) organ,(5.) ambient, were used during operational modal analyses tests. The first four types of excitations were measured by a microphone. The acoustic input of these excitations, especially the carillon and the orchestra/chorus, was found to approximate a uniform distribution across the bandwidth of interest. System identification was completed by the least squares complex exponential (LSCE) method. In general, the most pronounced of the identified natural frequencies were found to be in agreement for all excitation sources. Certain natural frequencies found by traditional modal analysis, however, were omitted from the sequence of frequencies determined by operational modal analysis.", "num_citations": "5\n", "authors": ["1062"]}
{"title": "Nonlinear Modelling of a Multi-Span Arch Bridge Under Service Load Conditions\n", "abstract": " The response of a 19th-century multi-span masonry arch bridge, Queen's Bridge in Belfast, Northern Ireland, was studied using a three-dimensional non-linear finite element model under service load conditions. The full five-span bridge, with spandrel walls, fill material and surrounding soil is modelled. The interface between the masonry and the fill is characterised as a frictional contact surface to facilitate sliding or movement of the fill material relative to the arch barrel and the spandrel walls without generating tensile stresses. Physical tests are simulated by modelling passage of the test truck over the bridge model in a series of sequential static loadsteps. The numerical predictions, for crown and abutment deflections, are compared with experimental data and sensitivity analyses are performed by varying both the geometric and material properties of the bridge. While demonstrating the ability of modern analyses techniques in replicating the response of such complex bridge systems the paper also highlights some of the difficulties often encountered in modelling the response of masonry arch bridges; for example the lack of original construction drawings, incomplete knowledge of the geometric and material constituents, and the lack of detail relating to modifications undertaken after construction. For the covering abstract see ITRD E122906.", "num_citations": "5\n", "authors": ["1062"]}
{"title": "SEAN O’CASEY BRIDGE: COMPARISON OF OPERATIONAL & TRADITIONAL MODAL ANALYSIS TEST RESULTS\n", "abstract": " Sean O’Casey Bridge is a recently constructed footbridge spanning the River Liffey in the centre of Dublin. Prior to its opening to the general public, during the summer of 2005, operational modal analysis and traditional modal analysis tests were undertaken on successive days. Following a brief description of the structural form this paper concentrates on the set-up for both test regimes and compares the results of each test in terms of the natural frequencies, modes of vibration and damping levels identified. The relative merits of ambient and forced excitation test procedures are also discussed in the context of these particular test results.", "num_citations": "4\n", "authors": ["1062"]}
{"title": "Nonlinear three dimensional simulations of service load tests on a 32m stone arch bridge in Ireland\n", "abstract": " Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS", "num_citations": "4\n", "authors": ["1062"]}
{"title": "A case study in the design and analysis for a 5.0 m deployable composite antenna\n", "abstract": " The demand for larger space-based structures has given rise to intensive research in the field of deployable and erectable systems over the past two decades. The major design drivers for space-based systems are that they are of minimum mass, and that they are dynamically isolated from their supporting spacecraft by ensuring that their first resonant frequency is above a given threshold level. This paper describes a deployable antenna concept currently being developed for use in geosynchronous earth orbit. The natural frequency of vibration of the deployable antenna is predicted using finite element eigenvalue extraction techniques and the experimental analysis of a perspex model is used to identify the optimum experimental test configuration for the manufactured antenna.", "num_citations": "4\n", "authors": ["1062"]}
{"title": "Structural dynamic parameter identification and the effect of test techniques\n", "abstract": " Ambient and forced excitation test techniques are both widely used to dynamically identify civil engineering structures. Two floor levels of a newly constructed building, the Charles Institute at University College Dublin, were tested using both techniques. Both floor designs were identical although the layout of partitions above and below each were different. The objective of the tests was to determine the most appropriate test procedure and also to identify whether the layout of partitions contributes in a significant manner to dynamic response. It was found that at low levels of excitation, ambient test levels, the dynamic response of both floors was identical. In contrast, at higher vibration excitation levels, during forced vibration testing, the floor responses were substantially different. The differing modal parameters identified are attributed to an amplitude dependent response resulting from engagement, or not, of …", "num_citations": "3\n", "authors": ["1062"]}
{"title": "An examination of backing effects on ratings for masonry arch bridges\n", "abstract": " Many single or multispan arch bridges are strengthened with the addition of some kind of structural support between adjacent arches of multispan or beside the arch barrel of a single span to increase the strength of the overall structure. It was traditionally formed by either placing loose rubble masonry blocks between the arches and beside the arches or using mortar or concrete to construct a more substantial structural bond between the spans. On the other hand backing materials are present in some existing bridges. Existing arch assessment procedures generally ignore the effects of backing materials. In this paper an investigation of the effects of backing on ratings for masonry arch bridges is carried out. It is observed that increasing the overall lateral stability of the arch system through the inclusion of structural backing results in an enhanced failure load by reducing the likelihood of any tension occurring at the top of the arch.", "num_citations": "3\n", "authors": ["1062"]}
{"title": "Estimating the characteristic vertical response of a flexible footbridge due to crowd loading\n", "abstract": " Estimating the characteristic vertical response of a flexible footbridge due to crowd loading — Monash University Skip to main navigation Skip to search Skip to main content Monash University Logo Help & FAQ Home Profiles Research Units Equipment Projects Research Output Prizes Activities Press / Media Estimating the characteristic vertical response of a flexible footbridge due to crowd loading Joe Keogh, P Archbold, Colin Christopher Caprani, Paul Fanning Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Overview Original language English Title of host publication BRI10 Bridge and Infrastructure Research in Ireland, CRI10 Concrete Research in Ireland: Joint Symposium Proceedings Editors Nora Aine Ni Nuallain, Des Walsh, Roger West Place of Publication Cork Ireland Publisher Bridge and Concrete Research in Ireland Pages 35 - 42 Number …", "num_citations": "3\n", "authors": ["1062"]}
{"title": "INNOVATIVE BRIDGE SYSTEM OF ULTRA HIGH PERFORMANCE FIBRE REINFORCED CONCRETE: EXPERIMENTS, MODELING AND DESIGN\n", "abstract": " Ultra High Performance Fiber Reinforced Concrete (UHPFRC) is a new generation of fiber reinforced cementitious composite with enhanced mechanical and durability property. The use of UHPFRC in prefabricated bridge deck design was the focus of recent research program, which has included experimental testing at the Laboratoire Central des Ponts et Chaussées (within the French national project MIKTI) and numerical modeling at University College Dublin. The bridge deck system derives from the project designed by the “CETE de Lyon” Engineering office. It is a light two way slabs of only 14 cm in equivalent thickness, pre stressed in the transverse direction, and supported on longitudinal steel beams. A longitudinal post-tensioning system and concrete joints between adjacent modules provide continuity of load transfer in the bridge span direction. The detailed design of this innovative structure has been carried out by applying newly drawn recommendations on UHPFRC. The global response to loading and the fatigue resistance to global/local loading represent major features of the research investigation. A 3D damage model has been implemented in a finite element method to predict the mechanical behavior of the pre-stressed modules during the full-scale experiments, including the contact problem between the post-tensioned segments.", "num_citations": "3\n", "authors": ["1062"]}
{"title": "Vibration Transmission Through Non-Structural Partitions Between Building Floor Levels\n", "abstract": " An assessment of the extent of vibration transmission, attributable to non-structural partitions, was made using experimental tests and numerical simulations, for a recently constructed multi-storey reinforced concrete building. Mechanical excitation was provided to one floor. The extent of vibration on the floor above was found to be as high as 65 % of that recorded on the excited floor. A numerical model was also used to simulate the response to a person walking along a corridor. The extent of transmission was 9 % with partitions and 1.8 % without them. These findings imply that the vibration level on any given floor level will be due to excitation on that particular floor and also the not insignificant level of vibration that may be transmitted through structural and non-structural components due to concurrent activity from floors above and below. This issue of vibration transmission between floor levels is not …", "num_citations": "2\n", "authors": ["1062"]}
{"title": "Experimental Nonlinear FE Modelling & Eurocode 3 Analyses of Steel Flush Endplate Joints\n", "abstract": " Structural steel joints form an integral part of all structural steel frames and regardless of the joint type employed the behaviour and response of the joints is of primary importance in determining the manner in which the frame resists both vertical and horizontal loading. An understanding of joint stiffness, strength and ductility is required. Eurocode 3 provides guidance for predicting the ultimate strength, rotational capacity and rotational stiffness of steel flush endplate joints. This paper examines in detail the correlation be-tween Eurocode 3 predictions and actual behaviour recorded in full scale tests and validated numerical mod-els. The detailed three dimensional finite element analysis methods used enable the significant differences to be explained by reference to the initial assumptions made in the Eurocode 3 calculations.", "num_citations": "2\n", "authors": ["1062"]}
{"title": "A Parametric Study: Frame Analysis Method for Masonry Arch Bridges\n", "abstract": " The predictability of masonry arch bridges and their behaviour is widely considered doubtful due to the lack of knowledge about the conditions of a given masonry arch bridge. The assessment methods for masonry arch bridges are MEXE, ARCHIE, RING and Frame Analysis Method. The material properties of the masonry and fill material are extremely difficult to determine accurately. Consequently, it is necessary to examine the effect of load dispersal angle through the fill material, the effect of variations in the stiffness of the masonry, the tensile strength of the masonry mortar continuum and the compressive strength of the masonry mortar continuum. It is also important to understand the effect of fill material on load dispersal angle to determine their influence on ratings. In this paper a series of parametric studies, to examine the sensitivity of assessment ratings to the various sets of input data required by the frame …", "num_citations": "1\n", "authors": ["1062"]}
{"title": "A parametric study: Frame analysis method for masonry arch bridges\n", "abstract": " The predictability of masonry arch bridges and their behaviour is widely considered doubtful due to the lack of knowledge about the conditions of a given masonry arch bridge. The assessment methods for masonry arch bridges are MEXE, ARCHIE, RING and Frame Analysis Method. The material properties of the masonry and fill material are extremely difficult to determine accurately. Consequently, it is necessary to examine the effect of load dispersal angle through the fill material, the effect of variations in the stiffness of the masonry, the tensile strength of the masonry mortar continuum and the compressive strength of the masonry mortar continuum. It is also important to understand the effect of fill material on load dispersal angle to determine their influence on ratings. In this paper a series of parametric studies, to examine the sensitivity of assessment ratings to the various sets of input data required by the frame analysis method, are carried out.", "num_citations": "1\n", "authors": ["1062"]}
{"title": "Reliability analysis of footbridge serviceability considering crowd loading\n", "abstract": " The characteristic vertical response of flexible footbridges subjected to single pedestrian and crowd loading is examined in this paper. Typically, bridge vibrations produced from a crowd of pedestrians are estimated by using an enhancement factor applied to the effect caused by a single pedestrian. In this paper a moving force model is used in Monte Carlo simulations of a non-homogeneous sample of single pedestrians and crowds to estimate characteristic vertical vibration levels. Also in this work, statistical distributions of the bridge parameters are considered, these include flexural rigidity, mass and rotational stiffness at the supports. It was previously proven by the authors that the statistical range of pedestrian parameters, most notably the pacing frequency, has a significant effect on the bridge deck vibration. In this paper, probability of failure is calculated for ranges of pedestrian and bridge input parameters and it is found that the addition of statistical ranges for bridge parameters has only a small effect on the vertical acceleration response of the bridge deck. It reduced the probability of serviceability failure for a bridge with a natural frequency of 1.96 Hz and 2.2 Hz subjected to the loading of a characteristic single pedestrian.", "num_citations": "1\n", "authors": ["1062"]}
{"title": "Identification and health monitoring of an instrumented building using earthquake response data\n", "abstract": " This paper describes the identification of finite dimensional, linear, time-invariant models of a 4-story building in the state space representation using multiple data sets of earthquake response. The building, instrumented with 31 accelerometers, is located on the University of California, Irvine campus. Multiple data sets, recorded during the 2005 Yucaipa, 2005 San Clemente, 2008 Chino Hills, and 2009 Inglewood earthquakes, are used for identification and validation. Considering the response of the building as the output and the ground motion as the input, the state space models that represent the underlying dynamics of the building in the discrete-time domain corresponding to each data set are identified. The four state space models identified demonstrate that the response of the building is amplitude dependent with the response frequency, and damping, being dependent on the magnitude of ground excitation …", "num_citations": "1\n", "authors": ["1062"]}
{"title": "Interactive horizontal load model for pedestrians crossing footbridges\n", "abstract": " In recent years several theories have been put forward in relation to lateral forces imparted on bridges from crowd movements. It is now widely accepted that the interaction between the crowd and the structure, particularly when the crowd pacing frequency is close to the lateral natural frequency, is the major factor determining the lateral response. However, very little work has been done with individual pedestrians in order to determine the relationship between the lateral force induced by a single pedestrian and the structural response. Equally, most literature concerning lateral forces induced from walking is based on results from fixed force plate tests and hence no assessment of any interaction is made. This paper examines the lateral response of a GRP (glass-fibre reinforced polymer) cable-stayed footbridge to individual pedestrian crossings at a range of pacing frequencies. Two lateral load modelling …", "num_citations": "1\n", "authors": ["1062"]}
{"title": "Modellazione Tridimensionale di Ponti ad Arco in Muratura: Accettare una Sfida\n", "abstract": " La simulazione della risposta di ponti ad arco in muratura ai carichi da traffico veicolare presenta numerose, differenziate difficoltà. Queste includono la modellazione dei blocchi di muratura, della malta, del materiale di riempimento, dell’interazione fra ciascuno di questi elementi, nonché delle potenziali non-linearità del materiale e della conseguente risposta strutturale. Si discute in questa sede sulle metodologie adottate al fine di rispondere alle presenti problematiche, utilizzando tecniche di modellazione FEM tridimensionale non-lineare nel contesto dei ponti ad arco in muratura, tipici nel panorama dei ponti ad arco irlandesi. Per i ponti qui considerati, i modelli includono rappresentazioni tridimensionali dell’arco, dei timpani di volta, del materiale di riempimento e degli strati di terreno circostanti. Specifici modelli non-lineari sono utilizzati per la simulazione del comportamento di muratura, riempimento al di …", "num_citations": "1\n", "authors": ["1062"]}
{"title": "An experimental and analytical program for assessment of stone bridges in Dublin, Ireland\n", "abstract": " Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS", "num_citations": "1\n", "authors": ["1062"]}
{"title": "The modal analysis of a unit building block for a 5.0 m deployable antenna for space applications\n", "abstract": " Deployable Systems The Deployable Concept The Unit Building Block, (UBB) Conclusions", "num_citations": "1\n", "authors": ["1062"]}