{"title": "Grouplens: An open architecture for collaborative filtering of netnews\n", "abstract": " Collaborative filters help people make choices based on the opinions of other people. GroupLens is a system for collaborative filtering of netnews, to help people find articles they will like in the huge stream of available articles. News reader clients display predicted scores and make it easy for users to rate articles after they read them. Rating servers, called Better Bit Bureaus, gather and disseminate the ratings. The rating servers predict scores based on the heuristic that people who agreed in the past will probably agree again. Users can protect their privacy by entering ratings under pseudonyms, without reducing the effectiveness of the score prediction. The entire architecture is open: alternative software for news clients and Better Bit Bureaus can be developed independently and can interoperate with the components we have developed.", "num_citations": "7848\n", "authors": ["1169"]}
{"title": "Recommender systems\n", "abstract": " Recommender systems assist and augment this natural social process. In a typical recommender system people provide recommendations as inputs, which the system then aggregates and directs to appropriate recipients. In some cases the primary transformation is in the aggregation; in others the system’s value lies in its ability to make good matches between the recommenders and those seeking recommendations.The developers of the first recommender system, Tapestry [1], coined the phrase “collaborative filtering” and several others have adopted it. We prefer the more general term “recommender system” for two reasons. First, recommenders may not explictly collaborate with recipients, who may be unknown to each other. Second, recommendations may suggest particularly interesting items, in addition to indicating those that should be filtered out. This special section includes descriptions of five …", "num_citations": "5378\n", "authors": ["1169"]}
{"title": "Reputation systems\n", "abstract": " But they also involve risk. Is the advice of a self-proclaimed expert at expertcentral. com reliable? Will an unknown dotcom site or eBay seller ship items promptly with appropriate packaging? Will the product be the same one described online? Prior to the Internet, such questions were answered, in part, through personal and corporate reputations. Vendors provided references, Better Business Bureaus tallied complaints, and past personal experience and person-to-person gossip told you on whom you could rely and on whom you could not. Participants’ standing in their communities, including their roles in church and civic organizations, served as a valuable hostage.", "num_citations": "3377\n", "authors": ["1169"]}
{"title": "Trust among strangers in Internet transactions: Empirical analysis of eBay's reputation system\n", "abstract": " One of the earliest and best known Internet reputation systems is run by eBay, which gathers comments from buyers and sellers about each other after each transaction. Examination of a large data set from 1999 reveals several interesting features. First, despite incentives to free ride, feedback was provided more than half the time. Second, well beyond reasonable expectation, it was almost always positive. Third, reputation profiles were predictive of future performance, though eBay's net feedback statistic is far from the best predictor available. Fourth, there was a high correlation between buyer and seller feedback, suggesting that the players reciprocate and retaliate.", "num_citations": "2618\n", "authors": ["1169"]}
{"title": "The value of reputation on eBay: A controlled experiment\n", "abstract": " We conducted the first randomized controlled field experiment of an Internet reputation mechanism. A high-reputation, established eBay dealer sold matched pairs of lots—batches of vintage postcards—under his regular identity and under new seller identities (also operated by him). As predicted, the established identity fared better. The difference in buyers’ willingness-to-pay was 8.1% of the selling price. A subsidiary experiment followed the same format, but compared sales by relatively new sellers with and without negative feedback. Surprisingly, one or two negative feedbacks for our new sellers did not affect buyers’ willingness-to-pay.", "num_citations": "1469\n", "authors": ["1169"]}
{"title": "The social cost of cheap pseudonyms\n", "abstract": " We consider the problems of societal norms for cooperation and reputation when it is possible to obtain cheap pseudonyms, something that is becoming quite common in a wide variety of interactions on the Internet. This introduces opportunities to misbehave without paying reputational consequences. A large degree of cooperation can still emerge, through a convention in which newcomers “pay their dues” by accepting poor treatment from players who have established positive reputations. One might hope for an open society where newcomers are treated well, but there is an inherent social cost in making the spread of reputations optional. We prove that no equilibrium can sustain significantly more cooperation than the dues‐paying equilibrium in a repeated random matching game with a large number of players in which players have finite lives and the ability to change their identities, and there is a small but …", "num_citations": "895\n", "authors": ["1169"]}
{"title": "Eliciting informative feedback: The peer-prediction method\n", "abstract": " Many recommendation and decision processes depend on eliciting evaluations of opportunities, products, and vendors. A scoring system is devised that induces honest reporting of feedback. Each rater merely reports a signal, and the system applies proper scoring rules to the implied posterior beliefs about another rater’s report. Honest reporting proves to be a Nash equilibrium. The scoring schemes can be scaled to induce appropriate effort by raters and can be extended to handle sequential interaction and continuous signals. We also address a number of practical implementation issues that arise in settings such as academic reviewing and online recommender and reputation systems.", "num_citations": "727\n", "authors": ["1169"]}
{"title": "Beyond bowling together: Sociotechnical capital\n", "abstract": " Social resources like trust and shared identity make it easier for people to work and play together. Such social resources are sometimes referred to as social capital. Thirty years ago, Americans built social capital as a side effect of participation in civic organizations and social activities, including bowling leagues. Today, they do so far less frequently (Putnam 2000). HCI researchers and practitioners need to find new ways for people to interact that will generate even more social capital than bowling together does. A new theoretical construct, SocioTechnical Capital, provides a framework for generating and evaluating technology-mediated social relations.", "num_citations": "719\n", "authors": ["1169"]}
{"title": "It's not that I don't have problems, I'm just not putting them on Facebook: challenges and opportunities in using online social networks for health\n", "abstract": " To understand why and how people share health information online, we interviewed fourteen people with significant health concerns who participate in both online health communities and Facebook. Qualitative analysis of these interviews highlighted the ways that people think about with whom and how to share different types of information as they pursue social goals related to their personal health, including emotional support, motivation, accountability, and advice. Our study suggests that success in these goals depends on how well they develop their social networks and how effectively they communicate within those networks. Effective communication is made more challenging by the need to strike a balance between sharing information related to specific needs and the desire to manage self-presentation. Based on these observations, we outline a set of design opportunities for future systems to support health …", "num_citations": "696\n", "authors": ["1169"]}
{"title": "Enquiring minds: Early detection of rumors in social media from enquiry posts\n", "abstract": " Many previous techniques identify trending topics in social media, even topics that are not pre-defined. We present a technique to identify trending rumors, which we define as topics that include disputed factual claims. Putting aside any attempt to assess whether the rumors are true or false, it is valuable to identify trending rumors as early as possible. It is extremely difficult to accurately classify whether every individual post is or is not making a disputed factual claim. We are able to identify trending rumors by recasting the problem as finding entire clusters of posts whose topic is a disputed factual claim.", "num_citations": "517\n", "authors": ["1169"]}
{"title": "REFEREE: Trust management for Web applications\n", "abstract": " Digital signatures provide a mechanism for guaranteeing integrity and authenticity of Web content but not more general notions of security or trust. Web-aware applications must permit users to state clearly their own security policies and, of course, must provide the cryptographic tools for manipulating digital signatures. This paper describes the REFEREE trust management system for Web applications; REFEREE provides both a general policy-evaluation mechanism for Web clients and servers and a language for specifying trust policies. REFEREE places all trust decisions under explicit policy control; in the REFEREE model, every action, including evaluation of compliance with policy, happens under the control of some policy. That is, REFEREE is a system for writing policies about policies, as well as policies about cryptographic keys, PICS label bureaus, certification authorities, trust delegation, or anything else.In …", "num_citations": "483\n", "authors": ["1169"]}
{"title": "Slash (dot) and burn: distributed moderation in a large online conversation space\n", "abstract": " Can a system of distributed moderation quickly and consistently separate high and low quality comments in an online conversation? Analysis of the site Slashdot. org suggests that the answer is a qualified yes, but that important challenges remain for designers of such systems. Thousands of users act as moderators. Final scores for comments are reasonably dispersed and the community generally agrees that moderations are fair. On the other hand, much of a conversation can pass before the best and worst comments are identified. Of those moderations that were judged unfair, only about half were subsequently counterbalanced by a moderation in the other direction. And comments with low scores, not at top-level, or posted late in a conversation were more likely to be overlooked by moderators.", "num_citations": "468\n", "authors": ["1169"]}
{"title": "The market for evaluations\n", "abstract": " Recent developments in computer networks have driven the cost of distributing information virtually to zero, creating extraordinary opportunities for sharing product evaluations. We present pricing and subsidy mechanisms that operate through a computerized market and induce the efficient provision of evaluations. The mechanisms overcome three major challenges: first, evaluations, which are public goods, are likely to be underprovided; second, an inefficient ordering of evaluators may arise; third, the optimal quantity of evaluations depends on what is learned from the initial evaluations. (JEL D70, D83, H41, L15)", "num_citations": "415\n", "authors": ["1169"]}
{"title": "Adolescents searching for health information on the Internet: an observational study\n", "abstract": " Background: Adolescents' access to health information on the Internet is partly a function of their ability to search for and find answers to their health-related questions. Adolescents may have unique health and computer literacy needs. Although many surveys, interviews, and focus groups have been utilized to understand the information-seeking and information-retrieval behavior of adolescents looking for health information online, we were unable to locate observations of individual adolescents that have been conducted in this context.Objective: This study was designed to understand how adolescents search for health information using the Internet and what implications this may have on access to health information.Methods: A convenience sample of 12 students (age 12-17 years) from 1 middle school and 2 high schools in southeast Michigan were provided with 6 health-related questions and asked to look for answers using the Internet. Researchers recorded 68 specific searches using software that captured screen images as well as synchronized audio recordings. Recordings were reviewed later and specific search techniques and strategies were coded. A qualitative review of the verbal communication was also performed.Results: Out of 68 observed searches, 47 (69%) were successful in that the adolescent found a correct and useful answer to the health question. The majority of sites that students attempted to access were retrieved directly from search engine results (77%) or a search engine's recommended links (10%); only a small percentage were directly accessed (5%) or linked from another site (7%). The majority (83%) of followed …", "num_citations": "321\n", "authors": ["1169"]}
{"title": "PICS: Internet access controls without censorship\n", "abstract": " 1PICS is an effort of the World-Wide Web Consortium at MIT’s Laboratory for Computer Science, drawing on the resources of a broad cross-section of the industry. Project history, a long list of supporting organizations, and details of the specifications may be found at http://w3. org/PICS.", "num_citations": "314\n", "authors": ["1169"]}
{"title": "Social navigation: Techniques for building more usable systems\n", "abstract": " Social navigation is not a new idea: it’s something that we use every day. However, although other ideas from real-world navigation have been incorporated into interface designs, such as maps, guides, and short cuts, social forms of navigation are only slowly being adopted in software systems. Most digital systems don’t help us navigate socially. On most areas of the Web, for example, users are given the illusion of being the only person present. The only indication they may get of other people’s using the system is a slowerthan-usual response time. Systems actually showing other people directly or indirectly are in the minority, with virtual communities, chat rooms, and so on being more the exception than the rule. Even on sites that provide these community features, it is usually not possible to take advantage of the work done by earlier visitors to solve problems, retrieve information, and so on. Vannevar Bush’s …", "num_citations": "313\n", "authors": ["1169"]}
{"title": "Presenting diverse political opinions: how and how much\n", "abstract": " Is a polarized society inevitable, where people choose to be exposed to only political news and commentary that reinforces their existing viewpoints? We examine the relationship between the numbers of supporting and challenging items in a collection of political opinion items and readers' satisfaction, and then evaluate whether simple presentation techniques such as highlighting agreeable items or showing them first can increase satisfaction when fewer agreeable items are present. We find individual differences: some people are diversity-seeking while others are challenge-averse. For challenge-averse readers, highlighting appears to make satisfaction with sets of mostly agreeable items more extreme, but does not increase satisfaction overall, and sorting agreeable content first appears to decrease satisfaction rather than increasing it. These findings have important implications for builders of websites that …", "num_citations": "273\n", "authors": ["1169"]}
{"title": "An online community improves adherence in an internet-mediated walking program. Part 1: results of a randomized controlled trial\n", "abstract": " Background: Approximately half of American adults do not meet recommended physical activity guidelines. Face-to-face lifestyle interventions improve health outcomes but are unlikely to yield population-level improvements because they can be difficult to disseminate, expensive to maintain, and inconvenient for the recipient. In contrast, Internet-based behavior change interventions can be disseminated widely at a lower cost. However, the impact of some Internet-mediated programs is limited by high attrition rates. Online communities that allow participants to communicate with each other by posting and reading messages may decrease participant attrition.Objective: Our objective was to measure the impact of adding online community features to an Internet-mediated walking program on participant attrition and average daily step counts.Methods: This randomized controlled trial included sedentary, ambulatory adults who used email regularly and had at least 1 of the following: overweight (body mass index [BMI]≥ 25), type 2 diabetes, or coronary artery disease. All participants (n= 324) wore enhanced pedometers throughout the 16-week intervention and uploaded step-count data to the study server. Participants could log in to the study website to view graphs of their walking progress, individually-tailored motivational messages, and weekly calculated goals. Participants were randomized to 1 of 2 versions of a Web-based walking program. Those randomized to the “online community” arm could post and read messages with other participants while those randomized to the “no online community\" arm could not read or post messages. The main …", "num_citations": "242\n", "authors": ["1169"]}
{"title": "Zoning speech on the Internet: A legal and technical model\n", "abstract": " Speech, it is said, 1 divides into three sorts-(1) speech that every-one has a right to (political speech, speech about public affairs);(2) speech that no one has a right to (obscene speech, child porn); and (3) speech that some have a right to but others do not (in the United States, Ginsberg2 speech, or speech that is\" harmful to minors,\" to which adults have a right but kids do not). Speech-protective regimes, on this view, are those where category (1) speech predominates; speech-repressive regimes are those where categories (2) and (3) pre-vail. This divide has meaning for speech and regulation within a single jurisdiction, but it makes less sense across jurisdictions. For when viewed across jurisdictions, most controversial speech falls into cate-gory (3)-speech that is permitted to some in some places, but not to others in other places. What constitutes\" political speech\" in the United States (Nazi speech) is banned in …", "num_citations": "151\n", "authors": ["1169"]}
{"title": "Follow the reader: filtering comments on slashdot\n", "abstract": " Large-scale online communities need to manage the tension between critical mass and information overload. Slashdot is a news and discussion site that has used comment rating to allow massive participation while providing a mechanism for users to filter content. By default, comments with low ratings are hidden. Of users who changed the defaults, more than three times as many chose to use ratings for filtering or sorting as chose to suppress the use of comment ratings. Nearly half of registered users, however, never strayed from the default filtering settings, suggesting that the costs of exploring and selecting custom filter settings exceeds the expected benefit for many users. We recommend leveraging the efforts of the users that actively choose filter settings to reduce the cost of changing settings for all other users. One strategy is to create static schemas that capture the filtering preferences of different groups of …", "num_citations": "149\n", "authors": ["1169"]}
{"title": "Encouraging reading of diverse political viewpoints with a browser widget\n", "abstract": " The Internet gives individuals more choice in political news and information sources and more tools to filter out disagreeable information. Citing the preference described by selective exposure theory—people prefer information that supports their beliefs and avoid counter-attitudinal information—observers warn that people may use these tools to access only agreeable information and thus live in ideological echo chambers. We report on a field deployment of a browser extension that showed users feedback about the political lean of their weekly and all time reading behaviors. Compared to a control group, showing feedback led to a modest move toward balanced exposure, corresponding to 1-2 visits per week to ideologically opposing sites or 5-10 additional visits per week to centrist sites.", "num_citations": "143\n", "authors": ["1169"]}
{"title": "Recommender systems—beyond matrix completion\n", "abstract": " The future success of these systems depends on more than a Netflix challenge.", "num_citations": "137\n", "authors": ["1169"]}
{"title": "Bursting your (filter) bubble: strategies for promoting diverse exposure\n", "abstract": " Broadcast media are declining in their power to decide which issues and viewpoints will reach large audiences. But new information filters are appearing, in the guise of recommender systems, aggregators, search engines, feed ranking algorithms, and the sites we bookmark and the people and organizations we choose to follow on Twitter. Sometimes we explicitly choose our filters; some we hardly even notice. Critics worry that, collectively, these filters will isolate people in information bubbles only partly of their own choosing, and that the inaccurate beliefs they form as a result may be difficult to correct. But should we really be worried, and, if so, what can we do about it? Our panelists will review what scholars know about selectivity of exposure preferences and actual exposure and what we in the CSCW field can do to develop and test ways of promoting diverse exposure, openness to the diversity we actually …", "num_citations": "136\n", "authors": ["1169"]}
{"title": "Filtering information on the Internet\n", "abstract": " FILTERING SYSTEM for the World Wide Web allows individuals to decide for themselves what they want to see. Users specify safety and content requirements (a), which label-processing software (b) then consults to determine whether to block access to certain pages (marked with a stop sign). Labels can be affixed by the Web site’s author (c), or a rating agency can store its labels in a separate database (d).", "num_citations": "133\n", "authors": ["1169"]}
{"title": "Roles for electronic brokers\n", "abstract": " The information superhighway promises to facilitate the exchange of products. Broadly, we can think of all such exchanges as electronic commerce, even though some products, such as messages on computer bulletin boards, may be free, and physical transactions must be consummated elsewhere.(For example, a seller and buyer would exchange the product and payment by mail.) Most predictions about commercial opportunities on the information superhighway focus on the provision of information products, such as video on demand, and on new sales outlets for physical products, as with horne shopping. We believe that electronic brokers, as intermediaries between buyers and sellers, can help to create more efficient markets, both for information products and physical products. Most simply, they can reduce buyer search costs and arrange to pay for information that would not be provided without payment …", "num_citations": "132\n", "authors": ["1169"]}
{"title": "The influence limiter: provably manipulation-resistant recommender systems\n", "abstract": " An attacker can draw attention to items that don't deserve that attention by manipulating recommender systems. We describe an influence-limiting algorithm that can turn existing recommender systems into manipulation-resistant systems. Honest reporting is the optimal strategy for raters who wish to maximize their influence. If an attacker can create only a bounded number of shills, the attacker can mislead only a small amount. However, the system eventually makes full use of information from honest, informative raters. We describe both the influence limits and the information loss incurred due to those limits in terms of information-theoretic concepts of loss functions and entropies.", "num_citations": "123\n", "authors": ["1169"]}
{"title": "Happier together: integrating a wellness application into a social network site\n", "abstract": " What are the benefits and drawbacks of integrating health and wellness interventions into existing online social network websites? In this paper, we report on a case study of deploying the Three Good Things positive psychology exercise as a Facebook application. Our experience shows that embedding a wellness intervention in an existing social website is a viable option. In particular, we find adherence rates on par with or better than many other Internet-based wellness interventions. We also gained insights about users’ privacy and audience concerns that inform the design of social network-based wellness applications. Participants did not want all of their entries to be shared with all their Facebook friends, both because they did not want others to know some things and because they did not want to clutter others’ newsfeeds. Users found it compelling, however, to interact with their friends around some …", "num_citations": "114\n", "authors": ["1169"]}
{"title": "Manipulation-resistant reputation systems\n", "abstract": " This chapter is an overview of the design and analysis of reputation systems for strategic users. We consider three specific strategic threats to reputation systems: the possibility of users with poor reputations starting afresh (whitewashing); lack of effort or honesty in providing feedback; and sybil attacks, in which users create phantom feedback from fake identities to manipulate their own reputation. In each case, we present a simple analytical model that captures the essence of the strategy, and describe approaches to solving the strategic problem in the context of this model. We conclude with a discussion of open questions in this research area.", "num_citations": "109\n", "authors": ["1169"]}
{"title": "Classifying the political leaning of news articles and users from user votes\n", "abstract": " Social news aggregator services generate readers’ subjective reactions to news opinion articles. Can we use those as a resource to classify articles as liberal or conservative, even without knowing the self-identified political leaning of most users? We applied three semi-supervised learning methods that propagate classifications of political news articles and users as conservative or liberal, based on the assumption that liberal users will vote for liberal articles more often, and similarly for conservative users and articles. Starting from a few labeled articles and users, the algorithms propagate political leaning labels to the entire graph. In cross-validation, the best algorithm achieved 99.6% accuracy on held-out users and 96.3% accuracy on held-out articles. Adding social data such as users’ friendship or text features such as cosine similarity did not improve accuracy. The propagation algorithms, using the subjective liking data from users, also performed better than an SVM based text classifier, which achieved 92.0% accuracy on articles.", "num_citations": "104\n", "authors": ["1169"]}
{"title": "Hypothetical outcome plots outperform error bars and violin plots for inferences about reliability of variable ordering\n", "abstract": " Many visual depictions of probability distributions, such as error bars, are difficult for users to accurately interpret. We present and study an alternative representation, Hypothetical Outcome Plots (HOPs), that animates a finite set of individual draws. In contrast to the statistical background required to interpret many static representations of distributions, HOPs require relatively little background knowledge to interpret. Instead, HOPs enables viewers to infer properties of the distribution using mental processes like counting and integration. We conducted an experiment comparing HOPs to error bars and violin plots. With HOPs, people made much more accurate judgments about plots of two and three quantities. Accuracy was similar with all three representations for most questions about distributions of a single quantity.", "num_citations": "102\n", "authors": ["1169"]}
{"title": "Does pornography-blocking software block access to health information on the Internet?\n", "abstract": " ContextThe Internet has become an important tool for finding health information, especially among adolescents. Many computers have software designed to block access to Internet pornography. Because pornography-blocking software cannot perfectly discriminate between pornographic and nonpornographic Web sites, such products may block access to health information sites, particularly those related to sexuality.ObjectiveTo quantify the extent to which pornography-blocking software used in schools and libraries limits access to health information Web sites.Design and SettingIn a simulation of adolescent Internet searching, we compiled search results from 24 health information searches (n = 3206) and 6 pornography searches (n = 781). We then classified the content of each site as either health information (n = 2467), pornography (n = 516), or other (n = 1004). We also compiled a list of top teen health …", "num_citations": "97\n", "authors": ["1169"]}
{"title": "It's creepy, but it doesn't bother me\n", "abstract": " Undergraduates interviewed about privacy concerns related to online data collection made apparently contradictory statements. The same issue could evoke concern or not in the span of an interview, sometimes even a single sentence. Drawing on dual-process theories from psychology, we argue that some of the apparent contradictions can be resolved if privacy concern is divided into two components we call intuitive concern, a\" gut feeling,\" and considered concern, produced by a weighing of risks and benefits. Consistent with previous explanations of the so-called privacy paradox, we argue that people may express high considered concern when prompted, but in practice act on low intuitive concern without a considered assessment. We also suggest a new explanation: a considered assessment can override an intuitive assessment of high concern without eliminating it. Here, people may choose rationally to …", "num_citations": "93\n", "authors": ["1169"]}
{"title": "Skip and scan: cleaning up telephone interface\n", "abstract": " The current generation of telephone interfaces is frustrating to use, in part because callers have to wait through the recitation of long prompts in order to find the options that interest them. In a visual medium, users would shift their gaze in order to skip uninteresting prompts and scan through large pieces of text. We present skip and scan, a new telephone interface style in which callers issue explicit commands to accomplish these same skipping and scanning activities. In a laboratory experiment, subjects made selections using skip and scan menus more quickly than using traditional, numbered menus, and preferred the skip and scan menus in subjective ratings. In a field test of a skip and scan interface, the general public successfully added and retrieved information without using any written instructions.", "num_citations": "93\n", "authors": ["1169"]}
{"title": "Self-selection, slipping, salvaging, slacking, and stoning: the impacts of negative feedback at eBay\n", "abstract": " Analysis of usage history for a large panel of eBay sellers suggests that both seller and buyer behavior change in response to changes in a seller's feedback profile. Sellers are more likely to stop listing items right after receiving a negative feedback. Sellers who continue listing do not seem to improve their performance in order to salvage their reputations. Instead, sellers get more negative feedback after receiving a negative feedback. One reason is that observed negative feedback appears to be symptomatic of a temporary decline in the seller's quality, which is also reflected in other transactions around the same time. Receipt of negative feedback might also cause a decline in seller quality, but we find only weak evidence of that. Empirical evidence does support a second hypothesis, that buyers appear to be more willing to give negative feedback to sellers who have recently received other negative feedback.", "num_citations": "82\n", "authors": ["1169"]}
{"title": "Rumorlens: A system for analyzing the impact of rumors and corrections in social media\n", "abstract": " Some rumors spread quickly and widely through social media. Journalists write about them, both to help the public understand whether they are true, and to help the public understand how widely misinformation and corrections have spread, and how they did. We describe RumorLens, a suite of interactive tools that are designed to help journalists identify new rumors on Twitter and assess the audiences that rumor and correction tweets have reached. The tools make efficient use of human labor to assess whether a rumor’s content is interesting enough to warrant further exploration, to label tweets as spreading, correcting, or unrelated to the rumor, and to analyze the rumor visually. Behind the scenes, automated learning and computation amplifies the effectiveness of that labor, making it feasible to engage journalists and the broader public to run a continuous rumor-monitoring service.", "num_citations": "80\n", "authors": ["1169"]}
{"title": "Resisting political fragmentation on the Internet\n", "abstract": " Must the Internet promote political fragmentation? Although this is a possible outcome of personalized online news, we argue that other futures are possible and that thoughtful design could promote more socially desirable behavior. Research has shown that individuals crave opinion reinforcement more than they avoid exposure to diverse viewpoints and that, in many situations, hearing the other side is desirable. We suggest that, equipped with this knowledge, software designers ought to create tools that encourage and facilitate consumption of diverse news streams, making users, and society, better off. We propose several techniques to help achieve this goal. One approach focuses on making useful or intriguing opinion-challenges more accessible. The other centers on nudging people toward diversity by creating environments that accentuate its benefits. Advancing research in this area is critical in the face …", "num_citations": "80\n", "authors": ["1169"]}
{"title": "Impersonal sociotechnical capital, ICTs, and collective action among strangers\n", "abstract": " The notion of\" capital\" suggests a resource that can be accumulated and whose availability allows people to create value for themselves or others. People can do more when they have access to physical resources like buildings and tools, which are usually referred to as\" physical capital.\" Money, or\" financial capital,\" allows people to acquire many other kinds of resources. In the latter half of the twentieth century, economists began to think about education as\" human capital.\" People who have more knowledge and skills can produce more, so it makes sense to think about spending on education as a form of investment rather than consumption (Schultz 1961).Productive resources can reside not just in things and in people, but also in social relations among people (Coleman 1988; Putnam 1993). Following Coleman (1988), I define\" social capital\" as productive resources that inhere in social relations. In order to give the concept greater specificity, analysts sometimes restrict the definition to particular kinds of social relations, such as networks of interpersonal communication, trust, and intimacy, or widespread social trust, or norms of reciprocity. 1 Equating social capital with any particular pattern of social relations, however, would make it impossible to identify as social capital any new patterns of social relations.", "num_citations": "74\n", "authors": ["1169"]}
{"title": "Sidelines: An algorithm for increasing diversity in news and opinion aggregators\n", "abstract": " Aggregators rely on votes, and links to select and present subsets of the large quantity of news and opinion items generated each day. Opinion and topic diversity in the output sets can provide individual and societal benefits, but simply selecting the most popular items may not yield as much diversity as is present in the overall pool of votes and links. In this paper, we define three diversity metrics that address different dimensions of diversity: inclusion, non-alienation, and proportional representation. We then present the Sidelines algorithm–which temporarily suppresses a voter’s preferences after a preferred item has been selected–as one approach to increase the diversity of result sets. In comparison to collections of the most popular items, from user votes on Digg. com and links from a panel of political blogs, the Sidelines algorithm increased inclusion while decreasing alienation. For the blog links, a set with known political preferences, we also found that Sidelines improved proportional representation. In an online experiment using blog link data as votes, readers were more likely to find something challenging to their views in the Sidelines result sets. These findings can help build news and opinion aggregators that present users with a broader range of topics and opinions.", "num_citations": "67\n", "authors": ["1169"]}
{"title": "Effects of public commitments and accountability in a technology-supported physical activity intervention\n", "abstract": " Walking and other forms of physical activity have many health benefits, but people often fail to follow through on their own goals of being more active. To address gaps in current understanding of how to design technology-supported physical activity interventions, we conducted a randomized field experiment of a commitment device: making public announcements. In a control condition, weekly commitments were kept private. In two treatment conditions, they were announced on Facebook and by email. In one of the two, the announcements also included results: whether the previous week's commitment was kept. We find that, with or without public results, these posts can elicit supportive replies from the poster's social networks. People in both public announcements conditions were less likely to make commitments. We conclude that the prospect of public accountability may suppress the making of commitments in a …", "num_citations": "60\n", "authors": ["1169"]}
{"title": "Evaluating Active U: an Internet-mediated physical activity program\n", "abstract": " Engaging in regular physical activity can be challenging, particularly during the winter months. To promote physical activity at the University of Michigan during the winter months, an eight-week Internet-mediated program (Active U) was developed providing participants with an online physical activity log, goal setting, motivational emails, and optional team participation and competition. This study is a program evaluation of Active U. Approximately 47,000 faculty, staff, and graduate students were invited to participate in the online Active U intervention in the winter of 2007. Participants were assigned a physical activity goal and were asked to record each physical activity episode into the activity log for eight weeks. Statistics for program reach, effectiveness, adoption, and implementation were calculated using the Re-Aim framework. Multilevel regression analyses were used to assess the decline in rates of data entry and goal attainment during the program, to assess the likelihood of joining a team by demographic characteristics, to test the association between various predictors and the number of weeks an individual met his or her goal, and to analyze server load. Overall, 7,483 individuals registered with the Active U website (≈16% of eligible), and 79% participated in the program by logging valid data at least once. Staff members, older participants, and those with a BMI < 25 were more likely to meet their weekly physical activity goals, and average rate of meeting goals was higher among participants who joined a competitive team compared to those who participated individually (IRR = 1.28, P < .001). Internet-mediated physical activity …", "num_citations": "59\n", "authors": ["1169"]}
{"title": "Adding an online community to an internet-mediated walking program. Part 2: strategies for encouraging community participation\n", "abstract": " Starting a new online community with a limited number of members who have not self-selected for participation in the community is challenging. The space must appear active to lure visitors to return; when the pool of participants is small, a large fraction must be converted from lurkers to contributors, and contributors must receive responses quickly to encourage continued participation. We report on strategies for overcoming these challenges and our experience implementing them within an online community add-on to an existing Internet-mediated walking program.", "num_citations": "57\n", "authors": ["1169"]}
{"title": "Protocols for automated negotiations with buyer anonymity and seller reputations\n", "abstract": " In many Internet commerce applications buyers can easily achieve anonymity, limiting what a seller can learn about any buyer individually. However, because sellers need to keep a fixed web address, buyers can probe them repeatedly or pool their information about sellers with the information obtained by other buyers; hence, sellers' strategies become public knowledge. Under assumptions of buyer anonymity, publicly‐known seller strategies, and no negotiation transaction costs for buyers, we find that take‐it‐or‐leave‐it offers will yield at least as much seller profit as any attempt at price discrimination could yield. As we relax those assumptions, however, we find that sellers, and in some cases buyers as well, may benefit from a more general bargaining protocol.", "num_citations": "57\n", "authors": ["1169"]}
{"title": "The prevalence of political discourse in non-political blogs\n", "abstract": " Though political theorists have emphasized the importance of political discussion in non-political spaces, past study of online political discussion has focused on primarily political websites. Using a random sample from Blogger. com, we find that 25% of all political posts are from blogs that post about politics less than 20% of the time, because the vast majority of blogs post about politics some of the time but infrequently. Far from being taboo topics in those non-political blogs, political posts got slightly more comments than non-political posts in those same blogs, and the comments overwhelmingly engage the political topics of the post, mostly agreeing but frequently disagreeing as well. We argue that non-political spaces devoted primarily to personal diaries, hobbies, and other topics represent a substantial place of online political discussion and should be a site for further study.", "num_citations": "55\n", "authors": ["1169"]}
{"title": "Managing trust in an information‐labeling system\n", "abstract": " Many network services need to make “trust management” decisions; in particular, processing users' requests for action often requires using labels and credentials that may not be authentic or trustworthy. In this paper, we address the problem of trust management in information labeling. The Platform for Internet Content Selection (PICS), proposed by Resnick and Miller [13], establishes a flexible way to label documents according to various aspects of their contents, thus permitting a large and diverse group of potential viewers to make (automated) informed judgments about whether or not to view them. For some viewers, the relevant aspects may be quantity or quality of material in certain topical areas, and, for others, they may be the presence or absence of potentially offensive language or images. Thus PICS users need a language in which to specify their PICS profiles, i.e., the aspects according to which they …", "num_citations": "53\n", "authors": ["1169"]}
{"title": "Req-rec: High recall retrieval with query pooling and interactive classification\n", "abstract": " We consider a scenario where a searcher requires both high precision and high recall from an interactive retrieval process. Such scenarios are very common in real life, exemplified by medical search, legal search, market research, and literature review. When access to the entire data set is available, an active learning loop could be used to ask for additional relevance feedback labels in order to refine a classifier. When data is accessed via search services, however, only limited subsets of the corpus can be considered, subsets defined by queries. In that setting, relevance feedback has been used in a query enhancement loop that updates a query.", "num_citations": "47\n", "authors": ["1169"]}
{"title": "The information cost of manipulation-resistance in recommender systems\n", "abstract": " Attackers may seek to manipulate recommender systems in order to promote or suppress certain items. Existing defenses based on analysis of ratings also discard useful information from honest raters. In this paper, we show that this is unavoidable and provide a lower bound on how much information must be discarded. We use an information-theoretic framework to exhibit a fundamental tradeoff between manipulation-resistance and optimal use of genuine ratings in recommender systems. We define a recommender system to be (n, c)-robust if an attacker with n sybil identities cannot cause more than a limited amount c units of damage to predictions. We prove that any robust recommender system must also discard Ω (log (n/c)) units of useful information from each genuine rater.", "num_citations": "47\n", "authors": ["1169"]}
{"title": "Design decisions in the RideNow project\n", "abstract": " The RideNow Project is designed to help individuals within a group or organization coordinate ad hoc shared rides. This paper describes three design decisions the RideNow team made in order to allow incremental adoption and evolution and to capitalize on local conditions.(1) The system allows users to interact with the system through email or Web, because we anticipate that email will be most convenient when there are few users but the Web interface will be more useful as the number of users increase.(2) The system does not force structure on user-entered data such as dates, times, and locations, instead allowing conventions to emerge.(3) We use the group's shared physical spaces to provide additional information about ride sharing activity.", "num_citations": "47\n", "authors": ["1169"]}
{"title": "Community commerce: Facilitating trust in mom-to-mom sale groups on Facebook\n", "abstract": " Consumers are turning to Facebook Groups to buy and sell with strangers in their local communities. This trend is counter-intuitive given Facebook's lack of conventional e-commerce features, such as sophisticated search engines and reputation systems. We interviewed 18 members of two Mom-to-Mom Facebook sale groups. Despite a lack of commerce tools, members perceived sale groups as an easy-to-use way to quickly and conveniently buy and sell. Most important to members was that the groups felt safe and trustworthy. Drawing on these insights, we contribute a novel framing, community commerce, which explains the trust mechanisms that enable transactions between strangers in some groups. Community commerce fosters trust through (a) exclusive membership to a closed group,(b) regulation and sanctioning of behavior at the admin, member, and group level, and (c) a shared group identity or …", "num_citations": "46\n", "authors": ["1169"]}
{"title": "HyperVoice: a phone-based CSCW platform\n", "abstract": " ABSTRACT A major shift is underway in how we think about telephones. For decades, they were used solely for oneto-one, synchronous communication. The increasing use of answering machines and voice messaging, however, is shifting the public perception of telephones, thus opening a space for more innovative applications. Five years from now, some of the most interesting and popular cooperative work applications will probably use telephones as the primary means of access. This paper presents evidence that there are practical phone-basedcooperative work applications and describes a set of software tools that facilitate the development of such applications.", "num_citations": "44\n", "authors": ["1169"]}
{"title": "Thanks and tweets: comparing two public displays\n", "abstract": " Two public display systems, with different methods of posting, were deployed over several years. One, the Thank You Board, was designed to give people an outlet specifically for publicly thanking and acknowledging others in the community. The other, SI Display, showed any Twitter post directed to the display and did not have explicit usage guidelines. People preferred the flexibility of the latter, but ambiguity about its purpose and norms of usage persisted even six months after deployment and made some people hesitant to post. Also, using Twitter as the posting mechanism facilitated participation for some but also created barriers for those not using Twitter and for Twitter users who were wary of mixing their professional and non-professional contexts.", "num_citations": "40\n", "authors": ["1169"]}
{"title": "Sybilproof transitive trust protocols\n", "abstract": " We study protocols to enable one user (the principal) to make potentially profitable but risky interactions with another user (the agent), in the absence of direct trust between the two parties. In such situations, it is possible to enable the interaction indirectly through a chain of credit or\" trust\" links. We introduce a model that provides insight into many disparate applications, including open currency systems, network trust aggregation systems, and manipulation-resistant recommender systems. Each party maintains a trust account for each other party. When a principal's trust balance for an agent is high enough to cover potential losses from a bad interaction, direct trust is sufficient to enable the interaction. Allowing indirect trust opens up more interaction opportunities, but also expands the strategy space of an attacker seeking to exploit the community for its own ends. We show that with indirect trust exchange protocols …", "num_citations": "40\n", "authors": ["1169"]}
{"title": "Calculating error rates for filtering software\n", "abstract": " Surveys in the U.S. have found that 95% of schools [4], 43% of public libraries [5], and 33% of teenagers' parents [8] employ filtering software to block access to pornography and other inappropriate content. Many products are also now available to filter out spam email.Filtering software, however, cannot perfectly discriminate between allowed and forbidden content, resulting in two types of errors. First, under-blocking occurs when content is not blocked that should be restricted. Second, over-blocking occurs when content is blocked that should not have been restricted. Steps can be taken to reduce the frequency of errors, and to reduce their costs (for example, by providing easy appeals processes, quick overrides, and corrections) but some errors are inevitable.", "num_citations": "40\n", "authors": ["1169"]}
{"title": "Relief from the audio interface blues: expanding the spectrum of menu, list, and form styles\n", "abstract": " Menus, lists, and forms are the workhorse dialogue structures in telephone-based interactive voice response applications. Despite diversity in applications, there is a surprising homogeneity in the menu, list, and form styles commonly employed. There are, however, many alternatives, and no single style fits every prospective application and user population. A design space for each dialogue structure organizes the alternatives and provides a framework for analyzing their benefits and drawbacks. In addition to phone-based interactions, the design spaces apply to any limited-bandwidth, temporally constrained display devices, including small-screen devices such as personal digital assistants (PDAs) and screen phones.", "num_citations": "38\n", "authors": ["1169"]}
{"title": "Phone-based CSCW: tools and trials\n", "abstract": " Telephones are the most ubiquitous, best-networked, and simplest computer terminals available today. They have been used for voice mail but largely overlooked as a platform for asynchronous cooperative-work applications such as event calendars, issue discussions, and question-and-answer gathering. HyperVoice is a software toolkit for constructing such applications. Its building blocks are high-level presentation formats for collections of structured voice messages. The presentation formats can themselves be presented and manipulated, enabling significant customization of applications by phone. Results of two field trials suggest social-context factors that will influence the success or failure of phone-based cooperative work applications in particular settings.", "num_citations": "35\n", "authors": ["1169"]}
{"title": "Implementation and evaluation of an incentivized Internet-mediated walking program for obese adults\n", "abstract": " In response to rising health care costs associated with obesity rates, some health care insurers are adopting incentivized technology-enhanced wellness programs. The purpose of this study is to evaluate the large-scale implementation of an incentivized Internet-mediated walking program for obese adults and to examine program acceptance, adherence, and impact. A mixed-methods evaluation was conducted to investigate program implementation, acceptance, and adherence rates, and physical activity rates among program participants. Program implementation was shaped by national and state policies, data security concerns, and challenges related to incentivizing participation. Among 15,397 eligible individuals, 6,548 (43 %) elected to participate in the walking program, achieving an average of 6,523 steps/day (SD 2,610 steps). Participants who uploaded step counts for 75 % of days for a full year (n …", "num_citations": "31\n", "authors": ["1169"]}
{"title": "Quick, community-specific learning: How distinctive toxicity norms are maintained in political subreddits\n", "abstract": " Online communities about similar topics may maintain very different norms of interaction. Past research identifies many processes that contribute to maintaining stable norms, including self-selection, pre-entry learning, post-entry learning, and retention. We analyzed political subreddits that had distinctive, stable levels of toxic comments on Reddit, in order to identify the relative contribution of these four processes. Surprisingly, we find that the largest source of norm stability is pre-entry learning. That is, newcomers' first comments in these distinctive subreddits differ from those same people's prior behavior in other subreddits. Through this adjustment, they nearly match the toxicity level of the subreddit they are joining. We also show that behavior adjustments are community-specific and not broadly transformative. That is, people continue to post toxic comments at their previous rates in other political subreddits. Thus, we conclude that in political subreddits, compatible newcomers are neither born nor made–they make local adjustments on their own.", "num_citations": "29\n", "authors": ["1169"]}
{"title": "Tracking the development of media frames within and across policy issues\n", "abstract": " Framing is a central concept in political communication and a powerful political tool. Thus, it is hugely important to understand: a) what frames are used to define specific issues, b) what general patterns are evidenced by the evolution of frames over time, and c) how frames diffuse, or spread, across policy areas and venues. These tasks also pose a serious challenge, thanks to the volume of text data, the dynamic nature of language, and the variance in applicable frames across issues (eg, the ‘innocence’frame of the death penalty debate is not used in discussing smoking bans). We describe a project that advances framing research methodology in two ways. First, we present a unified coding scheme for content analysis across issues, whereby issue-specific frames (eg, innocence) are nested within high-level dimensions (or frame types) that cross-cut issues (eg, fairness). We call this the “Policy Frames Codebook” with an eye toward doing for frame categorization across issues what the Policy Agendas Codebook has done for issue categorization across agendas. Second, we validate the policy frames coding scheme by applying it to news coverage of three issues—smoking, immigration, and same-sex marriage—in the United States over a twenty-two year period. This pilot dataset is the first cut from a larger data collection effort that will eventually span news coverage of five policy issues over several decades. Using this data, our long-term aim is to identify and assess empirical patterns in which frames tend to get selected across policy debates in the United States, how frames within policy debates tend to evolve, and the conditions under which …", "num_citations": "29\n", "authors": ["1169"]}
{"title": "Extractive adversarial networks: High-recall explanations for identifying personal attacks in social media posts\n", "abstract": " We introduce an adversarial method for producing high-recall explanations of neural text classifier decisions. Building on an existing architecture for extractive explanations via hard attention, we add an adversarial layer which scans the residual of the attention for remaining predictive signal. Motivated by the important domain of detecting personal attacks in social media comments, we additionally demonstrate the importance of manually setting a semantically appropriate `default' behavior for the model by explicitly manipulating its bias term. We develop a validation set of human-annotated personal attacks to evaluate the impact of these changes.", "num_citations": "27\n", "authors": ["1169"]}
{"title": "Impulse buying: Design practices and consumer needs\n", "abstract": " E-commerce sites have an incentive to encourage impulse buying, even when not in the consumer's best interest. This study investigates what features e-commerce sites use to encourage impulse buying and what tools consumers desire to curb their online spending. We present two studies:(1) a systematic content analysis of 200 top e-commerce websites in the US and (2) a survey of online impulse buyers (N= 151). From Study 1, we find that e-commerce sites contain multiple features that encourage impulsive buying, including those that lower perceived risks, leverage social influence, and enhance perceived proximity to the product. Conversely, from Study 2 we find that online impulse buyers want tools that (a) encourage deliberation and avoidance,(b) enforce spending limits and postponement,(c) increase checkout effort,(d) make costs more salient, and (e) reduce product desire. These findings inform the …", "num_citations": "24\n", "authors": ["1169"]}
{"title": "The Social Costs of Cheap Pseudonyms: fostering cooperation on the Internet\n", "abstract": " On the Internet it is easy for someone to obtain a new identity. This introduces opportunities to misbehave without paying reputational consequences. A large degree of cooperation can still emerge, through a convention in which newcomers ``pay their dues'' by accepting poor treatment from players who have established positive reputations. One might hope for an open society where newcomers are treated well, but there is an inherent social cost in making the spread of reputations optional. We prove that no equilibrium can sustain significantly more cooperation than the dues-paying equilibrium in a repeated random matching game with a large number of players in which players have finite lives and the ability to change their identities, and there is a small but nonvanishing probability of mistakes. Although one could remove the inefficiency of mistreating newcomers by disallowing anonymity, this is not practical or desirable in a wide variety of transactions. We discuss the use of entry fees, which permits newcomers to be trusted but excludes some players with low payoffs, thus introducing a different inefficiency. We also discuss the use of free but unreplaceable pseudonyms, and describe a mechanism which implements them using standard encryption techniques.", "num_citations": "23\n", "authors": ["1169"]}
{"title": "Multiple queries as bandit arms\n", "abstract": " Existing retrieval systems rely on a single active query to pull documents from the index. Relevance feedback may be used to iteratively refine the query, but only one query is active at a time. If the user's information need has multiple aspects, the query must represent the union of these aspects. We consider a new paradigm of retrieval where multiple queries are kept``active''simultaneously. In the presence of rate limits, the active queries take turns accessing the index to retrieve another``page''of results. Turns are assigned by a multi-armed bandit based on user feedback. This allows the system to explore which queries return more relevant results and to exploit the best ones. In empirical tests, query pools outperform solo, combined queries. Significant improvement is observed both when the subtopic queries are known in advance and when the queries are generated in a user-interactive process.", "num_citations": "19\n", "authors": ["1169"]}
{"title": "Label syntax and communication protocols\n", "abstract": " This document has been prepared for the technical subcommittee of PICS (Platform for Internet Content Selection). It de nes a general format for labels that permits them to be embedded in RFC-822-style headers. It de nes three methods by which PICS labels may be transmitted:", "num_citations": "18\n", "authors": ["1169"]}
{"title": "I scratched yours: The prevalence of reciprocation in feedback provision on eBay\n", "abstract": " Many online systems for bilateral transactions elicit performance feedback from both transacting partners. Such bilateral feedback giving introduces strategic considerations. We focus on reciprocity in the giving of feedback: how prevalent a strategy of giving feedback is only if feedback is first received from one's trading partner.  The overall level of feedback activity clearly depends on the prevalence of the reciprocation strategy: in a market with many reciprocators and few unconditional feedback providers, the equilibrium quantity of feedback can be quite low.  We estimate the prevalence of such reciprocation in one market, eBay. Reciprocation cannot be directly distinguished from late feedback that was not conditioned on the partner having provided feedback. We develop a model that distinguishes the two by exploiting information about the timing of feedback provision when the partner does not provide feedback …", "num_citations": "15\n", "authors": ["1169"]}
{"title": "Manipulation-resistant recommender systems through influence limits\n", "abstract": " In this letter, we outline a new approach to modeling, analyzing, and combating manipulative attacks on recommender systems.", "num_citations": "15\n", "authors": ["1169"]}
{"title": "Skip and scan telephone menus: User performance as a function of experience\n", "abstract": " We present the results of a laboratory study comparing three styles of audio menus. One of these styles is the technique predominantly employed in interactive voice response (IVR) systems today. Two alternatives to this Standard technique were evaluated in this study. One of these alternatives was first proposed in Resnick and Virzi (1992), which they called Skip and Scan menus. This new style was hypothesized to be superior to Standard menus for intermediate users, but was expected to show limitations for one-time callers and expert users. The third menu alternative we evaluated combines elements of the Standard and Skip and Scan menus and was hypothesized to be superior in a broad range of usage conditions. Performance was measured over 36 tasks and two IVR applications. In all but the first few trials, the Skip and Scan menu style reported in Resnick and Virzi led to performance equal to or better …", "num_citations": "15\n", "authors": ["1169"]}
{"title": "Generalizing on multiple grounds: Performance learning in model-based troubleshooting\n", "abstract": " Model-based reasoning about physical systems has several well-known advantages over heuristic expert systems. These include correctness of conclusions, explanations of conclusions, ease of modifiability and ease of transfer of expertise to new physical systems. On the other hand, reasoning from a model can be slow. This thesis explores ways to augment a model-based diagnostic program with a learning component, so that it speeds up as it solves problems. Several learning components are proposed, each exploiting a different kind of similarity between diagnostic examples. Through analysis and experiments, we explore the effect each learning component has on the performance of a model-based diagnostic program. We also analyze more abstractly the performance effects of Explanation-Based Generalization, a technology that is used in several of the proposed learning components.Descriptors:", "num_citations": "15\n", "authors": ["1169"]}
{"title": "Creating guided code explanations with chat. codes\n", "abstract": " Effective communication is crucial for instructors and students in programming courses. However, communicating about code can be difficult --- particularly in asynchronous settings where an instructor authors an explanation meant to be read and understood by a student later on. Communicating about code is uniquely difficult for two reasons. First, because of the dichotomous nature of the explanation, which consists of fragments of code and natural language descriptions. Second, instructors' explanations of code often involve modifying code throughout their explanation. This paper introduces chat.codes, a new tool for creating guided explanations about code. chat.codes introduces two features that make it easier to communicate about code. First, it adds deictic code references that allows instructors to write messages that reference specific regions of code. Second, it tracks and summarizes code edits in-line with …", "num_citations": "14\n", "authors": ["1169"]}
{"title": "Iffy quotient: A platform health metric for misinformation\n", "abstract": " Social media sites and search engines have become the de facto gatekeepers of public communication, a role once occupied by publishers and broadcasters. With this new role come public responsibilities, including limiting the spread of misinformation.Externally maintained metrics offer a way to measure the progress of media platforms at meeting their public responsibilities. By contrast with the current environment of accountability by anecdotes, Platform Health Metrics can focus attention on the overall performance of platforms rather than on bad outcomes in individual cases.", "num_citations": "14\n", "authors": ["1169"]}
{"title": "The rainbow pages: Building community with voice technology\n", "abstract": " There is no such thing as a poor community. Even neighborhoods without much money have substantial human resources. Often, however, the human resources are not", "num_citations": "14\n", "authors": ["1169"]}
{"title": "A spaced, interleaved retrieval practice tool that is motivating and effective\n", "abstract": " Retrieval practice, spacing, and interleaving are known to enhance long-term learning and transfer, but reduce short-term performance. It can be difficult to get both students and instructors to use these techniques since they perceive them as impeding initial student learning. We leveraged user experience design and research techniques, including survey and participant observation, to improve the design of a practice tool during a semester of use in a large introductory Python programming course. In this paper, we describe the design features that made the tool effective for learning as well as motivating. These include requiring spacing by giving credit for each day that a student answered a minimum number of questions, adapting a spaced repetition algorithm to schedule topics rather than specific questions, providing a visual representation of the evolving schedule in order to support meta-cognition, and …", "num_citations": "13\n", "authors": ["1169"]}
{"title": "Negotiating reputations\n", "abstract": " This article presents an overview of multiple studies using data from Internet markets to examine the role of reputation in building trust. It specifically addresses the interaction of reputations and dispute resolution. Parties that care more about their reputations deliver more power to their partners in these negotiations. Endogenous feedback is systematically affected by strategic incentives and psychosocial behaviors and is thus less informative than it might be. Reducing the gaming opportunities in feedback provision tends to increase market efficiency. Economic engineering may help to support the effectiveness of reputation building. Market platforms such as eBay continuously monitor and improve trust and trustworthiness on their platform. It is believed that the various phenomena observed on eBay generalize beyond Internet markets.", "num_citations": "13\n", "authors": ["1169"]}
{"title": "What social media data we are missing and how to get it\n", "abstract": " Most electronic behavior traces available to social scientists offer a site-centric view of behavior. We argue that to understand patterns of interpersonal communication and media consumption, a more person-centric view is needed. The ideal research platform would capture reading as well as writing and friending, behavior across multiple sites, and demographic and psychographic variables. It would also offer opportunities for researchers to make interventions that make changes and additions to the information presented to people in social media interfaces. Any attempt to create such an ideal platform will have to make compromises because of engineering and privacy constraints. We describe one attempt to navigate those tensions: the MTogether project will recruit a panel of participants who will install a browser extension and mobile app that enable limited data collection and interventions.", "num_citations": "12\n", "authors": ["1169"]}
{"title": "Educational priorities for technology-mediated social participation\n", "abstract": " An ambitious TMSP education program which recognizes that learners fall into multiple categories, will facilitate training people to participate in the complex interplay between social participation and technical systems.", "num_citations": "12\n", "authors": ["1169"]}
{"title": "Audience analysis for competing memes in social media\n", "abstract": " Existing tools for exploratory analysis of information diffusion in social media focus on the message senders who actively diffuse the meme. We develop a tool for audience analysis, focusing on the people who are passively exposed to the messages, with a special emphasis on competing memes such as propagations and corrections of a rumor. In such competing meme diffusions, important questions include which meme reached a bigger total audience, the overlap in audiences of the two, and whether exposure to one meme inhibited propagation of the other. We track audience members’ states of interaction, such as having been exposed to one meme or another or both. We analyze the marginal impact of each message in terms of the number of people who transition between states as a result of that message. These marginal impacts can be computed efficiently, even for diffusions involving thousands of senders and millions of receivers. The marginal impacts provide the raw material for an interactive tool, RumorLens, that includes a Sankey diagram and a network diagram. We validate the utility of the tool through a case study of nine rumor diffusions. We validate the usability of the tool through a user study, showing that nonexperts are able to use it to answer audience analysis questions.", "num_citations": "10\n", "authors": ["1169"]}
{"title": "HyperVoice: Groupware by telephone.\n", "abstract": " Degree: Ph. D.DegreeYear: 1992Institute: Massachusetts Institute of TechnologyMany useful group communication and coordination applications appear to require large investments in portable and desktop computers. Instead, why not leverage the huge installed base of touch-tone telephones? This thesis presents user interface improvements and software tools that enhance the viability of phone-based groupware.", "num_citations": "10\n", "authors": ["1169"]}
{"title": "No such thing as too much chocolate: Evidence against choice overload in e-commerce\n", "abstract": " E-commerce designers must decide how many products to display at one time. Choice overload research has demonstrated the surprising finding that more choice is not necessarily better? selecting from larger choice sets can be more cognitively demanding and can result in lower levels of choice satisfaction. This research tests the choice overload effect in an e-commerce context and explores how the choice overload effect is influenced by an individual's tendency to maximize or satisfice decisions. We conducted an online experiment with 611 participants randomly assigned to select a gourmet chocolate bar from either 12, 24, 40, 50, 60, or 72 different options. Consistent with prior work, we find that maximizers are less satisfied with their product choice than satisficers. However, using Bayesian analysis, we find that it's unlikely that choice set size affects choice satisfaction by much, if at all. We discuss why the …", "num_citations": "9\n", "authors": ["1169"]}
{"title": "Cubethat: news article recommender\n", "abstract": " The CubeThat browser extension for Chrome displays recommended additional news stories related to the same topic as the current news story. The recommended stories are organized into clusters, and clusters that the user has already sampled from are grayed out, in order to encourage users to explore multiple aspects of a story. Users can also provide feedback to improve the clustering, by dragging stories from one cluster to another.", "num_citations": "9\n", "authors": ["1169"]}
{"title": "Financial incentives for route aggregation and efficient address utilization in the internet\n", "abstract": " Financial incentives for route aggregation and efficient address utilization in the Internet | Coordinating the Internet ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleBooksCoordinating the InternetFinancial incentives for route aggregation and efficient address utilization in the Internet chapter Financial incentives for route aggregation and efficient address utilization in the Internet Share on Authors: Yakov Rekhter View Profile , Paul Resnick View Profile , Steven M. Bellovin View Profile Authors Info & Affiliations Coordinating the InternetSeptember 1997 Pages 273–287 Published:01 September 1997 2citation 0 Downloads Metrics Total …", "num_citations": "9\n", "authors": ["1169"]}
{"title": "Feature-Based Explanations Don't Help People Detect Misclassifications of Online Toxicity\n", "abstract": " We present an experimental assessment of the impact of feature attribution-style explanations on human performance in predicting the consensus toxicity of social media posts with advice from an unreliable machine learning model. By doing so we add to a small but growing body of literature inspecting the utility of interpretable machine learning in terms of human outcomes. We also evaluate interpretable machine learning for the first time in the important domain of online toxicity, where fully-automated methods have faced criticism as being inadequate as a measure of toxic behavior.", "num_citations": "8\n", "authors": ["1169"]}
{"title": "Guessthekarma: a game to assess social rating systems\n", "abstract": " Popularity systems, like Twitter retweets, Reddit upvotes, and Pinterest pins have the potential to guide people toward posts that others liked. That, however, creates a feedback loop that reduces their informativeness: items marked as more popular get more attention, so that additional upvotes and retweets may simply reflect the increased attention and not independent information about the fraction of people that like the items. How much information remains? For example, how confident can we be that more people prefer item A to item B if item A had hundreds of upvotes on Reddit and item B had only a few? We investigate using an Internet game called GuessTheKarma that collects independent preference judgments (N=20,674) for 400 pairs of images, approximately 50 per pair. Unlike the rating systems that dominate social media services, GuessTheKarma is devoid of social and ranking effects that influence …", "num_citations": "8\n", "authors": ["1169"]}
{"title": "Designing interfaces for presentation of opinion diversity\n", "abstract": " News aggregators rely on links and users votes to select and present subsets of the large quantity of news and opinion items generated each day. Opinion diversity in the output sets can provide several benefits. We outline a range of diversity goals and discuss user reactions to a pilot implementation that selects for diversity as well as popularity. We then describe plans for research on alternative presentations and their impacts on users.", "num_citations": "8\n", "authors": ["1169"]}
{"title": "AnOpen Architecture for Collaborative Filterring of Netnews\n", "abstract": " CiNii 論文 - AnOpen Architecture for Collaborative Filterring of Netnews CiNii 国立情報学 研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす 大学図書館の本をさがす 日本の博士 論文をさがす 新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者 名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版年 年から 年まで 検索 検索 検索 AnOpen Architecture for Collaborative Filterring of Netnews RESNICK P. 被引用文献: 1件 著者 RESNICK P. 収録刊行物 Proc CSCW' 94 Proc CSCW' 94, 1994 被引用文献: 1件中 1-1件を 表示 1 Webデザインに対する印象と記憶される情報量との関係性分析 酒巻 隆治 , 染矢 聡 , 岡本 孝司 デザイン学研究 55(6), 59-66, 2009 参考文献39件 被引用文献4件 Tweet 各種コード NII論文 ID(NAID) 10025271308 資料種別 会議資料 データ提供元 CJP引用 書き出し RefWorksに書き出し EndNoteに書き出し Mendeleyに書き出し Refer/BiblXで表示 RISで表示 BibTeXで表示 TSVで…", "num_citations": "8\n", "authors": ["1169"]}
{"title": "Threading is sticky: How threaded conversations promote comment system user retention\n", "abstract": " The Guardian ---the fifth most widely read online newspaper in the world as of 2014---changed conversations on its commenting platform by altering its design from non-threaded to single-level threaded in 2012. We studied this naturally occurring experiment to investigate the impact of conversation threading on user retention as mediated by several potential changes in conversation structure and style. Our analysis shows that the design change made new users significantly more likely to comment a second time, and that this increased stickiness is due in part to a higher fraction of comments receiving responses after the design change. In mediation analysis, other anticipated mechanisms such as reciprocal exchanges and comment civility did not help to explain users' decision to return to the commenting system; indeed, civility did not increase after the design change and reciprocity declined. These analyses …", "num_citations": "7\n", "authors": ["1169"]}
{"title": "Does clustered presentation lead readers to diverse selections?\n", "abstract": " A recent study found that presenting news suggestions as clusters in a sidebar can lead to more exploration of articles and clusters related to particular stories [1]. We conducted a lab study to test the robustness of the result. Our results only partially replicate the original findings: people read more articles, but not from significantly more clusters; we also foundthat they prefer the clustered presentation. Further research is needed to better understand the conditions under which clustered presentation leads people to sample from more clusters.", "num_citations": "6\n", "authors": ["1169"]}
{"title": "Assessment of conversation co-mentions as a resource for software module recommendation\n", "abstract": " Conversation double pivots recommend target items related to a source item, based on co-mentions of source and target items in online forums. We deployed several variants on the drupal. org site that supports the Drupal open source community, and assessed them through clickthrough rates. A similarity metric based on correlation of mentions rather than mere co-occurrence reduced the problem of over-recommending the most popular modules, but additional corrections for recency and uniqueness of mentions were not helpful. Detection of more module mentions in conversations dramatically improved the quality of recommendations, even though the detection algorithm then had more false positives. Recommendations based on conversation co-mention were more effective than those based on co-installation, because co-installation data only led to recommendations of complementary modules and not …", "num_citations": "6\n", "authors": ["1169"]}
{"title": "GoodNews, a collaborative filter for network news\n", "abstract": " An enormous amount of information flows into global computer networks every day, very little of which is useful to any one person. To have a strategic advantage, a corporation connected to these networks must watch technology and the market, and must extract relevant information from the networks. GoodNews is a system that acts as a filter for reading news articles posted to the Internet Network News system. It is based on the tenet that when people know of each others' interests, they can collaborate in disseminating information. Readers with high interest in a topic will read news articles on that topic and endorse those they think may be relevant to others. Readers with low interest in that topic will find and read the articles that others have endorsed. In this way, people collaborate in selecting information for mutual benefit.", "num_citations": "6\n", "authors": ["1169"]}
{"title": "The shape of educational inequality\n", "abstract": " Hundreds of thousands of students drop out of school each year in the United States, despite billions of dollars of funding and myriad educational reforms. Existing research tends to look at the effect of easily measurable student characteristics. However, a vast number of harder-to-measure student traits, skills, and resources affect educational success. We present a conceptual framework for the cumulative effect of all factors, which we call student capital. We develop a method for estimating student capital in groups of students and find that student capital is distributed exponentially in each of 140 cohorts of community college students. Students’ ability to be successful does not behave like standard tests of intelligence. Instead, it acts like a limited resource, distributed unequally. The results suggest that rather than removing barriers related to easily measured characteristics, interventions should be focused on …", "num_citations": "5\n", "authors": ["1169"]}
{"title": "Photo Directories: A Tool for Organizing Sociability in Neighborhoods and Organizations\n", "abstract": " Despite strong evidence of the value of social capital, very little is known about how to design for social capital accumulation. One interesting opportunity is to support what we call organized sociability. Information technology can help, not only by improving communication and coordination, but also by creating opportunities for actions that have important psychological impacts. Churches have long made use of photo directories to create a sense of community. We examine how photo directories can draw on and produce organized sociability in other settings. The\" Who's That?\" Project has been creating photo directories for neighborhood blocks and other groups for the last three years. Evidence from three small-scale experiments suggest positive impacts on organized sociability, with clearer evidence of impacts on directory makers than on participants.", "num_citations": "5\n", "authors": ["1169"]}
{"title": "QMaps: Engaging Students in Voluntary Question Generation and Linking\n", "abstract": " Generating multiple-choice questions is known to improve students' critical thinking and deep learning. Visualizing relationships between concepts enhances meaningful learning, students' ability to relate new concepts to previously learned concepts. We designed and deployed a collaborative learning process through which students generate multiple-choice questions and represent the prerequisite knowledge structure between questions as visual links in a shared map, using a variation of Concept Maps that we call\" QMap.\" We conducted a four-month study with 19 undergraduate students. Students sustained voluntary contributions, creating 992 good questions, and drawing 1,255 meaningful links between the questions. Through analyzing self-reports, observations, and usage data, we report on the technical and social design features that led students to sustain their motivation.", "num_citations": "4\n", "authors": ["1169"]}
{"title": "Online Reputation Mechanisms: A Roadmap for Future Research\n", "abstract": " You can read this entire report online at LiveJournal, where you can see after each section whether there are already comments from other readers. Or, you can read this MS Word document, and click on the link for each section to go to the online comments area for that section. Please add your comments and suggestions!", "num_citations": "4\n", "authors": ["1169"]}
{"title": "Political Discussion is Abundant in Non-political Subreddits (and Less Toxic)\n", "abstract": " Research on online political communication has primarily focused on content in explicitly political spaces. In this work, we set out to determine the amount of political talk missed using this approach. Focusing on Reddit, we estimate that nearly half of all political talk takes place in subreddits that host political content less than 25% of the time. In other words, cumulatively, political talk in non-political spaces is abundant. We further examine the nature of political talk and show that political conversations are less toxic in non-political subreddits. Indeed, the average toxicity of political comments replying to a out-partisan in non-political subreddits is even less than the toxicity of co-partisan replies in explicitly political subreddits.", "num_citations": "3\n", "authors": ["1169"]}
{"title": "Some prior (s) experience necessary: Templates for getting started with bayesian analysis\n", "abstract": " Bayesian statistical analysis has gained attention in recent years, including in HCI. The Bayesian approach has several advantages over traditional statistics, including producing results with more intuitive interpretations. Despite growing interest, few papers in CHI use Bayesian analysis. Existing tools to learn Bayesian statistics require significant time investment, making it difficult to casually explore Bayesian methods. Here, we present a tool that lowers the barrier to exploration: a set of R code templates that guide Bayesian novices through their first analysis. The templates are tailored to CHI, supporting analyses found to be most common in recent CHI papers. In a user study, we found that the templates were easy to understand and use. However, we found that participants without a statistical background were not confident in their use. Together our contributions provide a concise analysis tool and empirical …", "num_citations": "3\n", "authors": ["1169"]}
{"title": "Speed and Studying: Gendered Pathways to Success\n", "abstract": " In an introductory Python programming course intended for non-majors with little prior CS experience, with 85 male and 108 female students, we were able to capture electronic traces of students' studying and problem-solving. There was no significant difference in final exam scores by gender but we found that female students spent 12.1 more hours studying over the semester while male students on average earned 2.7 more points per hour of solving problem set questions over the first half of the semester. We were able to capture their learning behavior because students studied using the Runestone interactive textbook and completed weekly problem sets in the same platform for the first half of the semester. We analyzed these logs to determine three quantities for each student. One is study time, as measured by total use of Runestone outside of weekly assignments. The second is speed, as measured by the …", "num_citations": "3\n", "authors": ["1169"]}
{"title": "Learning from Positive Psychology to Promote Emotional Well-Being in Digital Environments\n", "abstract": " Positive psychology focuses on helping people live happier and more fulfilling lives, not just on treating mental illness. We believe that this perspective is valuable, both for the development of self-help applications and as a tool to help design many types of systems in ways that lead to more positive outcomes for the people who interact with them. Author Keywords Well-being, positive psychology, nudges, persuasive technology. ACM Classification Keywords H. 5. m. Information interfaces and presentation (eg,", "num_citations": "3\n", "authors": ["1169"]}
{"title": "Protecting the Internet as a Public Commons\n", "abstract": " The evolution of the Internet in the past decade—from a slow, stationary, and primarily communications-based technology to a mobile, fast technology that supports a range of communication, participatory, and transactional applications—has made access more valuable, and disconnection more consequential, for individuals. This evolution means that stakeholders should embrace a different framing of the digital divide, focusing on the costs of digital exclusion.", "num_citations": "3\n", "authors": ["1169"]}
{"title": "The Architectures of mandated access controls\n", "abstract": " This chapter proposes an abstract model of mandated access controls for the Internet. The model includes three types of actors: senders, intermediaries and recip-ients. Control decisions are based on three types of information: the item, the recipient’s jurisdiction, and the recipient’s type. With the architecture of today’s Internet, any party on whom responsibility might be placed has insufﬁcient information to carry out that responsibility. That architecture could be changed to provide senders and intermediaries more information about recipient jurisdiction and type or to provide recipients and intermediaries more information about item types. Although such changes are possible, they would be costly in terms of time, money, and freedom. Moreover, such changes would have side effects of enabling regulation of the Internet by both public and private entities, beyond the scope of any legitimate government interest in controlling access to information.", "num_citations": "3\n", "authors": ["1169"]}
{"title": "Multiple dimensions of generalization in model-based troubleshooting\n", "abstract": " Two observations motivate our work:(a) model-based diagnosis programs are powerful but do not learn from experience, and (b) one of the long-term trends in learning research has been the increasing use of knowledge to guide and inform the process of induction. We have developed a knowledge-guided learning method, based in EBL, that allows a model-based diagnosis program to selectively accumulate and generalize its experience. Our work is novel in part because it produces several different kinds of generalizations from a single example. Where previous work in learning has for the most part intensively explored one or another specific kind of generalization, our work has focused on accumulating and using multiple different grounds for generalization, ie, multiple domain theories. As a result our system not only learns from a single example (as in all EBL), it can learn multiple things from a single example. Simply saying there ought to be multiple grounds for generalization only opens up the possibility of exploring more than one domain theory. We provide some guidance in determining which grounds to explore by demonstrating that in the domain of physical devices, causal models are a rich source of useful domain theories. We also caution that adding more knowledge can sometimes degrade performance. Hence we need to select the grounds for generalization carefully and analyze the resulting rules to ensure that they improve performance. We illustrate one such quantitative analysis in the context of a model-based troubleshooting program, measuring and analyzing the gain resulting from the generalizations produced.", "num_citations": "3\n", "authors": ["1169"]}
{"title": "Cross-Partisan Discussions on YouTube: Conservatives Talk to Liberals but Liberals Don't Talk to Conservatives\n", "abstract": " We present the first large-scale measurement study of cross-partisan discussions between liberals and conservatives on YouTube, based on a dataset of 274,241 political videos from 973 channels of US partisan media and 134M comments from 9.3M users over eight months in 2020. Contrary to a simple narrative of echo chambers, we find a surprising amount of cross-talk: most users with at least 10 comments posted at least once on both left-leaning and right-leaning YouTube channels. Cross-talk, however, was not symmetric. Based on the user leaning predicted by a hierarchical attention model, we find that conservatives were much more likely to comment on left-leaning videos than liberals on right-leaning videos. Secondly, YouTube's comment sorting algorithm made cross-partisan comments modestly less visible; for example, comments from conservatives made up 26.3% of all comments on left-leaning videos but just over 20% of the comments were in the top 20 positions. Lastly, using Perspective API's toxicity score as a measure of quality, we find that conservatives were not significantly more toxic than liberals when users directly commented on the content of videos. However, when users replied to comments from other users, we find that cross-partisan replies were more toxic than co-partisan replies on both left-leaning and right-leaning videos, with cross-partisan replies being especially toxic on the replier's home turf.", "num_citations": "2\n", "authors": ["1169"]}
{"title": "Measuring the Meaning of Political Concepts in Chinese Online Deliberation.\"\n", "abstract": " As China’s role becomes increasingly influential in global affairs, research on China, especially on China’s political reform and democratization, has attracted much attention from both practice and academia. The Internet, on the other hand, has brought a new means for Chinese political communication, and has had a profound impact in shaping people’s thought by changing the way people obtain information. Thus, the study of Chinese online political deliberation is one of the key research areas to better understand China and its political challenges.This prelim paper proposes to study the meaning of political concepts such as “democracy”,“rights”,“rule of law”, and so on, in the context of Chinese online deliberation. The first theme of this paper is to review literature in the sociology field, including China studies and deliberation theories. I would argue that the literature demands a better understanding of political …", "num_citations": "2\n", "authors": ["1169"]}
{"title": "The opportunity of social computing to make us healthier together\n", "abstract": " Social computing is perhaps the most promising opportunity for CSCW research to contribute to health and wellness. Social software can help connect patients with their friends and family, with other patients, and with caregivers, giving them access to information and social support. Social software–through comparisons and other techniques–can also help persuade people to make behavior changes that improve their wellness or that can help them better manage a chronic illness. One of the underexplored opportunities in this space is the integration of wellness applications with existing social network sites, which allow developers of applications to leverage a patient’s existing relationships. Through the development of two applications, and deployment of one, we have identified some opportunities and challenges for building applications as part of sites such as Facebook, though many questions will require further study.", "num_citations": "2\n", "authors": ["1169"]}
{"title": "See no evil: How internet filters affect the search for online health information. Kaiser Family Foundation\n", "abstract": " For each of the first four categories, we chose three topics. Popular health topics relevant to adolescents were chosen based largely upon the results of the Kaiser Family Foundation survey Generation Rx. com (Rideout, 2001). Two search strings were then chosen for each topic making a total of 24 health related search strings. For the pornography category we selected 6 pornography related search strings. Frequency data for each search string was obtained from two different search engine logs of search string use, one from Overture. com and the other from Excite (Jansen, Spink, & Saracevic, 2000). When selecting search terms we attempted to find popular terms that described a given topic. Table A-1 includes the final search terms, topics, and categories along with the number of searches performed at Overture and Excite.", "num_citations": "2\n", "authors": ["1169"]}
{"title": "The Boston peace and justice event hotline: a phone-based community bulletin board\n", "abstract": " Touch-tone telephones are the most widely available, best-networked computer terminals. Any civic networking project would do well to consider ways to leverage this resource, since even people who have never used a computer have access to touch-tone phones. I have conducted several tests of telephone bulletin boards, of which the most successful has been an event calendar for Boston area political activists.", "num_citations": "2\n", "authors": ["1169"]}
{"title": "Survey Equivalence: A Procedure for Measuring Classifier Accuracy Against Human Labels\n", "abstract": " In many classification tasks, the ground truth is either noisy or subjective. Examples include: which of two alternative paper titles is better? is this comment toxic? what is the political leaning of this news article? We refer to such tasks as survey settings because the ground truth is defined through a survey of one or more human raters. In survey settings, conventional measurements of classifier accuracy such as precision, recall, and cross-entropy confound the quality of the classifier with the level of agreement among human raters. Thus, they have no meaningful interpretation on their own. We describe a procedure that, given a dataset with predictions from a classifier and K ratings per item, rescales any accuracy measure into one that has an intuitive interpretation. The key insight is to score the classifier not against the best proxy for the ground truth, such as a majority vote of the raters, but against a single human rater at a time. That score can be compared to other predictors' scores, in particular predictors created by combining labels from several other human raters. The survey equivalence of any classifier is the minimum number of raters needed to produce the same expected score as that found for the classifier.", "num_citations": "1\n", "authors": ["1169"]}
{"title": "Using and Customizing Open-Source Runestone Ebooks for Computer Science Classes\n", "abstract": " Runestone is an open-source ebook platform designed to create and publish interactive computer science textbooks (See http://runestoneinteractive. org/). Runestone textbooks support programming within the browser, code visualizations, and a wide variety of practice activities, from multiple choice and fill-in-the-blank questions to Parsons Problems (drag-and-drop mixed-up code). The presenters have several years of experience developing and using ebooks for CS1, AP CS A, AP CSP, data structures, and web programming. Several studies have demonstrated good usability and positive learning and attitude impacts on students using these ebooks. Runestone ebooks can be customized to meet the needs of individual courses and teachers. The goal of this workshop is to help computer science teachers use and modify Runestone ebooks. The hands-on session will start by leading participants through use of …", "num_citations": "1\n", "authors": ["1169"]}
{"title": "Service-learning in the Computer and Information Sciences: Practical applications in engineering education\n", "abstract": " In Service-Learning in the Computer and Information Sciences, editor Brian Nejmeh offers a collection of reflective case studies describing projects and larger university programs that involve undergraduate students in service-learning projects. It provides, first and foremost, a set of existence proofs, that service-learning is something that can occur in the context of Computer and Information Sciences, not only in the social sciences and humanities where it might seem more natural. Students have engaged in many kinds of service, with projects structured in various ways. The reports offer tips and not a few tales of woe that would be valuable reading for any professor or staff member organizing or considering organizing service-learning projects in the computer sciences. Partner organizations might also find the reports valuable for thinking through their own motivations and readiness, especially if they are going into …", "num_citations": "1\n", "authors": ["1169"]}
{"title": "What's SIGCHI's role in strengthening communities?\n", "abstract": " On September 11 we saw how a tightly knit group worked together to penetrate the US and carry out a carefully orchestrated attack on the World Trade Center and Pentagon. We also saw how citizens spontaneously organized themselves to care for victims and their families, and support each other. How can the CHI community build on its knowledge of computer-mediated communication and socio-technical systems design to build a more cooperative society? The aim of this discussion is to develop a research and action agenda for CHI that strengthens communities locally, nationally and internationally. The underlying premise is that such socio-technical systems can be assessed and improved so that they more effectively facilitate information exchange, emotional support, and consensus building.", "num_citations": "1\n", "authors": ["1169"]}
{"title": "Social navigation: what is it good for?\n", "abstract": " In this panel, a group of theorists and systems builders, each of whom has constructed a social navigation system, try to generalize beyond their own specific work and discuss what the possible applications and implications of social navigation will be for human-computer interfaces. Perspectives range from the pragmatic to the theoretical. The panelists describe ways in which future systems, influenced by social navigation ideas, might be built.", "num_citations": "1\n", "authors": ["1169"]}
{"title": "Story\n", "abstract": " People often use recommender systems to make decision. Based on recommendations by other individuals or authorities, choices can be made even without adequate first-hand knowledge of the alternatives. However, recommender systems raise certain social problems, including those that relate to the issues of incentives for generating recommendations and of personal privacy. Another consideration is the high cost of maintaining such a system.", "num_citations": "1\n", "authors": ["1169"]}
{"title": "The design spaces of audio menus and forms\n", "abstract": " Menus and forms are important dialogue structures in telephone-based interactive voice response and other audio applications. There is a surprising lack ofdiversity, however, in the interaction styles they employ. This article presents design spaces for audio menu and form styles. The key idea is to break recordings and actions into parts. The methods of recombining the parts are the dimensions of the design spaces. Twelve alternative menu styles and five form styles illustrate some of the recombination possibilities. Choices on each of the design dimensions affect user interactions, the sound and feel, in predictable ways. The best style will depend on the experience levels of an application's users.* MIT Room E53-325", "num_citations": "1\n", "authors": ["1169"]}
{"title": "The rainbow pages\n", "abstract": " Telecommunication networks have the power to bring people together. Unfortunately, text-based bulletin boards require personal computers as front-ends and that restricts access to only those individuals and organizations that can afford to purchase computers. A voice bulletin board, on the other hand, uses any touch-tone telephone as a front end, and most people in this country already own or can afford to purchase a touchtone telephone. This paper describes the rationale for and design of a free, public-access voice bulletin board that attempts to bring the power of computing to the people of one neighborhood in Boston.", "num_citations": "1\n", "authors": ["1169"]}