{"title": "Critical Success Aspects in Project Management: Similarities and Differences Between the Construction and the Software Industry.\n", "abstract": " Original scientific paper Project success is highly dependent on the project management process, and there are several aspects that need to be carefully considered. This article aims at responding to the research question: are there similarities in different industries in what concerns the critical aspects for the success of project management? Throughout a comprehensive survey applied to medium and large companies of the construction and software industries, we came to the conclusion that the two currently most important project management success aspects are common to both industries:\" project planning\" and\" well defined objectives and requirements\". The\" project manager efficiency\" is also in the top of the critical success aspects. On the other hand, other aspects show major differences in the studied industries.", "num_citations": "89\n", "authors": ["1386"]}
{"title": "Success evaluation factors in construction project management—some evidence from medium and large Portuguese companies\n", "abstract": " The construction industry plays a very important role in the Portuguese economy. In 2009, it was among the top five economic sectors, representing 13% of total employment. Nevertheless, project failures are still frequent mainly due to inadequate management practices and to the intrinsic characteristics of projects of the construction industry. Even though Portuguese construction has improved in recent years, cost and schedule overruns, low productivity and final product quality problems are still common. In this context, project management is a crucial tool for improving construction operations and for the overall success of projects. The aim of this article is to contribute to the discussion on success evaluation factors in a field where little has been written — the construction industry. Through a survey of 40 medium and large Portuguese companies several factors were identified which are currently …", "num_citations": "59\n", "authors": ["1386"]}
{"title": "Project management practices in private organizations\n", "abstract": " This article aims to make a contribution to theory, as well as to practice, by identifying which project management practices are used by most private organizations in general and by sector of activity. The influence of practitioners’ characteristics in the choice of project management practices and their use in groups are also analyzed. The results show that the most used project management practices are kick-off meetings, activity lists, progress meetings, Gantt charts, and baseline plans; however, differences between activity sectors and practitioners’ characteristics were found. The results also indicate that the most used project management practices are, in fact, used as toolsets.", "num_citations": "57\n", "authors": ["1386"]}
{"title": "An automated framework for the integration between EVM and risk management\n", "abstract": " Earned Value Management (EVM) and Project Risk Management are normally considered separately in Project Management. Referring PMBoK®, EVM is part of Project Time Management and Project Cost Management knowledge areas, while Project Risk Management is a different knowledge area with no apparent relation with the previous ones, although the fundamentals of EVM are fully influenced by risk management. This paper seeks to clarify the mechanisms of this relation, and in which points they meet or affect each other. The interconnection between the two methods was explored in this study and a framework of integration between them was proposed. The framework was implemented in Excel resulting in a set of tools that can be useful in monitoring and controlling a project.", "num_citations": "35\n", "authors": ["1386"]}
{"title": "Project management practices in private Portuguese organizations\n", "abstract": " Organizations are experiencing increasing pressure that is amplified by the current economic crises we are facing, where innovation, cost reduction, resource optimization, quality and customer satisfaction are increasingly even more important issues. Likewise, project management appears as a subject that has been growing over the years helping organizations to meet their goals, through the implementation of their projects, following good practices that are documented in various standards and methodologies. This research focuses on such practices. The goal was to find which are the most used project management tools and techniques in Portuguese Private Organizations and what factors influence their use.", "num_citations": "26\n", "authors": ["1386"]}
{"title": "Failures in software project management–are we alone? A comparison with construction industry\n", "abstract": " Unfortunately software development projects have long been identified with budget complications, delays and failure concerning scope. The widely quoted CHAOS Reports of the Standish Group, whose first results were released in 1994, find that while this situation has improved, deviations from the plan continue to be present in a majority of projects. In this paper we study the current state of success in software development projects, contrasting their results with those of civil engineering projects. The obtained results showed the relative success that has been achieved in the industries studied in terms of meeting deadlines, budgets and scope. Neverthless differences do exist, several similarities were found.", "num_citations": "24\n", "authors": ["1386"]}
{"title": "Implementing Success Management in an IT project\n", "abstract": " Given the high importance and complexity of the evaluation of Information Technology (IT) projects, it is essential that companies define and implement systematic processes for managing success aiming to improve project management and deliverables performance. This article presents the first stage of the implementation of a success management process in an IT project of a large multi-national company. Preliminary results show that, with a small increase of the management effort, this enables a precise definition of what really means success in the context of a project, a better understanding of the different perspectives of the participating stakeholders, a greater focus in what is most important for achieving the project success, the unbiased identification and definition of criteria for evaluating success, and the definition of milestones to carry out the evaluation.", "num_citations": "18\n", "authors": ["1386"]}
{"title": "Improving project management practice through the development of a business case: a local administration case study\n", "abstract": " The identification and implementation of the best practices of project management are preponderant and decisive factors for the success of the companies, regardless of their area of intervention. This highlight arose from the need for companies to respond quickly, efficiently and in an integrated manner to the challenges that an ever-changing environment offers.               In a public transportation company, the challenges should focus on project management improvement initiatives, considering their organizational context and the low level of organizational maturity existing in project management.               The purpose of the research was to develop a solution of a Business Case template that was intended to be integrated into the life cycle of project management of the company under study, transversal to all the areas of knowledge described by PMBoK, having several inputs provided by PRINCE2 and …", "num_citations": "8\n", "authors": ["1386"]}
{"title": "Characterization of an Agile Coordination Office for IST companies\n", "abstract": " Typically the Project Management Office activity is linked to the management and coordination of plan-driven projects, also known as waterfall or traditional projects. However, with the advent of agile methodologies in organizations of software development (the case of many information systems and technologies (IST)) no longer value the traditional PMO. It needs to be changed according to the agile values, so the organizations can extract benefits from such structure. These need to be fundamental changes in the responsibilities, practices and roles that a PMO should have. Also, it seems appropriate to rename it to something more descriptive and we chose to name it Agile Coordination Office (ACO). This paper presents the initial proposal of the ACO based on the existing literature. We propose the ACO to assume a behavior mainly supportive, due to the empowerment that every agile development team must have …", "num_citations": "8\n", "authors": ["1386"]}
{"title": "Key aspects in the assessment of success in software development projects. Is there a relationship with what is considered in other industries?\n", "abstract": " The perception of success reached in the execution of a project is largely related to the set of aspects that are considered in its evaluation. Usually, success factors comprise schedule, budget and scope achievements. However, other aspects like project approval by the client or final product quality, for instance, frequently have a significant impact on success. The identification and the understanding of the most relevant success aspects in the evaluation of software development projects is very important, allowing project managers to focus their efforts on them. In this work, the main aspects currently considered for the evaluation of the success of software development projects are identified. Furthermore, it is aimed to verify if these aspects are common in other industries, in particular in the construction one, viewed as a more traditional and consolidated engineering area than software development.", "num_citations": "8\n", "authors": ["1386"]}
{"title": "Future trends in project management\n", "abstract": " Project management is a vast and complex area in which changes occur constantly. In this area there are several standards of good practices. The use of these standards and guidelines for project management increases the knowledge of managers and helps the organization to achieve better results. These are associated with several areas of knowledge or competencies, each with their own processes to develop. From the study of these standards a comparative / prospective model was developed. For the development of this model, 12 standards were studied. This work seeks to understand each of them, as well as the areas associated, and finally characterize the changes that have occurred between editions. This model intends to show the evolution in project management as well as its possible future. The objective would be the classification and structuring of the area and the concepts. Therefore, it is intended …", "num_citations": "5\n", "authors": ["1386"]}
{"title": "Standardization of processes applying CMMI best practices\n", "abstract": " Capability Maturity Model Integration (CMMI) is a set of practices that can be applied in companies in order to improve processes. The goal of this work was to understand the barriers in implementing CMMI and improve processes following the model. The study was conducted in a company in the North of Portugal, following three steps: (1) diagnosing the company (2) opinion gathering through questionnaires and (3) reimplementation of CMMI. The analysis of the questionnaires indicated that implementing CMMI is problematical due to bureaucracy and lack of detailed protocols. Based on the difficulties encountered we developed a detailed documentation with standard processes where the employer has a more prominent role in controlling the processes. The adapted CMMI was then re-introduced in the same company. Finally, linking perceptions and results from the reimplementation, we consider …", "num_citations": "5\n", "authors": ["1386"]}
{"title": "Principales factores en la evaluación del éxito de proyectos de desarrollo de software.¿ Existe alguna relación con lo que se considera en otros sectores?\n", "abstract": " El éxito percibido en la concretización de un proyecto es fuertemente influenciado por el conjunto de aspectos considerados en su evaluación. A pesar de que el cumplimiento de los plazos, de los presupuestos y del ámbito se consideran tradicionalmente como los principales aspectos de evaluación, en la realidad otros aspectos tienen frecuentemente un impacto significativo en el éxito, como es el caso, por ejemplo, de los relacionados con la aceptación del proyecto por el cliente o delos relacionados con la calidad del producto final. Identificar y entender qué aspectos son más pertinentes en la evaluación de un proyecto de desenvolvimiento de software es fundamental para que los esfuerzos de los gestores sean dirigidos hacia las areas de gestión más importantes. En este trabajo se identifican los principales aspectos actualmente considerados en la evaluación del éxito de proyectos de desarrollo de software.", "num_citations": "5\n", "authors": ["1386"]}
{"title": "Integração da gestão do sucesso na EU PM²\n", "abstract": " A gestão do sucesso pode trazer contributos importantes para a melhoria dos resultados dos projetos e do relacionamento com os stakeholders. No entanto, o seu processo deve ser integrado de forma explícita nas abordagens e metodologias de gestão de projetos. Procurando contribuir para essa integração, neste artigo descreve-se como utilizar a gestão de sucesso no contexto da EU PM²", "num_citations": "3\n", "authors": ["1386"]}
{"title": "Integrating success management into EU PM²\n", "abstract": " Success Management can bring valuable contributions to improve project results and stakeholders’ relationship. However, the SM process must be explicitly integrated into project management approaches and methodologies. The purpose of this article is to describe how to implement SM in the context of the EU PM2 Project Management Methodology. Using Design Science Research, this paper helps to fill a gap in the literature and clarify the practical use of SM. The main contribution is to complement PM2 with processes that strongly influence project success.", "num_citations": "2\n", "authors": ["1386"]}
{"title": "Proposal of a Visual Environment to Support Scrum\n", "abstract": " Agile methodologies are increasingly considered important in the current context because of their focus on business benefit, strong stakeholder involvement and rapid incorporation of changing requirements. The Scrum methodology presents a generic and agile model for software development, but there are some gaps regarding solution architecture and requirements modeling and traceability. Fast customer feedback and support for volatile requirements result in higher product value, however, initial requirements modelling using modelling techniques are not commonly used in agile processes such as Scum to prepare the phase of Implementation of the software project.This article presents a first proposal for a visual environment to support the product / sprint backlog, helping to prioritize, track and decide on the most valuable, aligned and quickly deployable requirements.", "num_citations": "2\n", "authors": ["1386"]}
{"title": "Characterization of an Evaluation Success Model of an IS Project, Focused on Stakeholders\n", "abstract": " Typically, we measure the success of an Information Technology project through time, budget and quality. However, with the advance of years, we found that stakeholders have also something to say about success evaluation. Each stakeholder has an impact, its own interests and expectations about the project development. Therefore, what for some can be considered a success, for others can be considered a failure, because each one has a different perspective on the same project. This short paper proposes a flexible success evaluation model for an Information Technology project, called Success Breakdown Structure (SBS). In this model, the various stakeholders present in a project are presented, as well as their success assessment criteria over three different visions: after the completion of the project, after a few months and last, after a few years. From the obtained results, we can conclude that the …", "num_citations": "2\n", "authors": ["1386"]}
{"title": "O desenvolvimento de software na perspectiva das representações e das transformações entre representações\n", "abstract": " Actualmente o processo de desenvolvimento do software é visto numa perspectiva de engenharia. Neste contexto, a evolução do processo segue um conjunto de fases, que permitem definir o que vai ser desenvolvido, definir como desenvolver e finalmente desenvolver e acompanhar o software. Verifica-se ainda que um modelo do processo de desenvolvimento de software define uma estrutura de etapas, que incluem as fases atrás referidas, permitindo cobrir aspectos técnicos e/ou de gestão do desenvolvimento de software. Considera-se que um modelo do processo, permite dar ênfase a determinados aspectos do desenvolvimento de software que se pretende analisar. No âmbito deste trabalho é utilizado um modelo de representações/ transformações, sendo o processo de desenvolvimento de software visto como um conjunto de representações suportadas por técnicas de representação e transformações que permitem a passagem entre duas representações. Nesta dissertação é feita uma revisão de técnicas de representação e transformações entre representações. Procura-se identificar os tipos de representações e de transformações mais convenientes, reduzindo assim a incerteza dos intervenientes no processo e justificando a utilização de determinadas abordagens ao desenvolvimento de software.", "num_citations": "2\n", "authors": ["1386"]}
{"title": "Maturity Model for Collaborative R&D University-Industry Sustainable Partnerships\n", "abstract": " University-Industry collaborations in R&D have grown significantly in recent years. In more developed economies, governments encourage, by finance, collaboration and the exchange of knowledge between private industry and universities. However, it is still a challenge for organizations and universities to identify the best practices adopted to establish and sustain collaboration. This has led to the growing need to establish practices and principles to guide the initiation, implementation and assessment of successful collaboration. Therefore, maturity models can be a way of establishing and sustaining collaboration as it helps organizations and universities to evaluate their processes against best practices and propose actions for improvement. This paper introduces preliminary results of ongoing research to create a maturity model for the sustainable university-industry relationship. This model based literature review …", "num_citations": "1\n", "authors": ["1386"]}
{"title": "Integration between EVM and Risk Management: proposal of an automated framework\n", "abstract": " The integration between Earned Value Management (EVM) and Project Risk Management immediately raises the question of the relationship between the two methods, even though EVM and project risk management share the same function in project management: promote the project success. At first glance it seems to be no further connection between these two methodologies, but the fundamentals of EVM are fully influenced by both risk management and risk analyses. This paper seeks to clarify the mechanisms of this function, and in which points they meet or affect each other, with reference to PMBoK®. The several techniques and methods are somewhat disperse and not always coherent. With the several assumptions resulting from the interconnection between the two methods, a framework of integration between them is proposed, as well as its practical implementation in Excel, resulting in a set of …", "num_citations": "1\n", "authors": ["1386"]}
{"title": "Gledišta bitna za uspjeh u upravljanju projektom: sličnosti i razlike između građevinske i softverske industrije\n", "abstract": " Uspjeh projekta uveliko ovisi o procesu upravljanja projektom i nekoliko je gledišta koja treba pažljivo razmotriti. Cilj je ovoga članka odgovoriti na pitanje: ima li sličnosti u raznim industrijskim granama u onome što se odnosi na gledišta bitna za uspjeh upravljanja projektom? Opsežnom anketom provedenom u srednjim i velikim kompanijama građevinske i industrije računarskih programa, zaključili smo da su dva, trenutno najvažnija gledišta za uspjeh upravljanja projektom zajednička za te dvije industrijske grane vezana uz\" planiranje projekta\" i\" dobro definiranje ciljeva i zahtjeva\".\" Učinkovitost voditelja projekta\" se također nalazi pri samom vrhu. S druge strane, postoje bitne razlike u odnosu na druga gledišta.", "num_citations": "1\n", "authors": ["1386"]}
{"title": "Insights on critical management aspects in construction projects–evidences from large Portuguese companies\n", "abstract": " Failures in construction projects are very frequent, in part because of the great specificity of the construction industry and in another part because of the lack of adequate management procedures. Even though Portuguese constructions have improved in the last years, cost and schedule overruns, low productivity and lack of quality of final products are still very common. Throughout a comprehensive survey applied to medium and large Portuguese companies, it was possible to identify the main management aspects which are critical for the project success. In this paper are presented the main results obtained. They enable companies to focus their efforts in the more relevant aspects of project management.", "num_citations": "1\n", "authors": ["1386"]}