{"title": "HyTech: A model checker for hybrid systems\n", "abstract": " A hybrid system is a dynamical system whose behavior exhibits both discrete and continuous change. A hybrid automaton is a mathematical model for hybrid systems, which combines, in a single formalism, automaton transitions for capturing discrete change with differential equations for capturing continuous change. HyTech is a symbolic model checker for linear hybrid automata, a subclass of hybrid automata that can be analyzed automatically by computing with polyhedral state sets. A key feature of HyTech is its ability to perform parametric analysis, ie, to determine the values of design parameters for which a linear hybrid automaton satisfies a temporal-logic requirement.", "num_citations": "1639\n", "authors": ["1789"]}
{"title": "A user guide to HyTech\n", "abstract": " HyTech is a tool for the automated analysis of embedded systems. This document, designed for the first-time user of HyTech, guides the reader through the underlying system model, and through the input language for describing and analyzing systems. The guide gives several examples of usage, and some hints for gaining maximal computational efficiency from the tool. The version of HyTech described in this guide was released in August 1995, and is available through anonymous ftp from ftp. cs. cornell. edu in the directory pub/tah/HyTech, and through the World-Wide Web via HyTech's home page http:/www. cs. cornell. edu/Info/People/tah/hytech. html.", "num_citations": "416\n", "authors": ["1789"]}
{"title": "Algorithmic analysis of nonlinear hybrid systems\n", "abstract": " We present two methods for translating nonlinear hybrid systems into linear hybrid automata. Properties of the nonlinear systems can then be inferred from the automatic analysis of the translated linear hybrid automata. The first method, called clock translation, replaces constraints on nonlinear variables by constraints on clock variables. The second method, called linear phase-portrait approximation, conservatively overapproximates the phase portrait of a hybrid automaton using piecewise-constant polyhedral differential inclusions. Both methods are sound for safety properties. We illustrate both methods by using HYTECH, a symbolic model checker for linear hybrid automata, to automatically check properties of a nonlinear temperature controller and of a predator-prey ecology.", "num_citations": "348\n", "authors": ["1789"]}
{"title": "HyTech: the next generation\n", "abstract": " We describe a new implementation of HYTECH, a symbolic model checker for hybrid systems. Given a parametric description of an embedded system as a collection of communicating automata, HYTECH automatically computes the conditions on the parameters under which the system satisfies its safety and timing requirements. While the original HYTECH prototype was based on the symbolic algebra tool Mathematica, the new implementation is written in C++ and builds on geometric algorithms instead of formula manipulation. The new HYTECH offers a cleaner and more expressive input language, greater portability, superior performance (typically two to three orders of magnitude), and new features such as diagnostic error-trace generation. We illustrate the effectiveness of the new implementation by applying HYTECH to the automatic parametric analysis of the generic railroad crossing benchmark problem and …", "num_citations": "327\n", "authors": ["1789"]}
{"title": "HyTech: The Cornell hybrid technology tool\n", "abstract": " This paper is addressed to potential users of HyTech, the Cornell Hybrid Technology Tool, an automatic tool for analyzing hybrid systems. We review the formal technologies that have been incorporated into HyTech, and we illustrate the use of HyTech with three nontrivial case studies.", "num_citations": "296\n", "authors": ["1789"]}
{"title": "Coverage estimation for symbolic model checking\n", "abstract": " Although model checking is an exhaustive formal verification method, a bug can still escape detection if the erroneous behavior does not violate any verified property. We propose a coverage metric to estimate the “completeness” of a set of properties verified by model checking. A symbolic algorithm is presented to compute this metric for a subset of the CTL property specification language. It has the same order of computational complexity as a model checking algorithm. Our coverage estimator has been applied in the course of some real-world model checking projects. We uncovered several coverage holes including one that eventually led to the discovery of a bug that escaped the initial model checking effort.", "num_citations": "193\n", "authors": ["1789"]}
{"title": "Interconnect-driven physical synthesis using persistent virtual routing\n", "abstract": " A persistence-driven optimization technique is provided in which nets can be ranked based on unpredictability and likely quality of result impact. The top nets in that ranking can be routed and their parasitics extracted. A timing graph can be back-annotated with route-based delays and parasitics for the selected nets. At this point, synthesis can be run using actual route-based delays and parasitics for the selected nets, with their routes being updated incrementally as needed. In one embodiment, the nets can be re-ranked after synthesis. Finally, these routes can be preserved across the subsequent global routing of the remaining nets.", "num_citations": "166\n", "authors": ["1789"]}
{"title": "Algorithmic analysis of nonlinear hybrid systems\n", "abstract": " Hybrid systems model discrete programs that are embedded in continuous environments. Model-checking tools are available for the analysis of linear hybrid systems, whose continuous variables are bounded by piecewise-linear trajectories. Most embedded programs, however, operate in nonlinear environments. We present, analyze, and apply two algorithms for translating nonlinear hybrid systems into linear hybrid systems.             The clock translation replaces nonlinear variables by clock variables; the rate translation approximates nonlinear variables by piecewise-linear envelopes. Both translations are sound for reachability; that is, if we establish a safety property of the translated linear system, we may conclude that the original nonlinear system satisfies the property. The clock translation is also complete for reachability; that is, the original system and the translated system satisfy the same safety …", "num_citations": "165\n", "authors": ["1789"]}
{"title": "Power-aware placement\n", "abstract": " Lowering power is one of the greatest challenges facing the IC industry today. We present a power-aware placement method that simultaneously performs (1) activity-based register clustering that reduces clock power by placing registers in the same leaf cluster of the clock trees in a smaller area and (2) activity-based net weighting that reduces net switching power by assigning a combination of activity and timing weights to the nets with higher switching rates or more critical timing. The method applies to designs with multiple clocks and gated clocks. We implemented the method and obtained experimental results on 8 real-world designs after placement, routing, extraction and analysis. The power-aware placement method achieved on average 25.3% and 11.4% reduction in net switching power and total power respectively, with 2.0% timing, 1.2% cell area and 11.5% runtime impact. This method has been …", "num_citations": "159\n", "authors": ["1789"]}
{"title": "Automated analysis of an audio control protocol\n", "abstract": " We show how HyTech, a symbolic model checker for linear hybrid systems, can be used to analyze an audio control protocol. This protocol [BPV94] was first verified by Bosscher et al. without computer support. In this paper, we demonstrate that algorithmic methods can not only verify the protocol, but can also automatically synthesize the bound on the maximum clock drift, and suggest design modification for a more robust protocol. We believe the techniques we used — finite state encodings, automata transformations, strengthening of specifications — provide insight to the practictioner interested in modeling and analyzing similar real-world applications.", "num_citations": "142\n", "authors": ["1789"]}
{"title": "A note on abstract interpretation strategies for hybrid automata\n", "abstract": " We report on several abstract interpretation strategies that are designed to improve the performance of HyTech, a symbolic model checker for linear hybrid systems. We (1) simultaneously compute the target region from different directions, (2) conservatively approximate the target region by dropping constraints, and (3) iteratively refine the approximation until sufficient precision is obtained. We consider the standard abstract convex-hull operator and a novel abstract extrapolation operator.", "num_citations": "96\n", "authors": ["1789"]}
{"title": "Automatic analysis of hybrid systems\n", "abstract": " Hybrid systems are real-time systems that react to both discrete and continuous activities (such as analog signals, time, temperature, and speed).  Typical examples of hybrid systems are embedded systems, timing-based communication protocols, and digital circuits at the transistor level. Due to the rapid development of microprocessor technology, hybrid systems directly control much of what we depend on in our daily lives. Consequently, the formal specification and verification of hybrid systems has become an active area of research. This dissertation presents the first general framework for the formal specification and verification of hybrid systems, as well as the first hybrid-system analysis tool--HyTech. The framework consists of a graphical finite-state-machine-like language for modeling hybrid systems, a temporal logic for modeling the requirements of the hybrid systems, and a computer procedure that verifies modeled hybrid systems against modeled requirements. The tool HyTech is the implementation of the framework using C++ and Mathematica. More specifically, our hybrid-system modeling language,  Hybrid Automata, is an extension of timed automata with discrete and general continuous variables whose dynamics are governed by differential equations.  Our requirement modeling language, ICTL, is a branching-time temporal logic, and is an extension of TCTL with stop-watch variables. Our verification procedure is a symbolic model-checking procedure that verifies linear hybrid automata against ICTL formulas. To make HyTech more efficient and effective, we designed and implemented model-checking strategies and abstract …", "num_citations": "77\n", "authors": ["1789"]}
{"title": "Automatic register banking for low-power clock trees\n", "abstract": " We present an automatic register placement technique that enables the synthesis of low-power clock trees for low-power ICs. On 7 industrial designs, comparing to (1) a commercial base flow and (2) the power-aware placement technique in, the technique respectively reduced clock-tree power by 19.0% and 14.9%, total power by 15.3% and 5.2% and WNS under on-chip variation (plusmn10%) by 1.8% and 1.5% on average.", "num_citations": "75\n", "authors": ["1789"]}
{"title": "GPU friendly fast Poisson solver for structured power grid network analysis\n", "abstract": " In this paper, we propose a novel simulation algorithm for large scale structured power grid networks. The new method formulates the traditional linear system as a special two-dimension Poisson equation and solves it using an analytical expressions based on FFT technique. The computation complexity of the new algorithm is O(NlgN), which is much smaller than the traditional solver's complexity O(N 1.5 ) for sparse matrices, such as the SuperLU solver and the PCG solver. Also, due to the special formulation, graphic process unit (GPU) can be explored to further speed up the algorithm. Experimental results show that the new algorithm is stable and can achieve 100X speed up on GPU over the widely used SuperLU solver with very little memory footprint.", "num_citations": "59\n", "authors": ["1789"]}
{"title": "Routability optimization for industrial designs at sub-14nm process nodes using machine learning\n", "abstract": " Design rule check (DRC) violations after detailed routing prevent a design from being taped out. To solve this problem, state-of-the-art commercial EDA tools global-route the design to produce a global-route congestion map; this map is used by the placer to optimize the placement of the design to reduce detailed-route DRC violations. However, in sub-14nm processes and beyond, DRCs arising from multiple patterning and pin-access constraints drastically weaken the correlation between global-route congestion and detailed-route DRC violations. Hence, the placer| based on the global-route congestion map| may leave too many detailed-route DRC violations to be fixed manually by designers. In this paper, we present a method that employs (1) machine-learning techniques to effectively predict detailed-route DRC violations after global routing and (2) detailed placement techniques to effectively reduce detailed …", "num_citations": "55\n", "authors": ["1789"]}
{"title": "Formal verification of pipeline control using controlled token nets and abstract interpretation\n", "abstract": " We present an automated formal verification method that can detect common pipeline control bugs of logic design components containing thousands of registers. The method models logic designs using controlled token nets. A controlled token net consists of: a token net that models the data flow in the datapath using token semantics; a control logic that models the control machines using traditional finite state semantics. We provide algorithms to: (1) extract a controlled token net from a logic design; (2) minimize the controlled token net; and (3) compute an abstract interpretation of the controlled token net for efficient model checking. We implemented and applied the method to 6 Intel logic design components containing up to 4500 registers and successfully detected 8 pre-silicon errata.", "num_citations": "45\n", "authors": ["1789"]}
{"title": "Simulation-based functional verification of microcircuit designs\n", "abstract": " System, methods, and apparatus for verifying microcircuit designs by interleaving between random and formal simulation techniques to identify input traces useful for driving designs under test into sequences of device states. In a method aspect the invention provides process for beginning random simulation of a sequence of states of a microcircuit design by inputting a sequence of random input vectors to a design under test model in order to obtain a sequence of random simulation states; monitoring a simulation coverage progress metric to determine a preference for switching from random simulation to formal methods of simulating states in the design under test; beginning formal simulation of states in the design under test and monitoring a formal coverage progress metric to determine a preference for resuming random simulation of states of said microcircuit design; and resuming random simulation. Preferably …", "num_citations": "39\n", "authors": ["1789"]}
{"title": "Method and apparatus for generating a variation-tolerant clock-tree for an integrated circuit chip\n", "abstract": " One embodiment of the present invention relates to a process that generates a clock-tree on an integrated circuit (IC) chip. During operation, the process starts by receiving a placement for a chip layout, where the placement includes a set of registers at fixed locations in the chip layout. The process then generates a timing criticality profile for the set of registers, wherein the timing criticality profile specifies timing criticalities between pairs of registers in the set of registers. Next, the process clusters the set of registers based on the timing criticality profile to create a clock-tree for the set of registers. By clustering the registers based on the timing criticality profile, the process facilitates using commonly-shared clock paths in the clock-tree to provide clock signals to timing critical register pairs.", "num_citations": "37\n", "authors": ["1789"]}
{"title": "The domatic number problem in interval graphs\n", "abstract": " A set of vertices D is a dominating set of a graph  if every vertex in  is adjacent to a vertex in D. The domatic number  of a graph  is the maximum number k such that V can be partitioned into k disjoint dominating sets . The main purpose of this paper is to give linear algorithms for the domatic number problem in interval graphs. This paper also proves that  for any interval graph G, where  is the minimum degree of a vertex in G.", "num_citations": "30\n", "authors": ["1789"]}
{"title": "Method and apparatus for solving sequential constraints\n", "abstract": " Relates to automatic conversion of assumption constraints, used in circuit design verification, that model an environment for testing a DUT/DUV, where the assumptions specify sequential behavior. Such assumptions are converted, with the use of logic synthesis tools, into a gate-level representation. For formal verification, a verification output is constructed from the gate-level representation and DUT/DUV assertion-monitoring circuitry. A formal verifier seeks to prove the verification output cannot indicate a design error. For simulation verification, the gate-level representation is converted into a hybrid representation comprising pipelines and combinational constraints. During simulation, the pipelines hold state information necessary for a solution, of the combinational constraints, to be in accord with the sequential assumption constraints. For certain sequential assumption constraints, the combinational constraints are …", "num_citations": "29\n", "authors": ["1789"]}
{"title": "Model checking strategies for linear hybrid systems\n", "abstract": " Linear hybrid systems are dynamical systems whose variables change both discretely and continuously along piecewise linear trajectories; they are useful for modeling digital real-time programs that are embedded in analog environments. Model checking is an algorithmic technique for anlayzing finite- state systems that has recently been extended to certain infinite-state systems, including linear hybrid systems.  The method has been implemented in HyTech (The Cornell Hybrid Technology Tool), a symbolic model checker for linear hybrid systems.  We report on a new implementation and several experiments with HyTech. The core of HyTech is a semidecision procedure that, given a linear hybrid automaton describing a system and a temporal formula describing a requirement, computes the so-called target region-the linear set of system states that satisfy the requirement.  Unfortunately, the verification procedure may not return the target region using a reasonable amount of time and space, or it may not terminate in principle.  Thus we have reimplemented the model checker using more efficient data structures that represent linear state sets geometrically, as unions of convex polyhedra, and we have experimented with several strategies that are designed to improve the performance of the model checker further: we (1) simultaneously compute the target region from different directions, (2) encode data as finite-state control, (3) approximate the target region by dropping constraints, and (4) iteratively refine the approximation until sufficient precision is obtained.  Interestingly, symbolic model checking (fixpoint computation by iteration) and the …", "num_citations": "27\n", "authors": ["1789"]}
{"title": "Abstraction refinement using controllability and cooperativeness analysis\n", "abstract": " One embodiment of the present invention provides a system that refines an abstract model. Note that abstraction refinement is commonly used in formal property verification. During operation, the system receives an abstract model which is a subset of a logic design which can be represented using a set of variables and a set of Boolean functions. Next, the system receives a safety property for the logic design which is desired to be proven. The system also receives a set of counter-examples. A counter-example is a sequence of states that violates the safety property. Note that a state is an assignment of values to the variables, which are determined using the set of Boolean functions and the variable values in the previous state. The system then determines a set of cooperative variables using the set of counter-examples. A cooperative variable is a variable that can help invalidate all counter-examples. The system …", "num_citations": "22\n", "authors": ["1789"]}
{"title": "The [beta]-assignment problems\n", "abstract": " Abstract Suppose G=(S, T, E) is a bipartite graph, where (S, T) is a bipartition of the vertex set. A β-assignment is an edge set X (̄ E such that deg x (i)= 1 for all i ϵ S. The cardinality β-assignment problem is to find a β-assignment X which minimizes β (X)= max jϵT deg x (j). Suppose we associate every edge with a weight which is a real number. The bottleneck β-assignment problem is to find a β-assignment X that minimizes β (X) and maximizes the minimum edge weight on X. The weighted β-assignment problem is to find a β-assignment X that minimizes β (X) and maximizes the total weights of edges in X. This paper presents O (| SE|)-time algorithms for the cardinality and the bottleneck β-assignment problems and an O (| S| 2| T|+| ST| 2)-time algorithm for the weighted β-assignment problem.", "num_citations": "22\n", "authors": ["1789"]}
{"title": "Printing, power, and the transformation of Vietnamese culture, 1920-1945\n", "abstract": " Between 1920 and 1946, a Vietnamese\" print culture\" came into existence. This development is the topic of my dissertation, which combines the social history of French colonial control of printed matter with an understanding of the impact of printed materials on Vietnamese culture. The dissertation thus broadens our understanding of Vietnam's colonial history.", "num_citations": "22\n", "authors": ["1789"]}
{"title": "Method and apparatus for reducing power consumption in an integrated circuit chip\n", "abstract": " A system that reduces power consumption in an integrated circuit. During operation the system receives a placement for the integrated circuit. The system then groups registers in the placement into clusters and builds a temporary clock tree for the registers within the placement. Next the system assigns net weights to clock wires in the temporary clock tree and signal wires between the rest of the cells of the circuit, and uses the assigned net weights to optimize placement of the cells of the circuit by minimizing a sum of the weighted costs of the wires, wherein the weighted cost of a wire is a product of the net weight of the wire and the length of the wire.", "num_citations": "17\n", "authors": ["1789"]}
{"title": "Abstraction refinement by controllability and cooperativeness analysis\n", "abstract": " We present a new abstraction refinement algorithm to better refine the abstract model for formal property verification. In previous work, refinements are selected either based on a set of counter examples of the current abstract model, as in [5][6][7][8][9][19][20], or independent of any counter examples, as in [17]. We (1) introduce a new\" controllability\" analysis that is independent of any particular counter examples,(2) apply a new\" cooperativeness\" analysis that extracts information from a particular set of counter examples and (3) combine both to better refine the abstract model. We implemented the algorithm and applied it to verify several real-world designs and properties. We compared the algorithm against the abstraction refinement algorithms in [19] and [20] and the interpolation-based reachability analysis in [14]. The experimental results indicate that the new algorithm outperforms the other three algorithms in …", "num_citations": "15\n", "authors": ["1789"]}
{"title": "Method and apparatus for determining the timing of an integrated circuit design\n", "abstract": " A system that determines the timing of an integrated circuit (IC) design is presented. During operation, the system receives a netlist for the IC design, wherein the netlist specifies the placement of cells within the IC design. Next, the system estimates capacitances for cells within the IC design based on analytic models of the cells. The system then estimates the post-physical-optimization timing of the IC design based on the netlist, the capacitances, and the analytic models, wherein the post-physical-optimization timing is estimated without performing physical optimization.", "num_citations": "13\n", "authors": ["1789"]}
{"title": "Supporting sequential assumptions in hybrid verification\n", "abstract": " We present a method for using a set of temporal properties (SVA, PSL, OVA, RTL monitors) as environment models for industrial-strength hybrid verification that combines formal methods with constrained random simulation. We demonstrate the effectiveness of the method on real-world designs.", "num_citations": "9\n", "authors": ["1789"]}
{"title": "Industrial clock design\n", "abstract": " Power and variation are the biggest concerns of physical design today. Clock distribution network is at the center of both the power and variation concerns. Clock distribution networks consume a lion's share of the total IC power consumption for two reasons. First, the clock distribution network requires many large buffers to deliver crisp clock signals across a large area of the IC. Second, the clock distribution network uses many small buffers to balance the clock skews. Clock distribution networks are also most susceptible to variation for two reasons. First, both the latency and length of a clock path are usually much longer than those of typical timing paths. Second, variations to clock path delays may have a 2X impact to the timing of a timing path. Let's consider a timing path between a launching and a capturing flop and suppose that the clock path to the launching flop is sped up by 100ps and the clock path to the …", "num_citations": "8\n", "authors": ["1789"]}
{"title": "Computer aided verification\n", "abstract": " This volume contains the proceedings of the Eighth International Conference on Computer Aided Verification (CAV'96), organized July 31-August 3, 1996, in New Brunswick, New Jersey. The annual CAV series is dedicated to the advancement of the theory and practice of computer-assisted formal analysis methods for software and hardware systems. The conference covers the spectrum from theoretical results to concrete applications, with an emphasis on verification tools and the algorithms and techniques that are needed for their implementation. This year's call-for-papers invited submissions in two separate categories: regular research contributions, and short descriptions of tools and case studies. Of the 93 submissions in the first category, 32 were selected for presentation at the conference. From an enthusiastic response to the second category, 20 submissions were chosen.", "num_citations": "7\n", "authors": ["1789"]}
{"title": "Method and apparatus for partitioning an integrated circuit chip\n", "abstract": " A system that partitions an integrated circuit. First, the system receives a placement for an integrated circuit. The system then calculates a joint-utilization ratio for pairs of logic modules in the placement. Next, the system sorts the pairs of logic modules based on the joint-utilization ratio. The system then selects top pairs of logic modules based on the joint-utilization ratio and clusters the top pairs of logic modules into new partitions.", "num_citations": "7\n", "authors": ["1789"]}
{"title": "Intelligent random vector generator based on probability analysis of circuit structure\n", "abstract": " Design verification has become a bottleneck of modern designs. Recently, simulation-based random verification has attracted a lot of interests due to its effectiveness in uncovering obscure bugs. Designers are often required to provide the input probabilities while conducting the random verification. However, it is extremely difficult for designers to provide accurate input probabilities. In this paper, we propose an iterative algorithm that derives good input probabilities so that the design intent can be exercised effectively for functional verification. We conduct extensive experiments on both benchmark circuit and industrial designs. The experimental results are very promising", "num_citations": "7\n", "authors": ["1789"]}
{"title": "Priori corner and mode reduction\n", "abstract": " Systems and techniques are described for performing a priori corner and mode reduction. Some embodiments create a synthetic corner in which (1) a cell delay for each library cell in a set of library cells corresponds to a maximum delay over multiple temperature corners, and/or (2) a cell delay for each library cell in a set of library cells corresponds to a maximum delay over multiple parasitic corners. Some embodiments can identifying, for a given corner, a portion of the circuit design that is common across multiple modes, and then replace the multiple modes with a single mode for optimizing and verifying timing constraints of the portion of the circuit design that is common across the multiple modes. The circuit design can then be optimized over the reduced set of modes and/or corners.", "num_citations": "5\n", "authors": ["1789"]}
{"title": "Techniques for effective distributed physical synthesis\n", "abstract": " We present two techniques,(1) placement-based timing-driven partitioner (PTP) and (2) virtual physical synthesis based budgeter (VSB), that support effective distributed physical synthesis.", "num_citations": "5\n", "authors": ["1789"]}
{"title": "2019 CAD contest: System-level FPGA routing with timing division multiplexing technique\n", "abstract": " The time division multiplexing technique overcomes the bandwidth limitation by allowing FPGA chips to transmit multiple signals the maximum clocking frequency. With the additional multiplexers, this technique dramatically increases system-level routing capability in the FPGA-based emulator. However, the large number of virtual wires in the chip interconnection may impact emulation performance. The system-level FPGA routing tends to connect all virtual wires (signals) and considers emulation performance. At the same time, the challenge for system-level FPGA routing using time division multiplexing lies in the emulation performance.", "num_citations": "4\n", "authors": ["1789"]}
{"title": "Multi-mode redundancy removal\n", "abstract": " A multi-mode redundancy removal method is provided. In this method, after accessing the design, a full-scale redundancy removal using fault simulation can be started. When a predetermined period for performing the full-scale redundancy removal has reached a first cut-off, then the method can determine a location for temporary outputs of the design, create the temporary outputs, and perform a localized redundancy removal up to the temporary outputs. An optimized design based on the full-scale redundancy removal and the localized redundancy removal can be output.", "num_citations": "4\n", "authors": ["1789"]}
{"title": "On improving optimization effectiveness in interconnect-driven physical synthesis\n", "abstract": " In modern designs, the delay of a net can vary significantly depending on its routing. This large estimation error during the pre-routing stage can often mislead the optimization of the netlist. We extend state-of-the-art interconnect-driven physical synthesis by introducing a new paradigm (namely, persistence) that relies on guaranteed net routes for the most sensitive nets while performing circuit optimization in the pre-route stage. We implemented our proposed approach in a cutting-edge industrial physical synthesis flow; this involved the automatic identification and routing of critical nets that were likely to be mispredicted, the automatic update of their routes during the subsequent pre-routing stage optimizations, and the guaranteed retention of their routes across the routing stage. Our approach achieves significant performance improvements on a suite of real-world 65nm designs, while ensuring that the impact on …", "num_citations": "3\n", "authors": ["1789"]}
{"title": "Industrial clock synthesis\n", "abstract": " Industrial Clock Synthesis Page 1 Industrial Clock Synthesis Pei-Hsin Ho Implementation Group Synopsys, Inc. Page 2 © 2009 Synopsys, Inc. (2) Outline • Problems that our customers care about • Existing solutions and plan-of-record solutions • Improvements required Page 3 © 2009 Synopsys, Inc. (3) Clock Network • Clock network delivers the clock signal to synchronize every sequential cell in the clock domain i j Page 4 © 2009 Synopsys, Inc. (4) Clock Network Metrics • Power • Insertion delay for a clock path ▪ Usually longer than the clock period ▪ Proxy for variation and power ▪ Logic level ▪ RC delay • Skew under variation ▪ False skew ▪ Variation • Multiple corners • OCV (on-chip variation) i j Page 5 © 2009 Synopsys, Inc. (5) Power: Clock → Major Culprit • Power: biggest implementation issue today ▪ Consumer electronics ▪ Frequency limiter: 4GHz ceiling • Biggest trouble maker ▪ Clock • 1/3 total power • Many …", "num_citations": "3\n", "authors": ["1789"]}
{"title": "The β-assignment problem in general graphs\n", "abstract": " We study a variation of the assignment problem in operations research and formulate it in terms of graphs as follows. Suppose G=(V, E) is a graph and U a subset of V. A β-assignment of G with respect to U is an edge set X such that deg x (ν)= 1 for all vertices ν in U, where deg x (ν) is the degree of ν in the subgraph of G induced by the edge set X. The β-assignment problem is to find a β-assignment X such that β (X)≡ max∗ deg x (ν): νϵV− U∗ is minimum. The purpose of this paper is to give an O (n 3)-time algorithm for the β-assignment problem in general graphs. As byproducts, we also obtain a duality theorem as well as a necessary and sufficient condition for the existence of a β-assignment for a general graph. The latter result is a generalization of Tutte's theorem for the existence of a perfect matching of a general graph.", "num_citations": "2\n", "authors": ["1789"]}
{"title": "Interesting Problems in Physical Synthesis.\n", "abstract": " Data Replication at Unit level Page 1 © 2016 Synopsys, Inc. 1 Interesting Problems in Physical Synthesis Pei-Hsin Ho Synopsys Fellow, Synopsys, Inc. ISPD, Portland Oregon, 2017 Page 2 © 2016 Synopsys, Inc. 2 Two Crises in Physical Synthesis • Interconnect prediction and optimization –Resistance –Route DRC • Runtime of physical design tools –CPUs – Clock frequency: plateaued out –Both ICC2 and Innovus have sped up through multi-threading –What is next? Page 3 © 2016 Synopsys, Inc. 3 Two Crises in Physical Synthesis • Interconnect prediction and optimization –Resistance –Route DRC • Runtime of physical design tools –CPUs – Clock frequency: plateaued out –Both ICC2 and Innovus have sped up through multi-threading –What is next? Page 4 © 2016 Synopsys, Inc. 4 Parasitic R under FinFET Technology • FinFET –Cells: faster than planar –Wires and vias: increased resistance – Cliff Hou, ISSCC …", "num_citations": "1\n", "authors": ["1789"]}
{"title": "Clock tree synthesis for low power and low susceptibility to variation\n", "abstract": " Power is one of the biggest concerns of IC designs today. For consumer electronics the energy consumption of the ICs limits the time between charging the batteries. For high-frequency computers the power density of the ICs limits the performance of the ICs. Clock distribution networks typically contribute more than one third of the total power consumption, including both leakage and dynamic power consumption.", "num_citations": "1\n", "authors": ["1789"]}