{"title": "CCSharp: An efficient three-phase code clone detector using modified PDGs\n", "abstract": " Detecting code clones in software systems is becoming more and more important with the blossom of open source projects. In spite of numerous active researches, there is still a lack of detecting clones especially high-level clones efficiently and accurately. In this paper, we present CCSharp, a three-phase PDG-based clone detector which can detect much more clones besides high-level ones in software systems. To solve the problem of PDG-based tool's high time cost, we adopt two strategies to decrease the overall computing quantity of our tool: PDG's structure modification and characteristic vector filtering. In PDG's structure modification, we propose a novel technique to merge procedure invocation nodes which can make clone detection get rid of influence of procedure's parameters and disguise as well as downscale PDG's structure. We proceed clone detection on both real-world and artificial codebase by …", "num_citations": "17\n", "authors": ["1005"]}
{"title": "Duplication detection in news articles based on big data\n", "abstract": " Electronic media has been developing rapidly nowadays, resulting in a large number of news articles produced online, and thus duplication detection is needed. Besides, articles duplication is directly related to articles plagiarism. Existing studies on news articles duplication detection mainly focus on newspaper articles, and we further explore the duplication detection in news articles from the newest online We Media data. In this paper, we propose a tool, NDFinder, using fingerprinting technique with hash index to detect articles duplication. To validate our proposed approach, we crawled a total number of 33,244 news articles data for detection. The results show that our tool accurately detects 2,150 duplicate articles, and the overall precision reaches 97%. Moreover, we apply our approach to detect plagiarism articles based on our duplication results, and we successfully identify 64 pairs of plagiarism articles in our …", "num_citations": "3\n", "authors": ["1005"]}
{"title": "固定时间窗快递车辆路径问题建模及求解\n", "abstract": " 研究在给定了分拨中心的网络结构及其服务时间窗口约束和各个分拨中心之间的货物流量结构及其时效约束的情况下, 如何安排班车路由以使得班车花费的总成本最小. 实际上, 此问题是车辆路径问题 (VRP) 的一个变种. 建立问题的数学模型, 提出基于贪心启发式方法的快速求解算法, 该算法包括三个步骤: 第一步为可行货物路由求解 (FRA), 第二步为货物路由矩阵求解 (RSA), 第三步为班车安排求解 (BSA). 提出的 BSA 是一种新的班车安排方法: 环线班车+ 单边车, 比原有的对称班车安排方法明显提升了班车装载率. 还给出评估问题解性能的一个下界模型, 可以度量求出解的近似程度. 在不同规模的真实数据集上进行计算实验表明, 采用新的班车安排算法可以显著降低运输成本.", "num_citations": "1\n", "authors": ["1005"]}