{"title": "Action Research\n", "abstract": " Conventional systems analysis approaches, such as structured analysis and data analysis, emphasize the “hard” aspects of the problem domain, that is, the certain and the precise. A hard approach is prescriptive and might be applied fairly consistently between organizations and within organizations. Yet Peter Checkland, a professor at Lancaster University, who is influential among Multiview authors, argues that systems analysts need to apply their craft to problems that are not well defined [5]. Moreover, researchers need to understand the ill-structured, fuzzy world of complex organizations. People are what make organizations so complex and different, and people are far different in nature from data and processes. People have different and conflicting objectives, perceptions, and attitudes. People change over time. And systems analysts have to address the fundamental human aspects of organizations. Failure to …", "num_citations": "1913\n", "authors": ["1354"]}
{"title": "Object-oriented analysis & design\n", "abstract": " Scandinavia has a long and notable tradition in computer science and software engineering. Peter Naur was a major contributor to the development of Algol-60 and co-inventor of the Backus-Naur notation in which its syntax and that of many subsequent languages was described. The original ideas of object oriented programming came out of the work of Ole-Johan Dahl and Kristen Nygaard on Simula 67. Per Brinch Hansen did fundamental work in concurrency and operating systems and in languages for parallel programming. Bjarne Stroustrup brought object orientation to the huge community of C programmers in the C++ language.Now Lars Mathiassen, Andreas Munk-Madsen, Peter Axel Nielsen, and Jan Stage have written this excellent book on object-oriented analysis and design. It is written in a refreshingly mild style, open-minded and gentle and easy to read. The case studies are varied: two well-known example problems, automobile cruise control and IFIPS conference management, and two less familiar, the management of a hairdressing salon and a monitoring system for a rescue station that operates fire engines, ambulances and breakdown trucks. Little illustrations of particular points abound in the text.", "num_citations": "407\n", "authors": ["1354"]}
{"title": "Competing values in software process improvement: an assumption analysis of CMM from an organizational culture perspective\n", "abstract": " The capability maturity model (CMM) approach to software process improvement is the most dominant paradigm of organizational change that software organizations implement. While some organizations have achieved various levels of success with the CMM, the vast majority have failed. In this paper, we investigate the assumptions about organizational culture embedded in the CMM models and we discuss their implications for software process improvement (SPI) initiatives. In this paper, we utilize the well-known competing values model to surface and analyze the assumptions underlying the CMM. Our analysis reveals contradictory sets of assumptions about organizational culture in the CMM approach. We believe that an understanding of these contradictions can help researchers address some of the difficulties that have been observed in implementing and institutionalizing SPI programs in organizations …", "num_citations": "253\n", "authors": ["1354"]}
{"title": "Engaged scholarship in IS research\n", "abstract": " Engaged scholarship (Van de Ven 2007) offers a grand opportunity to address key challenges within the Information Systems (IS) discipline in a novel and constructive way. To explore this opportunity, we adapt the principles of engaged scholarship and apply them to analyze Scandinavian IS research through the lens of Scandinavian Journal of Information Systems (SJIS). We consider the Scandinavian tradition based on review papers in SJIS; we review all research papers published in SJIS over the past 20 years; finally, we discuss the possible role of engaged scholarship in shaping the future of Scandinavian IS research. We conclude with implications of engaged scholarship for IS research and practice in general.", "num_citations": "158\n", "authors": ["1354"]}
{"title": "Understanding the implementation of software process improvement innovations in software organizations\n", "abstract": " The development of software is a complex task frequently resulting in unfinished projects, project overruns and system failures. Software process improvement (SPI) approaches have been promoted as a promising remedy for this situation. The organizational implementation of such approaches is a crucial issue and attempts to introduce SPI into software organizations often fail. This paper presents a framework to understand, and subsequently successfully perform, the implementation of SPI innovations in software organizations. The framework consists of three perspectives on innovation: an individualist, a structuralist and an interactive process perspective. Applied to SPI, they emphasize different aspects of implementing SPI innovations. While the first focuses on leadership, champions and change agents, the second focuses on organization size, departmental and task differentiation and complexity, and the …", "num_citations": "111\n", "authors": ["1354"]}
{"title": "Back to thinking mode: diaries for the management of information systems development projects\n", "abstract": " From a practical point of view, systems development methods are important sources of inspiration for the planning and establishment projects, but only to a limited extent do they support the reflections and actions of the participants. We propose the use of diaries as a supplement to conventional methods of reflection on what actually happens and what could happen during the course of a project, i.e., we propose diaries as a medium for the management of information systems development projects. This idea is based on an exploratory study carried out in co-operation with a bank and a research department, and the idea is supported by theoretical arguments from different fields. In conclusion, some practical advice on how to use diaries is given together with some questions for further investigation.", "num_citations": "86\n", "authors": ["1354"]}
{"title": "Using organizational influence processes to overcome IS implementation barriers: lessons from a longitudinal case study of SPI implementation\n", "abstract": " A fundamental tenet of the information systems (IS) discipline holds that: (a) a lack of formal power and influence over the organization targeted for change, (b) weak support from top management, and (c) organizational memories of prior failures are barriers to implementation success. Our research, informed by organization influence, compellingly illustrates that such conditions do not necessarily doom a project to failure. In this paper, we present an analysis of how an IS implementation team designed and enacted a coordinated strategy of organizational influence to achieve implementation success despite these barriers. Our empirical analysis also found that technology implementation and change is largely an organizational influence process (OIP), and thus technical-rational approaches alone are inadequate for achieving success. Our findings offer managers important insights into how they can design and …", "num_citations": "76\n", "authors": ["1354"]}
{"title": "Objektorienterad analys och design\n", "abstract": " Objektorienterad Analys och Design — Aalborg University's Research Portal Skip to main navigation Skip to search Skip to main content Aalborg University's Research Portal Logo Dansk English Home Profiles Projects Publications Activities Research Units Facilities Press / Media Prizes Datasets Impacts Search by keywords, name or affiliation Objektorienterad Analys och Design Lars Mathiassen, A. Munk-Madsen, Peter Axel Nielsen, Jan Stage Department of Computer Science Research output: Book/Report › Book › Research Overview Original language Swedish Place of Publication Lund Publisher Studentlitteratur Publication status Published - 2001 Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Mathiassen, L., Munk-Madsen, A., Nielsen, PA, & Stage, J. (2001). Objektorienterad Analys och Design. Studentlitteratur. Mathiassen, Lars ; Munk-Madsen, A. ; Nielsen, Peter Axel ; Stage, Jan. / …", "num_citations": "70\n", "authors": ["1354"]}
{"title": "Four integration patterns: a socio‐technical approach to integration in IS development projects\n", "abstract": " This paper aims to contribute to a theory of integration within the field of information systems (IS) project management. Integration is a key IS project management issue when new systems are developed and implemented into an increasingly integrated information infrastructure in corporate and governmental organizations. Expanding the perspective of traditional project management research, we draw extensively on central insights from IS research. Building on socio‐technical IS research and software engineering research, we suggest four generic patterns of integration: big bang, stakeholder integration, technical integration and socio‐technical integration. We analyse and describe the advantages and disadvantages of each pattern. The four patterns are ideal types. To explore the forces and challenges in these patterns, three longitudinal case studies were conducted. In particular we investigate the …", "num_citations": "69\n", "authors": ["1354"]}
{"title": "Objektorienteret analyse & design\n", "abstract": " Objektorienteret analyse & design — Aalborg University's Research Portal Skip to main navigation Skip to search Skip to main content Aalborg University's Research Portal Logo Dansk English Home Profiles Projects Publications Activities Research Units Facilities Press / Media Prizes Datasets Impacts Search by keywords, name or affiliation Objektorienteret analyse & design Lars Mathiassen, Andreas Munk-Madsen, Peter Axel Nielsen, Jan Stage Department of Computer Science Research output: Book/Report › Book › Research Overview Original language Danish Place of Publication Aalborg Publisher Marko Edition 3 Number of pages 439 ISBN (Print) 8777511530 Publication status Published - 2001 Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Mathiassen, L., Munk-Madsen, A., Nielsen, PA, & Stage, J. (2001). Objektorienteret analyse & design. (3 ed.) Marko. Mathiassen, Lars ; Munk-Madsen, …", "num_citations": "58\n", "authors": ["1354"]}
{"title": "Soft systems and hard contradictions\n", "abstract": " Checkland's Soft Systems Methodology for defining and solving problems in organizations is presented on the basis of an application of the methodology. In many ways this approach represents an improvement in relation to more traditional approaches to computer-based information systems.Based on an experiment we explore the possibilities of combining the practical usefulness of soft systems thinking with the analytical power offered by dialectical thinking. Soft Systems Methodology already shares several basic elements with dialectical approaches to social theory and action. It does not, however, include the key element of dialectical analysis: explicit thinking in terms of contradictions.", "num_citations": "46\n", "authors": ["1354"]}
{"title": "A conceptual model of agile software development in a safety-critical context: A systematic literature review\n", "abstract": " ContextSafety-critical software systems are increasingly being used in new application areas, such as personal medical devices, traffic control, and detection of pathogens. A current research debate is regarding whether safety-critical systems are better developed with traditional waterfall processes or agile processes that are purportedly faster and promise to lead to better products.ObjectiveTo identify the issues and disputes in agile development of safety-critical software and the key qualities as found in the extant research literature.MethodWe conducted a systematic literature review as an interpretive study following a research design to search, assess, extract, group, and understand the results of the found studies.ResultsThere are key issues and propositions that we elicit from the literature and combine into a conceptual model for understanding the foundational challenges of agile software development of …", "num_citations": "41\n", "authors": ["1354"]}
{"title": "Social networks in software process improvement\n", "abstract": " Software process improvement in small organisation is often problematic and communication and knowledge sharing is more informal. To improve software processes we need to understand how they communicate and share knowledge. In this article have studied the company SmallSoft through action research. In the action research we have applied the framework of social network analysis and we show this can be used to understand the underlying structures of communication and knowledge sharing between software developers and managers. We show in detail how the analysis can be done and how the management can utilise the findings. From this we conclude that social network analysis was a useful framework together with accompanying tools and techniques. Copyright © 2009 John Wiley & Sons, Ltd.", "num_citations": "36\n", "authors": ["1354"]}
{"title": "Mobile systems development: a literature review\n", "abstract": " This article reviews 105 representative contributions to the literature on mobile systems development. The contributions are categorized according to a simple conceptual framework. The framework comprises four perspectives: the requirements perspective, the technology perspective, the application perspective, and the business perspective. Our literature review shows that mobile systems development is overlooked in the current debate. From the review, we extend the traditional view on systems development to encompass mobile systems and, based on the identified perspectives, we propose core characteristics for mobile systems. We also extend the traditional focus found in systems development on processes in a development project to encompass the whole of the development company as well as interorganizational linkage between development companies. Finally, we point at research directions …", "num_citations": "35\n", "authors": ["1354"]}
{"title": "Interaction and transformation in SSM\n", "abstract": " The penetration of Soft Systems Methodology (SSM) into information systems (IS) development is—despite several initiatives—rather limited as compared to how innovative and effective SSM has proven as an approach to organizational learning in general. This paper investigates the traditional soft systems concept as a key barrier that needs to be transcended to further develop SSM in the context of IS development.All kinds of human activities are in SSM viewed as transformations from one domain (the input) to another domain (the output). This perspective reflects classical flow‐oriented information systems based on batch‐processing technology while ignoring the highly interactive nature of contemporary information systems. The paper argues and illustrates that there is a need for a complementary type of soft system in IS development, it offers a specific proposal for how to include interaction systems in SSM …", "num_citations": "35\n", "authors": ["1354"]}
{"title": "Agile software development and its compatibility with a document-driven approach? A case study\n", "abstract": " It is generally assumed among software developers and managers that a document-driven development process is incompatible with an agile development process. There are few reports on this issue and even less empirical research documenting the assumed incompatibility. More and more software companies however have a desire to adopt agile development processes while maintaining compliance with a quality assurance standard or even a process standard. We have studied the software development process of a Danish pharmaceutical company. For market reasons the company has to comply the US Food and Drug Administration’s standards for software development. The company has also successfully implemented significant parts of the agile methodology Scrum. We describe this case and we analyse using Soft Systems Methodology how well the development process combines these diverging sets of process requirements. We find that despite much effort the agile development process suffers from its adaptation to the FDA standard, but at the same time many of the genuine qualities of an agile process have been maintained. From this case study we discuss the implications for development companies facing the challenge of implementing a mixed development approach.", "num_citations": "34\n", "authors": ["1354"]}
{"title": "Learning SPI in practice\n", "abstract": " According to the common rhetoric of software process improvement (SPI), there are a few basic steps to improving your software development process. First, you assess your organization’s current capability to develop quality software. Based on this, you derive a stepwise, focused strategy for improving this capability. You then make improvement efforts an integral part of your organization’s long-term goals. The result? Both the quality of your services and the productivity of your processes increase. SPI rhetoric is certainly powerful and appealing, and it inspires many software organizations to engage in improvement initiatives. However, even though most organizations struggle to meet expectations, many of them eventually fail. Starting SPI is not difficult. You begin by assessing your current processes. Typically, enthusiasm at this point is high. Most of your colleagues will be eager to learn about the strengths and weaknesses in the way projects are organized and carried out. However, turning assessment insights into action is the point at which many organizations fail. Others manage to initiate focused improvement projects, only to find that implementing new ideas is very difficult (see Chapter 15). Even when you succeed in implementing an idea in an individual project, you are still a long way from institutionalizing improvements. In addition to the predictable challenges at each stage, you’re likely to encounter other challenges. These include conflicts between SPI efforts and other traditional improvement initiatives, and the tendency for resources to grow scarce as the first wave of energy for SPI dies out. Clearly, SPI success involves more than …", "num_citations": "29\n", "authors": ["1354"]}
{"title": "Useful business cases: value creation in IS projects\n", "abstract": " Business cases have become popular as part of managing value creation in IS projects. Nevertheless, business cases are often poorly linked to value creation activities and organizations struggle to develop business cases that are useful and express more than simple cost savings. This action research study seeks to improve the usefulness of business cases in IS projects. We used collaborative action research with Danish municipalities to improve their practices when developing and using business cases and to change their perceptions of what constitutes a good business case that is useful during implementation and value creation. This article presents lessons learned from our action research, lessons that we incorporated into a business case method and subsequently evaluated with IS managers. There are three lessons on (1) improving the content of business cases, (2) how to develop business cases, and …", "num_citations": "28\n", "authors": ["1354"]}
{"title": "Scheduling of mobile robots with preemptive tasks\n", "abstract": " This paper deals with the problem of scheduling of mobile robots taking into account preemption cases in a flexible manufacturing system (FMS). In addition to capability of transporting materials between some machines, mobile robots are able to perform manufacturing tasks at other machines by using their manipulation arms. These manufacturing tasks can be preempted to allow mobile robots to transport materials when needed. The performance criterion is to minimize time required to complete all tasks, i.e. makespan. A mixed-integer programming (MIP) model is formulated to find the optimal solutions for the problem. Numerical experiments are investigated to demonstrate results of the proposed approach.", "num_citations": "28\n", "authors": ["1354"]}
{"title": "Competing values in software process improvement: a study of cultural profiles\n", "abstract": " Purpose – The purpose of the article is to investigate the impact of organizational culture on software process improvement (SPI). Is cultural congruence between an organization and an adopted process model required? How can the level of congruence between an organizational culture and the values and assumptions underlying an adopted process model be assessed?Design/methodology/approach – The competing values framework and its associated assessment instrument are used in a case study to establish an organizational culture profile of a software development business unit within the case company. The instrument is supplemented with a technique to produce culture profiles of texts such as process models like the Capability Maturity Model Integration (CMMI) and the case company's quality management system. The different profiles are subsequently analyzed and compared.Findings – The culture …", "num_citations": "26\n", "authors": ["1354"]}
{"title": "Implementing software process improvement: two cases of technology transfer\n", "abstract": " This paper addresses the issue of technology transfer in software development organizations. Common problems for the software industry are still software failures, project overruns, and unfinished projects. To remedy these, knowledge-intensive technologies like quality management and software process improvement (SPI) have been promoted. The organizational implementation of such approaches is an important and problematic matter. Here, two cases of implementing SPI are reported. A framework integrating theories of general innovation with theories on adoption of information technologies is used to present and interpret the cases. The framework consists of three perspectives: an individualist, a structuralist, and an interaction process perspective. The latter comprises the first two and emphasizes the content, context and process of implementation. The framework turned out to be well suited and provided a …", "num_citations": "24\n", "authors": ["1354"]}
{"title": "IS action research and its criteria\n", "abstract": " There is little agreement on which criteria should be used in the design and evaluation of IS action research. Much action research is not at all explicit about the applied criteria. This chapter seeks to remedy this by eliciting from twenty odd years of action research six criteria. The epistemology of action research has traces back to pragmatism and with this as background the six criteria are presented and illustrated through a piece of recent action research. The contributions of the chapter are the six criteria, how to model these in their context of research activities and research contributions, and how to understand these criteria in a pragmatist view.", "num_citations": "23\n", "authors": ["1354"]}
{"title": "A vertical approach to knowledge management: Codification and personalization in software processes\n", "abstract": " Software process improvement is a practical concern in software companies today and it has been addressed in research. Part of this research has applied a knowledge management perspective. Researchers point out that two different strategies exist where a mixture is difficult to maintain: Personalization (focus on people and their collaboration) and codification (focus on documents and their accessibility). This paper addresses different knowledge management problems of a software company and how they can be alleviated. A prototype, which distinguishes between different organizational levels (eg, software managers and software developers) and applies different knowledge management strategies, was built. It consists of a wiki and an enterprise system. This article shows how each part of the system focuses on one of the strategies and describes the differences for tool support. This combination could be …", "num_citations": "22\n", "authors": ["1354"]}
{"title": "Method Engineering: Who’s the Customer?\n", "abstract": " This paper reports from a large Danish effort to engineer an object-oriented method for analysis and design of computer systems. Over a period of six years a method was developed based on new ideas on how to learn object-orientation supplemented with well-known ideas of how to work object-oriented in systems development.             The experience from this method engineering effort is interpreted as an iterative process involving elements of theory, method and case records. These elements played different roles when engineering the method. But, what is more important, they became key elements in structuring and presenting the method to practitioners and students of the field.             This particular method engineering effort has thus been governed by a paradigm for learning methods rather than a paradigm for working with methods. We discuss this paradigm by exploring three issues involved in …", "num_citations": "22\n", "authors": ["1354"]}
{"title": "UAV Mission planning resistant to weather uncertainty\n", "abstract": " Fleet mission planning for Unmanned Aerial Vehicles (UAVs) is the process of creating flight plans for a specific set of objectives and typically over a time period. Due to the increasing focus on the usage of large UAVs, a key challenge is to conduct mission planning addressing changing weather conditions, collision avoidance, and energy constraints specific to these types of UAVs. This paper presents a declarative approach for solving the complex mission planning resistant to weather uncertainty. The approach has been tested on several examples, analyzing how customer satisfaction is influenced by different values of the mission parameters, such as the fleet size, travel distance, wind direction, and wind speed. Computational experiments show the results that allow assessing alternative strategies of UAV mission planning. View Full-Text", "num_citations": "21\n", "authors": ["1354"]}
{"title": "On the training of a neural network for online path planning with offline path planning algorithms\n", "abstract": " One of the challenges in path planning for an automated vehicle is uncertainty in the operational environment of the vehicle, demanding a quick but sophisticated control of the vehicle online. To address this online path planning issue, neural networks, which can derive a heading for an operating vehicle in a given situation, have been actively studied, demonstrating their satisfactory performance. However, the study on the training path data, which specifies the desired output of a neural network and in turn influences the behavior of the neural network, has been neglected in the literature. Motivated by this fact, in this paper, we first generate different training path data sets applying two different offline path planning algorithms and evaluate the performance of a neural network as an online path planner depending on the training data under a simulation environment. We further investigate the properties of the training …", "num_citations": "20\n", "authors": ["1354"]}
{"title": "The role of UX professionals in agile development: a case study from industry\n", "abstract": " A highly debated topic within recent literature in HCI is the integration of UX activities into agile development. While we acknowledge the question of integration to be one of the main challenges for UX professionals, this seems to have received traction and is heading closer towards a resolution. We believe the time is right for gaining an in-depth understanding of the UX roles responsibilities in an agile case company that has moved beyond the question of UX integration. Through interviews with UX professionals, developers and managers we found that the UX professionals have a very broad set of responsibilities, of which some are unseen in relation to previous studies and not classically considered part of the UX role. Interestingly, these newly identified responsibilities are some of the most critical to the success of integrating UX into agile development.", "num_citations": "20\n", "authors": ["1354"]}
{"title": "Making Sense of Software Project Management: A case of knowledge sharing in software development\n", "abstract": " In this paper we empirically explore knowledge sharing in a group of project managers in the Danish software company SpaceSoft. We apply a framework of sensemaking that focuses on how people participate in creating shared meanings. The framework is used in the analysis of the case where project managers create shared knowledge in a handbook for software project management. The framework provides a rich conception of how meaning is created. It explains the importance of collisions and negotiation of the project managers’ expectations and experience. The findings add to existing theories of knowledge sharing in software development. We contribute in particular with an in depth explanation of the complex process where personal knowledge gradually turns into shared knowledge and some of it in codified form becomes part of the software project management handbook.", "num_citations": "19\n", "authors": ["1354"]}
{"title": "Software processes & knowledge: Beyond conventional software process improvement\n", "abstract": " Software Processes & Knowledge: Beyond Conventional Software Process Improvement — Aalborg University's Research Portal Skip to main navigation Skip to search Skip to main content Aalborg University's Research Portal Logo Dansk English Home Profiles Projects Publications Activities Research Units Facilities Press / Media Prizes Datasets Impacts Search by keywords, name or affiliation Software Processes & Knowledge: Beyond Conventional Software Process Improvement Peter Axel Nielsen (Editor), karlheinz Kautz (Editor) Department of Computer Science Research output: Book/Report › Anthology › Research › peer-review Overview Projects (1) Original language English Place of Publication Aalborg Publisher Software Innovation Publisher Number of pages 192 ISBN (Print) 978-87-992586-0-4 Publication status Published - 2008 Access to Document http://people.cs.aau.dk/~pan/ebook/SPK-Book.pdf …", "num_citations": "19\n", "authors": ["1354"]}
{"title": "Value positions in e-government strategies: Something is (not) changing in the state of Denmark\n", "abstract": " Clarifying what value new information systems (IS) may help to create for government organizations and society is a central concern in the public sector. National e-government strategies present such efforts to clarify the value entailed by IS, however, what is considered valuable is influenced by value positions deeply enshrined in the traditions of public administration. We present a theory directed content analysis of value positions in the national e-government strategy for Denmark published for the first time in 1994 and latest in 2016. Our comparison of the value positions in the two e-government strategies show consistency over time when looking at the ideals of professionalism, ser-vice, and efficiency. While the least dominant ideal of engagement, has declined. The 22-year timespan separating the development of these two strategies had major technological advances, but little transformational impact on Danish e-government strategies in their general value positions. We discuss how our findings contribute to previous research on values in e-government and have practical implications for working with e-government strategies.", "num_citations": "17\n", "authors": ["1354"]}
{"title": "Engaged problem formulation in IS research\n", "abstract": " “Is this the problem?”: the question that haunts many information systems (IS) researchers when they pursue work relevant to both practice and research. Nevertheless, a deliberate answer to this question requires more than simply asking the involved IS practitioners. Deliberately formulating problems requires a more substantial engagement with the different stakeholders, especially when their problems are ill structured and situated in complex organizational settings. On this basis, we present an engaged approach to formulating IS problems with, not for, IS practitioners. We have come to understand engaged problem formulation as joint researching and as the defining of contemporary and complex problems by researchers and those practitioners who experience and know these problems. We used this approach in investigating IS management in Danish municipalities. In this paper, we present the approach to formulating problems in an engaged way. We discuss it in relation to ideas and assumptions that underpin engaged scholarship, and we discuss the implications for IS action research, design science research, and mixed approaches.", "num_citations": "17\n", "authors": ["1354"]}
{"title": "Soft systems in software design\n", "abstract": " This paper explores the possibility of applying soft systems thinking as a basis for designing application software and it outlines a new method for software design (Mathiassen et al. 1991). The method is called ‘Rapid Systems Modelling’. It supports systems developers and users in going from a problematic organisational situation to the design of a new and modified computer application for that situation.", "num_citations": "17\n", "authors": ["1354"]}
{"title": "Four integration patterns: IS development as stepwise adaptation of technology and organziation\n", "abstract": " Integration and adaptation between an information system and the related business organisation is an important challenge for IS development project managers. Both IS research and software engineering research have contributed important lessons on integration, but at the practical level of IS development projects the processes of integration and mutual adaptation is less well understood. In this paper we apply a socio-technical perspective to analyze the integration of stakeholders and technical components, and we identify four generic integration patterns; Big Bang, Stakeholder Integration, Technical Integration and Socio-Technical Integration. Three case studies of iterative software development projects are used to illustrate the patterns. These illustrations highlight the management challenges of iterative integration. While early integration increases the likelihood of implementation success, it also increases …", "num_citations": "16\n", "authors": ["1354"]}
{"title": "Organizational influence process in software process improvement\n", "abstract": " In this paper we investigate organizational influence processes in software process improvement. We analyze an improvement effort through the lenses of organizational influence theory. Our analysis suggests that the framework can explain several significant organizational complexities in software process improvement. Further, the framework point to relevant actions for managers of software process improvement. This will have implications for the creation of effective software process improvement.", "num_citations": "16\n", "authors": ["1354"]}
{"title": "Modelling events in object-oriented analysis\n", "abstract": " The concept of objects is widely applicable in software development. In this paper, we explore its capabilities in modelling various kinds of phenomena in object-oriented analysis and design. We argue that the dynamics of objects in the real world are different from the dynamics of objects within the computer system. There is much to be gained from explicitly modelling events in object- oriented analysis thereby concieving real-world objects differently from the classical way in which we understand and design objects as parts of a software system. The paper examines a well-known approach to object-oriented analysis, it provides specific advice on event modelling, and it outlines a way of representing events in object-oriented software design.", "num_citations": "16\n", "authors": ["1354"]}
{"title": "Agile software development and the barriers to transfer of knowledge: an interpretive case study\n", "abstract": " Agile practices to systems development are believed to depend largely on the developers’ competences, experience and knowledge and to a lesser degree on formal development processes and methods. In this paper we investigate the knowledge transfer and barriers to the transfer of agile development practices in an interpretive case study. The case company is a pharmaceutical firm where we studied how they develop software and how they transfer their own experience. Based on the literature we develop an initial framework of barriers to knowledge transfer and apply it to interpret the case study. From this case study we are able to discuss the initial framework and extend it to a framework of knowledge transfer of agile practices. The framework provides a better understanding of the barriers to knowledge transfer of agile practices. The paper contributes with (1) an application of the framework to explain …", "num_citations": "15\n", "authors": ["1354"]}
{"title": "Application of field and laboratory emission cell'FLEC'-recovery study, case study of damaged linoleum, and liquid wax\n", "abstract": " Application of field and laboratory emission cell 'FLEC' - recovery study, case study of damaged linoleum, and liquid wax — Aalborg University's Research Portal Skip to main navigation Skip to search Skip to main content Aalborg University's Research Portal Logo Dansk English Home Profiles Projects Publications Activities Research Units Facilities Press / Media Prizes Datasets Impacts Search by keywords, name or affiliation Application of field and laboratory emission cell 'FLEC' - recovery study, case study of damaged linoleum, and liquid wax P. Wolkoff, PA Clausen, PA Nielsen Research output: Contribution to book/anthology/report/conference proceeding › Article in proceeding › Research Overview Original language English Title of host publication Indoor Air '93. Proceedings of the 6th International Conference on Indoor Air Quality and Climate Volume Vol. 2 Publication date 1993 Pages 543-548 Publication …", "num_citations": "15\n", "authors": ["1354"]}
{"title": "Approaches to appreciate information systems methodologies\n", "abstract": " A vast number of different methodologies for developing computer-based information systems are available. They form a motley spectrum in the sense that they apply to different parts of the development process and to different modes of thinking and acting. At a meta-level relative to methodologies is the discipline that deals with these differences and the applicability of methodologies in different situations. It encompasses theories, ideas and, especially, appreciation approaches, ie approaches to understand, evaluate and compare methodologies.This article is a survey of the appreciation approaches found in the literature. The survey has been conducted as a soft systems enquiry. The appreciation approaches are understood and partly evaluated by mapping them unto a soft systems model that explicate how to answer the fundamental question of: Which methodologies in which situations? It is argued that the appreciation approaches found are static and general in the sense that the fundamental question is assessed detached from a particular situation. Furthermore, it is argued on the basis of Schon's theory on reflection-in-action and Checkland's soft systems thinking that we need appreciation approaches that facilitate dynamic and situational thinking about the use of methodologies.", "num_citations": "15\n", "authors": ["1354"]}
{"title": "Model and migrating birds optimization algorithm for two-sided assembly line worker assignment and balancing problem\n", "abstract": " Worker assignment is a relatively new problem in assembly lines that typically is encountered in situations in which the workforce is heterogeneous. The optimal assignment of a heterogeneous workforce is known as the assembly line worker assignment and balancing problem (ALWABP). This problem is different from the well-known simple assembly line balancing problem concerning the task execution times, and it varies according to the assigned worker. Minimal work has been reported in worker assignment in two-sided assembly lines. This research studies worker assignment and line balancing in two-sided assembly lines with an objective of minimizing the cycle time (TALWABP). A mixed-integer programming model is developed, and CPLEX solver is used to solve the small-size problems. An improved migrating birds optimization algorithm is employed to deal with the large-size problems due to the …", "num_citations": "14\n", "authors": ["1354"]}
{"title": "Integrating usability practices into agile development: A case study\n", "abstract": " Within agile software development there is a growing concern with how development organizations can integrate usability work into agile practices. The concern occurs as frustration experienced in practice by agile developers and usability designers, and it also occurs as a gap in the research literature. With this paper we report from a case study in a software company that is committed to agile development, to usability work, and to their integration. The theoretical starting point is an initial framework that has been elicited from the research literature; and the paper’s contribution is an extension and modification of the initial framework based on our case study results. The resulting framework points to three enablers (attitudes, compromises, skills), three tasks (upfront design, low-fi prototyping, iterative evaluating), and three alternative modes of collaboration/work organization (parallel, embedded, fully integrated) in agile usability practices. In addition, end-user involvement may vary. The paper contributes by extending existing frameworks on integration and thus providing better explanations for practitioners and researchers of integration of usability.", "num_citations": "14\n", "authors": ["1354"]}
{"title": "Reflections on Development Methods for Information Systems: A Set of Distinctions Between Models\n", "abstract": " Argues that a set of distinctions between methods for informationsystems development is useful for learning about the methods and theirrelation to practice. Examines three projects conducted in three similarbranches of the same bank. Evolves a set of distinctions: the context,the consequences and the conditions, for application of the models.Suggests areas of further research.", "num_citations": "14\n", "authors": ["1354"]}
{"title": "Unmanned aerial vehicle routing problems: a literature review\n", "abstract": " Unmanned aerial vehicle (UAV) routing is transitioning from an emerging topic to a growing research area as the 3D flexible utilization of airspace, promogulated by UAVs, is a potential game changer in solving the urban air mobility challenge by allowing to reshape transportation and logistics in the future. This has revealed a need to classify different types of research and examine the general characteristics of the research area. This research aims to assist in identifying the main topics and emerging research streams and provides a published overview of the current state and contributions to the area of the UAV routing problem (UAVRP) and a general categorization of the vehicle routing problem (VRP) followed by a UAVRP classification with a graphical taxonomy based on the analysis of UAVRP current status. To achieve this, an analysis of the existing research contributions promulgated in this domain is conducted. This analysis is used to identify the current state of UAVRP and the gaps related to the UAVs’ flight dynamics and weather conditions, which significantly influence the fuel consumption of the UAV when modeling the UAVRP. View Full-Text", "num_citations": "13\n", "authors": ["1354"]}
{"title": "Planning deliveries with UAV routing under weather forecast and energy consumption constraints\n", "abstract": " In this paper, a depth-first search strategy to cope with the problem of multi-trip unmanned aerial vehicle (UAV) fleet mission planning is proposed. The considered UAVs delivery problem aims at a trajectory planning issue addressed for UAVs operating in a hostile environment while considering battery and payload weight as well as vehicles reuse. Employed UAVs fly on a 3D plane matching a distribution network while servicing customers and ensuring collision avoidance among team members. The objective is to get a sequence of submissions that ensures delivery to customers satisfying the requested amount and demands within a given time horizon. The method proposed in this paper offers solutions to several questions related to the multistage mission planning that could be applied to solve problems such as minimizing energy consumption, conducting the mission in the shortest possible time, just-in-time …", "num_citations": "13\n", "authors": ["1354"]}
{"title": "A solution approach for UAV fleet mission planning in changing weather conditions\n", "abstract": " With a rising demand for utilizing unmanned aerial vehicles (UAVs) to deliver materials in outdoor environments, particular attention must be given to all the different aspects influencing the deployment of UAVs for such purposes. These aspects include the characteristics of the UAV fleet (eg, size of fleet, UAV specifications and capabilities), the energy consumption (highly affected by weather conditions and payload) and the characteristics of the network and customer locations. All these aspects must be taken into account when aiming to achieve deliveries to customers in a safe and timely manner. However, at present, there is a lack of decision support tools and methods for mission planners that consider all these influencing aspects together. To bridge this gap, this paper presents a decomposed solution approach, which provides decision support for UAVs’ fleet mission planning. The proposed approach assists flight mission planners in aerospace companies to select and evaluate different mission scenarios, for which flight-mission plans are obtained for a given fleet of UAVs, while guaranteeing delivery according to customer requirements in a given time horizon. Mission plans are analyzed from multiple perspectives including different weather conditions (wind speed and direction), payload capacities of UAVs, energy capacities of UAVs, fleet sizes, the number of customers visited by a UAV on a mission and delivery performance. The proposed decision support-driven declarative model supports the selection of the UAV mission planning scenarios subject to variations on all these configurations of the UAV system and variations in the …", "num_citations": "13\n", "authors": ["1354"]}
{"title": "Managing big data analytics projects: The challenges of realizing value\n", "abstract": " Organizations invest significantly in Big Data Analytics (BDA), but only limited knowledge is available on the challenges faced by these organizations when trying to realize value in such projects. Benefits realization management (BRM) offers a perspective and processes for realizing value from information systems (IS) projects. Yet, limited research has investigated how this can be applied to development processes for BDA projects. We report an in-depth case study of a large organization’s BDA development processes and the inherent challenges of realizing value. From our analysis, we found eight necessary activities for realizing value in a BDA process and the challenges pertaining to each activity. These findings extend previous research on value creation in BDA projects with insights from practices in a large organization highly dedicated to exploiting Big Data. The paper discusses these findings as they relate to previous research and concludes with their implications for current BDA projects and future research.", "num_citations": "13\n", "authors": ["1354"]}
{"title": "Creating business value through agile project management and information systems development: The perceived impact of Scrum\n", "abstract": " Value creation through information systems (IS) and information technology (IT) is a major IS research topic. However there still exists an ambiguity and fuzziness of the ‘IS business value’ concept and a lack of clarity surrounding the value creation process. This also true for organizations that develop IS/IT and for development technologies like information systems development and project management methods that are applied in the production of IS/IT. The agile method Scrum is one such technology. In the research presented here we studied productivity, quality and employee satisfaction as supported by Scrum as value creating measures. Our positive assessment is built upon subjective perceptions and goes beyond hard measures and indicators. It provides insights into individual and organisational impacts and sheds light on the value generation process. The measures we present thus deal with …", "num_citations": "13\n", "authors": ["1354"]}
{"title": "Usability work in agile systems development practice: a systematic review\n", "abstract": " In this chapter we present the results of a systematic literature review of the recommendations in the existing research literature on usability work in agile systems development. The review contributes by summarizing the literature in light of seven claims about how to integrate usability work into an agile development project. By analyzing the claims we show how the previous literature provides grounds, warrants, backing, rebuttal, and qualification with regard to each of them. From this comprehensive overview of the literature we then discuss a research agenda with a particular focus on how situational factors for the claims must be researched and how this must encompass identified rebuttals and qualifications.", "num_citations": "13\n", "authors": ["1354"]}
{"title": "Object Oriented Analysis & Design\n", "abstract": " ● Design Phase–Analysis model is refined and adapted to the environment–Can be separated into tw o stages 1. System design Concerned with overall system architecture 2. Object design, Implementation details are added to system design", "num_citations": "13\n", "authors": ["1354"]}
{"title": "Gevinstrealisering i e-forvaltningsprosjekter. God teknologiledelse i praksis\n", "abstract": " IS403 – IT og forretningsutvikling Page 1 Gevinstrealisering i eForvaltningsprosjekter God teknologiledelse i praksis. Leif Skiftenes Flak, PhD Senter for eForvaltning, institutt for informasjonssystemer, UiA E-post: Leif.Flak@uia.no Page 2 Disposisjon • Del I • Utfordringen offentlig sektor står ovenfor • Hva er gevinstrealisering? • Del II • Ulike tilnærminger til gevinstrealisering • Erfaringer • Spørsmål og kommentarer er bra – når som helst! Leif S Flak, 19.09.11 Page 3 Forenklede definisjoner • Effekt: Endring i tilstand • Gevinst: Positiv effekt som bidrar til strategisk måloppnåelse • Gevinstrealisering: Prosess for å sikre gevinster • Prosess: En sekvens av målrettede aktiviteter • Måling: Dokumentasjon av tilstand på et gitt tidspunkt Leif S Flak, 19.09.11 Page 4 Fra prosjektstyring til gevinstrealisering Leif S Flak, 19.09.11 Page 5 Om mål NB! Offentlig sektor er forskjellig fra privat sektor, blant annet ved en mer kompleks …", "num_citations": "12\n", "authors": ["1354"]}
{"title": "An examination of culture profiles in a software organization implementing SPI\n", "abstract": " The capability maturity model integration (CMMI) has become one of the most preferred approaches to software process improvement (SPI). However, the amount of discontinued or delayed CMMI-driven SPI projects is considerable. In this paper we investigate the culture embedded in the CMMI and compare it with the cultures within an implementing organization in Scandinavia by utilising the competing values framework. We search for congruencies in culture profiles and relate the profiles to assessment results in different business areas of the organization. Our research reveals that in spite of similar culture profiles in the business areas, which are significantly different from the culture profile of the CMMI, there is no apparent association with the level of SPI success. Furthermore, even if CMMI based process descriptions are not adapted to the software organisation’s specific culture profile, evidence suggests that …", "num_citations": "12\n", "authors": ["1354"]}
{"title": "Making Sense of Project Management-A Case of Knowledge Management in Software Development\n", "abstract": " How can a software company make sense of project management when it becomes involved in software process improvement? In software development most research has an instrumental view of knowledge management thus neglecting what is probably the most important part of knowledge management namely making sense of practice by developers and project managers. Through an action case, we study the knowledge management processes in a Danish software company. We analyse the case through the lens of a theoretical framework. The theoretical framework focuses in particular on sensemaking, collective construed realities and individual cognitive processes. It directs attention towards the creation and negotiation of construed realities and how collisions trigger moving from creating to negotiating. We discuss the value and relevance of this framework for software development companies and …", "num_citations": "12\n", "authors": ["1354"]}
{"title": "IT business cases in local government: An action research study\n", "abstract": " Effective management of value creation with information technology (IT) is increasingly important for local governments (e.g., municipalities). The business case is a tool that has increased popularity in both the public and private sector to support the management of value creation with IT. However, experiences from local government reveal difficulties in developing effective IT business cases beyond simple cost savings. Based on collaborative action research with Danish municipalities we present insights on contemporary IT business case practices. Based on these insights we formulate lessons for business case practices in local government that we have incorporated into a business case method, that has subsequently been evaluated by IT managers in local government. These lessons have been synthesized into the four principles: minimal contents, benefits ownership, dynamic utility, and social commitment …", "num_citations": "11\n", "authors": ["1354"]}
{"title": "IT management in local government: Engaged problem formulation\n", "abstract": " The use of information technology (IT) is increasingly important for local governments (municipalities) in adhering to their responsibilities for providing services to citizens and this requires effective IT management. We present an engaged scholarship approach to formulating the IT management problems with local government–not for local government. We define such engaged problem formulation as joint learning and definition of a contemporary and complex problem by researchers and those who experience and know the problem. This engaged problem formulation process was carried out as an initiation of action research and design science research activities at multiple levels in Danish municipalities. In this paper we present the IT management problems identified in our study and discuss the engaged problem formulation process in relation to engaged scholarship and implications for action research and design science research activities.", "num_citations": "11\n", "authors": ["1354"]}
{"title": "A Framework for Selecting Assessment Strategy\n", "abstract": " A Framework for Selecting Assessment Strategy — Aalborg University's Research Portal Skip to main navigation Skip to search Skip to main content Aalborg University's Research Portal Logo Dansk English Home Profiles Projects Publications Activities Research Units Facilities Press / Media Prizes Datasets Impacts Search by keywords, name or affiliation A Framework for Selecting Assessment Strategy Peter Axel Nielsen, J. Pries-Heje Department of Computer Science Research output: Contribution to book/anthology/report/conference proceeding › Book chapter › Research Overview Original language English Title of host publication Improving Software Organizations : From Principles to Practice Editors Mathiassen, L. (ed.) : Pries-Heje, J. (ed.) : Ngwenyama, O. (ed.) Place of Publication Boston Publisher Addison-Wesley Publication date 2002 ISBN (Print) 0201758202 Publication status Published - 2002 Series …", "num_citations": "11\n", "authors": ["1354"]}
{"title": "Multi criteria decision making for the multi-satellite image acquisition scheduling problem\n", "abstract": " The multi-satellite image acquisition scheduling problem is traditionally seen as a complex optimization problem containing a generic objective function that represents the priority structure of the satellite operator. However, the majority of literature neglect the collective and contemporary effect of factors associated with the operational goal in the objective function, ie, uncertainty in cloud cover, customer priority, image quality criteria, etc. Consequently, the focus of the article is to integrate a real-time scoring approach of imaging attempts that considers these aspects. This is accomplished in a multi-satellite planning environment, through the utilization of the multi-criteria decision making (MCDM) models, Elimination and Choice Expressing Reality (ELECTRE-III) and the Technique for Order of Preference by Similarity to Ideal Solution (TOPSIS), and the formulation of a binary linear programming model. The two scoring approaches belong to different model classes of MCDM, respectively an outranking approach and a distance to ideal point approach, and they are compared with a naive approach. Numerical experiments are conducted to validate the models and illustrate the importance of criteria neglected in previous studies. The results demonstrate the customized behaviour allowed by MCDM methods, especially the ELECTRE-III approach. View Full-Text", "num_citations": "10\n", "authors": ["1354"]}
{"title": "Apathy towards the integration of usability work: a case of system justification\n", "abstract": " In this article, we report from a case study of an agile software development organization and we study in particular the developers’ and product managers’ attitudes towards integrating usability work into software development. We offer explanations based on system justification theory illuminating what would-be integrators might be up against. The analysis shows how the developers only pay lip service to usability work and how they treat users superficially. It further shows how that leads to stereotyping of usability designers and users in order to preserve status quo, and how internalization of inequality between the developers and usability designers rationalizes the preservation of status quo. These findings will have significant implications for managers of software development.", "num_citations": "10\n", "authors": ["1354"]}
{"title": "Enterprise system implementations: Organizational influence processes for corporate user representatives\n", "abstract": " Enterprise system implementation is a complex and large undertaking. Business requirements does not necessarily fit the inherited as-is features of the software. To reach agreement on features to implement requires prudent management and astute exercise of power.In this paper we draw on an in-depth, interpretive study from the oil industry, where we analyze a case of innovative integration of an ECM system with collaboration technologies. The data collection has been longitudinal. The data analysis has been performed through the perspective of organizational influence processes.", "num_citations": "10\n", "authors": ["1354"]}
{"title": "Learning and using methodologies in information systems analysis and design\n", "abstract": " B c5Pd9) ef 36g¦ d@ d9# 5h'i p q rsq tvu wx t@ y (s rx r rx rr rx r rx rrrrr rx r rx rr rx r rx rr rx rr qrwwu dye uf rx r rx rrrrr rx r rx rr rx r rx rr rx rr qhg i j\" e# i05k605mlA5hnP) e\" o© p) 3q 243$ &5h rs t#) A53v umw© h\" orx©¦ 3'lw©) e© y 36v z {\" o©) An3 Bp orsq|} t Ay (y (} oo w4 wu yo y (y (wr rx rr rx r rx rr rx rr qh or|} t Ay (y (} oo w4 aw w4 yw} e rx r rx rr rx r rx rr rx rr (or g tvu wy Wy} 4w ty|} t Ay sy (} food w4 aw uty yy (r rx rr ge or rx r rx rr rx r rx rrrrr rx r rx rr rx r rx rr rx rrg (\" lA t h\" o6\"©\" oti B g rsq dw4 y (} ft ye u w4 rrrrr rx r rx rr rx r rx rr rx rr% gr h dy (¢¡ Yw4} tw4 k dye uw ÿ os sy (}'P t ye utw4 rr£(grg rx r rx rr rx r rx rrrrr rx r rx rr rx r rx rr rx rr£(", "num_citations": "10\n", "authors": ["1354"]}
{"title": "IT management in local government: The DISIMIT Project\n", "abstract": " The most common expression in Danish for e-government is „digital forvaltning‟ which can be translated as electronic administration. Digital (electronic) administration occurs when digital technologies are systematically used to improve the efficiency of government organisations. However IT is widespread in the public sector and can serve a variety of purposes (Rose 2007), for example:• E-Administration–the use of computer and networking technologies to support, develop and rationalise the internal process of government institutions.", "num_citations": "9\n", "authors": ["1354"]}
{"title": "Mapping knowledge flows\n", "abstract": " The theme of this book is the importance of knowledge for the improvement of software development. Software process improvement (SPI) is concerned with strengthening software development capabilities, which for us means that one primary task of SPI research is to strengthen the knowledge managing and sharing capabilities of software development companies (Hansen and Kautz 2004).With this background, this chapter presents a means for identifying and analyzing how knowledge flows through an organization. We have developed this technique for mapping knowledge flows between organizational actors and assessed its applicability in a pilot experiment in Systematic Software Engineering (SSE), see also chapter 11. In the experiment we tested and evaluated one way in which the technique could be used to analyze an organization’s knowledge sharing capabilities; thus, it points to opportunities for improvement and provides recommendations for how it can support SPI based on knowledge management.", "num_citations": "9\n", "authors": ["1354"]}
{"title": "Managerial and Organizational Assumptions in the CMMs\n", "abstract": " Software development is both an important activity for developed countries’ economic progress, and a complex, problematic and occasionally spectacularly, unsuccessful one. Software projects have a reputation for being late and over budget, and the resultant software often provokes complaints from purchasers and users. The organisations that commission and eventually pay for software naturally try to seek contractual guarantees that they will get a product with which they are happy; accordingly, software firms look for ways to reliably deliver outcomes that will satisfy their customers. However, increases in the complexity of the tasks facing software developers match various contributing developments in the fields that support software development, such as programming, mathematical and algorithmic support from computer scientists, technique and automation help from software engineers, and method support from information systems specialists. An important parallel development in the practice and literature of software development has been the emergence of support for the management of the software development task in the form of software process improvement (SPI). This literature has resulted in a variety of approaches for improving the organisation and management of software projects, including the BOOTSTRAP methodology (Kuvaja and Bicego 1994, p. 195; Kuvaja et al. 1994), TAPISTRY (a software process improvement approach tailored for small enterprises)(Kuvaja et al. 1999), SPICE (Software Process Improvement and Capability dEtermination), the Industrialized Software Organisation or Japanese Software", "num_citations": "9\n", "authors": ["1354"]}
{"title": "Innovation, employment and competence development\n", "abstract": " The aim of this paper is to analyze the relation between innovation, employment and competence development empirically. In order to focus the most important elements and relations, a theoretical framework will be applied, which combines two system approaches: system of innovation and system of employment in a learning perspective. The two system approaches are both well developed (see Lundvall 1992, Edquist 2001 and Hendry 1995), but the systems are seldom combined analytically. A system of innovation is constituted by elements and relationships, which interact in the production, diffusion and use of new and economically useful knowledge (Lundvall op. cit. 1992). If we focus on the firm as center of the system of innovation, the external context of the firm are defined by institutions and organizations such as other private firms, universities, government agencies, financial institutions etc. In the same way the internal context are defined by the firm’s institutions and organizational elements that are important for learning and promoting product and process innovation. This analysis will concentrate on the internal context of learning, but will also relate to the external context of the firm.The system of employment gives a framework for understanding the nature of the employment relations in the firm (Marsden 1999). The system is constituted by elements such as recruitment, competence development, training, integration and mobility and the relations between these elements. Again, it is institutions and organizations that constitute the system. Employment systems provide a framework for analyzing employee application, quantitatively and …", "num_citations": "9\n", "authors": ["1354"]}
{"title": "A proactive approach to resistant UAV mission planning\n", "abstract": " Proactive mission planning for a fleet of Unmanned Aerial Vehicles (UAVs) can be seen as a sequence of routing problems mathematically formalized as 0-1 knapsack problems. Taking into account the fact that weather conditions change during a mission, the time horizon of the planned mission is subdivided into time windows corresponding to periods of stable weather. Also, keeping in mind fuel constraints, each knapsack problem is formulated as follows: Given is the fleet size and a set of spatially dispersed target points specified by the volume of expected deliveries and the coordinates of their location, which allow to determine the amount of fuel consumed during flight along a particular route segment/from one drop-off point to another. Determine a subset of locations so that the total fuel required to cover the total distance traveled by the UAV fleet is less than or equal to the given limit e.g. determined by …", "num_citations": "8\n", "authors": ["1354"]}
{"title": "Panel—The impact of action research on information systems\n", "abstract": " This panel will discuss the impact of action research methodology on the field of information systems (IS). Action research is often discussed as a paragon of qualitative methods, but how has this method made a significant difference in our understanding of the interaction between information systems and the organization?", "num_citations": "8\n", "authors": ["1354"]}
{"title": "Adsorption studies on dust samples from the indoor environment\n", "abstract": " Adsorption studies on dust samples from the indoor environment — Aalborg University's Research Portal Skip to main navigation Skip to search Skip to main content Aalborg University's Research Portal Logo Dansk English Home Profiles Projects Publications Activities Research Units Facilities Press / Media Prizes Datasets Impacts Search by keywords, name or affiliation Adsorption studies on dust samples from the indoor environment U. Kjær Research output: Contribution to conference without publisher/journal › Paper without publisher/journal › Research Overview Original language English Publication date 1993 Publication status Published - 1993 Event Adsorption studies on dust samples from the indoor environment - Duration: 19 May 2010 → … Conference Conference Adsorption studies on dust samples from the indoor environment Period 19/05/2010 → … Cite this APA Author BIBTEX Harvard Standard …", "num_citations": "8\n", "authors": ["1354"]}
{"title": "Personalised soundscapes in homes\n", "abstract": " Sound zone technology is being developed to provide users with the ability to modify their personal soundscape. In this paper, we take first steps toward studying how and when users could use sound zone technology within the domestic context. We present a design ethnographical study of sounds in homes and potentials for utilising sound zone technology to modify soundscapes. Based on two rounds of qualitative interviews with seven participating households of diverse composition, dwelling type, and area type, we develop a design-oriented framework. The framework posits particular situations in which sound zone technology can support domestic activities. These are described and validated through the qualitative data collected in the households. The framework consists of two dimensions leading to four generalised situations: private versus social situations, and separate versus connected situations. A …", "num_citations": "7\n", "authors": ["1354"]}
{"title": "When process is getting in the way of creativity and innovation\n", "abstract": " With increasing hyper competition, information systems have become the main driver for sustaining innovation and competitive advantages. At the same time, many companies use various quality management standards and process models to increase business process efficiency and improve quality. How these process models and quality standards influence organizational cultures that enhance creativity and innovation is, however, under-researched within the field. Using a software analysis tool built on the competing values framework, we set out to investigate how commonly used process models and quality standards promote cultures of creativity and innovation. Our findings are overwhelmingly negative as the analyzed models and standards clearly promote an organizational culture emphasizing stability and control rather than creativity and innovation. To reconcile our findings with the nature of these models …", "num_citations": "7\n", "authors": ["1354"]}
{"title": "IT benefits management in local government: a comparative case study\n", "abstract": " Information technology (IT) is increasingly presented as a driving force for service and efficiency improvement in local governments. However, achieving these goals in creating value from IT investments is a significant challenge for local government organizations. Practitioners and researchers have proposed numerous approaches to IT benefits management, but our knowledge of current practices and capabilities in local government IT management is still limited. Thus, in this paper we resent an investigation of what characterizes IT benefits management in local government in order to understand and improve current practices. Through a comparative case study of two Danish municipalities, we have analyzed the different characteristics of benefits management. Based on this analysis we propose an initial framework for understanding IT benefits management in local government.", "num_citations": "7\n", "authors": ["1354"]}
{"title": "Misfit or misuse? Lessons from implementation of scrum in radical product innovation\n", "abstract": " In this paper we report from a study of the implementation and early experiences of using Scrum for radical product innovation in a traditional, matrix-organized software company. The empirical data was collected in an interview-based case study. The case data show a company undergoing significant change due to a recent corporate take-over which has lead to a re-thinking of the roles and tasks of the organization at all levels. We draw on an already established framework for analyzing the organizational change process. The analysis results in a set of observations that we use subsequently in the discussion of practical lessons for organizations facing similar challenges.", "num_citations": "7\n", "authors": ["1354"]}
{"title": "Knowing and implementing SPI\n", "abstract": " Knowing and Implementing SPI — Aalborg University's Research Portal Skip to main navigation Skip to search Skip to main content Aalborg University's Research Portal Logo Dansk English Home Profiles Projects Publications Activities Research Units Facilities Press / Media Prizes Datasets Impacts Search by keywords, name or affiliation Knowing and Implementing SPI K. Kautz, Peter Axel Nielsen Department of Computer Science Research output: Contribution to book/anthology/report/conference proceeding › Book chapter › Research Overview Original language English Title of host publication Improving Software Organizations : From Principles to Practice Editors Mathiassen, L. (ed.) : Pries-Heje, J. (ed.) : Ngwenyama,O. (ed.) Place of Publication Boston Publisher Addison-Wesley Publication date 2002 ISBN (Print)", "num_citations": "7\n", "authors": ["1354"]}
{"title": "Information technology at the turn of teh millennium: past, present, and future trends\n", "abstract": " The International Federation for Information Processing (IFIP) has a long history in facilitating interaction among researchers and practitioners, Directions for future investigations are stimulated and set through working group activities and working conferences. Two working groups (WG) that have been active over the last few years are WG 8.2, which has as its scope the development and use of information technologies in organizational contexts and WG 8.6, which is specifically concerned with the diffusion, transfer, and implementation of information technology.", "num_citations": "7\n", "authors": ["1354"]}
{"title": "Objektorienteret design\n", "abstract": " Object-Oriented Design — Aalborg University's Research Portal Skip to main navigation Skip to search Skip to main content Aalborg University's Research Portal Logo Dansk English Home Profiles Projects Publications Activities Research Units Facilities Press / Media Prizes Datasets Impacts Search by keywords, name or affiliation Objektorienteret design Translated title of the contribution : Object-Oriented Design Lars Mathiassen, Andreas Munk-Madsen, Peter A. Nielsen, Jan Stage Department of Computer Science Department of Electronic Systems Research output: Book/Report › Book › Research Overview Translated title of the contribution Object-Oriented Design Original language Danish Place of Publication Aalborg Publisher Marko Publication status Published - 1995 Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Mathiassen, L., Munk-Madsen, A., Nielsen, PA, & Stage, J. (1995). …", "num_citations": "7\n", "authors": ["1354"]}
{"title": "Chaos and creativity in dynamic idea evaluation: Theorizing the organization of problem‐based portfolios\n", "abstract": " Facilitating creativity effectively requires attendance to the complex nature of idea development and the later maturation of the produced ideas. In this theoretical piece, we add something entirely new to the creativity management literature by exploring how the knowledge generated during idea evaluation can facilitate the creation of problem‐based portfolios. We build upon the latest advances in utilizing knowledge from the idea evaluation process to facilitate divergent and convergent production—coined as dynamic idea evaluation (DIE). Using DIE as the theoretical platform, we use chaos theory to explore the complex duality between creative production and the creative negotiation processes in idea evaluation to outline the systemic properties of problem‐based portfolios. We theorize that balancing creative‐sensitive dependency towards convergent and divergent production is vital to understand how people …", "num_citations": "6\n", "authors": ["1354"]}
{"title": "Speed optimization algorithm with routing to minimize fuel consumption under time-dependent travel conditions\n", "abstract": " With increasing interest in reducing fuel consumption and related pollution caused by transportation services, a speed optimization problem that derives speeds of a vehicle given a fixed route to customers has become significant, given that fuel consumption of vehicles is a function of their speeds. Following this interest, we address a speed optimization problem under time-dependent travel conditions. Motivated by the fact that altering the fixed route in response to the time-dependent condition would contribute to minimizing fuel consumption for transportation services, a routing decision is also involved in the problem formulation. To solve this problem, we propose an exact approach with approximation schemes to handle its complexity. Through the experiments, we verify the performance of the proposed approach in terms of finding near-optimal solutions within a short computation time as well as how the routing …", "num_citations": "6\n", "authors": ["1354"]}
{"title": "Virtual Temperature Detection of Semiconductors in a Megawatt Field Converter\n", "abstract": " A converter monitoring unit (CMU) that monitors the power modules of the converter in a multimegawatt test wind turbine is presented in this paper. A method of calculating the virtual temperature (T v ) of the power semiconductors is laid out. Contrary to previous work, the method enables T v  characterization of the semiconductors by means of sampled data during normal operation of the converter, without the need for special calibration routines. The dynamic operation of the wind turbine and the large amount of data sampled in the CMU enables a statistical approach to generate reference data for T v  calculations. The method was tested on machine side converter diodes of the test turbine, based on samples of collector-emitter voltage (vce on ) and current (i c ). Other temperature sensitive electrical parameters may also be used as input to the method. The CMU has been operating for more than a year in the test …", "num_citations": "6\n", "authors": ["1354"]}
{"title": "Intrafirm knowledge transfer of agile software practices: barriers and their relations\n", "abstract": " Agile software practices are widely used in a great variety of organizations, and the shift from traditional plan-driven approaches entails a redefinition of processes in these organizations. Intrafirm knowledge transfer of agile software practices between projects is a key concern in this redefinition. While knowledge transfer is essential for an organization to develop or keep its competitive advantage, it is also both difficult and time consuming, due to a wide range of barriers. Transferring knowledge on agile practices is even more complex due to there being a high degree of tacit knowledge. Research on knowledge of agile practices focuses on adoption of agile practices within a single team, thus extant research lacks focus on intrafirm transfer. Through a case study, this article investigates the intrafirm knowledge transfer of agile practices. With a starting point as the theory of barriers to knowledge transfer, we modify …", "num_citations": "6\n", "authors": ["1354"]}
{"title": "Success factors and motivators in SPI\n", "abstract": " The authors report in this article from a survey of medium-sized and large software companies in Denmark where major variations were found in the practice of software process improvement (SPI). Many software companies intend to do SPI; but few companies invest the necessary effort in improvement, and few perform maturity assessments. In general, across the surveyed companies, the effects of SPI are very limited. The study also found that internal motivators are more frequent than external motivators. This article presents and discusses the survey and the results. It also discusses implications for IT organizations and professionals and recommends:(1) assessing the maturity level;(2) allocating sufficient resources to SPI; and (3) creating a positive feedback loop between SPI benefits and SPI efforts.", "num_citations": "6\n", "authors": ["1354"]}
{"title": "Combining two approaches to object-oriented analysis\n", "abstract": " There has been an immense growth in object-oriented methods to analysis and design. Many of these methods differ only on insignificant points and it is often difficult to deduce what the exact characteristics of the methods are before having tried them out in practice. All the more, there is a need for examining these characteristics and discussing fundamental aspects of object-oriented analysis and design. We believe that one such fundamental discussion is the handling of events in analysing the problem domain.             Coad & Yordon's method, OOA, forcefully models structure in the problem domain. Yet it fails significantly in modelling its dynamics. On the other hand, Jackson's method, JSD, provides an elegant way of modelling the dynamics of objects in the problem domain, but structure is to a large extend ignored. We have developed a new method, OOA&D, which takes the best elements of OOA and of …", "num_citations": "6\n", "authors": ["1354"]}
{"title": "A decision support scheme for beta thalassemia and HbE carrier screening\n", "abstract": " The most effective way to combat β-thalassemias is to prevent the birth of children with thalassemia major. Therefore, a cost-effective screening method is essential to identify β-thalassemia traits (BTT) and differentiate normal individuals from carriers. We considered five hematological parameters to formulate two separate scoring mechanisms, one for BTT detection, and another for joint determination of hemoglobin E (HbE) trait and BTT by employing decision trees, Naïve Bayes classifier, and Artificial neural network frameworks on data collected from the Postgraduate Institute of Medical Education and Research, Chandigarh, India. We validated both the scores on two different data sets and found 100% sensitivity of both the scores with their respective threshold values. The results revealed the specificity of the screening scores to be 79.25% and 91.74% for BTT and 58.62% and 78.03% for the joint score of HbE …", "num_citations": "5\n", "authors": ["1354"]}
{"title": "Networked technologies—The role of networks in the diffusion and adoption of software process improvement (SPI) Approaches\n", "abstract": " Software process improvement (SPI) is a field of research and practice focused on improving the practice of software engineering by frequently introducing new methods and technical tools attuned to the managerial and process-oriented aspects of software development. Social networks play a key role in the adoption and diffusion of software process improvement as a networked technology. This panel addressed actual examples of SPI networks and identified key characteristics of and roles in these emergent networks.", "num_citations": "5\n", "authors": ["1354"]}
{"title": "Local search methods for type I mixed-model two-sided assembly line balancing problems\n", "abstract": " Two-sided assembly lines are widely utilized to assemble large-sized products such as cars and trucks. Recently, these types of assembly lines have been applied to assemble different types of products due to a large variety of customer demands and strong market competition. This paper presents two simple local search methods, the iterated greedy algorithm and iterated local search algorithm, to deal with type I mixed-model two-sided assembly line balancing problems. These two algorithms utilize new precedence-based local search functions with referenced permutation and two neighborhood structures to emphasize intensification while preserving high search speed. Additionally, these local search methods are enhanced by utilizing the best decoding scheme amongst nine candidates and a new station-oriented evaluation to guide the search direction. New lower bound calculations are also presented to …", "num_citations": "4\n", "authors": ["1354"]}
{"title": "Meshing agile and plan-driven development in safety-critical software: a case study\n", "abstract": " Organizations developing safety-critical software are increasingly seeking to create better practices by meshing agile and plan-driven development processes. Significant differences between the agile and the plan-driven processes make meshing difficult, and very little empirical evidence on using agile processes for safety-critical software development exists. There are four areas of concern, in particular, for meshing the development of safety-critical software concerning: documentation, requirements, life cycle and testing. We report on a case study of a pharmaceutical organization in which a Scrum process was implemented to support agile software development in a plan-driven safety-critical project. The purpose was to answer the following research question: For safety-critical software, what can a software team do to mesh agile and plan-driven processes effectively? The main contribution of the paper is an …", "num_citations": "4\n", "authors": ["1354"]}
{"title": "Instance scale, numerical properties and design of metaheuristics: A study for the facility location problem\n", "abstract": " We present an in-depth computational study of two local search metaheuristics for the classical uncapacitated facility location problem. We investigate four problem instance models, studied for the same problem size, for which the two metaheuristics exhibit intriguing and contrasting behaviours. The metaheuristics explored include a local search (LS) algorithm that chooses the best moves in the current neighbourhood, while a randomised local search (RLS) algorithm chooses the first move that does not lead to a worsening. The experimental results indicate that the right choice between these two algorithms depends heavily on the distribution of coefficients within the problem instance. This is also put further into context by finding optimal or near-optimal solutions using a mixed-integer linear programming problem solver.", "num_citations": "4\n", "authors": ["1354"]}
{"title": "The perceived business value of social media at work\n", "abstract": " Social Media is a new phenomenon that impacts businesses, society and individuals. Social media has swept into the business world, disrupting businesses, bringing new opportunities and challenges. The use of social media in organizations has the potential to shape the “future of the work”. Both consultancy reports and scholarly articles highlight and discuss the new opportunities and organizational benefits provided by social media to change the current top-down (ie initiated by management) business model to a more collaborative and bottom-up (ie initiated by employees) approach. Such a model is customizable to specific user needs, empowering employees to design specific workflows thus helping them to work more effectively. Using social media, personal knowledge can be synergized into collective knowledge through social collaborative processes that may facilitate externalization of knowledge, fostering creativity and innovation. All these processes have the potential to lead to knowledge creation through interaction and collaborative processes and thereby increase companies’ competitiveness. However the successful deployment of social media for internal communication and facilitation of knowledge sharing and collaboration in organizations is difficult. Based on quantitative as well as qualitative data from 13 Danish organizations, we investigate the", "num_citations": "4\n", "authors": ["1354"]}
{"title": "Understanding and managing process interaction in IS development projects\n", "abstract": " Software-based information systems must be developed and implemented as a part of business change. This is a major challenge, since business change and the development of software-based information systems usually are performed in separate processes. Thus, there is a need to understand and manage the relationship between these two kinds of processes. In this paper we draw on a longitudinal case study. We suggest a framework to analyze the case as interaction between software development processes and organizational change processes. In the analysis we find that the framework enables us to understand critical events in the case, what led to the events, and what the consequences are. We discuss the implications for information systems research and in particular we discuss the contribution to project management of iterative and incremental software development.", "num_citations": "4\n", "authors": ["1354"]}
{"title": "The MEADOW Guidelines\n", "abstract": " The MEADOW Guidelines propose a measurement framework for collecting and interpreting internationally harmonised data on organisational change and its economic and social impacts for both private and public sector organisations. Reliable harmonised statistics on organisational change would provide the basis for effective benchmarking through the exchange of information on best practices across EU-member states and in this way could contribute directly to the success of European policy initiatives aimed at increasing the fl exibility and adaptability of organisations and employees while simultaneously improving the quality of jobs during economic booms as well as downturns. The MEADOW project (MEAsuring the Dynamics of Organisations and Work) is a European Commission funded Coordinating Action that brought together a multidisciplinary consortium of 14 partners from 9 European countries. The Meadow consortium has been actively supported by a number of key European and international institutions with central responsibilities for data collection and dissemination, including the OECD, EUROSTAT, the European Foundation for the Improvement of Living and Working Conditions, the European Agency for Safety and Health at Work, and DG Employment. MEADOW has been funded by the European Commission under priority 7 (Citizens and Governance) of the 6th RTD Framework Program.", "num_citations": "4\n", "authors": ["1354"]}
{"title": "Competing values in software process improvement: an assumption analysis of CMM from an organizational culture perspective\n", "abstract": " The capability maturity model (CMM) approach to software process improvement is the most dominant paradigm of organizational change that software organizations implement. While some organizations have achieved various levels of success with the CMM, the vast majority have failed. In this paper, we investigate the assumptions about organizational culture embedded in the CMM models and we discuss their implications for software process improvement (SPI) initiatives. In this paper, we utilize the well-known competing values model to surface and analyze the assumptions underlying the CMM. Our analysis reveals contradictory sets of assumptions about organizational culture in the CMM approach. We believe that an understanding of these contradictions can help researchers address some of the difficulties that have been observed in implementing and institutionalizing SPI programs in organizations. Further, this research can help to open up a much-needed line of research that would examine the organization theory assumptions that underpin CMM. This type of research is important if CMM is to evolve as an effective, organizational change paradigm for software organizations.", "num_citations": "4\n", "authors": ["1354"]}
{"title": "The need for a holistic demand planning framework\n", "abstract": " The Need for a Holistic Demand Planning Framework — Aalborg University's Research Portal Skip to main navigation Skip to search Skip to main content Aalborg University's Research Portal Logo Dansk English Home Profiles Projects Publications Activities Research Units Facilities Press / Media Prizes Datasets Impacts Search by keywords, name or affiliation The Need for a Holistic Demand Planning Framework Peter Nielsen, Kenn Steger-Jensen Research output: Contribution to book/anthology/report/conference proceeding › Article in proceeding › Research › peer-review Overview Original language English Title of host publication International Conference on Information Systems, Logistics and Supply Chain Number of pages 10 Volume cd Publisher <Forlag uden navn> Publication date 2006 ISBN (Electronic) 2930294183 Publication status Published - 2006 Event International Conference on Information …", "num_citations": "4\n", "authors": ["1354"]}
{"title": "The Industrial Age, the Knowledge Age, the Internet Age: Improving Software Management\n", "abstract": " Thinking about improving the management of software development in software firms is dominated by one approach: the capability maturity model devised and administered at Carnegie Mellon University. Though widely known and used, there is little convincing research connecting widespread benefits in profitability or improved software products to CMM improvement initiatives. There are also a number of well understood difficulties and limitations with the approach. This article examines, through the lens of modern management theory, the assumptions behind the CMM approach. It characterises these assumptions as belonging to the industrial age. It takes a dialectic approach to propose antithetical assumptions and a configuration approach to weave these different assumptions into alternative assumption platforms: the knowledge age model and the internet age model. These assumptions, we suggest, might …", "num_citations": "4\n", "authors": ["1354"]}
{"title": "Rapid Systems Modelling: The Soul of a New Methodology\n", "abstract": " Rapid Systems Modelling: The Soul of a New Methodology — Aalborg University's Research Portal Skip to main navigation Skip to search Skip to main content Aalborg University's Research Portal Logo Dansk English Home Profiles Projects Publications Activities Research Units Facilities Press / Media Prizes Datasets Impacts Search by keywords, name or affiliation Rapid Systems Modelling: The Soul of a New Methodology Lars Mathiassen, Andreas Munk-Madsen, Peter A. Nielsen, Jan Stage Department of Computer Science Department of Electronic Systems Research output: Book/Report › Book › Research Overview Original language English Place of Publication Aalborg Publisher Aalborg Universitetsforlag Publication status Published - 1991 Series Aalborg Universitetscenter. Institut for Elektroniske Systemer - Rapport Number R 91-16 ISSN 0106-0791 Cite this APA Author BIBTEX Harvard Standard RIS …", "num_citations": "4\n", "authors": ["1354"]}
{"title": "A large-scale customer-facility network model for customer service centre location applications\n", "abstract": " We propose a large-scale sparse customer-facility network model that allows a customer to be assigned only to facilities within the vicinity of a customer. In this model, customer-facility distances are integer values representing zones. Experimental results are presented for large instances with up to 100,000 customers and 100 potential facility sites. A mixed-integer linear programming solver reveals large gaps in suboptimal solutions and lower bounds provided, even with a considerable computational effort. Two simple but scalable local search heuristics are computationally investigated, revealing their potential for solving such large-scale problems in practice.", "num_citations": "3\n", "authors": ["1354"]}
{"title": "Comparison of path planning algorithms for an unmanned aerial vehicle deployment under threats\n", "abstract": " Following the massive interests in unmanned aerial vehicles (UAVs), various optimization algorithms have been proposed for a path planning problem that allow the units to navigate in a region filled with threats such as a radar detection in air defence systems. Among the algorithms, we address Dijkstra’s algorithm and a heuristic algorithm for the path planning of a UAV. The algorithms are compared under various configurations of a region to navigate with respect to the optimality and the computational complexity of the algorithms.", "num_citations": "3\n", "authors": ["1354"]}
{"title": "Competence-driven employee substitutability planning robust to unexpected staff absenteeism\n", "abstract": " In order to deal with unexpected events such as employee absenteeism and/or a demand for personnel that is higher or lower than expected, organizations need to adopt proactive and reactive scheduling strategies to protect the personnel roster and to respond to this operational variability, respectively. In this paper, we propose a preemptive programming approach to construct a personnel shift roster that maximizes the employee substitutability. A proactive approach builds in a certain degree of robustness in the original roster. This built-in robustness improves both the absorption and adjustment capability of the original roster during the operational allocation phase when unexpected events occur. With a view to developing a DSS-driven method dedicated to competence allocation planning robust to unexpected staff absenteeism, we present a methodology, based on constraints programming and robust …", "num_citations": "3\n", "authors": ["1354"]}
{"title": "Milk-run routing and scheduling subject to different pick-up/delivery profiles and congestion-avoidance constraints\n", "abstract": " Two kinds of intertwined decisions: the routing decisions, which determine the set of sequences of stations visited by each tugger train’s route, and the scheduling decisions, which plan congestion-free movements of tugger train fleets, are considered. The problem under study can be seen as extension of the pick-up and delivery problem with time windows in which different profiles of separately executed delivery and pick-up operations are assumed. The NP-hard character of the problem considered follows from its roots derived from the vehicle routing and the deadlock-avoidance problems. In this regard, a constraint programming paradigm allowing the further integration of multi-period, multi-trip and multi-commodity flows with various customers’ demands as well as distribution network topology constraints is applied. Consequently, a recursive formulation of a well-known constraint satisfaction problem is …", "num_citations": "3\n", "authors": ["1354"]}
{"title": "Converter monitoring in a wind turbine application\n", "abstract": " Two Converter Monitoring Units (CMU) which were retrofitted in a multi Mega Watt wind turbine converter are presented. Synchronized sampling of semiconductor voltage (vceon) and semiconductor current (ic) enables the condition monitoring of the power modules. A vceon measurement circuitry for field operation is presented. A novel method of numerical integration of Rogowski coil voltage enables current sensing. Data from a whole year of operation show that the presented methods are consistent throughout long term operation, and that both the measurement principles and reference functions (model) are consistent during long time operation. It is thus expected that degradation of power modules and gate drives can be monitored.", "num_citations": "3\n", "authors": ["1354"]}
{"title": "Agility in Development of Safety-Critical Software: A Conceptual Model\n", "abstract": " Safety-critical information systems are being used increasingly as we see applications in new areas such as personal medical devices, traffic control and detection of pathogens. A current research debate is whether safety-critical systems must be developed with traditional waterfall processes or agile processes which are faster and will lead to better products. In this paper we review the diverse research literature on agility in safety-critical software development. There are key propositions that we pull from the literature and combine into a framework for understanding the foundational challenges and the contingencies of agile development of safety-critical software. The framework consists of four problematic practice areas (which the literature mainly has focused on) and five relationships, which we suggest is even more important than the problematic areas. From this review we suggest that there are important research gaps that need to be investigated. We suggest that future research should have a primary focus on the relationships: 1) on the dynamics of the whole field, 2) on incremental versus iterative development and 3) on how to create value with minimal but sufficient effort.", "num_citations": "3\n", "authors": ["1354"]}
{"title": "Multimodal Processes Cyclic Steady States Scheduling\n", "abstract": " This paper describes a multimodal transportation network (MTN) in which several unimodal networks (AGVs, hoists, lifts, suspended monorail systems, etc.) interact each other via common shared workstations as to provide a variety of demand-responsive workpiece transportation/handling services. The set of transport modes provides connection support for production flows treated as agents trying to realize their origin-destination routes in the MTN. The aim is to provide a declarative model enabling to state a constraint satisfaction problem aimed at multimodal transportation processes (MTP) scheduling, while servicing production flows. In other words, assuming a given topology of MTN, the main objective is to provide the declarative modeling framework enabling to refine conditions guaranteeing the MTP cyclic steady states reachability.", "num_citations": "3\n", "authors": ["1354"]}
{"title": "Order quantity distributions in make-to-order manufacturing: At what level of aggregation do they respect standard assumptions?\n", "abstract": " This paper presents both an analytical and a numerical investigation into the order quantities received by a company in the form of customer orders. A discussion of assumptions regarding the behavior of demand in the form of customer orders from various perspectives within manufacturing planning and control with a special emphasis on the make-to-order environment is presented. A methodological framework for analyzing the behavior of orders and investigate the validity of the assumptions is given. Furthermore, an analytical approach to identify the horizon needed for aggregating orders to achieve a stable demand is developed and tested on data from a real case.", "num_citations": "3\n", "authors": ["1354"]}
{"title": "Decision support for multi-criteria project portfolio evaluation\n", "abstract": " Decision makers, when choosing the right project portfolio, face the problem of making an optimal decision that meets an organization‟ s objectives and priorities in uncertain situations, under a given set of constraints with various sources of knowledge. The complexity of the problem implies a necessity to decompose it into sub-problems. Task decomposition into sub-problems facilitates formulating a problem as Fuzzy Constraint Satisfaction Problem (FCSP). The fuzzy model of project portfolio evaluation can be implemented by using constraints programming (CP) techniques as a decision support system used by production managers. In that context our goal is to provide a CP-based approach facilitating both fast generation of project portfolio variant and a multi criterion evaluation of choice decision on the basis of expert‟ s knowledge, included directly in the decision system.", "num_citations": "3\n", "authors": ["1354"]}
{"title": "Demand planning & control–Handling multiple perspectives through a holistic approach to hierarchical planning\n", "abstract": " Hierarchical Demand Planning (HDP) is an intricate part of most companies today. HDP is based on the assumption of independence among variables, and this allows for simple and easy aggregation and separation of plans and data. However, the most commonly used arguments for grouping and subsequent aggregating is shared traits contrary to the assumption of independency. One of the predominant issues is the conflicting objectives on different decision levels. An example of this is found in hierarchical forecasting of demand. When forecasting on e.g. a product family level to establish capacity requirements, the objective is usually to achieve a Mean Error (ME) of zero. This conflicts with forecasting for Demand Planning (DP) purposes on SKU level, where minimization of the Standard Deviation of Error (SDE) might be more important. In this paper these issues are addressed through a simple example of …", "num_citations": "3\n", "authors": ["1354"]}
{"title": "Renovering af bygninger med skimmelsvampevækst\n", "abstract": " Skimmelsvampe i bygninger kan være sundhedsskadelige for brugerne og ødelæggende for bygningen, og skal derfor fjernes. Anvisningen beskriver, hvordan man planlægger og gennemfører en renovering af bygninger angrebet af skimmelsvampe, samt hvilke midler og meoder, der findes til at fjerne skimmelsvampevækst fra materialer, konstruktioner og inventar i en bygning, der er angrebet af skimmelsvampe.", "num_citations": "3\n", "authors": ["1354"]}
{"title": "The Meeting of Processes\n", "abstract": " The Meeting of Processes — Aalborg University's Research Portal Skip to main navigation Skip to search Skip to main content Aalborg University's Research Portal Logo Dansk English Home Profiles Projects Publications Activities Research Units Facilities Press / Media Prizes Datasets Impacts Search by keywords, name or affiliation The Meeting of Processes P. Bygstad, Peter Axel Nielsen Department of Computer Science Research output: Contribution to book/anthology/report/conference proceeding › Article in proceeding › Research Overview Original language English Title of host publication Proceedings of the 26th IRIS, Helsinki, Finland, August 2003 Publication date 2003 Publication status Published - 2003 Event The Meeting of Processes - Duration: 19 May 2010 → … Conference Conference The Meeting of Processes Period 19/05/2010 → … Cite this APA Author BIBTEX Harvard Standard RIS Vancouver …", "num_citations": "3\n", "authors": ["1354"]}
{"title": "Problematizing in IS Design Research\n", "abstract": " This paper is based on the interest to see how problems are addressed in information systems design research. Problems addressed by design research are often implicit, sometimes open, and sometimes even underdeveloped. Problem-solving processes, action research and in a broader sense, engaged scholarship all encompass the explicit addressing of problems and investigation problem situations. Such a problem-orientation is to a lesser degree part of design research. In this paper, we will investigate how we can provide a better understanding of problematizing in design research; and in particular what we may learn from other approaches with a stronger problem-orientation.", "num_citations": "2\n", "authors": ["1354"]}
{"title": "Optimisation of cost efficient robotic assembly line using metaheuristic algorithms\n", "abstract": " Robotic assembly lines (RALs) are utilised due to the flexibility it provides to the overall production system. Industries mainly focus on reducing the operation costs involved. From the literature survey it can be seen that only few research has been reported in the area of cost related optimisation in RALs. This paper focuses on proposing a new model in RALs with the main objective of maximising line efficiency by minimising total assembly line cost. The proposed model can be used production managers to balance a RAL in an efficient manner. Since simple assembly line balancing problem is classified as NP-hard, proposed problem due to additional constraints also falls under the same category. Particle swarm optimisation (PSO) and differential evolution (DE) are applied as the optimisation tool to solve this problem. The performances of this proposed algorithm are tested on a set of reported benchmark problems …", "num_citations": "2\n", "authors": ["1354"]}
{"title": "A Design of a Scheduling System for an Unmanned Aerial Vehicle (UAV) Deployment\n", "abstract": " Deriving a detailed schedule for an unmanned aerial vehicle (UAV) deployment involves a wide range of scheduling problems, where solving them as a whole is intractable. Moreover, uncertainties in operational environments of the UAV deployment bring a gap between models assumed for the scheduling problems and an actual system. Motivated by the facts, we propose a conceptual design of a scheduling system for a UAV deployment. Specifically we first introduce fundamental scheduling problems for UAV deployments and specify dependencies between them. A design for a scheduling system, which sequentially solves the scheduling problems and evaluates the solutions using a simulation model, is then proposed. Finally, a prototype of the scheduling system implemented to demonstrate the feasibility of the design is described.", "num_citations": "2\n", "authors": ["1354"]}
{"title": "Agility for ux and development: A case study\n", "abstract": " Agility characterizes practices, such as Scrum, that help a software team or organization deal with change. However, what may help a software developer to be agile may not help a user experience (UX) consultant to be agile in the same way and vice versa. Against this backdrop, we present a case study of how particular practices of integrating UX activities with agile development contribute to agility in a Danish software company. We use a theoretical framework that defines agility to analyze interviews conducted with UX professionals, developers, and managers in the company. The analysis shows how integrations of UX into agile development by upfront-design and work-inparallel increase the agility differently for developers and UX consultants.", "num_citations": "2\n", "authors": ["1354"]}
{"title": "UX in Agile before and during development\n", "abstract": " Agile project management processes (Agile) such as Scrum, DSDM, XP and Kanban, have become a de facto standard for software development practice. The context of Agile strongly affects the possibilities of IT professionals to conduct UX activities in their software development.", "num_citations": "2\n", "authors": ["1354"]}
{"title": "Towards a design theory for collaborative qualitative data analysis\n", "abstract": " Towards a Design Theory for Collaborative Qualitative Data Analysis — Aalborg University's Research Portal Skip to main navigation Skip to search Skip to main content Aalborg University's Research Portal Logo Dansk English Home Profiles Projects Publications Activities Research Units Facilities Press / Media Prizes Datasets Impacts Search by keywords, name or affiliation Towards a Design Theory for Collaborative Qualitative Data Analysis Peter Axel Nielsen Department of Computer Science Research output: Contribution to book/anthology/report/conference proceeding › Article in proceeding › Research › peer-review Overview Abstract This position paper addresses how to develop a design theory to support the collaborative practice of qualitative data analysis. Qualitative researchers face several challenges in making sense of their empirical data and IS-support for this practice can be found in software …", "num_citations": "2\n", "authors": ["1354"]}
{"title": "Business-case metode for kommunale IT-investeringer, version 2.0\n", "abstract": " Forord En IT-business-case er et værktøj, der kan bruges til at sikre velovervejede og gennemarbejdede grundlag for IT-investeringsbeslutninger. IT-business-cases har i forskellige former vundet indpas i kommunal, statslig og privat regi i både ind-og udland. I DISIMIT forskningsprojektet [1] har vi udviklet en metode til udarbejdelse af business-cases for IT-investeringer i danske kommuner. Metoden er dels udviklet på baggrund af diskussioner i temaet “IT fra omkostning til værdiskabelse”, hvor vi har gennemgået business-cases fra Aalborg Kommune, Favrskov Kommune og Gentofte Kommune samt gennemgået de forskellige tilgange herunder også hvordan KMD A/S og Rambøll Management Consulting A/S anvender business-cases. Metoden er dels udviklet på baggrund af praktisk viden og dels forskning fra ind-og udland. Den er udviklet til små og mellemstore kommunale IT-investeringer.I denne metode ser vi primært en business-case som et centralt dokument i realisering af gevinster. Vi ser derfor en IT-investering som noget, der tages beslutning om i starten af et projekt, men en business-case er i lige så høj grad en aftale, der løbende skal laves opfølgning på, og som ofte skal ændres undervejs, når nogle af forudsætningerne ændrer sig. Business-casen er dermed en dokumenteret, men også en dynamisk, aftale mellem lederne af de kommunale virkeområder berørt af IT-investeringen og IT-implementeringens ledelse.", "num_citations": "2\n", "authors": ["1354"]}
{"title": "Knowledge management in software development\n", "abstract": " “The mere existence of knowledge somewhere in the organization is of little benefit; it becomes a valuable cooperate asset only if it is accessible, and its value increases with the level of accessibility.”(Davenport and Prusak, 1998, p. 18) iii", "num_citations": "2\n", "authors": ["1354"]}
{"title": "Process-centric IT in practice: mobilizing IT through business process management\n", "abstract": " This case illustrates and discusses the issues and challenges at Kerrtec Corporation and their effort to establish process-centric IT management. The case describes how one of the company’s employees was tasked with implementing a streamlined sales process, which heavily depended on the supporting IT systems. The paper describes how the implementation project provided directions for improving global competencies to work across boundaries between business and IT in order to successfully manage business processes. The case emphasizes the importance of IT in process management, but at the same time highlights the organizational challenges faced by companies willing to supply their process initiatives with the right blend of IT and business process expertise. Specifically, it discusses the transcendent nature of IT competencies in business process management projects and positions them against …", "num_citations": "2\n", "authors": ["1354"]}
{"title": "Collaborative coding of qualitative data\n", "abstract": " The purpose of this white paper is to explore how software applications can support the process in empirical research known as qualitative data analysis and in particular how these applications can support the collaborative process of coding qualitative, empirical data. This white paper explain the coding process, the collaborative coding process and then evaluates a prominent set of applications, namely NVivo, Atlas. ti, HyperResearch, Dedoose and to a lesser degree. The specific features of these applications are compared, contrasted and evaluated. It is concluded that the older tools NVivo, Atlas. ti and HyperResearch each have useful features to support individuals coding; but also that they are insufficient to support collaborative coding. Dedoose on the other hand is fully and transparently collaborative while it does not posses the many features to analyse the coding and it particularly does not easily relate codes to each other in a structure (hierarchical or network). The white paper ends with a decision structure to support the selection of an application to match a particular research set-up. The decision structure takes into account the trade-offs between functionality and ease of learning.", "num_citations": "2\n", "authors": ["1354"]}
{"title": "Pneumographic imaging of potential cleavage planes within the ventricular myocardium in histology and computed tomography\n", "abstract": " We distended the relaxed porcine left ventricular myocardium by inflating the coronary arteries with compressed air, using rising pressures between 1 and 3 atmospheres. Computed tomographic analysis revealed a feathered arrangement of the myocardium aggregated together within the walls, with an overall system of spatially netted lamellar structures. Histological examination in orthogonal planes revealed the lamellas themselves to be made up of endless chains of myocytes, which show the well recognised systematic change in helical angle when traced through the thickness of the walls. The pneumatic distension had opened clefts between the lamellas, with sparse and loosely aligned fibrous tissue present within the clefts. The lamellar structure itself is continuous through the walls via a system of interlamellar connections from epicardium to endocardium, and from the ventricular base to the apex. The ventricular walls, therefore, which appear compact when sectioned without pneumatic distension, are shown by distension to be composed of a system of three-dimensionally curved and nested blades, with the individual blades taking their origin from a central circular myocardial collar, Krehls Triebwerkzeug, and then extending with opposing curvatures towards the endocardium and epicardium.© 2011 Bull. Georg. Natl. Acad. Sci.", "num_citations": "2\n", "authors": ["1354"]}
{"title": "Scandinavian Information Systems Research: First Scandinavian Conference on Information Systems, SCIS 2010, Rebild, Denmark, August 20-22, 2010, Proceedings\n", "abstract": " The First Scandinavian Conference on Information Systems (SCIS 2010) took place during August 20–22, 2010 in Rebild, Denmark. The conference was held in conjunction with the traditional IRIS seminar for information systems research in Scandinavia. The IRIS seminar has a long-standing recognition for furthering information systems research. The objective of SCIS 2010 was to extend and formalize a part of the seminar to a full conference. The purpose of the conference was to exchange and publish high-quality research with a particular view on the Scandinavian research community. The theme of the conference was “Engaged Scandinavian Information Systems Research.” Scandinavian information systems research has for several decades been concerned with its relevance for practitioners of the field, for users, for industry, and for society at large. This concern for the usefulness outside the realms of research has shaped the Scandinavian researchers’ awareness, attention, research conduct, and most importantly a focus on who we interact with on which issues, why we do this, and for whom we do it.", "num_citations": "2\n", "authors": ["1354"]}
{"title": "Klassekampens nye klæder\n", "abstract": " Klassekampens nye klæder — Roskilde University Research Portal Skip to main navigation Skip to search Skip to main content Roskilde University Research Portal Logo Dansk English Home Profiles Research Units Research Output Projects Activities Press / Media Prizes Klassekampens nye klæder Peter Nielsen Research output: Contribution to journal › Contribution to newspaper - Newspaper article › Communication Overview Original language Danish Journal Information Pages (from-to) 20 Number of pages 1 ISSN 1602-2572 Publication status Published - 4 Jun 2010 Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Nielsen, P. (2010). Klassekampens nye klæder. Information, 20. Nielsen, Peter. / Klassekampens nye klæder. In: Information. 2010 ; pp. 20. Nielsen, P 2010, 'Klassekampens nye klæder', Information, pp. 20. Klassekampens nye klæder. / Nielsen, Peter. In: Information, 04.06.2010, p. …", "num_citations": "2\n", "authors": ["1354"]}
{"title": "Implementation of electronic whiteboards at two emergency\n", "abstract": " We report from a case study of the implementation of an electronic whiteboard system at two emergency departments at Danish hospitals. The purpose of such whiteboards is to support the clinicians in maintaining an overview of the patients at the department. The electronic whiteboard system was designed in collaboration with clinicians from the departments, present more information, and allow some automated updating, as compared to the existing dry-erase whiteboard. Based on observations supported by interviews we describe the implementation of the whiteboard at the two emergency departments, the improvisational process following the implementation, and the use and reconfiguration of the system and work practices by the clinicians.", "num_citations": "2\n", "authors": ["1354"]}
{"title": "IT-ledelsesmæssige udfordringer i 12 kommuner: resultat af interviewrunde i foråret 2009\n", "abstract": " Kræmmergaard, P., Nielsen, PA, Pedersen, K., Agger Nielsen, J., Persson, JS, Hansen, AM, & Hansen, LK (2010). It-ledelsesmæssige udfordringer i 12 kommuner: resultat af interviewrunde i foråret 2009. Center for IT-ledelse, Aalborg Universitet. http://www. epa. aau. dk/fileadmin/user_upload/mst/Den_kvalitative_rapport. pdf", "num_citations": "2\n", "authors": ["1354"]}
{"title": "Actors’ Competencies or Methods? A Case Study of Successful Information Systems Development\n", "abstract": " Research on information systems development methods has by and large acknowledged a significant difference between a method and its use and that the use depends on the situation and the developers, as well as other contingencies. We extend this research and focus in particular on the relationship between actors’ competencies and their deployment of methods, arguing that this relationship is described over-simplistically and needs a better explanation. Through a case study of a successful information systems development project we identify some central situations where a variety of competencies and methods are exercised. Emphasising the intertwining of competencies and methods, we discuss the character of the intertwining process, how different actors relate to different methods, and how methods may be part of the problem rather than part of the solution to challenges in information systems development. The paper suggests elements for a new model for explaining actors’ competencies and their use of methods.", "num_citations": "2\n", "authors": ["1354"]}
{"title": "The Role of improvisation in adoption of process technology in a small software firm\n", "abstract": " Software process improvement (SPI) has become an increasingly important technology for software firms struggling to stay competitive. The Capability Maturity Model (CMM)(Paulk et al. 1993) and the more recent CMM Integrated (CMMI Production Team 2000; 2002) have sparked a new discipline of engineering management that plays a dominating role in practice and research (Hansen et al. 2004). The CMMs are based on the ideal of a rational, control-centered culture for software development (Ngwenyama and Nielsen 2003), and although other SPI approaches have been suggested, they do not differ from the CMMs when it comes to underlying values (Hansen et al. 2004). While the literature offers a number of successful cases of adopting CMM (Carnegie Mellon 2005; Dion 1992; Humphrey et al. 1991; Wohlwend and Rosenbaum 1994), reports on failure and difficulties have lately increased (Hansen et al. 2004 Mathiassen et al. 2002; Rodenbach et al. 2000). Especially within small software firms, adoption of SPI technology seems problematic since these organizations lack sufficient resources to invest in improvements (Brodman and Johnson 1994; Brouse and Buys 1999; Steel 2004; Villalon et al. 2002), and SPI knowledge is not sufficiently tailored to their needs (Kilpi 1998; Saastamoinen and Tukiainen 2004). Small software firms are highly sensitive to dynamic environments (Ward et al. 2001), and dominating approaches to SPI fit poorly (Leung and", "num_citations": "2\n", "authors": ["1354"]}
{"title": "KiWi Vision: Kiwi project deliverable D8. 5\n", "abstract": " This deliverable describes the common vision of the KiWi project, ranging from motivation over use cases and usage scenarios to user interaction, system architecture and technologies, and the research that is performed as part of the project. The deliverable is intended for a wide audience to give and overview over the project. Parts are deliberately written in journalistic, non-technical style to allow reuse in other dissemination material", "num_citations": "2\n", "authors": ["1354"]}
{"title": "Software Process Improvement Using Light Knowledge Tools\n", "abstract": " Since the mid 1990’s several organizations have invested heavily in off-the-shelf knowledge management systems. The considerable interest in tool support for knowledge management in organizations has led to several reports on unsuccessful implementations of such software systems. Schultze and Boland (2000) report success rates as low as 30% caused by technologists’ lack of ability to understand the work practices of knowledge workers. This has also been supported by others' research (Alavi and Leidner 1999; Swan et al. 1999).In software engineering a common example is that of the experience factory (Basili et al. 1994; Basili and Green 1994; Rus and Lindvall 2002). The idea of the experience factory is to capture, explicate, and disseminate information and knowledge within the software organization. The experience factory’s knowledge base is managed by a team of people in charge of collecting, storing and updating information in a database. Knowledge management is taken to be concerned with what should be stored in the database and how the data in the base should be searched (Althoff et al. 2000; Conradi and Dingsøyr 2000; Lindvall et al. 2001). There is, however, a scarcity of reports on successful implementations of the experience factory. Desouza (2003) provides three reasons for this, of which the most significant is that knowledge cannot be sufficiently captured and categorized in existing knowledge management systems and a literature review shows that most research on knowledge management in software process improvement conclude how difficult it is", "num_citations": "2\n", "authors": ["1354"]}
{"title": "Coordination Mechanisms in Ephemeral Organisations\n", "abstract": " Coordination Mechanisms in Ephemeral Organisations — Aalborg University's Research Portal Skip to main navigation Skip to search Skip to main content Aalborg University's Research Portal Logo Dansk English Home Profiles Projects Publications Activities Research Units Facilities Press / Media Prizes Datasets Impacts Search by keywords, name or affiliation Coordination Mechanisms in Ephemeral Organisations Steffen Herskind, Peter A. Nielsen Department of Electronic Systems Research output: Contribution to book/anthology/report/conference proceeding › Article in proceeding › Research Overview Original language English Title of host publication Proceedings of the 3rd International Conference on the Design of Cooperative Systems, INRIA, Sophia Antipolis, France, 1998 Editors Darses, F. : Zaraté, P. (eds.) Publication date 1998 Publication status Published - 1998 Event Coordination Mechanisms in …", "num_citations": "2\n", "authors": ["1354"]}
{"title": "The Concept of Contradiction in Soft Systems Practice—An Illustration\n", "abstract": " Basically, this chapter addresses the question of whether the explicit thinking in contradictions can be a useful supplement to Soft Systems Methodology (Checkland, 1981). The idea is by Mathiassen who examines system concepts and their implications and limitations (Mathiassen, 1987) by a comparison with the dialectics of Israel (1979). A more detailed version of the arguments in this chapter is given in Nielsen (1988).", "num_citations": "2\n", "authors": ["1354"]}
{"title": "E-Paper\n", "abstract": " Mengenstaffel ab 103. 000 mm 5% ab 105. 000 mm 10% ab 110. 000 mm 15% ab 120. 000 mm 20% ab 130. 000 mm 21% ab 140. 000 mm 22% ab 160. 000 mm 23% ab 180. 000 mm 24% ab 100.000 mm 25%", "num_citations": "2\n", "authors": ["1354"]}
{"title": "Soundwalking Homes in Design Ethnography\n", "abstract": " Soundwalking Homes in Design Ethnography — Aalborg University's Research Portal Skip to main navigation Skip to search Skip to main content Aalborg University's Research Portal Logo Dansk English Home Profiles Projects Publications Activities Research Units Facilities Press / Media Prizes Datasets Impacts Search by keywords, name or affiliation Soundwalking Homes in Design Ethnography Stine Schmieg Johansen, Peter Axel Nielsen Department of Computer Science The Technical Faculty of IT and Design Human-Centered Computing Research output: Contribution to journal › Journal article › Research › peer-review Overview Original language English Journal Journal of Sonic Studies Publication status Published - 2021 Access to Document https://www.researchcatalogue.net/view/1243322/1243323 Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Johansen, SS, & Nielsen, PA (2021). …", "num_citations": "1\n", "authors": ["1354"]}
{"title": "Designing for domestic sound zone interaction\n", "abstract": " Sound zone technology has been actively developed for more than two decades with a promise to provide users with personal sound without wearing headphones. In this paper, we build on this development from the perspective of interaction design in two ways. First, we explore the relation between sound zones and the acoustic environment, referred to as a soundscape, through a theoretical exploration of related research in both areas. Second, we present eight interaction design challenges resulting from this. Four different interaction approaches to potentially take on the challenges are sketched and discussed in a workshop and collecting qualitative data from the process. These approaches include tangible representation, light projections, familiar objects, and handheld devices. We group the approaches as visual displays, and user-centred and sound zone-centred interfaces. Overall, our research …", "num_citations": "1\n", "authors": ["1354"]}
{"title": "Reinforcement Learning for Resource Constrained Project Scheduling Problem with Activity Iterations and Crashing\n", "abstract": " Resource allocation is a key decision-making process in project management that assigns resources to activities of a project and determines the timing of the allocation in a cost and time effective manner. In this research, we address the resource allocation for a project, where iterations between activities of the project exist and the crashing, a method to shorten the duration of an activity by incorporating additional resources, is available. Considering the stochastic nature of project execution, we formulate the resource allocation as a Markov decision process and seek the best resource allocation policy using a deep reinforcement learning algorithm. The feasibility and performance of applying the algorithm to the resource allocation is then investigated by comparison with heuristic rules.", "num_citations": "1\n", "authors": ["1354"]}
{"title": "Panel 4: A Nordic Sociotechnical Perspective on Artificial Intelligence Phenomena\n", "abstract": " Recent advancements on artificial intelligence (AI) technologies have resurfaced utopian and dystopian narratives on the future of work. The uniqueness of the AI technologies is their potential to supplement, substitute and amplify practically all tasks currently performed by humans. Hence, they hold the potential to rapidly reshape the nature of work and our economies (Frank et al., 2019).“How?” is the question. Optimists focus on its technological possibilities and postulate that AI will free humans from boring, repetitive tasks-allowing the creation of higher quality jobs-and emphasize new opportunities for organizations to create a competitive advantage. Skeptics, on the other side, highlight the possibility of increased unemployment or work degradation as human deskilling occurs due to an increased degree of decision and knowledge work delegation.", "num_citations": "1\n", "authors": ["1354"]}
{"title": "Signs of Value in an IS Business Case\n", "abstract": " A business case is a formal investment document with a structured overview of relevant information that provides a rationale and justification of an investment. Business cases have become popular as part of managing value creation in information systems (IS) projects. Nevertheless, business cases are often poorly communicating the rationale and justification of the value to be gained from IS investments. Against this backdrop, we investigate how an IS business case can communicate well when seen through the lens of semiotics. Semiotics is the study of how meaning is generated and interpreted through signs. In this paper, we use semiotics to analyze an IS business case on the digitization of diplomas at a Danish University. Our analysis shows that its (1) addresser and addressee should be explicitly and implicitly identifiable;(2) self-referentiality helps set the context and allow uncertainties in the message;(3) a template instigates the medium and codes for value. We discuss the contribution of our findings to research on IS business cases.", "num_citations": "1\n", "authors": ["1354"]}
{"title": "Interaction design for domestic sound zones\n", "abstract": " Sound zone systems have actively been developed for more than two decades. Building on this, we explore four different interaction design approaches for domestic sound zone systems: Tangible representation, light projection, familiar objects, and handhelds. These four approaches were conceived through a scenario-based workshop with HCI and IS experts responding to the functional challenges, opportunities, and requirements of interactive sound zones. The work presented in this paper contributes to development of interaction design for sound zone systems which is an essential parallel to the technical development.", "num_citations": "1\n", "authors": ["1354"]}
{"title": "Model of decision support for the configuration of manufacturing system\n", "abstract": " Manufacturing enterprises today have to face the volatility of markets, characterized by a decreasing production volume and an increasing number of product variants to meet customer expectations. Traditional dedicated manufacturing lines (DML) have been replaced by flexible manufacturing systems (FMS) and, recently, by the systems that combine features of DML and FMS, i.e., by reconfigurable manufacturing systems (RMS). Appropriate manufacturing support and optimization systems for FMS and RMS will advance the quality and effectiveness of reconfigurable manufacturing. This paper proposes an original mixed integer linear programming (MILP) model for decision support in configuration and reconfiguration of the manufacturing system. The modeled problem is a certain development of the known machine loading problem MLP. In this approach, we generate a highly parameterized model based on a set …", "num_citations": "1\n", "authors": ["1354"]}
{"title": "Noise and Vibration Mitigation for Rail Transportation Systems: Proceedings of the 11th International Workshop on Railway Noise, Uddevalla, Sweden, 9–13 September 2013\n", "abstract": " The book reports on the 11th International Workshop on Railway Noise, held on 9–13 September, 2013, in Uddevalla, Sweden. The event, which was jointly organized by the Competence Centre Chalmers Railway Mechanics (CHARMEC) and the Departments of Applied Mechanics and Applied Acoustics at Chalmers University of Technology in Gothenburg, Sweden, covered a broad range of topics in the field of railway noise and vibration, including: prospects, legal regulations and perceptions; wheel and rail noise; prediction, measurements and monitoring; ground-borne vibration; squeal noise and structure-borne noise; and aerodynamic noise generated by high-speed trains. Further topics included: resilient track forms; grinding, corrugation and roughness; and interior noise and sound barriers. This book, which consists of a collection of peer-reviewed papers originally submitted to the workshop, not only provides readers with an overview of the latest developments in the field, but also offers scientists and engineers essential support in their daily efforts to identify, understand and solve a number of problems related to railway noise and vibration, and to achieve their ultimate goal of reducing the environmental impact of railway systems.", "num_citations": "1\n", "authors": ["1354"]}
{"title": "Social business; motivation and knowledge sharing through social media within organizations\n", "abstract": " Traditional knowledge management through a centralized repository framework has been the prominent approach to knowledge sharing in organizations. The advent of social media is, however, reshaping the concept of knowledge management in organizations and more and more companies deploy ‘social business’ communication strategies. Through a case study approach, the study investigates employee motivation and which factors affect employees’ knowledge sharing through social media in their working environment. The case study is based on both qualitative and quantitative data collection. The research was conducted in a number of Danish organizations, from different industry sectors. In total 114 employees participated in an online survey and eight interviews were conducted. The study reviews literature concerning knowledge management and social media and how it can support knowledge sharing internally in organizations. Based on previous studies it is assumed that individual, organizational and technological factors affect employees knowledge sharing. The study shows that organizational factors have the strongest influence on employees’ knowledge sharing followed by individual factors. The technological factors do not seem to affect employees’ knowledge sharing as much as previously, but it is the influence from the combination of the individual and organizational factors, which determine whether an employee decides to adopt social media platforms for knowledge sharing. A key finding in the study is that employees do not hoard knowledge as much as previously due to they find it more beneficial to share knowledge …", "num_citations": "1\n", "authors": ["1354"]}
{"title": "Practical considerations about error analysis for discrete event simulations model\n", "abstract": " The purpose of making efficient and flexible manufacturing systems is often related to the possibility to analyze the system considering at the same time a wide number of parameters and their interactions. Simulation models are proved to be useful to support and drive company management in improving the performances of production and logistic systems. However, to achieve the expected results, a detailed model of the production and logistic system is needed as well as a structured error analysis to guarantee results reliability. The aim of this paper is to give some practical guide lines in order to drive the error analysis for discrete event stochastic simulation model that are widely used to study production and logistic system.", "num_citations": "1\n", "authors": ["1354"]}
{"title": "Det kommunale Digitaliseringslandskab 2012-status og udfordringer: resultater fra kvantitativ undersøgelse blandt kommunale it-chefer i Danmark\n", "abstract": " Det kommunale Digitaliseringslandskab 2012 - status og udfordringer: resultater fra kvantitativ undersøgelse blandt kommunale it-chefer i Danmark — Aalborg University's Research Portal Skip to main navigation Skip to search Skip to main content Aalborg University's Research Portal Logo Dansk English Home Profiles Projects Publications Activities Research Units Facilities Press / Media Prizes Datasets Impacts Search by keywords, name or affiliation Det kommunale Digitaliseringslandskab 2012 - status og udfordringer: resultater fra kvantitativ undersøgelse blandt kommunale it-chefer i Danmark Pernille Kræmmergaard, Peter Axel Nielsen Centre for Information Systems Management The Faculty of Social Sciences Department of Computer Science Research output: Book/Report › Report › Communication Overview Projects (1) Original language Danish Publisher Aalborg Universitet Number of pages 22 …", "num_citations": "1\n", "authors": ["1354"]}
{"title": "Decision Support for Multi-Criteria Project Portfolio Evaluation\n", "abstract": " Decision Support for Multi-Criteria Project Portfolio Evaluation — Aalborg University's Research Portal Skip to main navigation Skip to search Skip to main content Aalborg University's Research Portal Logo Dansk English Home Profiles Projects Publications Activities Research Units Facilities Press / Media Prizes Datasets Impacts Search by keywords, name or affiliation Decision Support for Multi-Criteria Project Portfolio Evaluation Izabela Ewa Nielsen, Peter Nielsen, Vinh Quang Dang Operations Research Logistics and Supply Chain Management Research output: Contribution to journal › Journal article › Research › peer-review Overview Original language English Journal Journal of Operations and Logistics: An international journal Volume 4 Issue number 2 ISSN 2031-9743 Publication status Published - 2012 Access to Document Abstract Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Nielsen, IE…", "num_citations": "1\n", "authors": ["1354"]}
{"title": "IT Management for Transforming Local Government–a Danish Collaborative Practice Research Project\n", "abstract": " The aim of this paper is to present the methodology and preliminary findings from an on-going Danish collaborative practice research project concerning IT-Management in Transformational e-Government-DISIMIT. The ambition of the DISIMIT project is to improve IT management in local governments (municipalities) and to contribute with knowledge about IT-Management to the IS literature in general and to the e-government literature in particular. The paper reports on the process of conducting collaborative practice research and the selected findings from the empirical research activities. Up till now different empirical research activities have been conducted; a quantitative survey in all 98 Danish municipalities, qualitative case-studies in 12 municipalities in spring 2009, and 3 longitudinal theme tracks. Overall, the quantitative survey and the qualitative case-studies in 2009 identified the stage of eGovernment maturity and diagnosed the six main challenges faced by local governments in their efforts of realizing transformational e-Government. From these challenges, the project chose three challenges to investigate further according to the principles from Collaborative Practice Research, the challenges were categorized into 3 longitudinale theme tracks from 2010–2012). These challenges were–1) Value Creation and Benefit Realization, 2) Strategy Execution and Project Portfolio Management and 3) Social Alignment and Communication.", "num_citations": "1\n", "authors": ["1354"]}
{"title": "Mobile Systems Development\n", "abstract": " This article reviews 105 representative contributions to the literature on mobile systems development. The contributions are categorized according to a simple conceptual framework. The framework comprises four perspectives: the requirements perspective, the technology perspective, the application perspective, and the business perspective. Our literature review shows that mobile systems development is overlooked in the current debate. From the review, we extend the traditional view on systems development to encompass mobile systems, and based on the identified perspectives we propose core characteristics for mobile systems. We also extend the traditional focus found in systems development on processes in a development project to encompass the whole of the development company as well as inter-organizational linkage between development companies. Finally, we point at research directions emerging from the review that are relevant to the field of mobile systems development.", "num_citations": "1\n", "authors": ["1354"]}
{"title": "Delivery Performance Diagnosis by Use of Data Logging and Enrichment of Transactional Data\n", "abstract": " Delivery Performance Diagnosis by Use of Data Logging and Enrichment of Transactional Data — Aalborg University's Research Portal Skip to main navigation Skip to search Skip to main content Aalborg University's Research Portal Logo Dansk English Home Profiles Projects Publications Activities Research Units Facilities Press / Media Prizes Datasets Impacts Search by keywords, name or affiliation Delivery Performance Diagnosis by Use of Data Logging and Enrichment of Transactional Data Thomas Eriksen, Peter Nielsen, Kenn Steger-Jensen Operations Research Logistics and Supply Chain Management Research output: Contribution to book/anthology/report/conference proceeding › Article in proceeding › Research › peer-review Overview Original language English Title of host publication Proceedings of The 12th International MITIP Conference The Modern Information Technology in the Innovation …", "num_citations": "1\n", "authors": ["1354"]}
{"title": "Modelling in oral anticoagulation treatment\n", "abstract": " An increasing number of people are prescribed blood thinning drugs as oral vitamin K antagonists (VKA). The drug is prescribed both prophylactic and therapeutically to a large group of patients at increased risk of thromboembolism. Optimal treatment with coumarins (ie warfarin) has been reported difficult mainly due to high inter-and intraindividual variability between patients’ response to the required maintenance dose. Also dietary interaction from food containing vitamin K adds to difficulties in treatment with VKA, as vitamin K has an opposing effect of warfarin. Research has shown how involvement of patients in their VKA treatment improves the quality of the treatment; this is especially the case when patients are allowed to adjust medicine intake based upon International Normalized Ratio (INR). The treatment is a balance between avoiding adverse events as hemorrhages due to over-treatment and thromboembolisms due to under-treatment. The quality of the treatment may be further increased by introducing predictive models. Such models should account for variance in INR values and be able to aid patients in optimal dosing of warfarin by keeping the INR value at therapeutic level.This PhD-project aims to develop predictive models that are able to account for inter-and intraindividual variability in patients’ response to warfarin treatment. Furthermore, it has been hypothesized that including dietary information on vitamin K intake will increase precision of INR predictions. A novel compartment model of vitamin K has been developed and integrated into an already described model, which is able to predict INR values based upon warfarin …", "num_citations": "1\n", "authors": ["1354"]}
{"title": "Det kommunale digitaliseringslandskab 2009. Status og udfordringer: resultater fra kvantitativ undersøgelse blandt kommunale it-chefer i Danmark\n", "abstract": " Denne rapport tegner et billede af det kommunale digitaliseringslandskab anno 2009 og redegør for de udfordringer, kommunerne står overfor i digitaliseringen af de kommunale forvaltninger og services. Rapporten er baseret på en spørgeskemaundersøgelse til it-cheferne i samtlige danske kommuner, og 82 pct. af it-cheferne har svaret.Rapporten peger på, at kommunerne på en række områder er nået langt mht. digital forvaltning. Alle kommuner har længe haft en hjemmeside, hvor borgere, virksomheder og andre samfundsaktører kan hente informationer, gøre brug af selvbetjeningsløsninger, downloade formularer mv. Langt hovedparten af kommunerne har en vedtaget it-strategi, og der er stor enighed om strategien blandt de centrale aktører i kommunen. Der er kommet fokus på strategisk brug af it i forbindelse med udvikling af den kommunale organisation, og den administrative topledelse er aktivt involveret i udarbejdelsen af kommunens it-strategi. Den Digitale Taskforce og KL er væsentlige inspirationskilder til kommunernes strategiske arbejde med it, hvor fokus i forbindelse med digitalisering navnlig er på effektiv opgavevaretagelse og forbedret service. Kommunale medarbejdere udviser ifølge it-cheferne ikke modstand mod anvendelsen af it.", "num_citations": "1\n", "authors": ["1354"]}
{"title": "Perspektiver på arbejdsmarked, virksomheder og medarbejdere\n", "abstract": " Perspektiver på arbejdsmarked, virksomheder og medarbejdere — Aalborg University's Research Portal Skip to main navigation Skip to search Skip to main content Aalborg University's Research Portal Logo Dansk English Home Profiles Projects Publications Activities Research Units Facilities Press / Media Prizes Datasets Impacts Search by keywords, name or affiliation Perspektiver på arbejdsmarked, virksomheder og medarbejdere Peter Nielsen, Edwin Emmett Caraker, Jacob Magnussen CARMA - Centre for Labour Market Research Research output: Book/Report › Book › Research Overview Original language Danish Place of Publication Aalborg Publisher Centre for Comparative Welfare Studies, Institut for Økonomi, Politik og Forvaltning, Aalborg Universitet Number of pages 311 ISBN (Print) 8789639278 Publication status Published - 2004 Series CARMA Årbog Number 2004 Cite this APA Author BIBTEX …", "num_citations": "1\n", "authors": ["1354"]}
{"title": "Managing Networked Software Development\n", "abstract": " Managing Networked Software Development — Aalborg University's Research Portal Skip to main navigation Skip to search Skip to main content Aalborg University's Research Portal Logo Dansk English Home Profiles Projects Publications Activities Research Units Facilities Press / Media Prizes Datasets Impacts Search by keywords, name or affiliation Managing Networked Software Development M. Jeenicke, Peter Axel Nielsen, L. Vainio, L. Vogelsang Department of Computer Science Research output: Contribution to book/anthology/report/conference proceeding › Article in proceeding › Research Overview Original language English Title of host publication Proceedings of the 26th IRIS, Helsinki, Finland, August 2003 Publication date 2003 Publication status Published - 2003 Event Managing Networked Software Development - Duration: 19 May 2010 → … Conference Conference Managing Networked Software …", "num_citations": "1\n", "authors": ["1354"]}
{"title": "SID'erne og velfærden\n", "abstract": " SID'erne og velfærden — Aalborg University's Research Portal Skip to main navigation Skip to search Skip to main content Aalborg University's Research Portal Logo Dansk English Home Profiles Projects Publications Activities Research Units Facilities Press / Media Prizes Datasets Impacts Search by keywords, name or affiliation SID'erne og velfærden Morten Lassen, Lars Torpe, Peter Nielsen, Edwin Emmett Caraker CARMA - Centre for Labour Market Research Research output: Book/Report › Book › Research Overview Original language Danish Place of Publication København Publisher SID Publication status Published - 1999 Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Lassen, M., Torpe, L., Nielsen, P., & Caraker, EE (1999). SID'erne og velfærden. SID. Lassen, Morten ; Torpe, Lars ; Nielsen, Peter ; Caraker, Edwin Emmett. / SID'erne og velfærden. København : SID, 1999. Lassen, M, Torpe, …", "num_citations": "1\n", "authors": ["1354"]}
{"title": "Acceptability of air with mixtures of emissions from building materials\n", "abstract": " Acceptability of air with mixtures of emissions from building materials — Aalborg University's Research Portal Skip to main navigation Skip to search Skip to main content Aalborg University's Research Portal Logo Dansk English Home Profiles Projects Publications Activities Research Units Facilities Press / Media Prizes Datasets Impacts Search by keywords, name or affiliation Acceptability of air with mixtures of emissions from building materials Henrik Nellemose Knudsen, O. Valbjørn, Lars Bo Gunnarsen, PA Nielsen Division of Energy Efficiency, Indoor Climate and Sustainability of Buildings (EIS) Research output: Contribution to book/anthology/report/conference proceeding › Article in proceeding › Research › peer-review Overview Original language English Title of host publication Proceedings of the 8th International Conference on Indoor Air Quality and Climate Number of pages 6 Volume 2 Publication date …", "num_citations": "1\n", "authors": ["1354"]}
{"title": "Out of Scandinavia (invited session) the history and contributions of an IS research tradition\n", "abstract": " This summer, the Scandinavian IS research community celebrated its 21st annual IRIS conference (Information systems Research In Scandinavia), and from that point of view it is probably the oldest active IS research community in the world. Many important contributions have come out of this tradition: for example, the work of Börje Langefors on theories of information systems (1966), which contributed to the establishment of our field, and the controversial contributions of Kristen Nygaard (1971), emphasizing the political aspects and the strengths of action research approaches as integral parts of information systems studies.One of the most common misconceptions about Scandinavian IS research is captured in the notion of “The Scandinavian Approach.” Research contributions from Scandinavia often have special features because they are created as part of societies with long traditions for democracy in the …", "num_citations": "1\n", "authors": ["1354"]}
{"title": "Method for sensory characterization of building and furnishing materials\n", "abstract": " Method for sensory characterization of building and furnishing materials — Aalborg University's Research Portal Skip to main navigation Skip to search Skip to main content Aalborg University's Research Portal Logo Dansk English Home Profiles Projects Publications Activities Research Units Facilities Press / Media Prizes Datasets Impacts Search by keywords, name or affiliation Method for sensory characterization of building and furnishing materials Henrik Nellemose Knudsen, PA Nielsen Division of Energy Efficiency, Indoor Climate and Sustainability of Buildings (EIS) Research output: Contribution to book/anthology/report/conference proceeding › Article in proceeding › Research Overview Original language English Title of host publication Proceedings of the Healthy Buildings/IAQ '97. Global issues and regional solutions Editors JE Woods, DT Grimsrud, N. Boschi Volume Vol. 3 Publisher Healthy Buildings/IAQ '…", "num_citations": "1\n", "authors": ["1354"]}
{"title": "Biological iron and manganese removal\n", "abstract": " In 1995 Krueger built a new WTW for the Danish municipality of Esbjerg situated on Jutland's west coast. The WTW, based on biological iron and manganese removal, is claimed to be the first of its kind in Denmark. Prior to the opening of the WTW, the municipality of Esbjerg had faced a problem supplying drinking water. Unable to use groundwater because of a high iron content of up to 15mg/l, it saw no other solution than to continue boring outwards in a quest for suitable potable sources. To solve the problem, Krueger proposed to use a biological technique for removal of iron. Using this method, iron can be removed without the addition of chemicals. Chemical methods have traditionally been used in Denmark for treatment of groundwater with a high iron content. Having secured the municipality's approval, a pilot plant was built to verify that raw water was suitable for biological iron removal and to determine …", "num_citations": "1\n", "authors": ["1354"]}
{"title": "Action Research into Participative IS Development,”\n", "abstract": " The paper analyses the similarities and differences between action research approaches to participation in IS development. This is done using a simple framework and applying it to four representative examples of action research where participation plays a role in the outcome of the effort: ETHICS, SSM, Multiview, and CRA. It is common to assume that because of the collaborative nature of action research it follows that the research results in experiences, approaches and methodologies with a strong element of participation. The analysis shows that this assumption does not hold in general. The analysis identifies two distinctions between action research approaches to participation: The first distinction highlights whether the participative element is inherent in the research results or it has emerged through the research. The second distinction focuses on whether the purpose of the resulting approach is construction …", "num_citations": "1\n", "authors": ["1354"]}
{"title": "International Information Systems Journals: How Do They Differ from Their North American Counterparts?\n", "abstract": " A number of Information Systems journals published and edited in North America for inany years have been, up until relatively recently, the only avenue for Information Systems researchers to reach an international audience. There have been, however, increasing numbers of international Information Systemsjournals published outside North America in recent years reflecting the growth in interest and activity in the topic worldwide.", "num_citations": "1\n", "authors": ["1354"]}
{"title": "The software designer: Skills and change\n", "abstract": " The Software Designer: Skills and Change — Aalborg University's Research Portal Skip to main navigation Skip to search Skip to main content Aalborg University's Research Portal Logo Dansk English Home Profiles Projects Publications Activities Research Units Facilities Press / Media Prizes Datasets Impacts Search by keywords, name or affiliation The Software Designer: Skills and Change Peter A. Nielsen, Jan Stage Department of Computer Science Department of Electronic Systems Research output: Contribution to book/anthology/report/conference proceeding › Article in proceeding › Research Overview Original language English Title of host publication Report of the 17th Information Systems Research Seminar in Scandinavia, IRIS 17 : Research Paper Series Editors Kerola, P. et al. (ed.) Publisher University of Oulu Publication date 1994 Edition A21 ISBN (Print) 951423930x Publication status Published - …", "num_citations": "1\n", "authors": ["1354"]}
{"title": "Måling af gasser, dampe og lugte fra byggematerialer\n", "abstract": " Rapporten bringer resultater fra en undersøgelse gennemført i samarbejde med Hygiejnisk Institut ved Århus Universitet. Undersøgelsen belyser ventilationens og materialealderens indflydelse på afgasningen. Desuden beskrives en nyudviklet prøvestand til rutinemæssige målinger af afgasninger.", "num_citations": "1\n", "authors": ["1354"]}
{"title": "Surfacing Organizational Competence\n", "abstract": " This paper is about organizational competence in development of computer-based information systems. We address this theme by demonstrating and reflecting upon a systematic and inexpensive approach to surface organizational competence in initial analysis and design of an information system. The approach relies on the specific organizational competence of the actors already in the organization. Change is brought about by using soft systems and contradictions to surface the competence, knowledge, views, and ideas present in the situation at hand.", "num_citations": "1\n", "authors": ["1354"]}