{"title": "Data mining in agriculture\n", "abstract": " Data Mining in Agriculture represents a comprehensive effort to provide graduate students and researchers with an analytical text on data mining techniques applied to agriculture and environmental related fields. This book presents both theoretical and practical insights with a focus on presenting the context of each data mining technique rather intuitively with ample concrete examples represented graphically and with algorithms written in Matlab®. Examples and exercises with solutions are provided at the end of each chapter to facilitate the comprehension of the material. For each data mining technique described in the book variants and improvements of the basic algorithm are also given.", "num_citations": "221\n", "authors": ["602"]}
{"title": "A survey of data mining techniques applied to agriculture\n", "abstract": " In this survey we present some of the most used data mining techniques in the field of agriculture. Some of these techniques, such as the k-means, the k nearest neighbor, artificial neural networks and support vector machines, are discussed and an application in agriculture for each of these techniques is presented. Data mining in agriculture is a relatively novel research field. It is our opinion that efficient techniques can be developed and tailored for solving complex agricultural problems using data mining. At the end of this survey we provide recommendations for future research directions in agriculture-related fields.", "num_citations": "149\n", "authors": ["602"]}
{"title": "k-Nearest Neighbor Classification\n", "abstract": " The k-nearest neighbor (k-NN) method is one of the data mining techniques considered to be among the top 10 techniques for data mining [237]. The k-NN method uses the well-known principle of Cicero pares cum paribus facillime congregantur (birds of a feather flock together or literally equals with equals easily associate). It tries to classify an unknown sample based on the known classification of its neighbors. Let us suppose that a set of samples with known classification is available, the so-called training set. Intuitively, each sample should be classified similarly to its surrounding samples. Therefore, if the classification of a sample is unknown, then it could be predicted by considering the classification of its nearest neighbor samples. Given an unknown sample and a training set, all the distances between the unknown sample and all the samples in the training set can be computed. The distance with the …", "num_citations": "124\n", "authors": ["602"]}
{"title": "An architecture for developing service-oriented and component-based environmental models\n", "abstract": " The concepts and methodology of an architecture for developing agro-environmental models based on reusable components are presented. Unified Modeling Language (UML) is used to specify the system model and components at a high level of abstraction. UML interfaces are used to define the behavior of components which can be implemented using standard object-oriented programming languages such as Java. Distributed components can be created using Common Object Broker Architecture (CORBA), Remote Method Invocation (RMI), or Web Services technologies, which enable components at different geographic locations to communicate. Using a component-based approach facilitates reusability and sharing of accumulated knowledge among different development teams. Using a distributed approach provides the flexibility of developing, deploying, and maintaining models at many different locations …", "num_citations": "82\n", "authors": ["602"]}
{"title": "Software engineering techniques applied to agricultural systems\n", "abstract": " Currently, UML is widely accepted by the software industry to be the modeling language used to construct models. Several UML diagrams are used to present the dynamic and the static aspects of a software system. Although UML diagrams enormously facilitate the process of designing flexible and complex systems, they are not precise enough to express without ambiguity all aspects of the problem in study. Thus, in order to fill this vacuum in UML models, a precise language is needed to express without ambiguities the dynamic and static aspects of a UML model. The object constraint language (OCL) was created in 1995 by some IBM engineers in Europe [100]. OCL is part of formal languages and it is very much influenced by Syntropy [23]. Formal languages are used by the computer science community to give precise and unambiguous description of things [100]. The detailed and precise description of concepts …", "num_citations": "61\n", "authors": ["602"]}
{"title": "Using the Unified Modeling Language to develop soil water-balance and irrigation-scheduling models\n", "abstract": " Many water-balance and irrigation-scheduling models have been developed as research and/or management tools. These models continue to be modified or re-used by other research groups. A method for developing and documenting these models, using the Unified Modeling Language (UML) is presented. This method simplifies documentation of model requirements, assumptions and calculations and provides a template for implementing the model in programming languages. Using the template can simplify the processes of code re-use and model modification.", "num_citations": "37\n", "authors": ["602"]}
{"title": "Advances in modeling agricultural systems\n", "abstract": " Agriculture has experienced a dramatic change during the past decades. The change has been structural and technological. Structural changes can be seen in the size of current farms; not long ago, agricultural production was organized around small farms, whereas nowadays the agricultural landscape is dominated by large farms. Large farms have better means of applying new technologies, and therefore technological advances have been a driving force in changing the farming structure. New technologies continue to emerge, and their mastery and use in requires that farmers gather more information and make more complex technological choices. In particular, the advent of the Internet has opened vast opportunities for communication and business opportunities within the agricultural com-nity. But at the same time, it has created another class of complex issues that need to be addressed sooner rather than later. Farmers and agricultural researchers are faced with an overwhelming amount of information they need to analyze and synthesize to successfully manage all the facets of agricultural production. This daunting challenge requires new and complex approaches to farm management. A new type of agricultural management system requires active cooperation among multidisciplinary and multi-institutional teams and ref-ing of existing and creation of new analytical theories with potential use in agriculture. Therefore, new management agricultural systems must combine the newest achievements in many scientific domains such as agronomy, economics, mathematics, and computer science, to name a few.", "num_citations": "32\n", "authors": ["602"]}
{"title": "A plug and play approach for developing environmental models\n", "abstract": " The need for better collaboration among scientists and different existing environmental models makes it necessary to find efficient ways of using and reusing functionalities or services provided by third parties. New advances in software engineering can be successfully used to develop environmental models that use an enabling architecture for a “plug and play” approach. In this study, the Kraalingen crop simulation model was used to demonstrate the concept and feasibility of the “plug and play” architecture for crop simulation models. Strategy and AbstractFactory design patterns are used as the basis for the “plug and play” approach. In addition to design patterns, Java's reflection was used to dynamically instantiate the appropriate Strategy instance. This paper focuses only on the issues dealing with design and implementation of the “plug and play” architecture. This architecture was successfully tested using …", "num_citations": "32\n", "authors": ["602"]}
{"title": "Evaluation of land resources using crop models and a GIS\n", "abstract": " The evaluation of land resources has been greatly facilitated by recent advances in information science and computer technology. We describe an effort to move land evaluation into the information age that resulted in AEGIS, the Agricultural and Environmental Geographical Information System. Although the crop models in the DSSAT are basically one-dimensional, agriculture occurs in time and space. It was a logical step to link DSSAT with a geographic information system. The chapter outlines the evolution of the various versions of AEGIS that culminated in the a version for Windows, AEGIS/WIN. Sample applications of AEGIS are presented in three case studies: the feasibility of small irrigation projects in the Andes of Colombia; the evaluation of alternative cropping systems for former sugarcane land in southern Puerto Rico; and assessment of the possible impact of climate change on regional crop …", "num_citations": "28\n", "authors": ["602"]}
{"title": "Mechanistic virtual modeling: coupling a plant simulation model with a three-dimensional plant architecture component\n", "abstract": " The aim of this research is to integrate plant architectural modeling or “visualization modeling” and “mechanistic” or physiologically based modeling to describe how a real plant functions using a virtual crop. Virtual crops are life-like computer representations of crops based on individual plants and including the representation of the substrate on which the plants grow. The integration of a three-dimensional expression and the mechanistic model of plant development and growth requires the knowledge of the position of the organs along the different plant axes (the topology), their sizes, their forms, and their spatial orientation. The plant simulation model simulates the topology and organ weight or length. The superposition of spatial position and the topology produces the architecture of the plant. The association between sizes and organs creates what we refer to as the plant morphological model. Both …", "num_citations": "19\n", "authors": ["602"]}
{"title": "Nurse scheduling problem: An integer programming model with a practical application\n", "abstract": " We use a binary integer programming model to formulate and solve a nurse scheduling problem (NSP) which maximally satisfies nurse preferences. In a practical application of a VA hospital, besides considering the scheduling of two types of nurses (registered nurses and licensed practical nurses), two other types of employees (nursing assistants and health care techs), one nurse manager, and a clinical nurse leader are also included in our model. Most of these employees are working full-time. In addition, we distinguish the schedule of weekdays and weekends with different requirements and different preferences for employees. Besides the requirements for each shift, we consider requirements for specific employees in some shifts in practical situations. The seven shifts each day do not necessarily have the same length in our model. Vacation time of employees is also considered in our model. Thus, the …", "num_citations": "18\n", "authors": ["602"]}
{"title": "Modeling: a central activity for flexible information systems development in agriculture and environment\n", "abstract": " Enterprise information systems in agriculture and environment are becoming more complex and difficult to design and implement. This paper aims to show our vision on using model-based approaches to design complex and flexible agricultural and environmental information systems. At the center of this modeling approach is the Unified Modeling Language that facilitates expressing visually concepts of a problem domain and their relationships. UML has a core of notations that are generic and that can be used to model problems in any domain but can be extended to create profiles in order to take into consideration modeling concerns in a particular problem domain. UML profiles are created to use UML in designing spatial systems, ontologies, model driven architecture-based systems and Web-based systems and a recent profile makes it possible to use UML for business modeling purposes. UML is used to …", "num_citations": "15\n", "authors": ["602"]}
{"title": "Modeling and Processing for Next-Generation Big-Data Technologies: With Applications and Case Studies\n", "abstract": " This book covers the latest advances in Big Data technologies and provides the readers with a comprehensive review of the state-of-the-art in Big Data processing, analysis, analytics, and other related topics. It presents new models, algorithms, software solutions and methodologies, covering the full data cycle, from data gathering to their visualization and interaction, and includes a set of case studies and best practices. New research issues, challenges and opportunities shaping the future agenda in the field of Big Data are also identified and presented throughout the book, which is intended for researchers, scholars, advanced students, software developers and practitioners working at the forefront in their field.", "num_citations": "12\n", "authors": ["602"]}
{"title": "Using UML for ontology construction: a case study in agriculture.\n", "abstract": " Ontologies provide a solid support for new technologies such as software agents, e-commerce and knowledge managements. The Unified Modelling Language (UML) has been largely accepted by the software industry as the standard language for modelling software. The heart of ontologies is concepts and relationships between them and UML is the most used tool to model the relationships between concepts in an application domain. Therefore, there are compelling reasons to use UML to model ontologies. Our presentation focuses on the intersection of these two technologies and their application in developing agricultural systems. First, a comparison of ontology concepts and UML artifacts allows for creating a common denominator between the two technologies and after, examples from the domain of agriculture agriculture Subject Category: Disciplines, Occupations and Industriessee more details show how to create ontologies using UML. Ontologies include hierarchies of classes and/or subclasses, relationships between classes, class attributes definitions and axioms that specify constraints. In UML, the relationships between concepts are presented in class diagrams and constraints are expressed using the Object Constraint Language.", "num_citations": "10\n", "authors": ["602"]}
{"title": "The model driven architecture approach: A framework for developing complex agricultural systems\n", "abstract": " Development and application of crop models is increasingly constrained by the difficulty of implementing scientific information into an efficient simulation                environment. Traditionally, researchers wrote their own models and tools, but as software has become much more complex, few researchers have the means to continue using this approach. New modeling paradigms provided by the software engineering industry can be successfully used to facilitate the process of software development for crop simulation systems.             This chapter outlines a                                 model driven architecture (MDA                                )-based approach to construct a crop simulation                              model               . This new modeling paradigm is a Unified Modeling Language (UML)                                 -based approach. A conceptual model                of the problem is first constructed to depict concepts from the domain of the …", "num_citations": "9\n", "authors": ["602"]}
{"title": "Using crop models and geographic information systems to study the impact of climate change in the Southeastern USA\n", "abstract": " Using crop models and geographic information systems to study the impact of climate change in the southeastern USA FAO_logo home-icon English Español Français العربية 中文 Русский home-icon Translate with Google Access the full text NOT AVAILABLE Lookup at Google Scholar google-logo Bibliographic information Language : English Type : Journal Article In AGRIS since : 1995 Volume : 53 Start Page : 82 End Page : 86 All titles : \" Using crop models and geographic information systems to study the impact of climate change in the southeastern USA \" Save as: AGRIS_AP RIS EndNote(XML) Using crop models and geographic information systems to study the impact of climate change in the southeastern USA Loading... Paper Written Paper Using crop models and geographic information systems to study the impact of climate change in the southeastern USA [1994] Papajorgji, P. (Univ. of Florida, Gainesville, …", "num_citations": "9\n", "authors": ["602"]}
{"title": "Systems analysis tools for better health care delivery\n", "abstract": " This book presents some recent systems engineering and mathematical tools for health care along with their real-world applications by health care practitioners and engineers. Advanced approaches, tools, and algorithms used in operating room scheduling and patient flow are covered. State-of-the-art results from applications of data mining, business process modeling, and simulation in healthcare, together with optimization methods, form the core of the volume. Systems Analysis Tools for Better Health Care Delivery illustrates the increased need of partnership between engineers and health care professionals. This book will benefit researchers and practitioners in health care delivery institutions, staff members and professionals of specialized hospital units, and lecturers and graduate students in engineering, applied mathematics, business administration and health care.", "num_citations": "8\n", "authors": ["602"]}
{"title": "Introduction to data mining\n", "abstract": " There is a growing amount of data available from many resources that can be used effectively in many areas of human activity. The Human Genome Project, for instance, provided researchers all over the world with a large set of data containing valuable information that needs to be discovered. The code that codifies life has been read, but it is not yet known how life works. It is desirable to know the relationships among the genes and how they interact. For instance, the genome of food such as tomato is studied with the aim of genetically improving its characteristics. Therefore, complex analyses need to be performed to discover the valuable information hidden in this ocean of data. Another important set of data is created byWeb pages and documents on the Internet. Discovering patterns in the chaotic interconnections of Web pages helps in finding useful relationships for Web searching purposes. In general …", "num_citations": "8\n", "authors": ["602"]}
{"title": "Automated enterprise systems for maximizing business performance\n", "abstract": " The integration of recent technological advances into modern business processes has allowed for greater efficiency and productivity. However, while such improvements are immensely beneficial, the modeling and coordination of these activities offers a unique set of challenges that must be addressed. Automated Enterprise Systems for Maximizing Business Performance is a pivotal reference source for the latest scholarly research on the modeling and application of automated business systems. Featuring extensive coverage on a variety of topics relating to the design, implementation, and current developments of such systems, this book is an essential reference source for information system practitioners, business managers, and advanced-level students seeking the latest research on achievements in this field. This publication features timely, research-based chapters within the context of business systems including, but not limited to, enterprise security, mobile technology, and techniques for the development of system models.", "num_citations": "7\n", "authors": ["602"]}
{"title": "Complex intelligent systems and their applications\n", "abstract": " \" Complex Intelligent Systems and Applications\" presents the most up-to-date advances in complex, software intensive and intelligent systems. Each self-contained chapter is the contribution of distinguished experts in areas of research relevant to the study of complex, intelligent, and software intensive systems. These contributions focus on the resolution of complex problems from areas of networking, optimization and artificial intelligence. The book is divided into three parts focusing on complex intelligent network systems, efficient resource management in complex systems, and artificial data mining systems. Through the presentation of these diverse areas of application, the volume provides insights into the multidisciplinary nature of complex problems. Throughout the entire book, special emphasis is placed on optimization and efficiency in resource management, network interaction, and intelligent system design. This book presents the most recent interdisciplinary results in this area of research and can serve as a valuable tool for researchers interested in defining and resolving the types of complex problems that arise in networking, optimization, and artificial intelligence.", "num_citations": "5\n", "authors": ["602"]}
{"title": "Using a Rule Developing Experimentation Approach to Study Social Problems: The Case of Corruption in Education\n", "abstract": " This article presents the first in a series of studies on the corruption of various types, assessed through an online experiment known as mind genomics. The data allows for the creation of simple models from regression, showing the part-worth contribution of every element to perceived corruption, and to perceived positive, neutral or negative emotion. The authors use ordinary least squares regression models and advanced data mining techniques to analyze the data and classify the users accordingly. They present the results from four countries (Albania, Hungary, India, and the USA), looking at the linkages between corruption by country, and by other factors such as social class. Based on the collected data a model is generated for each group (country, type of person), showing how the person in the group is likely to call a description ‘corrupt,'and how each particular element from the set of 20 elements related to …", "num_citations": "4\n", "authors": ["602"]}
{"title": "Special section on “Spatial data warehouses and SOLAP”\n", "abstract": " Data Warehouses (DW) and OnLine Analytical Processing (OLAP) tools are used in Business Intelligence (BI) applications in order to support decision-making processes. DWs are a specific type of database used to integrate, accumulate and analyze data from various sources. OLAP tools provide means to query and to analyze the warehoused information and produce online statistical summaries (indicators) at different levels of details. These indicators are computed using aggregate functions (eg Sum, Avg, Min, Max, etc.). Users can explore DWs by performing OLAP operations (eg, Roll-up, Drill-down, etc.). Data mining algorithms can also be used in DWs, aiming towards improving data analysis; these techniques help to discern automatically the correlations and causal links between data. The increasing availability of geo-referenced data has made necessary the need to enrich OLAP with spatial analysis tools …", "num_citations": "4\n", "authors": ["602"]}
{"title": "An effective approach for evaluating usability of Web sites\n", "abstract": " University Websites have been one of the important Websites for students, university personnel, and researchers. However, usability has long been a major concern within Websites. This chapter develops an evaluation approach using usability criteria and the Fuzzy Analytic Hierarchy Process (FAHP) for the comparison of Websites in a fuzzy environment. Firstly, alternative Websites are examined by experts using usability criteria in the literature. Then, FAHP is used to determine the usability criteria weights from subjective and imprecise judgments of the experts. Finally, Websites are compared based on usability criteria weights.", "num_citations": "4\n", "authors": ["602"]}
{"title": "New technologies for constructing complex agricultural and environmental systems\n", "abstract": " The worldwide increase in population has led to numerous innovative approaches to the difficulties posed by food production and agriculture in general. New Technologies for Constructing Complex Agricultural and Environmental Systems presents high-quality research on the design and implementation of information systems in the fields of agronomics, mathematics, economics, computer science, and the environment. This book gives holistic approaches to the design, development, and implementation of complex agricultural and environmental information systems, addressing the integration of several scientific domains such as agronomy, mathematics, economics, and computer science. This book will only become more important as the world searches for the best ways to manage food production.", "num_citations": "4\n", "authors": ["602"]}
{"title": "Clustering by k-means\n", "abstract": " Clustering techniques are used for finding suitable groupings of samples belonging to a given set of data. There is no knowledge a priori about these data. Therefore, such set of samples cannot be considered as a training set, and classification techniques cannot be used in this case. The k-means algorithm is one of the most popular algorithms for clustering [103]. It is one of the most used algorithms for data mining, as it has been placed among the top 10 algorithms for data mining in [237].             The k-means algorithm partitions a set of data into a number k of disjoint clusters by looking for inherent patterns in the set. The parameter k is usually much smaller than the dimension of the set of samples, and, in general, it needs to have a predetermined value before using the algorithm. There are cases where the value of k can be derived from the problem studied. For instance, in the example of the blood test …", "num_citations": "4\n", "authors": ["602"]}
{"title": "Object-oriented approach to crop modeling: Concepts and issues\n", "abstract": " This research was initiated to learn what the crop modeling community should do tofacilitate an evolution from existing crop models toward more modular ones that canmeet increasing demands. Specific objectives are to 1) use UML to design andimplement a modular crop model using an object oriented language, and 2) tocompare the characteristics of this model and its development with a modular modelwritten in FORTRAN. To better understand issues and challenges of using an OOparadigm relative to a Fortran-based model, we investigate the process with a simple,generic crop model. The complexity of the model is minimal hence allowing thefocus to be more on model structure (the real issue) instead of the model itself. Twocritical issues were considered throughout this study: 1) the exchangeability ofmodules and 2) the independence of the structure from a specific programminglanguage.", "num_citations": "4\n", "authors": ["602"]}
{"title": "Research in agricultural and environmental information systems\n", "abstract": " Information systems relate to diverse applications, but, until recently, the use of this technology in agriculture and environment has been relatively behind the applications in the industrial sector. The publication of IJAEIS started in 2010 in order to promote the new research advances in information systems applied to agriculture and environment. This paper presents an overview of the different scientific issues presented in the 50 papers published in IJAEIS between 2010 and 2013. The authors summarize the different contributions presented in IJAEIS and the authors identify the main trends in the field of agricultural and environmental information systems (ontologies, communication systems, spatial information processing, etc.).", "num_citations": "3\n", "authors": ["602"]}
{"title": "Modeling and processing for next-generation big-data technologies\n", "abstract": " Nowadays, the amount of data available on the Internet is over Zettabytes (ZB). Such condition defines a scenario known in the literature as Big Data. Although traditional databases are very efficient for finding and retrieving specific content, they are inefficient on Big Data scenario, since the great majority of such data are unstructured and scattered across the Internet. In this way, new databases are required in order to support similarity search. In order to handle such challenging scenario, the proposal in this chapter is to explore the Hamming similarity existent between content identifiers that are generated using the Random Hyperplane Hashing function. Such identifiers provide the basis for building distributed infrastructures that facilitate the similarity search. In this chapter, we present two different approaches: a P2P solution (Hamming DHT) and a Data Center solution (HCube). Evaluations are presented and …", "num_citations": "3\n", "authors": ["602"]}
{"title": "Enterprise business modeling, optimization techniques, and flexible information systems\n", "abstract": " Many factors can impact large-scale enterprise management systems, and maintaining these systems can be a complicated and challenging process. Therefore, businesses can benefit from an assortment of models and management styles to track and collect data for processes. Enterprise Business Modeling, Optimization Techniques, and Flexible Information Systems supplies a wide array of research on the intersections of business modeling, information systems, and optimization techniques. These various business models and structuring methods are proposed to provide ideas, methods, and points of view for managers, practitioners, entrepreneurs, and researchers on how to improve business processes.", "num_citations": "3\n", "authors": ["602"]}
{"title": "Sustainable waste management system and reverse logistic network design in plastic industry: A case study of Turkey\n", "abstract": " The shortage of natural sources and the threat of the bad trend have forced the industries to find environmentally-friendly alternatives and ecological approaches in their production line. In some countries, regulations have been issued for industries about this subject. Due to these reasons and more of them, logistic firms have been forced to take into consideration decreasing material and energy consumption and minimizing waste production in planning their network designs. In practice, it might be necessary to simultaneously optimize more than one conflicting objective to obtain effective and realistic solutions. In this chapter, current logistics network design of a plastic industry in Turkey has been investigated and reverse logistics network design has been developed to minimize waste production and to achieve green production. This chapter presents a mathematical model which is a fuzzy goal programming …", "num_citations": "3\n", "authors": ["602"]}
{"title": "Perceptions regarding Distance Learning in Higher Education, Smoothing the Transition\n", "abstract": " This paper presents the perceptions on distance learning approaches, assessed through an online survey, using experimental design of ideas (Mind Genomics). Students and professors of higher education institutions who had not yet experienced distance learning before COVID-19 pandemic period participated in the study. The participants belong to the universities located in Mediterranean basin, e.g., Albania, Italy, Morocco, Algeria and few African countries. Results suggest that distance learning will shift many of the responsibilities formerly on the professors to those of the students. The data suggests the need for emotional support during this transition, specifically to maintain interaction among students and professor as well as among students themselves in distance learning platforms as in traditional classrooms. The study shows that the effectiveness and the interactivity of this new paradigm are very important and any further developments of distance learning should provide strong support for these components. The position of the professor is indispensable as the guide to the entire process, suggesting that at least at the time of this writing (2020) distance learning approach is perceived only to be an intermittent complementary path to in-person interactions.", "num_citations": "2\n", "authors": ["602"]}
{"title": "Mind, Consumers, and Dairy: Applying Artificial Intelligence, Mind Genomics, and Predictive Viewpoint Typing\n", "abstract": " We present a new approach to more deeply understand the mind of consumers with respect to food products, using a combination of artificial intelligence to provide the ideas, Mind Genomics to understand how consumers respond to these ideas, uncovering Mind-Sets, and statistical assignment of new people to these newly uncovered Mind-Sets using the PVI, personal viewpoint identifier. We illustrate the approach in detail with yogurt, and then present data from other studies about yogurt, milk, and cheese, to reveal new knowledge about emergent Mind-Sets for conventional dairy products. The key benefits of the approach are the scope (many ideas from artificial intelligence), discipline (experimental design to uncover what is important), actionability findings, mind-types, speed (within 2 or 3 days), and cost (low because of automation).", "num_citations": "2\n", "authors": ["602"]}
{"title": "Programming paradigms\n", "abstract": " When developing software, one deals with levels of abstraction, ranging from the real world where the problem represents the highest level of abstraction to machine language that represents the solution in the lowest level of abstraction. Between the highest and lowest levels of abstraction, one should develop software in as many levels of abstraction as the problem demands.", "num_citations": "2\n", "authors": ["602"]}
{"title": "Soil water-balance and irrigation-scheduling models: A case study\n", "abstract": " In this chapter we will discuss issues related to the development of a general UML model that covers a large class of similar models, the class of water-balance and irrigation-scheduling models [PSH04]. Many irrigationscheduling and water-balance models have been developed and published in the past. These models have been used for both research purposes and as management tools. Models used for research purposes generally represent the system and underlying processes in greater detail than do management models.[AW85] distinguished between (i) mechanistic and functional, and (ii) rate and capacity models. Mechanistic models are based on fundamental processes, whereas functional models simplify the representation of processes. Rate models are driven by time and define rates of change within a system; capacity models are driven by input amounts and define amounts of change. However …", "num_citations": "2\n", "authors": ["602"]}
{"title": "Use Cases and Actors\n", "abstract": " Usually software systems are developed to be used by humans or other hardware devices. There is a close interaction between users (humans or machines) and the system. Users send a message to the system that provokes the system to execute some operations in order to return some valuable response. Therefore, determining what a software system should provide to users means understanding what the users want from the system. The process of capturing requirements for a system developed using object-oriented approach is referred to as developing the use case model. The use case approach was introduced by the well-known work of [JCJ94], often referred to in the object-oriented community as the father of the Object-Oriented Software Engineering (OOSE). Very soon, use cases were embraced by the totality of the methodologist worldwide. Use cases are a simple and yet powerful way to express the …", "num_citations": "2\n", "authors": ["602"]}
{"title": "Understanding client’s feelings about mobile banking in Albania\n", "abstract": " Mobile banking is relatively a new service offered by a few banks in Albania. Banks are obliged to keep investing in new technologies as otherwise they would lose market share. It is although interesting to know how clients react to these innovation efforts. This study was undertaken in order to understand client‘s response to bank innovation. An online experiment is conceived based on Experimental Design Principles. Participants are offered to evaluate combinations of messages (elements) about mobile banking, rate each combination and then select an emotion that they feel when reading the messages, thus combining a quantitative and a qualitative approach in one study. The collected data are used to create individual models and later a general model using regression to show the statistical relevance of each of the messages to the degree of total participant‘s appreciation and to evaluate their perceived positive, neutral or negative emotion. The models use ordinary least squares regression models and advanced data mining techniques (k—means clustering) to analyze the data and classify participants accordingly. At the end of the analyses, a set of two or three mind sets are presented to show how participants in the study are geared in their decision making process. The mind sets help banks understand client‘s reaction and give banks an opportunity to address different issues to better serve their clients.", "num_citations": "1\n", "authors": ["602"]}
{"title": "A multilayer perceptron network-based analysis to configure smes strategic entrepreneurship for sustainable growth\n", "abstract": " This study analyzed the close interaction among organizational networking and financial mechanisms of growth and sustainable growth of SMEs operating in Albania. Data on 120 SMEs for 2017–2018 were analyzed using multivariate regressions and multilayer perceptron artificial neural networks. Initially, the data were analyzed using multivariate regression analyses to find the correlation between firms’ growth measured by three different indicators: return on equity, return on assets and business size. In this approach, growth takes into consideration a firm’s liquidity, its op‐erational efficiency, and leverage indicators in addition to organizational characteristics. The results obtained during the initial phase were fed to the multilayer perceptron artificial neural networks model to evaluate SMEs growth and further their sustainable growth process by using the age of the firm, classified into start‐up, grown, and matured stages. The model results showed that SMEs in the start‐up stage assume a risk‐taker approach toward sustainable growth. In the grown stage, they implement a market‐timing strategy in selecting investments toward a sustainable growth perspective. Those in matured stage replicate the liberal managerial style of the SMEs in start‐up stage, but employ a less aggressive strategy.", "num_citations": "1\n", "authors": ["602"]}
{"title": "Using Mind Genomics to advertise tourism in Albania\n", "abstract": " The advent of the Internet has changed the advertisement paradigm. Nowadays, companies must have not only a solid presence in the web but also the right tools for online advertisement. In this paper the new technology of Minds Genomics is used to advertise tourism in Albania. An online experiment is conceived based on Experimental Design principles. Participants evaluate combinations of messages (elements) about tourism, rate each combination and then select an emotion that they feel when reading the messages, thus combining a quantitative and a qualitative approach in one study. The collected data are used to create simple models using regression to show the statistical relevance of each of the messages to the degree of total participant‘s appreciation and to evaluate their perceived positive, neutral or negative emotion. Ordinary least squares regression models and advanced data mining techniques (k—means clustering) to analyze the data and classify the users accordingly. At the end of the analyses, a set of two or three mind sets are presented to show how participants in the study are clustered in different mind sets.", "num_citations": "1\n", "authors": ["602"]}
{"title": "Linking Food Endorsement Labels & Messaging to Perceived Price and Emotions. A Mind Genomics® Exploration\n", "abstract": " Respondents evaluated systematically created vignettes (short combinations), comprising actual logos, along with messages. The approach, Mind Genomics, allows each respondent to evaluate a unique set of combinations, rating each combination on two attributes, appropriate price and feeling/emotion best describing one’s feeling after reading the vignette. The experimental design uncovers the relation between the presence/absence of the 36 elements (including logos and messaging), and both the selected price and linkage to positive and negative emotions, respectively. The results were analyzed for total panel, gender, those who identified themselves as halal or kosher, respectively, and emergent mind-sets.The authors concluded that the use of the Mind Genomics approach did not produce clear segmentation when the respondent made a judgment of price or emotion. They were just different. Halal users were willing to pay much more for halal food and those with labels that stress the Muslin Qur’anic origin than were kosher users. The Torah origin of kosher did not dramatically increase the price willing-to-pay of kosher users. Halal users appeared to be more positive toward halal food, than kosher users including when they read about halal. Thus, the strongest relations emerged from respondents who identified themselves as halal users. The application of Mind Genomics to any aspect of everyday life expands many types of scientific studies.", "num_citations": "1\n", "authors": ["602"]}
{"title": "Research Open\n", "abstract": " The paper introduces a case study aiming to answer the question of what concerns healthy people about the prospect of cancer? The results suggest two distinct mind-sets. The mind-set is Life-Quality Pursuers, who are concerned the result is temporary and think cancer is chronic disease. The second mind-set is Outcome-Worriers, who fear the outcome, and worry about no recovery. The Outcome-Worriers are concerned a lot about physical pains and symptoms like nausea and joint pain. Incorporating the results of Mind Genomics and the mind-sets into a short, online personal viewpoint identifier, permits the use of these scientific results to assign a new patient to one of the two mind-sets. The benefit is the ability to better communicate information and instructions to the patients, based on the nature of the messages to which they are like to be most receptive.", "num_citations": "1\n", "authors": ["602"]}
{"title": "Uncovering Consumer Mindsets Regarding Raw Beverages\n", "abstract": " Nutritional fads in the health and fitness world are constantly changing. Each new craze has its believers and critics. For the consumer, “what to believe” becomes a topic filled with uncertainty. This paper presents a systematic approach to understanding what consumers believe about the health messaging of “raw beverages”. The paper presents both substantive results from US consumers, as well as demonstrates a general approach by which researchers can more deeply understand the consumer mind with respect to the specifics of health and wellness issues.", "num_citations": "1\n", "authors": ["602"]}
{"title": "The model-driven architecture approach\n", "abstract": " One of the most challenging problems that the software community currently faces is the changing environment in which software is to be developed. Almost every decade brings a new programming environment that forces software engineers to rewrite their systems to take into account new developments. The software industry faces other considerable challenges as it tries to build larger, more complex software systems with fewer resources. Although modern programming languages such as C++ and Java have in general improved the software development process, they have failed to significantly increase developer’s productivity [88]. On the other hand, the complexity of the systems to be developed is constantly increasing; customers expect more complex and sophisticated systems that often exceed the abilities of the software industry to develop them.", "num_citations": "1\n", "authors": ["602"]}
{"title": "Performance Evaluation of WMN-GA System for Node Placement in WMNs Considering Exponential and Weibull Distribution of Mesh Clients and Different Selection and Mutation Operators\n", "abstract": " In this paper, we evaluate the performance of WMN-GA system for node placement problem in WMNs. For evaluation, we consider Exponential and Uniform Distribution of mesh clients and different selection and mutation operators. The population size is considered 64 and the number of generation 200. For evaluation, we consider the giant component and the number of covered users metrics. The simulation results shows that the WMN-GA system performs better for Exponential distribution of mesh clients.", "num_citations": "1\n", "authors": ["602"]}
{"title": "WMN-GA System for Node Placement in WMNs: Performance Evaluation for Weibull Distribution of Mesh Clients\n", "abstract": " In this paper, we evaluate the performance of WMN-GA system for node placement problem in WMNs. For evaluation, we consider Weibull Distribution of mesh clients and different selection and mutation operators. The population size is considered 64 and the number of generation 200. For evaluation, we consider the giant component and the number of covered users metrics. The simulation results show that the WMN-GA system performs better for Single Mutation and Linear Ranking.", "num_citations": "1\n", "authors": ["602"]}
{"title": "Support vector machines\n", "abstract": " Support vector machines (SVMs) are supervised learning methods used for classification [30, 41, 232]. This is one of the techniques among the top 10 for data mining [237]. In their basic form, SVMs are used for classifying sets of samples into two disjoint classes, which are separated by a hyperplane defined in a suitable space. Note that, as consequence, a single SVM can only discriminate between two different classifications. However, as we will discuss later, there are strategies that allow one to extend SVMs for classification problems with more than two classes [232, 220]. The hyperplane used for separating the two classes can be defined on the basis of the information contained in a training set.", "num_citations": "1\n", "authors": ["602"]}
{"title": "A UML-based Plug&Play version of RothC\n", "abstract": " This chapter presents the stepwise conversion of the FORTRAN-based RothC Soil Organic Carbon model into a plug&play component amenable to use as part of larger modeling frameworks. As a first step, RothC was converted into a stand-alone Java modular application to ensure consistency with the parent model. The plug&play component was then developed based on the Unified Modeling Language (UML). The plug&play component provides services that other system/components can easily use. The behavior of RothC is presented through interfaces that other system/components can implement. The use of interfaces to express behavior of components facilitates the collaboration of teams located in different geographic regions. Various UML diagrams present static and dynamic aspects of the system. UML facilitates model documentation, and the plug&play architecture facilitates implementation by …", "num_citations": "1\n", "authors": ["602"]}
{"title": "An in-depth look at the Rich Internet Applications frameworks.\n", "abstract": " This paper presents an in-depth look at the paradigm referred to as the Rich Internet internet Subject Category: Techniques, Methodologies and Equipmentsee more details Applications (RIA). This new approach to web-based application development is considered as the next evolution of business application development. It replaces the traditional web development approach that requires page refreshes from the server for all events, data submissions and navigations. There are two approaches to RIA development: the object-oriented and the scripting-based approach. Both approaches are presented with their respective advantages and disadvantages. Examples of GUI-s developed using AJAX technology will be presented as well. AGROVOC, a controlled vocabulary system designed to civer subject fields in agriculture, forestry, fisheries, food and related domains (environment) is also discussed.", "num_citations": "1\n", "authors": ["602"]}
{"title": "The Plug and Play Architecture\n", "abstract": " Software engineers are facing increasing pressure from clients to provide architectural solutions that can be built with today's requirements and be flexible enough to meet future needs. It is common practice in the domain of software development to see customers constantly modifying and expanding the requirements of the future system. Faced with the reality of everchanging requirements, it is desirable to use an architecture that allows for easy modifications of existing functionalities and easy adoption of new ones. An architecture that is designed to minimize the impact of future changes is the\" plug and play\" architecture. According to the definition provided by Webopedia nittp://webopedia. com), the plug and play architecture refers to the ability of a computer system to automatically configure expansion boards and other devices. Originally, the plug and play architecture was used by the hardware industry. The …", "num_citations": "1\n", "authors": ["602"]}
{"title": "Model Driven Architecture for Software Application Generation\n", "abstract": " Modeling software system is a common aid to the software development process. There are many advantages to modeling, however, these are limited by the fact that modeling is typically only descriptive, and can not be used to generate code. Model Driven Architecture (MDA), an OMG initiative, allows for the creation of declarative models that can be used as the specification for the generation of entire software systems. Using such an approach has significant advantages, especially with regard to agricultural and environmental simulations which are often complex and evolve over time.This paper presents an overview of Model Driven Architecture and how it can be used to drive application generation. Platform Independent Model, Platform Specific Model, and transformation definition concepts are discussed, the MDA process is reviewed, and key advantages of the MDA approach are presented, with special emphasis on the generation of applications that simulate agricultural systems.", "num_citations": "1\n", "authors": ["602"]}
{"title": "Object-oriented approach to crop modeling: Concepts and Examples\n", "abstract": " This research was initiated to learn what the crop modeling community could do to facilitate an evolution from existing crop models toward more modular ones that can meet increasing demands. Specific objectives are to 1) use UML to design and implement a modular crop model using an object oriented language, and 2) to compare the characteristics of this model and its development with a modular model written in FORTRAN. To better understand issues and challenges of using an object oriented (OO) paradigm relative to a Fortran-based model, we investigated the process with a simple, generic crop model. The complexity of the model is minimal hence allowing the focus to be more on model structure (the real issue) instead of the model itself. Two critical issues were considered throughout this study: 1) the exchangeability of modules and 2) the independence of the structure from a specific programming language.From our experience of converting a simple crop model developed in FORTRAN into an object-oriented environment we found that UML can be useful to bring modelers to discuss modeling issues without considering any particular programming language. Modelers can exchange diagrams and convert them into particular programming languages.", "num_citations": "1\n", "authors": ["602"]}
{"title": "A UML-based structural study of irrigation-scheduling and water-balance models\n", "abstract": " Many water-balance and irrigation scheduling models have been developed as researchand/or management tools. These models continue to be modified or re-used by other researchgroups. A method of documenting these models, using the Unified Modeling Language (UML) ispresented. This method simplifies documentation of model requirements, assumptions andcalculations and provides a template for implementing the model in a programming language. Usingthe template can simplify the processes of code reuse and model modification.", "num_citations": "1\n", "authors": ["602"]}
{"title": "A Database for Extension Publications\n", "abstract": " EDIS (Extension Digital Information Source) is a system for creating, maintaining,distributing, and archiving a large collection of extension publications. EDISutilizes a database management system to store all content associated with thiscollection. A tool based on Java components is used to create and edit publications.The system generates HTML, PDF, XML, and multimedia presentationsdynamically from the database. An expert print program creates print-quality PDFformatted documents by automatically handling page layout. EDIS contains over4000 extension publications from the Florida Cooperative Extension Service. TheEDIS web site (http://edis.ifas.ufl.edu) receives 20,000 visitors a day.", "num_citations": "1\n", "authors": ["602"]}