{"title": "The semantic foundations of concurrent constraint programming\n", "abstract": " Concurrent constraint programming[Sar89, SR90] is a simple and powerful model of concurrent computation based on the notions of store-as-constraint and process as information transducer. The store-as-valuation conception of von Neumann computing is replaced by the notion that the store is a constraint(a finite representation of a possibly infinite set of valuations) which provides partial information about the possible values that variables can take. Instead of “reading” and “writing” the values of variables, processes may now ask (check if a constraint is entailed by the store) and tell (augment the store with a new constraint). This is a very general paradigm which subsumes(among others) nondeterminate data-flow and the (concurrent)(constraint) logic programming languages.This paper develops the basic ideas involved in giving a coherent semantic account of these languages. Our first contribution is to give a …", "num_citations": "600\n", "authors": ["1877"]}
{"title": "Metrics for labelled Markov processes\n", "abstract": " The notion of process equivalence of probabilistic processes is sensitive to the exact probabilities of transitions. Thus, a slight change in the transition probabilities will result in two equivalent processes being deemed no longer equivalent. This instability is due to the quantitative nature of probabilistic processes. In a situation where the process behavior has a quantitative aspect there should be a more robust approach to process equivalence. This paper studies a metric between labelled Markov processes. This metric has the property that processes are at zero distance if and only if they are bisimilar. The metric is inspired by earlier work on logics for characterizing bisimulation and is related, in spirit, to the Hutchinson metric.", "num_citations": "342\n", "authors": ["1877"]}
{"title": "Bisimulation for labelled Markov processes\n", "abstract": " In this paper we introduce a new class of labelled transition systems—labelled Markov processes— and define bisimulation for them. Labelled Markov processes are probabilistic labelled transition systems where the state space is not necessarily discrete. We assume that the state space is a certain type of common metric space called an analytic space. We show that our definition of probabilistic bisimulation generalizes the Larsen–Skou definition given for discrete systems. The formalism and mathematics is substantially different from the usual treatment of probabilistic process algebra. The main technical contribution of the paper is a logical characterization of probabilistic bisimulation. This study revealed some unexpected results, even for discrete probabilistic systems. •Bisimulation can be characterized by a very weak modal logic. The most striking feature is that one has no negation or any kind of negative …", "num_citations": "324\n", "authors": ["1877"]}
{"title": "Anonymity protocols as noisy channels\n", "abstract": " We consider a framework in which anonymity protocols are interpreted as noisy channels in the information-theoretic sense, and we explore the idea of using the notion of capacity as a measure of the loss of anonymity. Such idea was already suggested by Moskowitz, Newman and Syverson, in their analysis of the covert channel that can be created as a result of non-perfect anonymity. We consider the case in which some leak of information is intended by design, and we introduce the notion of conditional capacity to rule out this factor, thus retrieving a natural correspondence with the notion of anonymity. Furthermore, we show how to compute the capacity and the conditional capacity when the anonymity protocol satisfies certain symmetries. We also investigate how the adversary can test the system to try to infer the user’s identity, and we study how his probability of success depends on the characteristics of the …", "num_citations": "260\n", "authors": ["1877"]}
{"title": "Metrics for Finite Markov Decision Processes.\n", "abstract": " Markov decision processes (MDPs) offer a popular mathematical tool for planning and learning in the presence of uncertainty (Boutilier, Dean, & Hanks 1999). MDPs are a standard formalism for describing multi-stage decision making in probabilistic environments. The objective of the decision making is to maximize a cumulative measure of longterm performance, called the return. Dynamic programming algorithms, eg, value iteration or policy iteration (Puterman 1994), allow us to compute the optimal expected return for any state, as well as the way of behaving (policy) that generates this return. However, in many practical applications the state space of an MDP is simply too large, possibly even continuous, for such standard algorithms to be applied. A typical means of overcoming such circumstances is to partition the state space in the hope of obtaining an “essentially equivalent” reduced system. One defines a new MDP over the partition blocks, and if it is small enough, it can be solved by classical methods. The hope is that optimal values and policies for the reduced MDP can be extended to optimal values and policies for the original MDP. The notion of equivalence for stochastic processes is problematic because it requires that the transition probabilities agree exactly. This is not a robust concept, especially considering that usually, the numbers used in probabilistic models come from experimentation or are approximate estimates; what is needed is a quantitative notion of equivalence. In our work we provide such a notion via semimetrics, distance functions on the state space that assign distances quantifying “how equivalent” states are. These …", "num_citations": "228\n", "authors": ["1877"]}
{"title": "Labelled Markov Processes\n", "abstract": " Labelled Markov processes are probabilistic versions of labelled transition systems with continuous state spaces. The book covers basic probability and measure theory on continuous state spaces and then develops the theory of LMPs. The main topics covered are bisimulation, the logical characterization of bisimulation, metrics and approximation theory. An unusual feature of the book is the connection made with categorical and domain theoretic concepts.", "num_citations": "217\n", "authors": ["1877"]}
{"title": "The measurement calculus\n", "abstract": " Measurement-based quantum computation has emerged from the physics community as a new approach to quantum computation where the notion of measurement is the main driving force of computation. This is in contrast with the more traditional circuit model that is based on unitary operations. Among measurement-based quantum computation methods, the recently introduced one-way quantum computer [Raussendorf and Briegel 2001] stands out as fundamental. We develop a rigorous mathematical model underlying the one-way quantum computer and present a concrete syntax and operational semantics for programs, which we call patterns, and an algebra of these patterns derived from a denotational semantics. More importantly, we present a calculus for reasoning locally and compositionally about these patterns. We present a rewrite theory and prove a general standardization theorem which allows all …", "num_citations": "212\n", "authors": ["1877"]}
{"title": "Metrics for labeled Markov systems\n", "abstract": " Partial Labeled Markov Chains (plMc) generalize process algebra and traditional Markov chains. They provide a foundation for interacting discrete probabilistic systems. Existing notions of process equivalence are too sensitive to the exact probabilities of transitions in plMcs. This paper studies more robust notions of “approximate” equivalence between plMcs.", "num_citations": "193\n", "authors": ["1877"]}
{"title": "The metric analogue of weak bisimulation for probabilistic processes\n", "abstract": " We observe that equivalence is not a robust concept in the presence of numerical information - such as probabilities-in the model. We develop a metric analogue of weak bisimulation in the spirit of our earlier work on metric analogues for strong bisimulation. We give a fixed point characterization of the metric. This makes available conductive reasoning principles and allows us to prove metric analogues of the usual algebraic laws for process combinators. We also show that quantitative properties of interest are continuous with respect to the metric, which says that if two processes are close in the metric then observable quantitative properties of interest are indeed close. As an important example of this we show that nearby processes have nearby channel capacities - a quantitative measure of their propensity to leak information.", "num_citations": "186\n", "authors": ["1877"]}
{"title": "A logic for reasoning about security\n", "abstract": " A formal framework called Security Logic (SL) is developed for specifying and reasoning about security policies and for verifying that system designs adhere to such policies. Included in this modal logic framework are definitions of knowledge, permission, and obligation. Permission is used to specify secrecy policies and obligation to specify integrity policies. The combination of policies is addressed and examples based on policies from the current literature are given.", "num_citations": "181\n", "authors": ["1877"]}
{"title": "Scaling behavior of interacting quantum fields in curved spacetime\n", "abstract": " We propose a version of the't Hooft-Weinberg renormalization-group equation which is valid in general curved spacetimes. The key idea is to regard the Green's functions as functions of the metric and to scale the metric rather than the coordinates or momenta. We apply these equations to the infrared limit of the effective conformal coupling in λ φ 4 theory.", "num_citations": "172\n", "authors": ["1877"]}
{"title": "A design study of the EARTH multiprocessor.\n", "abstract": " Multithreaded node architectures have been proposed for future multiprocessor systems. However, some open issues remain: can e cient multithreading support be provided in a multiprocessor machine such that it is capable of tolerating synchronization and communication latencies, with little intrusion on the performance of sequentially-executed code? Also, how much (quantitatively) does such non-intrusive multithreading support contribute to the scalable parallel performance in the presence of increasing interprocessor communication and synchronization demands? In this paper, we describe the design of EARTH (E-cient Architecture for Running THreads), which attempts to address the above issues. Each processor in EARTH has an o-the-shelf RISC processor for executing threads, and an ASIC Synchronization Unit (SU) supporting data owlike thread synchronizations, scheduling, and remote memory requests. In preparation for an implementation of the SU, we have emulated a basic EARTH model on MANNA 2.0, an existing multiprocessor whose hardware con guration closely matches EARTH. This EARTH-MANNA emulation testbed has been fully functional, enabling us to experiment with large-scale benchmarks with impressive speed. With this platform, we demonstrate that multithreading support can be e ciently implemented (with little emulation overhead) in a multiprocessor without a major impact on uniprocessor performance. Also, we give our rst quantitative indications of how much the basic multithreading support can help in tolerating increasing communication/synchronization demands.", "num_citations": "154\n", "authors": ["1877"]}
{"title": "Approximating labelled Markov processes\n", "abstract": " Labelled Markov processes are probabilistic versions of labelled transition systems. In general, the state space of a labelled Markov process may be a continuum. In this paper, we study approximation techniques for continuous-state labelled Markov processes. We show that the collection of labelled Markov processes carries a Polish-space structure with a countable basis given by finite-state Markov chains with rational probabilities; thus permitting the approximation of quantitative observations (eg, an integral of a continuous function) of a continuous-state labelled Markov process by the observations on finite-state Markov chains. The primary technical tools that we develop to reach these results are• A variant of a finite-model theorem for the modal logic used to characterize bisimulation, and• an isomorphism between the poset of Markov processes (ordered by simulation) with the ω-continuous dcpo Proc (defined …", "num_citations": "141\n", "authors": ["1877"]}
{"title": "Quantum weakest preconditions\n", "abstract": " We develop a notion of predicate transformer and, in particular, the weakest precondition, appropriate for quantum computation. We show that there is a Stone-type duality between the usual state-transformer semantics and the weakest precondition semantics. Rather than trying to reduce quantum computation to probabilistic programming, we develop a notion that is directly taken from concepts used in quantum computation. The proof that weakest preconditions exist for completely positive maps follows immediately from the Kraus representation theorem. As an example, we give the semantics of Selinger's language in terms of our weakest preconditions. We also cover some specific situations and exhibit an interesting link with stabilisers.", "num_citations": "129\n", "authors": ["1877"]}
{"title": "Bisimulation for labelled Markov processes\n", "abstract": " In this paper we introduce a new class of labelled transition systems-Labelled Markov Processes-and define bisimulation for them. Labelled Markov processes are probabilistic labelled transition systems where the state space is not necessarily discrete, it could be the reals, for example. We assume that it is a Polish space (the underlying topological space for a complete separable metric space). The mathematical theory of such systems is completely new from the point of view of the extant literature on probabilistic process algebra; of course, it uses classical ideas from measure theory and Markov process theory. The notion of bisimulation builds on the ideas of Larsen and Skou and of Joyal, Nielsen and Winskel. The main result that we prove is that a notion of bisimulation for Markov processes on Polish spaces, which extends the Larsen-Skou definition for discrete systems, is indeed an equivalence relation. This …", "num_citations": "123\n", "authors": ["1877"]}
{"title": "The computational power of the W and GHZ states\n", "abstract": " It is well understood that the use of quantum entanglement significantly enhances the computational power of systems. Much of the attention has focused on Bell states and their multipartite generalizations. However, in the multipartite case it is known that there are several inequivalent classes of states, such as those represented by the W-state and the GHZ-state. Our main contribution is a demonstration of the special computational power of these states in the context of paradigmatic problems from classical distributed computing. Concretely, we show that the W-state is the only pure state that can be used to exactly solve the problem of leader election in anonymous quantum networks. Similarly we show that the GHZ-state is the only one that can be used to solve the problem of distributed consensus when no classical post-processing is considered. These results generalize to a family of W- and GHZ-like states. At the heart of the proofs of these impossibility results lie symmetry arguments.", "num_citations": "120\n", "authors": ["1877"]}
{"title": "Continuous stochastic logic characterizes bisimulation of continuous-time Markov processes\n", "abstract": " In a recent paper Baier et al. [Lecture Notes in Computer Science, Springer-Verlag, 2000, p. 358] analyzed a new way of model-checking formulas of a logic for continuous-time processes—called continuous stochastic logic (henceforth CSL)—against continuous-time Markov chains—henceforth CTMCs. One of the important results of that paper was the proof that if two CTMCs were bisimilar then they would satisfy exactly the same formulas of CSL. This raises the converse question—does satisfaction of the same collection of CSL formulas imply bisimilarity? In other words, given two CTMCs which are known to satisfy exactly the same formulas of CSL does it have to be the case that they are bisimilar? We prove that the answer to the question just raised is “yes”. In fact we prove a significant extension, namely that a subset of CSL suffices even for systems where the state space may be a continuum. Along the way we …", "num_citations": "114\n", "authors": ["1877"]}
{"title": "Nuclear and trace ideals in tensored∗-categories\n", "abstract": " We generalize the notion of nuclear maps from functional analysis by defining nuclear ideals in tensored∗-categories. The motivation for this study came from attempts to generalize the structure of the category of relations to handle what might be called “probabilistic relations”. The compact closed structure associated with the category of relations does not generalize directly, instead one obtains nuclear ideals. Most tensored∗-categories have a large class of morphisms which behave as if they were part of a compact closed category, ie they allow one to transfer variables between the domain and the codomain. We introduce the notion of nuclear ideals to analyze these classes of morphisms. In compact closed tensored∗-categories, all morphisms are nuclear, and in the tensored∗-category of Hilbert spaces, the nuclear morphisms are the Hilbert–Schmidt maps. We also introduce two new examples of tensored∗ …", "num_citations": "106\n", "authors": ["1877"]}
{"title": "On the Bayes risk in information-hiding protocols\n", "abstract": " Randomized protocols for hiding private information can be regarded as noisy channels in the information-theoretic sense, and the inference of the concealed information can be regarded as a hypothesis-testing problem. We consider the Bayesian approach to the problem, and investigate the probability of error associated to the MAP (maximum a posteriori probability) inference rule. Our main result is a constructive characterization of a convex base of the probability of error, which allows us to compute its maximum value (over all possible input distributions), and to identify upper bounds for it in terms of simple functions. As a side result, we are able to improve the Hellman–Raviv and the Santhi–Vardy bounds expressed in terms of conditional entropy. We then discuss an application of our methodology to the Crowds protocol, and in particular we show how to compute the bounds on the probability that an adversary …", "num_citations": "105\n", "authors": ["1877"]}
{"title": "Bisimulation and cocongruence for probabilistic systems\n", "abstract": " We introduce a new notion of bisimulation, called event bisimulation on labelled Markov processes (LMPs) and compare it with the, now standard, notion of probabilistic bisimulation, originally due to Larsen and Skou. Event bisimulation uses a sub σ-algebra as the basic carrier of information rather than an equivalence relation. The resulting notion is thus based on measurable subsets rather than on points: hence the name. Event bisimulation applies smoothly for general measure spaces; bisimulation, on the other hand, is known only to work satisfactorily for analytic spaces. We prove the logical characterization theorem for event bisimulation without having to invoke any of the subtle aspects of analytic spaces that feature prominently in the corresponding proof for ordinary bisimulation. These complexities only arise when we show that on analytic spaces the two concepts coincide. We show that the concept of …", "num_citations": "105\n", "authors": ["1877"]}
{"title": "A logical characterization of bisimulation for labeled Markov processes\n", "abstract": " This paper gives a logical characterization of probabilistic bisimulation for Markov processes. Bisimulation can be characterized by a very weak modal logic. The most striking feature is that one has no negation or any kind of negative proposition. Bisimulation can be characterized by several inequivalent logics; we report five in this paper and there are surely many more. We do not need any finite branching assumption yet there is no need of infinitely conjunction. We give an algorithm for deciding bisimilarity of finite state systems which constructs a formula that witnesses the failure of bisimulation.", "num_citations": "105\n", "authors": ["1877"]}
{"title": "Computations, residuals, and the power of indeterminacy\n", "abstract": " We investigate the power of Kahn-style dataflow networks, with processes that may exhibit indeterminate behavior. Our main result is a theorem about networks of “monotone” processes, which shows: (1) that the input/output relation of such a network is a total and monotone relation; and (2) every relation that is total, monotone, and continuous in a certain sense, is the input/output relation of such a network. Now, the class of monotone networks includes networks that compute arbitrary continuous input/output functions, an “angelic merge” network, and an “infinity-fair merge” network that exhibits countably indeterminate branching. Since the “fair merge” relation is neither monotone nor continuous, a corollary of our main result is the impossibility of implementing fair merge in terms of continuous functions, angelic merge, and infinity-fair merge.             Our results are established by applying the powerful …", "num_citations": "93\n", "authors": ["1877"]}
{"title": "Well-behaved dataflow programs for DSP computation\n", "abstract": " Accumulation of tokens on the arcs of a dataflow program operating on potentially infinite streams in a DSP computation leads to unbounded storage requirement. Compile-time techniques to determine the storage requirement are essential for efficient scheduling. A class of program graphs called regular stream flow graphs is studied. Restricting the construction to a set of construction rules facilitates compile-time predictability of storage requirement. Compared to existing methods, the model has a stronger verifiability, which is due to the structure of the well-constructed graphs.", "num_citations": "91\n", "authors": ["1877"]}
{"title": "On renormalisation of λϕ4 field theory in curved space-time. I\n", "abstract": " Renormalisation of lambda phi 4 theory in curved space-time is considered in the interaction picture. A generalisation of normal ordering to curved space-time is introduced, based on the construction of adiabatic particle states in Robertson-Walker space-time. Dimensional regularisation is used to define uniquely the divergent quantities which are removed by normal ordering. It is shown that this normal ordering is sufficient to make finite all physical processes including vacuum polarisation to first order in lambda. An alternative and equivalent procedure is given which requires renormalisation of the mass and of the constant which couples the field to the Ricci scalar. The stress tensor is found to be finite to first order in lambda and it is shown that if the free-field theory in a Robertson-Walker universe predicts that particles are created by the gravitational field with a black-body spectrum then this spectrum is …", "num_citations": "87\n", "authors": ["1877"]}
{"title": "Concurrent common knowledge: defining agreement for asynchronous systems\n", "abstract": " In this paper we present a new, knowledgetheoretic definition of agreement designed for asynchronous systems. In analogy with common knowledge, it is calledconcurrent common knowledge. Unlike common knowledge, it is a form of agreement that is attainable asynchronously. In defining concurrent common knowledge, we give a logic with new modal operators and a formal semantics, both of which are based on causality and consequently capture only the relevant structure of purely asynchronous systems. We give general conditions by which protocols attain concurrent common knowledge and prove that two simple and efficient protocols do so. We also present several applications of our logic. We show that concurrent common knowledge is a necessary and sufficient condition for the concurrent performance of distributed actions. We also demonstrate the role of knowledge in taking snapshots for …", "num_citations": "86\n", "authors": ["1877"]}
{"title": "A domain of spacetime intervals in general relativity\n", "abstract": " We prove that a globally hyperbolic spacetime with its causality relation is a bicontinuous poset whose interval topology is the manifold topology. From this one can show that from only a countable dense set of events and the causality relation, it is possible to reconstruct a globally hyperbolic spacetime in a purely order theoretic manner. The ultimate reason for this is that globally hyperbolic spacetimes belong to a category that is equivalent to a special category of domains called interval domains. We obtain a mathematical setting in which one can study causality independently of geometry and differentiable structure, and which also suggests that spacetime emerges from something discrete.", "num_citations": "80\n", "authors": ["1877"]}
{"title": "Bisimulation metrics for continuous Markov decision processes\n", "abstract": " In recent years, various metrics have been developed for measuring the behavioral similarity of states in probabilistic transition systems [J. Desharnais et al., Proceedings of CONCUR'99, Springer-Verlag, London, 1999, pp. 258–273; F. van Breugel and J. Worrell, Proceedings of ICALP'01, Springer-Verlag, London, 2001, pp. 421–432]. In the context of finite Markov decision processes (MDPs), we have built on these metrics to provide a robust quantitative analogue of stochastic bisimulation [N. Ferns, P. Panangaden, and D. Precup, Proceedings of UAI-04, AUAI Press, Arlington, VA, 2004, pp. 162–169] and an efficient algorithm for its calculation [N. Ferns, P. Panangaden, and D. Precup, Proceedings of UAI-06, AUAI Press, Arlington, VA, 2006, pp. 174–181]. In this paper, we seek to properly extend these bisimulation metrics to MDPs with continuous state spaces. In particular, we provide the first distance-estimation …", "num_citations": "78\n", "authors": ["1877"]}
{"title": "Stochastic processes as concurrent constraint programs\n", "abstract": " This paper describes a stochastic concurrent constraint language for the description and programming of concurrent probabilistic systems. The language can be viewed both as a calculus for describing and reasoning about stochastic processes and as an executable language for simulating stochastic processes. In this language programs encode probability distributions over (potentially infinite) sets of objects. We illustrate the subtleties that arise from the interaction of constraints, random choice and recursion. We describe operational semantics of these programs (programs are run by sampling random choices), denotational semantics of programs (based on labeled transition systems and weak probabilistic bisimulation), and prove soundness theorems. We show that Probabilistic CC is conservative over CC, thus justifying the design of Probabilistic CC. We use the semantic study to illustrate a novel use of …", "num_citations": "77\n", "authors": ["1877"]}
{"title": "Methods for computing state similarity in Markov decision processes\n", "abstract": " A popular approach to solving large probabilistic systems relies on aggregating states based on a measure of similarity. Many approaches in the literature are heuristic. A number of recent methods rely instead on metrics based on the notion of bisimulation, or behavioral equivalence between states (Givan et al, 2001, 2003; Ferns et al, 2004). An integral component of such metrics is the Kantorovich metric between probability distributions. However, while this metric enables many satisfying theoretical properties, it is costly to compute in practice. In this paper, we use techniques from network optimization and statistical sampling to overcome this problem. We obtain in this manner a variety of distance functions for MDP state aggregation, which differ in the tradeoff between time and space complexity, as well as the quality of the aggregation. We provide an empirical evaluation of these trade-offs.", "num_citations": "73\n", "authors": ["1877"]}
{"title": "Metrics for Markov decision processes with infinite state spaces\n", "abstract": " We present metrics for measuring state similarity in Markov decision processes (MDPs) with infinitely many states, including MDPs with continuous state spaces. Such metrics provide a stable quantitative analogue of the notion of bisimulation for MDPs, and are suitable for use in MDP approximation. We show that the optimal value function associated with a discounted infinite horizon planning task varies continuously with respect to our metric distances.", "num_citations": "70\n", "authors": ["1877"]}
{"title": "On renormalisation of λϕ4 field theory in curved space-time. II\n", "abstract": " For pt. I see ibid., vol. 13, p. 901 (1980). An explicit renormalisation of all second-order physical processes occurring in lambda phi 4 field theory in conformally flat space-time, including vacuum-to-vacuum processes, is performed. Although divergences dependent on the definition of the vacuum state appear in some Feynman diagrams, physical amplitudes obtained by summing all diagrams which contribute to a single physical process are independent of these divergences. Consequently, the theory remains renormalisable in curved space-time, at least to second order in lambda. Renormalisations of the mass m, the coupling constant lambda and the constant xi which couples the field to the Ricci scalar are required to make two-and four-particle creation amplitudes finite.", "num_citations": "70\n", "authors": ["1877"]}
{"title": "Algebra-coalgebra duality in Brzozowski's minimization algorithm\n", "abstract": " We give a new presentation of Brzozowski's algorithm to minimize finite automata using elementary facts from universal algebra and coalgebra and building on earlier work by Arbib and Manes on a categorical presentation of Kalman duality between reachability and observability. This leads to a simple proof of its correctness and opens the door to further generalizations. Notably, we derive algorithms to obtain minimal language equivalent automata from Moore nondeterministic and weighted automata.", "num_citations": "62\n", "authors": ["1877"]}
{"title": "The category of Markov kernels\n", "abstract": " Markov kernels are fundamental objects in probability theory. One can define a category based on Markov kernels which has many of the formal properties of the ordinary category of relations. In the present paper we will examine the categorical properties of Markov kernels and stress the analogies and differences with the category of relations. We will show that this category has partially-additive structure and, as such, supports basic constructs like iteration. This allows one to give a probabilistic semantics for a language with while loops in the manner of Kozen. The category in question was originally defined by Giry following suggestions of Lawvere.", "num_citations": "61\n", "authors": ["1877"]}
{"title": "Bounding performance loss in approximate MDP homomorphisms\n", "abstract": " We define a metric for measuring behavior similarity between states in a Markov decision process (MDP), which takes action similarity into account. We show that the kernel of our metric corresponds exactly to the classes of states defined by MDP homomorphisms (Ravindran & Barto, 2003). We prove that the difference in the optimal value function of different states can be upper-bounded by the value of this metric, and that the bound is tighter than previous bounds provided by bisimulation metrics (Ferns et al. 2004, 2005). Our results hold both for discrete and for continuous actions. We provide an algorithm for constructing approximate homomorphisms, by using this metric to identify states that can be grouped together, as well as actions that can be matched. Previous research on this topic is based mainly on heuristics.", "num_citations": "59\n", "authors": ["1877"]}
{"title": "The essence of concurrent ML\n", "abstract": " Concurrent ML (CML) is a programming language that integrates high-level abstraction mechanisms with concurrency primitives. Like other similar, recent languages, CML embodies the idea that concurrent programming can be done in a modern high-level language like ML. The fundamental new ingredient is the notion of a (polymorphic) event. This is a piece of code packaged as a new abstraction. Combinators are provided to build new events from old ones. The key subtlety is the interaction of external choice with abstraction. Ordinary functional abstraction conceals the communication actions on which choices need to be made. The event mechanism allows one to build abstractions that expose the communication. The language CML features mobility, polymorphism, and ordinary lambda-abstraction as well as events. In this article we discuss the basic features and explain how CML can be used to …", "num_citations": "56\n", "authors": ["1877"]}
{"title": "Quantitative algebraic reasoning\n", "abstract": " We develop a quantitative analogue of equational reasoning which we call quantitative algebra. We define an equality relation indexed by rationals: a= ε b which we think of as saying that\" a is approximately equal to b up to an error of ε\". We have 4 interesting examples where we have a quantitative equational theory whose free algebras correspond to well known structures. In each case we have finitary and continuous versions. The four cases are: Hausdorff metrics from quantitive semilattices; p-Wasserstein metrics (hence also the Kantorovich metric) from barycentric algebras and also from pointed barycentric algebras and the total variation metric from a variant of barycentric algebras.", "num_citations": "54\n", "authors": ["1877"]}
{"title": "Spatial and epistemic modalities in constraint-based process calculi\n", "abstract": " We introduce spatial and epistemic process calculi for reasoning about spatial information and knowledge distributed among the agents of a system. We introduce domain-theoretical structures to represent spatial and epistemic information. We provide operational and denotational techniques for reasoning about the potentially infinite behaviour of spatial and epistemic processes. We also give compact representations of infinite objects that can be used by processes to simulate announcements of common knowledge and global information.", "num_citations": "53\n", "authors": ["1877"]}
{"title": "Probabilistic relations\n", "abstract": " The notion of binary relation is fundamental in logic. What is the correct analogue of this concept in the probabilistic case? I will argue that the notion of conditional probability distribution (Markov kernel, stochastic kernel) is the correct generalization. One can de ne a category based on stochastic kernels which has many of the formal properties of the ordinary category of relations. Using this concept I will show how to de ne iteration in this category and give a simple treatment of Kozen's language of while loops and probabilistic choice. I will use the concept of stochastic relation to introduce some of the ongoing joint work with Edalat and Desharnais on Labeled Markov Processes. In my talk I will assume that people do not know what partially additive categories are but that they do know basic category theory and basic notions like measure and probability. This work is mainly due to Kozen, Giry, Lawvere and others.", "num_citations": "53\n", "authors": ["1877"]}
{"title": "The expressive power of indeterminate dataflow primitives\n", "abstract": " We analyze the relative expressive power of variants of the indeterminate fair merge operator in the context of static dataflow. We establish that there are three different, provably inequivalent, forms of unbounded indeterminacy. In particular, we show that the well-known fair merge primitive cannot be expressed with just unbounded indeterminacy. Our proofs are based on a simple trace semantics and on identifying properties of the behaviors of networks that are invariant under network composition. The properties we consider in this paper are all generalizations of monotonicity.", "num_citations": "51\n", "authors": ["1877"]}
{"title": "Infinite objects in type theory\n", "abstract": " In this paper we show how infinite objects can be defined in a constructive  type theory. The type theory that we use is a variant of Martin-Lof's  Intuitionistic Type Theory. We show how one can express the intuition that  infinite objects are understood through a limiting process without having to  introduce partial objects in the theory. This means that we can adhere to the  propositions-as-types principle. The type of infinite objects thus contains  only total elements. The approximation is expressed through a sequence of  types that approximate the type of infinite objects. We give two semantic  accounts of types of infinite objects. The first is lattice theoretic and  shows how these types can be understood as fixed points. The second is  category theoretic and shows the duality between types of infinite objects  and the ordinary recursive type definitions.", "num_citations": "49\n", "authors": ["1877"]}
{"title": "Probability distribution for radiation from a black hole in the presence of incoming radiation\n", "abstract": " Using only results from quantum field theory in curved space-time, we derive the formula for the probability that k particles in a given mode will emerge from a Kerr black hole if j particles in that mode are sent in at late times. Our formula agrees with the formula previously derived by Page and by Bekenstein and Meisels using other arguments. In particular, this proves that a Schwarzschild black hole responds to incoming radiation exactly as a blackbody does.", "num_citations": "47\n", "authors": ["1877"]}
{"title": "Concurrent common knowledge: A new definition of agreement for asynchronous systems\n", "abstract": " In this paper we discuss a new knowledgetheoretic definition of agreement appropriate to asynchronous systems. This definition has two important features; first, it uses causality rather than time in its definition and, second, this form of agreement is attainable. In analogy with common knowledge, it is called concurrent common knowledge. Concurrent common knowledge has several applications and we give analyses of two examples that use it. In general, it seems to be the case that applications that involve all processes reaching agreement about some property of a consistent global state are protocols that use concurrent common knowledge.", "num_citations": "46\n", "authors": ["1877"]}
{"title": "Private information via the Unruh effect\n", "abstract": " In a relativistic theory of quantum information, the possible presence of horizons is a complicating feature placing restrictions on the transmission and retrieval of information. We consider two inertial participants communicating via a noiseless qubit channel in the presence of a uniformly accelerated eavesdropper. Owing to the Unruh effect, the eavesdropper's view of any encoded information is noisy, a feature the two inertial participants can exploit to achieve perfectly secure quantum communication. We show that the associated private quantum capacity is equal to the entanglement-assisted quantum capacity for the channel to the eavesdropper's environment, which we evaluate for all accelerations.", "num_citations": "45\n", "authors": ["1877"]}
{"title": "Weak bisimulation is sound and complete for PCTL\n", "abstract": " We investigate weak bisimulation of probabilistic systems in the presence of nondeterminism, i.e. labelled concurrent Markov chains (LCMC) with silent transitions. We build on the work of Philippou, Lee and Sokolsky [17] for finite state LCMCs. Their definition of weak bisimulation destroys the additivity property of the probability distributions, yielding instead capacities. The mathematics behind capacities naturally captures the intuition that when we deal with nondeterminism we must work with estimates on the possible probabilities.               Our analysis leads to three new developments: - We identify an axiomatization of “image finiteness” for countable state systems and present a new definition of weak bisimulation for these LCMCs. We prove that our definition coincides with that of Philippou, Lee and Sokolsky for finite state systems. - We show that bisimilar states have matching computations. The notion of …", "num_citations": "45\n", "authors": ["1877"]}
{"title": "Probability of error in information-hiding protocols\n", "abstract": " Randomized protocols for hiding private information can fruitfully be regarded as noisy channels in the information-theoretic sense, and the inference of the concealed information can be regarded as a hypothesis-testing problem. We consider the Bayesian approach to the problem, and investigate the probability of error associated to the inference when the MAP (maximum aposteriori probability) decision rule is adopted. Our main result is a constructive characterization of a convex base of the probability of error, which allows us to compute its maximum value (over all possible input distributions), and to identify upper bounds for it in terms of simple functions. As a side result, we are able to improve substantially the Hellman-Raviv and the Santhi-Vardy bounds expressed in terms of conditional entropy. We then discuss an application of our methodology to the Crowds protocol, and in particular we show how to …", "num_citations": "44\n", "authors": ["1877"]}
{"title": "Minimization via duality\n", "abstract": " We show how to use duality theory to construct minimized versions of a wide class of automata. We work out three cases in detail: (a variant of) ordinary automata, weighted automata and probabilistic automata. The basic idea is that instead of constructing a maximal quotient we go to the dual and look for a minimal subalgebra and then return to the original category. Duality ensures that the minimal subobject becomes the maximally quotiented object.", "num_citations": "43\n", "authors": ["1877"]}
{"title": "Discrete quantum causal dynamics\n", "abstract": " We give a mathematical framework to describe the evolution of open quantum systems subject to finitely many interactions with classical apparatuses and with each other. The systems in question may be composed of distinct, spatially separated subsystems which evolve independently, but may also interact. This evolution, driven both by unitary operators and measurements, is coded in a mathematical structure in such a way that the crucial properties of causality, covariance, and entanglement are faithfully represented. The key to this scheme is the use of a special family of spacelike slices—we call them locative—that are not so large as to result in acausal influences but large enough to capture nonlocal correlations.", "num_citations": "42\n", "authors": ["1877"]}
{"title": "Approximating labeled Markov processes\n", "abstract": " We study approximate reasoning about continuous-state labeled Markov processes. We show how to approximate a labeled Markov process by a family of finite-state labeled Markov chains. We show that the collection of labeled Markov processes carries a Polish space structure with a countable basis given by finite state Markov chains with rational probabilities. The primary technical tools that we develop to reach these results are: a finite-model theorem for the modal logic used to characterize bisimulation; and a categorical equivalence between the category of Markov processes (with simulation morphisms) with the /spl omega/-continuous dcpo Proc, defined as the solution of the recursive domain equation Proc=/spl Pi//sub Labels/ P/sub Prob/(Proc). The correspondence between labeled Markov processes and Proc yields a logic complete for reasoning about simulation for continuous-state processes.", "num_citations": "42\n", "authors": ["1877"]}
{"title": "Semantics of networks containing indeterminate operators\n", "abstract": " We discuss a denotational semantics for networks containing indeterminate operators. Our approach is based on modelling a network by the set of all its possible behaviors. Our notion of behavior is a sequence of computational actions. The primitive computational action is an event: the appearance or consumption of a token on a data path. A sequence of such events is called a history and a set of such histories is called an archive. We give composition rules that allow us to derive an archive for a network from the archive of its constituents. Causal and operational constraints on network behavior are encoded into the definitions of archives. We give a construction that allows us to obtain the denotation of networks containing loops by a process of successive approximations. This construction is not carried out in the traditional domain-theoretic setting, but rather resembles the category theoretic notion of limit …", "num_citations": "42\n", "authors": ["1877"]}
{"title": "Parsimonious and robust realizations of unitary maps in the one-way model\n", "abstract": " We present a new set of generators for unitary maps over C 2 which differs from the traditional rotation-based generating set in that it uses a single-parameter family of unitaries J (α). These generators are implementable in the one-way model [Raussendorf and Briegel, Phys. Rev. Lett. 86, 5188 (2001)] using only two qubits, and lead to both parsimonious and robust implementations of general unitaries. As an illustration, we give an implementation of the controlled-U family which uses only 14 qubits, and has a 2-colorable underlying entanglement graph (known to yield robust entangled states).", "num_citations": "41\n", "authors": ["1877"]}
{"title": "A logical view of concurrent constraint programming\n", "abstract": " Concurrent Constraint Programming (CCP) has been the subject of growing interest as the focus of a new paradigm for concurrent computation. Like logic programming it claims close relations to logic. In fact CCP languages are logics in a certain sense that we make precise in this paper. In recent work it was shown that the denotational semantics of determinate concurrent constraint programming languages forms a bred categorical structure called a hyperdoctrine, which is used as the basis of the categorical formulation of rst order logic. What this shows is that the combinators of determinate CCP can be viewed as logical connectives. In this paper we extend these ideas to the operational semantics of such languages and thus make available similar analogies for a much broader variety of languages including indeterminate CCP languages and concurrent block-structured imperative languages.", "num_citations": "41\n", "authors": ["1877"]}
{"title": "Stability and sequentiality in dataflow networks\n", "abstract": " The class of monotone input/output automata has been shown in the authors' previous work to be a useful operational model for dataflow-style networks of communicating processes. An interesting class of problems arising from this model are those that concern the relationship between the input/output behavior of automata to the structure of their transition graphs. In this paper, we restrict our attention to the subclass of determinate automata, which compute continuous functions, and we characterize classes of determinate automata that compute: (1) the class of functions that are stable in the sense of Berry, and (2) the class of functions that are sequential in the sense of Kahn and Plotkin.", "num_citations": "41\n", "authors": ["1877"]}
{"title": "Quantum communication in Rindler spacetime\n", "abstract": " A state that an inertial observer in Minkowski space perceives to be the vacuum will appear to an accelerating observer to be a thermal bath of radiation. We study the impact of this Davies-Fulling-Unruh noise on communication, particularly quantum communication from an inertial sender to an accelerating observer and private communication between two inertial observers in the presence of an accelerating eavesdropper. In both cases, we establish compact, tractable formulas for the associated communication capacities assuming encodings that allow a single excitation in one of a fixed number of modes per use of the communications channel. Our contributions include a rigorous presentation of the general theory of the private quantum capacity as well as a detailed analysis of the structure of these channels, including their group-theoretic properties and a proof that they are conjugate degradable …", "num_citations": "40\n", "authors": ["1877"]}
{"title": "A fully abstract semantics for a first-order functional language with logic variables\n", "abstract": " There is much interest in combining the functional and logic programming paradigms; in particular, there have been several proposals for adding logic variables to functional languages, since that permits incremental construction of data structures through constraint intersection, While it is straightforward to give an abstract semantics for functional languages and for logic languages, it has proven surprisingly difficult to give a proper semantic account of functional languages with logic variables. We solve this problem in this paper. First, we present a first-order functional language with logic variables and give its meaning using a structural operational semantics. Then, we give it a denotational semantics, using a novel technique involving closure operators on a Scott domain. Finally, we show that these two semantics correspond in the strongest possible way: we show that the denotational semantics is fully abstract with …", "num_citations": "38\n", "authors": ["1877"]}
{"title": "One-loop renormalization of quantum electrodynamics in curved spacetime\n", "abstract": " In this paper we discuss the renormalizability of quantum electrodynamics (QED) in a general curved spacetime. A generating functional is introduced and position-space Feynman rules are obtained. Functional techniques are used to show that a form of Ward's identity can be derived in curved spacetime. A local momentum representation for the scalar and vector propagators is introduced. The one-loop diagrams for the electron and photon self-energy are computed and it is shown that there are no divergences that are not present in flat space. It is shown that this latter result depends crucially on the gauge invariance of the theory and is not merely a trivial consequence of renormalizability of QED in flat spacetime.", "num_citations": "38\n", "authors": ["1877"]}
{"title": "Extended measurement calculus\n", "abstract": " Measurement-based quantum computation (MBQC) has emerged as a new approach to quantum computation where the notion of measurement is the main driving force of computation. This is in contrast with the more traditional circuit model that takes unitary operations as fundamental. Among measurement-based quantum computation methods the recently introduced one-way quantum computer stands out as basic and ﬁmdamental. The key idea is to start from an entangled state and then use measurements and one-qubit unitaries, which may be dependent on the outcomes of measurements, to guide the computation. The main point is that one never has to perform unitaries on more than one qubit at a time after the initial preparation of an entangled state. The “programs” that one writes in this model are traditionally called “patterns.” In this chapter, we develop a rigorous mathematical model underlying measurement-based quantum computation. We give syntax, operational semantics, denotational semantics, and an algebra of programs derived from the denotational semantics. We also present a rewrite theory and prove a general standardization theorem that allows all programs to be put in a semantically equivalent standard form. Standardization has far—reaching consequences: a new physical architecture based on performing all the entanglement in the beginning, parallelization by exposing the dependency structure of measurements, and expressiveness theorems. We use our general measurement calculus not just to formalize the one-way model but also several other measurement-based models, eg, Teleportation, Phase, and Pauli …", "num_citations": "37\n", "authors": ["1877"]}
{"title": "Approximate reasoning for real-time probabilistic processes\n", "abstract": " We develop a pseudo-metric analogue of bisimulation for generalized semiMarkov processes. The kernel of this pseudo-metric corresponds to bisimulation; thus we have extended bisimulation for continuous-time probabilistic processes to a much broader class of distributions than exponential distributions. This pseudo-metric gives a useful handle on approximate reasoning in the presence of numerical information - such as probabilities and time - in the model. We give a fixed point characterization of the pseudo-metric. This makes available coinductive reasoning principles for reasoning about distances. We demonstrate that our approach is insensitive to potentially ad hoc articulations of distance by showing that it is intrinsic to an underlying uniformity. We provide a logical characterization of this uniformity using a real-valued modal logic. We show that several quantitative properties of interest are continuous with …", "num_citations": "35\n", "authors": ["1877"]}
{"title": "Labeled Markov processes: stronger and faster approximations\n", "abstract": " This paper proposes a measure-theoretic reconstruction of the approximation schemes developed for labeled Markov processes: approximants are seen as quotients with respect to sets of temporal properties expressed in a simple logic. This gives the possibility of customizing approximants with respect to properties of interest and is thus an important step towards using automated techniques intended for finite state systems, e.g. model checking, for continuous state systems. The measure-theoretic apparatus meshes well with an enriched logic, extended with a greatest fix-point, and gives means to define approximants which retain cyclic properties of their target.", "num_citations": "35\n", "authors": ["1877"]}
{"title": "Equivalence relations in fully and partially observable Markov decision processes\n", "abstract": " We explore equivalence relations between states in Markov Decision Processes and Partially Observable Markov Decision Processes. We focus on two different equivalence notions: bisimulation (Givan et al., 2003) and a notion of trace equivalence, under which states are considered equivalent if they generate the same conditional probability distributions over observation sequences (where the conditioning is on action sequences). We show that the relationship between these two equivalence notions changes depending on the amount and nature of the partial observability. We also present an alternate characterization of bisimulation based on trajectory equivalence.", "num_citations": "34\n", "authors": ["1877"]}
{"title": "Weak bisimulation is sound and complete for pCTL∗\n", "abstract": " We investigate weak bisimulation of probabilistic systems in the presence of nondeterminism, ie labelled concurrent Markov chains (LCMC) with silent transitions. We develop an approach based on allowing convex combinations of computations, similar to Segala and Lynch’s use of randomized schedulers. The definition of weak bisimulation destroys the additivity property of the probability distributions, yielding instead capacities. The mathematics behind capacities naturally captures the intuition that when we deal with nondeterminism we must work with bounds on the possible probabilities rather than with their exact values. Our analysis leads to three new developments:• We identify a characterization of “image finiteness” for countable-state systems and present a new definition of weak bisimulation for these LCMCs. We prove that our definition coincides with that of Philippou, Lee and Sokolsky for finite state …", "num_citations": "33\n", "authors": ["1877"]}
{"title": "A categorical presentation of quantum computation with anyons\n", "abstract": " In nature one observes that in three space dimensions particles are either symmetric under interchange (bosons) or antisymmetric (fermions). These phases give rise to the two possible “statistics” that one observes. In two dimensions, however, a whole continuum of phases is possible. “Anyon” is a term coined in by Frank Wilczek to describe particles in 2 dimensions that can acquire “any” phase when two or more of them are interchanged. The exchange of two such anyons can be expressed via representations of the braid group and hence, it permits one to encode information in topological features of a system composed of many anyons. Kitaev suggested the possibility that such topological excitations would be stable and could thus be used for robust quantum computation.               This paper aims to                                        1.                                             give the categorical structure necessary to describe …", "num_citations": "32\n", "authors": ["1877"]}
{"title": "Distributed measurement-based quantum computation\n", "abstract": " We develop a formal model for distributed measurement-based quantum computations, adopting an agent-based view, such that computations are described locally where possible. Because the network quantum state is in general entangled, we need to model it as a global structure, reminiscent of global memory in classical agent systems. Local quantum computations are described as measurement patterns. Since measurement-based quantum computation is inherently distributed, this allows us to extend naturally several concepts of the measurement calculus [V. Danos, E. Kashefi and P. Panangaden, The measurement calculus (2004), arXiv:quant-ph/0412135], a formal model for such computations. Our goal is to define an assembly language, i.e. we assume that computations are well-defined and we do not concern ourselves with verification techniques. The operational semantics for systems of agents is …", "num_citations": "30\n", "authors": ["1877"]}
{"title": "Semantics of digital networks containing indeterminate modules\n", "abstract": " We discuss a formal model based upon dataflow, usable for high-level digital hardware design, among other things. One of our goals is to give a denotational semantics for this model, which includes indeterminate modules. While it is wellknown that denotational semantics for networks containing only determinate modules can be simply expressed as a composition of stream functions, this approach has previously been shown unacceptable for networks with indeterminate modules. Our approach is to devise composition rules based on modelling a network by the set of its possible behaviors, i.e. sequences of computational events, where each event is the appearance or consumption of a token on a data path. A sequence of such events is called ahistory and a set of such histories is called anarchive. We give composition rules that allow us to derive an archive for a network from the archive of its …", "num_citations": "30\n", "authors": ["1877"]}
{"title": "Approximating Markov processes by averaging\n", "abstract": " Normally, one thinks of probabilistic transition systems as taking an initial probability distribution over the state space into a new probability distribution representing the system after a transition. We, however, take a dual view of Markov processes as transformers of bounded measurable functions. This is very much in the same spirit as a “predicate-transformer” view, which is dual to the state-transformer view of transition systems. We redevelop the theory of labelled Markov processes from this viewpoint; in particular, we explore approximation theory. We obtain three main results. (i) It is possible to define bisimulation on general measure spaces and show that it is an equivalence relation. The logical characterization of bisimulation can be done straightforwardly and generally. (ii) A new and flexible approach to approximation based on averaging can be given. This vastly generalizes and streamlines the idea of using …", "num_citations": "29\n", "authors": ["1877"]}
{"title": "A relational model of non-deterministic dataflow\n", "abstract": " We recast dataflow in a modern categorical light using profunctors as a generalisation of relations. The well known causal anomalies associated with relational semantics of indeterminate dataflow are avoided, but still we preserve much of the intuitions of a relational model. The development fits with the view of categories of models for concurrency and the general treatment of bisimulation they provide. In particular it fits with the recent categorical formulation of feedback using traced monoidal categories. The payoffs are: (1) explicit relations to existing models and semantics, especially the usual axioms of monotone IO automata are read off from the definition of profunctors, (2) a new definition of bisimulation for dataflow, the proof of the congruence of which benefits from the preservation properties associated with open maps and (3) a treatment of higher-order dataflow as a biproduct, essentially by following …", "num_citations": "29\n", "authors": ["1877"]}
{"title": "Distributed quantum computation--A measurement-based approach\n", "abstract": " Distributed quantum computation -- a measurement-based approach — Vrije Universiteit Brussel Skip to main navigation Skip to search Skip to main content Vrije Universiteit Brussel Logo Help & FAQ English Nederlands Home Research Units Profiles Projects Research output Activities Equipment Prizes Press / Media Student theses Impacts Search by expertise, name or affiliation Distributed quantum computation -- a measurement-based approach Ellie D'Hondt, Prakash Panangaden Foundations of the Exact Science Research output: Chapter in Book/Report/Conference proceeding › Meeting abstract (Book) Overview Original language English Title of host publication Lecture at the 2nd Bellairs Workshop on Logical and Semantical Methods in Quantum Computation , Barbados, 20--24 March Publication status Published - 2006 Event Finds and Results from the Swedish Cyprus Expedition: A Gender Perspective …", "num_citations": "28\n", "authors": ["1877"]}
{"title": "A hyperdoctrinal view of concurrent constraint programming\n", "abstract": " We study a relationship between logic and computation via concurrent constraint programming. In previous papers it has been shown that concurrent constraint programs can be modeled by closure operators. In the present paper we show that the programming interpretation via closure operators is intimately related to the logic of the constraints. More precisely, we show how the usual hyperdoctrinal description of first order logic can be functorially related to another hyperdoctrine built out of closure operators. The logical connectives map onto constructions on closure operators that turn out to model programming constructs, specifically conjunction becomes parallel composition and existential quantification becomes hiding of local variables.", "num_citations": "28\n", "authors": ["1877"]}
{"title": "Measure and probability for concurrency theorists\n", "abstract": " The concept of conditional probability plays a fundamental role in probability theory. Just as implication plays a fundamental role in logical reasoning so conditional probability plays an analogous role in probabilistic reasoning. The purpose of this article is to give an expository account of conditional probability, in particular conditional probability distributions on continuous spaces. This necessitates background in measure theory which is also reviewed. This is intended for an audience of concurrency theorists interested in using these ideas for probabilistic semantics.", "num_citations": "26\n", "authors": ["1877"]}
{"title": "A domain-theoretic model for a higher-order process calculus\n", "abstract": " In this paper we study a higher-order process calculus, a restriction of one due to Boudol, and develop an abstract, model for it. By abstract we mean that the model is constructed domain-theoretically and reflects a certain conceptual view-point about observability. It is not constructed from the syntax of the calculus or from computation sequences. We describe a new powerdomain construction that can be given additional algebraic structure that allows one to model concurrent composition, in the same sense that Plotkin's powerdomain can have a continuous binary operation defined on it to model choice. We show that the model constructed this way is adequate with respect to the operational semantics. The model that we develop and our analysis of it is closely related to the work of Abramsky and Ong on the lazy lambda calculus.", "num_citations": "26\n", "authors": ["1877"]}
{"title": "Mccarthy's amb cannot implement fair merge\n", "abstract": " In this paper we establish that fair merge is a powerful non-determinate primitive that cannot be implemented in terms of other well-known primitives. It is well known that fair merge embodies countable non-determinacy. It has also been known that McCarthy's amb embodies countable non-determinacy. It had not been known, however, whether amb could implement a fair merge. We show that amb cannot implement fair merge even in dynamic dataflow networks. This settles a question posed by Abramsky over four years ago. Earlier work had suggested this result by showing that for static dataflow networks, one cannot implement fair merge using angelic merge.", "num_citations": "26\n", "authors": ["1877"]}
{"title": "FRESH: a higher-order language with unification and multiple results\n", "abstract": " This paper presents Fresh, a language that integrates logic programming  features into higher-order functional programming. The language incorporates  unification, multiple results and a collection construct. Many examples  illustrate that these extensions of functional programming are useful. We  define an operational semantics along the lines of Plotkin's structural  approach. The semantics is of intrinsic interest since it covers backtracking  and the collection construct. To illustrate the conceptual similarities and  differences between functional and logic programming, we begin with a purely  functional core language and add first unification and then backtracking.  With each addition we discuss the enhanced eloquence of the language and the  concomitant modifications to the semantics.", "num_citations": "25\n", "authors": ["1877"]}
{"title": "A canonical form for weighted automata and applications to approximate minimization\n", "abstract": " We study the problem of constructing approximations to a weighted automaton. Weighted finite automata (WFA) are closely related to the theory of rational series. A rational series is a function from strings to real numbers that can be computed by a WFA. Among others, this includes probability distributions generated by hidden Markov models and probabilistic automata. The relationship between rational series and WFA is analogous to the relationship between regular languages and ordinary automata. Associated with such rational series are infinite matrices called Hankel matrices which play a fundamental role in the theory of minimal WFA. Our contributions are: (1) an effective procedure for computing the singular value decomposition (SVD) of such infinite Hankel matrices based on their finite representation in terms of WFA, (2) a new canonical form for WFA based on this SVD decomposition, and, (3) an …", "num_citations": "24\n", "authors": ["1877"]}
{"title": "Stone duality for markov processes\n", "abstract": " We define Aumann algebras, an algebraic analog of probabilistic modal logic. An Aumann algebra consists of a Boolean algebra with operators modeling probabilistic transitions. We prove a Stone-type duality theorem between countable Aumann algebras and countably-generated continuous-space Markov processes. Our results subsume existing results on completeness of probabilistic modal logics for Markov processes.", "num_citations": "24\n", "authors": ["1877"]}
{"title": "Minimal memory schedules for dataflow networks\n", "abstract": " In this paper we present algorithms for optimizing the behaviour of a restricted class of dataflow networks with bounded buffers by appropriately scheduling the firings of the individual processes. We show how one can find schedules that lead to minimal use of buffers for networks with independent loops. We also present a class of networks for which one can minimize all the buffers simultaneously. We also show that one can maximize the overall concurrency of the computation while maintaining finiteness of the buffers. The techniques we use are largely those developed in the course of the study of the semantics of dataflow networks despite the fact that our study is of a much more intensional nature. The class of processes considered are restricted, in Petri net terminology they are like marked graphs with multiplicities. It turns out that many of the algorithms that arise in digital signal processing can be …", "num_citations": "24\n", "authors": ["1877"]}
{"title": "Taking it to the limit: Approximate reasoning for markov processes\n", "abstract": " We develop a fusion of logical and metrical principles for reasoning about Markov processes. More precisely, we lift metrics from processes to sets of processes satisfying a formula and explore how the satisfaction relation behaves as sequences of processes and sequences of formulas approach limits. A key new concept is dynamically-continuous metric bisimulation which is a property of (pseudo)metrics. We prove theorems about satisfaction in the limit, robustness theorems as well as giving a topological characterization of various classes of formulas. This work is aimed at providing approximate reasoning principles for Markov processes.", "num_citations": "23\n", "authors": ["1877"]}
{"title": "Fock space: a model of linear exponential types\n", "abstract": " It has been observed by several people that, in certain contexts, the free symmetric algebra construction can provide a model of the linear modality!. This construction arose independently in quantum physics, where it is considered as a canonical model of quantum eld theory. In this context, the construction is known as (bosonic) Fock space. Fock space is used to analyze such quantum phenomena as the annihilation and creation of particles. There is a strong intuitive connection to the principle of renewable resource, which is the philosophical interpretation of the linear modalities.In this paper, we examine Fock space in several categories of vector spaces. We rst consider vector spaces, where the Fock construction induces a model of the; &;! fragment in the category of symmetric algebras. When considering Banach spaces, the Fock construction provides a model of a weakening cotriple in the sense of Jacobs. While the models so obtained model a smaller fragment, it is closer in practice to the structures considered by physicists. In this case, Fock space has a natural interpretation as a space of holomorphic functions. This suggests that the\\nonlinear\" functions we arrive at via Fock space are not merely continuous but analytic. Finally, we also consider fermionic Fock space, which corresponds algebraically to skew symmetric algebras. By considering fermionic Fock space on the category of nite-dimensional vector spaces, we obtain a model of full propositional linear logic, although the model is somewhat degenerate in that certain connectives are equated.", "num_citations": "23\n", "authors": ["1877"]}
{"title": "Latent variable modelling with hyperbolic normalizing flows\n", "abstract": " The choice of approximate posterior distributions plays a central role in stochastic variational inference (SVI). One effective solution is the use of normalizing flows\\cut {defined on Euclidean spaces} to construct flexible posterior distributions. However, one key limitation of existing normalizing flows is that they are restricted to the Euclidean space and are ill-equipped to model data with an underlying hierarchical structure. To address this fundamental limitation, we present the first extension of normalizing flows to hyperbolic spaces. We first elevate normalizing flows to hyperbolic spaces using coupling transforms defined on the tangent bundle, termed Tangent Coupling (). We further introduce Wrapped Hyperboloid Coupling (), a fully invertible and learnable transformation that explicitly utilizes the geometric structure of hyperbolic spaces, allowing for expressive posteriors while being efficient to sample from. We demonstrate the efficacy of our novel normalizing flow over hyperbolic VAEs and Euclidean normalizing flows. Our approach achieves improved performance on density estimation, as well as reconstruction of real-world graph data, which exhibit a hierarchical structure. Finally, we show that our approach can be used to power a generative model over hierarchical data using hyperbolic latent variables.", "num_citations": "22\n", "authors": ["1877"]}
{"title": "A relational model of non-deterministic dataflow\n", "abstract": " We recast dataflow in a modern categorical light using profunctors as a generalisation of relations. The well-known causal anomalies associated with relational semantics of indeterminate dataflow are avoided, but still we preserve much of the intuitions of a relational model. The development fits with the view of categories of models for concurrency and the general treatment of bisimulation they provide. In particular, it fits with the recent categorical formulation of feedback using traced monoidal categories. The payoffs are: (1) explicit relations to existing models and semantics, especially the usual axioms of monotone IO automata are read off from the definition of profunctors; (2) a new definition of bisimulation for dataflow, the proof of the congruence of which benefits from the preservation properties associated with open maps; and (3) a treatment of higher-order dataflow as a biproduct, essentially by following the …", "num_citations": "22\n", "authors": ["1877"]}
{"title": "On-the-fly algorithms for bisimulation metrics\n", "abstract": " We study the problem of determining approximate equivalences in Markov Decision Processes with rewards using bisimulation metrics. We provide an extension of the framework previously introduced in Ferns et al. (2004), which computes iteratively improving approximations to bisimulation metrics using exhaustive pairwise state comparisons. The similarity between states is determined using the Earth Mover's Distance, as extensively studied in optimization and machine learning. We address two computational limitations of the above framework: first, all pairs of states have to be compared at every iteration, and second, convergence is proven only under exact computations. We extend their work to incorporate \"on-the-fly\" methods, which allow computational effort to focus first on pairs of states where the impact is expected to be greater. We prove that a method similar to asynchronous dynamic programming …", "num_citations": "21\n", "authors": ["1877"]}
{"title": "Conditional expectation and the approximation of labelled Markov processes\n", "abstract": " We develop a new notion of approximation of labelled Markov processes based on the use of conditional expectations. The key idea is to approximate a system by a coarse-graining of the state space and using averages of the transition probabilities. This is unlike any of the previous notions where the approximants are simulated by the process that they approximate. The approximations of the present paper are customizable, more accurate and stay within the world of LMPs. The use of averages and expectations may well also make the approximations more robust. We introduce a novel condition – called “granularity” – which leads to unique conditional expectations and which turns out to be a key concept despite its simplicity.", "num_citations": "21\n", "authors": ["1877"]}
{"title": "Stochastic techniques in concurrency\n", "abstract": " Elementary probability theory can be summed up easily. Imagine that one has a process which makes a single step and can end up in any one of a finite set S of final states each with equal likelihood. Then the probability than the final state lies in a subset A-often called an eventis given by| A|/| S| where|·| denotes the size of a finite set. From this simple intuition one can define concepts like the probability of more complex processes which might involve several steps or interaction between different observations.The typical concepts that one learns: independence, expectation value, and conditional probability are fairly clear-at least in their intuitive conception-in the “discrete” case described above. These concepts suffice to analyze much of the work in probabilistic process algebra. In some sense the relevant concepts are essentially those of Boolean algebra. However, in the continuous case, the same concepts require different mathematics. In some sense one can say that one has to move from Boolean algebras to σ-Boolean algebras. Measure theory evolved originally to make sense of integration but-essentially in Kolmogorov’s hands-it became the rigourous foundation for probability theory. The need for such extensions to high-school probability theory arose from statistical mechanics and the need to explain physical phenomena like Brownian motion. For researchers interested in systems like process control systems, telecommunication systems, networks there are very similar phenomena. There is a uncontrolled physical phenomenon,“noise” or “drift” and some controlling software. Understanding how these interact is essential for the design …", "num_citations": "19\n", "authors": ["1877"]}
{"title": "On the axiomatizability of quantitative algebras\n", "abstract": " Quantitative algebras (QAs) are algebras over metric spaces defined by quantitative equational theories as introduced by us in 2016. They provide the mathematical foundation for metric semantics of probabilistic, stochastic and other quantitative systems. This paper considers the issue of axiomatizability of QAs. We investigate the entire spectrum of types of quantitative equations that can be used to axiomatize theories: (i) simple quantitative equations; (ii) Horn clauses with no more than c equations between variables as hypotheses, where c is a cardinal and (iii) the most general case of Horn clauses. In each case we characterize the class of QAs and prove variety/quasivariety theorems that extend and generalize classical results from model theory for algebras and first-order structures.", "num_citations": "18\n", "authors": ["1877"]}
{"title": "Quantum alternation: Prospects and problems\n", "abstract": " We propose a notion of quantum control in a quantum programming language which permits the superposition of finitely many quantum operations without performing a measurement. This notion takes the form of a conditional construct similar to the IF statement in classical programming languages. We show that adding such a quantum IF statement to the QPL programming language simplifies the presentation of several quantum algorithms. This motivates the possibility of extending the denotational semantics of QPL to include this form of quantum alternation. We give a denotational semantics for this extension of QPL based on Kraus decompositions rather than on superoperators. Finally, we clarify the relation between quantum alternation and recursion, and discuss the possibility of lifting the semantics defined by Kraus operators to the superoperator semantics defined by Selinger.", "num_citations": "18\n", "authors": ["1877"]}
{"title": "A logical basis for quantum evolution and entanglement\n", "abstract": " We reconsider discrete quantum causal dynamics where quantum systems are viewed as discrete structures, namely directed acyclic graphs. In such a graph, events are considered as vertices and edges depict propagation between events. Evolution is described as happening between a special family of spacelike slices, which were referred to as locative slices. Such slices are not so large as to result in acausal influences, but large enough to capture nonlocal correlations.             In our logical interpretation, edges are assigned logical formulas in a special logical system, called BV, an instance of a deep inference system. We demonstrate that BV, with its mix of commutative and noncommutative connectives, is precisely the right logic for such analysis. We show that the commutative tensor encodes (possible) entanglement, and the noncommutative seq encodes causal precedence. With this interpretation …", "num_citations": "18\n", "authors": ["1877"]}
{"title": "Abstract interpretation and indeterminacy\n", "abstract": " We present a theory for the semantics of indeterminate operators in a dataflow network. The assumption is made that the language in which the indeterminate operators are written has a construct that allows for the testing of availability of data on input lines. We then show that indeterminacy arises through the use of such an operator together with the fact that communication channels produce unpredictable delays in the transmission of data. Our scheme is to use the notion of hiatons to represent delays as measured locally, and then to filter out the hiatons to obtain ordinary streams. This filtering process produces indeterminate behavior at the level of ordinary streams. We indicate how this can be justified using the formalism of abstract interpretation. We show that a particular fairness anomaly does not arise.", "num_citations": "18\n", "authors": ["1877"]}
{"title": "Strong completeness for Markovian logics\n", "abstract": " In this paper we present Hilbert-style axiomatizations for three logics for reasoning about continuous-space Markov processes (MPs): (i) a logic for MPs defined for probability distributions on measurable state spaces, (ii) a logic for MPs defined for sub-probability distributions and (iii) a logic defined for arbitrary distributions. These logics are not compact so one needs infinitary rules in order to obtain strong completeness results.             We propose a new infinitary rule that replaces the so-called Countable Additivity Rule (CAR) currently used in the literature to address the problem of proving strong completeness for these and similar logics. Unlike the CAR, our rule has a countable set of instances; consequently it allows us to apply the Rasiowa-Sikorski lemma for establishing strong completeness. Our proof method is novel and it can be used for other logics as well.", "num_citations": "17\n", "authors": ["1877"]}
{"title": "Representing Systems with Hidden State.\n", "abstract": " We discuss the problem of finding a good state representation in stochastic systems with observations. We develop a duality theory that generalizes existing work in predictive state representations as well as automata theory. We discuss how this theoretical framework can be used to build learning algorithms, approximate planning algorithms as well as to deal with continuous observations. 1", "num_citations": "17\n", "authors": ["1877"]}
{"title": "Reasoning about Knowledge and Permission in Secure Distributed Systems.\n", "abstract": " A method for reasoning about knowledge in multilevel secure systems has previously been introduced [Glasgow 1988]. In this approach, operator nets were used to specify a variety of security properties such as nondisclosure, integrity, and authority systems. An intuitive way to describe security is in terms of what information a process has\" permission to know\". It is obvious that for any security policy, a process of a distributed system should not know any information that it does not have permission to know. A particular security policy then would simply define the meaning of the term\" permission.\" For example, in a multilevel secure distributed system, a process might be permitted to know any information which is known by processes at the same or a lower security level.The primary motivation for the work described in this paper is to provide a formal method for defining security policies. We begin by introducing a …", "num_citations": "17\n", "authors": ["1877"]}
{"title": "Reasoning about quantum knowledge\n", "abstract": " We construct a formal framework for investigating epistemic and temporal notions in the context of distributed quantum computation. While we rely on structures developed in [1], we stress that our notion of quantum knowledge makes sense more generally in any agent-based model for distributed quantum systems. Several arguments are given to support our view that an agent’s possibility relation should not be based on the reduced density matrix, but rather on local classical states and local quantum operations. In this way, we are able to analyse distributed primitives such as superdense coding and teleportation, obtaining interesting conclusions as to how the knowledge of individual agents evolves. We show explicitly that the knowledge transfer in teleportation is essentially classical, in that eventually, the receiving agent knows that its state is equal to the initial state of the sender. The relevant epistemic …", "num_citations": "16\n", "authors": ["1877"]}
{"title": "A mechanically assisted constructive proof in category theory\n", "abstract": " Recently there has been a significant confluence of ideas from category theory, constructive type theory and functional programming. Our goal is to develop a toolkit that provides mechanical assistance in putting together constructive proofs of theorems in category theory and to extract executable programs from the result.             We describe a machine-assisted proof of the adjoint functor theorem from category theory. The theorem is a simple version of the adjoint functor theorem. It was chosen because of its interesting constructive content, the fact that the machine-checked proof is fairly large and because it is mathematically non-trivial. The category theory toolkit was built on top of the Nuprl system. The core of this toolkit is a collection of tactics for mechanizing “diagram chasing”. We selected Nuprl because the underlying type theory is constructive and one can automatically extract executable programs …", "num_citations": "16\n", "authors": ["1877"]}
{"title": "The common order-theoretic structure of version spaces and ATMS's\n", "abstract": " This paper exposes the common order-theoretic properties of the structures manipulated by the version space algorithm [Mit78] and the assumption-based truth maintenance systems (ATMS)[dk86a, dk86b] by recasting them in the framework of convex spaces. Our analysis of version spaces in this framework reveals necessary and sufficient conditions for ensuring the preservation of an essential finite representability property in version space merging. This analysis is used to formulate several sufficient conditions for when a language will allow version spaces to be represented by finite sets of concepts (even when the universe of concepts may be infinite). We provide a new convex space based formulation of computation performs by an ATMS which extends the expressiveness of disjunctions in the systems. This approach obviates the need for hyper-resolution in dealing with disjunction and results in simpler label-update algorithms.", "num_citations": "16\n", "authors": ["1877"]}
{"title": "Robust and parsimonious realisations of unitaries in the one-way model\n", "abstract": " We present a new set of generators for unitary maps over \\otimes^n(C^2) which differs from the traditional rotation-based generating set in that it uses a single-parameter family of 1-qubit unitaries J(a), together with a single 2-qubit unitary controlled-Z. Each generator is implementable in the one-way model using only two qubits, and this leads to both parsimonious and robust implementations of general unitaries. As an illustration, we give an implementation of the controlled-U family which uses only 14 qubits, and has a 2-colourable underlying entanglement graph (known to yield robust entangled states).", "num_citations": "15\n", "authors": ["1877"]}
{"title": "Universality and quantum garvity\n", "abstract": " The gravitational coupling constants associated with several renormalized quantum field theories in curved spacetime all exhibit similar high-energy scaling behavior. This suggests a universal structure of high-energy semiclassical gravity.", "num_citations": "15\n", "authors": ["1877"]}
{"title": "An algebraic theory of markov processes\n", "abstract": " Markov processes are a fundamental model of probabilistic transition systems and are the underlying semantics of probabilistic programs. We give an algebraic axiomatisation of Markov processes using the framework of quantitative equational logic introduced in [13]. We present the theory in a structured way using work of Hyland et al.[9] on combining monads. We take the interpolative barycentric algebras of [13] which captures the Kantorovich metric and combine it with a theory of contractive operators to give the required axiomatisation of Markov processes both for discrete and continuous state spaces. This work apart from its intrinsic interest shows how one can extend the general notion of combining effects to the quantitative setting.", "num_citations": "14\n", "authors": ["1877"]}
{"title": "Deep inference and probabilistic coherence spaces\n", "abstract": " This paper proposes a definition of categorical model of the deep inference system BV, defined by Guglielmi. Deep inference introduces the idea of performing a deduction in the interior of a formula, at any depth. Traditional sequent calculus rules only see the roots of formulae. However in these new systems, one can rewrite at any position in the formula tree. Deep inference in particular allows the syntactic description of logics for which there is no sequent calculus. One such system is BV, which extends linear logic to include a noncommutative self-dual connective. This is the logic our paper proposes to model. Our definition is based on the notion of a linear functor, due to Cockett and Seely. A BV-category is a linearly distributive category, possibly with negation, with an additional tensor product which, when viewed as a bivariant functor, is linear with a degeneracy condition. We show that this simple …", "num_citations": "14\n", "authors": ["1877"]}
{"title": "Approximating Markov processes by averaging\n", "abstract": " We take a dual view of Markov processes – advocated by Kozen – as transformers of bounded measurable functions. We redevelop the theory of labelled Markov processes from this view point, in particular we explore approximation theory. We obtain three main results:               (i) It is possible to define bisimulation on general measure spaces and show that it is an equivalence relation. The logical characterization of bisimulation can be done straightforwardly and generally. (ii) A new and flexible approach to approximation based on averaging can be given. This vastly generalizes and streamlines the idea of using conditional expectations to compute approximation. (iii) It is possible to show that there is a minimal bisimulation equivalent to a process obtained as the limit of the finite approximants.", "num_citations": "14\n", "authors": ["1877"]}
{"title": "Expressiveness of probabilistic modal logics, revisited\n", "abstract": " Labelled Markov processes are probabilistic versions of labelled transition systems. In general, the state space of a labelled Markov process may be a continuum. Logical characterizations of probabilistic bisimulation and simulation were given by Desharnais et al. These results hold for systems defined on analytic state spaces and assume that there are countably many labels in the case of bisimulation and finitely many labels in the case of simulation. In this paper, we first revisit these results by giving simpler and more streamlined proofs. In particular, our proof for simulation has the same structure as the one for bisimulation, relying on a new result of a topological nature. This departs from the known proof for this result, which uses domain theory techniques and falls out of a theory of approximation of Labelled Markov processes. Both our proofs assume the presence of countably many labels. We investigate the necessity of this assumption, and show that the logical characterization of bisimulation may fail when there are uncountably many labels. However, with a stronger assumption on the transition functions (continuity instead of just measurability), we can regain the logical characterization result, for arbitrarily many labels. These new results arose from a new game-theoretic way of understanding probabilistic simulation and bisimulation.", "num_citations": "13\n", "authors": ["1877"]}
{"title": "Representation discovery for mdps using bisimulation metrics\n", "abstract": " We provide a novel, flexible, iterative refinement algorithm to automatically construct an approximate statespace representation for Markov Decision Processes (MDPs). Our approach leverages bisimulation metrics, which have been used in prior work to generate features to represent the state space of MDPs. We address a drawback of this approach, which is the expensive computation of the bisimulation metrics. We propose an algorithm to generate an iteratively improving sequence of state space partitions. Partial metric computations guide the representation search and provide much lower space and computational complexity, while maintaining strong convergence properties. We provide theoretical results guaranteeing convergence as well as experimental illustrations of the accuracy and savings (in time and memory usage) of the new algorithm, compared to traditional bisimulation metric computation.", "num_citations": "13\n", "authors": ["1877"]}
{"title": "Classifying all mutually unbiased bases in Rel\n", "abstract": " Finding all the mutually unbiased bases in various dimensions is a problem of fundamental interest in quantum information theory and pure mathematics. The general problem formulated in finite-dimensional Hilbert spaces is open. In the categorical approach to quantum mechanics one can find examples of categories which behave ``like'' the category of finite-dimensional Hilbert spaces in various ways but are subtly different. One such category is the category of sets and relations, . One can formulate the concept of mutually unbiased bases here as well. In this note we classify all the mutually unbiased bases in this category by relating it to a standard question in combinatorics.", "num_citations": "13\n", "authors": ["1877"]}
{"title": "Game semantics for quantum stores\n", "abstract": " This paper presents a game semantics for a simply-typed λ-calculus equipped with quantum stores. The quantum stores are equipped with quantum operations as commands which give the language enough expressiveness to encode any quantum circuits. The language uses a notion of extended variable, similar to that seen in functional languages with pattern matching, but adapted to the needs of dealing with tensor products. These tensored variables are used to refer to quantum stores and to keep track of the size of the states which they contain. The game semantics is constructed from classical game semantics using intervention operators to encode the effects of the commands. A soundess result for the semantics is given.", "num_citations": "13\n", "authors": ["1877"]}
{"title": "An approximation algorithm for labelled Markov processes: towards realistic approximation\n", "abstract": " Approximation techniques for labelled Markov processes on continuous state spaces were developed by Desharnais, Gupta, Jagadeesan and Panangaden. However, it has not been clear whether this scheme could be used in practice since it involves inverting a stochastic kernel. We describe a Monte Carlo based implementation scheme for this approximation algorithm. This is, to the best of our knowledge, the first implementation of this approximation scheme. The implementation involves some novel ideas about how to estimate infs using sampling and also replacing the explicit description of subsets of the state space by tests for membership. It is hoped that this work enables more applications of continuous probabilistic LMP theory to emerge.", "num_citations": "13\n", "authors": ["1877"]}
{"title": "The expressive power of indeterminate primitives in asynchronous computation\n", "abstract": " It has long been realized that the exigencies of systems programming require primitives that behave indeterminately. The best-known dataflow primitive is the so called fair merge which abstracts aspects of fair resource allocation. It has been known for about two decades that fair primitives lead to unbounded indeterminacy. Around seven years ago E. W. Stark, Vasant Shanbhogue and I discovered that various variants of fair merge primitives, all manifesting unbounded indeterminacy, were provably different. These differences are based on simple monotonicity properties.             In the present paper I review these results and discuss some related phenomena involving a fair stack. I then describe results about fair splitting. These results are based on topological properties rather than simple order-theoretic properties. This gives some basic insight into what can and cannot be described by oracles and the …", "num_citations": "13\n", "authors": ["1877"]}
{"title": "Bisimulation metrics for weighted automata\n", "abstract": " We develop a new bisimulation (pseudo)metric for weighted finite automata (WFA) that generalizes Boreale's linear bisimulation relation. Our metrics are induced by seminorms on the state space of WFA. Our development is based on spectral properties of sets of linear operators. In particular, the joint spectral radius of the transition matrices of WFA plays a central role. We also study continuity properties of the bisimulation pseudometric, establish an undecidability result for computing the metric, and give a preliminary account of applications to spectral learning of weighted automata.", "num_citations": "12\n", "authors": ["1877"]}
{"title": "Notes on labelled transition systems and bisimulation\n", "abstract": " We are interested in modelling systems and studying their behaviour. In particular, we would like to know when two systems have the same behaviour. So far, we have been looking at automata as language recognizers, but now we would like to think of them as models of systems.The intuition is as follows. We imagine that we have a “black box” which has some internal states; we cannot see these states. The box is equipped with some buttons which we are free to press at any point. When we press a button it either goes down (the action is accepted) or the button refuses to go down (the action is rejected). We can perform experiments and see whether an action is accepted or not. If the action is accepted then a transition occurs, but we cannot see exactly what happens. We are interested in the behaviour of the system in the sense of knowing how it responds to our button-pushing experiments.", "num_citations": "11\n", "authors": ["1877"]}
{"title": "Effect analysis in higher-order languages\n", "abstract": " When programs are intended for parallel execution it becomes critical to determine whether the evaluations of two expressions can be carried out independently. We provide a scheme for making such determinations in a typed language with higher-order constructs and imperative features. The heart of our scheme is a mechanism for estimating thesupport of an expression, i.e., the set of global variables involved in its evaluation. This computation requires knowledge of all the aliases of an expression. The inference schemes are presented in a compositional fashion reminiscent of abstract interpretation. We prove the soundness of our estimates with respect to the standard semantics of the language.", "num_citations": "11\n", "authors": ["1877"]}
{"title": "Boolean-valued semantics for the stochastic λ-calculus\n", "abstract": " The ordinary untyped λ-calculus has a λ-theoretic model proposed in two related forms by Scott and Plotkin in the 1970s. Recently Scott showed how to introduce probability by extending these models with random variables. However, to reason about correctness and to add further features, it is useful to reinterpret the construction in a higher-order Boolean-valued model involving a measure algebra. We develop the semantics of an extended stochastic λ-calculus suitable for modeling a simple higher-order probabilistic programming language. We exhibit a number of key equations satisfied by the terms of our language. The terms are interpreted using a continuation-style semantics with an additional argument, an infinite sequence of coin tosses, which serves as a source of randomness. We also introduce a fixpoint operator as a new syntactic construct, as β-reduction turns out not to be sound for unrestricted terms …", "num_citations": "10\n", "authors": ["1877"]}
{"title": "Learning in a changing world, an algebraic modal logical approach\n", "abstract": " We develop an algebraic modal logic that combines epistemic and dynamic modalities with a view to modelling information acquisition (learning) by automated agents in a changing world. Unlike most treatments of dynamic epistemic logic, we have transitions that “change the state” of the underlying system and not just the state of knowledge of the agents. The key novel feature that emerges is the need to have a way of “inverting transitions” and distinguishing between transitions that “really happen” and transitions that are possible.               Our approach is algebraic, rather than being based on a Kripke-style semantics. The semantics are given in terms of quantales. We study a class of quantales with the appropriate inverse operations and prove properties of the setting. We illustrate the ideas with toy robot-navigation problems. These illustrate how an agent learns information by taking actions.", "num_citations": "10\n", "authors": ["1877"]}
{"title": "A technique for verifying measurements\n", "abstract": " We give a technique that can be used to prove that a given function is a measurement. We demonstrate its applicability by using it to resolve three notoriously difficult cases: capacity in information theory, entropy in quantum mechanics and global time in general relativity. We then show that this technique provides a new and surprising characterization of measurement. Thus, in principle, it can always be used.", "num_citations": "10\n", "authors": ["1877"]}
{"title": "A category-theoretic semantics for unbounded indeterminacy\n", "abstract": " In this paper we give a category-theoretic semantics for a simple imperative language featuring unbounded indeterminacy. This semantics satisfies the categorical analogues of continuity and has the meaning of while loops defined as colimits of ω-diagrams. Furthermore, it collapses via an abstraction function to a semantics that is fully abstract, and coincides with the operational semantics. The abstraction function is the only discontinuous function appearing in our semantics.", "num_citations": "10\n", "authors": ["1877"]}
{"title": "Epistemic strategies and games on concurrent processes\n", "abstract": " We develop a game semantics for process algebra with two interacting agents. The purpose of our semantics is to make manifest the role of knowledge and information flow in the interactions between agents and to control the information available to interacting agents. We define games and strategies on process algebras, so that two independent agents interacting according to their strategies determine the execution of the process, replacing the traditional scheduler. We show that different restrictions on strategies represent different amounts of information being available to a scheduler. We also show that a certain class of strategies corresponds to the syntactic schedulers of Chatzikokolakis and Palamidessi, which were developed to overcome problems with traditional schedulers modelling interaction. The restrictions on these strategies have an explicit epistemic flavour.", "num_citations": "9\n", "authors": ["1877"]}
{"title": "Verification of systolic arrays: a stream functional approach\n", "abstract": " We illustrate that the verification of systolic architectures can be carried out using techniques developed in the context of verification of programs. This is achieved by a decomposition of the original problem into separately proving the correctness of the data representation and of the individual processing elements in the systolic architecture. By expressing a processing element as a function on a stream of data we are able to utilize standard proof techniques from programming language theory. This decomposition leads to relatively straightforward proofs of the properties of the systolic architecture. We illustrate the techniques via a substantial example, the proof of the correctness of a linear-time systolic architecture for computing the gcd of polynomials. Although this architecture has been designed a few years ago, a formal proof of correctness has not hitherto appeared in the literature.", "num_citations": "9\n", "authors": ["1877"]}
{"title": "A distributional analysis of sampling-based reinforcement learning algorithms\n", "abstract": " We present a distributional approach to theoretical analyses of reinforcement learning algorithms for constant step-sizes. We demonstrate its effectiveness by presenting simple and unified proofs of convergence for a variety of commonly-used methods. We show that value-based methods such as TD (?) and Q-Learning have update rules which are contractive in the space of distributions of functions, thus establishing their exponentially fast convergence to a stationary distribution. We demonstrate that the stationary distribution obtained by any algorithm whose target is an expected Bellman update has a mean which is equal to the true value function. Furthermore, we establish that the distributions concentrate around their mean as the step-size shrinks. We further analyse the optimistic policy iteration algorithm, for which the contraction property does not hold, and formulate a probabilistic policy improvement property which entails the convergence of the algorithm.", "num_citations": "8\n", "authors": ["1877"]}
{"title": "A categorical characterization of relative entropy on standard Borel spaces\n", "abstract": " We give a categorical treatment, in the spirit of Baez and Fritz, of relative entropy for probability distributions defined on standard Borel spaces. We define a category called SbStat suitable for reasoning about statistical inference on standard Borel spaces. We define relative entropy as a functor into Lawvere's category [0, ∞] and we show convexity, lower semicontinuity and uniqueness.", "num_citations": "8\n", "authors": ["1877"]}
{"title": "Holomorphic models of exponential types in linear logic\n", "abstract": " In this paper we describe models of several fragments of linear logic with the exponential operator ! (called Of course) in categories of linear spaces. We model ! by the Fock space construction in Banach (or Hilbert) spaces, a notion originally introduced in the context of quantum field theory. Several variants of this construction are presented, and the representation of Fock space as a space of holomorphic functions is described. This also suggests that the “non-linear” functions we arrive at via! are not merely continuous, but analytic.", "num_citations": "8\n", "authors": ["1877"]}
{"title": "A hyperdoctrinal view of constraint systems\n", "abstract": " We study a relationship between logic and computation via concurrent constraint programming. In previous papers it has been shown how a simple language for specifying asynchronous concurrent processes can be interpreted in terms of constraints. In the present paper we show that the programming interpretation via closure operators is intimately related to the logic of the constraints. More precisely we show how the usual hyperdoctrinal description of rst order logic can be functorially related to another hyperdoctrine built out of closure operators. The logical connectives map onto constructions on closure operators that turn out to model programming constructs, speci cally conjunction becomes parallel composition and existential quanti cation becomes hiding of local variables.", "num_citations": "8\n", "authors": ["1877"]}
{"title": "Security by Permission in Databases.\n", "abstract": " In reasoning about database security, it is important to have a precise notion of what a user\" knows\" and what a user is\" permitted to know\". Furthermore, it is important to know how knowledge and permissions propagate to complex statements from simple ones. In this paper we present a logical approach to these questions based on a modal logic formalism. The point is that there is a well understood theory of modal logics that includes an account of how the modalities interact with the ordinary logical connectives. By casting permission and knowledge as modalities we obtain a structured framework within which we can discuss their logical and semantic properties. It also provides a framework in which we can discuss the reasoning abilities of deductive databases.", "num_citations": "8\n", "authors": ["1877"]}
{"title": "Minimisation in logical form\n", "abstract": " Stone-type dualities provide a powerful mathematical framework for studying properties of logical systems. They have recently been fruitfully explored in understanding minimisation of various types of automata. In Bezhanishvili et al. (2012), a dual equivalence between a category of coalgebras and a category of algebras was used to explain minimisation. The algebraic semantics is dual to a coalgebraic semantics in which logical equivalence coincides with trace equivalence. It follows that maximal quotients of coalgebras correspond to minimal subobjects of algebras. Examples include partially observable deterministic finite automata, linear weighted automata viewed as coalgebras over finite-dimensional vector spaces, and belief automata, which are coalgebras on compact Hausdorff spaces. In Bonchi et al. (2014), Brzozowski's double-reversal minimisation algorithm for deterministic finite automata was described categorically and its correctness explained via the duality between reachability and observability. This work includes generalisations of Brzozowski's algorithm to Moore and weighted automata over commutative semirings. In this paper we propose a general categorical framework within which such minimisation algorithms can be understood. The goal is to provide a unifying perspective based on duality. Our framework consists of a stack of three interconnected adjunctions: a base dual adjunction that can be lifted to a dual adjunction between coalgebras and algebras and also to a dual adjunction between automata. The approach provides an abstract understanding of reachability and observability. We illustrate the general …", "num_citations": "7\n", "authors": ["1877"]}
{"title": "Free complete Wasserstein algebras\n", "abstract": " We present an algebraic account of the Wasserstein distances  on complete metric spaces, for . This is part of a program of a quantitative algebraic theory of effects in programming languages. In particular, we give axioms, parametric in , for algebras over metric spaces equipped with probabilistic choice operations. The axioms say that the operations form a barycentric algebra and that the metric satisfies a property typical of the Wasserstein distance . We show that the free complete such algebra over a complete metric space is that of the Radon probability measures with finite moments of order , equipped with the Wasserstein distance as metric and with the usual binary convex sums as operations.", "num_citations": "7\n", "authors": ["1877"]}
{"title": "Bicategories of Markov processes\n", "abstract": " We construct bicategories of Markov processes where the objects are input and output sets, the morphisms (one-cells) are Markov processes and the two-cells are simulations. This builds on the work of Baez, Fong and Pollard, who showed that a certain kind of finite-space continuous-time Markov chain (CTMC) can be viewed as morphisms in a category. This view allows a compositional description of their CTMCs. Our contribution is to develop a notion of simulation between processes and construct a bicategory where the two-cells are simulation morphisms. Our version is for processes that are essentially probabilistic transition systems with discrete time steps and which do not satisfy a detailed balance condition. We have also extended the theory to continuous space processes.", "num_citations": "7\n", "authors": ["1877"]}
{"title": "Epistemic strategies and games on concurrent processes\n", "abstract": " We develop a game semantics for process algebra with two interacting agents. The purpose of our semantics is to make manifest the role of knowledge and information flow in the interactions between agents and to control the information available to interacting agents. We define games and strategies on process algebras, so that two agents interacting according to their strategies determine the execution of the process, replacing the traditional scheduler. We show that different restrictions on strategies represent different amounts of information being available to a scheduler. We also show that a certain class of strategies corresponds to the syntactic schedulers of Chatzikokolakis and Palamidessi, which were developed to overcome problems with traditional schedulers modelling interaction. The restrictions on these strategies have an explicit epistemic flavour.", "num_citations": "7\n", "authors": ["1877"]}
{"title": "The duality of state and observation in probabilistic transition systems\n", "abstract": " In this paper we consider the problem of representing and reasoning about systems, especially probabilistic systems, with hidden state. We consider transition systems where the state is not completely visible to an outside observer. Instead, there are observables that partly identify the state. We show that one can interchange the notions of state and observation and obtain what we call a dual system. In the case of deterministic systems, the double dual gives a minimal representation of the behaviour of the original system. We extend these ideas to probabilistic transition systems and to partially observable Markov decision processes (POMDPs).", "num_citations": "7\n", "authors": ["1877"]}
{"title": "Dagger categories and formal distributions\n", "abstract": " A nuclear ideal is an ideal contained in an ambient monoidal dagger category which has all of the structure of a compact closed category, except that it lacks identities. Intuitively, the identities are too “singular” to live in the ideal. Typical examples include the ideal of Hilbert-Schmidt maps contained in the category of Hilbert spaces, or the ideal of test functions contained in the category DRel of tame distributions on Euclidean space.               In this paper, we construct a category of tame formal distributions with coefficients in an associative algebra. We show that there is a formal analogue of the nuclear ideal constructed in DRel, and hence there is a partial trace operation on the category. By taking formal distributions with coefficients in the dual of a cocommutative Hopf algebra, we obtain a categorical generalization of the Borcherds’ notion of elementary vertex group. Furthermore, when considering the …", "num_citations": "7\n", "authors": ["1877"]}
{"title": "The logic BV and quantum causality\n", "abstract": " We describe how a logic with commutative and noncommutative connectives can be used for capturing the essence of discrete quantum causal propagation.", "num_citations": "7\n", "authors": ["1877"]}
{"title": "Positive and negative frequency decompositions in curved spacetime\n", "abstract": " In this note we derive a formula for the positive and negative frequency parts of a solution in terms of the Feynman propagator. Our arguments are valid in the presence of particle creation. We also derive a formula for an operator J, that gives the particle creation rate. The formalism uses complex structures to capture the notion of positive and negative frequencies and thus avoids using analyticity arguments. The results obtained clarify the relation between approaches to quantum field theory based on the complex structure and approaches in which the propagator is the basic object. We will consider only scalar fields for simplicity.", "num_citations": "7\n", "authors": ["1877"]}
{"title": "Expressiveness of probabilistic modal logics: A gradual approach\n", "abstract": " Logical characterizations of probabilistic bisimulation and simulation for Labelled Markov Processes were given by Desharnais et al. These results hold for systems defined on analytic state spaces and assume countably many labels in the case of bisimulation and finitely many labels in the case of simulation.We revisit these results by giving simpler and more streamlined proofs. In particular, our proof for simulation has the same structure as the one for bisimulation, relying on a new result of a topological nature. We also propose a new notion of event simulation.Our proofs assume countably many labels, and we show that the logical characterization of bisimulation may fail when there are uncountably many labels. However, with a stronger assumption on the transition functions (continuity instead of just measurability), we regain the logical characterization result for arbitrarily many labels. These results arose from a …", "num_citations": "6\n", "authors": ["1877"]}
{"title": "Probabilistic bisimulation\n", "abstract": " This is a very personal review of the definition of probabilistic bisimulation on continuous state spaces and the logical characterization theorem. I only consider fully probabilistic reactive systems.", "num_citations": "6\n", "authors": ["1877"]}
{"title": "Basis refinement strategies for linear value function approximation in MDPs\n", "abstract": " We provide a theoretical framework for analyzing basis function construction for linear value function approximation in Markov Decision Processes (MDPs). We show that important existing methods, such as Krylov bases and Bellman-errorbased methods are a special case of the general framework we develop. We provide a general algorithmic framework for computing basis function refinements which “respect” the dynamics of the environment, and we derive approximation error bounds that apply for any algorithm respecting this general framework. We also show how, using ideas related to bisimulation metrics, one can translate basis refinement into a process of finding “prototypes” that are diverse enough to represent the given MDP.", "num_citations": "6\n", "authors": ["1877"]}
{"title": "Domain theory and general relativity\n", "abstract": " We discuss the current state of investigations into the domain theoretic structure of spacetime, including recent developments which explain the connection between measurement, the Newtonian concept of time and the Lorentz distance.", "num_citations": "6\n", "authors": ["1877"]}
{"title": "Formal approaches to information-hiding (tutorial)\n", "abstract": " In this survey paper we consider the class of protocols for information-hiding which use randomization to obfuscate the link between the observables and the information to be protected. We focus on the problem of formalizing the notion of information hiding, and verifying that a given protocol achieves the intended degree of protection. Without the pretense of being omni-comprehensive, we review the main approaches that have been explored in literature: possibilistic, probabilistic, information-theoretic, and statistical.", "num_citations": "6\n", "authors": ["1877"]}
{"title": "On the expressive power of indeterminate network primitives\n", "abstract": " It is well known that a fair merge primitive leads to unbounded  indeterminacy. In this paper we show that unbounded indeterminacy cannot express a fair merge in the setting of Kahn-style dataflow networks. Intuitively, unbounded indeterminacy can be used to program a fair merge when  it is guaranteed that data will always be available. But such schemes rely on  predictive scheduling and they may fail if one of the inputs to the merge is  a finite stream. It is reasonable to expect that if one were to add a  primitive which \"knows how to avoid bottom\" (so called \"angelic merge\")  then one could use this in conjunction with unbounded choice in order to  produce a fair merge. Somewhat surprisingly, this expectation is incorrect as  we show in this paper. The method we use to prove this is to identify a  property which generalises monotonicity to indeterminate networks and then  show that this property is possessed by determinate networks and by unbounded  choice and by angelic merge but not by fair merge. It appears that there is a  hierarchy of inequivalent indeterminate primitives all of which feature some  form of unbounded indeterminacy.", "num_citations": "6\n", "authors": ["1877"]}
{"title": "Scaling behavior of semiclassical gravity\n", "abstract": " Using the idea of metric scaling we examine the scaling behavior of the stress tensor of a scalar quantum field in curved space-time. The renormalization of the stress tensor results in a departure from naive scaling. We view the process of renormalizing the stress tensor as being equivalent to renormalizing the coupling constants in the Lagrangian for gravity (with terms quadratic in the curvature included). Thus the scaling of the stress tensor is interpreted as a nonnaive scaling of these coupling constants. In particular, we find that the cosmological constant and the gravitational constant approach UV fixed points. The constants associated with the terms which are quadratic in the curvature logarithmically diverge. This suggests that quantum gravity is asymptotically scale invariant.", "num_citations": "6\n", "authors": ["1877"]}
{"title": "Implementing Multi-sensor Systems in a Functional Language\n", "abstract": " We discuss a methodology for configuring systems of sensors using a functional language. To date no such generai methodoiogy exists, and existing mu! ti-sensor systems have been hand-crafted around a particular application. Our main point is that the use of abstraction and of functional language features leads to a natural and simple approach to this problem. Our work exploits features of a particular functional programming environment, Function Equation Language (FEL) running on the REDIFLOW simulator, to develop a simple faulttolerance scheme that avoids complicated issues of state restoration and switching protocols, and to develop implementations of multi-sensor systems that are very close to the abstract system specification and are hence manifestly correct.", "num_citations": "6\n", "authors": ["1877"]}
{"title": "Singular value automata and approximate minimization\n", "abstract": " The present paper uses spectral theory of linear operators to construct approximatelyminimal realizations of weighted languages. Our new contributions are: (i) a new algorithm for the singular value decomposition (SVD) decomposition of finite-rank infinite Hankel matrices based on their representation in terms of weighted automata, (ii) a new canonical form for weighted automata arising from the SVD of its corresponding Hankelmatrix, and (iii) an algorithmto construct approximateminimizations of given weighted automata by truncating the canonical form.We give bounds on the quality of our approximation.", "num_citations": "5\n", "authors": ["1877"]}
{"title": "Unrestricted stone duality for Markov processes\n", "abstract": " Stone duality relates logic, in the form of Boolean algebra, to spaces. Stone-type dualities abound in computer science and have been of great use in understanding the relationship between computational models and the languages used to reason about them. Recent work on probabilistic processes has established a Stone-type duality for a restricted class of Markov processes. The dual category was a new notion-Aumann algebras-which are Boolean algebras equipped with countable family of modalities indexed by rational probabilities. In this article we consider an alternative definition of Aumann algebra that leads to dual adjunction for Markov processes that is a duality for many measurable spaces occurring in practice. This extends a duality for measurable spaces due to Sikorski. In particular, we do not require that the probabilistic modalities preserve a distinguished base of clopen sets, nor that morphisms of …", "num_citations": "5\n", "authors": ["1877"]}
{"title": "On the formal verification of optical quantum gates in HOL\n", "abstract": " Quantum computers are expected to handle hard computational problems and provide unbreakable security protocols. Among different quantum computer implementations, those based on quantum optics and nuclear magnetic resonance show good advancement in building large scale machines. However, the involvement of optical and nuclear techniques makes their development very critical. This motivates us to apply formal techniques, in particular theorem proving, in quantum circuits analysis. In this work, we present the formalization of multi-inputs/multi-outputs quantum gates (technically called multi-modes optical circuits). This requires the implementation of tensor product over complex-valued functions. Firstly, we build a formal model of single optical beams and then extend it to cover circuits of multi optical beams, with the help of the developed tensor product algebra. As an application, we …", "num_citations": "5\n", "authors": ["1877"]}
{"title": "Causality in physics and computation\n", "abstract": " Glynn Winskel has had enormous influence on the study of causal structure in computer science. In this brief note, I discuss analogous concepts in relativity where also causality plays a fundamental role. I discuss spacetime structure in a series of layers and emphasize the role of causal structure. I close with some comparisons between causality in relativity and in distributed computing systems.", "num_citations": "5\n", "authors": ["1877"]}
{"title": "Proof nets as formal feynman diagrams\n", "abstract": " The introduction of linear logic and its associated proof theory has revolutionized many semantical investigations, for example, the search for fully-abstract models of PCF and the analysis of optimal reduction strategies for lambda calculi. In the present paper we show how proof nets, a graph-theoretic syntax for linear logic proofs, can be interpreted as operators in a simple calculus.               This calculus was inspired by Feynman diagrams in quantum field theory and is accordingly called the φ-calculus. The ingredients are formal integrals, formal power series, a derivative-like construct and analogues of the Dirac delta function.               Many of the manipulations of proof nets can be understood as manipulations of formulas reminiscent of a beginning calculus course. In particular, the “box” construct behaves like an exponential and the nesting of boxes phenomenon is the analogue of an exponentiated …", "num_citations": "5\n", "authors": ["1877"]}
{"title": "Conformal field theory as a nuclear functor\n", "abstract": " We consider Segal's categorical approach to conformal field theory (CFT). Segal constructed a category whose objects are finite families of circles, and whose morphisms are Riemann surfaces with boundary compatible with the families of circles in the domain and codomain. A CFT is then defined to be a functor to the category of Hilbert spaces, preserving the appropriate structure. In particular, morphisms in the geometric category must be sent to trace class maps.However, Segal's approach is not quite categorical, as the geometric structure he considers has an associative composition, but lacks identities. We begin by demonstrating that an appropriate method of dealing with the lack of identities in this situation is the notion of nuclear ideal, as defined by Abramsky and the first two authors. More precisely, we show that Segal's structure is contained in a larger category as a nuclear ideal. While it is straightforward to …", "num_citations": "5\n", "authors": ["1877"]}
{"title": "Does combining nondeterminism and probability make sense?\n", "abstract": " The following sections are included:  Introduction   Statistics vs Probabilistic Models   Bayesian Inference   Infinite Regress and the Prior   Does It Make a Difference to Concurrency Theorists?   Conclusions   References", "num_citations": "5\n", "authors": ["1877"]}
{"title": "Expressiveness bounds for completeness in trace-based network proof systems\n", "abstract": " Network proof systems based on first-order specifications over channel traces are incomplete unless reasoning over the interleaving of communication events is permitted. Relatively complete trace-based proof systems using temporal logic have been described, but full temporal logic is more powerful than necessary. Using the interleaving approach, we isolate the expressiveness required of a relatively complete trace logic. A hierarchy of temporal logic subsets is then defined; a certain subset is shown to have necessary and sufficient expressive power for relative completeness.", "num_citations": "5\n", "authors": ["1877"]}
{"title": "Categorical type theory\n", "abstract": " This paper examines the connections between intuitionistic type theory and  category theory. A version of type theory is developed in a category  theoretic framework by interpreting types as objects and type connectives as  constructions in categories. This yields a theory that uniformly models type  inhabitation, proof theory, type universes, syntactic forms, equality and  computation.", "num_citations": "5\n", "authors": ["1877"]}
{"title": "An exact expression for photon polarization in Kerr geometry\n", "abstract": " In protocols for quantum communication [19] most of the attention has been focussed on quantum effects such as the problem of coping with noise in the communication mechanism or preserving entanglement. It is typically taken for granted that the participants in the protocol share a frame of reference. However, a closer analysis by Bartlett et al.[2, 3] has revealed the importance of sharing a frame. They have even quantified the degree to which a partially shared frame constitutes shared information. The present paper is motivated by these considerations, however, we do not address the quantum information-theoretic issues which would involve a study of the evolution of the quantum state.Instead, we isolate the classical geometric aspects and study them in Kerr geometry. Specifically, we study how two participants in a quantum communication protocol involving transmission of polarized photons—henceforth we …", "num_citations": "4\n", "authors": ["1877"]}
{"title": "Computation, Logic, Games, and Quantum Foundations-The Many Facets of Samson Abramsky: Essays Dedicted to Samson Abramsky on the Occasion of His 60th Birthday\n", "abstract": " This Festschrift volume, published in honor of Samson Abramsky, contains contributions written by some of his colleagues, former students, and friends. In celebration of the 60th birthday of Samson Abramsky, a conference was held in Oxford, UK, during May 28-30, 2010. The papers in this volume represent his manifold contributions to semantics, logic, games, and quantum mechanics.", "num_citations": "4\n", "authors": ["1877"]}
{"title": "Spacetime geometry from causal structure and a measurement\n", "abstract": " The causal structure of spacetime defines a partial order on the events of spacetime. In an earlier paper, using techniques from domain theory, we showed that for globally hyperbolic spacetimes one could reconstruct the topology from the causal structure. However, the causal structure determines the metric only up to a local rescaling (a conformal transformation); in a four dimensional spacetime, the metric tensor has ten components, and thus effectively only nine are determined by the causal structure. After establishing the relationship between measurement in domain theory, the concept of global time function and the Lorentz distance, we are able to domain theoretically recover the final tenth component of the metric tensor, thereby obtaining causal reconstruction of not only the topology of spacetime, but also its geometry.", "num_citations": "4\n", "authors": ["1877"]}
{"title": "Combining epistemic logic and hennessy-milner logic\n", "abstract": " We define an epistemic logic for labelled transition systems by introducing equivalence relations for the agents on the states of the labelled transition system. The idea is that agents observe the dynamics of the system modulo their ability to distinguish states and in the process learn about the current state and past history of the execution. This is in the spirit of dynamic epistemic logic but is a direct combination of Hennessy-Milner logic and epistemic logic. We give an axiomatization for the logic and prove a completeness theorem with respect to the class of models obtained by unfolding labelled transition systems.", "num_citations": "4\n", "authors": ["1877"]}
{"title": "Approximating labelled Markov processes again!\n", "abstract": " Labelled Markov processes are continuous-state fully probabilistic labelled transition systems. They can be seen as co-algebras of a suitable monad on the category of measurable space. The theory as developed so far included a treatment of bisimulation, logical characterization of bisimulation, weak bisimulation, metrics, universal domains for LMPs and approximations. Much of the theory involved delicate properties of analytic spaces.               Recently a new kind of averaging procedure was used to construct approximations. Remarkably, this version of the theory uses a dual view of LMPs and greatly simplifies the theory eliminating the need to consider aanlytic spaces. In this talk I will survey some of the ideas that led to this work.", "num_citations": "4\n", "authors": ["1877"]}
{"title": "Knowledge and information in probabilistic systems\n", "abstract": " Knowledge and Information in Probabilistic Systems Page 1 Knowledge and Information in Probabilistic Systems Prakash Panangaden Page 2 PODC and CONCUR Page 3 PODC and CONCUR Two communities with shared interests but very different methods. Page 4 PODC and CONCUR Two communities with shared interests but very different methods. CONCUR: Emphasis on algebraic laws, equivalence, compositionality and modal logics. Page 5 PODC and CONCUR Two communities with shared interests but very different methods. CONCUR: Emphasis on algebraic laws, equivalence, compositionality and modal logics. PODC: Algorithms, combinatorial arguments, expressiveness, complexity and impossibility results. Page 6 PODC and CONCUR Two communities with shared interests but very different methods. CONCUR: Emphasis on algebraic laws, equivalence, compositionality and modal logics. PODC: …", "num_citations": "4\n", "authors": ["1877"]}
{"title": "Leader election and distributed consensus with quantum resources\n", "abstract": " In this paper we study paradigmatic tasks from classical distributed computing–leader election and distributed consensus–in the presence of quantum resources. Our main contribution is a demonstration of the special computational power of the W-state, and also of the GHZ-state. Several important results are brought forward. First, totally correct leader election is possible in anonymous quantum networks, which is in stark contrast with the classical situation. Next, we prove that the specific entanglement provided by the W-and GHZ-states, and their generalisations, is the only kind that exactly solves leader election and distributed consensus respectively. At the heart of the proofs of these impossibility results lie symmetry arguments.", "num_citations": "4\n", "authors": ["1877"]}
{"title": "Decoherent histories on graphs\n", "abstract": " The consistent histories approach to quantum mechanics is traditionally based on linearly ordered sequences of events. We extend the histories formalism to sets of events whose causal ordering is described by directed acyclic graphs. The need for a global time is eliminated and our construction reflects the causal structure faithfully.", "num_citations": "4\n", "authors": ["1877"]}
{"title": "On the expressive power of first-order boolean functions in PCF\n", "abstract": " Recent results of Bucciarelli show that the semilattice of degrees of parallelism of first-order boolean functions in PCF has both infinite chains and infinite antichains. By considering a simple subclass of Sieber's sequentiality relations, we identify levels in the semilattice and derive inexpressibility results concerning functions on different levels. This allows us to further explore the structure of the semilattice of degrees of parallelism: we identify semilattices characterized by simple level properties, and show the existence of new infinite hierarchies which are in a certain sense natural with respect to the levels.", "num_citations": "4\n", "authors": ["1877"]}
{"title": "A category theoretic formalism for abstract interpretation\n", "abstract": " We present a formal theory of abstract interpretation based on a new category theoretic formalism. This formalism allows one to derive a collecting semantics which preserves continuity of lifted functions and for which the lifting functor is itself continuous. The theory of abstract interpretation is then presented as an approximation of this collecting semantics. The use of categories rather than complete partial orders eliminates the need for introducing two distinct partial orders and for introducing any closure operation on the allowable elements, as is necessary with powerdomains. Furthermore, our construction can be applied to any situation for which the underlying domains are complete partial orders, sice the domains are not further restricted in any way. This formalism can be applied to first order languages.", "num_citations": "4\n", "authors": ["1877"]}
{"title": "Notions of state equivalence under partial observability\n", "abstract": " We explore equivalence relations between states in Markov Decision Processes and Partially Observable Markov Decision Processes. We focus on two different equivalence notions: bisimulation (Givan et al, 2003) and a notion of trace equivalence, under which states are considered equivalent roughly if they generate the same conditional probability distributions over observation sequences (where the conditioning is on action sequences). We show that the relationship between these two equivalence notions changes depending on the amount and nature of the partial observability. We also present an alternate characterization of bisimulation based on trajectory equivalence.", "num_citations": "3\n", "authors": ["1877"]}
{"title": "Spacetime topology from causality\n", "abstract": " We prove that a globally hyperbolic spacetime with its causality relation is a bicontinuous poset whose interval topology is the manifold topology. This provides an abstract mathematical setting in which one can study causality independent of geometry and differentiable structure.", "num_citations": "3\n", "authors": ["1877"]}
{"title": "The expressive power of delay operators in SCCS\n", "abstract": " We investigate the relative expressive power of finite delay operators in SCCS. These were introduced by Milner and by Hennessy to study fairness properties of processes in the context of SCCS. We show that the context sensitive delay operator introduced by Hennessy is more expressive than the finite delay operator introduced by Milner. This result is closely related to recent results by Pananagden and Stark on the expressive power of fair merge in asynchronous dataflow (Kahn) networks. It indicates that the expressiveness results obtained there are not sensitive to the precise computational model since SCCS, unlike Kahn networks, is synchronous and permits expansion of recursively defined processes.", "num_citations": "3\n", "authors": ["1877"]}
{"title": "Semantic Foundations of Concurrent Constraint Programming\n", "abstract": " Concurrent constraint programming (Sar89, SR90) is a sim-ple and powerful model of concurrent computation based on the notions of store-as-constraint and process as information transducer. The store-as-valuation conception of von Neu-mann computing is replaced by the notion that the store is a constraint (a finite representation of a possibly infinite set of valuations) which provides partial information about the possible values that variables can take. Instead of\" reading\" and “writing” the values of variables, processes may now ask (check if a constraint is entailed by the store) and tell (augment the store with a new constraint). This is a very general paradigm which subsumes (among others) nonde-terminate data-flow and the (concurrent)(constraint) logic programming languages.This paper develops the basic ideas involved in giving a coherent semantic account of these languages. Our first con-tribution is to give a simple and general formulation of the notion that a constraint system is a system of partial infor-mation (a la the information systems of Scott). Parameter passing and hiding is handled by borrowing ideas from the cylindric algebras of Henkin, Monk and Tarski to introduce diagonal elements and cylindrification'operations (which mimic the projection of information induced by existential quantifiers).", "num_citations": "3\n", "authors": ["1877"]}
{"title": "Recursively defined types in constructive type theory\n", "abstract": " Publisher SummaryThis chapter presents an account of recursive definitions in a constructive type theory. It discusses these definitions from the viewpoint of category theory. An intimate connection between logic and category theory is well-known. The chapter discusses the relationship between Martin-Löf's intuitionistic type theory (ITT) and categorical logic. To understand the presentation of recursive type definitions, it is first necessary to understand the relationship between ITT and categorical logic. One of the advantages of category theory is that one can give very general definitions of standard constructions. Initially, these definitions might seem a bit contrived because they are expressed entirely in terms of morphisms; however, the resulting definition is more widely applicable than the corresponding definitions given in terms of sets and membership. One can recover many set theoretic ideas in category theory …", "num_citations": "3\n", "authors": ["1877"]}
{"title": "By the PRL Group\n", "abstract": " CiteSeerX — By the PRL Group: Documents Authors Tables Log in Sign up MetaCart DMCA Donate CiteSeerX logo Documents: Advanced Search Include Citations Authors: Advanced Search Include Citations Tables: DMCA By the PRL Group: (1985) Cached Download as a PDF Download Links [www.cs.cornell.edu] [www.cs.cornell.edu] Save to List Add to Collection Correct Errors Monitor Changes by RL Constable , SF Allen , HM Bromley , WR Cleaveland , JF Cremer , RW Harper , DJ Howe , TB Knoblock , NP Mendler , P. Panangaden , JT Sasaki , SF Smith Citations: 1 - 0 self Summary Citations Active Bibliography Co-citation Clustered Documents Version History Share Facebook Twitter Reddit Bibsonomy OpenURL Abstract Keyphrases prl group Powered by: Apache Solr About CiteSeerX Submit and Index Documents Privacy Policy Help Data Source Contact Us Developed at and hosted by The College of …", "num_citations": "3\n", "authors": ["1877"]}
{"title": "Computing with epistemic and spatial modalities\n", "abstract": " This paper describes the role which epistemic reasoning can play in concurrency theory.  The idea of using epistemic modalities as programming constructs has been largely unexplored.  Logic programming emerged under the slogan ``Logic as a programming language'' and the connection was manifest in a very clear way in the concurrent constraint programming paradigm.  In this paper we explore the role of epistemic, and closely related spatial modalities, as part of the programming language and not just as part of the meta-language for reasoning about protocols.   We introduce spatial and epistemic process calculi for reasoning about spatial information and knowledge distributed among the agents of a system. We introduce domain-theoretical structures to represent spatial and epistemic information. We provide  operational and denotational techniques for reasoning about the potentially infinite behaviour of …", "num_citations": "2\n", "authors": ["1877"]}
{"title": "Bisimulation for feller-dynkin processes\n", "abstract": " Bisimulation is a concept that captures behavioural equivalence. It has been studied extensively on nonprobabilistic systems and on discrete-time Markov processes and on so-called continuous-time Markov chains. In the latter, time is continuous but the evolution still proceeds in jumps. We propose two definitions of bisimulation on continuous-time stochastic processes where the evolution is a flow through time. We show that they are equivalent and we show that when restricted to discrete-time, our concept of bisimulation encompasses the standard discrete-time concept. The concept we introduce is not a straightforward generalization of discrete-time concepts.", "num_citations": "2\n", "authors": ["1877"]}
{"title": "Temporally Extended Metrics for Markov Decision Processes\n", "abstract": " Developing safe and efficient methods for state abstraction in reinforcement learning systems is an open research problem. We propose to address it by leveraging ideas from formal verification, namely, bisimulation. Specifically, we generalize the notion of bisimulation by considering arbitrary comparisons between states instead of strict reward matching. We further develop a notion of temporally extended metrics, which extend a base metric between states of an environment so as to reflect not just the current difference but the extent to which the distance is preserved through the course of transitions. We show that this property is not satisfied by bisimulation metrics, which were previously used to compare states with respect to their longterm rewards. A temporal extension can be defined for any base metric of interest, thus making the construction very flexible. The kernel of the temporally extended metrics corresponds precisely to exact bisimulation (thus these metrics form a larger class of bisimulation metrics). We provide bounds relating bisimulation and temporally extended metrics and also examine the couplings of state distributions which are induced.", "num_citations": "2\n", "authors": ["1877"]}
{"title": "Spatial Information Distribution in Constraint-based Process Calculi (Extended Version)\n", "abstract": " We introduce spatial and epistemic process calculi for reasoning about spatial information and knowledge distributed among the agents of a system. We introduce domain-theoretical structures to represent spatial and epistemic information. We provide operational and denotational techniques for reasoning about the potentially infinite behaviour of spatial and epistemic processes. We also give compact representations of infinite objects that can be used by processes to simulate announcements of common knowledge and global information.Introduction. Distributed systems have changed substantially in the recent past with the advent of phenomena like social networks and cloud computing. In the previous incarnation of distributed computing [16] the emphasis was on consistency, fault-tolerance, resource management and related topics; these were all characterized by interaction between processes. Research proceeded along two lines: the algorithmic side which dominated the Principles Of Distributed Computing conferences and the more process algebraic approach epitomized by CONCUR where the emphasis was on developing compositional reasoning principles. What marks the new era of distributed systems is an emphasis on managing access to information to a much greater degree than before. Epistemic concepts were crucial in distributed computing as was realized in the mid 1980s with Halpern and Moses’ groundbreaking paper on common knowledge [13]. This led to a flurry of activity in the next few years [11] with many distributed protocols being understood from an epistemic point of view. The impact of epistemic ideas in the …", "num_citations": "2\n", "authors": ["1877"]}
{"title": "An algebraic approach to dynamic epistemic logic\n", "abstract": " Dynamic epistemic logic plays a key role in reasoning about multi-agent systems. Past approaches to dynamic epistemic logic have typically been focused on actions whose primary purpose is to communicate information from one agent to another. These actions are unable to alter the valuation of any proposition within the system. In fields such as security, it is easy to imagine situations in which this sort of action would be insufficient. We expand the algebraic framework presented by M. Sadrzadeh [14] to include both communication actions and dynamic actions that change the state of the system. Furthermore, we propose a new modality that captures both epistemic and propositional changes resulting from the agents’ actions.", "num_citations": "2\n", "authors": ["1877"]}
{"title": "Duality of State and Observations\n", "abstract": " In this paper we consider the problem of representing and reasoning about systems, especially probabilistic systems, with hidden state. We consider transition systems where the state is not completely visible to an outside observer. Instead, there are observables that partly identify the state. We show that one can interchange the notions of state and observation and obtain what we cann a dual system. The double dual gives a minimal representation of the behaviour of the original system. We extend this to nondeterministic systems and to probabilistic transition systems and finally to partially observable Markov decision processes (POMDPs). In the case of finite automata restricted to one observable, we obtain Brzozowski’s algorithm for minimizing finite-state language acceptors.", "num_citations": "2\n", "authors": ["1877"]}
{"title": "A logical characterization of bisimulation for labeled Markov processes\n", "abstract": " This paper gives a logical characterization of probabilis-tic bisimulation for Markov processes introduced in (5).", "num_citations": "2\n", "authors": ["1877"]}
{"title": "Relational semantics of non-deterministic dataflow\n", "abstract": " We recast dataflow in a modern categorical light using profunctors as a generalization of relations. The well known causal anomalies associated with relational semantics of indeterminate dataflow are avoided, but still we preserve much of the intuitions of a relational model. The development fits with the view of categories of models for concurrency and the general treatment of bisimulation they provide. In particular it fits with the recent categorical formulation of feedback using traced monoidal categories. The payoffs are:(1) explicit relations to existing models and semantics, especially the usual axioms of monotone IO automata are read off from the definition of profunctors,(2) a new definition of bisimulation for dataflow, the proof of the congruence of which benefits from the preservation properties associated with open maps and (3) a treatment of higher-order dataflow as a biproduct, essentially by following the geometry of interaction programme.", "num_citations": "2\n", "authors": ["1877"]}
{"title": "Monotone and nonmonotone dataflow networks\n", "abstract": " The expressiveness of concurrent dataflow primitives have been studied from the point of view of automata theory [19] as well as in terms of abstractly given processes defined in terms of traces [20]. The expressiveness of the merge primitives, fair merge, angelic merge and infinity-fair merge were shown to hinge on monotonicity properties of their trace languages. From the point of view of concurrent automata an important class of automata called monotone automata were defined and it was shown that fair merge could not be implemented by such an automaton. In this paper we study the relationship between monotonicity properties of automata and of trace languages. We characterize the trace languages computed by monotone automata and we show that the characterization does not correspond to the existing monotonicity properties of trace languages. These, relatively easy, results led us to discover a new indeterminate primitive, the fair stack, that turns out to be nonmonotone and to have in...", "num_citations": "2\n", "authors": ["1877"]}
{"title": "Propagators and Renormalization of Quantum Field Theory in Curved Spacetimes.\n", "abstract": " Degree: Ph. D.DegreeYear: 1980Institute: The University of Wisconsin-MilwaukeeQuantum field theory in curved spacetime has proven to be a rich and active field of study and in the absence of a quantum theory of gravity is the best theory describing the interaction of matter and strong gravitational fields. Hitherto, much of the activity in this area had been confined to the theory of free (ie linear) fields propagating on curved backgrounds. However, in most regimes in which quantum effects are expected to play a role it is expected that densities would be high and to describe the matter by free quantum fields is clearly not a good approximation.", "num_citations": "2\n", "authors": ["1877"]}
{"title": "Universal semantics for the stochastic λ-calculus\n", "abstract": " We define sound and adequate denotational and operational semantics for the stochastic lambda calculus. These two semantic approaches build on previous work that used an explicit source of randomness to reason about higher-order probabilistic programs.", "num_citations": "1\n", "authors": ["1877"]}
{"title": "MICo: Learning improved representations via sampling-based state similarity for Markov decision processes\n", "abstract": " We present a new behavioural distance over the state space of a Markov decision process, and demonstrate the use of this distance as an effective means of shaping the learnt representations of deep reinforcement learning agents. While existing notions of state similarity are typically difficult to learn at scale due to high computational cost and lack of sample-based algorithms, our newly-proposed distance addresses both of these issues. In addition to providing detailed theoretical analysis, we provide empirical evidence that learning this distance alongside the value function yields structured and informative representations, including strong results on the Arcade Learning Environment benchmark.", "num_citations": "1\n", "authors": ["1877"]}
{"title": "Quantitative Equational Reasoning\n", "abstract": " Equational logic is central to reasoning about programs. What is the right equational setting for reasoning about probabilistic programs? It has been understood that instead of equivalence relations one should work with (pseudo) metrics in a probabilistic setting. However, it is not clear how this relates to equational reasoning. In recent work the notion of a quantitative equational logic was introduced and developed. This retains many of the features of ordinary logic but fits naturally with metric reasoning. The present chapter is an elementry introduction to this topic. In this setting one can define analogues of algebras and free algebras. It turns out that the Kantorovich (Wasserstein) metric emerges as a free construction from a simple quantitative equational theory. We give a couple of examples of quantitative analogues of familiar effects from programming language theory. We do not assume any background in equational logic or advanced category theory.", "num_citations": "1\n", "authors": ["1877"]}
{"title": "Towards a Classification of Behavioural Equivalences in Continuous-time Markov Processes\n", "abstract": " Bisimulation is a concept that captures behavioural equivalence of states in a transition system. In [Linan Chen, Florence Clerc, and Prakash Panangaden, Bisimulation for feller-dynkin processes, in: Proceedings of the Thirty-Fifth Conference on the Mathematical Foundations of Programming Semantics, Electronic Notes in Theoretical Computer Science 347 (2019) 45–63.], we proposed two equivalent definitions of bisimulation on continuous-time stochastic processes where the evolution is a flow through time. In the present paper, we develop the theory further: we introduce different concepts that correspond to different behavioural equivalences and compare them to bisimulation. In particular, we study the relation between bisimulation and symmetry groups of the dynamics. We also provide a game interpretation for two of the behavioural equivalences. We then compare those notions to their discrete-time …", "num_citations": "1\n", "authors": ["1877"]}
{"title": "The 2017 alonzo church award\n", "abstract": " SIGLOG is delighted to announce that the 2017 Church Award goes to 6 people: Samson Abramsky, Martin Hyland, Radha Jagadeesan, Pasquale Malacaria, Hanno Nickau and Luke Ong for [Quoting from the official citation] \"providing a fully-abstract semantics for higher-order computation through the introduction of games models, thereby fundamentally revolutionising the field of programming language semantics, and for the applied impact of these models.\"", "num_citations": "1\n", "authors": ["1877"]}
{"title": "Proceedings of the 11th workshop on Quantum Physics and Logic\n", "abstract": " This volume contains the proceedings of the 11th International Workshop on Quantum Physics and Logic (QPL 2014), which was held from the 4th to the 6th of June, 2014, at Kyoto University, Japan. The goal of the QPL workshop series is to bring together researchers working on mathematical foundations of quantum physics, quantum computing and spatio-temporal causal structures, and in particular those that use logical tools, ordered algebraic and category-theoretic structures, formal languages, semantic methods and other computer science methods for the study of physical behavior in general. Over the past few years, there has been growing activity in these foundational approaches, together with a renewed interest in the foundations of quantum theory, which complement the more mainstream research in quantum computation. Earlier workshops in this series, with the same acronym under the name \"Quantum Programming Languages\", were held in Ottawa (2003), Turku (2004), Chicago (2005), and Oxford (2006). The first QPL under the new name Quantum Physics and Logic was held in Reykjavik (2008), followed by Oxford (2009 and 2010), Nijmegen (2011), Brussels (2012) and Barcelona (2013).", "num_citations": "1\n", "authors": ["1877"]}
{"title": "Duality in Logic and Computation\n", "abstract": " I give a brief introduction to Stone duality and then survey a number of duality theories that arise in logic and computer science. I mention some more unfamiliar dualities at the end which may be of importance to emerging fields within computer science.", "num_citations": "1\n", "authors": ["1877"]}
{"title": "Fair reactive programming\n", "abstract": " Functional Reactive Programming (FRP) models reactive systems with events and signals, which have previously been observed to correspond to the “eventually” and “always” modalities of linear temporal logic (LTL). In this paper, we define a constructive variant of LTL with least fixed point and greatest fixed point operators in the spirit of the modal mu-calculus, and give it a proofs-asprograms interpretation in the realm of reactive programs. Previous work emphasized the propositions-as-types part of the correspondence between LTL and FRP; here we emphasize the proofsas-programs part by employing structural proof theory. We show that this type system is expressive enough to enforce liveness properties such as the fairness of schedulers and the eventual delivery of results. We illustrate programming in this language using (co) iteration operators. We prove type preservation of our operational semantics, which guarantees that our programs are causal. We give also a proof of strong normalization which provides justification that the language is productive and that our programs satisfy liveness properties derived from their types.", "num_citations": "1\n", "authors": ["1877"]}
{"title": "Quantum information channels in curved spacetime\n", "abstract": " Quantum field theory in curved spacetime reveals a fundamental ambiguity in the quantization procedure: the notion of vacuum, and hence of particles, is observer dependent. A state that an inertial observer in Minkowski space perceives to be the vacuum will appear to an accelerating observer to be a thermal bath of radiation. The impact of this Davies-Fulling-Unruh noise on quantum communication has been explored in a recent paper by Bradler, Hayden and the author.             I will review the results of that paper. The problem of quantum communication from an inertial sender to an accelerating observer and private communication between two inertial observers in the presence of an accelerating eavesdropper was studied there. In both cases, they were able to establish compact, tractable formulas for the associated communication capacities assuming encodings that allow a single excitation in one of a …", "num_citations": "1\n", "authors": ["1877"]}
{"title": "The search for structure in quantum computation\n", "abstract": " I give a non-comprehensive survey of the categorical quantum mechanics program and how it guides the search for structure in quantum computation. I discuss the example of measurement-based computing which is one of the successes of such an enterprise and briefly mention topological quantum computing which is an inviting target for future research in this area.", "num_citations": "1\n", "authors": ["1877"]}
{"title": "Learning in a changing world, an algebraic approach\n", "abstract": " We develop an algebraic modal logic that combines epistemic and dynamic modalities with a view to modelling information acquisition (learning) by automated agents in a changing world. Unlike most treatments of dynamic epistemic logic, we have transitions that “change the state” of the underlying system and not just the state of knowledge of the agents. The key novel feature that emerges is the need to have a way of “inverting transitions” and distinguishing between transitions that “really happen” and transitions that are possible.Our approach is algebraic, rather than being based on a Kripke-style semantics. The semantics are given in terms of quantales. We study a class of quantales with the appropriate inverse operations and prove properties of the setting. We illustrate the ideas with toy robot-navigation problems. These illustrate how an agent learns information by taking actions.", "num_citations": "1\n", "authors": ["1877"]}
{"title": "A “Book” proof that parallel convergence tester cannot implement parallel or\n", "abstract": " I give a short and elementary proof that paralle convergence tester cannot implement parallel or. Parallel convergence tester is a two-argument function c: O→ O× O with the following graph: c (⊥,⊥)=⊥ c (⊥,⊤)=⊤ c (⊤,⊥)=⊤ c (⊤,⊤)=⊤. Parallel or is the well-known function p: B× B→ B defined on the domain of booleans B with the following graph: p (ff, ff)= ff p (tt,⊥)= tt p (⊥, ff)=⊥ p (⊥, tt)= tt p (ff,⊥)=⊥ with all other values being determined by monotonicity. These functions arise in the discussion of full abstraction of PCF [Plo77] and the lazy λ-calculus [AO93]. It is now well-known that the lattice of degrees of parallelism is very rich and infinite in two directions [Buc97, PP01]: the fact that one cannot implement p with c is a tiny part of these results. There is, however, a very simple proof that PCF with c cannot implement p assuming that PCF by itself cannot implement p. Suppose that such an implementation exists so that there is some pure PCF context C [·] with C [c]= p. The functional λx. C [x] is monotone. Therefore the pure PCF 1 term C [λu.⊤] is extensionally above p, but p is maximal so the pure PCF term C [λu.⊤]= p, a contradiction. In fact this argument applies to any function with return type O even if it is horribly non-recursive.", "num_citations": "1\n", "authors": ["1877"]}
{"title": "Learning Algorithms for Automata with Observations\n", "abstract": " We consider the problem of learning the behavior of a POMDP (Partially Observable Markov Decision Process) with deterministic actions and observations. This is a challenging problem due to the fact that the observations can only partially identify the states. Recent work by Holmes and Isbell offers an approach for inferring the hidden states from experience in deterministic POMDP environments. We propose an alternative algorithm that ensures more accurate predictions, and we show that in fact it produces the minimal predicting machine.", "num_citations": "1\n", "authors": ["1877"]}
{"title": "The one way to quantum computation\n", "abstract": " Measurement-based quantum computation has emerged from the physics community as a new approach to quantum computation where measurements rather than unitary transformations are the main driving force of computation. Among measurement-based quantum computation methods the recently introduced one-way quantum computer [RB01] stands out as basic and fundamental.               In this work we a concrete syntax and an algebra of these patterns derived from a formal semantics. We developed a rewrite theory and proved a general standardization theorem which allows all patterns to be put in a semantically equivalent standard form.", "num_citations": "1\n", "authors": ["1877"]}
{"title": "1-qubit versus 2-qubit measurement based quantum computing\n", "abstract": " We present a comprehensive and universal quantum computing model based on 2-qubit measurements (TQC), which embeds trivially in a model based on 1-qubit measurements known as the one-way model (1WQC). One inherits through this embedding a calculus whereby each TQC computing pattern can be put in a standard form where entanglement is done first, then measurement, then local corrections.", "num_citations": "1\n", "authors": ["1877"]}
{"title": "Divergence-least semantics of amb is Hoare\n", "abstract": " This note strengthens the hoary observation that McCarthy’s amb is not monotone with respect to the Smyth and Plotkin powerdomains. It shows that there is no least fixpoint semantics for amb that is sensitive to divergence.This paper is concerned with an erratic choice operator M| M, and an ambiguous choice operator M amb M. Recall that M| M means: either evaluate M or evaluate M. And M amb M means: evaluate both M and M on an arbitrary fair scheduler, and return whatever answer you get first. We defer the study of ambiguous choice until Sect. 2.", "num_citations": "1\n", "authors": ["1877"]}
{"title": "Generating irregular partitionable data structures\n", "abstract": " A fundamental problem in parallel computing is partitioning data structures in such a way as to minimize communication between processes while keeping the loads balanced. The problem is particularly acute when the underlying data structures are irregular, pointer-based structures. Here we present a methodology for partitioning a general class of dynamic data structures with guaranteed bounds on load-balancing and communication costs. Our method is based on a form of graph grammar, which specifies only families of graphs for which a “good” partitioning must exist. By modeling the construction and changes in a data structure using our formalism, one can quickly derive a good partitioning for a wide variety of common data structures. Moreover, expressing the structure updates in our grammars is generally a trivial operation with little overhead; this makes our approach particularly well-suited to dynamic …", "num_citations": "1\n", "authors": ["1877"]}
{"title": "Approximating Labeled Markov Processes\n", "abstract": " We study approximate reasoning about continuous-state labeled Markov processes. We show how to approximate a labeled Markov process by a family of finite-state labeled Markov chains. We show that the collection of labeled Markov processes carries a Polish space structure with a countable basis given by finite state Markov chains with ra-tional probabilities. The primary technical tools that we develop to reach these results are", "num_citations": "1\n", "authors": ["1877"]}
{"title": "Monotone and Nonmonotone Dataflow Networks\n", "abstract": " The expressiveness of concurrent data ow primitives have been studied from the point of view of automata theory 19] as well as in terms of abstractly given processes de ned in terms of traces 20]. The expressiveness of the merge primitives, fair merge, angelic merge and in nity-fair merge were shown to hinge on monotonicity properties of their trace languages. From the point of view of concurrent automata an important class of automata called monotone automata were de ned and it was shown that fair merge could not be implemented by such an automaton. In this paper we study the relationship between monotonicity properties of automata and of trace languages. We characterize the trace languages computed by monotone automata and we show that the characterization does not correspond to the existing monotonicity properties of trace languages. These, relatively easy, results led us to discover a new indeterminate primitive, the fair stack, that turns out to be nonmonotone and to have interesting expressiveness properties. We show that a fair stack is strictly weaker than fair merge but provably incomparable with angelic merge. These results suggest that it is time to study seriously the class of nonmonotone automata. i", "num_citations": "1\n", "authors": ["1877"]}
{"title": "Defining fair merge as a colimit: Towards a fixed-point theory for indeterminate dataflow\n", "abstract": " We define the action of the indeterminate dataflow primitive, fair merge, on infinite inputs as a limit. Fair merge is known to embody unbounded indeterminacy and is hence not continuous. Recent results about the expressiveness of indeterminate primitives shows that it is not even monotone in a suitable sense. Given this it is rather surprising that one can give a limiting description of fair merge. The key idea is to define fair merge in terms of the limit of a sequence of “tests”. The approach is suggested by an algebraic theory of distributed computing based on the notion of a bimonoid or bialgebra.", "num_citations": "1\n", "authors": ["1877"]}