{"title": "Regular tree model checking\n", "abstract": " In this paper, we present an approach for algorithmic verification of infinite-state systems with a parameterized tree topology. Our work is a generalization of regular model checking, where we extend the work done with strings toward trees. States are represented by trees over a finite alphabet, and transition relations by regular, structure preserving relations on trees. We use an automata theoretic method to compute the transitive closure of such a transition relation. Although the method is incomplete, we present sufficient conditions to ensure termination. We have implemented a prototype for our algorithm and show the result of its application on a number of examples.", "num_citations": "112\n", "authors": ["1417"]}
{"title": "Multi-clock timed networks\n", "abstract": " We consider verification of safety properties for parameterized systems of timed processes, so called timed networks. A timed network consists of a finite state process, called a controller, and an arbitrary set of identical timed processes. In a previous work, we showed that checking safety properties is decidable in the case where each timed process is equipped with a single real-valued clock. It was left open whether the result could be extended to multi-clock timed networks. We show that the problem becomes undecidable when each timed process has two clocks. On the other hand, we show that the problem is decidable when clocks range over a discrete time domain. This decidability result holds when processes have any finite number of clocks.", "num_citations": "50\n", "authors": ["1417"]}
{"title": "Dense-timed Petri nets: Checking zenoness, token liveness and boundedness\n", "abstract": " We consider Dense-Timed Petri Nets (TPN), an extension of Petri nets in which each token is equipped with a real-valued clock and where the semantics is lazy (i.e., enabled transitions need not fire; time can pass and disable transitions). We consider the following verification problems for TPNs. (i) Zenoness: whether there exists a zeno-computation from a given marking, i.e., an infinite computation which takes only a finite amount of time. We show decidability of zenoness for TPNs, thus solving an open problem from [Escrig et al.]. Furthermore, the related question if there exist arbitrarily fast computations from a given marking is also decidable. On the other hand, universal zenoness, i.e., the question if all infinite computations from a given marking are zeno, is undecidable. (ii) Token liveness: whether a token is alive in a marking, i.e., whether there is a computation from the marking which eventually consumes the token. We show decidability of the problem by reducing it to the coverability problem, which is decidable for TPNs. (iii) Boundedness: whether the size of the reachable markings is bounded. We consider two versions of the problem; namely semantic boundedness where only live tokens are taken into consideration in the markings, and syntactic boundedness where also dead tokens are considered. We show undecidability of semantic boundedness, while we prove that syntactic boundedness is decidable through an extension of the Karp-Miller algorithm.", "num_citations": "32\n", "authors": ["1417"]}
{"title": "Forward reachability analysis of timed Petri nets\n", "abstract": " We consider verification of safety properties for concurrent real-timed systems modelled as timed Petri nets, by performing symbolic forward reachability analysis. We introduce a formalism, called region generators for representing sets of markings of timed Petri nets. Region generators characterize downward closed sets of regions, and provide exact abstractions of sets of reachable states with respect to safety properties. We show that the standard operations needed for performing symbolic reachability analysis are computable for region generators. Since forward reachability analysis is necessarily incomplete, we introduce an acceleration technique to make the procedure terminate more often on practical examples. We have implemented a prototype for analyzing timed Petri nets and used it to verify a parameterized version of Fischer’s protocol and a producer-consumer protocol. We also used the tool to …", "num_citations": "29\n", "authors": ["1417"]}
{"title": "Selecting differentially expressed genes using minimum probability of classification error\n", "abstract": " Discovery of differentially expressed genes between normal and diseased patients is a central research problem in bioinformatics. It is specially important to find few genetic markers which can be explored for diagnostic purposes. The performance of a set of markers is often measured by the associated classification accuracy. This motivates our ranking of genes depending on the minimum probability of classification errors (MPE) for each gene. In this work, we use Bayesian decision-making algorithm to compute MPE. A quantile-based probability density estimation technique is used for generating probability density functions of genes.The method is tested on three datasets: colon cancer, leukaemia, and hereditary breast cancer. The quality of the selected markers is evaluated by the classification accuracy obtained using support-vector-machine and a modified naive Bayes classifier. We obtain 96.77% accuracy in …", "num_citations": "25\n", "authors": ["1417"]}
{"title": "Exploratory consensus of hierarchical clusterings for melanoma and breast cancer\n", "abstract": " Finding subtypes of heterogeneous diseases is the biggest challenge in the area of biology. Often, clustering is used to provide a hypothesis for the subtypes of a heterogeneous disease. However, there are usually discrepancies between the clusterings produced by different algorithms. This work introduces a simple method which provides the most consistent clusters across three different clustering algorithms for a melanoma and a breast cancer data set. The method is validated by showing that the Silhouette, Dunne's and Davies-Bouldin's cluster validation indices are better for the proposed algorithm than those obtained by k-means and another consensus clustering algorithm. The hypotheses of the consensus clusters on both the data sets are corroborated by clear genetic markers and 100 percent classification accuracy. In Bittner et al.'s melanoma data set, a previously hypothesized primary cluster is …", "num_citations": "24\n", "authors": ["1417"]}
{"title": "Biomarkers for epithelial ovarian cancers\n", "abstract": " Epithelial carcinoma of the ovary is one of the most common gynecological malignancies and the fifth most frequent cause of cancer death in women. Currently blood test of advanced epithelial tumors are reflected in a high level of CA 125 antigen. However, it is not a good marker for early stage tumors, and may yield false positives. Clearly, there is a need for better understanding of the molecular pathogenesis of epithelial ovarian cancer, so that new drug targets or biomarkers that facilitate early detection can be identified. This work concentrates on finding genetic markers for three epithelial ovarian tumors, using a simple computational method. We give a small set of genetic markers which are able to distinguish clear cell and mucinous ovarian cancers (13 and 26 genes respectively) from other epithelial ovarian tumors with 100% accuracy. We obtain the genes HNF1-beta (TCF2) and GGT1 as the best markers for the clear cell and CEACAM6 (NCA) as the best marker for mucinous ovarian tumors. We employ a feature selection technique based on minimum probability of error for this purpose. We give a ranking of the important genes responsible for these tumors and validate the results using the leave-one-out cross-validation technique.", "num_citations": "21\n", "authors": ["1417"]}
{"title": "Hierarchical clustering using the arithmetic-harmonic cut: Complexity and experiments\n", "abstract": " Clustering, particularly hierarchical clustering, is an important method for understanding and analysing data across a wide variety of knowledge domains with notable utility in systems where the data can be classified in an evolutionary context. This paper introduces a new hierarchical clustering problem defined by a novel objective function we call the arithmetic-harmonic cut. We show that the problem of finding such a cut is -hard and -hard but is fixed-parameter tractable, which indicates that although the problem is unlikely to have a polynomial time algorithm (even for approximation), exact parameterized and local search based techniques may produce workable algorithms. To this end, we implement a memetic algorithm for the problem and demonstrate the effectiveness of the arithmetic-harmonic cut on a number of datasets including a cancer type dataset and a corona virus dataset. We show favorable performance compared to currently used hierarchical clustering techniques such as -Means, Graclus and Normalized-Cut. The arithmetic-harmonic cut metric overcoming difficulties other hierarchal methods have in representing both intercluster differences and intracluster similarities.", "num_citations": "17\n", "authors": ["1417"]}
{"title": "Hierarchical clustering, languages and cancer\n", "abstract": " In this paper, we introduce a novel objective function for the hierarchical clustering of data from distance matrices, a very relevant task in Bioinformatics. To test the robustness of the method, we test it in two areas: (a) the problem of deriving a phylogeny of languages and (b) subtype cancer classification from microarray data. For comparison purposes, we also consider both the use of ultrametric trees (generated via a two-phase evolutionary approach that creates a large number of hypothesis trees, and then takes a consensus), and the best-known results from the literature.               We used a dataset of measured ’separation time’ among 84 Indo-European languages. The hierarchy we produce agrees very well with existing data about these languages across a wide range of levels, and it helps to clarify and raise new hypothesis about the evolution of these languages.               Our method also generated a …", "num_citations": "15\n", "authors": ["1417"]}
{"title": "Using Forward Reachability Analysis for Verification of Timed Petri Nets.\n", "abstract": " We consider verification of safety properties for concurrent real-timed systems modelled as timed Petri nets, by performing symbolic forward reachability analysis. We introduce a formalism, called region generators for representing sets of markings of timed Petri nets. Region generators characterize downward closed sets of regions, and provide exact abstractions of sets of reachable states with respect to safety properties. We show that the standard operations needed for performing symbolic reachability analysis are computable for region generators. Since forward reachability analysis is necessarily incomplete, we introduce an acceleration technique to make the procedure terminate more often on practical examples. We have implemented a prototype for analyzing timed Petri nets and used it to verify a parameterized version of Fischer’s protocol, Lynch and Shavit’s mutual exclusion protocol and a producer-consumer protocol. We also used the tool to extract finite-state abstractions of these protocols.", "num_citations": "10\n", "authors": ["1417"]}
{"title": "Model checking parameterized timed systems\n", "abstract": " Mahata, P. 2005: Model Checking Parameterized Timed Systems. Acta Universitatis Upsaliensis. Uppsala Dissertations from the Faculty of Science and Technology 61. 180 pp. Uppsala, Sweden. ISBN 91-554-6158-1In recent years, there has been much advancement in the area of verification of infinite-state systems. A system can have an infinite state-space due to unbounded data structures such as counters, clocks, stacks, queues, etc. It may also be infinitestate due to parameterization, ie, the possibility of having an arbitrary number of components in the system. For parameterized systems, we are interested in checking correctness of all the instances in one verification step. In this thesis, we consider systems which contain both sources of infiniteness, namely:(a) real-valued clocks and (b) parameterization. More precisely, we consider two models:(a) the timed Petri net (TPN) model which is an extension of the classical Petri net model; and (b) the timed network (TN) model in which an arbitrary number of timed automata run in parallel.", "num_citations": "10\n", "authors": ["1417"]}
{"title": "Decidability of Zenoness, syntactic boundedness and token-liveness for dense-timed petri nets\n", "abstract": " We consider Timed Petri Nets (TPNs) : extensions of Petri nets in which each token is equipped with a real-valued clock. We consider the following three verification problems for TPNs.               (i) Zenoness: whether there is an infinite computation from a given marking which takes only a finite amount of time. We show decidability of zenoness for TPNs, thus solving an open problem from [dFERA00].               (ii) Token Liveness: whether a token is alive in a marking, i.e., whether there is a computation from the marking which eventually consumes the token.We show decidability of the problem by reducing it to the coverability problem,which is decidable for TPNs.               (iii)Boundedness: whether the size of the reachable markings is bounded. We consider two versions of the problem; namely semantic boundedness where only live tokens are taken into consideration in the markings,and syntactic boundedness …", "num_citations": "10\n", "authors": ["1417"]}
{"title": "Closed, open, and robust timed networks\n", "abstract": " We consider verification of safety properties for parameterized systems of timed processes, so called timed networks. A timed network consists of a finite state process, called a controller, and an arbitrary set of identical timed processes. In [Parosh Aziz Abdulla and Bengt Jonsson. Model checking of systems with many identical timed processes. Theoretical Computer Science, 290(1):241–264, 2003] it was shown that checking safety properties is decidable in the case where each timed process is equipped with a single real-valued clock. In [P. Abdulla, J. Deneux, and P. Mahata. Multi-clock timed networks. In Proc. LICS' 04, pages 345–354. IEEE Computer Society Press, 2004], we showed that this is no longer possible if each timed process is equipped with at least two real-valued clocks. In this paper, we study two subclasses of timed networks: closed and open timed networks. In closed timed networks, all clock …", "num_citations": "4\n", "authors": ["1417"]}
{"title": "Maximizing correlation for supervised classification\n", "abstract": " In this paper, we develop a novel feature selection and classification approach using the correlation maximization paradigm. This approach is particularly interesting when the number of features is very large in comparison to the number of samples, as in the datasets arising in the bioinformatics applications. We illustrate our method by showing 100 genetic markers which act together in separating ovarian endometroid tumors from other ovarian epithelial tumors. Notice that in the previous works, there was no single marker gene found for this purpose.", "num_citations": "2\n", "authors": ["1417"]}
{"title": "Periodicity Detection in Small-Sample Gene-Expression Data\n", "abstract": " Analysis of cell-cycle regulation, circadian rhythms, ovarian cycle, etc, demands finding periodicity in the biological data. In this work, we will consider gene expression data, which is usually quite noisy and comprise of small number of samples from very few periods (2 - 3). We propose a n on-parametric method for detecting the period and shape of the periodic signals (e.g., gene expressions for cell-cycles). We use a quadratic-optimization problem formulation in order to find the shape of the signal and the properties of periodicity to find the exact period. Finally, we show the results of applying this method on the gene expression data for human fibroblast cell cycles.", "num_citations": "1\n", "authors": ["1417"]}