{"title": "Chamomile (Matricaria chamomilla L.): an overview\n", "abstract": " Chamomile (Matricaria chamomilla L.) is a well-known medicinal plant species from the Asteraceae family often referred to as the “star among medicinal species.” Nowadays it is a highly favored and much used medicinal plant in folk and traditional medicine. Its multitherapeutic, cosmetic, and nutritional values have been established through years of traditional and scientific use and research. Chamomile has an established domestic (Indian) and international market, which is increasing day by day. The plant available in the market many a times is adulterated and substituted by close relatives of chamomile. This article briefly reviews the medicinal uses along with botany and cultivation techniques. Since chamomile is a rich source of natural products, details on chemical constituents of essential oil and plant parts as well as their pharmacological properties are included. Furthermore, particular emphasis is given to …", "num_citations": "532\n", "authors": ["472"]}
{"title": "Oxidative stress and antioxidant status during transition period in dairy cows\n", "abstract": " The study was conducted on 20 Holstein X Sahiwal cross bred dairy cows, with an average milk production of  liters in  days during a single lactation, that were divided in to two groups of 10 animals. We investigated the oxidative stress and antioxidant status during the transition period in dairy cows. In this study, plasma level of MDA was considered as an indicator of lipid peroxidation and SOD, catalase, GSH and GSHPx as antioxidants. The lipid peroxidation was significantly (p< 0.001) higher in cows during early lactation as compared to the cows in advanced pregnancy. A significant positive correlation (r=+ 0.831, p< 0.01) was determined between MDA and catalase in early lactating cows. In early lactating cows, blood glutathione was significantly lower than in advanced pregnant cows. However, early lactating cows showed non-significant negative correlation for all antioxidant enzymes with lipid peroxidation. In conclusion, dairy cows seemed to have more oxidative stress and low antioxidant defense during early lactation or just after parturition than advanced pregnant cows, and this appears to be the reason for their increased susceptibility to production diseases (eg mastitis, metritis, retention of fetal membranes etc.) and other health problems.", "num_citations": "182\n", "authors": ["472"]}
{"title": "Flexible software reliability growth model with testing effort dependent learning process\n", "abstract": " A lot of importance has been attached to the testing phase of the Software Development Life Cycle (SDLC). It is during this phase it is checked whether the software product meets user requirements or not. Any discrepancies that are identified are removed. But testing needs to be monitored to increase its effectiveness. Software Reliability Growth Models (SRGMs) that specify mathematical relationships between the failure phenomenon and time have proved useful. SRGMs that include factors that affect failure process are more realistic and useful. Software fault detection and removal during the testing phase of SDLC depend on how testing resources (test cases, manpower and time) are used and also on previously identified faults. With this motivation a Non-Homogeneous Poisson Process (NHPP) based SRGM is proposed in this paper which is flexible enough to describe various software failure/reliability curves …", "num_citations": "102\n", "authors": ["472"]}
{"title": "A fuzzy logic based decision support system for evaluation of suppliers in supply chain management practices\n", "abstract": " Supply chain management is an increasingly important organizational concern, and proper evaluation of suppliers constitutes one essential element of supply chain success. Continuous evaluation of a particular supplier becomes more important considering the fact that in most industries the cost of raw materials and component parts constitutes the main cost of a product, such that in some cases it can account for up to 70%. However, there is little research that has helped the organizations in continuous evaluation of their suppliers. We propose a new model, based on fuzzy logic to handle the various attributes, associated with supplier evaluation problems. Four multi-input single output (MISO) mamdani fuzzy inference systems have been proposed for supplier evaluation. The proposed model has also been illustrated through a case study.", "num_citations": "84\n", "authors": ["472"]}
{"title": "Development of a GIS interface for estimation of runoff from watersheds\n", "abstract": " Development of accurate surface runoff estimation techniques from ungauged watersheds is relevant in Indian condition due to the non-availability of hydrologic gauging stations in majority of watersheds. Besides this, the high budgetary requirements for installation of gauging stations are another limiting factor in India, which leads to the use of surface runoff estimation techniques for ungauged watersheds. Natural Resources Conservation Services Curve Number (NRCS-CN) method is one of the most widely used methods for quick and accurate estimation of surface runoff from ungauged watershed. Also, the coupling of NRCS-CN techniques with the advanced Geographic Information System (GIS) capabilities automates the process of runoff prediction in timely and efficient manner. Keeping view of this, a GIS interface was developed using the in-built macro programming language, Visual Basic for …", "num_citations": "64\n", "authors": ["472"]}
{"title": "Production potential of chickpea (Cicer arietinum)-based intercropping systems under irrigated conditions\n", "abstract": " A field experiment was conducted during 2000–2002 at New Delhi, to evaluate the productivity of chickpea (Cicer arietinum L.)-based intercropping systems. The yield of chickpea was adversely affected by intercropping with Indian mustard [Brassica juncea (L.) Czernj. & Cosson], barley (Hordeum vulgare L, s.l.) and linseed (Linum usitatissimum L). However, the magnitude of reduction was relatively greater in Indian mustard. Further, the yield of chickpea increased as the proportion of chickpea increased in the mixture from 2:1 to 4:1, while reverse trend was noticed in the yield of intercrops. Sole Indian mustard recorded the highest total productivity in terms of chickpea-equivalent yield (CEY), followed by chickpea + Indian mustard (2:1), chickpea + linseed in various row proportions and sole chickpea recorded similar CEY, which was markedly lower than sole barley and linseed and chickpea intercropped with …", "num_citations": "59\n", "authors": ["472"]}
{"title": "Physical principles of losses in thin film solar cells and efficiency enhancement methods\n", "abstract": " Although there are individual reports on the efficiency enhancement methods in the form of news articles, highlights and research papers in the literature; there is no article mentioning all the methods used for enhancing the efficiency of a thin film solar cell. This article is focused on discussing the physical principles of losses in a thin film solar cell and the methods used for enhancing the efficiency. The article begins with a general outline about the thin film solar cell, its advantages, material requirements and its characteristics. Various losses in solar cell and how to overcome them in order to improve the efficiency of solar cell are discussed. Some novel methods used for enhancing the efficiency of thin solar cell are also discussed. Towards end, summary of some other parameters which can add to the efficiency of solar cell are described.", "num_citations": "51\n", "authors": ["472"]}
{"title": "Safed musli (Chlorophytum borivilianum): A review of its botany, ethnopharmacology and phytochemistry\n", "abstract": " Ethnopharmacological relevanceSafed musli (Chlorophytum borivilianum) is an eminent medicinal plant of India and considered as a ‘white gold’ or ‘divya aushad’ in Indian systems of medicine. In Ayurveda, Chlorophytum borivilianum belongs to the group of “Vajikaran Rasayana” corroborated to its rejuvenating, aphrodisiac, natural sex tonic properties and effective in alleviating sexual disorders. It is largely used as ethnic medicine by local healers of indigenous communities of India.Materials and methodsA thorough bibliographic investigation was carried out by analyzing worldwide accepted scientific data base (Pub Med, SciFinder, Scopus and Web of Science), thesis, recognized books, non impact and non indexed journals.ResultsTraditionally, Chlorophytum borivilianum is well known for treating male impotency in India. The multi therapeutic and nutritional importance of Chlorophytum borivilianum is …", "num_citations": "49\n", "authors": ["472"]}
{"title": "Growth of CZTS thin films by cosputtering of metal targets and sulfurization in H2S\n", "abstract": " Copper zinc tin sulfide (CZTS) is an emerging thin film photovoltaic material. Chemical composition and phase purity are important factors which decide the quality of the film for photovoltaic applications. In the present work, we report the results of the morphological, structural, optical, and electrical characterizations of Cu2ZnSnS4 thin films, synthesized by sulfurizing magnetron cosputtered Cu2ZnSn thin films in ambient H2S. To the best of our knowledge, this is the first report on CZT deposition by cosputtering from Cu, Zn, and Sn targets and sulfurizing it in ambient H2S for making CZTS thin films. GIXRD and Raman study results showed that the film was kesterite CZTS. Optical absorbance studies revealed a band gap value of ~1.5 eV for CZTS thin film. Results of the Hall effect measurements are also reported.", "num_citations": "48\n", "authors": ["472"]}
{"title": "Controlled substitution of S by Se in reactively sputtered CZTSSe thin films for solar cells\n", "abstract": " CZTSSe thin films are considered to be future of flexible thin film solar cell. Amount of S and Se in the CZTSSe thin films controls the band gap. Therefore, control over the concentration of S/Se is very important for enhancing the efficiency. CZTS thin films were deposited on SLG substrate by sequential reactive sputtering of metal targets. The films were annealed in Se atmosphere at 550 °C for 10–25 min in order to obtain CZTSSe thin films. Elemental, surface morphological, optical and structural properties of CZTSSe thin films have been investigated in detail. Optical band gap energy of CZTSSe thin films were in the range of 1.1–1.35 eV. XRD and Raman analysis were used to analyze the structure and phase purity of CZTSSe thin films. High intense peak at 27.9° in the XRD pattern corresponding to (112) plane was observed. High intensity of XRD peak corresponding to (112) direction revealed that the growth is …", "num_citations": "47\n", "authors": ["472"]}
{"title": "Multi up-gradation software reliability growth model with imperfect debugging\n", "abstract": " Due to demand of new features and highly reliable software system, the software industries are speeding their up-gradations/add-ons in the software. The life of software is very short in the environment of perfect competition. Therefore the software developers have to come up with successive up gradations to survive. The reported bugs from the existing software and Features added to the software at frequent time intervals lead to complexity in the software system and add to the number of faults in the software. The developer of the software can lose on market share if it neglects the reported bugs and up gradation in the software and on the other hand a software company can lose its name and goodwill in the market if the reported bugs and functionalities added to the software lead to an increase in the number of faults in the software. To capture the effect of faults due to existing software and generated in …", "num_citations": "45\n", "authors": ["472"]}
{"title": "Fast switching response of Na-doped CZTS photodetector from visible to NIR range\n", "abstract": " It is important to study the photoconductivity to understand the optoelectronic properties of semiconductor thin films. Here, we report the effect of Na doping on the photoconductivity properties of CZTS (Cu2ZnSnS4) in the visible and NIR region. CZTS thin films were deposited on quartz and silicon dioxide substrates using stacked layer reactive sputtering and annealing. The photoconductivity of undoped CZTS and Na-doped CZTS in visible region (excitation wavelength – 532 nm) and in the NIR region (excitation wavelength – 1064 nm) were studied. At a bias voltage of 150 mV, response rise time for undoped CZTS in the visible region was 1.02 s which decreased to 391 ms for Na-doped CZTS. The rise time in NIR region decreased from 245 ms (for undoped CZTS) to 1.06 ms (for Na-doped CZTS). The decay time for undoped sample (in the visible region) was 1.20 s, which decreased to 221 ms (for Na-doped …", "num_citations": "42\n", "authors": ["472"]}
{"title": "Efficacy of leech therapy in the management of osteoarthritis (Sandhivata)\n", "abstract": " Osteoarthritis (degenerative joint disease) is the most common joint disorder. It mostly affects cartilage. The top layer of cartilage breaks down and wears away. Osteoarthritis is of two types, primary (idiopathic) and secondary. In idiopathic osteoarthritis, the most common form of the disease, no predisposing factor is apparent. Secondary OA is pathologically indistinguishable from idiopathic OA but is attributable to an underlying cause. In Ayurveda the disease Sandhivata resembles with osteoarthritis which is described under Vatavyadhi. The NSAIDs are the main drugs of choice in modern medicine which have lots of side effects and therefore are not safe for long-term therapy. Raktamokshan, ie, blood letting is one of the ancient and important parasurgical procedures described in Ayurveda for treatment of various diseases. Of them, Jalaukavacharana or leech therapy has gained greater attention globally, because …", "num_citations": "39\n", "authors": ["472"]}
{"title": "Enhanced photoresponse of Cu2ZnSn (S, Se) 4 based photodetector in visible range\n", "abstract": " Fast switching response of photodetectors is needed for many applications. Therefore, it is necessary to study the photoconductivity properties of earth abundant and cost effective materials. Till now, there are only two reports based on photoconductivity study of Cu2ZnSnS4 (CZTS) based materials. In this study, CZTSSe thin film on soda-lime glass substrate was deposited using one-step reactive sputtering from CZTSe target in presence of H2S followed by annealing. Optical, structural, morphological and elemental compositional analyses were carried out to characterize the CZTSSe thin film. The value of optical band gap estimated using Tauc's plot was 1.45 eV. The presence of very intense peak corresponding to (112) plane in the XRD pattern suggested growth to be oriented. Similar was the case with Raman studies. Photoconductivity study of CZTSSe thin film in visible region (excitation wavelength – 532 nm …", "num_citations": "37\n", "authors": ["472"]}
{"title": "A comparison of nested PCR assay with conventional techniques for diagnosis of intestinal cryptosporidiosis in AIDS cases from northern India\n", "abstract": " Cryptosporidiosis is a very important opportunistic infection and is responsible for significant morbidity and mortality in HIV/AIDS patients. Although current laboratory methods are generally considered adequate to detect high concentrations of oocysts, they fail to detect cases of cryptosporidiosis in many immunocompromised patients. The present study was done to determine the diagnostic efficacy of modified Ziehl-Neelsen (ZN), antigen detection ELISA, and a nested PCR assay for detection of Cryptosporidium in 58 adult AIDS cases with diarrhea from the ART clinic of Lok Nayak Hospital, New Delhi. Cryptosporidium was detected in 17 (29.4%), 39 (67.3%), and 45 (77.5%) cases by modified ZN staining, antigen ELISA, and nested PCR assay, respectively. Taking nested PCR as the gold standard, specificity of both modified ZN staining and Cryptosporidium antigen detection ELISA was 100% while the sensitivity of the tests was 37.8% and 86.6%, respectively. PCR was more sensitive than the other two diagnostic modalities but required a more hands-on time per sample and was more expensive than microscopy. PCR, however, was very adaptable to batch analysis, reducing the costs considerably. This assay can therefore have considerable advantages in the treatment of immunosuppressed individuals like AIDS patients, allowing their early diagnosis and decreasing the morbidity and the mortality.", "num_citations": "37\n", "authors": ["472"]}
{"title": "Profit maximization by virtue of price & warranty length optimization\n", "abstract": " Warranties serve as persuasive marketing tools: (i) promotional and (ii) protectoral. As a promotional tool, warranties serve to promote the reliability and quality of a product with longer and better warranty terms implying a more reliable product. As a protectoral tool, warranties provide assurance to consumers against defective products that fail to perform satisfactorily over the warranty period. This assurance reduces the risks associated with purchase of the product but introduces some impedimentation in profit management for the manufacturer. Using a two dimensional innovation diffusion model to demonstrate product sales cycle, this study presents a methodical approach to obtain optimal price and warranty length for a product. The model examines significance of these decision variables and estimates the overall maximum profit for the manufacturer. Exponential distribution has been used to represent the life …", "num_citations": "36\n", "authors": ["472"]}
{"title": "Consumer behaviour-based innovation diffusion modelling using stochastic differential equation incorporating change in adoption rate\n", "abstract": " Bass innovation and diffusion model and many of its extended forms have been reported in marketing literature and applied successfully for predicting adoption curve of products from different segments of market. All these models assume that an adopter buys the product only once in his lifetime, however, this may not be true, because a consumer might buy the product more than once for his utility (repeat purchasing). Also, there can occur a situation that the consumer leaves the system without buying the product (balking). In this paper, we propose a diffusion model based on Itô’s type of stochastic differential equation with repeat purchasing and balking. It also incorporates the change-point concept, where the rate of product adoption per remaining potential adopter might change due to shift in marketing/promotional strategy, entry/exit of some of the competitors in the market. The applicability of the proposed …", "num_citations": "36\n", "authors": ["472"]}
{"title": "Field guide: mungbean & urdbean\n", "abstract": " Field guide: mungbean & urdbean - World Vegetable Center login Home > Field guide: mungbean & urdbean World Vegetable Center Information Usage statistics Files Holdings Record Details Title: Field guide: mungbean & urdbean Author(s): Sharma, OP Bambawale, OM Gopali, JB Bhagat, S. Yelshetty, S. Singh, SK Anand, R. Singh, OP Imprint: New Delhi National Centre for Integrated Pest Management India IN Publication date: 2011 Description: 32 pp. Subject(s): MUNGBEANS BLACKGRAM SELECTION CROPPING SYSTEMS CULTIVARS SEED TREATMENT FERTILIZERS IRRIGATION PLANT PROTECTION PLANT DISEASES PEST INSECTS STORAGE WEED CONTROL INTEGRATED PEST MANAGEMENT Call number: SB205.M8S4 Linked resources: Fulltext: eb0190 - PDF Contact information: harvest@worldveg.org Record appears in: Research > Books Export Export as: BibTeX | MARC | MARCXML -…", "num_citations": "36\n", "authors": ["472"]}
{"title": "Electrical characterization of grain boundaries of CZTS thin films using conductive atomic force microscopy techniques\n", "abstract": " Electrical characterization of grain boundaries (GB) of Cu-deficient CZTS (Copper Zinc Tin Sulfide) thin films was done using atomic force microscopic (AFM) techniques like Conductive atomic force microscopy (CAFM), Kelvin probe force microscopy (KPFM) and scanning capacitance microscopy (SCM). Absorbance spectroscopy was done for optical band gap calculations and Raman, XRD and EDS for structural and compositional characterization. Hall measurements were done for estimation of carrier mobility. CAFM and KPFM measurements showed that the currents flow mainly through grain boundaries (GB) rather than grain interiors. SCM results showed that charge separation mainly occurs at the interface of grain and grain boundaries and not all along the grain boundaries.", "num_citations": "35\n", "authors": ["472"]}
{"title": "Effect of annealing time on the composition, microstructure and band gap of copper zinc tin sulfide thin films\n", "abstract": " In this study, CZTS thin films were deposited by co-sputtering Cu, ZnS and SnS targets and sulfurizing it in H2S atmosphere at 550 C. It has been observed that by varying the sulfurization time from 5 to 40 min, the secondary phases got eliminated and stoichiometric film is obtained. This leads to change in the optical band gap from 1.67 to 1.51 eV. The crystallite size calculated using the broadening in the (112) peak of the X-ray diffraction spectra also changed with the sulfurization time from 15.0 to 21.7 nm. Broadening and shift in the Raman peaks have also been observed. Changes in grain size have been observed in scanning electron microscopic studies. In short, the increased band gap reported in literatures may be due to the presence of impurities (except for particles where quantum confinement is applicable; with size less than~ 7 nm). The above conclusion is based on careful analysis of XRD and Raman data. This study shall help in characterizing CZTS thin film properly, growing high quality CZTS thin films for the realization of high efficiency and durable CZTS based solar cell. Copyright© 2015 VBRI Press.", "num_citations": "34\n", "authors": ["472"]}
{"title": "Effect of temperature on thermal expansion and anharmonicity in Cu2ZnSnS4 thin films grown by co-sputtering and sulfurization\n", "abstract": " Copper zinc tin sulfide (CZTS, made from the earth abundant and non-toxic materials) is a quaternary semiconducting compound which has received increasing interest for solar cells applications. In this study, CZTS thin film has been grown by co-sputtering Cu, Zn and Sn metal targets and sulfurizing it in H2S. XRD, SEM, EDS, XRF and optical studies show that these films are suitable for solar cell applications. The temperature-dependent Raman spectroscopic study on CZTS thin ﬁlm was carried out in the temperature range of 80–450 K. A decrease in the intensity of “A” mode Raman peaks, shift of Raman peaks towards lower frequency and increase in the line width have been observed with increase in temperature. Raman “A” mode shifts from 337 cm−1 at 80 K to 329 cm−1 at 450 K. The peak at 288 cm−1 disappears when the measurement was taken at 450 K. Based on experimental results and fittings of …", "num_citations": "34\n", "authors": ["472"]}
{"title": "Determining adoption pattern with pricing using two-dimensional innovation diffusion model\n", "abstract": " Studying the dynamics of the technology diffusions under the key determinants that influence the adoption of a technology across time and/or space into the market is crucial to assess the business case for new technologies. The topic diffusion has been widely studied by researchers from different disciplines, including Sociology, Economics, Psychology and Marketing. However a substantial amount of research has been focused on one dimension: either to examine the individual's adoption of an innovation or to explain the time path of adoption of technologies typically follows an S-shaped curve. The other dimensions of the diffusion of an innovation, has gained less attention. In this paper, we derive a two-dimensional technology diffusion innovation model which combines the adoption time of technological diffusion and price of the technology product. In the proposed model technological adoptions and the role of …", "num_citations": "34\n", "authors": ["472"]}
{"title": "Nanostructured Cu2ZnSnS4 (CZTS) thin film for self-powered broadband photodetection\n", "abstract": " Nanostructured materials exhibit broad spectral photodetection, strong light matter interaction and exotic optoelectronic properties compared to their bulk counterpart. To overcome the limitations of silicon based photodetectors, various nanomaterials have been investigated. Here we have used industrially viable stacked layer reactive sputtering method to grow rice-like nanostructured (rln) Cu2ZnSnS4 (CZTS) thin films. The rln-CZTS film showed optical absorption coefficient one order of magnitude greater than the plain thin films of CZTS. Further, even under zero bias condition, broad spectral response (in visible and near infrared range) was observed. The rise and decay time constants for visible (532 nm) and near infrared (NIR) (1064 nm) light incident were 208 ms, 175 ms and 681 ms, 778 ms, respectively (for 1 mV bias). The improvement in photocurrent has been attributed to enhanced light harvesting due to …", "num_citations": "32\n", "authors": ["472"]}
{"title": "Weed management in late sown wheat (Triticum aestivum) after rice (Oryza sativa) in rice-wheat system in rainfed lowland\n", "abstract": " To study the efficacy of different herbicides, tillage practices and weed control measures on late sown wheat (Triticum aestivum L. emend. Fiori & Paol) field experiments were conducted during winter of 2004–05 to 2006–07 at Ghaghraghat (Bahraich) in Uttar Pradesh. Significantly lower density, weight, and nutrient uptake by weeds was recorded with isoproturon + 2,4-D (0.75 + 0.6 kg/ha) resulting in higher mean grain yield (3.89 tonne/ha) and net income (Rs. 18,375/ha). Weed free treatment recorded the highest energy output and lowest energy use efficiency (EUE). Isoproturon + 2, 4-D resulted in the highest EUE and energy productivity followed by metribuzin. Conventional tillage (CT) significantly increased density and dry matter of weeds when compared with zero tillage (ZT), thus, ZT increased grain yield of wheat by 2.18% as compared to CT. Sulfosulfuron (25 g/ha) recorded the lower density and dry weight …", "num_citations": "30\n", "authors": ["472"]}
{"title": "Sodium induced grain growth, defect passivation and enhancement in the photovoltaic properties of Cu2ZnSnS4 thin film solar cell\n", "abstract": " Sodium diffusion from soda lime glass (SLG) during high temperature annealing is known to play a crucial role in affecting the grain growth and defect passivation in chalocogenide/kesterite solar cells. Additional sodium is required when low temperature or short term annealing is used. Although this fact is known, a systematic comparative study for kesterite films is seldom reported. In the present study, Cu2ZnSnS4 thin films were deposited on SLG and Mo coated SLG using stacked layer reactive sputtering. Na was deposited over the CZTS thin film and the film was annealed in N2 atmosphere in order to enhance the grain growth. This resulted in the shift in the XRD peak towards lower diffraction angle. The optical bandgap shifted from 1.45 eV to 1.38 eV with Na addition. Significant grain growth from hundreds of nanometer to micrometer was observed in samples with Na. Device fabricated in SLG/Mo/CZTS/CdS …", "num_citations": "29\n", "authors": ["472"]}
{"title": "Na incorporated improved properties of Cu2ZnSnS4 (CZTS) thin film by DC sputtering\n", "abstract": " Polycrystalline CZTS is an emerging candidate for photovoltaic, optoelectronic and gas sensing applications due to its availability and environment-friendly nature and also favorable light harvesting properties. The properties of polycrystalline materials depend upon the grain size. Grain size can be increased by increasing the annealing time, but this may lead to increased cost and also evaporation of certain volatile and low melting materials. Adding some growth enhancing elements is one of the novel methods to improve the grain size of polycrystalline materials. In this study, we studied Na induced CZTS film prepared by sputtering method. Before sulfurization, NaF (∼30 nm) thin layer was deposited on deposited CZT film using thermal evaporation method. UV-Visible, XRD and SEM/EDS analysis were used for studying optical, structural, elemental and morphological properties of CZTS films.", "num_citations": "28\n", "authors": ["472"]}
{"title": "Anti-inflammatory activity of roots of Cichorium intybus due to its inhibitory effect on various cytokines and antioxidant activity\n", "abstract": " Background:Cichorium intybus L. commonly known as chicory is one of the important medicinal plants commonly used in Ayurvedic system of medicine. It is commonly used for the treatment of diseases involving a khapa and pitta doshas. Traditionally, C. intybus is used for the treatment of inflammatory conditions, but there are only few in vitro studies reporting the anti-inflammatory activity of roots of chicory.Objective:Evaluation of anti-inflammatory activity of roots of chicory and mechanisms involved in it using in vivo models of inflammation.Materials and Methods:Albino Wistar rats of either sex weighing 150–200 g were used. Ethanolic and aqueous extracts of roots of chicory were prepared with the help of Soxhlet's apparatus. The anti-inflammatory activity was studied using carrageenan-induced paw edema method and cotton pellet granuloma method. Levels of cytokines such as tumor necrosis factor alpha (TNF …", "num_citations": "28\n", "authors": ["472"]}
{"title": "Effects of certain metallic pollutants on plant genetic system\n", "abstract": " CiNii 論文 - Effects of certain metallic pollutants on plant genetic system CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす 大学図書館の本をさがす 日本の博士論文を さがす 新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者 ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版年 年から 年まで 検索 検索 検索 Effects of certain metallic pollutants on plant genetic system SINGH OP 被引用文献: 1件 著者 SINGH OP 収録刊行物 The Nucleus The Nucleus 23, 15-29, 1980 被引用文献: 1件中 1-1件を 表示 1 Meiotic Abnormalities and Tetraploidy (by Lead Nitrate) Induced by Heavy Metals (Pb, Cu, Hg, Zn) on Helianthus annuus L SRIVASTAVA Richa , SRIVASTAVA Gopal K. Cytologia : international journal of cytology 69(2), 119-124, 2004-06-25 参考文献15件 被引用文献1件 Tweet 各種コード NII論文ID(NAID) 10012802884 NII書誌ID(NCID) AA00760316 資料種別 雑誌…", "num_citations": "28\n", "authors": ["472"]}
{"title": "Interfacial properties of CZTS thin film solar cell\n", "abstract": " Cu-deficient CZTS (copper zinc tin sulfide) thin films were grown on soda lime as well as molybdenum coated soda lime glass by reactive cosputtering. Polycrystalline CZTS film with kesterite structure was produced by annealing it at 500∘ C in Ar atmosphere. These films were characterized for compositional, structural, surface morphological, optical, and transport properties using energy dispersive X-ray analysis, glancing incidence X-ray diffraction, Raman spectroscopy, scanning electron microscopy, atomic force microscopy, UV-Vis spectroscopy, and Hall effect measurement. A CZTS solar cell device having conversion efficiency of∼ 0.11% has been made by depositing CdS, ZnO, ITO, and Al layers over the CZTS thin film deposited on Mo coated soda lime glass. The series resistance of the device was very high. The interfacial properties of device were characterized by cross-sectional SEM and cross-sectional HRTEM.", "num_citations": "27\n", "authors": ["472"]}
{"title": "Software reliability growth and innovation diffusion models: An interface\n", "abstract": " The objective of this paper is to show an interface between modelling, allocation problems and control problems in software reliability and marketing. It has been brought out that in models which exist in software reliability and defined implicitly/explicitly for errors of two types; it is the dependency factor among errors that gives rise to S-Shaped growth curve. It is further shown that this dependency on the line of categorization of errors, adopters can be of several types/categories. Such categorization, though implicit in nature, not brought out in literature, further strengthens the fact that modeling any software phenomenon should incorporate errors of different severity rather explicitly. We have also provided a general model which can account for imperfect debugging and error generation in software reliability. The approach followed is rather implicit in nature but provides good closed form solutions. Such solutions were …", "num_citations": "25\n", "authors": ["472"]}
{"title": "Anti-inflammatory effect of Fumaria parviflora leaves based on TNF-α, IL-1, IL-6 and antioxidant potential\n", "abstract": " Objective:In this study, we evaluated anti-inflammatory activity of leaves of Fumaria parviflora (F. parviflora) and underlying mechanisms by using in vivo models of inflammation.Material and Methods:Albino Wistar rats of either sex weighing 150-200 g were used. Soxhlet ethanol and aqueous extracts of leaves of F. parviflora (EFP and AFP) were prepared. The anti-inflammatory activity was studied using carrageenan-induced paw edema method and cotton pellet granuloma method. Levels of cytokines such as TNF-α, IL-6 and IL-1 and activity of antioxidant enzymes including catalase (CAT) and glutathione peroxidase (GPx) were estimated.Results:Leaves of F. parviflora demonstrated significant (p< 0.001) decrease in paw edema in carrageenan-induced paw edema method. It diminished the serum tumour necrosis factor-α (TNF-α), IL-6 and IL-1 levels and also significantly attenuated the malondialdehyde (MDA …", "num_citations": "23\n", "authors": ["472"]}
{"title": "Queuing theory-based innovation diffusion modelling incorporating change in adoption rate\n", "abstract": " Adoption has always been an important process to discuss among marketers. Major work in the field of innovation adoption has been based on theory of first purchase by consumers. Of late attention has also been given to multi-stage nature of diffusion process. There are practitioners who have verified adoption as multi-stage process (depending on awareness and motivation). Researchers have lately also understood the value of change in marketing strategy and other factors that often lead to change in the rate of adoption. In this paper, we have made use of this stage wise approach of market penetration along with change point concept, have developed a methodical approach based on infinite server queuing theory and predicted sales for consumer durables. Experimental results estimated on sales of two different consumer durables show that present proposal can depict the change in adoption rates and …", "num_citations": "22\n", "authors": ["472"]}
{"title": "Evolution of structural and magnetic phases in Nd doped BiFeO3 multiferroics with sintering time\n", "abstract": " The effect of sintering time on the evolution of structural and magnetic phases has been studied in Bi0.8Nd0.2FeO3 multiferroic. These multiferroics were prepared by normal solid state reaction technique. XRD, NPD and VSM characterizations were performed to explore the structural and magnetic properties and correlation between these. The refinement of the XRD patterns using FullProf program show, mixed phase having rhombohedral (R3c) + orthorhombic (Pnma) symmetry in sample sintered for 1 h. For sample sintered for two hours, crystal structure was found to be mixed phase with rhombohedral (R3c) + orthorhombic (Pbam) symmetry and the sample sintered for three hours, it crystallized in pure orthorhombic (Pbam) symmetry. The octahedral tilting is thus found to be changing systematically with the variation of sintering time. The refinement of the neutron diffractions patterns confirms the XRD results of …", "num_citations": "21\n", "authors": ["472"]}
{"title": "An innovation diffusion model for consumer durables with three parameters\n", "abstract": " Strategic innovation diffusion converts newly created knowledge into increasing a firm’s value primarily through innovative product offerings. In this paper, we present a time-based adoption pattern with pricing and promotional expenditure as a three-dimensional innovation diffusion model (3D-IDM). In our proposed 3D-IDM, we assume that value of the product plays a crucial role of being the major driver of diffusion, and is classified into the following three main factors: (1) continuation time of the product in the market – representing goodwill of the product; (2) price of the product – indicating consumers’ buying behaviour; and (3) marketing efforts of the firm. A special form of the Cobb–Douglas production function is used to design the three-dimensional framework. An empirical study is performed on number of consumer-durable sales data to validate and compare the proposed model. Various performance …", "num_citations": "21\n", "authors": ["472"]}
{"title": "Pathogenic involvement of Mallophaga\n", "abstract": " Abstract Very little attention has been paid towards the role of Mallophaga in reservoiring and transmitting infectious agents amongst their hosts. A survey of literature reveals that two haematophagous mallophagans infesting poultry birds can act as vectors of pathogens causing cholera, typhoid or even toxoplasmosis amongst their hosts. Their ability to reservoire Ornithosis bedsoniae and to transmit viruses of eastern equine encephalomyelitis has also been proved. Few other non haematophagous Mallophaga infesting swifts, dogs and swans are able to act as an intermediate host for filarial worms and one other infesting dogs is reported to act as vector of a cestode. On the other hand, some mallophagan species harbour rickettsia and bacteria and are reported to exhibit endosymbiosis or commensalism. Most of the species, noted for bacterial endosymbiosis are haematophagous. In the present article an attempt …", "num_citations": "21\n", "authors": ["472"]}
{"title": "Effect of NaF evaporation on morphological and structural properties of Cu2ZnSnSe4 (CZTSe) thin film deposited by sputtering from a single compound target\n", "abstract": " Cu2ZnSnSe4 (CZTSe) is a promising semiconducting material for photovoltaic applications. In the chalcogenide materials, addition of Na helps in grain growth and improves the electrical properties by passivating the surface as well as grain boundary defects. But, the effect is not well researched for kesterite materials. In this study, CZTSe thin films were deposited by sputtering an in-house made single compound target followed by annealing it in N2 atmosphere for very short duration. Use of compound target makes the process easier and simple. Compound target has been made by mixing the binary selenides and cold pressing it. Na-doping was carried out by evaporating NaF over film made by sputtering the compound target before annealing the film. X-ray diffraction, Raman spectroscopy, scanning electron microscopy, and energy dispersive spectroscopy have been used for characterizing the samples. It has …", "num_citations": "20\n", "authors": ["472"]}
{"title": "Release time problem with multiple constraints\n", "abstract": " Quality of software system generally depends on how much time testing takes and what testing methodologies are used. One attribute of quality is reliability which can be increased by removing more faults from the software and this can be done by spending more time on testing. However, spending more time on testing will increase cost of the software development process. On the other hand, if testing time is too short, testing cost of software may be reduced but it will increase the chance of getting unreliable software and customers may not take higher risk of buying unreliable software. Highly competitive market conditions have forced developers to offer highly reliable products to the users. Software warranty is one such indicator used by the users to judge its reliability with the perception that a longer warranty period indicates higher reliability. Software warranty is a tool which provides assurance about …", "num_citations": "20\n", "authors": ["472"]}
{"title": "A unified approach for successive release of a software under two types of imperfect debugging\n", "abstract": " The competitive essence of market and the rapid turnover in the technology is shrinking the life of software. A software with bounded functionality cannot survive the high tides of contention. This raise the need for multiple up gradations of the software and consequently the customary approach towards software development process as observed in practice by most of the software firms today is iterative in nature. They are putting in lots of efforts to mark their presence in the market through periodic functional enrichment. But, functional enhancement adds to the existing complexity of the software and at the same time higher prospects of error. On the grounds of increasing complexity and partial insight into the software, the testing team may not prove to be competent enough to perfectly fix the faults by removing or correcting them after failure is detected. Hence, a fault might go unperceived by surviving the selected test …", "num_citations": "20\n", "authors": ["472"]}
{"title": "Effect of herbicides and water submergence levels on control of weeds in transplanted rice1\n", "abstract": " Freemergence application of butachlor 5 G 1.5 kg/ha, oxadiazon 2 G 0.75 kg/ha and pendimethalin 3 G 1.5 kg/ha provided reasonable weed control resulting in higher grain yield of rice. The submergence level of 0–5 cm was sufficient to get the desired Effect of herbicides on weed control and on grain yield of rice.", "num_citations": "20\n", "authors": ["472"]}
{"title": "Comparative effects of chronic treatment with certain metals on cell division\n", "abstract": " Materials and methodsThe principal test systems used were: Album cepa and Rattus norvegicus, in vivo. Standard Allium test was performed using different concentrations (0.00001 to 0.5%) of aqueous solutions of 18 metallic salts from groups I to VIII, namely: Group I: Sodium selenite (a) molybdate (b) arsenate (c) rubidium chloride (d) copper sulphate (e)Group II: Magnesium sulphate (f) zinc chloride (g) strontium nitrate (h) cad mium chloride (i) mercuric chloride (j) Group III: Ceric sulphate (k) cerium nitrate (l) Group IV: Lead acetate (m) Group V: Vanadium pentoxide (n) Group VII: Magnesium sulphate (o) Group VIII: Cobalt chloride (p) cobalt sulphate (q) nickel sulphate (r) Roots of Allium cepa bulbs were immersed in solutions for diterent periods ranging from 2 to 24 hours. After each treatment, the bulbs were allowed to re cover in Knop's nutrient medium. At each interval for both direct and recovery experiments, the root tips were excised, fixed in acetic acid: ethyl alcohol (1: 3) and squashed following the usual 2% acetic-orcein: N HCl (9: 1) squash technique. The mitotic index and percentage of abnormalities induced were obtained from scan ning 2000 cells and compared with controls maintained in distilled water.", "num_citations": "20\n", "authors": ["472"]}
{"title": "A multi-attribute approach for release time and reliability trend analysis of a software\n", "abstract": " In a Software Development Life Cycle the testing phase is given a lot of importance. But testing cannot be done indefinitely due to many reasons ranging from marketing considerations to increase in cost. Hence it is pertinent to find the optimal release time during testing phase. Firms routinely face the challenging decision of when to stop testing and release the product in the market. It has been observed that the pace of introduction of new software is much higher in recent years in comparison to any time in the past. Thus to get the competitive edge it is critical to know about the optimal entry time. Too late an entry is likely to lead to significant loss of opportunity. On the other hand early introduction of a product might hinder its growth due to lack of receptiveness of users towards new technology. Many release time problems with optimization criteria like cost minimization, reliability maximization and budgetary …", "num_citations": "19\n", "authors": ["472"]}
{"title": "When to release and stop testing of a software\n", "abstract": " For several decades both practitioners as well as researchers have contributed immensely towards solving one of the prime concerns of software firms regarding how long to continue testing? Although, efficient testing ensures reliable software but costs a lot to developer in terms of higher testing and market opportunity cost. Hence it’s imperative to obtain optimal testing time of software. Product release marking the end to software testing has been the phenomenon commonly observed in both practice and theory but often leaves customer dissatisfied either in the form of delayed release (prolonged testing phase) or lower reliability (shortened testing phase). To address this issue, current practices in software industry involve a post release testing phase during which organization aims at treating remaining software faults and subsequently enhance product experience for customers. In this paper we present …", "num_citations": "18\n", "authors": ["472"]}
{"title": "A stochastic formulation of successive software releases with faults severity\n", "abstract": " Software companies are coming with multiple add-ons to survive in the pure competitive environment. Each succeeding up-gradation offers some performance enhancement and distinguishing itself from the past release. If the size of the software system is large, the number of faults detected during the testing phase becomes large, and the number of faults, which are removed through each debugging, becomes small compared to initial fault content at the beginning of the testing phase. In such a situation, we can model the software fault detection process as a stochastic process with continuous state space. In this paper, we propose a multi-release software reliability growth model based on Itô's type of differential equation. The model categorizes Faults in two categories: simple and hard with respect to time which they take for isolation and removal after their observation. The model developed is validated on real …", "num_citations": "18\n", "authors": ["472"]}
{"title": "A software up-gradation model with testing effort and two types of imperfect debugging\n", "abstract": " Recent advances in the software world have seen the rise of various Software Reliability Growth Models (SRGMs). These SRGMs take into account various factors and associate them to reliability to come out with a new approach. Some of them consider calendar time as the governing factor while others argued that effort based modeling is more towards reality. In the real industrial scenario, due to the ever growing demands of the customer and stiff contention in the market, developers generally prefer to release the software with multiple versions instead of rolling out all the functionalities at one go. Consequently the customary approach towards software development process as observed in practice is iterative in nature. Moreover, the debugging process is not a perfect event. It has bottlenecks owing to the increasing complexity of software due to up gradations which transcends the limited knowledge of testing …", "num_citations": "17\n", "authors": ["472"]}
{"title": "Plant growth regulators in vegetable production: An overview\n", "abstract": " Indian agriculture becomes more mechanized and science increases the possibilities for using inputs to enhance production and food safety, the role of plant growth regulators becomes more vital; plant growth regulators provide an immediate impact on crop improvement programmes and are less time consuming, applications of plant growth regulators must lead to quantifiable advantages for the user plant growth regulators must be specific in their action and toxicologically and environmentally safe. Plant growth regulators in vegetables provides professionals and researchers with the information needed to effectively tap these versatile resources to enhance vegetables production. Most of the physiological activates and growth in plants are regulated by action and interaction of some chemical substance in them is called hormones and by some naturally occurring inhibitors.", "num_citations": "17\n", "authors": ["472"]}
{"title": "Unified approach for modeling innovation adoption and optimal model selection for the diffusion process\n", "abstract": " Purpose                – Mathematical modeling of innovation diffusion is a constantly evolving field within marketing science. The diffusion process explains the dispersion of an innovation among potential buyers. Prior research on innovation diffusion has been based on modeling varied aspects of real life situations in marketing. One such aspect is studying the adoption process depending on the awareness and motivation level among the customers. Awareness is having knowledge of an innovation, whereas motivation is about the perception of an individual. In line with these aspects, the purpose of this paper is to propose a unified modeling framework for the adoption process based on the awareness and motivation about the product.                                        Design/methodology/approach                – When the market is well informed about the product, there are some people who are motivated and some, who …", "num_citations": "16\n", "authors": ["472"]}
{"title": "Green synthesis of wurtzite copper zinc tin sulfide nanocones for improved solar photovoltaic utilization\n", "abstract": " Cu2ZnSnS4 (CZTS) is considered to be one of the most promising light absorbing materials for low-cost and high-efficiency thin-film solar cells. It is composed of earth abundant, non-toxic elements. In the present study, wurtzite CZTS nanocone has been synthesized by a green chemistry route. The nanocones have been characterized for its optical, structural and microstructural properties using UV–Vis spectrophotometer, X-ray diffraction, Raman spectroscopy and high-resolution transmission electron microscopy. Optical absorption result shows a band gap of 1.42 eV. XRD and Raman results show wurtzite structure and TEM studies reveal the nanocone structure of the grown material. Growing vertically aligned nanocone structure having smaller diameter shall help in enhancing the light absorption in broader range which shall enhance the efficiency of solar cell. This study is a step in this direction.", "num_citations": "16\n", "authors": ["472"]}
{"title": "Software release time based on different multi-attribute utility functions\n", "abstract": " The decision to release a software product will become an even more complex and important decision. A decision has strategic value when it has the potential for large prospective financial losses to a software manufacturer or its customers or end-users. A software release decision is a tradeoff between early release to capture the benefits of an earlier market introduction and the deferral of product release to the reliability. If a software product is released too early, the software manufacturer incurs post-release costs of later fixing failures. If a software product is released too late, the additional development cost and the opportunity cost of missing a market window could be substantial. These two attribute reliability and cost need to be combined to determine the optimal release time of software. This paper proposes a new practical method for determining when to stop software testing considering reliability and cost as …", "num_citations": "16\n", "authors": ["472"]}
{"title": "Structural transitions and multiferrocity in Ba and Co substituted nanosized bismuth ferrite\n", "abstract": " To investigate the effect of Ba2+ and Co2+ substitution on the multiferroic properties of the BiFeO3 (BFO) ceramic, Bi1-xBaxFe1-yCoyO3 (x = 0,y = 0 and x = 0.2, y = 0,0.015,0.03,0.04,0.05) ceramics were prepared using sol-gel method. Multiferroic properties of BFO have been improved considerably on Ba2+ and Co2+ substitution at Bi and Fe site, respectively. Full pattern fitting of the XRD profile pattern confirmed the structural transition from rhombohedral to pseudo-cubic phase. The magnetisation in BFO rises appreciably and found to be 0.463 emu/g for Bi1-xBaxFe1-yCoyO3 (x = 0.2, y = 0.05) ceramic nanoparticles. The abrupt increase in magnetization for Bi0.8Ba0.2Fe0.95Co0.05O3 is due to anti-ferromagnetic orbital ordering among Fe/Co ions. The orbital ordering among the ions would change the low spin state of the Co2+ ions to high spin state and results in increased magnetization. Beside, the Co …", "num_citations": "15\n", "authors": ["472"]}
{"title": "Effect of sputter deposited Zn precursor film thickness and annealing time on the properties of Cu2ZnSnS4 thin films deposited by sequential reactive sputtering of metal targets\n", "abstract": " Cu2ZnSnS4 (CZTS) is made of earth abundant elements and also have suitable optical properties for solar cell applications. But, in phase diagram, CZTS exists in a narrow range of temperature and composition. Therefore, optimizing the elemental composition and annealing time is very important for obtaining phase pure CZTS. In this study, the effects of elemental composition and short annealing time on the structural and optical properties of reactively sputtered CZTS thin films are reported. Thin films were deposited by reactive sputtering of Cu: Sn (60:40 wt%), Sn and Zn targets sequentially in the presence of H2S at room temperature. Amount of Zn precursor was varied by changing the sputter time for Zn. The films were rapidly annealed in inert atmosphere for varying time. The band gap of sample changed with change in the composition as well as annealing time. Sample with higher Zn content showed better …", "num_citations": "15\n", "authors": ["472"]}
{"title": "Modeling successive software up-gradations with faults of different severity\n", "abstract": " The intense global competition in the dynamic environment has lead to up-gradations of software product in the market. The software developers are trying very hard to project themselves as organizations that provide better value to their customers. One major way to increase the market presence is by offering new functionalities in the software periodically. To get the competitive edge it is critical to know the appropriate release of the software. The timing decision depends on whether companies are able to remove all the types of the faults lying inside the software. To capture the effect of faults due to existing software and those left in the software (due to their nature) at various points in time, we develop an up-gradation multi release software reliability growth model. This model uniquely identifies the faults left in the software when it is in operational phase during the testing of the new code ie developed while adding new features to the existing software. We examine the case where there exists two types of faults in the software; simple and hard and during testing the simple faults are removed by exponential rate whereas hard faults are removed by logistic rate. Results are supplemented by a numerical example.", "num_citations": "15\n", "authors": ["472"]}
{"title": "Effect of time of transplanting and age of seedling on growth and yield of dwarf rice\n", "abstract": " A field experiment was conducted in the wet season of 1986 and 1987 at the farm of Haryana Agricultural University Rice Research Station, Kaul Highest grain yield was obtained when the transplanting of paddy was done on 15 June and a significant reduction in yield was recorded when the transplanting was delayed beyond 5 July.  Sixty days old seedlings gave higher yield than 30 and 45 days old seedlings.  Significant differences in varieties was noticed only during 1987.", "num_citations": "15\n", "authors": ["472"]}
{"title": "Multi-criteria intuitionistic fuzzy group decision analysis with TOPSIS method for selecting appropriate cloud solution to manage big data projects\n", "abstract": " Today technology that learns from data to forecast future behavior of individuals, organizations, government and country as a whole, is playing a crucial role in the advancement of human race. In fact, the strategic advantage most of the companies today strive for are use of new available technologies like cloud computing and big data. However, today’s dynamic business environment poses severe challenges in front of companies as to how to make use of the power of big data with the technical flexibility that cloud computing provides? Therefore, evaluating, ranking and selecting the most appropriate cloud solution to manage big data project is a complex concern which required multi criteria decision environment. In this paper we propose a hybrid TOPSIS method combined with intuitionistic fuzzy set to select appropriate cloud solution to manage big data projects in group decision making environment. In …", "num_citations": "14\n", "authors": ["472"]}
{"title": "Synthesis and characterization of petal type CZTS by stacked layer reactive sputtering\n", "abstract": " Here we present a method to grow the petal type structure of CZTS thin film on soda lime glass substrate using the stacked layer reactive sputtering and post-depostion annealing in N2 atmosphere. Optical bandgap of the petal type structure of CZTS was determined using UV–VIS spectroscopy and the value was 1.5 eV. In XRD analysis, (112) plane having highest intensity and other supporting planes with low intensity peaks corresponding to (200), (220) and (312) revealed the presence of CZTS phase. It was further confirmed by the Raman analysis, where the Raman peaks at 288 cm−1, 335 cm−1 and 353 cm−1 revealed the presence of CZTS phase. Petal type growth was observed in the scanning electron microscopy analysis. Elemental analysis was done by the EDAX. In EDAX analysis, It is observed that sample was Sn rich which may be responsible for petal type growth. Petal type growth of CZTS may be …", "num_citations": "14\n", "authors": ["472"]}
{"title": "Modeling adoption process based on awareness and motivation of consumers\n", "abstract": " The existing product development environment has been changing into new development paradigms at a tremendous rate. This requires firms to be more market driven and conscious for successfully bringing an innovation in the market. Innovation acts as a key carrier of success for any organization, when an innovation is accepted to its full extent and is used by the potential adopters, it is termed as successful innovation. An understanding of adoption process helps developers to promote their product more proficiently. The adoption process is a sequence of stages before a potential adopter goes for its purchase. Thus an innovation has to undergo different stages of adoption before it is finally adopted by the consumers; this differentiation forms the main aspect of the paper. Here we have considered adoption as a three stage process in which firstly people become aware of an innovation then, some are positively …", "num_citations": "14\n", "authors": ["472"]}
{"title": "Peripheral nerve complications in hemophilia.\n", "abstract": " AIM: Muscle bleed in hemophilics can result in compressive neuropathy and permanent disability if not treated properly in time. Twenty cases of peripheral nerve involvement in hemophilics are presented with an aim to highlight its features and the role of pulsed ultrasound in the management. METHODOLOGY: Between January, 1999 and 2000 June, 134 patients of bleeding disorders were examined. Twenty of them presented with features of nerve palsy. In addition to usual conservative treatment, pulse ultrasound electrotherapy of 10-15 sittings was used in all the cases. RESULTS: Femoral nerve was involved in majority (15), followed by sciatic (4) and peroneal nerve in one case. Femoral nerve involvement was associated with iliacus bleed in 13 patients and inguinal bleed in two cases. All the four cases of sciatic nerve palsy were associated with gluteal hematoma. Only case of peroneal nerve palsy was associated with hematoma at upper leg and calf. Twelve cases improved completely within six months whereas another four recovered around 10 months. Remaining four showed only partial recovery even when followed up to 12 months. CONCLUSIONS: Recognition of nerve complications in hemophilics is important to avoid long-term disability. Conservative therapy starting early was associated with favourable results. Pulsed ultrasound therapy at the site of haematoma helped in early regression of hematoma and neural recovery.", "num_citations": "14\n", "authors": ["472"]}
{"title": "Effect of Ba and Ho co-doping on crystal structure, phase transformation, magnetic properties and dielectric properties of BiFeO3\n", "abstract": " Multiferroics having composition Bi0.80-xBa0.20HoxFeO3 (BBFO, BBHFO5, BBHFO10, BBHFO15 and BBHFO20 for x = 0.0, 0.05, 0.10, 0.15 and 0.20 respectively) were synthesized by method of solid state reaction. The crystal structure has been studied using X-ray diffraction technique. The X-ray patterns show enormous transform in crystal structure at concentration x = 0.20. The Rietveld refinement of XRD patterns indicates that at concentration x = 0.0 sample have rhombohedral structure with R3c space group while for the concentration x = 0.05, 0.10, 0.15 and 0.20, the mixed phase including rhombohedral R3c and triclinic P1 space groups were obtained with best fitting. This phase transformation in crystal structure is observed due to mismatching of ionic radii of doped ions and parent ions. Magnetic properties of all samples were carried out by using vibrating sample magnetometry. M-H hysteresis …", "num_citations": "13\n", "authors": ["472"]}
{"title": "Unified framework for developing two dimensional software reliability growth models with change point\n", "abstract": " In order to assure software quality and assess software reliability, many software reliability growth models (SRGMs) have been proposed. In One-Dimension Software Reliability Growth Models researcher used one factor such as Testing-Time, Testing-Effort or Coverage, etc for designing the model but in Two-Dimensional software reliability growth model, process depends on two-types of reliability growth factors like: Testing-time and Testing-effort or Testing-time and Testing-Coverage or any combination between factors. Alsozin more realistic situations, the failure distribution can be affected by many factors, such as the running environment, testing strategy and resource allocation. Once these factors are changed during testing phase, it could result in failure intensity function that increases or decreases non-monotonically and the time point corresponding to abrupt fluctuations is called change point. In this paper …", "num_citations": "13\n", "authors": ["472"]}
{"title": "Quality of Indian mustard (Brassica juncea L.) as affected by nitrogen and sulphur fertilizers in a nutrient deficient soil\n", "abstract": " A field experiment was conducted during winter season of 2002–03 and 2003–04 at Student Instructional Farm of C S Azad University of Agriculture and Technology, Kanpur with Indian mustard [Brassica juncea (L.) Czern. & Cosson] to study the effect of different levels of nitrogen and sulphur on yield, nutrient uptake and seed quality. Application of 90 kg N and 30 kg S/ha significantly increased the seed, oil and protein yields, and protein content of seed. The uptake of both N and S by seeds increased with increasing levels of each nutrient. Higher doses of N decreased the oil percentage in seed whereas sulphur up to 40 kg/ha significantly increased it.", "num_citations": "13\n", "authors": ["472"]}
{"title": "Haematophagous nature of Trinoton querquedulae (Phthiraptera: Amblycera)\n", "abstract": " Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS", "num_citations": "13\n", "authors": ["472"]}
{"title": "Investigation of crystal structure, dielectric and magnetic properties in La and Nd co-doped BiFeO3 multiferroics\n", "abstract": " For the investigation of the crystal structure, dielectric properties and magnetic properties of La and Nd co-doped BiFeO3 multiferroics; Bi0.8La0.2−xNdxFeO3 (x=0.075, 0.1, 0.125) samples were prepared through solid state reaction method. Rietveld refinement of the obtained XRD patterns shows that there is change in crystal structure in these samples. At higher concentration of La (at x=0.075), the crystal structure was found to have mixed symmetry with rhombohedral and triclinic phases, while with equal concentration of both the dopants (at x=0.1), the structure changes to mixed symmetry having rhombohedral and orthorhombic phases. At higher concentration of Nd (at x=0.125), again mixed symmetry was established having both phases of the previous composition but approximately in reverse fraction. In dielectric analysis, x=0.1 sample showed the highest values of dielectric constant (ε′) and dielectric loss …", "num_citations": "12\n", "authors": ["472"]}
{"title": "Analysis of supplier related issues in supply chain practices\n", "abstract": " Supply chain management (SCM) is regarded as a means to maximise the overall value generated. SCM includes all functions involved in receiving and filling a customer request by forging close relationships with customers and suppliers. Strong relationships and mutual trust between buyer and suppliers are essential for the successful implementation of SCM. This paper is based on the data collected from a survey of 66 Indian textile-related organisations carried out to ascertain issues related to supplier selection and evaluation. The findings indicate that the main criteria for supplier selection in Indian textile organisations are service provided, quality and on-time delivery of material. Effect of supplier selection on performance of organisation and factors influencing development of trust between buyer and suppliers are also discussed.", "num_citations": "12\n", "authors": ["472"]}
{"title": "Modeling innovation adoption incorporating time lag between awareness and adoption process\n", "abstract": " Demand forecasting is an arduous task in today’s competitive world. The changing environment of market structure demands firms to be more cognizant about the customers’ stipulation before the successful introduction of an innovation into the market. Only after being satisfied by the characteristics of the innovation, the potential adopters get positively motivated to buy the product. There is a finite time lag in the adoption process; from the moment potential buyers get information about the innovation and the time they make the actual purchase. Using this fundamental of time lag we have proposed a framework of innovation diffusion where the final purchase is happening in number of stages. Distributed time lag approach methodology has been utilized to capture the time delay between customer’s motivation and its final adoption. In this approach, the contributions of time delay are ascertained as a weighted …", "num_citations": "11\n", "authors": ["472"]}
{"title": "Diffusion modeling based on customer's review and product satisfaction\n", "abstract": " The purpose of this paper is to determine the internal/external factors that lead to fluctuation in marketplace. Before introducing new products in the market, organization needs proper understanding of the market which can be realized through sound mathematical modeling and scientific decision making tools. The objective is as follows: market size is determined by the number of customers a product is flanked by; therefore, it becomes critical to understand satisfaction of demanders as one of the metric for measuring performance of the product. In this paper, the authors have discussed how the adoption takes place in accordance with the market fluctuation. For this purpose, they have developed four different methodical frameworks to help the management to estimate sales due to varying behaviour of market (as per reviews about the product). Analysis and validation has been done on two different real life datasets …", "num_citations": "11\n", "authors": ["472"]}
{"title": "Fault severity based multi up-gradation modeling considering testing and operational profile\n", "abstract": " Fault Severity based Multi Up-gradation Modeling considering Testing and Operational Profile - NASA/ADS Now on home page ads icon ads Enable full ADS view NASA/ADS Fault Severity based Multi Up-gradation Modeling considering Testing and Operational Profile Anand, Adarsh ; Singh, Ompal ; Das, Subhrata Abstract Publication: International Journal of Computer Applications Pub Date: August 2015 DOI: 10.5120/ijca2015905441 Bibcode: 2015IJCA..124d...9A full text sources Publisher | © The SAO/NASA Astrophysics Data System adshelp[at]cfa.harvard.edu The ADS is operated by the Smithsonian Astrophysical Observatory under NASA Cooperative Agreement NNX16AC86A NASA logo Smithsonian logo Resources About ADS ADS Help What's New Careers@ADS Social @adsabs ADS Blog Project Switch to full ADS Is ADS down? (or is it just me...) Smithsonian Institution Smithsonian Privacy Notice of …", "num_citations": "11\n", "authors": ["472"]}
{"title": "Fault severity based multi-release SRGM with testing resources\n", "abstract": " In today’s environment of global competition where each company is trying to prove itself better than its competitors the software developers have to come up with multiple releases in order to survive in the market. Each release offers some innovative performance enhancement or some new functionality that distinguishing itself from the past release. But enhancing the product and upcoming with successive releases puts a constant pressure on even the best organized engineering organizations. The reason being, up-grading a software application is a complex process. Upgrading a software introduces the risk that the new release will contain a bug, causing the program to fail. Therefore, to capture the effect of faults generated in the software with multiple releases, we have developed a multi release software reliability model in this paper. The model uniquely takes into account the faults of the current …", "num_citations": "11\n", "authors": ["472"]}
{"title": "Modelling successive generations for products-in-use and number of products sold in the market\n", "abstract": " As most of the high-technology companies are trying to be more demand driven, technological innovation and diffusion have become important force in today's market. High technology product comes in generations where a new generation offers a significant improvement in performance or benefits over the preceding generation. These successive generations under the same product category often compete in the market. The purpose of this paper is to propose a modelling framework that describes how a fraction of potential purchasers of earlier generation shift to the latest one via; substitution and switching. The proposition explains how actual the number of users is always lesser than the number of customers who buy a particular generation. The study proves that there is a relationship between the proposed model and Norton-Bass model and asserts that Norton-Bass model is a model to explain products-in-use …", "num_citations": "11\n", "authors": ["472"]}
{"title": "Optimal introduction timing policy for a successive generational product\n", "abstract": " Globalized economy has led firms to introduce new innovations in the market quite frequently. Optimal Introduction time is an important strategic decision for firms because an early introduction may not take off as customers; channel members and other required partners might not be receptive enough, on the other hand too late an entry results in loss of opportunity for the firm. The decision is even more critical when introducing successive generations over time. In this study, the authors have developed an analytical approach to help decide the optimal introduction time for successive generational product. The timing decision depends on whether firms push the product to market before competitors or invest more time in process & product design and improvement. The authors have examined the case where a firm introduces successive generations of a durable product for which demand is characterized by an …", "num_citations": "11\n", "authors": ["472"]}
{"title": "A decision support system for supplier selection for Indian textile industry using analytic hierarchy process based on fuzzy simulation\n", "abstract": " Supplier selection is arguably one of the most critical functions for the success of an organisation in today’s competitive scenario. Both qualitative and quantitative factors are considered and a trade off is made between tangible and intangible factors while selecting a supplier. This selection is one of the decisions which determine the long-term viability of the organisation. Literature reveals that many methods have been used to objectively evaluate suppliers including analytic hierarchy process (AHP). Considering drawback of AHP that it handles crisp values only, use of AHP based on fuzzy simulation (FSAHP) has been proposed in this paper. The weights of criteria and sub-criteria of alternatives have been represented by fuzzy linguistic variables and fuzzy simulation has been used to estimate the expected value of fuzzy weights of different alternatives for the decision analysis of three suppliers for a textile-based …", "num_citations": "11\n", "authors": ["472"]}
{"title": "Supply chain design in the electronics industry incorporating JIT purchasing\n", "abstract": " The overriding objective of the present work is to design and analyse the supply chain of a section of an existing electronics industry which is involved in the manufacturing of instruments to be used in communication and is presently unable to compete in the open market. The suppliers, manufacturers, distributors and customers have been integrated with each other using Just-in-Time (JIT) purchasing. The models have been developed both at the strategic, as well as operational, levels for minimising the cost. The operational level models have been integrated with the strategic level model to achieve overall optimisation, instead of individual echelon optimisation. Keeping in view the large number of variables, constraints and related industrial data, the model has been solved using 'Industrial LINGO 8.0' software. The model solution gives the optimum values of the various cost components and per product cost for …", "num_citations": "11\n", "authors": ["472"]}
{"title": "Effect of substrate on the structural and electrical properties of Mo thin films\n", "abstract": " With the advancement of technology, the demand for energy is increasing tremendously which is creating a pressure on non-renewable sources of energy. Scientists are working since a long time to search for some renewable resources which can replace these conventional sources. As we know, solar energy is the ultimate source of energy; so converting this solar energy into usable form of energy which can be stored for later use is the best alternative. Solar cells are the devices which convert light energy into electrical energy and hence are the best replacement for conventional sources to solve the upcoming energy crisis. Among all the present technologies CZTS and CIGS based thin film solar cells are the most researched [1-5]. The highest reported efficiency of CZTSSe based solar cell is 12.6%[6] and for CIGS is 21.7%[7]. The theoretical conversion efficiency of single junction solar cell is nearly 32%[8]. Besides CIGS, CZTS and its selenide compounds are more popular as an absorber layer for thin film solar cell application [9-11].To ensure high efficiency of a CIGS/CZTS based solar cell device, an ideal ohmic back contact is needed for the enhanced transport of majority charge carriers and low recombination for minority charge carriers [12]. According to researchers, molybdenum has been found to be the most suitable material for back contact among all other materials; like, W, Ta, Cr, V, Nb or Ti due to its inertness, high melting point, high thermal stability, high conductivity and mechanical hardness [13-15]. Thus, Mo has the capability to be used as a surface electron collector layer because of its high electronic conducting capabilities …", "num_citations": "10\n", "authors": ["472"]}
{"title": "Application of multi attribute utility theory in multiple releases of software\n", "abstract": " One of the important applications of software reliability models is the determination of software release time. Most of the existing studies on this topic use models based on non homogeneous Poisson process with a bounded mean value function. Multi up gradation based software reliability growth model is developed for successive release modelling and analysis. Based on this model, maximum fault removal for upgraded software and optimal release time of upgraded software are investigated as well. This paper proposes a new practical method for determining when to stop software testing considering failure intensity and cost as two factors simultaneously. This issue has been widely known as the optimal release problem of software product. The proposed new decision model based on multi-attribute utility analysis is tested on the real world data sets. In addition, the proposed decision model can help …", "num_citations": "10\n", "authors": ["472"]}
{"title": "Influence of patching on optimal planning for software release and testing time\n", "abstract": " Software reliability determination has always been a difficult task. In today’s competitive environment firms not only have to keep a check on reliability but on optimal scheduling of the software is a mandate for the success of any software product. In order to excel in the market, firms have to constantly update themselves and so have to come up with patching. The concept of patching helps the firms to look after any ambiguity (if present) and take the functional issues of the software. Keeping this frame of consistent processing in mind, we have proposed an optimal scheduling policy where the release time and testing stop time are the key variables. Further, we discuss the advantage of providing patching and its cost effectiveness. The model has been validated on real life data set and results clearly show a remarkable benefit over the case when release is planned without patching.", "num_citations": "10\n", "authors": ["472"]}
{"title": "Bi-criterion release time problem for a discrete SRGM under fuzzy environment\n", "abstract": " Software Release Time Problems is a well known domain in the field of Software Optimisation. To determine when to stop testing and release software becomes one of the important decision for management. In real life the developers can only make ambiguous estimates on the available resources and their aspirations bringing uncertainty (fuzziness) in the problem formulation. In this paper, we have formulated a fuzzy bi-criterion release time problem optimising the two conflicting cost minimisation and reliability maximisation objectives under budgetary constraint. Fuzzy optimisation technique is discussed to solve such problem with numerical illustration.", "num_citations": "10\n", "authors": ["472"]}
{"title": "Genetic variability, genotypic and phenotypic correlation in germplasm of opium poppy (Papaver somniferum L.).\n", "abstract": " Genetic variability and phenotypic and genotypic correlations were carried out in 35 genotypes genotypes Subject Category: Miscellaneous", "num_citations": "10\n", "authors": ["472"]}
{"title": "Understanding multi-stage diffusion process in presence of attrition of potential market and related pricing policy\n", "abstract": " In this paper, a mathematical model using a three-stage structure is developed to describe the diffusion process of high-technology products. This article investigates the significance of the informed and disinterested potential adopters on the growth pattern of innovation. The suitability of the proposed methodology for real-life scenarios is validated by fitting the model to the actual sales and price data sets from the electronics and semiconductor industries. The present study also incorporates the influence of dynamic price on the decision of the adoption of new products. An optimization problem is also formulated as an optimal control problem with the objective of profit maximization to determine the optimal price of the new technology.", "num_citations": "9\n", "authors": ["472"]}
{"title": "Optimal price and warranty length for profit determination: an evaluation based on preventive maintenance\n", "abstract": " Warranty is a two-sided coin: on one hand, it results in additional cost to the producer, and on the other hand, it acts as a protectional tool for buyers. To deal with this additional cost (cost of repairing faulty items), preventive maintenance during the warranty period often plays a helping hand to the manufacturer. The role of preventive maintenance is therefore important, as it slows down the rate of system degradation. In view of this, the current study presents an analytical approach to determine the optimal profit for the firm, where sales price and warranty length act as key decision variables under the impact of preventive maintenance provided by the firm. The two-dimensional innovation diffusion model has been utilized to estimate the sales, and Weibull distribution has been used to represent the lifetime distribution of the product. To validate the accuracy of the proposed framework, numerical illustration has …", "num_citations": "9\n", "authors": ["472"]}
{"title": "Modeling critical success factors for adoption of big data analytics project: an ISM-MICMAC based analysis\n", "abstract": " Global buzzword “Big Data Analytics” has observed overwhelming response in the last five years. It is still an emerging area in the field of analytics as advocated through our research. The presence of several analytics tools in the market, selecting and implementing an appropriate big data system is a multifaceted undertaking requiring substantial resources. Researchers & practitioners have investigated some key factors affecting the adoption of big data analytics projects in the past however there is a limited authoritative set of factors whose interaction has been identified. In this paper, we advance the state-of-the-art of the research in this area by a two stage qualitative approach. Firstly, Critical Success Factors (CSFs) are identified through a survey of literature and ranked using a Likert Scale by respondents who practice big data analytics. The respondents were carefully selected based on their experience in …", "num_citations": "9\n", "authors": ["472"]}
{"title": "Analysis of distribution system of supply chain and relationships between manufacturer and customers for Indian textile industry\n", "abstract": " Supply chain management (SCM) is regarded as a means to maximise the overall value generated. The importance of SCM in Indian textile industry has increased when more and more companies have realised the possibilities of gaining additional value for their customers with the implementation of supply chain concepts. Distribution system is one of the main parts of supply chain. This paper is based on the data collected from a survey of 66 Indian textile-related organisations carried out to ascertain issues related to distribution system of supply chain and customers. Issues related to capability of SCM in reading and responding real customer demand, ability of organisations to respond quickly to volatile market, advantages that can be achieved by quick response to customers' demands and management of relations with the customers have been discussed. The findings indicate that the organisations consider …", "num_citations": "9\n", "authors": ["472"]}
{"title": "Integrated supply chain: a survey of Indian textile organisations\n", "abstract": " Supply chain integration is considered one of the major factors in improving performance. While each manufacturer must customise its supply chain to fit its particular circumstances, several core supply chain concepts must be embraced throughout the organisation. This paper is based on the data collected from a survey of 66 Indian textile-related organisations, carried out to ascertain issues related to integrated supply chain management. Issues related to objectives of integrated supply chain, importance of integrated supply chain, useful index for performance measurement of integrated supply chain and factors helpful in supply chain integration have been discussed.The findings indicate that theorganisations consider lowering the production cost as the most crucial objective as well as a factor for performance measurement in integrated supply chain design.It has further been found that customer satisfaction is …", "num_citations": "9\n", "authors": ["472"]}
{"title": "Trichoderma spp. Growth as influenced by Temperatures\n", "abstract": " The temperature effect on spore germination, germ tube growth, and mycelial growth, competitive saprophytic ability on volatile and non volatile metabolites. Most Trichoderma species are mesophylic and can not protect germinating seeds for soil borne diseases. The optimum temperature for growth differs among Trichoderma species. Hence, this study was undertaken.The growth response of various Trichoderma spp. was studied at 15, 20, 25, 30, 35 and 40 C. Mycelial discs (5 mm) from the periphery of three days old growing colony were used as the inoculum on 9 cm Petri plates, incubated in the dark at above mentioned temperature. The radial growth of the colony was recorded daily, as the average of the colony dia. measured perpendicular to each other, minus the dia. of the inoculum disk.", "num_citations": "9\n", "authors": ["472"]}
{"title": "Irrigation requirement in gram (Cicer arietinum)+ Indian mustard (Brassica juncea) intercropping system\n", "abstract": " A Held experiment was conducted during 2000-2002 at the Indian Agricultural Research Institute, New Delhi, to find out the optimum irrigation schedule for gram (Cicer arietinum L.)+ Indian mustard [Brassica juncea (L.) Czernj. & Cosson] intercropping system. Irrigation at 0.2 irrigation water: cumulative pan evaporation (IW: CPE) ratio in sole gram and 0.4 IW: CPE ratio in Indian mustard was optimum for seed yield. Irrigation in gram at 0.4 IW: CPE ratio caused 31.6% reduction in seed yield compared with 0.2 IW: CPB ratio. The yield ofgram+ Indian mustard in intercropping systems was dependent on row proportions of component crops. Gram-equivalent yield (GEY) was the highest in sole Indian mustard (3.04 tonnes/ha) and with irrigation at 0.2 IW: CPE ratio (2.42 tonnes/ha). At closer row proportions (2: 1 and 3: 1) of gram and Indian mustard intercropping system, irrigation at 0.4 IW: CPE ratio recorded higher gram-equivalent yield (2.88, 2.744 tonnes/ha), while at wider row proportions (4: 1 and 6: 1) irrigation at 0.2 IW: CPE ratio gave higher gram-equivalent yield (2.41 and 2.33 tonnes/ha). The water-use efficiency (kg/ha-mm) was the highest in sole Indian mustard (12.66) and unirrigated crops (11.7).", "num_citations": "9\n", "authors": ["472"]}
{"title": "Allocation of promotional resource for a new product in a segmented market\n", "abstract": " Promotional effort is an important component of marketing mix that determines the success of a product in the market. The market of a product can be segmented with respect to geographical location, tastes, culture, age, sex, disposable income of the consumers and other factors. Effectiveness of promotional campaigns in different market segments varies and is determined by the adoption process. Hence distribution of limited promotional resources in these segments is of immense interest. This article formulates a mathematical programming problem, which optimally allocates limited promotional resources among segments to maximize the total sales and to achieve minimum sales level in each segment. The solution procedure for such class of problems has been discussed. The innovation diffusion model with promotional efforts has been used to depict the sales growth in each segment. Results are illustrated with a numerical example.", "num_citations": "9\n", "authors": ["472"]}
{"title": "Clinical evaluation of nirgundi taila in the management of sandhivata\n", "abstract": " Osteo-arthritis is a commonest among various articular disorders. It is chronic affection of synovial joints and is related to ageing process of tissues. It is not a single disease. Rather it is the end result of a variety of patterns of joint failure. To a greater or lesser extent it always characterized by both degeneration of articular cartilage and simultaneously proliferation of new bone, cartilage and connective tissue.Osteo–arthritis is classified as primary if the aetiology is unknown and secondary when degenerative joint changes occur in response to a recognizable local or systemic factor. In Ayurveda the disease entity Sandhivata has been described in reference to the description of various pathological conditions caused by vata under vatavyadi.", "num_citations": "9\n", "authors": ["472"]}
{"title": "Kushtha (skin disorders) in vedic and other religious literatures--A review\n", "abstract": " In view of the description of Medical citations; Vedic literature, Buddhist literature, Jain literature, Mahabharat, Ramayan etc. have also got significant importance. Like other diseases, the description regarding Kushtha (different skin disorders) is also available in all these treatises. These are akin to the description available in Ayurveda. From the above, it is apparent that description of different diseases mentioned in Ayurveda are also available in religious literatures.", "num_citations": "9\n", "authors": ["472"]}
{"title": "RESPONSE OF MULTICUT FODDER SORGHUM (SORGHUM-BICOLOR) CULTIVARS TO NITROGEN AND CUTTING MANAGEMENT\n", "abstract": " A field experiment was conducted during the rainy (kharif) seasons of 1984 and 1985 to study the effect of different levels of N and cutting management on growth and yield of multicut cultivars of fodder sorghum [Sorghum bicolor (L.) Moench]. Green-forage, dry-matter, crude protein and digestible dry-matter yields increased significantly with the increase in N levels up to 120 kg N/ha. Cultivar 'SSG 988' produced significantly higher green forage, dry matter, crude protein and digestible dry matter than the other 2 cultivars. Cutting at 40-day interval produced significantly higher green fodder, dry matter, crude protein, and digestible dry matter over 30-day interval.", "num_citations": "9\n", "authors": ["472"]}
{"title": "Relative efficiency of different herbicides in transplanted rice\n", "abstract": " Relative Efficiency of different Herbicides in Transplanted Rice A field experiment was conducted during kharif 1980 at the Crop Page 1 www.IndianJournals.com Members Copy, Not for Commercial Sale Downloaded From IP - 66.249.79.221 on dated 26-Jan-2021 Indian J. Weed Sci. 1985 Vol. 17 (1): 47-49 Relative Efficiency of different Herbicides in Transplanted Rice A field experiment was conducted during kharif 1980 at the Crop Research Centre of GB Pant University of Agriculture and Technology, Pantnagar, Nainital to study the relative efficiency of different herbicides in controlling weeds in transplanted rice. The experiment consisted of 16 treatments replicated four times in randomized block design. The plot size was 5 m X 3 m. The rice variety 'Jaya' was transplanted on 13th July, 1980 and harvested on 27th October, 1980. The major weed species infesting the experimental field were Echinochloa colonum , …", "num_citations": "9\n", "authors": ["472"]}
{"title": "Modeling two-dimensional technology diffusion process under dynamic adoption rate\n", "abstract": " PurposeThis paper aims to develop a parsimonious and innovative model that captures the dynamics of new product diffusion in the recent high-technology markets and thus assist both academicians and practitioners who are eager to understand the diffusion phenomena. Accordingly, this study develops a novel diffusion model to forecast the demand by centering on the dynamic state of the product’s adoption rate. The proposed study also integrates the consumer’s psychological point of view on price change and goodwill of the innovation in the diffusion process.Design/methodology/approachIn this study, a two-dimensional distribution function has been derived using Cobb–Douglas’s production function to combine the effect of price change and continuation time (goodwill) of the technology in the market. Focused on the realistic scenario of sales growth, the model also assimilates the time-to-time variation in …", "num_citations": "8\n", "authors": ["472"]}
{"title": "Modeling technological substitution by incorporating dynamic adoption rate\n", "abstract": " Modeling diffusion dynamics of multi-generation innovation requires a critical examination of external factors that may affect its diffusion process. It has been observed that due to companies continuously varying marketing strategies, the adoption rate of an innovation alters with time. However, there are other factors such as the launch of a new competitive product or improved product generation, which may affect the growth of an innovation. The time-instance at which these changes are observed is called change-point. Motivated by this phenomenon, the present research identifies the launch of a new generation as a change-point where adoption function of the previous generation experiences a structural change. The objective of the current research is to improve the forecasting accuracy of a diffusion model for technological innovations by integrating essential factors that affect the diffusion process. From the …", "num_citations": "8\n", "authors": ["472"]}
{"title": "A multi release cost model in distributed environment\n", "abstract": " Software industry has reached far beyond since its origin. Technical advancements are taking place at a speed faster than ever. This has further enhanced the pressure on software developers. They are trying hard to keep a pace with these rapid developments by coming out with strategies to increase the pace of their work without significantly affecting the software quality and reliability. One such strategy is distributed development of software in which the software is composed of two different types of components viz. newly developed and re-used component. Software developed in Distributed Development Environment (DDE) is characterized by enhanced availability and reliability. At the same time, the ever growing contention in the market and increasing needs of customers obligate the developers to come out with enhanced functionalities in the software from time to time leading to multiple releases of a software …", "num_citations": "8\n", "authors": ["472"]}
{"title": "Modeling software failures and reliability growth based on pre & post release testing\n", "abstract": " During testing process of any SDLC, efforts are made to successfully find out flaws and make the system bug free, but at times while removing the existing limitations some new bugs might embed into the software system. In order to have a competitive advantage, a firm has to quickly come up with its offering despite the presence of some issues in the software. Therefore, it cannot be assured that the software has been completely made fault free at the time of its release. Of late the concept of patching has started to receive adequate attention and has served the firms as a helping hand to deal with these issues (leftover faults). Software developers are making use of this element as a tool for successful survival in market and as such continue the testing process; post release of their product. However, while providing a patch service, it may happen that while fixing the original problem at hand, some other flaws might …", "num_citations": "8\n", "authors": ["472"]}
{"title": "Multi up-gradation software reliability growth model with learning effect and severity of faults using SDE\n", "abstract": " In recent years, the dependence on a computer system has become large in our social life. Therefore, it becomes more important for software developers to produce highly reliable software systems. Due to timely demand and competitive nature of the market of software product, firms are frequently launching their upgraded versions of the base software. Many software reliability growth model have been developed by software developers and managers in tracking and measuring the growth of reliability. As the size of software system is large and the number of faults detected during the testing phase becomes large, so the change of the number of faults that are detected and removed through each debugging becomes sufficiently small compared with the initial fault content at the beginning of the testing phase. In such a situation, we can model the software fault detection process as a stochastic process with …", "num_citations": "8\n", "authors": ["472"]}
{"title": "One step deposition of Cu2ZnSnSe4 thin films using a ceramic quaternary target\n", "abstract": " In order to avoid surface roughness created during post-selenization and minimize the steps involved in CZTSe deposition; a single-step low temperature sputter deposition process is developed. CZTSe thin films were deposited by sputtering the ceramic quaternary target (having extra selenium) using RF magnetron sputtering at substrate temperatures ranging from RT to 550 °C. The properties of CZTSe thin film were investigated using X-ray diffraction, Raman spectroscopy, SEM, HRTEM and UV-Vis spectroscopy. The film deposited at RT was almost amorphous and the crystallinity improved with increase in the substrate temperature. CZTSe films composed of densely packed CZTSe grains were obtained at substrate temperature higher than 400 °C. The band gap values for the films were nearly 1.0 eV.", "num_citations": "8\n", "authors": ["472"]}
{"title": "A novel acylated flavonoidic glycoside from the wood of cultivated Acacia nilotica (L.) Willd. ex. Delile.\n", "abstract": " Acacia is a fast-growing plant that has high potential in commercial plantations in tropical areas. It is already being grown as a plantation crop for building and industrial raw materials, as well as for reforestation of difficult sites. Extensive cultivation of this promising tree would enrich the natural resources besides being useful for industrial raw material, waste land management, and afforestation. In addition, Acacia exhibits extensive medicinal values. In view of the medicinal importance of Acacia nilotica and the therapeutic utility of flavonoids, an attempt has been made to isolate novel flavonoids from the wood of cultivated A. nilotica. The extraction of crude ethanol extract from the A. nilotica wood was followed by fractionation with chloroform, ethyl acetate, and methanol in increasing order of polarity of the solvent. The mixed ethyl acetate and methanol extract afforded three pure compounds through column chromtomatography and fractional crystallization. Among the isolated phenolic compounds, a new acylated flavonoidic glycoside, tricin-4′-O-β-(6′′-hydroxycinnamic)-glucoside (1) was isolated from the wood of A. nilotica together with two known compounds, gallic acid and apigenin. Their structures were established by chemical evidence, spectroscopic techniques (FT-IR, 1H-NMR, 13C-NMR, HSQC, HMBC, and ESI-MS), and by comparison with already existing spectroscopic data. The yield of novel tricin glucoside showed that it make up to 0.0786% of mixed ethyl acetate and acetone extract.", "num_citations": "8\n", "authors": ["472"]}
{"title": "Neem (Azadirachta indica) in Context of Intellectual Property Rights (IPR)\n", "abstract": " The neem tree (Azadirachta indica) originates from the Indian sub-continent and now grows in the dry regions of more than 50 tropical countries around the world. Generally, its properties are used to cure common colds and flu. The oil extracted from its seeds can be used to cure various diseases. Mixed in soap, it offers cheap and easy relief from malaria, skin diseases and even meningitis. It is mentioned in Indian texts written over 2000 years ago and has been used for centuries by local communities in agriculture as an insect and pest repellent, in human and veterinary medicine, toiletries and cosmetics. It is also venerated in the culture, religions and literature of the region.Even though first report on pesticide property of neem was reported in India in 1928, only after 30 years later systematic research work on neem was initiated. The past five decades witnessed intensive investigation and upward trend to scientific interest on neem and its diverse properties, resulting in large number of research publications, books and conferences at national and international levels. It led to isolation and identification of more than 140 compounds, from various parts of the plant [1-5]. It showed anti-inflammatory [6], anti-ulcer [7-10], antimalerial [11, 12], antifungal [13-17], antibacterial [18], antiviral [19-23], antioxidant, antimutagenic and anticarcinogenic activity [24-26]. It also exhibited impeccable insecticidal property which found its applications in pesticide [27]. Neem extracts can be used against over 250 pests including whiteflies, aphids, mealybugs, mites, and termites. It is also effective against fungal diseases such as rusts and powdery mildew that attack the …", "num_citations": "8\n", "authors": ["472"]}
{"title": "Effect of cycocel and ethrel on growth and yield of ginger\n", "abstract": " Experiments on growth and yield of Rio-de-Janeiro cultivar of ginger were conducted during 1981 and 1982 at Govt. Valley Fruit Research Station, Jeolikote, Nainital with treatments of cycoce)(250, 500, 100 and 2000 ppm) and Ethrel (50, 100, 200 and 400 ppm.) and simple water spray taken as control. Plant hight was reduced by both the chemicals as compared to control. Reduction in plant height was maximum in 2000 ppm of cycocel. Number of leaves per plant was significantly affected by 200 ppm ethrel. All the treatments were found effective on tiller production. Significant increase in length and width of rhizome, number of rhizome bits and yield of fresh rhizome as observed with 200 ppin Ethrel.", "num_citations": "8\n", "authors": ["472"]}
{"title": "Silver (Ag) incorporated Cu2ZnSnS4 thin film for improved optical and morphological properties\n", "abstract": " Replacing copper (Cu) with silver (Ag) which is always in monovalent state can improve the stability and quality of Cu2ZnSnS4 (CZTS). In this work, few copper (Cu) atoms have been substituted by Ag into the crystal lattice of CZTS by Ag deposition using DC (direct current) magnetron sputtering before stacked layer reactively sputtered individual Sn-Cu-Zn targets at room temperature and post annealed at 550 °C for 5 min only. Substitution of Cu with Ag reduces antisite defects, secondary phases and also improves the optical absorbance and grain size of the (Ag,Cu)2ZnSnS4 (ACZTS) thin film. Rice-like structured ACZTS film showed optical absorption coefficient one order of magnitude higher than CZTS thin film. The band gap was slightly smaller 1.4 eV for ACZTS as compared to 1.5 eV for CZTS film. To the best of our acquaintance, this is the first study on synthesis of rice-like structured ACZTS film and …", "num_citations": "7\n", "authors": ["472"]}
{"title": "Modeling multi-generation innovation adoption based on conjoint effect of awareness process\n", "abstract": " The prior models in the field of multi-generation diffusion modeling basically concentrated on employing effects of substitution and switching behavior. But little or no importance has been given to the manner in which information about the product is diffused in the marketplace for eventual determination of intergenerational sales. Sales generally happen when users are informed about the characteristic features of the product. Thus, the effect of information flow on adoption of the product is important for evaluating eventual sales. With the aim of inculcating awareness and adoption process as two different factors impacting the overall sales; in this paper we have developed a systematic approach to model the sales for intergenerational diffusion process. The results are verified on sales data from Semiconductor Industry DRAM shipments.", "num_citations": "7\n", "authors": ["472"]}
{"title": "Multi-stage diffusion dynamics based on optimal control theory\n", "abstract": " In this relentlessly innovative market, product diffusion has a pre-eminent importance for any firm. The comprehend study of the adoption process assists the manufacturer to facilitate the growth of their product. It is observed that the adoption of the product goes through multiple stages before the actual adoption occurs. As market shows dynamic behavior, the fluctuating price acts as a vital characteristic in the consumer buying decisions. In the present paper, a multi-stage innovation diffusion model is formulated where the evolution of sales takes place in three stages, namely, development of innovation awareness, motivation and ultimate adoption. The proposed model showcases the impact of dynamic pricing policy of the product on the motivation for actual adoption by the potential consumers. For this purpose, an optimization model based on optimal control theory problem is formulated. In addition, analytical …", "num_citations": "7\n", "authors": ["472"]}
{"title": "Weed dynamics, growth and yield of wheat crop as influenced by different tillage and herbicide management under rice-wheat cropping system\n", "abstract": " A field experiment on sandy loam was conducted during rabi 2004-05 and 2005-06 at the Research Farm of the Janta Vedic (PG) College, Baraut, District–Baghpat (UP) to ascertain the relationship among the seed-bed preparation, nutrient and weed management of wheat (Triticum aestivum L.) under six tillage practices (Strip till-drill (STD), Zero tillage (ZT), Surface seeding (SS), Reduced tillage (RT), Conventional line sowing (CLS) and Furrow irrigated raised bed planting system (FIRBS) in main plots and three weed control measures (Metribuzin (Sencor)@ 250 g/ha, Sulfosulfuron (Leader)@ 33.3 g/ha, Weedy check) in sub plots with three replicates. Herbicides was applied at 30-35 days after sowing as a post, emergence. The amount of each herbicides per plot was measured and diluted to desired concentration. Furrow irrigated raised bed planting recorded taller plant, higher dry matter accumulation while, maximum leaf area index was recorded under reduced tillage followed by conventional line sowing and FIRBS. In respect of CGR and NAR furrow irrigated raised bed system estimated highest value of these indices followed by conventional line sowing at 30-60 and 60-90 DAS. Furrow irrigated raised bed planting system (FIRBS) recorded higher grain and straw yield significantly higher over the other tillage management. Conventional line sowing (CLS) also recorded significantly higher yield and yield attributes as compared to other tillage practices. The herbicide application significantly increased the grain and biomass yield due to reduction in weed density and weed dry weight. The highest yield and yield attributes was obtained with …", "num_citations": "7\n", "authors": ["472"]}
{"title": "When to stop testing under warranty using SRGM with change-point\n", "abstract": " When a vendor sells a product, there is usually an implied promise that a product will do something. Under the law, when you buy the product, you can reasonably expect that the product will perform as promised. When a product is purchased and used by a customer then it might be possible that a difference between the product performance and customer expectation crops in. As a result the insurance policy of warranty comes into the picture. A warranty is simply a formal promise by a vendor that the product is defect free, meaning that it will do what it promises to do, and that if it fails to do so, then vendor will go about rectifying defects. But servicing a warranty engages additional costs to the manufacturer and this has an effect on the profit levels. Warranty cost may be reduced by providing higher reliable product. The conflict existing in the context of software reliability, warranty period and selling price need to be …", "num_citations": "7\n", "authors": ["472"]}
{"title": "Reliability analysis and optimal release time for a software using multi-attribute utility theory\n", "abstract": " Growing international competition has increased the need for all developers to ensure the level of quality and reliability of their products at the lowest cost before release. Software users demand faster deliveries, cheaper software and quality product whereas software developers aim at minimizing their developing cost and meeting the competitive requirements. The resulting situation calls for trade-off between the two. Therefore, it is necessary to manage the software development process in terms of reliability and scheduled delivery. A new idea for the software release mechanism is presented in this paper. To estimate and predict software reliability, the structure of SRGMs developed in past is utilized to formulate an optimization model for software release time decision considering the effect of fault generation and imperfect debugging with learning process. The paper proposes a decision theoretic approach, Multi …", "num_citations": "7\n", "authors": ["472"]}
{"title": "Effect of different floral preservative solutions on vase life of few chrysanthemum spray cultivars\n", "abstract": " Five spray type cultivars of Chrysanthemum viz. Kanchil, Shyamal, Flirt, Ravikiran and Kargil were chosen for carrying out post harvest studies. Different floral preservative treatments consisted of citric acid, aluminium sulphate, sucrose and their combination were used. All the chemical treatments significantly increased the vase life over control (distilled water). Amongst the cultivars, maximum percentage of floret opening (97.85) was recorded in cv. Kargil. Minimum weight loss (10.92%) was observed in cv. Kanchil. Maximum vase life (27.03 days) and volume of solution consumed (55.85 ml) was observed in cv. Shyamal while maximum flower diameter (6.99 cm) was recorded in cv. Ravikiran.", "num_citations": "7\n", "authors": ["472"]}
{"title": "Refrigerated storage stability of chicken nuggets containing pea flour\n", "abstract": " Chicken nuggets were prepared from spent hen meat and roasted pea flour at 5 and 10% levels in formulation as a cost reduction measure. Chicken nuggets recorded a significant (p < 0.05) higher emulsion stability with a progressive but non-significant improvement in the cooking yield up to 10% levels of pea flour inclusion. Shear force value also showed a significant (p < 0.05) decrease at 10% pea flour level. Ready-to-eat (RTE) chicken nuggets containing 10% pea flour recorded a non-significant effect on sensory attributes. Incorporation of 10% pea flour indicated low moisture content than the rest of formulations, but a decrease in protein content was observed with the addition of pea flour. Fat content of RTE chicken nuggets showed a significant (p < 0.05) decrease at 10% pea flour level incorporation. RTE chicken nuggets prepared by replacing spent hen minced meat with 10% pea flour packed in two-ply …", "num_citations": "7\n", "authors": ["472"]}
{"title": "Effects of mercury, cadmium and lead on plant chromosomes\n", "abstract": " Effects of mercury, cadmium and lead on plant chromosomes FAO_logo home-icon English Español Français العربية 中文 Русский home-icon Translate with Google Access the full text NOT AVAILABLE Lookup at Google Scholar google-logo Bibliographic information Language : English Type : Other In AGRIS since : 2013 Start Page : 305 End Page : 311 Publisher : New Delhi : Today & Tomorrow's Printers & Publishers, c1982. All titles : \" Effects of mercury, cadmium and lead on plant chromosomes \" \" Effects of mercury, cadmium and lead on plant chromosomes [Toxic heavy metals] \" Save as: AGRIS_AP RIS EndNote(XML) Effects of mercury, cadmium and lead on plant chromosomes Loading... Paper Written Paper Effects of mercury, cadmium and lead on plant chromosomes [1982] Singh, OP Sharma, A. Access the full text NOT AVAILABLE Lookup at Google Scholar google-logo Access the full text NOT Lookup -..…", "num_citations": "7\n", "authors": ["472"]}
{"title": "Ensemble-based extreme learning machine model for occupancy detection with ambient attributes\n", "abstract": " Context-aware computing is a growing research domain in present circumstances due to technological advancements in the area of sensors technology, big data, artificial intelligence and robotics and automation. It has many applications for making the daily life of human beings sustainable, comfortable, and smooth. Context ware computing also includes ambient intelligence and applications such as occupancy detection, prediction, user recognition etc. Occupancy detection and recognition help in developing intelligent applications which help the energy management, intelligent decision making, that results in cost reduction and fault and failure prevention of services and products in advance. Several studies have been conducted to detect the occupancy with a different set of methodologies and approaches using varying types of data such as environmental parameters, image and video-based attributes …", "num_citations": "6\n", "authors": ["472"]}
{"title": "Performance enhancement strategies of a hybrid solar chimney power plant integrated with photovoltaic panel\n", "abstract": " This paper examines the possibility of integrating a photovoltaic (PV) module in a hybrid solar chimney power plant (HSCPP). Since HSCPP is a greenhouse thermal buoyancy-driven system, the surrounding high temperature environment makes PV module temperature extremely high resulting in lower electrical conversion efficiency. Various design configurations of collector duct and solar chimney are investigated using an experimentally validated numerical model to study the PV panel cooling and turbine power output. The results show that turbine power output is sensitive to diverging the chimney up to maximum static pressure recovery limit while PV module shows marginal increase in electrical efficiency. Converging the collector duct alone shows worst turbine and PV module performance. However, in case of combine designs of converging duct and divergent chimney, considerable improvement of PV panel efficiency (about 7%) was observed. The results show that about 80% of the collector area measured from the chimney axis are the most effective region for cooling the PV module where consistent temperature drop of 10–12 °C was observed. A design map vs. PV panel efficiency has been shown charting future directions for designing such energy efficient hybrid solar chimney systems.", "num_citations": "6\n", "authors": ["472"]}
{"title": "Joint optimization of software time-to-market and testing duration using multi-attribute utility theory\n", "abstract": " An optimal software release strategy is a well-investigated issue in software reliability literature. Comprehensive testing is expected before releasing the software into the market to enhance the reliability and security of the software device. In recent years, few analysts have recommended the scheme for software projects that support releasing the software early in the market and continue the testing process for an added period in the field environment even after the software is distributed. These studies are based on one common assumption that the efficiency of the software engineers in detecting the faults occurs at a consistent rate throughout the testing phase. However, bug-identification rate may experience discontinuity at the software release time. In software engineering, the time-point at which fault detection rate changes is termed as change-point. Consequently, an alternative software release policy is …", "num_citations": "6\n", "authors": ["472"]}
{"title": "Joint release and testing stop time policy with testing-effort and change point\n", "abstract": " This study proposes an approach in which software developer should release the product early and continue the testing process for an added period in the operational phase. The software reliability model assumes that the tester’s fault-identification rate modifies after the software release. The time instant at which a bug-detection rate experience a change is termed as a change-point. This paper further discusses the optimal software release policy to determine the software time-to-market and testing duration by dealing with two criteria, namely, reliability and cost. Therefore, multi-criteria decision-making (MCDM) technique recognized as multi-attribute utility theory (MAUT) is applied to measure the optimal release policy. In the current research, the effect of testing effort on modeling the software reliability and cost function is investigated for the joint optimization problem. A numerical illustration is provided by …", "num_citations": "6\n", "authors": ["472"]}
{"title": "A unified approach for optimal release, patching and testing time of a software\n", "abstract": " The ever growing consumer's expectations for innovative and reliable software products within no time have driven developers to reframe the whole development process accordingly. To sustain in the stiff market competition, nowadays software firms are releasing their product early and continue testing to fix the remaining number of bugs in the operational phase by providing patches. A patch is a small program to fix the bugs. But continuing testing to provide patches for better product experience to users is also not economical from the firm's point of view. In the existing software reliability literature, few researchers have worked on to determine the optimal release and testing stop time of a software, but no work has been done to determine the optimal time for releasing, patching and to stop testing the software. In this paper, we present a unified framework of optimal policy to determine optimal software release time …", "num_citations": "6\n", "authors": ["472"]}
{"title": "Optimal launch of a new generation of technology: A multi attribute approach discrete time diffusion process\n", "abstract": " The art of critical decision making in the presence of conflicting objectives has given rise to multi attribute utility theory (MAUT). For any organisation to gain competitive edge in the market it's imperative to optimise launch time of their new product. Too quick a launch impacts the sales of their current generations while delay in launch may lead to customer's disinterest. In order to optimise launch time, customer's adoption behaviour and cost is considered in the proposed study. To analyse the simultaneous impact of both these attributes we make use of MAUT. A discrete Bass model, which is a discrete analogue of the famous Bass model, is proposed. Bass model is developed in continuous time, which limits its application on many real life applications having discrete time data. Therefore, in this paper a discrete innovation diffusion model is proposed using a discrete logistic function and an exact solution is obtained …", "num_citations": "6\n", "authors": ["472"]}
{"title": "Biochemical pesticides\n", "abstract": " 2. Apply a thin even coating of oil over the plant or the fruit surface. Cover all plant surfaces, especially the undersides of leaves and crevices of branches, fruit, twigs, and stems where the pest can hide. 3. To minimize the risk of plant injury, avoid treating when temperatures are below 40 F or above 85 F or when the relative humidity is above 90%. Plant injury is caused due to the residual activity of oils (how long they last). The activity is less under hotter conditions than under cooler temperatures. This is largely because the oil molecules evaporate and move within the plant more quickly in a warmer climate.", "num_citations": "6\n", "authors": ["472"]}
{"title": "Luminomagnetic bifunctionality of Mn 2+-bonded graphene oxide/reduced graphene oxide two dimensional nanosheets\n", "abstract": " Herein, we report the luminomagnetic bifunctional properties of two-dimensional (2D) Mn2+ bonded graphene oxide (GO)/reduced graphene oxide (RGO) nanosheets synthesized using a facile route of oxidation followed by a solvothermal reduction method. Photoluminescence (PL) studies (excited by different wavelengths) revealed that the resonant energy transfer between Mn2+ and sp3/sp2 clusters of GO/RGO is responsible for the enhancement of emissions. Moreover, pH-sensitive PL behaviors have also been investigated in detail. The ferromagnetic behavior is believed to arise due to defects in Mn2+ bonded GO composites. Thus, present reduction method provides a direct route to tune and enhance the optical properties of GO and RGO nanosheets bonded with Mn2+ ions, which creates an opportunity for various technological applications.", "num_citations": "6\n", "authors": ["472"]}
{"title": "Innovation diffusion models incorporating time lag between innovators and imitators adoption\n", "abstract": " Since time immemorial, managers have been interested in the diffusion of innovations. The philosophy being, if one can better understand how innovations diffuse, one can better predict and manage that diffusion. Innovation diffusion has become highly multifaceted ever since 1969, when the famous Bass model was proposed. Although innovation diffusion modeling has been an area of widespread research in the last 50 years or so, which has resulted in a body of literature, however we consider unfolding and incorporating market trends and letting certain assumptions of existing models to relax in order to better fit into the current global scenario is the need of the hour. In this paper, an attempt is made to relax one of the assumptions of the Bass model which states that both the innovators and imitators contribute to the initial purchases of the product with the only difference of their buying influence. In a more …", "num_citations": "6\n", "authors": ["472"]}
{"title": "Modeling multi up-gradations of software with fault severity and measuring reliability for each release\n", "abstract": " As most of the high-technology firms are trying to be more demand driven, technological advancements and up-gradations have become important force in software markets today. An up-graded software product comes in generations where the new version offers a significant improvement in performance or benefits over the previous generation. Features added to the software at frequent time intervals lead to complexity in the software system and add to the number of faults in the software, therefore, the developer of the software needs to keep a check on these faults along with the faults that have been left from the previous release. The proposed model categorizes the faults present in the software on the basis of their severity; simple and hard, with respect to the time they take for their removal. Simple faults are removed as soon as they are detected while hard faults require more effort and time to be …", "num_citations": "6\n", "authors": ["472"]}
{"title": "Optimal price and testing time of a software under warranty and two types of imperfect debugging\n", "abstract": " When a product is purchased and used by a customer then it might be possible that a difference between the product performance and customer expectation crops in. A warranty is simply a formal promise by a vendor that the product is defect free, meaning that it will do what it promises to do and that if it fails to do so, then how the vendor will go about rectifying defects. Warranties are also an effective means of promoting a product in the market when the company or product is not well known. Or in other words warranty serves as a source for spread of an innovation in the market. But servicing a warranty engages additional costs to the manufacturer and this has an effect on the profit levels. Warranty cost may be reduced by providing higher reliable product. The conflict existing in the context of software reliability, warranty period and selling price need to be considered jointly. In this paper, we formulate an …", "num_citations": "6\n", "authors": ["472"]}
{"title": "An interactive approach to determine optimal launch time of successive generational product\n", "abstract": " Effective product launch and commercialisation are critical drivers of top performance for the firms; to which a strong product launch greatly improves the chances of success. Launch is often the single costliest step in new product development. Despite its importance, costs, and risks, product launch has been relatively under researched in the product literature. Determination of optimal launch time is especially critical for high-technology products, where the introduction of each successive generation of a product requires the firm to explicitly consider its impact on the demand for preceding generations. The timing of the launch (i.e., when the launch is conducted from the point of view of the company, the competition, and the customer) is just as important as whether the activities are performed. More managerial attention should be devoted to launch timing with respect to all of these viewpoints in order to improve the …", "num_citations": "6\n", "authors": ["472"]}
{"title": "A preliminary clinical evaluation of external snehan and asanas in the patients of sciatica\n", "abstract": " Lower back pain radiating to either on one leg or both legs along the course of sciatic nerve is a common ailment in the clinical practice, this type of peculiar symptomatology is termed as\" Sciatica\" in modern medicine. The medical treatment is unsatisfactory for both the patient and the neurosurgeons, as the surgical treatment has its own hazards and the cost of the surgical procedure and medical treatment is prohibitory to most of the Indian patients. Hence, most of the patients present themselves to the practitioners of Indian medicines like Ayurveda and yoga. This study was designed to evaluate the preliminary clinical effects of Bahya Snehan and Asanas in the patients of sciatica. This was a prospective randomized active control trial. A total of 60 participants showing classical symptoms of Sciatica between 18 and 65 years of age were randomly assigned to receive Ayurvedic or Yogic measure. One group …", "num_citations": "6\n", "authors": ["472"]}
{"title": "Allelic frequency of phenylthiocarbamide tasters and non-tasters in different human populations of eastern Uttar Pradesh\n", "abstract": " Phenylthiocarbamide (PTC) chemical tastes bitter and its tasting is a genetically determined trait. People with PTC tasting ability are dominant for this trait while those who can not taste this chemical are recessive for the character. Seven human populations from five districts of eastern Uttar Pradesh were analyzed for the distribution of tasters and non tasters for PTC chemical. The frequency of dominant and recessive alleles of this gene was also calculated. In all the populations the tasters were much higher in number than non-tasters. The frequency of T allele is higher than t in most of populations except schedule caste population. The allelic frequency of T ranged from 0.37 to 0.68 whereas the frequency of recessive allele ranged from 0.32 to 0.63. The frequencies of dominant and recessive alleles are almost equal in Hindus and Muslims.", "num_citations": "6\n", "authors": ["472"]}
{"title": "Design and analysis of different stages of supply chain: models and methods\n", "abstract": " There can be little dispute that supply chain management and design is an area of importance in the field of engineering, yet there have been few literature reviews on this topic. Over the past decade, the traditional purchasing and logistics functions have evolved into a broader strategic approach to materials and distribution management in engineering, known as supply chain management. This paper sets out not to review the work carried out for different stages in supply chain   per se  , but rather to contribute to a critical theory debate through the presentation and use of a framework for the categorisation of literature linked to various stages of supply chain management and design. In addition, this paper attempts to clearly describe supply chain management since the literature is replete with buzzwords that address elements or stages of this new management philosophy. The present study is based on the analysis …", "num_citations": "6\n", "authors": ["472"]}
{"title": "Analysis of supplier related issues with implementation of fuzzy logic for Indian textile organisations\n", "abstract": " This paper is based on the data collected from a survey of 66 Indian textile-related organisations carried out to ascertain issues related to supplier selection. Using the data collected, fuzzy set theory has been applied to reach a decision regarding selection or rejection of a particular supplier. Four Multi-Input Single-Output (MISO) mamdani fuzzy inference systems have been proposed. First three MISO systems consist of three inputs, four inputs and three inputs respectively and give out single output each. These three outputs are used as inputs to the fourth MISO system to give out single output, termed as final decision.", "num_citations": "6\n", "authors": ["472"]}
{"title": "Response of bio-fertilizers and chemical fertilizers in onion (Allium cepa L.)\n", "abstract": " Onion (Allium cepa L) is a bulbous biennial herb and a member of Alliaceae family. The most import onion growing states are Maharashtra, Gujrat, Tamil Nadu, Andhra Pradesh, Bihar and Punjab. Inspite of being major onion producing country, India has very low productivity. Among many factors contributing to low productivity, expensive chemical fertilizers application is the key consideration. Chemical fertilizers are applied for quick gowth and more yield but their unlimited use not only robs the soil of its structure, texture and nutrients status but also creates threats to soil health which ultimately results into health hazards to human beings. In such a situation, bio-fertilizers are cost effective, eco-friendly and a renewable source of plant nutrients to supplement the chemical fertilizers for sustainable production. Azotobacter fixes atmospheric nitrogen independently near the root zone thus enhancing the available …", "num_citations": "6\n", "authors": ["472"]}
{"title": "JIT practices in supply chains: a review and modelling for supplier base reduction for electronics industry\n", "abstract": " JIT practices adopted by various industries have been reviewed and JIT purchasing has been found to be the most cost effective and predominant strategy for controlling inventory costs. In the present work the supplier base has been reduced by grouping together various raw materials of similar type and procuring the materials of a group from a single supplier. Thus, a new JIT supply model has been developed for reducing the supplier base by adopting the strategy of frequent deliveries in small quantities. It has been concluded that reducing the supplier base leads to considerable cost reduction involved in the raw material procurement process.", "num_citations": "6\n", "authors": ["472"]}
{"title": "Irrigation induced soil salinity mapping through principal component analysis of Remote Sensing data\n", "abstract": " This paper is based on a research carried out to develop a methodology to delineate severe salt-affected soils using principal component images. For this, fourteen multispectral and multitemporal satellite images were procured for the irrigated areas of Western Yamuna canal command covering Gohana sub-division of Sonepat district of Haryana state. All the data were geometrically and radiometrically corrected and then, resampled to the same spatial resolution. Subsequently, all these data were subjected to principal component analysis. It was observed from the analysis of the Red, Green and Blue (RGB) colour composite, generated from PC1 of NIR is displayed in red and PC1 of Red and PC1 of Green are displayed in green and blue respectively; while the dark tones showed clearly the severe salt-affected areas of an irrigation command.", "num_citations": "6\n", "authors": ["472"]}
{"title": "Nutrient uptake pattern and quality of sorghum [Sorghum bicolor (L.) Moench] genotypes as influenced by fertility levels under rainfed conditions\n", "abstract": " The National Agricultural Library is one of four national libraries of the United States, with locations in Beltsville, Maryland and Washington, DC It houses one of the world's largest and most accessible agricultural information collections and serves as the nexus for a national network of state land-grant and US Department of Agriculture field libraries. In fiscal year 2011 (Oct 2010 through Sept 2011) NAL delivered more than 100 million direct customer service transactions.", "num_citations": "6\n", "authors": ["472"]}
{"title": "EFFECT OF SORGHUM BASED INTERCROPPING SYSTEMS ON PRODUCTIVITY, LAND EQUIVALENT RATIO AND ECONOMICS IN MOLLISOLS OF NAINITAL TARAI (UP)\n", "abstract": " A field experiment was conducted during kharif season of 1985-86 and 1986-87 to study the productivity, land equivalent ratio (LER) and economics of 13 treatments with grain sorghum (sorghum bicolor Moench) at the Livestock Research Centre, G.B.  Pant University of Agriculture and Technology, Pantnagar.  The grain yield of sorghum in both the years was highest in sole sorghum, CSH 9 but the total grain equivalents of sorghum was highest in sole soybean.  The latter also gave the highest net returns and benefit cost ratio, followed by sorghum CSH 9 + pigeonpea combination.  Among different intercropping treatments, sorghum CSH 9 grown with pigeonpea in 2:  1 row arrangement gave the highest grain yield, equivalents of sorghum and LER.  The seed yields of pigeonpea, sunflower and soybean were reduced by intercropping with grain sorghum.", "num_citations": "6\n", "authors": ["472"]}
{"title": "Optimal advertising duration for profit maximization\n", "abstract": " The current research elucidates the advertising scheme of automotive innovation by incorporating the various stages of the product life cycle. The study proposes an empirical model for the automotive industry to evaluate a time-point known as a switch-point or a take-off point at which firms should modify the advertising and sales promotion strategies to boost sales volume. The problem applies a time-series innovation diffusion model wherein adoption rate changes when a product enters a growth stage and then again when the company stops the advertising campaign in the maturity stage. The present paper develops a profit maximization problem, which optimizes the overall advertising duration and advertising take-off point. A numerical illustration is provided using the actual sales data of automobile industries, and sensitivity analysis is further performed to validate the effect of critical parameters on the …", "num_citations": "5\n", "authors": ["472"]}
{"title": "Resource allocation problem for multi versions of software system\n", "abstract": " Up-gradation has become a mandatory feature for software firms. Companies have now got no time to perform software testing because of coming up of their up-graded products at a fast pace. But even then firms have to test their respective version independently to remove maximum possible number flaws within particular time limit or under testing budget. In the current paper, taking into consideration the aspect of multi up-gradation, optimal allocation of testing resources for two versions is discussed. The proposed set of models is solved using dynamic programming approach and is supplemented with numerical illustrations.", "num_citations": "5\n", "authors": ["472"]}
{"title": "SDE based generalized innovation diffusion modeling\n", "abstract": " Diffusion models are rigorously implemented in marketing research to predict the actual trend of innovations over time. These models can be classified in terms of deterministic and stochastic behavior. Deterministic models ignore the randomness in the adoption rate of an innovation that occurs due to environmental and internal system disturbances. Therefore, in the present research, a generalized stochastic diffusion model using Itô’s process is proposed that jointly study the product awareness and eventual adoption of an innovation. Convolution function is applied to integrate these two processes. In addition, different probability distributions are employed, which are relevant for describing the product awareness and adoption processes. Non-linear regression is further carried out to validate the proposed models and parameters are estimated based on the actual sales data from Smartphone and automobile industries. The forecasting results indicate that the proposed models perform empirically better than the already established diffusion models.", "num_citations": "5\n", "authors": ["472"]}
{"title": "Revisiting dynamic potential adopter diffusion models under the influence of irregular fluctuations in adoption rate\n", "abstract": " A pragmatic innovation diffusion model is proposed in the present chapter that interpolates stochasticity in the logistic formulation of the widely-acknowledged Bass model with dynamic market size. These irregular changes are caused due to uncertainty attached to the socioeconomic and political environment in which an innovation is positioned that affects the action of potential adopters leading to their non-uniform behavior. The aim of the current study is to find the analytical solution for the two dynamic market expansion structures, namely, linear and exponential under the influence of irregular fluctuations whose closed-form solutions were not possible in the existing literature. In addition to the changeable market size, the proposed innovation diffusion also incorporates the concept of repeat purchase. The anticipated stochastic differential equation based new product diffusion model is then expounded …", "num_citations": "5\n", "authors": ["472"]}
{"title": "Optimal profit for manufacturers in product remanufacturing diffusion dynamics\n", "abstract": " In remanufacturing, companies take the product back from customers when the product reaches its end-of-life, so as to use as a feedstock for manufacturing of new products. Thereby, it reduces the risk of environmental degradation to be caused by these end-of-life products. The real efficiency in remanufacturing lies in the cost-effective use of reused components. In this paper, we formulate an optimization model based on famous Bass diffusion model to depict not only the quantity returned in the remanufacturing process, but also the amount of cost-saving a manufacturer does with efficient remanufacturing. The proposed approach can enable product designers and remanufacturers to quantify the total component reuse volume by considering the quantity returned, diffusion dynamics with coefficient of innovation and imitation and time to begin remanufacturing. Analytical reasoning & numerical illustration to validate …", "num_citations": "5\n", "authors": ["472"]}
{"title": "Cytokine Attenuation and Free Radical Scavenging Activity of a New Flavanone7, 4′-Dihydroxy-3 ″, 3 ″-Dimethyl-(5, 6-Pyrano-2 ″-One)-8-(3‴, 3‴-Dimethyl Allyl)-Isolated from …\n", "abstract": " Mallotus philippensis L.(MP) commonly known as Kamala tree in Hindi,is a small to medium-sized monoecious tree.The objective of the study was to evaluate the anti-inflammatory activity of MPand a new flavanoneisolated from it by using in vivo models of inflammation.Albino wistar rats of either sex weighing 150-200g were used. Seven groups were made (n = 6), namely normal control group (normal saline, 1 ml/kg), standard control group (acetylsalicylic acid, 100 mg/kg), methanol crude extract (300 and 500 mg/kg), ethylacetate fraction (300 and 500 mg/kg) and active compound 4 (new flavanone, 50 mg/kg). The anti-inflammatory activity was studied using carrageenan induced paw edema method and cotton pellet granuloma method. Levels of cytokines (TNF-α, IL-1and IL-6) and activity of antioxidant enzymeslike catalase and glutathione peroxidase were estimated. It was found that the methanol extract, ethylacetate fraction and Flavanonedemonstrated significant reduction in paw edema in carrageenan induced paw edema method as compared to control. They also diminished the serum TNF-α, IL-6 and IL-1 levels. Significantly attenuated the malondialdehyde levels and increased the activities of catalase and glutathione peroxidase in paw tissue. Similarly there was asignificant decrease in granuloma formation in cotton pellet induced granuloma method. In conclusion, MP extracts and the newflavanonepossess anti-inflammatory activity and this might be due to the inhibition of various cytokines and increased free radical scavenging activity.", "num_citations": "5\n", "authors": ["472"]}
{"title": "Effect of plant growth regulators and zinc on fruiting and yield parameters of acid lime (Citrus aurantifolia Swingle) under malwa plateau conditions\n", "abstract": " An experiment was conducted to study the effect of plant growth regulators and zinc on fruiting and yield parameters of Acid Lime (Citrus aurantifolia Swingle). The treatments comprised combinations of foliar spray of NAA, GA3, Zinc and control. Altogether, 15 treatments were applied in a randomized block design with three replications. Among all the treatments, the foliar spray of NAA 200 ppm + GA3 100 ppm + Zinc 1.0 % was found to be the best for maximum increase in fruit set (49.67 %), fruit retention (65.70 %), fruit volume (36.83 ml), fruit length (4.22 cm), fruit diameter (4.11 cm), rind thickness (1.69 mm), juice percentage (49.00 %), number of fruit per plant (976.33), fruit weight (39.07 g) and reduced the number of days from initiation of flower to fruit set (25.00 Days), fruit drop ( 34.29 %) and number of days from fruit set to fruit maturity (145.00 days), fruit yield per plant (38.10Kg). Quality parameters like ascorbic acid (32.00 mg), total sugars and TSS (8.33 0B) were also improved and acidity (6.42 %) were reduced with the foliar application of NAA 200 ppm + GA3 100 ppm + Zinc 1.0 %.", "num_citations": "5\n", "authors": ["472"]}
{"title": "A flexible reliability growth model for various releases of software under the influence of testing resources\n", "abstract": " The life of software is very short in the environment of perfect competition market. Therefore the software developers have to come up with multiple releases in order to survive in the market. But, enhancing the product and coming up with multiple releases puts a constant pressure on even the best organized engineering organizations. The reason being, up-grading a software application is a complex process. Up-grades of software introduce the risk that the new release will contain a bug, causing the program to fail. Therefore, to capture the effect of faults generated in the software with multiple release, we have developed a multi release software reliability model in this paper. The model uniquely take into account the faults of the current release and the remaining faults of just previous release. The multi release software reliability growth model treats the faults removal rate as a function of testing resources consumed. In addition, most of the debugging process in real life is not perfect. Due to complexity and incomplete understanding of the software, the testing team may not be able to remove/correct the fault perfectly on observation/detection of a failure and the original fault may remain resulting in the phenomenon known as imperfect debugging, or get replaced by another fault causing error generation. The effects of both type of imperfect debugging during testing phase are incorporated in our proposed multi-release model. The model developed is validated on real data set with software which has been released in the market with new features four times", "num_citations": "5\n", "authors": ["472"]}
{"title": "Testing-Effort Based Multi Up-Gradation Software Reliability Growth Model\n", "abstract": " Twenty first century, is expected to see remarkable innovation and development in software technology. Speed of research and development in software technology is tremendous, and its relevance has also increased exponentially by mass availability. The other thing that knocks many of us for a loop is that software manufacturers come out with the same software but they call it an update or an upgrade. Most organizations recognize the importance of technology enhancement to improve the quality of their products and services, to be competitive, and to remain attractive both to investors and to a technology-oriented workforce. Software companies come out with software upgrades all the time. However a software company can lose its name and goodwill in the market if the functionalities added to the software leads to an increase in the number of faults of the software. Therefore, to capture the effect of faults generated in the software with multiple releases, we develop multi up-gradation software reliability model with testing effort. Thus, in this paper, we first review the Weibull testing-effort function that can be used to describe the amount of testing-effort spent on software testing. We later describe how to incorporate the Weibull testing-effort function into software multi up-gradation reliability models. Particularly, a Software Reliability Growth Model has been developed using an Exponential Power distribution which identifies the faults left in the previous release and faults introduced in the upcoming release. The models developed are validated on real data sets with software which has been released in the market with new features.", "num_citations": "5\n", "authors": ["472"]}
{"title": "Considering the effect of learning with two types of imperfect debugging in software reliability growth modeling\n", "abstract": " Software reliability is defined as the probability of failure-free operation for a specified period of time in a specified environment. Software reliability growth models (SRGM) are mathematical models used during late stages of software testing to measure testing progress and reliability. Most of the models for software reliability analysis are based on reliability growth models that describe fault observation/detection/correction as a one-stage process where on the observation of a failure, the fault causing that failure is immediately removed without any time delay. Further, many researchers considered fault observation/detection/correction as a two-stage process. A software failure is observed then the fault causing that failure is detected/corrected with a constant, time dependent or a random delay time lag. Due to the complexity of software system and incomplete understanding of software, the testing team may not be able to remove/correct the fault perfectly on observation/detection of a failure and the original fault may remain resulting in a phenomenon known as imperfect debugging, or get replaced by another fault causing error generation. In this paper, we have proposed an SRGM which considers the learning and expertise gained by testing team as testing progresses in the presence of two types of imperfect debugging. The model is further extended using B Ito type of stochastic differential equation. The inbuilt flexibility of the proposed models takes care of different environment ranging from exponential to S-shaped. The proposed model has been compared with existing models. The goodness of fit and comparison criteria results have been …", "num_citations": "5\n", "authors": ["472"]}
{"title": "An analytical framework for critical literature review of supply chain design\n", "abstract": " There can be little dispute that supply chain design is an area of importance in the field of engineering, yet there have been few literature reviews on this topic. Over the past decade, the traditional purchasing and logistics functions have evolved into a broader strategic approach to materials and distribution management in engineering, known as supply chain management. This paper sets out not to review the mathematical models developed in supply chain literature per se, but rather to contribute to a critical theory debate through the presentation and use of a framework for the categorisation of literature linked to supply chain design through mathematical modelling. In addition, this article attempts to clearly describe supply chain management since the literature is replete with buzzwords that address elements or stages of this new management philosophy. The present study is based on the analysis of a large number of publications on supply design.", "num_citations": "5\n", "authors": ["472"]}
{"title": "Supply chain design of an electronic industry incorporating time compression\n", "abstract": " The overriding objective of this present work is to design and analyse the supply chain of a section of an electronic industry integrating suppliers, manufacturers, distributors and customers by incorporating the time compression approach. The models have been developed both at the strategic as well as operational levels to minimise the cost. The operational level models have been integrated with the strategic level model to achieve overall optimisation instead of individual echelon optimisation. Keeping in view the large number of variables, constraints and related industrial data, the model has been solved using the 'Industrial LINGO-8.0' software. The model solution gives the optimum values of various cost components and per product cost for the customers. The dominant costs have been targeted for reduction using the time compression approach in the production cycle. Finally it is observed that the …", "num_citations": "5\n", "authors": ["472"]}
{"title": "Production and economics of green gram under various row spacing in relation to weed control methods.\n", "abstract": " A field experiment was conducted to minimize the problem of weeds weeds Subject Category: Organism Groups", "num_citations": "5\n", "authors": ["472"]}
{"title": "Studies on integrated weed management technique in chickpea with mustard intercropping system.\n", "abstract": " A field experiment was conducted in Kanpur, Uttar Pradesh uttar pradesh Subject Category: Geographic Entities", "num_citations": "5\n", "authors": ["472"]}
{"title": "Fungi associated with medicinal plants of Madhya Pradesh.\n", "abstract": " Periodic surveys of different places (Chitrakoot, Seoni, Narsinghpur and Bilaspur) in Madhya Pradesh madhya pradesh Subject Category: Geographic Entities", "num_citations": "5\n", "authors": ["472"]}
{"title": "Quality, reliability and information technology: trends and future directions\n", "abstract": " Abstract Several Software Reliability Growth Models (SRGMs) have been proposed in the literature for the testing phase and it is generally assumed that operational phase is similar to the testing phase, which may not be the case in practice. In this paper we develop a SRGM, which can account for reliability growth during both testing and operational phases by suitably changing the parameters in the model for testing phase. It is also interesting to observe that in order to change from testing phase to operational phase, a model from Marketing can be used to account for usage in the operational phase as for the commercially used software, number of instructions executed depends on the number of users. The usage function so defined can also take care of increasing, linearly decreasing trends as a function of time, which implies slow start but gain in growth rate. A big beginning and tailing off in the usage growth. Very few attempts have been made to model the failure phenomenon of commercial software during its operational use. In this paper, a framework for modeling Software Reliability Growth is proposed which can estimate number of faults both in the testing and operational phase. This is achieved by suitably changing the testing effort function with a usage function. The usage function is estimated through innovation diffusion model of marketing. Such an interdisciplinary modeling approach that combines the subjects Software Engineering and Marketing has been attempted for the first time. Also included in the model is information about testing coverage that makes it more useful for the test-managers. Model is validated for both the …", "num_citations": "5\n", "authors": ["472"]}
{"title": "Analyses of total magnetic anomalies over the northeastern marginal part of Deccan traps and adjoining areas of Central India\n", "abstract": " Detailed ground magnetic survey has been carried out with the station spacing of 2 to 5 km around Jabalpur-Mandala region. Strong magnetic anomalies are observed in the adjoining areas of Jabalpur-Mandala and adjoining areas of Central India. The anomalies are generally closed and aligned in the E-W to NE-SW direction. Magnetic interpretation predicts an average thickness of 0.6 km for the Deccan traps, besides bringing out shallow and deeper intrusive bodies at 1.5 and 4.5 km, respectively. The average thickness of the trap is in good agreement with DSS (Deep Seismic Sounding) and magnetotelluric results. 2-D modelling along six profiles also suggests a number of sheet and dyke-like structures to be present in the region up to a depth of 4.7 kill. It is inferred that many zones of weakness along the E-W to NE-SW direction might have existed prior to the Deccan traps volcanism, along which several intrusives.", "num_citations": "5\n", "authors": ["472"]}
{"title": "Effect of Weed Control Treatments and Nitrogen Levels on the Growth and Yield of Forag Sorghum1\n", "abstract": " Field experiments were carried out at the Livestock Research Centre of the G.B. Pant University of Agriculture and Technology, Pantnagar, Nainital, during kharif seasons of 1983 and 1984 to evaluate the weed control methods (atrazine at the levels of 0.25, 0.5 and 1.0 kg ai/ha as per-emergence application) under varying levels of nitrogen (0,60 and 120 kg N/ha) on the control of weeds and their consequent effect on growth, nitrogen uptake and forage yield of sorghum crop. Total weed density and dry matter of total weeds were significantly affected by atrazine application. Nitrogen uptake by individual weed as well as total weeds was reduced significantly by atrazine application at all the stages of growth. Green forage yield and dry matter production were significantly affected by application of atrazine and nitrogen levels during both the years.", "num_citations": "5\n", "authors": ["472"]}
{"title": "Radiomimetic effects of certain metallic salts\n", "abstract": " Radiomimetic effects of certain metallic salts FAO_logo home-icon English Español Français العربية 中文 Русский home-icon Translate with Google Access the full text NOT AVAILABLE Lookup at Google Scholar google-logo Bibliographic information Language : English Type : Journal Article In AGRIS since : 2013 Volume : 3 Start Page : 489 End Page : 492 All titles : \" Radiomimetic effects of certain metallic salts [Allium cepa] \" \" Radiomimetic effects of certain metallic salts \" Save as: AGRIS_AP RIS EndNote(XML) Radiomimetic effects of certain metallic salts Loading... Paper Written Paper Radiomimetic effects of certain metallic salts [1981] Singh, OP Sharma, A. Access the full text NOT AVAILABLE Lookup at Google Scholar google-logo Access the full text NOT AVAILABLE Lookup at Google Scholar google-logo Loading... Bibliographic information Language : English Type : Journal Article In AGRIS since : 2013 : 3 …", "num_citations": "5\n", "authors": ["472"]}
{"title": "Software release and testing stop time decision with change point\n", "abstract": " Information technology has seen enormous growth in the last few decades. The backbone of this growth is the developments in the software industry who is working day and night to meet all the expectations. As we know a reliable software can ease our work but developing reliable software may take a longer time. At the same time, huge market competition has forced firms to deliver reliable products as quick as possible as per the user’s expectation. Due to this trade-off between reliability and market competition firms have started releasing software products with the assurance that they will repair their products if any failure is detected while operating. Keeping this phenomenon in mind various researchers proposed a framework based on a different set of assumptions. During the software development at some point of time the rate of detection/removal changes due to various reasons such as a change in testing …", "num_citations": "4\n", "authors": ["472"]}
{"title": "Multi-generational technology management in a segmented environment\n", "abstract": " This paper examines the diffusion pattern of multi-generational technology innovation using segment-based analysis. The objective of the study is to comprehend the variation in the adoption behaviour of individuals across different geographical regions. The market of potential customers is geographically segmented into homogenous groups to epitomise the realistic technology diffusion in different markets. Three different S-shaped distribution functions, namely, Weibull, Logistic, and Gompertz are employed to understand the diffusion curves of multigenerational technology. The study critically examines two different scenarios depending on the condition that the substitution among two generations is possible within or across the market segments. The applicability of the proposed models is demonstrated using quantitative validation on the historical sales data set of IBM mainframe computers and Liquid Crystal …", "num_citations": "4\n", "authors": ["472"]}
{"title": "Modeling software vulnerability correction/fixation process incorporating time lag\n", "abstract": " Vulnerabilities can be discovered by the white/black hat hackers, the firm's own detection team, reports of users, researchers, government, and so on. The reported vulnerabilities are verified by the debugging team of the software developer and quick action is taken to handle the vulnerabilities before they are exploited by the hackers. Numerous mathematical frameworks have been proposed to model the vulnerability discovery process. Anderson's thermodynamic model was the first vulnerability discovery model (VDM) and was modeled on the lines of a software reliability growth model. The most common approach to fixing a vulnerability is to provide patching service. Patches are corrective code released during the operational phase of software usually to add some functionality, to update it or to remove some bugs. In the earlier VDMs, the vulnerability detection process was considered to be independent, that is …", "num_citations": "4\n", "authors": ["472"]}
{"title": "Optimizing CuInGaSe2 Thin Films Grown by Selenization of Culn/CuGa Multilayers for Solar Cell Applications\n", "abstract": " In this study, CIGS thin films have been grown on soda lime glass substrate by sequentially sputtering CuIn and CuGa targets and selenizing using selenium pellets in two-zone horizontal tube furnace. In order to control the composition; CuIn/CuGa ratio were varied and for improving the crystallinity selenization at higher temperature were carried out. Composition, surface morphology, crystal structure and optical properties of grown films were studied. Optical band gap changed from 1.45 eV to 1.01 eV with change in the composition and selenization temperature of the films. Shift in the Raman peaks have also been observed. Surface morphology has been studied by scanning electron microscope. Chemical composition of CIGS thin films were studied using energy dispersive spectroscopy. This study shall help in optimizing the CIGS thin film quality for realizing high efficiency and durable CIGS thin film solar cells.", "num_citations": "4\n", "authors": ["472"]}
{"title": "Market Expansion Based Innovation Diffusion Modeling and Optimal Timing for Changing Management Strategy\n", "abstract": " Up-grade and Up-date are the two important phenomenon’s that firms look up to improve and excel in the marketplace. In order to update their current marketing strategies firms have to undergo a decision making process for the optimal time to bring out that change. There are several factors like price declination, variation in advertising policies, packing and so on that can lend a positive impact on adoption process. But when to implement the strategy is a big challenge. In the current paper, we have used a methodical approach to see the impact of change in the adoption behavior after a certain time point called change point. The proposal has further been used to identify the optimal change point for the strategies adopted by the firm. Real life sales data set has been used to identify whether our finding is optimal; overestimated or underestimated.", "num_citations": "4\n", "authors": ["472"]}
{"title": "Customer behavior dependent diffusion process & optimal model selection using distance based approach\n", "abstract": " The existence of any company depends on its present and future customers. For the progress of any business organization, understanding customer's mindset is crucial. Many authors have proposed mathematical models to analyze and measure the sales for organizations. This study works with a mathematical methodology to provide different aspect of customer's perception before and after they make their final purchase. Here we have incorporated the concept of repeat purchase and balking in our diffusion modeling framework. Besides studying customer's decision for re-buying the product or they leaving it without buying, we have proposed many models depending on the rate of product adoption. Selecting an optimal diffusion model to be used in a particular case has been an interesting area for researchers in the domain of innovation diffusion modeling. In line with this, we have deployed Distance Based …", "num_citations": "4\n", "authors": ["472"]}
{"title": "Stochastic differential equation based software reliability growth modeling with change point and two types of imperfect debugging\n", "abstract": " Software Reliability is defined as the probability of failure free operation for a specified period of time in a specified environment. If the size of the software system is large, and the number of the faults which are detected and removed through debugging activities becomes sufficiently small compared with the initial faults content at the beginning of the testing phase, in such a situation, we can model the software faults detection process as a stochastic process with continuous state space. Due to the complexity of large software system and incomplete understanding of the software, the testing team may not be able to remove/correct the fault perfectly on observation/detection of a failure and the original fault may remain resulting in a phenomenon known as imperfect debugging, or get replaced by another fault causing error generation. During software testing fault detection/correction rate may not be same throughout …", "num_citations": "4\n", "authors": ["472"]}
{"title": "Incorporating concept of two types of imperfect debugging for developing flexible software reliability growth model in distributed development environment\n", "abstract": " Developing software system is generally a quite complex and time-consuming process. Moreover, the nature and complexity of software requirements have drastically changed in the last few decades and users all over the world have become much more demanding in terms of cost, schedule and quality. These three parameters, all being desirable, have an apparent contradiction at times, which can only be resolved by optimum design of software using well-established software engineering methodologies. The only way to verify and validate the software is by testing. The software testing involves running the software and checking for unexpected behavior of the software output. Software Reliability Growth Models are used to estimate the reliability of a software product. In literature we have several software reliability growth models developed to monitor the reliability growth during the testing phase of the software development. Debugging process is usually imperfect because during testing all software faults are not completely removed as they are difficult to locate or new faults might be introduced. In this paper, we discuss a flexible software reliability growth model for distributed system considering imperfect debugging that faults are not always corrected/removed when they are detected and fault generation. The model has been validated on software data set and it is shown that the proposed model fairs comparatively better than the existing one.", "num_citations": "4\n", "authors": ["472"]}
{"title": "Effect of Temperature and pH on biomass production of Trichoderma viride\n", "abstract": " This investigation revealed that sheath blight of rice may assume serious proportions in Kashmir valley during coming years as inoculum buildup is taking place in the soil every year. Before the disease is blown out of proportion, it is imperative to evolve an effective management strategy to combat this menace.", "num_citations": "4\n", "authors": ["472"]}
{"title": "Management of chronic hemophilic synovitis in children by phonophoresis\n", "abstract": " Background: Physical cascades in hemophilia like hemarthrosis and its sequelae like chronic synovitis can be managed better by repeated factor transfusions or radiotherapy or injectable rifampicin, however, the non-availability and high cost of these modalities of therapy prompted us to look into other innovative methods, which could be effective and economical.Methods: Drug induced pulse ultrasound therapy (phonophoresis) using Betamethasone ointment was used in patients of chronic hemophilic synovitis on alternate day for an average duration of six minutes. Ten to 15 such sittings were given during the course of treatment. The objective parameters for the evaluation of results included changes in the degree of swelling, range of movements, frequency of joint bleed and joint tenderness. Subjective assessment was the grading of response by the patient viz. significant, moderate or poor.Results: The study …", "num_citations": "4\n", "authors": ["472"]}
{"title": "Yield response to girdling by the girdle beetle Obereopsis brevis (Swed.) on different plant parts of soya bean\n", "abstract": " A study of the impact of girdling, caused by the girdle beetle Obereopsis brevis (Swed.), on different plant parts of soya bean variety JS 76-205 revealed that the beetle inflicted maximum girdle formation on the petiole (43.1%), followed by on the branch (22.6%), stem (21.5%), and petiolet (12.8%). Plants with girdles on the main stem suffered 15.74% premature morality and the highest grain weight loss (47.2%), followed by girdles on the petiole, branch, and petiolet which accounted for a grain weight loss of 40.3, 39.9, and 30.2%, respectively.", "num_citations": "4\n", "authors": ["472"]}
{"title": "Understanding the role of Ni ions on the photocatalytic activity and dielectric properties of hematite nanostructures: An experimental and DFT approach\n", "abstract": " In this work, we have synthesized nickel-doped hematite α-Fe2−xNixO3 (x = 0.00, 0.02, 0.04, and 0.06) nanostructures using a hydrothermal method for its potential application in wastewater treatment. Various structural parameters, band gap, and dielectric measurements indicate a particular trend upon gradually increasing the Ni content up to x = 0.04 in the host matrix and this trend reverses upon further increasing the amount of Ni-doping. This indicates that Ni ions are uniformly distributed in the α-Fe2O3 matrix up to this concentration and a non-uniform distribution takes place thereafter. Transmission electron microscopy indicates the growth of a flower-like structure in all the studied samples. We have also performed electronic structure calculations using first principle density functional theory plus Hubbard U method for the analysis of experimental band gap and to understand the correlation effect due to Ni …", "num_citations": "3\n", "authors": ["472"]}
{"title": "Enhanced Thermomechanical Properties of ZrO 2 Particle Reinforced Epoxy Nanocomposite\n", "abstract": " The present work is focused on the outcome of ZrO2 nanoparticle content variation over viscoelastic, mechanical and thermal properties of epoxy resin. For this, ZrO2–epoxy nanocomposites were prepared using ultrasonic dual mixing technique that consists of simultaneous employing ultrasonic mixing with a rotating impeller. For dynamic mechanical analyses (DMA), a single cantilever mode measurement was performed on neat as well as ZrO2–epoxy nanocomposites to determine the storage modulus, tanδ value and glass transition temperature. Cross-linking density in the rubbery region of composite materials was also identified by DMA analyses. Tensile properties of prepared nanocomposites were measured using universal tensile machine. 4 wt.% ZrO2–epoxy nanocomposite material gives maximum enhancement in storage modulus and tensile strength about 70 and 34% as compared to neat …", "num_citations": "3\n", "authors": ["472"]}
{"title": "Studying dynamic market size-based adoption modeling & product diffusion under stochastic environment\n", "abstract": " This study examines the problem of stochasticity in predicting the adoption growth pattern of technological innovations. Two different market expansion-based diffusion models are proposed by calibrating uncertainties in the introduction rate of new potential buyers using the Brownian motion process. The developed stochastic differential equation is described as a forecast model and is solved using the Itô integral and Wiener process. The unique contribution of the present research is that it is capable of describing the dynamicity in the potential market of new products. The proposed methodology is implemented on the Samsung Galaxy and Apple iPhone sales data, and a metaheuristic procedure known as a genetic algorithm is applied to estimate the model parameters. The experimental validation shows that the proposed diffusion models have superior estimation and fitting ability as compared to benchmark …", "num_citations": "3\n", "authors": ["472"]}
{"title": "Entropy-Based Two-Dimensional Software Reliability Growth Modeling for Open-Source Software Incorporating Change-Point\n", "abstract": " This study provides an analytical model to predict the fixing pattern of issues in the open-source software (OSS) packages to assist developers in software development and maintenance. Moreover, the continuous evolution of software due to bugs removal, new features addition or existing features modification results in the source code complexity. The proposed model quantifies the complexity in the source code using the Shannon entropy measure. In addition, the issues fixing growth behavior is viewed as a function of continuation time of the software in the field environment and amount of uncertainty or complexity present in the source code. Therefore, a two-dimensional function called Cobb–Douglas production function is applied to model the intensity function of the issues fixing rate. Furthermore, the rate of fixing the different issue types is considered variable that may alter after certain time points. Thus, this …", "num_citations": "3\n", "authors": ["472"]}
{"title": "Characterization of Model on Location Facilities\n", "abstract": " This paper presented how to partition a network in a number of zones. Once a zone has been determined first node to end node, it is time to decide on the location of stationary facilities within the zone. Location decisions belong to the node and it depends on the type of service being offered. In some cases, the imperative concern is to minimize the average distance or the facilities for the population. Approaches to location and models for applying location policy, two major classes of considerations are highly instrumental in selecting an approach to solving; this concern is usually dominant for cases such as locating a post office, a transportation terminal, or an office of a government agency. One class relates to management objectives, the other class is concerned with the nature of the demand for services and nature of the service provided.", "num_citations": "3\n", "authors": ["472"]}
{"title": "Characterization of Model on Zoning Process\n", "abstract": " This paper represents the process by which a network is partitioned into smaller network each of which further delegated with a smaller network with a certain degree of autonomy in terms of resource allocation and operation. The term “Autonomy” implies that once the guiding policy is articulated and the resource allocation is decided upon, local management may enjoy some freedom in local, short-term decisions such as dispatching repositioning, budget planning and manning. The implications of zoning prevail over a long period, once a wide network is partitioned into sub network, each sub network will likely be treated as almost an independent network in terms of its “rights” to possess and to operate resources.", "num_citations": "3\n", "authors": ["472"]}
{"title": "Variation of crystal structure, magnetization, and dielectric properties of Nd and Ba co‐doped BiFeO3 multiferroics\n", "abstract": " Multiferroics having composition Bi0.80Nd0.20‐xBaxFeO3 were prepared to investigate the effect of doping on crystal structure, magnetic, and dielectric properties. The Rietveld refinement deduces the formation of mixed structural symmetry. With larger content of Nd, crystal structure consisting of major rhombohedral R3c and minor orthorhombic Pnma has been accomplished. The fraction of rhombohedral phase has been found to increase with doping of Ba up to x = 0.10. At composition x = 0.15, the orthorhombic phase Pnma disappears, and there is evolution of triclinic phase P1 in place of it. The mixed structure now accomplished contains ≈61% rhombohedral R3c and rest 39% triclinic P1. In solely Ba‐doped sample (ie, at x = 0.20), the fraction of rhombohedral R3c phase again rises and attains ≈92% fraction of the structure along with rest triclinic P1 phase. The M‐H loops depict enormous enhancement in …", "num_citations": "3\n", "authors": ["472"]}
{"title": "Reactive Sputtering Technique for Kesterite and Chalcogenide Based Thin Film Solar Cells\n", "abstract": " Sputtering technique has been extensively used for many years due to its suitability in industrial applications. This review describes the reactive sputtering process for thin films solar cell application for synthesizing many binary, ternary and quaternary compound semiconductor materials; such as CuS/Se, ZnS/Se, SnS/Se, CIS, CIGS and CZTS etc. Sputtering can be used in different configuration; such as single target magnetron sputtering, multi target magnetron sputtering for stacked layer thin films, co-sputtering for deposition of mixed composition etc. Use of sputtering in various configurations makes composition variation in thin films easier. There are several sputtering parameters; such as initial base vacuum, working pressure, gas flow rate, sputtering rate and substrate temperature which affect the quality of the deposited thin films. If the carrier gas is reactive that also affects the quality of deposited thin film. The …", "num_citations": "3\n", "authors": ["472"]}
{"title": "Innovation diffusion modeling considering the time lag between awareness and eventual adoption\n", "abstract": " PurposeToday, a firm’s major concern is to know the way in which an innovation is adopted in the marketplace. The purpose of this paper is to focus on the two-stage nature of diffusion process in which the time lag between people being informed and their act of making final purchase is considered.Design/methodology/approachThe paper discusses an approach based on the time lag for modeling awareness and adoption process as two separate and yet connected processes. Varying forms of time lag (constant, deterministic or random) have been considered while modeling the required framework. Furthermore, an equivalence approach has been shown between the present framework and the two well-known and established approaches of infinite queuing theory and hazard rate function.FindingsThe results are verified on sales data of two different consumer durables and it show good prediction capability of …", "num_citations": "3\n", "authors": ["472"]}
{"title": "Effect of Soybean (Glycine max) Seed Inoculation with Liquid and Carrier Based Rhizobium cultures and Phosphorus Levels on Productivity and Physico-Chemical Properties of Soil\n", "abstract": " Soybean (Glycine max), is an important legume crop in the world in terms of total production and international trade (Simmond et al., 1999). Soybean contains about 20% oil on dry matter basis with 30-50% of protein (Kwarteng and Towler, 1994). It also has superior amino acid profile and its protein has great potential as a major source of dietary protein and can play an important role to solve malnutrition problems (Ruhul et al., 2009).", "num_citations": "3\n", "authors": ["472"]}
{"title": "Neem oil\n", "abstract": " Neem, botanically known as Azadirachta indica A. Juss, belongs to the Meliaceae family. Neem essential oil is usually prepared from the seed kernels and is well known for its high insecticidal and medicinal value. The interesting feature of neem essential oil is that it is potently aromatic and viscous, and predominantly constitutes fatty acids, along with hydrocarbons. Neem essential oil from flower and leaves is a minor source of volatile oil, composed mainly of caryophyllene. Azadirachtins are the most celebrated and studied active principles of neem oil due to their deterrent, antiovipositional, antifeedant, growth-disrupting, growth-regulating, fecundity, and fitness-reducing properties against insects and various kinds of arthropods. Neem oil is recognized as a powerful biopesticide and may offer a solution to global agricultural, environmental, and public health problems. Neem has undergone extensive research as …", "num_citations": "3\n", "authors": ["472"]}
{"title": "Method development and validation of multiclass pesticide residues and metabolites in wheat by GC-ECD and GC-MS\n", "abstract": " A method was developed and validated for analysis of 25 multiclass pesticide residues and their metabolites in wheat grains using GC-ECD for quantification, and GC-MS for confirmation. Samples were treated through a method developed by slight modification in QuEChERS technique. The GC-ECD instrument was calibrated at 6 calibration levels (viz. 0.005, 0.010, 0.050, 0.100,0.250, 0.500 mg/Kg) with regression co-efficient (r2) varying from 0.9993 to 0.9756. Sample preparation include extraction by Acetonitrile solvent (HPLC grade) and clean up by C-18, PSA and anhydrous MgSO4. Limit of Detection (LOD) of pesticides in wheat matrix varies from 0.002–0.06μg/g and Limit of Quantitation (LOQ)from 0.004 to 0.2μg/g. Mean recovery percentage of pesticides at 1 LOQ lies in range of 79.77–128.04 with RSD below 16.35%. Uncertainty measured at three sources–purity of standards, weighing and instrument …", "num_citations": "3\n", "authors": ["472"]}
{"title": "Generalized discrete time modelfor multi generational technological products\n", "abstract": " Studies on diffusion of multi generations of technological innovations through a population of potential buyers have seen unprecedented impetus over the past few decades. Both academicians and technocrats derive deeper insights by studying dynamic sales behavior of multiple generations of high-technology products. In this paper Discrete Norton Bass (DNB) model, which is a discrete multi generational framework of the original Norton Bass (NB) [6] model is proposed. We also propose a unified framework by suggesting three different discrete multi generational innovation diffusion models in the present work. This discrete multi generational modeling framework overcomes time-interval bias, one of the existing limitations of continuous time based models. Estimating parameters of the proposed models is very simple and succinct and is performed on real life data set using SAS Proc model. Empirical results show …", "num_citations": "3\n", "authors": ["472"]}
{"title": "Stopped Flow Kinetics of MnII Catalysed Periodate Oxidation of 2, 3-dimethylaniline-Evaluation of Stability Constant of the Ternary Intermediate Complex\n", "abstract": " The formation of ternary intermediate unstable complex during the oxidation of aromatic amines by periodate ion catalysed by MnII has been proposed in case of some anilines. This paper is the first report on stopped-flow kinetic study and evaluation of stability constant of ternary complex forming in the MnII - catalysed periodate oxidation of 2, 3-dimethylaniline (D) in acetone-water medium. Stop-flow spectrophotometric method was used to study the ternary complex formation and to determine its stability constant. The stop-flow trace shows the reaction to occur in two steps. The first step, which is presumably the formation of ternary complex, is relatively fast while the second stage is relatively quite slow. The stability constant evaluated for D - MnII - IO4- ternary complex by determining  equilibrium absorbance is (2.2 ± 1.0) × 105. Kinetics of ternary complex formation was defined by the rate law(A)  under pseudo first order conditions.  ln{[C2]eq / ( [C2]eq -[C2])} = kobs . t (A)  where, kobs is the pseudo first order rate constant, [C2] is concentration of ternary complex at given time t, and [C2]eq is the equilibrium concentration of ternary complex. © 2015 BCREC UNDIP. All rights reserved", "num_citations": "3\n", "authors": ["472"]}
{"title": "Assessment the efficacy and economic of insecticides and bio-pesticides against major insect pest combination of brinjal (Solanum melongena Linn.) cv. JB-64\n", "abstract": " The result reported that, efficacy of different insecticidal treatments against pest complex Emamectin benzoate@ 10 gai/ha was found to be most effective as it recorded lowest infestation, of all the recorded pests followed by Pyriproxifen+ fenpropethrin 500 ml/ha. Highest fruit yield was registered in Emamectin Benzoate@ 10 gai/ha (120.66 q ha-1), followed by Pyriproxifen+ fenpropethrin 500 ml/ha (115.47 q ha-1) as compared to control (60.07 q ha-1), highest net profit per hectare was registered in Emmamectin Benzoate@ 10 g. a. i/ha (Rs. 54572) with highest cost benefit ratio was registered in Pyriproxifen 10% EC+ Fenpropethrin 15% EC@ 500 ml/ha (1: 15.69). On the basis of the efficacy of different biopesticides treatments Passilomyces fumosoresus@ 1l/ha was found to be the most effective as it recorded lowest infestation of all recorded pests followed by Beauveria bassiana@ 1l/ha. Highest fruit yield was registered in Passilomyces fumosoresus@ 1l/ha (85.06 q ha-1), followed by Beauveria bassiana@ 1l/ha (80.05 ha-1), highest net profit was registered in Passilomyces fumosoresus@ 1l/ha (Rs. 21672/ha) with highest cost benefit ratio in Passilomyces fumosoresus@ 1l/ha (1: 6.53).", "num_citations": "3\n", "authors": ["472"]}
{"title": "Marigold intercropping with sugarcane for high income\n", "abstract": " Agricultrually, Muzaffarnagar is one of well developed district of Uttar Pradesh (India). This is known as sugar bowl of Uttar Pradesh. About 70% of area is covered by sugarcane. The main crop rotation of the district is sugarcane-wheat-sugarcane. Due to lack of proper crop rotation, the yield of sugarcane and net income decreases day by day. On the basis of soil test it is also observed that soil health is also poor. Now the farmers are adopted marigold", "num_citations": "3\n", "authors": ["472"]}
{"title": "Inheritance of resistance to lesser grain borer, Rhyzopertha dominica in wheat grain\n", "abstract": " Inheritance of lesser grain borer, Rhizopertha dominica (F.), resistance in wheat grain was studied in reciprocal F,, F, and F, progenies of a resistant (NP 799) and a susceptible (NP710) variety. Genetic analyses of the data on mean progeny beetle emergence from different generations revealed that resistance to lesser grain borer was:(a) under genetic control and heritable,(b) polygenic in nature,(c) governed mainly by additive and additive x additive gene effects,(d) independent of maternal effects and (e) exhibiting evidence of transgressing segregation. It was inferred that it was possible to obtain higher degree of resistance in progenies of NP 799 and NP 710 cross combinations. The study comprised first report on inheritance of lesser grain borer resistance and was in conformity with previcus studies on rice weevil resistance in wheat.", "num_citations": "3\n", "authors": ["472"]}
{"title": "On some probability distributions for forward birth interval\n", "abstract": " The probability distributions for forward birth interval have been derived assuming that the female under consideration has spent t years of her married life and fecundability varies from parity to parity. The first distribution relates to a specific parity while the other is derived regardless of parity. For the purpose of estimating some of the parameters involved in the model, rth order raw moments of the distributions have been obtained.", "num_citations": "3\n", "authors": ["472"]}
{"title": "Effect of different weed control methods on growth and dry weight of associated weeds in chickpea (Cicer arietinum L.).\n", "abstract": " Effect of different weed control methods on growth and dry weight of associated weeds in chickpea (Cicer arietinum L.). FAO_logo home-icon English Español Français العربية 中文 Русский home-icon Translate with Google Access the full text NOT AVAILABLE Lookup at Google Scholar google-logo Bibliographic information Language : English Type : Journal Article In AGRIS since : 2012 Volume : 6 Extent : v.91-93(2) All titles : \" Effect of different weed control methods on growth and dry weight of associated weeds in chickpea (Cicer arietinum L.). \" Save as: AGRIS_AP RIS EndNote(XML) Effect of different weed control methods on growth and dry weight of associated weeds in chickpea (Cicer arietinum L.). Loading... Paper Written Paper Effect of different weed control methods on growth and dry weight of associated weeds in chickpea (Cicer arietinum L.). [1983] Mittal M. Singh OP Govind Ballabh Pant Univ. of and , ()…", "num_citations": "3\n", "authors": ["472"]}
{"title": "Tissue specific biochemical alterations during spinning in the eri-silkworm, Philosamia ricini\n", "abstract": " Protein, total free amino acid and RNA accumulated in the silk gland of eri-silkworm decrease drastically within 2–4 days of spinning. In contrast, the fatbody presents an augmentation of total protein concentration towards the end of the spinning process. The hemolymph maintains constancy of these molecules with little variation.", "num_citations": "3\n", "authors": ["472"]}
{"title": "The anatomical features of buccopharynx and brain in Sisor rhabdophorus (Ham.) and Chela bacaila (Ham.) in relation to their feeding habits\n", "abstract": " Though an appreciable amount of work has been done on structures of digestive organs in relation with feeding habits of fishes yet not much has been done either on bucco-pharynx or on brain of fishes in this direction. Rather customarily enough the above two aspects have received an independent treat-ment by various scholars. Amongst the digestive organs ef fishes a particular emphasis may be laid on the role and structure of bucco-pharynx which is the chief organ of ingestion of food and feeding style of the fish. The brain is also an important contrivance by which feeding reflexes are accomplished. The latter cause structural changes in the brain as a result of phenomenal conduction by feeding impulses.", "num_citations": "3\n", "authors": ["472"]}
{"title": "Sintering time dependent structural and magnetic phase transformations in Pr doped BiFeO3 multiferroics\n", "abstract": " The structural stability and magnetic properties of Pr doped BiFeO3 (Bi0.8Pr0.2FeO3) multiferroic ceramics depends on the sintering time. As the sintering time is varied, the structural and magnetic phase transformations has been observed in the multiferroic ceramic. For the present investigation, the samples have been synthesized by conventional solid state reaction method and sintered for 1 h, 2 h and 3 h. The crystal structure of samples has been verified by the Rietveld refinement of XRD patterns. The sample sintered for 1 h is found to possess rhombohedral R3c as major phase. The dominating structural phase changes to orthorhombic Pbam for 3 h sintering. The remanent magnetization in the samples shows a significant increase with the sintering time as observed from M – H loops obtained by VSM. The enhancement in magnetization is suggested to be caused by the increase in canting angle while …", "num_citations": "2\n", "authors": ["472"]}
{"title": "Measuring software reliability under the influence of an infected patch\n", "abstract": " Patching service provides software firms an option to deal with the leftover    bugs and is thereby helping them to keep a track of their product. More and    more software firms are making use of this concept of prolonged testing. But    this framework of releasing unprepared software in market involves a huge    risk. The hastiness of vendors in releasing software patch at times can be    dangerous as there are chances that firms release an infected patch. The    infected patch (es) might lead to a hike in bug occurrence and error count    and might make the software more vulnerable. The current work presents an    understanding of such situation through mathematical modeling framework;    wherein, the distinct behavior of testers (during in-house testing and field    testing) and users is described. The proposed model has been validated on    two software failure data sets of Tandem Computers and Brazilian Electronic    Switching System, TROPICO R-1500.", "num_citations": "2\n", "authors": ["472"]}
{"title": "Strategic System Assurance and Business Analytics\n", "abstract": " This volume deals with the Strategic System Assurance and Business Analytics, ever-growing areas of research from the recent past. The goal of system assurance is to verify that a product conformed to all the desired set of system requirements for safety, security, reliability, maintainability, and availability. Business analytics, on the other hand, provides a data-centric decision-making viewpoint to analyze business performance by utilizing statistical and quantitative methods, information technology, management science, and data mining. Thus, system assurance and business analytics guide a business firm in proper planning, future prediction, and effectual decision making. This volume provides secure, simple access to key performance indicators and metrics that enable clients to be proactive in improving their business operations. This book furnishes a key solution for the ongoing and impending managerial …", "num_citations": "2\n", "authors": ["472"]}
{"title": "Study of the Electrical Properties of Cu2ZnSnS4 (CZTS) Thin Film Using Atomic Force Microscopy (AFM) Techniques\n", "abstract": " CZTS is a compound semiconductor made from elements which are plainly available and nonpoisonous having favorable optoelectronic properties for thin film solar cell (TFSC) applications. In this study, Cu-poor CZTS thin film was fabricated on soda lime glass (SLG)/Mo-deposited substrate using cosputtering followed by post sulfurization in H2S atmosphere. Local electrical transport study was carried out by using conductive atomic force microscopy (C-AFM) for small bias voltage (100 mV). Here we observed that most of the dark current (I dark) flow through grain boundaries (GBs) than grain interiors. The positive high current about 3.4 nA and sharp C-AFM signal at the GBs, dips to the zero (0) value at the grain interior. Local surface potential (V surface) study was carried out using kelvin probe force microscopy (KPFM), which showed that the positive V surface potential about 175 mV in the vicinity of GBs in a Cu …", "num_citations": "2\n", "authors": ["472"]}
{"title": "Two-Dimensional framework to optimize release time and warranty\n", "abstract": " Today’s customer expectations to have well-developed complex enterprise level software, delivered within no time, have left developers with a dilemma as for how to attain the desired level of software reliability with shortened testing time? In this paper, we examine a two-dimensional testing time and effort-based model using Cobb-Douglas production function, for separate release and testing stop time strategy for software in order to optimize overall testing and market opportunity cost. Here we propose a generalized framework for software developers to achieve multiple objectives of minimizing overall testing and market opportunity cost, optimizing warranty length, and optimizing release and testing stop time. We make use of software reliability growth models (SRGMs) to model an average number of bugs to be detected by testers (users) during the pre-/(post)release of the software. Numerical illustration …", "num_citations": "2\n", "authors": ["472"]}
{"title": "Rietveld refinement and dielectric properties of (Na0.5Bi0.5TiO3)-(Bi0.8Ba0.2FeO3) ceramics\n", "abstract": " (1-x)(Na0.5Bi0.5TiO3)-x(Bi0.8Ba0.2FeO3) lead free ceramics (NBT, NBT-BBFO; x = 0.0, 0.1 respectively) have been synthesized by conventional solid state reaction method. Crystalline phase of sintered ceramics was investigated at room temperature using X-ray diffraction. Rietveld refinement of XRD data performed by FullProf revealed that both the samples exhibited rhombohedral structure with R3c space group. Dielectric properties of these ceramics were studied at different temperatures in a wide frequency range using impedance analyzer. Dielectric constant and dielectric loss were found to be increase with increase of BBFO content. The prepared ceramics exhibit a broad maximum in dielectric permittivity at 593K and dispersive permittivity at high temperatures. The NBT-BBFO sample shows a relaxor ferroelectric behavior at different frequencies.", "num_citations": "2\n", "authors": ["472"]}
{"title": "Quality, Reliability, Infocom Technology and Industrial Technology Management\n", "abstract": " I just started out reading this ebook. I could comprehended every little thing out of this written e book. I am pleased to inform you that this is actually the very best publication i have read through inside my personal life and could be he best ebook for ever.--Antonia Orn IV", "num_citations": "2\n", "authors": ["472"]}
{"title": "Free energy relationships for the reaction series-Mn-II catalyzed periodate oxidation of aromatic amines\n", "abstract": " The studies are aimed at testing the validity of various free energy relationships for the reaction series, Mn-II catalysed periodate oxidation of substituted anilines in acetone-water medium. The progress of catalysed oxidation of twenty anilines was followed spectrophotometrically by recording the absorbance of the reaction mixture at pre-determined absorption maxima of the reaction intermediate at different time. Arrhenius equation is followed by all reactions of the series. Hammett, Exner, Taft, Van Bekkum and Sekigawa plots were found to be concave-upward while Brown and Okamoto plot is linear with good correlation. The value of reaction constant, rho, from Brown and Okamoto plot, is -1.46 which is suggestive of retardation of reaction by the electron withdrawing groups and acceleration by the electron donating groups as well as an electrophilic attack on the anilino nitrogen by the periodate ion during …", "num_citations": "2\n", "authors": ["472"]}
{"title": "Influence of different tillage and herbicide management on weed dynamics and wheat productivity under rice-wheat cropping system\n", "abstract": " A field experiment was conducted during rabi 2004-05 and 2005-06 to ascertain the relationship among the seed-bed preparation, nutrient and weed management of wheat (Triticum aestivum L.) under six tillage conditions. Furrow irrigated raised bed planting system (FIRBS) recorded yield attributes as well as grain and straw yield significantly higher over the other tillage management. Conventional line", "num_citations": "2\n", "authors": ["472"]}
{"title": "Uncertainty Based Fault Removal Phenomenon and Successive Software Releases Planning\n", "abstract": " As the size of software system is large and the number of faults detected during the testing phase becomes large, so the change of the number of faults that are detected and removed through each debugging becomes sufficiently small compared with the initial fault content at the beginning of the testing phase. In such a situation, we can model the software fault detection process as a stochastic process with continuous-state space. In the present article, we have described the fault-detection process during the testing phase of successive releases of the software by applying a mathematical technique of stochastic differential equations (SDE) of itoˆ type. Logistic rate function has been chosen to identify and remove the faults lying dormant in the software. We have further investigated an optimal bi-criterion release planning for successive software releases that maximizes the reliability and minimizes the cost of testing …", "num_citations": "2\n", "authors": ["472"]}
{"title": "Growth of CZTS by co-sputtering and sulfurization for solar cell applications\n", "abstract": " Earth abundant copper-zinc-tin-sulfide (CZTS) is an important class of material for the development of low cost and sustainable thin film solar cells. Fabrications of CZTS thin film is carried out by magnetron co-sputtering the metallic and sulfide targets and post deposition sulfurization. We sputter Cu using DC power and ZnS and SnS using RF power. In order to study its structure properties and to establish the best growth conditions, Raman spectroscopy and Glazing incident XRD analysis were carried out. These studies indicated that the grown CZTS film have a kesterite with good crystallinity and strong preferential orientation along (112) plane. SEM analysis revealed a homogeneous, compact surface morphology and large grains throughout the thickness of the film. The grown CZTS film demonstrated an optical absorption coefficient higher than ~ 6x104cm-1 and optical band gap of 1.45 eV. The sheet resistance …", "num_citations": "2\n", "authors": ["472"]}
{"title": "Software release time based on multi attribute utility theory\n", "abstract": " The quality of the software system usually depends on how much time testing takes and what testing methodologies are used. More we spend time on testing; more faults can be removed, which leads to more reliable software. However, the testing cost of the software tends to increase in the process. On the other hand, if testing time is too short, the testing cost of the software may be reduced, but the customers may take higher risk of buying unreliable software. Therefore, it is important to determine when to stop testing, and release the software. In this paper, we propose a new method to estimate the optimal software release time by using Multi Attribute Utility Theory. More precisely, three significant attributes, namely Reliability, Cost and Detection rate indicator are used to determine the optimal release time. The proposed new decision model based on multi-attribute utility analysis is tested on the real world data sets.", "num_citations": "2\n", "authors": ["472"]}
{"title": "A decision support system for analysis of effects of timely fulfillment of customer demand in supply chain management practices\n", "abstract": " This paper is based on the data collected from a survey of 66 Indian textile-related organizations carried out to ascertain issues related to effects of timely fulfillment of customer demand in supply chain management (SCM) practices. Using the data collected, fuzzy set theory has been applied to reach a decision regarding effects of timely fulfillment of customer demand on an organization. Four multi-input single-output (MISO) Mamdani fuzzy inference systems have been proposed as an alternative approach to handle the various variables that are normally considered in such cases in Indian textile organizations. First three MISO systems consist of four inputs (decrease in production lead time, reduction in overall cycle time, improvement in quality, betterment in process integration), three inputs (decrease in production cost, increase in profits, increase in market share), and three inputs (decrease in internal …", "num_citations": "2\n", "authors": ["472"]}
{"title": "Stability Analysis of Storage of Spent Fuel in stack of Trays in Pool\n", "abstract": " The spent fuel bundles from Pressurised Heavy Water Reactors (PHWRs) are stored under water in spent fuel storage facilities in stacks of 20 to 30 trays inside the water depth of 6-7 meters. All the safety systems, structures and components of storage the facility are required to meet Design basis Earthquake (DBE). A stability analysis of stack of trays of fuel bundles in seismic condition has been carried out for 20, 25 & 30 trays using transient FEM analysis based on time history of pool and discussed in this Paper.A finite element model of stack of spent fuel trays has been developed to represent the behaviour under seismic condition. The models are created for each individual tray and spent fuel bundles are modelled as a lumped mass in tray FE model. The interlock between trays has been simulated using combination (ie spring+ Gap) element. The contact element has been used in FE model to capture the lifting and sliding motion between trays and the same has been used for contact between resting surface and bottom most tray of stack. A time history analysis was performed for stack of 20, 25, and 30 trays with different friction of coefficient (0.1, 0.2 & 0.3) to verify its overall stability against turning and sliding under seismic event. These stacks of trays are found stable under the designed level of earthquake.", "num_citations": "2\n", "authors": ["472"]}
{"title": "Effect of seed dressing chemicals on seed germination and seedling infection of mungbean against Alternaria alternata.\n", "abstract": " see more details and increased the germination percentage. Among the chemicals Bavistin was found best to gave the average maximum germination 94.72% and 0.00% seedling infection. Thiram was the next best seed dresser which gave 93.71% seed germination seed germination Subject Category: Natural Processes", "num_citations": "2\n", "authors": ["472"]}
{"title": "Generalized modeling framework for fault detection–correction process incorporating change-point\n", "abstract": " Software developer can better manage the quality of their software using estimates of reliability growth models. Reliability estimation has a direct role in project management. Reliability models are used by the project managers to decide when to stop testing Jalote [15]. During the last three decades many software reliability growth models (SRGM) have been developed incorporating various development and testing environments. From our studies, many existing SRGM can be unified under a more general formulation. In fact, model unification is an insightful investigation for the study of general models without making many assumptions. Software testing is an important phase of software development life cycle (SDLC). Fault detection-correction are considered as separate processes in software reliability growth models. In the literature various software reliability models have been proposed incorporating change-point concept. To the best of our knowledge the change-point models have not been developed under the consideration of fault detection-correction process. In this paper we propose a general framework for deriving several software reliability growth models for fault detection-correction process incorporating change-point concept based on non-homogeneous Poisson process (NHPP). Some existing change-point models along with new models have been derived from the proposed general framework. The models derived have been validated and verified using real data sets. Estimated Parameters and comparison criteria results have also been presented.", "num_citations": "2\n", "authors": ["472"]}
{"title": "Weed management in field pea (Pisum sativum) through agronomic manipulations.\n", "abstract": " A field experiment was conducted during the winter season of 2004-05 and 2005-06 at Kanpur (Uttar Pradesh uttar pradesh Subject Category: Geographic Entities", "num_citations": "2\n", "authors": ["472"]}
{"title": "In vitro isolation, purification, rapid bulking and field establishment of a promising radio-mutant Pusa Anmol from spray Chrysanthemum cv. Ajay\n", "abstract": " Promising novel coloured radio mutants in the form of chimers observed in the irradiated population of chrysanthemum cultivar Ajay (pink coloured spray cultivar) were isolated, purified, proliferated and the micro-plantlets are successfully established in the field as a new mutant variety-Pusa Anmol. Chimeral flower buds with a spectrum of colours appeared when irradiated at 15 and 20 Gy, whereas plant mortality (95%) and negative mutants with abnormalities were higher at 30 Gy. The chimeral portion on florets ranged from 50-100%. The irradiated plants of cv.Ajay produced a wide range of novel chimers (10-19%) with yellow to yellowish pink florets when irradiated at 15Gy. Complete mutants in the form of yellowish pink flower in a flower bunch and complete branch with brick brown color were noticed at 20Gy. A large number of flowers with altered morphology with spoon or flute or cup or quill shape florets were also noticed. The florets with partial chimeras were rejected and only complete chimeral florets or the florets form complete mutants with novel colour were cultured in vitro to isolate the novel mutants. MS medium fortified with 10 mg/l Kinetin + 0.50 mg/l NAA was found to be the best. The florets with limited callus were sub cultured on the same medium where maximum number of florets (82%) regenerated producing as many as 34.40 shoots per explant. A proliferation rate of 5-6 times was achieved using MS medium+3.0 mg/l BAP+0.01 mg/l NAA. Rhizogenesis was achieved (80-90%) when cultured on 1/2 MS + 0.5 mg/l NAA + 60g sucrose. The yellowish pink coloured mutant is successfully established in the field, evaluated for three …", "num_citations": "2\n", "authors": ["472"]}
{"title": "Effect of antitranspirants on growth, biochemical, yield and yield components on wheat under stress conditions\n", "abstract": " MATERIALS AND METHODSThe field experiments were carried out during two Rabi seasons 1997-98 and 1998-99. in CSA University of Agriculture and Technology, at Crop Research Farm Block-'A'Kanpur. A wheat variety, K-8027 was grown under soil water stress situation. The soil of the plot was sandy loam with 20.3 per cent field capacity and 5.3 per cent permanent wilting coefficient. All plot received uniform fetilizer given at the rate of 80 kg N, 40 kg P205 and 40 kg K20 per hectare their source being urea, diamonium phosphate (DAP) and muriate of potash respectively. Half of N and full P205 and K20 were given as basal. Rest of the half was split equally and applied at tillering and flowering stages. There were thirteen treatment combinations namely, ABA 5 and 10 ppm, CCC 1000 and 2000 ppm, ASA 250 and 500 ppm, Silicon 100 and 200 ppm, PMA 250 and 500 ppm, Simazine 50 and 100 ppm and …", "num_citations": "2\n", "authors": ["472"]}
{"title": "Spatial Modeling of Soil Salinity for Impact Assessment of Subsurface Drainage System\n", "abstract": " Knowledge of spatial variability of the soil and water properties of the subsurtace drained field is essential to analyze and evaluate the spatial impact of a subsurface drainage system. The present study was carried out to develop the spatial variability maps of soil salinity using geostatistical approach and evaluate the impact of subsurface drainage system on soil salinity in an area of about 1000 ha in Western Yamuna Canal Command in Gohana sub-division ofSonepat District of Haryana Soil salinity datasets were subjected to exploratory data analysis using the GS+® and Geostatistical module of ArcGIS®. The semivariogram analysis revealed that the spherical semivariogram model fitted well to describe the spatial variability of soil salinity as evident from high coefficient of determination, R2, (0.957<R2<0.994) and least residual sum of squares, RSS, (0.003<RSS<0.006). The developed semivariogram models …", "num_citations": "2\n", "authors": ["472"]}
{"title": "Effect of stage of harvest on green fodder, grain and nutrients production from various varieties of wheat (Triticum aestivum)\n", "abstract": " To assess the potential of wheat (Triticum aestivum L.) production for green fodder cum grain, present experiment was conducted sowing three varieties viz. UP 2003, UP 2338 and WH 542 in the first week of November. Nutrient composition with regard to various stages of harvest were comparable. Harvesting green fodder at 60 or 70 days, yielded good amount of green fodder in terms of DM production of wheat straw however grain was significantly lower as compared to uncut control. Crude protein (CP) production from straw (3.88q/ha) and grain (5.41 q/ha) was highest when the crop was harvested at maturity. The total CP yield was 30%, and 58% higher in 60 and 70 days cuts, respectively as compared to control. Per cent cost of CP harvested (Rupees per unit) was significantly reduced to 18 and 44% by harvesting at 60 and 70 days intervals.", "num_citations": "2\n", "authors": ["472"]}
{"title": "Effect of growth regularos on grop efficiency and productivity of gram (Cicer arietinum L.)\n", "abstract": " Effects of sprays of four growth regulators (TIBA 25 and 50 ppm, CCC 2000 and 4000 ppm, Alar 500 and 1000 ppm and MH 250 & 500 ppm) on growth efficiency and productivity of gram variety K 850 was studied in a field experiment conducted at Bharari (Jhansi) during rabi season of 1987-88. TIBA 50 ppm produced significantly highest seed yield (2600 kg/ha) and higher value of seed productivity (16.5 kg seed day'ha*'), as compared to control (2250 kg/ha and 15.1 Kg seed day'ha*'). The growth regulators were effective in order of TIBA> CCC> MH> Alar. Increase in seed yield of gram appeared to be the result of increases in seed number/plant, 1000-seed weight, harvest index and dry matter production, coupled with reduced flower drop, CCC 4000 ppm delayed flowering and maturity by about one week. Protein content was significantly increased by sprays of TIBA 50 ppm treatment.", "num_citations": "2\n", "authors": ["472"]}
{"title": "Weed management in rice nursery\n", "abstract": " A field experiment conducted during Kharif 1986 and 1987 at the farm of C.C.S. Haryana Agricultural University, Rice Research Station, Kaul for chemical weed control in rice nursery showed that application of butachlor gave adequate weed control (more than 70%) but 24–25% injury to rice seedlings. Thiobencarb gave 15% crop injury but weed control was inadequate. Pendimethalin at 0.75 and 1.0 kg/ha provided effective weed control (more than 75%) and was safer to rice seedlings with only 11% crop injury.", "num_citations": "2\n", "authors": ["472"]}
{"title": "Similarity transformation of the ab initio density matrix\n", "abstract": " Bond orders and hybrid populations have been calculated from the density matrix localized in molecular space using similarity transformation for some fluorobenzene with the minimal basis set using Gaussian series of program. The ab initio bond orders and hybrid populations have been compared with the semiempirical calculations on this set of molecules. Also, these bond orders have been used in Coulson's bond order‐bond length relationship to estimate bond lengths. The present calculations suggest that the qualitative predictions of molecular geometries are possible from these bond orders.", "num_citations": "2\n", "authors": ["472"]}
{"title": "Metabolic reorganization in the silk gland of eri-silkworm, Philosamia ricini, during thermal acclimation\n", "abstract": " The silk gland of eri-silkworm, Philosamia ricini, at the end of the 5th instar, presents an interesting augmentation of RNA (23.5%) and protein (47.1%) concentrations in conjunction with a decrease in amino acid/DNA ratio (64.4%) due to the cold adaptation. However, on the first day of spinning process, the protein/DNA ratio of the tissue undergoes a decrease of 22.9% in its level, which has been attributed to the “masking” of the protein biosynthesis due to the commencement of spinning process.", "num_citations": "2\n", "authors": ["472"]}
{"title": "Phenotypic stability for harvest index and pods per plant in soybean.\n", "abstract": " Phenotypic stability for harvest index and pods per plant in soybean. FAO_logo home-icon English Español Français العربية 中文 Русский home-icon Translate with Google Access the full text NOT AVAILABLE Lookup at Google Scholar google-logo Bibliographic information Language : English Type : Journal Article In AGRIS since : 2012 Volume : 3 Extent : v.85-88(2) All titles : \" Phenotypic stability for harvest index and pods per plant in soybean. \" Other : \" Summary (En). \" Save as: AGRIS_AP RIS EndNote(XML) Phenotypic stability for harvest index and pods per plant in soybean. Loading... Paper Written Paper Phenotypic stability for harvest index and pods per plant in soybean. [1983] Singh O. Chaudhary BD Rijksuniversiteit Gent (Belgium). Faculteit van de Landbouwwetenschappen. [Corporate Author] Haryana Agricultural Univ., Hissar (India). Dept. of Plant Breeding [Corporate Author] Access the full text NOT --…", "num_citations": "2\n", "authors": ["472"]}
{"title": "note on runner production in strawberry by gibberellic acid\n", "abstract": " note on runner production in strawberry by gibberellic acid FAO_logo home-icon English Español Français العربية 中文 Русский home-icon Translate with Google Access the full text NOT AVAILABLE Lookup at Google Scholar google-logo Bibliographic information Language : English Type : Journal Article In AGRIS since : 2013 Volume : 14 Issue : 4 Start Page : 275 End Page : 277 All titles : \" note on runner production in strawberry by gibberellic acid \" Save as: AGRIS_AP RIS EndNote(XML) note on runner production in strawberry by gibberellic acid Loading... Paper Written Paper note on runner production in strawberry by gibberellic acid [1982] Phogat, KPS Singh, OP Access the full text NOT AVAILABLE Lookup at Google Scholar google-logo Access the full text NOT AVAILABLE Lookup at Google Scholar google-logo Loading... Bibliographic information Language : English Type : Journal Article In AGRIS since : …", "num_citations": "2\n", "authors": ["472"]}
{"title": "Interaction of N, P and S on nodulation, protein and S containing amino acid contents in Cicer arietinum\n", "abstract": " Number and dry weight of effective nodules/plant increased appreciably with the application ot'N and P over the control with the advancement of age upto 90 days and later a sharp decline was observed. Application of S alone was not found to be so effective as regards nodulation but its application either alone or with N showed significant edge over the results obtained from N and P so far as S containing amino acids content or protein content is concerned. A marked effect of various interaction among these three nutrients have been noticed and application of N, P and S have been found to produce best results as referred to nodulation as well as protein and S containing amino acids content, thus playing most vital role in improving the protein quality and nutritive value of legume seeds.", "num_citations": "2\n", "authors": ["472"]}
{"title": "Myofascial Release versus other Soft Tissue Release Techniques along Superficial Back Line Structures for improving Flexibility in asymptomatic adults: A Systematic Review with …\n", "abstract": " ObjectiveOur review is aimed to find out the efficacy of Myofascial Release Technique (MFRT) based on the Randomised Controlled Trials, on flexibility when given along Superficial back line (SBL) structures and to compare it with other soft tissue release techniques.Data SourcesA systematic literature search on MEDLINE (Pubmed), Google Scholar, Science direct, Cochrane Library, Physiotherapy Evidence Database (PEDro) and Clinical Trial Database in English; up to April 2020 was undertaken.Study selectionPRISMA (The Preferred Reporting Items for Systematic Reviews and Meta-Analysis Protocols) was used for screening the relevant citations and reviewing the relevant studies. The literature searched total of 6,938 articles, however, only 68 were screened for eligibility. In the further screening, 16 studies fulfilled the inclusion criteria for our systematic review.Data ExtractionData was extracted into a table …", "num_citations": "1\n", "authors": ["472"]}
{"title": "Investigation of crystal structure, dielectric properties, impedance spectroscopy and magnetic properties of (1-x) BaTiO3–(x) Ba0. 9Ca0. 1 Fe12O19 multiferroic composites\n", "abstract": " Composites having composition (1-x)BaTiO3−(x)Ba0.9Ca0.1Fe12O19 (x = 0.10, 0.20, 0.30) were synthesized by conventional solid-state reaction technique. X-ray diffraction (XRD) was used to examine the phase formation. Rietveld refinement has been done using the FullProf suite which predicted the dual phase symmetry consisting hexagonal (P63/mmc) and tetragonal (P4mm) phases in the prepared composites. The dielectric properties of the obtained composites were investigated at different temperatures as a function of frequency in the range of 100 Hz to 7 MHz. The dielectric constant increases with an increase in Ca doped barium ferrite content. The composites showed usual dielectric dispersive behaviour with increasing frequency. The conduction mechanism and dielectric relaxation were examined by complex impedance spectroscopy (CIS). Nyquist plots of all composites showed two semicircles and …", "num_citations": "1\n", "authors": ["472"]}
{"title": "Structural, Dielectric and Magnetic properties of Yttrium doped Hematite Nanoparticle\n", "abstract": " Applicability of magnetic crystalline nanoparticles particularly in the diagnostic field of health care and magnetic data storage makes them highly important for various technological researches. Novel properties of prepared nanoparticles can be tuned with doping of rare earth metals. In the present research, Yttrium (Y) doped hematite nanocrystalline samples have been prepared at various compositions, Fe2-2xY2xO3 (x= 0.00, 0.02, 0.05, 0.08, 0.10) and magnetic properties are seen sensitive with dopants concentration. The variation in grain size from FE-SEM is found well collaborated with the crystallite size and strain determined by XRD measurements. Rietveld refinement of XRD patterns reveals the formation of rhombohedral symmetry with Rˉ3c space group of the samples. The dielectric and magnetic properties show wiggling behaviour with the concentration of doping metal. A shift towards weakly ferromagnetic conduct like behaviour has been confirmed with the doping of Y in hematite crystalline particles.", "num_citations": "1\n", "authors": ["472"]}
{"title": "Predicting diffusion dynamics and launch time strategy for mobile telecommunication services: an empirical analysis\n", "abstract": " Information technology (IT) innovations require strategic planning for issues related to the launch time of the new generation, technological advancement, and potential user base. The present study seeks to develop a decision-making model that effectively facilitates the predictive analysis of the diffusion paradigm for multi-generational services and the optimal timing of new service introduction. This paper analyzes the generation substitution and customer attrition behavior simultaneously in the adoption process of service generations. A novel multi-generational diffusion model is proposed for those service innovations that coexist in the market at the same time and divides the firm’s market shares. Also, the proposed study intends to devise a decision model to assess the launch scenarios for a new service generation. The optimization problem takes into account the trade-off between the preceding generation’s …", "num_citations": "1\n", "authors": ["472"]}
{"title": "Optimal Decisions on Software Release and Post-Release Testing: A Unified Approach\n", "abstract": " In this research, a novel approach is developed where the testing team delivers the software product first and extends the testing process for additional time in the user environment. During the operational phase, users also participate in the fault detection process and notify the defects to the software manufacturer. In this study, a reliability growth model is proposed using a unified approach based on the expenditure of efforts during the testing process. Besides, debugging process is considered imperfect as new faults may enter the software during each fault removal. The developed model further considers that the developer's rate of defect identification changes with a software release. Thus, the software time-to-market act as a change-point for the failure observation phenomenon. It is asserted that the accuracy of the software reliability estimation improves by implementing the concept of change-point. The main aim of the paper is to evaluate the optimal release time and testing termination time based on two attributes, particularly, reliability, and cost. A multi-attribute utility theory (MAUT) is applied to nd a trade-of between the two conflicting attributes. Finally, a numerical example is presented by using the historical fault count data. The behavior of two decision variables is measured and compared with the existing release time strategy.", "num_citations": "1\n", "authors": ["472"]}
{"title": "Effect of postharvest preservatives on vase life of cut rose (Rosa hybrida L.) cv. top secret\n", "abstract": " The rose (Rosa hybrida L.) is a woody perennial flowering plant and most popular flower of all gardens throughout the world. It is an indication of love, perfection, elegance and romance. It was called “The Queen of Flowers” firstly by Greek poetess in her “Ode to the Rose”(Muhummad et al., 1996)[18]. Rose is belonging to family Rosaceae and genus Rosa. A numbers of species are found in the northern temperate climate zone, tropical and subtropical parts of the world (Zlesak, 2006)[28]. It is hard to imagine a garden without roses (Farahat et al., 2014)[6]. Apart from being admired for its beauty, rose is used in worship, garlands, bouquets, cut flowers preservers and decorations etc. because of variation in growth habit, shape, size, form, colour, fragrance and so many varieties, rose have wide suitability. Roses are acknowledged extremely beneficial for economical benefits being the good source of unprocessed material for cosmetics, perfumery and other agro-based industries. Gulkand is a value added product of rose petals used as a good digestive tonic and blood purifiers. Fruits are applied on wound, sprain, injuries and foul ulcer. Rose hips are used to make rose syrup which is rich in vitamin ‘C’and used for different purpose. It secures 1st position in world floriculture trade. Rose is one of the important cut flower, which have great demand in the national as well as international market. Major rose growing countries are France, Spain, USA, Italy, South Africa, and India. Rose is one of the potentially valuable cut flower and is an important commercial flower crop of our country. In India cut roses are grown in different parts of the country in which …", "num_citations": "1\n", "authors": ["472"]}
{"title": "Modeling technology diffusion: a study based on market coverage and advertising efforts\n", "abstract": " The present research recommends a value-based diffusion model to examine the pragmatic demand for technology products. Diffusion process describes the advancement of a technology over time that results from individual buying decisions. The aim of this study is to measure the sales volume of innovations centering on the market coverage strategy and expenditure on advertising outlay. Market coverage is the evaluation of the marketplace and subsequent determination of how much of the marketplace the firm should cover with their advertisement for a specific commodity. In this research, a diffusion process is modeled by integrating market coverage strategy and advertising intensity to forecast factual sales level of technology innovations. The applicability of the proposed models is established using quantitative validation on the actual sales data sets of consumer durable products. The proposed model is …", "num_citations": "1\n", "authors": ["472"]}
{"title": "Formulation of error generation-based SRGMs under the influence of irregular fluctuations\n", "abstract": " Reliability growth models for software have been widely studied in the literature. Many schemes (like hazard rate function, queuing theory, and random lag function) have been proposed and utilized for modeling the fault removal phenomenon. Among these, hazard rate function technique has gained significant attention and has been excessively used for model debugging process. An essential aspect of modeling has been pertaining to reliability estimation under irregular fluctuations environment. Another major domain highlighted in Software Reliability Engineering (SRE) is that of error generation, which has been an important area of research up till now. This article shows how, using Hazard Rate Function approach, error generation concept can be studied in a fluctuating environment. The utility of the proposed framework has been emphasized in this paper through some models pertaining to different …", "num_citations": "1\n", "authors": ["472"]}
{"title": "Optimizing price, release, and testing stop time decisions of a software product\n", "abstract": " Testing phase is a standout among the most imperative stages in the software life cycle, which helps in concluding that the software application is a deliverable item that can meet both designer and client prerequisites. Dividing the testing stage into pre-release and post-release testing stages causes the developers to considerably expand their testing base from a set number of analyzers to a fundamentally huge number of analyzers during the shift from pre-release to post release testing phase of the software. Customers need good quality product at lower prices, but providing good quality product needs effort and resources, which puts constraints on the firm's decision to offer low-price products. Decisions related to software release, testing, pricing, and profit are some of the most important aspects of policy making in the software industry. Many researchers have worked behind the ideology of obtaining an optimal …", "num_citations": "1\n", "authors": ["472"]}
{"title": "Antenatal, intranatal and postnatal care: a tertiary centre study of North India\n", "abstract": " Background: Care of pregnant lady during antenatal period is the key to reducing maternal mortality and morbidity during pregnancy and child birth and futher improving the growth and development of the newborn. Optimal weight gain in the initial 6 months is very essential. Therefore, study aims to assess antenatal, intranatal and postnatal factors affecting the growth of newborn child.Methods: A Community based cross sectional study was conducted twice–at delivery and second after 6 months. A total of 220 ladies delivered at QMH, King Georges Medical University, Lucknow between August-2016 to September-2017 were included. WHO Standards were used to calculate the deviation from normal growth. Data was entered in SPSS-23 and assessment was made for factors affecting the growth of newborn. Results: At the time of birth the weight, length and head circumference of newborn was measured. Normal weight, length and HC of±2 SD was seen in 91%, 88%, 94% males respectively and 87.8%, 97.8 and 73.3% females. Repeat measurements at 6 month age of newborn showed normal weight, length and HC in 62%, 58% and 87% males respectively and 87.8%, 74.4% and 96.7% females. Multivariate logistic regression analysis of factors revealed that growth of newborn upto 6 months was significantly associated with exclusive breastfeeding (OR 0.161; 95% CI 0.053-0.492; p= 0.001), Illness in past 6 months (OR 6.820; 95% CI 2.376-19.579; p< 0.001) low birth weight (OR 0.101; 95% CI 0.015-0.665; p= 0.017).Conclusions: Although adherence to the proper schedule of antenatal, intranatal and postnatal visits and care varies between …", "num_citations": "1\n", "authors": ["472"]}
{"title": "Market segmentation-based modeling: An approach to understand multiple modes in diffusion curves\n", "abstract": " The diffusion of innovation is an essential topic of research in the field of marketing management. Since the 1960s, plenty of innovation diffusion models have been introduced to study the diffusion process of a product. A plethora of diffusion models based on the highly pertinent work of Bass (1969) are available in literature. Bass (1969) has contributed greatly to the understanding of a variety of diffusion models. The simple structure of the Bass model has led to its higher number of applications over the last few decades. The Bass model perceives that an innovation spreads throughout the market by two main channels: mass media (external influence) and word of mouth (internal influence). His model assumes the nature of consumers to be homogenous with respect to their response behavior (Agliari et al. 2009). The inexorable expansion of the market forces the researchers to explore alternative diffusion models …", "num_citations": "1\n", "authors": ["472"]}
{"title": "Generalised framework for optimal pre and post release software testing in presence of warranty\n", "abstract": " Significant advances in the field of software testing have been made by providing extended warranties, operational support and desired software reliability to the customers. However, the trade-off between minimising testing cost and maximising reliability to ensure well-timed market penetration has been a key concern for developers. Separate release and testing stop time strategy in order to optimise overall testing and market opportunity cost is proposed. We propose a generalised framework for developers to achieve multiple objectives of minimum testing and market opportunity cost; optimal warranty length; and optimal testing and release time. Software reliability growth models (SRGMs) are used to model an average number of bugs detected by testers (users) during the pre (post) release of software. Significant implications and quite intriguing facts related to separate release and testing stop time; early release …", "num_citations": "1\n", "authors": ["472"]}
{"title": "When to start remanufacturing using adopter categorization\n", "abstract": " Remanufacturing of goods involves taking the product back from the customer so as to use it as a feedstock for manufacturing new products. It provides double benefits of cost and environmental saving to the manufacturer and society, respectively. One of the major challenges faced by original equipment manufacturer (OEM) here is forecasting quantity returned by the customers and when to start remanufacturing. In this paper, we formulate a strategy for OEMs to optimize time to start remanufacturing using the adopter categorization approach as proposed by Roger. We propose an optimization model based on famous Bass diffusion model to depict not only the quantity returned in the remanufacturing process but also the amount of cost saving a manufacturer does with efficient remanufacturing. With data on 11 consumer durable products, we compare product returned under various adopter categorization …", "num_citations": "1\n", "authors": ["472"]}
{"title": "The role of scanning electron microscope (SEM) in nanotechnology\n", "abstract": " The word nanotechnology was introduced by Richard Feynman in 1959. In 1974, the word nanotechnology was used by Norio-Taniguchi. In 1986, K. Eric Drexler mentioned the word nanotechnology in his book Engines of Creation [1]. Nanotechnology, also known as nanotech is a technology, science, and engineering with the ability to demonstrate matter or things having size at nanoscale (1 nm–100 nm)[1–7]. Nanotechnology gives ffexibility to study very tiny-sized samples and it covers almost all fields including physics [8–10], chemistry, biology [11–20], material science, and engineering for many useful applications [21–25]. According to the National Nanotechnology Initiative (NNI) US, the definition of nanotechnology is control of matter at dimensions approximately between one to one hundred nanometers, where unique phenomena enable novel applications. Nanotechnology consists of imaging, measuring, modeling, and manipulating matter at this length scale including nano science, engineering, and technology [26–29]. For imaging nanomaterials [30–36], microscopes and especially electron microscopes are very useful.", "num_citations": "1\n", "authors": ["472"]}
{"title": "Krill herd based optimization for job shop scheduling problems (JSSP) to minimize make span time\n", "abstract": " In conventional scheduling issues, the processing time for the given job is thought to be a consistent paying little respect to whether the job is booked before or later. In any case, the wonder named''learning impact''has widely been concentrated as of late, in which job processing times decay as laborers acquire encounter. The target of this paper is to minimize the make span time in JSSP alongside the propelled strategies. In the proposed algorithm, a few earlier standards are displayed to build the underlying populace with an abnormal state of value. This examination we have utilized four unique sorts of optimization techniques among propositions the best results acquired in Krill Herd Optimization (KHO) process. Recreation comes about on the standard test occurrences demonstrate that KHO has a superior convergence execution contrasted and single-goal existing enlivened optimization process. This proposed job accomplished 94.33% precision in KHO system contrasted with other optimization process.", "num_citations": "1\n", "authors": ["472"]}
{"title": "Formulation, nutraceutical profile and storage stability of aloe gel & ginger juice functional beverage blend\n", "abstract": " Aloe vera gel, well known for its nutraceutical potential, is being explored as a functional ingredient in a wide array of health foods and drinks. Nutraceutical ready-to-serve were prepared by using different proportions of Aloe vera gel and ginger juice as 90: 10 (1), 92: 8 (2), 94: 6 (3), 96: 4 (4) and 98: 2 (5). Prepared ready-to-serve beverages were filled hot in 200 ml glass bottles and crown corked followed by pasteurized at 90±2oC for 25 minutes and air cooled. The blended ready-to-serve was analyzed for its different sensory quality, evaluated by adopting 9 point hedonic scale. On the basis of overall sensory quality ready-to-serve, sample number (7) blended ratio of 90: 10 with 12 per cent total soluble solids and 0.20 per cent acidity was found to be the best. These RTS have a longer shelf life without having any microbial infestation. The data generated during the experiment revealed that TSS, total acidity and total sugar increased, while ascorbic acids content decreased. The developed ready-to-serve could be promoted as a nutraceutical product with multiple benefits to the consumers.", "num_citations": "1\n", "authors": ["472"]}
{"title": "Rietveld refinement and dielectric studies of Bi0.8Ba0.2FeO3 ceramic\n", "abstract": " Polycrystalline Bi0.8Ba0.2FeO3 ceramic has been synthesized via conventional solid state reaction technique. The Rietveld refinement of x-ray powder diffraction revealed that the sample has a rhombohedral crystal structure (space group R3c). With increase in temperature, the values of dielectric constant (ϵ′) and dielectric loss (tan δ) are found to be increase at different frequencies which may be the result of increase in the number of charge carriers and their mobilities due to the thermal activation. Further the ac conductivity data is analyzed by using Jonscher’s universal power law. The values of frequency exponent ‘s’ lies in the range 0.2 ≤ s ≤ 0.7 and decreases with increase in temperature which can be explained on the basis of CBH (Correlated Barrier Height) model.", "num_citations": "1\n", "authors": ["472"]}
{"title": "Sintering time effect on crystal structure and magnetic properties of Bi0.8La0.2FeO3 multiferroics\n", "abstract": " Effect of sintering time over the structure and magnetic properties has been studid in Bi0.8La0.2FeO3 multiferroic ceramics prepared by solid state reaction technique. The structure changes with the advent mixed phase rhombohedral and orthorhombic symmetry to immaculate orthorhombic structure with sintering time from 2 to 3 hour, as revealed by means of the simulation of XRD patterns via Rietveld analysis through FullProf software. The M – H plots depict decent enhancement in magnetization with values of remnant magnetization (Mr) from 0.01868emu/g to 0.09357emu/g while the sintering time is varied from 2 to 3 hour. The metamagnetic transition may be attributed to the crumpling of the modulated spin cycloid existing inherently in the pristine compound. The presented study may have considerable impact in commercial as well as advanced electronic applications.", "num_citations": "1\n", "authors": ["472"]}
{"title": "Anticonvulsant activity of extract and fractions of pinus roxburgii sarg against pentylenetetrazole induced seizure and maximal electroshock (mes) induced seizures in albino rats\n", "abstract": " Objectives: The aim of the present study was to evaluate the anticonvulsant potential of extract and fractions of Pinus roxburgii Sarg. against Pentylenetetrazole and maximal electroshock (MES) induced seizures in albino rats. Materials and Methods: The ethanol extract (300 and 600 mg/kg dose) and Chloroform, n-Hexane, n-Butanol and Ethylacetate fraction (250 and 500 mg/kg dose) of Pinus roxburgii Sarg. were tested at two doses (minimum and maximum) for its anticonvulsant activity using pentylenetetrazole (PTZ) induced and maximal electroshock (MES) induced seizures in albino rats. Results: There was significant (P< 0.05) reduction in the duration of Tonic hind limb extension (THLE), tonic limb flexion (TLF) and clonic phase observed with extract and fractions but maximum reduction was observed with chloroform and n-Hexane fractions. Against Pentylenetetrazole (PTZ) induced seizure there was significant (P< 0.05) reduction in the duration of myoclonic jerks, duration of clonic phase seen in all treated groups but maximum change was observed with 500 mg/kg Chloroform, 500 mg/kg n-Hexane and 600 mg/kg Extract treated group. Conclusion: The results demonstrated that extract and fraction of Pinus roxburgii Sarg. poses anticonvulsant potential against Pentylenetetrazole induced seizure and maximal electroshock (MES) induced seizures.", "num_citations": "1\n", "authors": ["472"]}
{"title": "The effect of\" Structured Neuro-muscular Postural Training\" in balance modulation and fall prevention strategy in osteoarthritis knee\n", "abstract": " Background and purpose: Postural impairments and functional limitations are linked to osteoarthritis knee adults. The purpose of this study was to identify the balance and postural impairments in osteoarthritis adults and compare the efficacy of two treatment strategies, Structured Neuromuscular Postural Training (SNPT) with conventional treatment (CT). Methods: In a prospective study design, Fifty-seven osteoarthritis knee subjects were evaluated and analyzed for balance variables such as viz. Timed up and go test (TUG), Berg balance test (BBT), Modified WOMAC (MW) and its subgroups pain (WP), stiffness (WS) and physical function (WPF) at the baseline and after 6-weeks of treatment. Data were analyzed to determine treatment efficacy. Results: The application of SNPT had statistical significance for the balance variable TUG, at baseline and 6 weeks follow up for both pre elderly and elderly subjects. Further …", "num_citations": "1\n", "authors": ["472"]}
{"title": "Assessment of genetic variability for various yield and yield attributing traits in okra (Abelmoschus esculentus L. Moench) under Kymore Plateau & Satpura hills agro-climatic …\n", "abstract": " Twenty two quantitative characters in 55 diverse exotic and indigenous genotypes of okra [Abelmoschus esculentus (L.) Moench] collected from NBPGR, New Delhi and 5 standard checks, viz. Phule Utkarsh, Hisar Unnat, VRO-5, VRO-6 and Pusa A4 were evaluated in Randomized Complete Block Design (RCBD) during kharif season of 2011 at Jabalpur (Madhya Pradesh) for estimate of the extent of genetic variability, heritability and genetic advance in Okra. Significant differences among genotypes were observed for all 22 traits under study. Phenotypic co-efficient variation (PCV) agreed closely with the genotypic co-efficient variation (GCV) but the magnitude of PCV was higher than GCV for almost all the characters studied which reflect the influence of environment on the expression of traits. Higher PCV and GCV values were shown by number of branches plant−1, incidence of YVMV, fruit yield plant−1, number …", "num_citations": "1\n", "authors": ["472"]}
{"title": "Investigation of Cu2ZnSnS4 thin film by scanning Kelvin force microscopy\n", "abstract": " CZTS thin film has been grown on Mo-coated soda lime glass by co-sputtering the metal targets and post sulfurization in H2S ambient. The structural, microstructural, compositional and optical properties have been studied using glancing incidence XRD, Raman spectroscopy, SEM, EDS, XRF and UV-Vis spectrophotometry. Local electrical transport measurements using conducting AFM show that for small bias voltage (-0.5 V), the dark negative currents flow mainly through grain boundaries (GBs) rather than grain interior. Kelvin probe force microscopic measurements (local surface potential) indicated positive surface potential in the vicinity of GBs in a Cu-deficient CZTS thin film. All measurements indicated that grain interior to GBs have a smaller effective band gap than the bulk, due to the composition change (Cu-vacancies or CuZn anti site defects) at GBs. Electrical measurement revealed the presence of defects in the CZTS thin film.", "num_citations": "1\n", "authors": ["472"]}
{"title": "Fault Removal Phenomenon Using Different Distribution Functions for Each Release\n", "abstract": " Software is everywhere and has become a major worldwide industry. We find software embedded, for example, in watches, coffee makers, cars, televisions, airplanes, telephones, reservation systems, and medical equipment. Software not only pervades a multitude of products, but also is an important corporate asset, and demand is increasing. With dynamic markets and evolving business models, organizations need to stay agile to maintain and improve their competitive edge. First release of software products includes enough features and functionality to make it useful for the customers. Later, software companies have to come up with up-gradation or add-ons in their software to survive in the market through a series of releases. They plan successive releases by adding new features or new functionalities or try to improve performance of system as compared to previous releases by removing faults from existing software. Removing maximum faults from existing release and delivering reliable software is most important. In this paper we have used different fault removal process based on generalized Erlang model for different releases. The model is validated on real software data set.", "num_citations": "1\n", "authors": ["472"]}
{"title": "Variation in body mass index and their determinants among married women in Uttar Pradesh\n", "abstract": " The body mass index of married women is a high quality sign of a country’s health status as well as economic condition. Nutrition research in India has previously focused on the serious problem of under nutrition related to nutrient deficit and high rates of infection. BMI provide an indicator for supporting to wipe out many preventable diseases. Alteration in nutritional status plays an important role in the course of a person’s health. Hence, BMI can be used as an indicator for nutrition status, and association with some diseases can be expected. This study observes the emerging nutrition transition among 7559 married and currently non–pregnant women aged between 15-49 years and also the differential impact of some demographic, socioeconomic, environmental and health-related factors on the body mass index living in Uttar Pradesh, India. The third wave of National Family Health Survey (2005-06) data provides nationally representative data on women’s weight and height. Average BMI is 21.11 kg/m2, and a turn down tendency in BMI was found during the last about 20 years. Body mass index increased with increasing age, education level of the woman, standard of living index. Lower BMI was especially pronounced among women who were living in rural areas, Hindus, employed women and women who are anemic.", "num_citations": "1\n", "authors": ["472"]}
{"title": "Assessment of Distribution Based SRGM with the Effect of Change-Point and Imperfect Debugging Incorporating Irregular Fluctuations\n", "abstract": " Computer software has progressively turned out to be an essential component in modern technologies. Testability is the probability whether tests will detect a fault, given that a fault in the program exists. How efficiently the faults will be uncovered depends upon the testability of the software. Various researchers have proposed qualitative and quantitative techniques to improve and measure the testability of software. Furthermore, it is well known fact that the progress of software testing is influenced by various uncertainty factors like effort expenditure, skill of test personal, testing tool, defect density and irregular state of software fault-report phenomena on the bug tracking system. Hence, there is an irregular fluctuation in fault detection/removal rate during testing phase. In this paper, distribution based software reliability growth models have been developed by applying Itô type Stochastic Differential Equations in order to incorporate (i) the irregular fluctuation in the fault detection process due to various uncertainty factor during testing phase;(ii) two types of imperfect debugging and (iii) change-point concept. The proposed stochastic differential equation based models have been validated using real data sets. Various comparison criteria results for goodness of fit have also been presented in the paper.", "num_citations": "1\n", "authors": ["472"]}
{"title": "Reclamation of sodic soils (problematic soils) through mulberry plantation\n", "abstract": " Sericulture in north India is a subsidiary crop. Farmers in north western India are not willing to involve their land for mulberry plantation due to limited crops in this region as the farmers mostly belong to below poverty line and do not have large land holdings. Whatever land they have they use it for growing seasonal cash crops. There are only two sericulture crops, one in spring and one in autumn. Each crop was of 25 days duration and hence just for 50 days farmers were not willing to plant mulberry in their one acre or two acre land holding. With this back drop it was known that lakhs of hectares of land were available as waste land as they are salt affected and were not used for agriculture. If this available land could be made to be utilized for sericulture purposes it may help the farmers as well as the environment. In Uttar Pradesh 1.25 million hectares of area are salt affected. Areas falling in Lucknow, Aligarh, Azamgarh, Bareilly, Etah, Etawa, Ghaziabad, Hardoi, Sultanpur, Pratapgarh, Unnao, Kanpur, Meerut and Rae-bareilly are mainly affected by sodicity. Such land are of less use so far as agriculture is concerned. These available waste lands with moderate alkalinity were the target to be utilized for mulberry plantation.(Agar, 2009; Aslam, 2011). Salinization and alkalinization of the soil are serious impediments in obtaining higher crop yields in sizeable land area of the country. According to an estimate more than 7 million hectares of otherwise productive land of the country have virtually gone out of cultivation. Country’s most fertile belt in Punjab, Uttar Pradesh, Delhi and Bihar with an area of about 2.4 million hectares is affected with sodicity …", "num_citations": "1\n", "authors": ["472"]}
{"title": "Comparative antinociceptive study of leaf, bark and seed extracts of neem collected from Aligarh District\n", "abstract": " Neem has attracted worldwide prominence in recent years, owing to its wide range of medicinal properties. Neem has been extensively used in Ayurveda, Unani and Homoeopathic medicine and has become a cynosure of modern medicine. Neem elaborates a vast array of biologically active compounds that are chemically diverse and structurally complex. More than 140 compounds have been isolated from different parts of neem [1-5]. All parts of the neem tree-leaves, flowers, seeds, fruits, roots and bark have been used traditionally for the treatment of inflammation, infections, fever, skin diseases and dental disorders. The medicinal utilities have been described especially for neem leaves. Neem leaves and its constituents have been found to exhibit immunomodulatory, anti-inflammatory [6], antiulcer [7-10], antimalarial [11, 12], antifungal [13-17], antibacterial [18], antiviral [19-22], antioxidant, antimutagenic and anticarcinogenic [23-25] properties. Aqueous extract of neem leaves showed both ulcer protective and ulcer healing effect. Nimbolide isolated from the flowers of neem has been found to have antiproliferative activity against cancer cells [26, 27]. The feeding of neem effect on helmintic worm in sheep [28], significant antihyperglycaemic activity of neem seeds has been found in diabetes mellitus patients [29]. Medicinal importance of this plant encourages us to carryout the comparative antinociceptive activity of different parts (leaves, bark and seeds) of neem extracts.", "num_citations": "1\n", "authors": ["472"]}
{"title": "Quality of chhana prepared from cow milk by chemical and herbal coagulants\n", "abstract": " The present investigation was an attempt to compare the quality of chhana prepared from cow milk by chemical and herbal coagulants. Samples were prepared by using two chemical coagulants (citric acid and calcium lactate) and two herbal coagulants (citrus extract and ginger extract). Maximum yield of chhana was found in ginger extract coagulant. Highest sensory score was obtained from citric acid coagulant. Fat content of chhana was maximum (24.00%) in calcium lactate based chhana. The effect of various coagulants on yield, sensory attributes and chemical composition of chhana was found to be highly significant at 1.0% level of significance.", "num_citations": "1\n", "authors": ["472"]}
{"title": "Prevalence of Trichoderma species in soils of Delhi and its neighbouring states.\n", "abstract": " A survey was conducted from January 2004 to July 2006 to determine the prevalence of different species of Trichoderma in the soils of Delhi delhi Subject Category: Geographic Entities", "num_citations": "1\n", "authors": ["472"]}
{"title": "Genetic variability in african marigold (Tagetes erecta L.).\n", "abstract": " Field experiments were conducted to assess the genetic variability present in 20 marigold (Tagetes erecta tagetes erecta Subject Category: Organism Names", "num_citations": "1\n", "authors": ["472"]}
{"title": "Correlation and path coefficient analysis in African marigold (Tagetes erecta L.).\n", "abstract": " To determine the association between various quantitative traits, an experiment was conducted with 20 germplasm germplasm Subject Category: Miscellaneous", "num_citations": "1\n", "authors": ["472"]}
{"title": "Influence of polyethylene glycol on biomass of Trichoderma species.\n", "abstract": " see more details 6000 (PEG 6000), ie 0.25, 0.5 and 1.0%. As the PEG concentration increased, the wet and dry weights of fungal biomass were affected, but the results were non-significant, while the colony forming units (CFU) and conidial production significantly increased with increase in the concentration of PEG 6000 nutrient medium in both species. The CFU was maximum in T. harzianum, while the number of conidia was minimum in T. viride.", "num_citations": "1\n", "authors": ["472"]}
{"title": "Supply chain design of an electronic industry using lean principles\n", "abstract": " The supply chain of a section of an Indian electronic industry has been analysed and designed integrating suppliers, manufacturers, distributors and customers using lean principles. The models have been developed both at the strategic and operational level and integrated to achieve overall optimisation instead of individual echelon optimisation. The model solution gives the optimum values of various cost components per product. The dominant cost components have been targeted for reduction using lean principles viz. Time compression approach in production cycle and JIT approach in raw material procurement cycle. Finally, it is observed that the implementation of lean principles reduces per product costs considerably.", "num_citations": "1\n", "authors": ["472"]}
{"title": "Management of Kitibha (Psoriasis) by Some Indigenous Drugs\n", "abstract": " Kitibha is a type of kshudra kushtha described in different Ayurvedic classics. It is a Vata-Kaphaja disorder. The clinical symptoms of Kitibha described in Ayurveda resembles with the clinical symptoms of Psoriasis. The clinical features of Kitibha described by Kashyapa represents remission, relapse and seasonal variation, which is present in Psoriasis. It is one of the most common dermatological problems of unknown etiology. It is a chronic, genetically determined, inflammatory and proliferative disease characterized by dry, well-circumscribed, silvery scaling papules and plaques of various sizes with spontaneous remission, relapse and seasonal variation. Lesions distributed all over the body with silvery scales, covering loops of dilated superficial capillaries underneath which are presented as tiny bleeding points on removal of scales (Auspitz's sign). It affects about 2% of world population. Various races and …", "num_citations": "1\n", "authors": ["472"]}
{"title": "Effect of inorganic fertilizers on collar rot of lentil caused by Sclerotium rolfsii.\n", "abstract": " A pot experiment was conducted to determine the influence of inorganic fertilizers on collar rot lentil (Lens culinaris lens culinaris Subject Category: Organism Names", "num_citations": "1\n", "authors": ["472"]}
{"title": "Dual inoculation of Rhizobivm and vesicular arbuscular mycorrhizal (VAM) with phosphorus in mung bean (Vigna radiata).\n", "abstract": " A field experiment was conducted to study the role of Rhizobium rhizobium Subject Category: Organism Names", "num_citations": "1\n", "authors": ["472"]}
{"title": "Response of sulphur, PSB and growth regulators on productivity of groundnut (Arachis hypogaea L.) under rainfed conditions\n", "abstract": " The low level of productivity of groundnut in India has been ascribed to several constraints. Poor fertility status of soil is considered to be the major problem. Sulphur is a constituent of protein and plays an important role in oil synthesis. Since groundnut is rich in both oils and proteins, requirement of sulphur for this crop is substantial. Sulphur fertilization once again will have to be utilized judiciously to maintain and improve the soil fertility and productivity. Groundnut being a legume oil seed crop its P and S requirement is quite high. In most of the groundnut growing areas, the levels of available sulphur reaches below the limit and groundnut crops is bound to suffer on account of sulphur deficienty (Tiwari and Pathak, 1989). Hence an attempt was made to investigate the response of groundnut to sulphur, PSB and growth regulators on productivity of groundnut under rainfed conditions.", "num_citations": "1\n", "authors": ["472"]}
{"title": "A rare injury of distal radial and ulnar epiphysis.\n", "abstract": " Radial epiphyseal injuries are common. Ulnar epiphyseal injury is responsible for majority of cases of growth arrest and is commonly missed. The occurrence of associated ulnar epiphyseal injury is very rare and a concomitant type II injury of both radial and ulnar epiphyseal injury is also uncommon. A four-year follow-up of a 10-year-old boy with the above injury at right wrist is being reported in this article. At four years he has a negative ulnar variance but with excellent function and cosmesis.", "num_citations": "1\n", "authors": ["472"]}
{"title": "Effect of antitranspirants on photosynthesis and nitrate reductase activity in wheat under water stress condition\n", "abstract": " Results revealed that under soil water stress condition, spraying of antitranspirants on wheat leaves increased photosynthesis, nitrate reductase activity and reduced the transpiration rate at flowering stage which resulted in higher grain yield. Foliar application of abscisfic acid (ABA) 5 ppm, chloroethyl trimethylchoride (CCC) 1000 ppm, acetyl salicylic acid (ASA) 250 ppm and Silicon 100 ppm significantly increased the photosynthesis, stomatal resistance and decreased the transpiration rate over untreated control under dry situation and exhibited higher NR-activity in leaf than untreated control at pre and post-anthesis stages while minimum NR-activity was recorded under the application of phenyl mercuric acid (PMA) at both the stages of plant growth.", "num_citations": "1\n", "authors": ["472"]}
{"title": "Performance of grain sorghum (Sorghum bicolor) genotypes under rainfed conditions at varying fertility levels\n", "abstract": " A field experiment was carried out during rainy season of 1992-93 at Livestock Research Centre, Pantnagar, to study the performance of grain sorghum (Sorghum bicolor (L.) Moench) genotypes under tainted conditions at varying fertility levels. At harvest, all growth and yield parameters, grain and stover yields, net returns and benefit : cost ratio improved significantly with increased level of N and P, except 1,000-seed weight during both the years. N-100, P-50 (N ' 100 kg/ha + P '' 50 kg/ha) gave the highest values of all characters and also recorded an average of 32.4, 14.5, 22.3, 41.8, 32.6, 39.0 and 10.5% higher panicle weight/plant, grains/panicle, grain weight/ plant, grain yield, stover yield, net returns/ha and benefit: cost ratio respectively compared with N-20 P-10. Hybrid 'PJH 58' out-yielded all other genotypes. 'PJH 58' and 'PJH 55' could be used for maximum grain and stover yields with the application of 80 …", "num_citations": "1\n", "authors": ["472"]}
{"title": "Effect of different herbicides on the yield and yield contributing characters of chickpea (Cicer arietinum L.)\n", "abstract": " Effect of different herbicides on the yield and yield contributing characters of chickpea (Cicer arietinum L.) FAO_logo home-icon English Español Français العربية 中文 Русский home-icon Translate with Google Access the full text NOT AVAILABLE Lookup at Google Scholar google-logo Bibliographic information Language : English Type : Journal Article In AGRIS since : 1985 Volume : 6 Issue : 1 Start Page : 53 End Page : 54 All titles : \" Effect of different herbicides on the yield and yield contributing characters of chickpea (Cicer arietinum L.) \" Other : \" 3 ref. \" Save as: AGRIS_AP RIS EndNote(XML) Effect of different herbicides on the yield and yield contributing characters of chickpea (Cicer arietinum L.) Loading... Paper Written Paper Effect of different herbicides on the yield and yield contributing characters of chickpea (Cicer arietinum L.) [1983] Mittal, M. Singh, OP (Govind Ballabh Pant Univ. of Agriculture and , (India)-…", "num_citations": "1\n", "authors": ["472"]}
{"title": "Determination of certain asymptotic constants related with the post-Widder inversion of Laplace transform\n", "abstract": " Let N, R+ and f, respectively, denote the set of natural numbers, the interval (0,~ o) and the Laplace transform of a function f. Let p be a fixed integer. The n-th Post--Widder operator Ln, x is defined by", "num_citations": "1\n", "authors": ["472"]}
{"title": "Stable genotypes for boldness in soybean.\n", "abstract": " A total of 32 types were evaluated for 100-seed weight seed weight Subject Category: Propertiessee more details under three artificial environments (two were created by sowing on two different dates and the third was created by the application of fertilizer). HM1 was stable, had the highest 100-seed weight and was most suited for growing in favourable environments. DS73-16 had the smallest seeds seeds Subject Category: Anatomical and Morphological Structures", "num_citations": "1\n", "authors": ["472"]}
{"title": "Tissue specific biochemical alterations prior to spinning in the eri-silkworm, Philosamia ricini\n", "abstract": " Silkgland, fatbody, hemolymph and midgut of eri-silkworm present tissue specific turnover in their biochemical correlates in preparation for spinning of the cocoon which is followed by larval-pupal transformation.", "num_citations": "1\n", "authors": ["472"]}
{"title": "Tissue Specific Glucose-Trehalose Variations Prior to Spinning in the Eri-Silkworm Philosamia ricini\n", "abstract": " A sharp rise in trehalose level of haemolymph is observed towards the end of 4th instar accompanied with sudden fall of the sugar in fat body during the same period, but after moulting blood trehalose abruptly decreases. Whereas, blood glucose level is maintained constant throughout life span of both the instars. Silkgland of 5th instar larvae presents a consistent gradual increase in glucose-trehalose levels reaching to the maximum prior to spinning with a higher value for trehalose than glucose which can be attributed to the decrease in blood trehalose level during the period.", "num_citations": "1\n", "authors": ["472"]}