{"title": "A reusable software component-based development process model\n", "abstract": " The concept of component-based development (CBD) is widely used in software (SW) development. CBD facilitates reuse of the existing components with the new ones. The well known architectures of CBD are ActiveX, common object request broker architecture (CORBA), remote method invocation (RMI) and simple object access protocol (SOAP). The objective of this paper is to support practice of CBD by comparing it with traditional software development. This paper also evaluates object oriented (OO) process model and proposes a novel process model for CBD. The importance of repository has also been discussed.", "num_citations": "77\n", "authors": ["1370"]}
{"title": "Agile software development methodology for medium and large projects\n", "abstract": " Extreme programming (XP) is one of the most widely used agile methodologies for software development. It intends to improve software quality and responsiveness to changing customer requirements. Despite the facts that the use of XP offers a number of benefits and it has been a widely used agile methodology, XP does not offer the same benefits when it comes to medium and large software projects. Some of the reasons for this are weak documentation, lack of strong architecture and ignorance to risk awareness during the software development. Owing to the ever-increasing demand of agile approaches, this study addresses the problem of XP's ability to handle medium and large projects. Most of the companies that employ XP as a development methodology for medium and large projects face this problem, which echoes the importance of this problem. To address this problem, in this study XP model is …", "num_citations": "72\n", "authors": ["1370"]}
{"title": "A Comprehensive Study of Commonly Practiced Heavy & Light Weight Software Methodologies\n", "abstract": " Software has been playing a key role in the development of modern society. Software industry has an option to choose suitable methodology/process model for its current needs to provide solutions to give problems. Though some companies have their own customized methodology for developing their software but majority agrees that software methodologies fall under two categories that are heavyweight and lightweight. Heavyweight methodologies (Waterfall Model, Spiral Model) are also known as the traditional methodologies, and their focuses are detailed documentation, inclusive planning, and extroverted design. Lightweight methodologies (XP, SCRUM) are, referred as agile methodologies. Light weight methodologies focused mainly on short iterative cycles, and rely on the knowledge within a team. The aim of this paper is to describe the characteristics of popular heavyweight and lightweight methodologies that are widely practiced in software industries. We have discussed the strengths and weakness of the selected models. Further we have discussed the strengths and weakness between the two opponent methodologies and some criteria is also illustrated that help project managers for the selection of suitable model for their projects.", "num_citations": "68\n", "authors": ["1370"]}
{"title": "Novel hybrid model: Integrating scrum and XP\n", "abstract": " Scrum does not provide any direction about how to engineer a software product. The project team has to adopt suitable agile process model for the engineering of software. XP process model is mainly focused on engineering practices rather than management practices. The design of XP process makes it suitable for simple and small size projects and not appropriate for medium and large projects. A fine integration of management and engineering practices is desperately required to build quality product to make it valuable for customers. In this research a novel framework hybrid model is proposed to achieve this integration. The proposed hybrid model is actually an express version of Scrum model. It possesses features of engineering practices that are necessary to develop quality software as per customer requirements and company objectives. A case study is conducted to validate the proposal of hybrid model. The results of the case study reveal that proposed model is an improved version of XP and Scrum model.", "num_citations": "47\n", "authors": ["1370"]}
{"title": "Implementation of risk management with SCRUM to achieve CMMI requirements\n", "abstract": " Majority of the software development companies are practicing agile methods to develop high quality products. SCRUM is one of the most widely used agile methods. Capability maturity model integration (CMMI) is one of the quality standards for software companies. In this research, we propose an implementation of risk management with SCRUM in order to make it compatible with CMMI. We conducted a survey to validate the proposed solution. Questionnaire includes 20 questions that are divided into three goals. The proposed solution is validated through survey with support of 70.94%. We anticipate that the proposed solution will enable software companies to achieve CMMI and it will also improve the quality of software products.", "num_citations": "31\n", "authors": ["1370"]}
{"title": "A comparison of model view controller and model view presenter\n", "abstract": " Web application frameworks are managed by using different design strategies. Design strategies are applied by using different design processes. In each design process, requirement specifications are changed in to different design model that describe the detail of different data structure, system architecture, interface and components. Web application frame work is implemented by using Model View Controller (MVC) and Model View Presenter (MVP). These web application models are used to provide standardized view for web applications. This paper mainly focuses on different design aspect of MVC and MVP. Generally we present different methodologies that are related to the implementation of MVC and MVP and implementation of appropriate platform and suitable environment for MVC and MVP.", "num_citations": "31\n", "authors": ["1370"]}
{"title": "HYBRID SOFTWARE DEVELOPMENT APPROACH FOR SMALL TO MEDIUM SCALE PROJECTS: RUP, XP & SCRUM\n", "abstract": " Software industry is using various customized models such as Rational Unified Process (RUP), eXtreme Programming (XP) and SCRUM. XP and Scrum are most widely practiced and documented agile models. Both XP and Scrum work well for small projects whereas RUP is suitable for large projects. A fine integration of these models is required to deal with small, medium and large projects. This paper is written to highlight some of the characteristics, strengths and weaknesses of RUP, XP and SCRUM. In this research, a novel framework is proposed. The proposed framework is a fine combination of strengths of RUP, XP and SCRUM in order to achieve high quality software and enhance the team productivity.", "num_citations": "30\n", "authors": ["1370"]}
{"title": "Usability of Cloud Computing to Improve Higher Education\n", "abstract": " Cloud computing as a new paradigm has grown from a promising idea to one of the fastest research and development paradigm in education sector. It is a hot research area that applies in all sectors where we require high performance and fast access to resources and services. Cloud computing usability in education is wide-ranging, as acknowledged by many educational institutions around the world. This paper attempts to address the need for utilizing cloud computing in higher education in Kingdom of Saudi Arabia for all the disciplines to raise its level and solve the obstacles that faced the learning process. In addition, cloud computing facilitates educators and students to be more experienced in cloud computing and it prepares them to get benefits of usefulness to become more motivated and effective. Survey is used as a research design to validate the proposed solution. The results show that the proposal to improve higher education is highly supported by the professionals working in the industry and academia.", "num_citations": "29\n", "authors": ["1370"]}
{"title": "An adaptive software development process model\n", "abstract": " The concept of agile process models has gained great popularity in software (SW) development community in past few years. Agile models promote fast development. This property has certain drawbacks, such as poor documentation and bad quality. Fast development promotes use of agile process models in small-scale projects. This paper modifies and evaluates extreme programming (XP) process model and proposes a novel adaptive process mode based on these modifications.", "num_citations": "27\n", "authors": ["1370"]}
{"title": "The Proposed L-Scrumban Methodology to Improve the Efficiency of Agile Software Development\n", "abstract": " Agile software development methodologies gaining the attention in the field of software engineering. There are several methods of agile such as Scrum, Lean, and Kanban. Scrum methodology divides the product into series of sprints. Lean is agile toolkit which has seven principles that facilitate: eliminating the wastes, delivering fast, and improving value for the final customer. Kanban is a visual method that can help in managing the production. To take the advantages of the following methodologies: Lean, Scrum, and Kanban we can integrate them together thus, the result will be a new methodology that can contribute in enhancing and improving the efficiency of the software development process, which is the aim of this thesis. An integrated methodology that integrating Scrum, Kanban, and Lean methodologies to yield a comprehensive agile methodology called L-ScrumBan has been proposed. The validation of the proposed methodology has been done through a survey by using a questionnaire; the survey results confirmed the efficiency of the proposed methodology.", "num_citations": "21\n", "authors": ["1370"]}
{"title": "Proposal of Enhanced Extreme Programming Model\n", "abstract": " Extreme programming is one of the commonly used agile methodologies in software development. It is very responsive to changing requirements even in the late phases of the project. However, quality activities in extreme programming phases are implemented sequentially along with the activities that work on the functional requirements. This reduces the agility to deliver increments continuously and makes an inverse relationship between quality and agility. Due to this relationship, extreme programming does not consume enough time on making extensive documentation and robust design. To overcome these issues, an enhanced extreme programming model is proposed. Enhanced extreme programming introduces parallelism in the activities' execution through putting quality activities into a separate execution line. In this way, the focus on delivering increments quickly is achieved without affecting the quality of the final output. In enhanced extreme programming, the quality concept is extended to include refinement of all phases of classical extreme programming and creating architectural design based on the refined design documents.", "num_citations": "19\n", "authors": ["1370"]}
{"title": "Empirical evaluation of the proposed exscrum model: Results of a case study\n", "abstract": " Agile models promote fast development. XP and Scrum are the most widely used agile models. This paper investigates the phases of XP and Scrum models in order to identify their potentials and drawbacks. XP model has certain drawbacks, such as not suitable for maintenance projects and poor performance for medium and large-scale development projects. Scrum model has certain limitations, such as lacked in engineering practices. Since, both XP and Scrum models contain good features and strengths but still there are improvement possibilities in these models. Majority of the software development companies are reluctant to switch from traditional methodologies to agile methodologies for development of industrial projects. A fine integration, of software management of the Scrum model and engineering practices of XP model, is very much required to accumulate the strengths and remove the limitations of both models. This is achieved by proposing an eXScrum model. The proposed model is validated by conducting a controlled case study. The results of case study show that the proposed integrated eXScrum model enriches the potentials of both XP and Scrum models and eliminates their drawbacks.", "num_citations": "19\n", "authors": ["1370"]}
{"title": "Improvement of key problems of software testing in quality assurance\n", "abstract": " Quality assurance makes sure the project will be completed based on the previously approved specifications, standards and functionality. It is required without defects and possible problems. It monitors and tries to progress the development process from the start of the project. Software Quality Assurance (SQA) is the combination of the entire software development process, which includes software design, coding, source code control, code review, change management, configuration management and release management. In this paper we describe the solution for the key problems of software testing in quality assurance. The existing software practices have some problems such as testing practices, attitude of users and culture of organizations. All these tree problems have some combined problems such as shortcuts in testing, reduction in testing time, poor documentation etc. In this paper we are recommending strategies to provide solution of the said problems mentioned above.", "num_citations": "18\n", "authors": ["1370"]}
{"title": "Increasing ERP Implementation Success Ratio by Focusing on Data Quality & User Participation\n", "abstract": " ERP systems projects have been spread widely across many organizations in general and small and medium enterprises (SMEs) in particular. Regrettably, failures were the results for most of the ERP implementations. As a result of that, critical failure and success factors (CFFs & CSFs) have been identified with the help of large number of researches. Accordingly, data quality and user participation were categorized as two of the most critical factors that threaten the success of the ERP projects. In order to raise the success percentage of such projects, a data cleansing methodology and some guidelines for user participation have been proposed.", "num_citations": "17\n", "authors": ["1370"]}
{"title": "Empirical estimation of hybrid model: A controlled case study\n", "abstract": " Scrum and Extreme Programming (XP) are frequently used models among all agile models whereas Rational Unified Process (RUP) is one of the widely used conventional plan driven software development models. The agile and plan driven approaches both have their own strengths and weaknesses. Although RUP model has certain drawbacks, such as tendency to be over budgeted, slow in adaptation to rapidly changing requirements and reputation of being impractical for small and fast paced projects. XP model has certain drawbacks such as weak documentation and poor performance for medium and large development projects. XP has a concrete set of engineering practices that emphasizes on team work where managers, customers and developers are all equal partners in collaborative teams. Scrum is more concerned with the project management. It has seven practices namely Scrum Master, Scrum teams, Product Backlog, Sprint, Sprint Planning Meeting, Daily Scrum Meeting and Sprint Review. Keeping above mentioned context in view, this paper intends to propose a hybrid model naming SPRUP model by combining strengths of Scrum, XP and RUP by eliminating their weaknesses to produce high quality software. The proposed SPRUP model is validated through a controlled case study.", "num_citations": "16\n", "authors": ["1370"]}
{"title": "Measuring the Effect of CMMI Quality Standard on Agile Scrum Model\n", "abstract": " Agile development gets more appreciation from the market due to the flexible nature and more productivity. Among the Agile processes, Scrum gives better management of the processes, which are practiced in an organization. Though Scrum process model have several features and strengths but it still lacks in management and quality. This research deals with the improvement of Scrum processes for better management and to improve the quality of the software using the infusion of different practices from internationally renowned quality standards. Survey is used to validate the proposed framework. Statistical analysis shows that the proposed research has a profound effect on Scrum model to develop high quality software.", "num_citations": "15\n", "authors": ["1370"]}
{"title": "Global Software Development Geographical Distance Communication Challenges\n", "abstract": " Global Software Development (GSD) is a major direction in software engineering. There is interest in applying scrum practices in distributed projects. Project stakeholder distribution in GSD is represented by geographical distance, which generates challenges for communication. This paper is written to evaluate the effect of scrum practices in mitigating geographical distance-based communication challenges. We also suggest some mitigation strategies those are supported by our survey respondents. This study finds that scrum provides advantage in mitigating geographical distance-based GSD communication challenges. This research is a reference guide for other researchers to validate and extend current knowledge about Scrum practices ie, how it can be used to mitigate geographical distance-based communication challenges in GSD.", "num_citations": "14\n", "authors": ["1370"]}
{"title": "Scrum of scrums solution for large size teams using scrum methodology\n", "abstract": " Scrum is a structured framework to support complex product development. However, Scrum methodology faces a challenge of managing large teams. To address this challenge, in this paper we propose a solution called Scrum of Scrums. In Scrum of Scrums, we divide the Scrum team into teams of the right size, and then organize them hierarchically into a Scrum of Scrums. The main goals of the proposed solution are to optimize communication between teams in Scrum of Scrums; to make the system work after integration of all parts; to reduce the dependencies between the parts of system; and to prevent the duplication of parts in the system.", "num_citations": "14\n", "authors": ["1370"]}
{"title": "The Proposal of Scaling the Roles in Scrum of Scrums for Distributed Large Projects\n", "abstract": " Scrum of scrums is an approach used to scale the traditional Scrum methodology to fit for the development of complex and large projects. However, scaling the roles of scrum members brought new challenges especially in distributed and large software projects. This paper describes in details the roles of each scrum member in scrum of scrum to propose a solution to use a dedicated product owner for a team and inclusion of sub-backlog. The main goal of the proposed solution is to optimize the role of product owner for distributed large projects. The proposed changes will increase cohesiveness among scrum teams and it will also eliminate duplication of work. Survey is used as a research design to evaluate the proposed solution. The results are found encouraging supporting the proposed solution. It is anticipated that the proposed solution will help the software companies to scale Scrum methodology effectively for large and complex software projects.", "num_citations": "13\n", "authors": ["1370"]}
{"title": "Impact of design patterns on software maintainability\n", "abstract": " This paper mainly studies the effect of design patterns on the Software maintainability. Design patterns describe solutions for common design problems and they were introduced to improve software quality and accelerate software development. However, there are some difficulties to choose an optimal pattern adapted to a certain application and problem. So until now the results on the effect of design patterns on software quality are controversial. In this context, we propose a tool for design pattern guided that retrieves the appropriate pattern with respect to software maintainability from a repository of patterns. It measures the maintainability of design pattern by some metrics and candidate the more maintainable pattern to the designer or developer. It provides a support for decision making during system design and refactoring. As the results, the decision of applying a certain design pattern is usually a tradeoff since the effect of design pattern on software maintainability is influenced by some factors such as the pattern size and the prior expertise of the developer.", "num_citations": "13\n", "authors": ["1370"]}
{"title": "A framework for next generation mobile and wireless networks application development using hybrid component based development model\n", "abstract": " The IP Multimedia Subsystems (IMS) that features in Next Generation Networks (NGN) offers the application developer (third party) abilities to map out applications over mobile telecommunication infrastructure. The IMS comes about with APIs useful for mobile application developers to create applications to meet end-users' demands and comply with the provider's infrastructure set up at the same time. Session Initiation Protocol (SIP) is a signaling protocol for this architecture. It is used for establishing sessions in IP network, making it an ideal candidate for supporting terminal mobility in to deliver the services with improved Quality of Services (QOS). The realization of IMS's virtues as far as software design is concerned is faced by lack of standardizations and methodologies throughout application development process. In this paper, we report on progress on ongoing research by our group toward putting together a platform as a testbed used for NGN application development. We examine a novel component based development model used for SIP based mobile applications. The developed model is to be used as framework for general purpose application development over the testbed. We apply this model on MObile Mass EXamination (MOMEX) system that is an application attracting the interest of educational authorities around the world due to its potential convenience.", "num_citations": "13\n", "authors": ["1370"]}
{"title": "A Proposal of Electronic Examination System to Evaluate Descriptive Answers\n", "abstract": " Electronic (E) examination system is not a novel idea in the educational domain. E-examination systems are used to deal with objective assessments from last several years. Almost, all the top universities of world are using general purpose/customized solutions to manage E-examination systems like SAP, Oracle and Blackboard. The aim of this research is two folds. First part of this research will deal with the development of an E-question bank system to automatically generate the question paper. The second part of this research will deal with to propose subjective E-examination system not only for the faculty of the King Abdulaziz University but it will be beneficial for the faculties of other universities inside and outside of Kingdom of Saudi Arabia. This research also supports to green IT. The proposed systems will simplify the assessment process by automatic setting and marking of exams. It will significantly reduce the complex paper setting and assessment processes by cutting down the time, cost and saving huge numbers of papers. Survey and case study will be used as research design to validate the E-examination system. Multi-tier applications architecture (client, web, and business) will be adopted as per the needs of case study. A subjective E-examination system will be developed and tested to check its practicality for the students of King Abdulaziz University. It is anticipated that the proposed systems will significantly facilitate to instructors and King Abdulaziz University to save time, cost, resources, increase efficiency and improve productivity of exam setting and assessments.", "num_citations": "12\n", "authors": ["1370"]}
{"title": "Scheme of Global Scrum Management Software\n", "abstract": " Many software development companies faced the challenge of coupling agile models and global software development in distributed projects. The challenges are related to the communication, management and control of the development process. These challenges emerged because global development involves developers from different geographical locations, time zones and with different cultures. Coupling agile models and global software development seems impossible at first glance, as they require frequent communications, rapid development, and resources management of distributed teams. However, researchers proposed several solutions and advices included tailoring of agile practices and addition of non-agile practices. Nevertheless, further efforts were needed to activate and unify these solutions. This paper introduces a new web based project management system for Scrum projects called global scrum management. It is a web application that manages Scrum process from planning phase to delivery of the last product increment. Moreover, the application features social networks functionalities to provide seamless communication, collaboration and knowledge transferring to the distributed team members. Also, developers' actions to the sprint tasks, including updating task status, will be reflected to the burn down charts of the sprint and product backlog instantly. Several diagrams are provided in this paper to explain the solution including UML diagrams.", "num_citations": "12\n", "authors": ["1370"]}
{"title": "Evaluation of the design metric to reduce the number of defects in software development\n", "abstract": " Software design is one of the most important and key activities in the system development life cycle (SDLC) phase that ensures the quality of software. Different key areas of design are very vital to be taken into consideration while designing software. Software design describes how the software system is decomposed and managed in smaller components. Object-oriented (OO) paradigm has facilitated software industry with more reliable and manageable software and its design. The quality of the software design can be measured through different metrics such as Chidamber and Kemerer (CK) design metrics, Mood Metrics & Lorenz and Kidd metrics. CK metrics is one of the oldest and most reliable metrics among all metrics available to software industry to evaluate OO design. This paper presents an evaluation of CK metrics to propose an improved CK design metrics values to reduce the defects during software design phase in software. This paper will also describe that whether a significant effect of any CK design metrics exists on total number of defects per module or not. This is achieved by conducting survey in two software development companies.", "num_citations": "11\n", "authors": ["1370"]}
{"title": "Novel Framework for Automation Testing of Mobile Applications using Appium\n", "abstract": " Testing is an important phase in system development to improve the quality, reliability, and performance of software systems. As more and more mobile applications are developed, testing and quality assurance are vital to developing successful products. Users are widely opening browsers on mobiles to interact with web pages. It is important to ensure that our web application will be compatible with mobile browsers and applications. There is a need for a framework that can be applied to test different mobile browsers and applications. This paper proposes a novel framework for automation testing of mobile applications using Appium tool. The novel framework uses automation testing to reduce effort and speed up the process of automated testing on a mobile device. Survey is conducted to validate the proposed framework.", "num_citations": "10\n", "authors": ["1370"]}
{"title": "A novel model for cloud based mobile learning system\n", "abstract": " Mobile learning (M-learning) becomes revolutionary way to educate the world with the mass advancement in information and communications technology (ICT). It is difficult to deal with m-learning due to increasing number of users, services, education contents and resources and modes to deploy. Cloud computing, with its dynamic scalability and virtualized resources usage, is widely deployed for several applications in many organizations. It has a significant impact in the educational and learning environment. This paper presents a new model for mobile learning system in cloud computing environment that is enriched with high performance computing (HPC) and graphical processing unit (GPU) cluster infrastructure. This model aggregates the power with new technologies to implement M-leaning process more effective with high performance and quick response.", "num_citations": "10\n", "authors": ["1370"]}
{"title": "Comparative Study of Software Estimation Techniques\n", "abstract": " Many information technology firms among other organizations have been working on how to perform estimation of the resources such as fund and other resources during software development processes. Software development life cycles require lot of activities and skills to avoid risks and the best software estimation technique is supposed to be employed. Therefore, in this research, a comparative study was conducted, that consider the accuracy, usage, and suitability of existing methods. It will be suitable for the project managers and project consultants during the whole software project development process. In this project technique such as linear regression; both algorithmic and non-algorithmic are applied. Model, composite and regression techniques are used to derive COCOMO, COCOMO II, SLIM and linear multiple respectively. Moreover, expertise-based and linear-based rules are applied in non-algorithm methods. However, the technique needs some advancement to reduce the errors that are experienced during the software development process. Therefore, this paper in relation to software estimation techniques has proposed a model that can be helpful to the information technology firms, researchers and other firms that use information technology in the processes such as budgeting and decision-making processes.", "num_citations": "9\n", "authors": ["1370"]}
{"title": "Adaptive Framework to Manage Multiple Teams Using Agile Methodologies\n", "abstract": " The increased demand of agile methods results in challenging and unique problems, one of which is the unsuitability of agile methods for software development companies, particularly those with multiple teams. Secondly, agile methods are silent regarding how to achieve long-term organizational goals within the umbrella of agile software engineering. Considering these software industry problems, a new contemporary learning-based adaptive framework is proposed in the domain of agile methods. The proposed framework will help software companies to achieve long-term organizational goals. It is anticipated that the proposed framework will increase employee satisfaction by improving their technical skills and interpersonal communication capabilities using contemporary learning and knowledge-sharing activities. A survey is conducted from multinational software companies to validate the proposed adaptive framework, and the results are notably supportive and encouraging.", "num_citations": "9\n", "authors": ["1370"]}
{"title": "Novel Approach to Solve Resource Constrained Project Scheduling Problem (RCPSP)\n", "abstract": " In this paper, resource constrained project scheduling problem is taken and solved using genetic algorithm. This algorithm solves the problem as a whole in software development, with the limited resource the project has to be scheduled to the team members. The main aim is to schedule and optimize the resource to complete the project within time. Due to resource constraint environment, the complexity of solving the algorithm increases exponentially. So the traditional methods are not suitable to solve the resource constraint problem. The Genetic Algorithm is taken to solve the multiple resource constraints project scheduling needs. This typical NP-hard problem is solved via mathematical model via genetic algorithm. Software development projects were considered to be resource constrained and project scheduling solution makes the algorithm time efficient.", "num_citations": "9\n", "authors": ["1370"]}
{"title": "The Proposed Methods to Improve Teaching of Software Engineering\n", "abstract": " The use of software is an essential part of our modern lives. Hence, this increases the importance of studying Software Engineering (SE) course. In general, the software engineering graduates usually lack the necessary skills, expertise, abilities, and sufficient knowledge when beginning their careers in the software industry. Due to that, a majority of students find it difficult to find relevant jobs. This paper proposes novel methods to teach SE course to improve the teaching and enhance knowledge and skills of students. It is proposed to include: identifying the course learning objectives (CLOs) and the required skills of the SE course, combining cooperative learning and mastery learning strategies to teaching software engineering, using social media to teach SE course, and establish the OSES in an educational institution. The goal of this paper is to improve the quality of SE teaching and facilitate students learning to prepare them for their future careers. Qualitative technique is used as a research design to evaluate the proposed solution. The results indicate that this proposal is supported by the majority of professionals working in the academia and industry.", "num_citations": "9\n", "authors": ["1370"]}
{"title": "Scrum practices and global software development\n", "abstract": " Global software development (GSD) is one of the emerging areas of software engineering. Stakeholders are distributed located that brings into several challenges to coordinate and collaborate effectively. Scrum is one the widely practiced agile methodologies. Majority of the software development companies showed a great interest from last few years to apply Scrum methodology in distributed development to solve the coordination and communication problems. Although Scrum contains good features and strengths but still there are improvement possibilities to solve the problems of coordination and collaboration in GSD. Majority of software development companies face the problems of coordination and communication in GSD projects. This paper proposes a novel solution to mitigate the coordination and communication challenges of GSD projects. The survey is used as a research methodology to evaluate the proposed solution. The proposed solution is supported by 62.24%. We anticipate that the proposed solution will help the software development companies to mitigate the coordination and communication challenges of GSD projects.", "num_citations": "9\n", "authors": ["1370"]}
{"title": "Seamless long term learning in agile teams for sustainable leadership\n", "abstract": " Seamless and continuous support for long term organizational learning needs is essential for long lasting progress of the organization. Agile process model provides an excellent opportunity to cater that specific problem and also helps in motivation, satisfaction, coordination, presentation and technical skills enhancement of agile teams. This long term learning process makes organization to sustain their current successes and lead both organization and team members to successful and dynamic market leaders.", "num_citations": "9\n", "authors": ["1370"]}
{"title": "Novel Framework to Improve Communication and Coordination among Distributed Agile Teams\n", "abstract": " This paper discusses the roles of communication and coordination (C&C) in the agile teams. C&C are important activities that a project manager has to deal with tactically during the development of software projects to avoid the consequences. Their importance further increases especially in case of distributed software development (DSD). C&C are considered as project drivers to accomplish a project successfully within budget and schedule. There are several issues associated to poor C&C those can lead to fail software projects such as budget deficit, delay in delivery, conflicts among team members, unclear goals of project and architectural, technical and integration dependencies. C&C issues are critical and vital for collocated teams but their presences in distributed teams are disastrous. Scrum is one of the most widely practiced agile models and it is gaining further popularity in the agile community. Therefore, a novel framework is proposed to address the issues that are associated to C&C using Scrum methodology. The proposed framework is validated through a questionnaire. The results are found supportive to reflect that it will help to resolve the C&C issues effectively and efficiently.", "num_citations": "8\n", "authors": ["1370"]}
{"title": "Estimation of the New Agile XP Process Model for Medium-Scale Projects Using Industrial Case Studies\n", "abstract": " Agile is one of the terms with which software professionals are quite familiar. Agile models promote fast development to develop high quality software. XP process model is one of the most widely used and most documented agile models. XP model is meant for small-scale projects. Since XP model is a good model, therefore there is need of its extension for the development of medium and large-scale projects. XP model has certain drawbacks such as weak documentation and poor performance while adapting it for the development of medium and large-scale projects having large teams. A new XP model is proposed in this paper to cater the needs of software development companies for medium-scale projects having large teams. This research may prove to be step forward for adaptation of the proposed new XP model for the development of large-scale projects. Two independent industrial case studies are conducted to validate the proposed new XP model handling for small and medium scale software projects, one case study for each type of project.", "num_citations": "8\n", "authors": ["1370"]}
{"title": "Evaluating the Quality of Proposed Agile XScrum Model\n", "abstract": " The software companies are practicing XP and Scrum models from last several years. XP lacks in management practices whereas Scrum is weak in engineering practices. Due to continually promising need of agile development, this research tackles the problems of XP and Scrum by integrating them to enrich the strengths of XP and Scrum and suppress their limitations. The previous attempts provide little effective empirical evidence regarding the integration of XP and Scrum. Therefore, there is a pressing need to provide empirical evidence for the integration of XP and Scrum to show its usefulness developing the software projects. The same is accomplished by proposing XScrum model. Another goal of this paper is to analyze the quality of proposed XScrum with existing XP and Scrum. The proposed XScrum is validated by performing three case studies for three industrial projects and the results are described in the paper. The results are presented using quantitative and qualitative data. The results provide empirical evidence that there is a significant improvement in quality of proposed XScrum as compared to the existing XP and Scrum.", "num_citations": "7\n", "authors": ["1370"]}
{"title": "Business Process Re-Engineering in Public Administration of Kingdom of Saudi Arabia\n", "abstract": " The government of Saudi Arabia is in the phase of transformation. Business process reengineering (BPR) can play a vital role in assessing this conversion. BPR methodologies provide ways to optimize the use of resources while maintaining high-quality services. The aim of this paper is to investigate the introduction of BPR in Saudi Arabia public sector. A framework is proposed to transform change using a knowledge based. The proposed solution is validated through survey. The results of the survey show that Saudi Governmental Agencies acquire the power to implement the BPR successfully especially if it is implemented with knowledge management and the BPR movement started at small scale.", "num_citations": "7\n", "authors": ["1370"]}
{"title": "The proposal of improved inexact isomorphic graph algorithm to detect design patterns\n", "abstract": " Design patterns being applied more and more to solve the software engineering difficulties in the object oriented software design procedures. So, the design pattern detection is widely used by software industries. Currently, many solutions presented to detect the design pattern in the system design. In this paper, we will propose a new one which first; we will use the graph implementation to implement both the system design UML diagram and the design pattern UML diagram. Second, we will implement the edges for each one of the both two graphs in a set of 4-tuple elements. Then, we will apply a new inexact graph isomorphic algorithm to detect the design pattern in the system design.", "num_citations": "7\n", "authors": ["1370"]}
{"title": "DATA MINING APPROACH FOR CLASSIFYING TWITTER’S USERS\n", "abstract": " Social networks are the most important communication channels in recent years, which popular among the different social groups. These networks affected the ideas and policies of individuals, groups and communities. Every day, millions of tweets on Twitter are being published. These tweets reflect opinions and beliefs of their publishers and affect others as well. Therefore, it is important to analyze these tweets and identify and classify trends of different users. This research aims to classify social network to anomaly groups such as: Terrorist and dissident; by analyzing tweets data on the Twitter; then identify an anonymous user’s affiliation to these groups. To address this problem, we first extract a set of features to characterize each group using different data mining techniques and store these features in the database. Text mining, sentiment analysis, and opinion mining techniques will be used to accomplish this extraction. The objective of data extraction is to measure the similarity of selected user tweets with respect to extracted features. It will enable to determine high percentage of similarity between the user tweets and group characteristics to expose his/her affiliation to this group.", "num_citations": "6\n", "authors": ["1370"]}
{"title": "Proposed Automated Framework to Select Suitable Design Pattern\n", "abstract": " Many design patterns are available in the existing literature. Due to the availability of the enormous quantity of design patterns, it is extremely hard for a developer to find the suitable design pattern to address the problem. An experienced developer can even face problem to select the appropriate pattern for a specific problem and it is no man's land for junior developers. This paper proposes a novel framework that will generate problem-related questions to a developer to find suitable design pattern using a repository. The answers to these questions can guide developers to select the suitable design patterns. This paper uses the questionnaire as a data collection instrument to conclude the results. The results are found supportive indicating that the proposed framework will solve the problem in hand.", "num_citations": "6\n", "authors": ["1370"]}
{"title": "Improved Model to Test Applications Using Smart Services\n", "abstract": " Smart applications are getting enormous popularity in the last several years. The research is conducted due to pressing need of rapid testing applications and improves quality models to ensure high quality of Smartphone applications. This work presents a basic approach to improve quality of mobile application by adjusting validation and test concepts for usage in mobile application development. We anticipate that the proposed solution will help the software companies to improve the quality of smartphone applications.", "num_citations": "6\n", "authors": ["1370"]}
{"title": "Novel component based development model for sip-based mobile application\n", "abstract": " Universities and Institutions these days' deals with issues related to with assessment of large number of students. Various evaluation methods have been adopted by examiners in different institutions to examining the ability of an individual, starting from manual means of using paper and pencil to electronic, from oral to written, practical to theoretical and many others. There is a need to expedite the process of examination in order to meet the increasing enrolment of students at the universities and institutes. Sip Based Mass Mobile Examination System (SiBMMES) expedites the examination process by automating various activities in an examination such as exam paper setting, Scheduling and allocating examination time and evaluation (auto-grading for objective questions) etc. SiBMMES uses the IP Multimedia Subsystem (IMS) that is an IP communications framework providing an environment for the rapid development of innovative and reusable services Session Initial Protocol (SIP) is a signalling (request-response) protocol for this architecture and it is used for establishing sessions in an IP network, making it an ideal candidate for supporting terminal mobility in the IMS to deliver the services, with the extended services available in IMS like open APIs, common network services, Quality of Services (QoS) like multiple sessions per call, Push to Talk etc often requiring multiple types of media (including voice, video, pictures, and text). SiBMMES is an effective solution for mass education evaluation using mobile and web technology. In this paper, a novel hybrid component based development (CBD) model is proposed for SiBMMES.", "num_citations": "6\n", "authors": ["1370"]}
{"title": "Proposed Framework to Manage Software Requirements and Reuse\n", "abstract": " Requirement elicitation and analysis form the focal point in the initial stages of the software development process. Unfortunately, in many software development projects, developers and end-users speak different languages. On one hand, end-users prefer to use natural languages while software developers who are technically perceptive, tend to use conceptual models. This difference in technical knowledge creates a communication gap, a potential cause of poor quality software products or project conflicts. The aim of this paper is to investigate the feasibility of a novel technique that seeks to foster effective elicitation of software requirements and support the implementation of structures that match particular requirements. By combining requirement elicitation and re-usable parts, the proposed solution envisages improvements in the overall software design process leading to enhanced requirement specifications. The novel idea is to incorporate an intermediate step for mapping Unified Modeling Language (UML) to Web Ontology Language (OWL) to enable the addition of ontology languages. The proposed model is validated through a survey. The validation results show that the proposed solution allows software developers to elicit software requirements and implement structures that match certain requirements.", "num_citations": "5\n", "authors": ["1370"]}
{"title": "Management of Changes in Software Requirements during Development Phases\n", "abstract": " Change, in software requirements during its development phases, is considered as a major risk which may affect a software project to fail. Therefore, software engineering processes, methods, and tools are used in order to manage these risks whereas changes in requirements have many negative influences such as effects on system development life cycle (SDLC) phases, project progress, and outcome of a software project. Consequently, project managers must use risk management strategies, activities, and estimation techniques in order to manage and mitigate these risks which are caused due to changes in requirements. A novel model is proposed in this paper to manage and mitigate risks related to changing requirements. The proposed model is validated through qualitative research design. The results are in favor of the proposed model to show its effectiveness. It is anticipated that the proposed model will solve the problems of software companies in major to deal with risks about changing requirements.", "num_citations": "5\n", "authors": ["1370"]}
{"title": "Proposal of New PRORISK Model for GSD Projects\n", "abstract": " The level of complexity and risks associated with software are increasing exponentially because of competing environment especially in geographically distributed projects. Global software development (GSD) face challenges like distance, communication and coordination challenges. The coordination and communication challenges are the main causes of failure in GSD. Project Oriented Risk Management (PRORISK) is one of the models to address the importance of risk management and project management processes in standard software projects. However, existing model is not proposed to handle GSD associated risks. This warrants the proposal of new PRORISK model to manage the risks of GSD. Survey is used as a research design to validate the proposed solution. We anticipate that the proposed solution will help the software companies to cater the risks associated with GSD.", "num_citations": "5\n", "authors": ["1370"]}
{"title": "A Proposal to Improve Communication between Distributed Development Teams\n", "abstract": " Distributed system development (DSD) is implemented by distributed development teams that are separated by long distances and different time-zones. Communication between distributed development teams in distributed software development applies a major and critical role in the success of process. Conflicts between distributed teams bring high risks to fail a development project due to poor communication. Therefore, it is important for distributed teams to communicate effectively to complete a successful project. In this paper, the authors propose an improved solution for effective communication among distributed development team by integrating administrative and technical procedures to successfully complete a project. Survey is used as a research design to validate the proposed solution. The results show that the respondents support the proposed solution that it will solve the industry problem by providing an effective means of communication in a DSD environment.", "num_citations": "5\n", "authors": ["1370"]}
{"title": "Evaluation of the cost estimation models: case study of task manager application\n", "abstract": " The need to accurately estimate time and cost for effective planning of software projects is becoming crucial driven by the escalating demands of the software market. Several models proposed in the history of Software Engineering discipline to estimate time, costs associated with planning and managing software projects as Line of Code (LOC), Function Point (FP) and Constructive Cost Model (COCOMO). This paper focuses upon the COCOMO Model. It is further consisted of its two sub models called COCOMO I and COCOMO II. The primary objective of this research is to use an appropriate case study to evaluate the accuracy of the sub models COCOMO I and II and ascertain the variation of the realistic resource effort, staff and time. The findings to date show that the Application Composition Model of COCOMO II is more accurate in determining time and cost for the successful conclusion of a software project than the other two COCOMO I and II Models for a similar application for example Task Manager.", "num_citations": "5\n", "authors": ["1370"]}
{"title": "Improvement of Component Integration Testing Technique\n", "abstract": " Component-based technology can increase reuse and productivity, but high-quality component-based systems are often difficult to implement. Component developers do not know the systems where the components will be used, while software engineers must develop new systems with limited knowledge on available components. We propose a new testing technique that generates, at the time of component development, integration test cases from the specification of the behavior expected from other components of the system. The technique presented in this paper supports both the component developer, who can early test the integration of the components with the system, and the software engineers, who can test concrete components at deployment time, simply re-using existing test cases.", "num_citations": "5\n", "authors": ["1370"]}
{"title": "An enhanced software project management methodology accompanying agile and CMMI\n", "abstract": " The Software Engineering Institute (SEI) has conducted extensive research on improving the quality of software development process. Project management (PM) is an important part in software development organizations. Without proper software project management, it can lead to the failure of software projects. Many software projects are failed to implement the required functionality within schedule and budget. Agile process models emphasize on rapid development. These models have gained great popularity in software development community. One area, often under estimated but crucial, for every software development project, is its management. The major problem with the characteristics of Capability Maturity Model Integration (CMMI) is that it does not make any contribution to the productivity of individual engineers. This paper defines when to implement agile models using CMMI to reduce the failure of software projects", "num_citations": "5\n", "authors": ["1370"]}
{"title": "Using Fuzzy Logic to Evaluate Normalization Completeness for An Improved Database Design\n", "abstract": " A new approach, to measure normalization completeness for conceptual model, is introduced using quantitative fuzzy functionality in this paper. We measure the normalization completeness of the conceptual model in two steps. In the first step, different normalization techniques are analyzed up to Boyce Codd Normal Form (BCNF) to find the current normal form of the relation. In the second step, fuzzy membership values are used to scale the normal form between 0 and 1. Case studies to explain schema transformation rules and measurements. Normalization completeness is measured by considering completeness attributes, preventing attributes of the functional dependencies and total number of attributes such as if the functional dependency is non-preventing then the attributes of that functional dependency are completeness attributes. The attributes of functional dependency which prevent to go to the next normal form are called preventing attributes.", "num_citations": "5\n", "authors": ["1370"]}
{"title": "The artifacts of component-based development\n", "abstract": " Component based development idea was floated in a conference name \"Mass Produced Software Components\" in 1968 [1]. Since then engineering and scientific libraries are developed to reuse the previously developed functions. This concept is now widely used in SW development as component based development (CBD). Component-based software engineering (CBSE) is used to develop/ assemble software from existing components [2]. Software developed using components is called component ware [3]. This paper presents different architectures of CBD such as ActiveX, common object request broker architecture (CORBA), remote method invocation (RMI) and simple object access protocol (SOAP). The overall objective of this paper is to support the practice of CBD by comparing its advantages and disadvantages. This paper also evaluates object oriented process model to adapt it for CBD.", "num_citations": "5\n", "authors": ["1370"]}
{"title": "Proposal of implicit coordination model for performance enhancement using sprint zero\n", "abstract": " Scrum model always welcome the new requirements from customer at any stage of software development. This situation creates problem for development team to meet estimated timelines. The Scrum development team is always under heavy workload and stress because of this situation. A high level of coordination among team members is required in order to overcome this work pressure and meet quality demands within estimated time and cost. Scrum model emphasis to coordinate through communication to cope with changing requirements. Scrum development is facing new challenges to meet high quality demands with critical timeline environment. The ability of a team to act intelligently in such situation is gaining key position for the survival and success of an organization. The goal of this paper is to highlight the role of implicit coordination helping the software development team members to act intelligently in time demand environment to achieve common goals. Implicit coordination among team members during sprint zero development can show significant improvement in team performance. This will help to achieve high quality product under heavy workload within estimated time period. A survey is conducted to validate the research ie, implicit coordination has strong impact for successful implementation of Scrum methodology.", "num_citations": "5\n", "authors": ["1370"]}
{"title": "Lean Agile Integration for the Development of Large Size Projects\n", "abstract": " Scrum is a well-known agile model due to its strong management practices. It can be mingled with many software development models such as extreme programming (XP), Agile Unified Process, and Feature Driven Development (FDD). Lean is a very popular known process in the automobile industry due to its effective practices such as Kanban bard and smooth workflow. Lean development is gaining popularity in the software industry from the last few years. Lean development is rational, convenient, responsive, and team-based and it adds value to the enterprise. Scrum is useable and practical for small and medium projects but it does not render positive support for the large size projects. In order to adopt Scrum for large size projects, there is a need to integrate Lean and Scrum. It is required to inherit some properties of the Lean into Scrum, without compromising the speed, quality, efficiency, and standards, to accomplish large size projects successfully such as enterprise resource planning (ERP) systems. It is anticipated that the proposed Lean Scrum integration will make it suitable to develop large size projects. The same is accomplished by purposing an integrated LScrum model in this research. The proposed model is validated using a survey to conclude the results. The results of the survey support the proposed integration of Lean and Scrum for the development of large size projects.", "num_citations": "4\n", "authors": ["1370"]}
{"title": "The Proposed GSD Model to Solve Coordination and Communication Problems\n", "abstract": " Global Software Development (GSD) is the most recent and major trend in software engineering domain. It provides many benefits but also faces various challenges in control, communication and coordination due to socio-cultural, geographical and temporal distance. Scrum is increasingly being applied in GSD as it supports teamwork between developers and customers. Scrum method offers a distinctive feature to mitigate the effects of socio-cultural and geographical but not temporal distance on coordination in GSD projects. This paper explains how Scrum helps to mitigate the effects of temporal distance that includes increased coordination costs in GSD projects.", "num_citations": "4\n", "authors": ["1370"]}
{"title": "Mitigating Coordination Costs in Global Software Development Using Scrum\n", "abstract": " Global Software Development (GSD) is the most recent and major trend in software engineering domain. It provides many benefits but also faces various challenges in control, communication and coordination due to socio-cultural, geographical and temporal distance. Scrum is increasingly being applied in GSD as it supports teamwork between developers and customers. Scrum method offers a distinctive feature to mitigate the effects of socio-cultural and geographical but not temporal distance on coordination in GSD projects. This paper explains how Scrum helps to mitigate the effects of temporal distance which includes increased coordination costs in GSD projects. A web application called (Distributed Scrum Web Application) provides various advantages for Scrum teams. The main advantage of this application is to facilitate communication among distributed team members.", "num_citations": "4\n", "authors": ["1370"]}
{"title": "Scrum and temporal distance-based global software development\n", "abstract": " Global software development (GSD) is one of modern trends in software engineering. The last years has witnessed a significant increase in the adoption of Agile in GSD. This paper considers the issue by examining whether Scrum practices used in mitigation of temporal distance-based GSD coordination challenges. We were used Cisco TelePresence tool in Synchronization communication for simulation of face to face meetings. We were designed a simple algorithm to help project managers in determining the appropriate strategies. This algorithm is based on the temporal difference between the sites. This is may be great or simple. Through temporal difference, we calculated number of working hours overlapping. Which are classified in the three cases and each case has number of strategies are sufficient to overcome this challenges.", "num_citations": "4\n", "authors": ["1370"]}
{"title": "The Proposed Implementation of RFID Based Attendance System\n", "abstract": " Recent trends in Information and Communication Technology (ICT) embrace several smartphone applications in a variety of educational and industrial domains in the last several years. This research focuses to solve one of the promising problems of an educational domain to take attendance smartly using the Radio Frequency Identification (RFID) system. Current attendance system in King Abdul-Aziz University (KAU) Saudi Arabia is partly solving the attendance problem. There are several problems in the existing attendance systems such as time-consuming, the chance of mistakes, truancy issues, no contact with parent/guardian and not efficient because of roll call as taking manual attendance. The proposed RFID based attendance system will provide robust, secure and automatic attendance. The proposed system will use modern technology and support to institutions and parents to deal with most of the problems of existing attendance systems. There are several other benefits of RFID based system such as web-based and mobile interfaces, daily absent report, an automatic SMS alert to parent/guardian, reduce administrative work, improve the ratio of attendance, economical and highly efficient. The case study method will be used as a research design. The proposed system is developed and tested in KAU Saudi Arabia. The proposed system will have both web and mobile interfaces. The web interface will need the Internet to access the proposed system and the mobile interface will use the Android platform for the testing scenarios. The user will access the system to generate customized reports to review the status of students for a particular …", "num_citations": "3\n", "authors": ["1370"]}
{"title": "A Unified Model to Manage Requirement Engineering for Global Software Development\n", "abstract": " Change is an unavoidable activity during software development. Requirements can be changed due to many reasons like the demands of customers, organizational needs and scalability. It is crucial to manage these changes on time to achieve successful software. However, requirement change management (RCM) is not a straightforward activity especially in case of global software development (GSD) due to distributed team structure and geographical challenges. Moreover, no collocated RCM model or organizational structure is currently available to do GSD. This paper proposes a novel unified model to manage requirement engineering for GSD. The research is validated using a survey. The results are found encouraging and it is anticipated that the proposed research will help software companies to solve the changing requirements problems in GSD environment to complete projects successfully.", "num_citations": "3\n", "authors": ["1370"]}
{"title": "Proposal to Teach Software Development Using Gaming Technique\n", "abstract": " The world today has witnessed the evolution imposes on researchers in the field of education to review the methods and strategies of teaching, since the teaching and learning system is not a collection of information and knowledge that stuffed in mind. It is a development of cognitive performance and modes of thinking in addition to the use of innovative ways and methods to help the student to adapt to its environment and to solve the problems that he/she faces to make learning meaningful. One of the recent trends is the use of educational teaching games. Games increase the motivation of the learner and ensure the interaction with educational material which, in turn, offers fun and enjoyable manner in order to achieve the desired objectives. This paper attempts to address the need to utilize gaming to improve learning in active ways and to raise level of the learning process in an interactive environment for the students and the teachers. To evaluate the proposed solution, this paper used survey research methodology and the results are highly encouraging by the professionals working in academia.", "num_citations": "3\n", "authors": ["1370"]}
{"title": "Improved framework for appropriate components selection\n", "abstract": " Component based software engineering (CBSE) approach is used to develop a software system from preexisting software components. It is difficult to select a suitable component from the library of components for the problem of CBSE. Appropriate software component selection plays an important role for the success of project. Many approaches are suggested to solve component selection problem. In this paper, the component selection is done by improving the integrated component selection framework by including the pliability metric to cut down the time and cost. Pliability is a flexible measure that assesses software quality. We anticipate that the proposed solution will solve the component selection problem of software industry.", "num_citations": "3\n", "authors": ["1370"]}
{"title": "Evaluation of the Extended CBD Model: A Case Study using IMS Application\n", "abstract": " A large number of projects failed because of concentrating on developing new software. The Main drawbacks of new software development are more costly, and need maintenance. Reuse is solution of these problems that caused the widespread usage of object oriented (OO) development. Object oriented development is the backbone of component-based development (CBD). CBD facilitates reuse of the existing components (by customizing) with the new ones. Main advantages of reusable components are more reliable, saved time and reduced cost. CBD approach is different from traditional/new software development. Several models have been proposed for traditional software development such as Waterfall, Rapid Application Development (RAD), Evolutionary, Rational Unified Process (RUP) and agile. Whereas the popular CBD models, for customized development, are V, Y, Umbrella and W. Almost all software development companies, both the new software and customized software have to be developed. Therefore majority of the software development companies face problem to select and implement an appropriate process model for the both kinds of developments. To address this problem, the existing RUP and CBD models do work to some extent but the authors intend to propose an extended CBD model that it equally offers its benefits for new and customized developments. The experimental data is taken from a case study to develop IP Multimedia Sub System (IMS)-based examination application using iPhone to evaluate the proposed model. The results provide evidence that the extended CBD model can be equally beneficial for …", "num_citations": "3\n", "authors": ["1370"]}
{"title": "IXPRUM-A novel agile model for software development\n", "abstract": " Extreme Programming (XP) and Scrum are considered the most commonly used agile models by software developers. XP is a software development model that tries to improve software quality and makes it flexible to respond rapidly changing customer requirements. Scrum is a framework instead of a complete process or methodology. It does not provide detailed descriptions of each and every process in a project. It leaves everything to the development team and focuses on project management practices while XP lacks these practices. In this paper, we propose a novel agile model named IXPRUM (Integrated XP and scRUM) by merging Scrum practices into XP phases which improves the quality and productivity of delivered software products. The validity of the proposed model is tested by conducting a case study under the guidelines of proposed IXPRUM model.", "num_citations": "3\n", "authors": ["1370"]}
{"title": "Evaluation of IP multimedia subsystem based mobile mass examination system\n", "abstract": " This research is carried out to develop IP Multimedia Subsystem (IMS) based Mobile Mass Examination (MoMEx) System. MoMEx system is intended to improve on management of examination process for large number of examinees. IMS based application is considered to be the next generation mobile applications that enable developers to take advantage of mobile networks resources. IMS-based application is attributed with robustness and improved Quality of Experience (OoE) for mobile users. Such quality is needed to ensure users reliabilities on the system. In This paper, we cover the analysis and design phase of MoMEx system. We have designed set of questionnaires aimed to gathering insights how much the concept of mobile exam and assessment will be accepted among the students and faculty members. Based on the results obtained, we concluded the functional requirements of MoMEx system prior to implementation phase.", "num_citations": "3\n", "authors": ["1370"]}
{"title": "An Improved XP Software Development Model\n", "abstract": " The concept of agile process models has attained great popularity in software (SW) development community in last few years. Agile models promote fast development. Fast development has certain drawbacks, such as weak documentation and performance for medium and large development projects. Fast development also promotes use of agile process models in small-scale projects. This paper modifies and evaluates Extreme Programming (XP) process model and proposes a novel process model based on these modifications.", "num_citations": "3\n", "authors": ["1370"]}
{"title": "An Improved XP Software Development Process Model\n", "abstract": " The concept of agile process models has attained great popularity in software (SW) development community in last few years. Agile models promote fast development. Fast development has certain drawbacks, such as weak documentation and performance for medium and large development projects. Fast development also promotes use of agile process models in small-scale projects. This paper modifies and evaluates Extreme Programming (XP) process model and proposes a novel process model based on these modifications.", "num_citations": "3\n", "authors": ["1370"]}
{"title": "Proposed Risk Management Model to Handle Changing Requirements\n", "abstract": " The change in requirements while construction of a software may bring into several risks like over budget and extra schedule. The changes in requirements are considered as a high risk to fail the software projects. A good project manager always incorporates risk management paradigm to manage the risks of changing requirements. This research uses available statistical techniques to estimate the cost of risk management with respect to the changing requirement. In addition, a hybrid cost estimation model is proposed using action strategy model to counteract, mitigate and manage the risks of changing requirements. The proposed model is validated using an industrial case study in Saudi Electricity Company (SEC) to conclude the results. The results are found supportive because the proposed model shows significant improvement to estimate the costs of changing requirements as compared to the existing cost estimation models.", "num_citations": "2\n", "authors": ["1370"]}
{"title": "Proposal to Decrease Code Defects to Improve Software Quality\n", "abstract": " Software quality is an important topic of software development and it is always challenging to deliver high-quality software. The major challenges, to complete the software, are time and cost without losing the software quality. Software quality has a significant impact on software performance. The acceptability, success, and failure of software are depending on its level of quality and number of defects. Software defects are one of the fundamental factors that can determine the time of software delivery. In addition, defects or errors need to be eliminated before software delivery. Software companies spend a lot to reduce code defects. The aim is to detect defects early with cheaper methods. This paper proposes a code quality scanner to decrease the code defects. The proposed solution is a combination of code scanner and code review. Moreover, the paper presents results using quantitative analysis to show the effectiveness of the proposed solution. The results are found encouraging.", "num_citations": "2\n", "authors": ["1370"]}
{"title": "The proposal of improved component selection framework\n", "abstract": " Component selection is considered one of hard tasks in Component Based Software Engineering (CBSE). It is difficult to find the optimal component selection. CBSE is an approach that is used to develop a software system from pre-existing software components. Appropriate software component selection plays an important role in CBSE. Many approaches were suggested to solve component selection problem. In this paper the component selection is done by improving the integrated component selection framework by including the pliability metric. Pliability is a flexible measure that assesses software quality in terms of its components quality. The validation of this proposed solution is done through collecting a sample of people who answer an electronic questionnaire that composed of 20 questions. The questionnaire is distributed through social sites such as Twitter, Facebook and emails. The result of the validation showed that using the integrated component selection framework with pliability metric is suitable for component selection.", "num_citations": "2\n", "authors": ["1370"]}
{"title": "A Proposal of Expert System to Select Components for the Product Line Software Engineering\n", "abstract": " Programming companies in last decades have started to depend more and more on software components in developing their systems in order to save development time and increase the productivity of the company. However, this led to dramatically increase in the number of components, and selecting the appropriate component becomes a tough task. In this paper the authors propose an expert system to help developers choosing the best component fit their requirements. A survey is done to evaluate the efficiency of this proposed solution.", "num_citations": "2\n", "authors": ["1370"]}
{"title": "Evaluating requirement specification document to improve the quality of software\n", "abstract": " The stability of the Software Requirement Specifications (SRS) document is the most important factor for the success of a software project. However the SRS phase is, especially in the small and medium enterprises (SME) community, still one of the weakest areas of the system development life cycle (SDLC). One of the primary reasons of this situation is that SMEs are stressed by the time-to-market and do not have enough resources for establishing rigorous methods for the SRS. This paper discusses IEEE defined SRS attribute (IEEE-STD-830-1998) to quantitatively measure a SRS document. A survey is conducted to get the feedback from software industry of Pakistan about IEEE attributes with the objective to know that how software development professionals rank them (IEEE attributes) according to importance. This paper will set a standard for software industry of Pakistan with acceptable values of IEEE attributes derived from the responses of software industry to develop a stable SRS to achieve quality in software development.", "num_citations": "2\n", "authors": ["1370"]}
{"title": "A Validation of the Proposed Component-Based Development Process\n", "abstract": " Component-based development (CBD) is a name, with which software development professionals are quite familiar. There are several models which have been proposed for CBD in last few years. They contain good features but there are some improvement possibilities in them. The objective of this paper is to propose a process for CBD and to evaluate the effects of quality parameters on reusability. The validations of the proposed CBD model provide positive indication for software (SW) industry that it can be successfully implemented for CBD projects.", "num_citations": "2\n", "authors": ["1370"]}
{"title": "Empirical Estimation of COCOMO I and COCOMO II Using a Case Study\n", "abstract": " There are several software estimation models such as Line of Code, Function Point and COnstructive COst MOdel (COCOMO). The original COCOMO model is one of the most widely practiced and popular among the software development community because of its flexible usage. It is a suite of models ie, COnstructive COst MOdel I and COnstructive COst MOdel II. In this paper, we are evaluating the both models, to find out the level of efficiency they present and how they can be tailored to the needs of modern software development projects. We are applying COCOMO models on a case study of an E-Commerce application, that is built using HTML and JavaScript. We will also shed light on the different components of each model, and how their Cost Drivers effect on the accuracy of cost estimations for software development projects.", "num_citations": "2\n", "authors": ["1370"]}
{"title": "Agile Framework To Transform Traditional Team\n", "abstract": " With the increasing computing power of processors, more complex web and mobile applications are being developed by the developers. To meet the consistent high standard software deliverables, software developers need to follow the software design life cycle as a standard practice. The conventional way suffers certain drawbacks in project management that need to be addressed. The newer approach called agile methodology is much efficient and improves the quality of the product if followed by the team members as per the agile values. Agile is one of the software development methodologies that have a lot of features and flexibility which play a vital role to bring improvement in educational as well as industrial sectors. As the traditional methodologies are not flexible with changes, whereas Agile methodologies main advantages are interacting with the customer, respond to changes and strong communication …", "num_citations": "1\n", "authors": ["1370"]}
{"title": "LONG TERM LEARNING OF AGILE TEAMS\n", "abstract": " The agile software development methods have demonstrated success in increasing responsiveness to the needs of customers. So the most of software industry preferred the agile methods. These methods have increased demand by the companies, but the agile methods at larger scale are more challenging and problematic compared to the smaller projects. For that, to become the norm for a large and complex project a new adaptive agile framework is proposed. Also, the proposed framework will help to achieve long-term organizational and learning of agile teams and help to increase the employee motivation and satisfaction by improving their skill. Thus the organizations will have success in sustaining their team and increasing its productivity.", "num_citations": "1\n", "authors": ["1370"]}
{"title": "Proposal to Improve Mobility in Service Oriented Architecture\n", "abstract": " Service Oriented Architecture (SOA) is a standard to implement and design applications. It is a channel of communication between service consumer (SC) and service provider (SP). SP offers a service and SC uses a service. Mobile web service verifier component, of SOA architecture, matches best service that is called. Mobile web service verifier component finds a best match of particular service in SP if it is available by the SP. Therefore, there is a pressing need to develop a component that can create a service if it is not found by mobile web service verifier component. This problem is addressed by proposing a new component for SOA architecture called service upgrade (SU) to increase and improve the service creation speed and satisfy SC and SP needs. The questionnaire is used as a research design to evaluate the proposed solution by providing qualitative data. The results show that the majority of respondents are in favor of the proposed solution. It is anticipated that the proposed solution will cater the industrial problem in hand.", "num_citations": "1\n", "authors": ["1370"]}
{"title": "Induction of Interactive Methods to Teach Software Engineering Course\n", "abstract": " Software engineering (SE) field is considered as a backbone of software industry. Students suffer many problems and difficulties when they approach to industry due to the old contents of SE course, lack of practice and inability in the subject area. The main reason of the SE course problems is the lack of coordination or gap between software industry and academia. This paper proposed a novel solution to enhance SE curriculum to bridge the gap between industry and academia. The proposed solution will assist students at optimal level in their professional careers to achieve goals of SE course. Survey research methodology is used to evaluate the proposed solution and the results of data analysis are highly encouraging. It is anticipated that the universities will find this research helpful to improve the quality of SE course.", "num_citations": "1\n", "authors": ["1370"]}
{"title": "The proposal of a novel software testing framework\n", "abstract": " Software testing is normally used to check the validity of a program. Test oracle performs an important role in software testing. The focus in this research is to perform class level test by introducing a testing framework. A technique is developed to generate test oracle for specification-based software testing using Vienna Development Method (VDM++) formal language. A three stage translation process, of VDM++ specifications of container classes to C++ test oracle classes, is described in this paper. It is also presented that how derived test oracle is integrated into a proposed functional testing framework. This technique caters object oriented features such as inheritance and aggregation, but concurrency is not considered in this work. Translation issues, limitations and evaluation of the technique are also discussed. The proposed approach is illustrated with the help of popular triangle problem case study.", "num_citations": "1\n", "authors": ["1370"]}
{"title": "A Novel framework for Strategic Alliance of Knowledge Management Systemsf\n", "abstract": " Knowledge is the primary strategic resource of many organizations. Knowledge management system (KMS) is a process of knowledge extraction, storage, transformation, analysis, distribution and deployment. Strategic alliance plays an increasing role to a global scale in technology business competition. Organizations are able to use alliances to respond to new technology and deliver new products more efficiently. The relationship between knowledge management and strategic alliance is identified. Knowledge transfer and selecting suitable partner are critical factors in the success of strategic alliance of an organization. In this paper, a novel framework is proposed for KMS strategic alliance. By applying this framework, strategic alliance will be highly achievable in corporate companies.", "num_citations": "1\n", "authors": ["1370"]}
{"title": "Kinect Based Electronic Assisting System to Facilitate People with Disabilities Using KXPRUM Agile Model\n", "abstract": " There is a need of electronic assisting system to facilitate people with disabilities to perform their daily life tasks. Microsoft Kinect technology was introduced with Xbox to allow the children to play games using motions instead of using joysticks. The success of Kinect technology came up heuristically to scientists to use this technology in other disciplines like medical field. This research is conducted to develop an electronic assisting system to facilitate patients to make them free of attendants to perform routine tasks like on coffee maker, on/off air conditioner/light and control wheelchair. A customized KXPRUM model is proposed to develop the electronic system. The results are reported on the first four releases of electronic assisting system. Five patients act as customer to conduct case study to validate the proposed KXPRUM model. 80% customer satisfaction is achieved to show the effectiveness of the proposed model.", "num_citations": "1\n", "authors": ["1370"]}
{"title": "Survey-Based Analysis of the Proposed Component-Based Development Process\n", "abstract": " The concept of component-based development (CBD) is widely practiced in software (SW) development. CBD is based on reuse of the existing components with the new ones. The objective of this paper is to propose a novel process model for CBD. Importance of repository has also been discussed. A survey has been conducted to evaluate the proposed model. The results of the survey show that proposed process model can be efficiently implemented for CBD projects.", "num_citations": "1\n", "authors": ["1370"]}