{"title": "An evaluation of the MOOD set of object-oriented software metrics\n", "abstract": " This paper describes the results of an investigation into a set of metrics for object-oriented design, called the MOOD metrics. The merits of each of the six MOOD metrics is discussed from a measurement theory viewpoint, taking into account the recognized object-oriented features which they were intended to measure: encapsulation, inheritance, coupling, and polymorphism. Empirical data, collected from three different application domains, is then analyzed using the MOOD metrics, to support this theoretical validation. Results show that (with appropriate changes to remove existing problematic discontinuities) the metrics could be used to provide an overall assessment of a software system, which may be helpful to managers of software development projects. However, further empirical studies are needed before these results can be generalized.", "num_citations": "508\n", "authors": ["549"]}
{"title": "Retrieving and analyzing mobile apps feature requests from online reviews\n", "abstract": " Mobile app reviews are valuable repositories of ideas coming directly from app users. Such ideas span various topics, and in this paper we show that 23.3% of them represent feature requests, i.e. comments through which users either suggest new features for an app or express preferences for the re-design of already existing features of an app. One of the challenges app developers face when trying to make use of such feedback is the massive amount of available reviews. This makes it difficult to identify specific topics and recurring trends across reviews. Through this work, we aim to support such processes by designing MARA (Mobile App Review Analyzer), a prototype for automatic retrieval of mobile app feature requests from online reviews. The design of the prototype is a) informed by an investigation of the ways users express feature requests through reviews, b) developed around a set of pre-defined …", "num_citations": "352\n", "authors": ["549"]}
{"title": "Experimental assessment of the effect of inheritance on the maintainability of object-oriented systems\n", "abstract": " In this paper, we describe an empirical investigation into the modifiability and understandability of object-oriented (OO) software. A controlled experiment was conducted to establish the effects of varying levels of inheritance on understandability and modifiability. The software used in this experiment consisted of a C++ system without any inheritance and a corresponding version containing three levels of inheritance, as well as a second larger C++ system without inheritance and a corresponding version with five levels of inheritance. For both of the systems, the application modelled a database for a University personnel system. A number of statistical hypotheses were tested. Results indicated that the systems without inheritance were easier to modify than the corresponding systems containing three or five levels of inheritance. Also, it was easier to understand the system without inheritance than a corresponding …", "num_citations": "202\n", "authors": ["549"]}
{"title": "Coupling metrics for object-oriented design\n", "abstract": " We describe and evaluate some recently innovated coupling metrics for object-oriented (OO) design. The Coupling Between Objects (CBO) metric of Chidamber and Kemerer (1991) is evaluated empirically using five OO systems, and compared with an alternative OO design metric called SAS, which measures the number of associations between a class and its peers. The NAS metric is directly collectible from design documents such as the Object Model of OMT. Results from all systems studied indicate a strong relationship between CBO and NAS, suggesting that they are not orthogonal. We hypothesised that coupling would be related to understandability, the number of errors and error density. So relationships were found for any of the systems between class understandability and coupling. Only limited evidence was found to support our hypothesis linking increased coupling to increased error density. The work …", "num_citations": "154\n", "authors": ["549"]}
{"title": "Evolution in software systems: foundations of the SPE classification scheme\n", "abstract": " The SPE taxonomy of evolving software systems, first proposed by Lehman in 1980, is re‐examined in this work. The primary concepts of software evolution are related to generic theories of evolution, particularly Dawkins' concept of a replicator, to the hermeneutic tradition in philosophy and to Kuhn's concept of paradigm. These concepts provide the foundations that are needed for understanding the phenomenon of software evolution and for refining the definitions of the SPE categories. In particular, this work argues that a software system should be defined as of type P if its controlling stakeholders have made a strategic decision that the system must comply with a single paradigm in its representation of domain knowledge. The proposed refinement of SPE is expected to provide a more productive basis for developing testable hypotheses and models about possible differences in the evolution of E‐ and P‐type …", "num_citations": "89\n", "authors": ["549"]}
{"title": "An overview of object-oriented design metrics\n", "abstract": " In this paper, we examine the current state in the field of object-oriented design metrices. We describe three sets of currently available metrics suites, namely, those of Chidamber and Kemerer (1993), Lorenze and Kidd (1994) and Abreu (1995). We consider the important features of each set, and assess the appropriateness and usefulness of each in evaluating the design of object-oriented systems. As a result, we identify problems common to all three sets of metrices, allowing us to suggest possible improvements in this area.", "num_citations": "79\n", "authors": ["549"]}
{"title": "An investigation into the applicability and validity of object-oriented design metrics\n", "abstract": " In this paper we consider empirical evidence in support of a set of object-oriented software metrics. In particular, we look at the object oriented design metrics of Chidamber and Kemerer, and their applicability in different application domains.               We briefly describe the metrics, and present our empirical findings, arising from our analysis of systems taken from a number of different application domains. Our investigations have led us to conclude that a subset of the metrics can be of great value to software developers, maintainers and project managers.", "num_citations": "78\n", "authors": ["549"]}
{"title": "Comparing programming paradigms: an evaluation of functional and object-oriented programs\n", "abstract": " A quantitative evaluation of the functional and object-oriented paradigms is presented. The aim of the project is to investigate whether the quality of code produced using a functional language is significantly different from that produced using an object-oriented language. Twelve sets of algorithms are developed, together with a number of utility functions, in both SML and C++. Strict constraints are imposed during the development cycle to improve the reliability of the results. The statistical tests do not reveal any significant differences for direct measures of the development metrics used which are associated with quality, such as the number of known errors, the number of modification requests, a subjective complexity assessment etc. However, significant differences are found for an indirect measure, the number of known errors per thousand non-comment source lines, and for various code metrics, including the …", "num_citations": "76\n", "authors": ["549"]}
{"title": "What are you complaining about?: a study of online reviews of mobile applications\n", "abstract": " In this paper, we explore the content of online reviews of mobile applications to get a better understanding of the most recurring issues users report through reviews, and the way the price and the rating of an app influences the type and the amount of feedback users report. Results show that users tend to provide positive feedback, often associating it with requirements for additional features. Also, users tend to provide more feedback for the lower rated apps and the optimal price range was found to be between £2.25 and £3.50.", "num_citations": "69\n", "authors": ["549"]}
{"title": "An exploratory study of the effect of aspect-oriented programming on maintainability\n", "abstract": " In this paper we describe an exploratory assessment of the effect of aspect-oriented programming on software maintainability. An experiment was conducted in which 11 software professionals were asked to carry out maintenance tasks on one of two programs. The first program was written in Java and the second in AspectJ. Both programs implement a shopping system according to the same set of requirements. A number of statistical hypotheses were tested. The results did seem to suggest a slight advantage for the subjects using the object-oriented system since in general it took the subjects less time to answer the questions on this system. Also, both systems appeared to be equally difficult to modify. However, the results did not show a statistically significant influence of aspect-oriented programming at the 5% level. We are aware that the results of this single small study cannot be generalized. We …", "num_citations": "64\n", "authors": ["549"]}
{"title": "A survey of social media use in software systems development\n", "abstract": " In this paper, we describe the preliminary results of a pilot survey conducted to collect information on social media use in global software systems development. We created an on-line survey for developers who are using social media to communicate at work and whose work falls within the domain of software systems development, including web applications. Our results show that social media can enable better communication through the software system development process. 91% of respondents said that using social media has improved their working life.", "num_citations": "62\n", "authors": ["549"]}
{"title": "Practitioners' views on the use of formal methods: an industrial survey by structured interview\n", "abstract": " The recognised deficiency in the level of empirical investigation of software engineering methods is particularly acute in the area of formal methods, where reports about their usefulness vary widely. We interviewed several formal methods users about the use of formal methods and their impact on various aspects of software engineering including the effects on the company, its products and its development processes as well as pragmatic issues such as scalability, understandability and tool support. The interviews are a first stage of empirical assessment. Future work will investigate some of the issues raised using formal experimentation and case studies.", "num_citations": "61\n", "authors": ["549"]}
{"title": "An approach to prospective consequential life cycle assessment and net energy analysis of distributed electricity generation\n", "abstract": " Increasing distributed renewable electricity generation is one of a number of technology pathways available to policy makers to meet environmental and other sustainability goals. Determining the efficacy of such a pathway for a national electricity system implies evaluating whole system change in future scenarios. Life cycle assessment (LCA) and net energy analysis (NEA) are two methodologies suitable for prospective and consequential analysis of energy performance and associated impacts. This paper discusses the benefits and limitations of prospective and consequential LCA and NEA analysis of distributed generation. It concludes that a combined LCA and NEA approach is a valuable tool for decision makers if a number of recommendations are addressed. Static and dynamic temporal allocation are both needed for a fair comparison of distributed renewables with thermal power stations to account for their …", "num_citations": "60\n", "authors": ["549"]}
{"title": "The European heritage: a critical re-interpretation\n", "abstract": " Gerard Delanty offers a critical interpretation of the European heritage today in light of recent developments in the human and social sciences, and in view of a mood of crisis in Europe that compels us to re-think the European past. One of the main insights informing this book is that a transnational and global perspective on European history can reorient the European heritage in a direction that offers a more viable way for contemporary Europe to articulate an intercultural identity in keeping with the emerging shape of Europe, and with its own often acknowledged past. He argues that the European heritage is based less on a universalistic conception of culture than on a plurality of interconnecting narratives. Such a perspective opens up new directions for scholarship and public debate on heritage that are guided by critical cosmopolitan considerations that highlight contention, resistances, competition, and …", "num_citations": "59\n", "authors": ["549"]}
{"title": "Dynamic and static views of software evolution\n", "abstract": " In addition to managing day-to-day maintenance, information system managers need to be able to predict and plan the longer-term evolution of software systems on an objective, quantified basis. Currently this is a difficult task, since the dynamics of software evolution, and the characteristics of evolvable software are not clearly understood. In this paper we present an approach to understanding software evolution. The approach looks at software evolution from two different points of view. The dynamic viewpoint investigates how to model software evolution trends and the static viewpoint studies the characteristics of software artefacts to see what makes software systems more evolvable. The former will help engineers to foresee the actions to be taken in the evolution process, while the latter provides an objective, quantified basis to evaluate the software with respect to its ability to evolve and will help to produce more …", "num_citations": "49\n", "authors": ["549"]}
{"title": "Directions and methodologies for empirical software engineering research\n", "abstract": " This report summarises and builds on the results of the “Directions and Methodologies for Empirical Software Engineering Research” group discussion. In particular, we considered the strengths, weaknesses, opportunities and threats to empirical software engineering research in light of the discussions and presentations during the workshop. The following sections describe each of these aspects of our discussion in turn. In addition, to finalise our discussion we agreed on a three-point plan for future work.", "num_citations": "47\n", "authors": ["549"]}
{"title": "Online reviews as first class artifacts in mobile app development\n", "abstract": " This paper introduces a framework for developing mobile apps. The framework relies heavily on app stores and, particularly, on online reviews from app users. The underlying idea is that app stores are proxies for users because they contain direct feedback from them. Such feedback includes feature requests and bug reports, which facilitate design and testing respectively. The framework is supported by MARA, a prototype system designed to automatically extract relevant information from online reviews.", "num_citations": "43\n", "authors": ["549"]}
{"title": "Software evolution and software evolvability\n", "abstract": " In addition to managing day-to-day maintenance, information system managers need to be able to predict and plan the longer-term evolution of software systems on an objective, quantified basis. Currently this is a difficult task, particularly when an information system is deeply embedded in an organisation's business processes. Although previous work, notably by Lehman et al., has shown that the evolution of such embedded software systems can be characterised as a complex feedback process, more work is needed to solve the practical problems of managing software evolution. In this paper we present an approach to understanding software evolution that is based around the quantifiable concept of evolvability. This concept brings together the study of software product quality, the software evolution process, and their relationships with the organisational environment. We assess the opportunities for analysing and measuring evolvability at pre-design, architectural, and source code stages in the development of software. We also describe work in progress on models of software evolution. We present a definition of software product evolvability in terms of a software quality model. We have also proposed a set of metrics derived from our model, which will enable objective assessments to be made of the evolutionary history and evolvability of software products. In order to validate these metrics we need a model of software evolution dynamics and we present some initial results on developing predictive models of software product evolution.", "num_citations": "38\n", "authors": ["549"]}
{"title": "Fasting and refeeding in the lactating dairy cow: 2. The recovery of liver cell structure and function following a six-day fast\n", "abstract": " Cows in early lactation were fasted for 6 days and then refed a normal diet for 70 days. Liver cell structure was monitored throughout the experiment by stereological analysis of needle biopsy samples and liver cell function was assessed by the activities of aspartate aminotransferase, sorbitol dehydrogenase and concentrations of bilirubin in the serum. The main changes in the liver of the fasted cows were a decrease in volume density of cytoplasm occupied by glycogen, and an increase in volume density of lysosomes and lipid, both lipid droplets and liposomes. There was a decrease in the number of mitochondria per cell with an increase in mean mitochondrial volume. The changes in liver structure were accompanied by a rise in serum enzyme activity and in the concentration of bilirubin in serum. Liver cell volume and volume density of cytoplasm occupied by glycogen, lysosomes and liposomes returned to …", "num_citations": "37\n", "authors": ["549"]}
{"title": "A lightweight technique for assessing risks in requirements analysis\n", "abstract": " A simple and practical technique for assessing the risks, that is, the potential for error, and consequent loss, in software system development, acquired during a requirements engineering phase is described. The technique uses a goal-based requirements analysis as a framework to identify and rate a set of key issues in order to arrive at estimates of the feasibility and adequacy of the requirements. The technique is illustrated and how it has been applied to a real systems development project is shown. How problems in this project could have been identified earlier is shown, thereby avoiding costly additional work and unhappy users.", "num_citations": "34\n", "authors": ["549"]}
{"title": "Effects of different rates of live-weight gain during rearing on the performance of Friesian heifers in their first lactation.\n", "abstract": " Effects of different rates of live-weight gain during rearing on the performance of Friesian heifers in their first lactation. FAO_logo home-icon English Español Français العربية 中文 Русский home-icon Translate with Google Access the full text NOT AVAILABLE Lookup at Google Scholar google-logo Bibliographic information Language : English Type : Journal Article In AGRIS since : 2012 Volume : 32 Extent : v.362(3) All titles : \" Effects of different rates of live-weight gain during rearing on the performance of Friesian heifers in their first lactation. \" Save as: AGRIS_AP RIS EndNote(XML) Effects of different rates of live-weight gain during rearing on the performance of Friesian heifers in their first lactation. Loading... Paper Written Paper Effects of different rates of live-weight gain during rearing on the performance of Friesian heifers in their first lactation. [1981] Little W. Harrison RD ARC Inst. for Res. on Anim. Diseases, …", "num_citations": "32\n", "authors": ["549"]}
{"title": "Temporal case-based reasoning for type 1 diabetes mellitus bolus insulin decision support\n", "abstract": " Individuals with type 1 diabetes have to monitor their blood glucose levels, determine the quantity of insulin required to achieve optimal glycaemic control and administer it themselves subcutaneously, multiple times per day. To help with this process bolus calculators have been developed that suggest the appropriate dose. However these calculators do not automatically adapt to the specific circumstances of an individual and require fine-tuning of parameters, a process that often requires the input of an expert.To overcome the limitations of the traditional methods this paper proposes the use of an artificial intelligence technique, case-based reasoning, to personalise the bolus calculation. A novel aspect of our approach is the use of temporal sequences to take into account preceding events when recommending the bolus insulin doses rather than looking at events in isolation.The in silico results described in this …", "num_citations": "29\n", "authors": ["549"]}
{"title": "Reviving Gramsci: Crisis, communication, and change\n", "abstract": " Engaging debates within cultural studies, media and communication studies, and critical theory, this book addresses whether Gramscian thought continues to be relevant for social and cultural analysis, in particular when examining times of crisis and social change. The book is motivated by two intertwined but distinct purposes: first, to show the privileged and fruitful link between a\" Gramscian Theory of Communication\" and a\" Communicative Theory of Gramsci;\" second, to explore the ways in which such a Gramscian perspective can help us interpret and explain different forms of political activism in the twenty-first century, such as\" Occupy\" in the US,\" Indignados\" in Spain, or\" Movimento Cinque Stelle\" in Italy.", "num_citations": "29\n", "authors": ["549"]}
{"title": "A method for assessing confidence in requirements analysis\n", "abstract": " ContextDuring development managers, analysts and designers often need to know whether enough requirements analysis work has been done and whether or not it is safe to proceed to the design stage.ObjectiveThis paper describes a new, simple and practical method for assessing our confidence in a set of requirements.MethodWe identified four confidence factors and used a goal oriented framework with a simple ordinal scale to develop a method for assessing confidence. We illustrate the method and show how it has been applied to a real systems development project.ResultsWe show how assessing confidence in the requirements could have revealed problems in this project earlier and so saved both time and money.ConclusionOur meta-level assessment of requirements provides a practical and pragmatic method that can prove useful to managers, analysts and designers who need to know when sufficient …", "num_citations": "29\n", "authors": ["549"]}
{"title": "Goal sketching: Towards agile requirements engineering\n", "abstract": " This paper describes a technique that can be used as part of a simple and practical agile method for requirements engineering. The technique can be used together with Agile Programming to develop software in internet time. We illustrate the technique and introduce lazy refinement, responsibility composition and context sketching. Goal sketching has been used in a number of real-world development projects, one of which is described here.", "num_citations": "28\n", "authors": ["549"]}
{"title": "A simulation model of self-organising evolvability in software systems\n", "abstract": " The evolvability of a software artifact is its capacity for producing heritable or reusable variants; the inverse quality is the artifact's inertia or resistance to evolutionary change. Evolvability in software systems may arise from engineering and/or self-organising processes. We describe our 'conditional growth' simulation model of software evolution and show how it can be used to investigate evolvability from a self-organisation perspective. The model is derived from the Bak-Sneppen family of 'self-organised criticality' simulations. It shows good qualitative agreement with Lehman's 'laws of software evolution' and reproduces phenomena that have been observed empirically. The model suggests interesting predictions about the dynamics of evolvability and implies that much of the observed variability in software evolution can be accounted for by comparatively simple self-organising processes.", "num_citations": "28\n", "authors": ["549"]}
{"title": "An evaluation of code metrics for object-oriented programs\n", "abstract": " This paper reports on the preliminary results of an investigation into the quality of programs written using different programming paradigms. In particular, the project aims to provide a quantitative analysis of the object-oriented and functional paradigms. Here, we report on the first stage of the project, the evaluation of a number of suggested indicators to determine whether or not they are correlated with the quality of object-oriented programs. Quality is assumed to be measured by the number of known errors encountered and the number of modification requests made during development, testing and maintenance, the times taken to attend to these and a subjective assessment of program complexity. We found that two of the suggested code metrics (the number of non-comment source lines and the number of function declarations) were strongly correlated with these measures of quality.", "num_citations": "26\n", "authors": ["549"]}
{"title": "Abstract data types in Standard ML\n", "abstract": " Abstract data types in standard ML | Guide books ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleBooksAbstract data types in standard ML ABSTRACT No abstract available. Index Terms 1.Abstract data types in standard ML 1.Software and its engineering 1.Software notations and tools 1.General programming languages 1.Language features 1.Abstract data types 2.Language types Comments Login options Check if you have access through your login credentials or your institution to get full access on this article. Sign in Full Access Get this Publication Information Contributors Published in Guide books cover image Abstract data types …", "num_citations": "26\n", "authors": ["549"]}
{"title": "A meta-analysis of multidisciplinary research\n", "abstract": " The need for software engineers and information systems practitioners to collaborate is becoming increasingly urgent. Software development environments change so rapidly that it is difficult for business organisations to keep pace with these changes and to understand not only what is available, but also what software or system would satisfy the varied requirements of the organisation. Similarly, software engineers need to be aware of and understand the social and organisational processes intrinsic to the environment in which an information system is to be implemented. Because of the rapid changes experienced in both software engineering and information systems, methods to facilitate systems and organisation co-evolution need to be investigated. Throughout systems evolution (from requirements capture to product and process evaluation) both disciplines may utilise a number of empirical research methods. The meta-analysis in this paper was undertaken to gain some understanding of the research methods used by each discipline and to identify areas where one discipline could inform the other to assist the process of systems evolution.", "num_citations": "23\n", "authors": ["549"]}
{"title": "Estimating the quality of functional programs: an empirical investigation\n", "abstract": " This paper describes an investigation into estimating the quality of functional programs. The work reported here is part of a larger, ongoing study into a quantitative analysis of the effect of utilizing different programming paradigms on code quality. Before undertaking such a comparative analysis it was necessary to establish a baseline of quality indicators which could then be used as metrics for the remainder of the project. Thus the aim of the research presented here was to evaluate a set of suggested indicators corresponding to internal attributes by investigating the correlation between the suggested indicators and the desired external quality-type attributes of the code. A method for the evaluation of the suggested metrics is discussed and the results of performing such an evaluation for functional programs are presented.", "num_citations": "22\n", "authors": ["549"]}
{"title": "An evaluation of coupling measures for AspectJ\n", "abstract": " The maintenance of aspect-oriented software requires measures that are theoretically valid. Inadequately validated measures might lead to management or project decisions that are likely to be not as effective as they could be. Recently, measures have been suggested that focus on aspect-oriented concepts, such as the crosscutting behaviour of aspects. Before these new measures can be put to use they should be evaluated to determine how far they indeed measure what they purport to quantify. This paper focuses on the evaluation of five aspect-oriented coupling measures with the aim to constructively increase the quality of software evolution.", "num_citations": "21\n", "authors": ["549"]}
{"title": "Experimental staphylococcal mastitis in the mouse: A morphometric study of early changes in mammary gland structure\n", "abstract": " The changes occurring in mouse mammary gland structure 6 and 12 h. after intramammary inoculation of a virulent strain of Staphylococcus aureus are described using morphometric analysis. At 12 h. after inoculation there was an increase in interacinar tissue, and a decrease in epithelial area and secretory cell area compared with the involution controls. There were also changes in the organelles of the secretory cell in inoculated mice which were consistent with accelerated involution.", "num_citations": "20\n", "authors": ["549"]}
{"title": "Ultrastructural, morphometric and associated observations on experimental mastitis in cattle\n", "abstract": " Lactating cattle were inoculated with streptococci or with staphylococci by the intramammary route. The course of the disease produced was monitored by clinical and milk examinations and the cattle killed for examination 48 h. or 96 h. after inoculation. A characteristic mastitis was produced in all cases.Ultrastructural studies on streptococcal infections showed a relatively low level of pathological change in the secretory cells, but degenerative changes in cocci ingested by neutrophils and in cocci observed in cells incorporated in the epithelium. In staphylococcal infection, gross degenerative changes were observed throughout the mammary tissue while the cocci were normal in appearance.Morphometric analysis of streptococcal infection showed that acini shrank in size, largely due to a decrease in size of the lumens. Secretory cell volume remained constant, but there was an increase in leucocytes within the …", "num_citations": "19\n", "authors": ["549"]}
{"title": "Experimental comparison of the comprehensibility of a Z specification and its implementation in Java\n", "abstract": " Comprehensibility is often raised as a problem with formal notations, yet formal methods practitioners dispute this. In a survey, one interviewee said ‘formal specifications are no more difficult to understand than code’. Measurement of comprehension is necessarily comparative and a useful comparison for a specification is against its implementation. Practitioners have an intuitive feel for the comprehension of code. A quantified comparison will transfer this feeling to formal specifications. We performed an experiment to compare the comprehension of a Z specification with that of its implementation in Java. The results indicate there is little difference in comprehensibility between the two.", "num_citations": "17\n", "authors": ["549"]}
{"title": "Abstract data types in Modula-2\n", "abstract": " Abstract data types in MODULA-2 | Guide books ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleBooksAbstract data types in MODULA-2 ABSTRACT No abstract available. Index Terms 1.Abstract data types in MODULA-2 1.Software and its engineering 1.Software notations and tools 1.General programming languages 1.Language features 1.Abstract data types 2.Language types Comments Login options Check if you have access through your login credentials or your institution to get full access on this article. Sign in Full Access Get this Publication Information Contributors Published in Guide books cover image Abstract data types in …", "num_citations": "16\n", "authors": ["549"]}
{"title": "Natural history: heritage, place and politics\n", "abstract": " The concept of’natural heritage’has become increasingly significant with the threat of dwindling resources, environmental degradation and climatic change. As humanity’s impact on the condition of life on earth has become more prominent, a discernible shift in the relationship between western society and the environment has taken place. This is reflective of wider historical processes which reveal a constantly changing association between humanity’s definition and perception of what’nature’constitutes or what can be defined as’ natural’. From the ornate collections of specimens which formed the basis of a distinct concept of’nature’emerging during the Enlightenment, this definition and the wider relationship between humanity and natural history have reflected issues of identity, place and politics in the modern era.", "num_citations": "15\n", "authors": ["549"]}
{"title": "An empirical validation of coupling metrics using automated refactoring\n", "abstract": " The validation of software metrics has received much interest over the years due to a desire to promote metrics which are both well-founded theoretically and have also been shown empirically to reflect our intuition and be practically useful. In this paper we describe how we used automatic refactoring to investigate the changes which occur to a number of metrics as software evolves. We use the concept of software volatility to quantify our comparison of the metrics.", "num_citations": "15\n", "authors": ["549"]}
{"title": "The World within the Group: Developing Theory for Group Analysis\n", "abstract": " The World within the Group is an original and ambitious endeavour to connect group analysis to philosophy, history, and modern social theory. The book argues that group analysis needs theoretical renewal to remain relevant, and that philosophy is a valuable resource for such thinking. In particular, the work of three philosophers is examined: Nietzsche, Dewey, and Gadamer, each being associated with\" pragmatic-perspective\" inquiry. The author demonstrates that group analysis is compatible with such inquiry, and that we understand and intervene from within the horizon of specific traditions of training and theory. Group analysis typifies an unremitting relational stance, valuing openness of dialogue, and moving in and out of the perspectival worlds of the participants. The book also offers a re-formulation of the concept of social unconscious, seen as a discursive world of production and articulation. Drawing on …", "num_citations": "14\n", "authors": ["549"]}
{"title": "Acute bone response to whole body vibration in healthy pre-pubertal boys\n", "abstract": " The skeleton responds to mechanical stimulation. We wished to ascertain the magnitude and speed of the growing skeleton’s response to a standardised form of mechanical stimulation, vibration. 36 prepubertal boys stood for 10 minutes in total on one of two vibrating platforms (high (> 2 g) or low (< 1 g) magnitude vibration) on either 1, 3 or 5 successive days (n= 12 for each duration); 15 control subjects stood on an inactive platform. Blood samples were taken at intervals before and after vibration to measure bone formation (P1NP, osteocalcin) and resorption (CTx) markers as well as osteoprotegerin and sclerostin. There were no significant differences between platform and control groups in bone turnover markers immediately after vibration on days 1, 3 and 5. Combining platform groups, at day 8 P1NP increased by 25.1%(CI 12.3 to 38.0; paired t-test p= 0.005) and bone resorption increased by 10.9%(CI 3.6 to …", "num_citations": "13\n", "authors": ["549"]}
{"title": "Datamorphic testing: A method for testing intelligent applications\n", "abstract": " Adequate testing of AI applications is essential to ensure their quality. However, it is often prohibitively difficult to generate realistic test cases or to check software correctness. This paper proposes a new method called datamorphic testing, which consists of three components: a set of seed test cases, a set of datamorphisms for transforming test cases, and a set of metamorphisms for checking test results. With an example of face recognition application, the paper demonstrates how to develop datamorphic test frameworks, and illustrates how to perform testing in various strategies, and validates the approach using an experiment with four real industrial applications of face recognition.", "num_citations": "12\n", "authors": ["549"]}
{"title": "Human factors and data logging processes with the use of advanced technology for adults with type 1 diabetes: systematic integrative review\n", "abstract": " Background: People with type 1 diabetes (T1D) undertake self-management to prevent short and long-term complications. Advanced technology potentially supports such activities but requires consideration of psychological and behavioral constructs and usability issues. Economic factors and health care provider capacity influence access and uptake of advanced technology. Previous reviews have focused upon clinical outcomes or were descriptive or have synthesized studies on adults with those on children and young people where human factors are different.Objective: This review described and examined the relationship between human factors and adherence with technology for data logging processes in adults with T1D.Methods: A systematic literature search was undertaken by using the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) guidelines. Quality appraisal was undertaken and data were abstracted and categorized into the themes that underpinned the human factor constructs that were examined.Results: A total of 18 studies were included. A total of 6 constructs emerged from the data analysis: the relationship between adherence to data logging and measurable outcomes; satisfaction with the transition to advanced technology for self-management; use of advanced technology and time spent on diabetes-related activities; strategies to mediate the complexities of diabetes and the use of advanced technology; cognition in the wild; and meanings, views, and perspectives from the users of technology.Conclusions: Increased treatment satisfaction was found on transition from traditional to advanced …", "num_citations": "12\n", "authors": ["549"]}
{"title": "Methodologies for using social media collaborative work systems\n", "abstract": " This paper proposes a new categorization of Social Media Collaborative Work (SMCW) systems and discusses methodologies for the use of SMCW systems. Popular Social Media systems such as Facebook, Wikipedia, Skype and Twitter can be seen as an evolution of systems for Computer Supported Cooperative Work. We are witnessing a renaissance in collaborative work that may overcome the many limitations of Computer Supported Cooperative Work. Furthermore large scale Social Media interactions provide an example of human self-motivation to accomplish collaborative work. System users are keen to adopt such technology, but we currently lack methodologies for using Social Media for Collaborative Work. We are conducting empirical studies to identify, determine, evaluate and develop such methodologies. In this paper we propose a categorization of Social Media for Collaborative Work and discuss …", "num_citations": "12\n", "authors": ["549"]}
{"title": "Towards an empirical validation of aspect-oriented coupling measures\n", "abstract": " In this paper we report on ongoing research into the empirical validation of aspect-oriented coupling measures as indicators of maintainability of aspectoriented software. We investigated the aspects of a medium-scale software package developed in industry and measured the maintenance effort that was spent on this software as the number of changed lines throughout the history of each aspect. This measure of maintenance effort was correlated with size and several of the coupling metrics. Our results seem to suggest that some coupling measures indeed can be considered as possible indicators of maintainability. However, our data also suggests that size is a better indicator of maintenance effort than any other metric we studied.", "num_citations": "11\n", "authors": ["549"]}
{"title": "A coupling framework for AspectJ\n", "abstract": " Aspect-orientation is an emerging paradigm that is based on the separation of concerns principle. It offers the idea of a new modular unit that encapsulates crosscutting concerns which would otherwise be scattered across multiple modules. Aspect-oriented measurement is a research area that has gained an increasing amount of attention lately due to the definition of several suites of measures designed to support aspect-oriented key features. Unlike objectorientation, however, aspect-orientation lacks a sound foundation on which measures can be expressed in operationalisable ways making it difficult to analyse and compare existing aspect-oriented measures. We identify a need to create common ground on which the definition of aspect-oriented measures can be based.", "num_citations": "11\n", "authors": ["549"]}
{"title": "Using test case metrics to predict code quality and effort\n", "abstract": " This paper reports on an investigation into the use of a design metric (the number of test cases) to predict code quality, development and testing time during the production of functional and object-oriented programs. We report on whether a significant difference exists in the number of test cases for equivalent functional and object-oriented programs as well as determining whether these test cases metrics are correlated with various development and design metrics for the different paradigms. The results of this investigation suggest that test case metrics could be used both as indicators of code quality and to predict the development and testing effort required for functional and object-oriented programs.", "num_citations": "11\n", "authors": ["549"]}
{"title": "Quantifying internal attributes of functional programs\n", "abstract": " There has been considerable interest in the use of metrics to quantify various quality attributes of software systems1–4. However, much of the reported research has been concerned with systems which are implemented in imperative and (to a lesser extent) object-oriented languages. The aim of the research reported here was to determine a suite of metrics which could be used to assess the quality attributes of code written in functional languages. This is a necessary preliminary step to assessing programs written in functional languages in a quantitative manner. In this paper we identify a set of appropriate measures and suggest additional measures to cope with the more novel aspects of functional languages. Experiments to determine whether or not these suggested measures do have any correlation with quality attributes have been performed with imperative languages5. Similar experiments with functional …", "num_citations": "11\n", "authors": ["549"]}
{"title": "Goal sketching with activity diagrams\n", "abstract": " Goal orientation is acknowledged as an important paradigm in requirements engineering. The structure of a goal-responsibility model provides opportunities for appraising the intention of a development. Creating a suitable model under agile constraints (time, incompleteness and catching up after an initial burst of creativity) can be challenging. Here we propose a marriage of UML activity diagrams with goal sketching in order to facilitate the production of goal-responsibility models under these constraints.", "num_citations": "9\n", "authors": ["549"]}
{"title": "The role of inheritance in the maintainability of object-oriented systems\n", "abstract": " In this paper, we describe the empirical evaluation of the level of inheritance in five object-oriented systems. The systems studied vary in both size and application domain. Results from our analysis together with other recent investigations seem to support the thesis that inheritance is used either sparingly or incorrectly. Statistical correlation between four inheritance metrics and a set of dependent variables (non-comment source lines, software understandability, known errors and error density) provide evidence for this claim.It is also not clear that systems using inheritance will necessarily be more maintainable than those that do not. The data analysed from two of our systems suggests that deeper inheritance trees are attributes of systems which are harder to understand and (by implication) harder to maintain. We analyse why this might be the case, and propose ways of remedying this situation.", "num_citations": "9\n", "authors": ["549"]}
{"title": "The use of functional languages in teaching computer science\n", "abstract": " This survey presents information concerning the use of functional languages (both strict and non-strict) for teaching in higher education. It lists the languages used by over 70 different institutions, the years in which the courses are given, and the recommended textbooks.", "num_citations": "9\n", "authors": ["549"]}
{"title": "Developing a mobile case-based reasoning application to assist type 1 diabetes management\n", "abstract": " Effective management of diabetes is crucial for patient wellbeing and the prevention of low blood sugar levels (Hypoglycemia) and high blood sugar levels (Hyperglycemia) both of which can be potentially dangerous. Traditionally log books are maintained by patients to record information such as insulin usage and their meals. The ever increasing popularity of smart phones has resulted in various applications being developed to allow patients to log data and help manage their condition. However these applications are often developed simply for the logging of data and only occasionally provide basic calculations to suggest insulin doses following a meal. The goal of this research is to use case-based reasoning techniques to suggest an insulin dosage for the patient as opposed to using a one calculation fits all approach. This is to be achieved by building a knowledge base of the patient's history that is then used …", "num_citations": "8\n", "authors": ["549"]}
{"title": "An empirical study of the evolution of a software system\n", "abstract": " The cost-effective and reliable evolution of systems is a significant software engineering challenge. Our approach is based on a combination of product modelling, process modelling and software metrics. We describe an empirical laboratory study following the evolution of three releases of a publicly available exemplar system. Analysis of the metrics which were collected improves our understanding of how a system evolves. Process metrics can provide information about how the product is put together, and product metrics suggest explanations for the development processes observed.", "num_citations": "8\n", "authors": ["549"]}
{"title": "Theoretical validation and empirical evaluation of object-oriented design metrics\n", "abstract": " Various object-oriented metrics have been proposed as a way of capturing features of object-oriented software such as encapsulation (information hiding), abstraction and inheritance. A major criticism of past object-oriented metrics is that little attention has been paid to theoretical validation or empirical evaluation of those metrics. By theoretical validation we refer to the process of ensuring that metrics conform to the principles of measurement theory. By empirical evaluation we refer to the study of software in order to characterize, predict, control, manage or improve through qualitative or quantitative analysis. The two approaches complement one another; a valid set of metrics should be both theoretically validated and empirically evaluated before it can be used with confidence. In this article, we describe the validation of objectoriented metrics incorporating both approaches. We begin by looking at theoretical validation.", "num_citations": "8\n", "authors": ["549"]}
{"title": "Datamorphic testing: A methodology for testing AI applications\n", "abstract": " With the rapid growth of the applications of machine learning (ML) and other artificial intelligence (AI) techniques, adequate testing has become a necessity to ensure their quality. This paper identifies the characteristics of AI applications that distinguish them from traditional software, and analyses the main difficulties in applying existing testing methods. Based on this analysis, we propose a new method called datamorphic testing and illustrate the method with an example of testing face recognition applications. We also report an experiment with four real industrial application systems of face recognition to validate the proposed approach.", "num_citations": "6\n", "authors": ["549"]}
{"title": "Architecture and the Forest Aesthetic: A New Look at Design and Resilient Urbanism\n", "abstract": " Despite population trends toward urbanization, the forest continues to have a strong appeal to the human imagination, and the human preference for forest over many other types of terrain is well documented. This book re-imagines architecture and urbanism by allowing the forest to be a prominent consideration in the language of design, thus recognizing the forest as essential rather than just incidental to human well-being. In Architecture and the Forest Aesthetic, forest is a large-scale urban construct that is far more extensive and nuanced than trees and shrubbery. The forest aesthetic opens designers to the forest as a model for an urban architecture of permeable floors, protective canopies, connected food chains, beneficial decomposition, and resilient ecologies. Much can be learned about these features of the forest from the natural sciences; however, when they are given due consideration technically and metaphorically in the design of urban habitat, the places in which humans live become living forests. What is present here in Architecture and the Forest Aesthetic is both a review of many ingenious ways in which the forest aesthetic has already been expressed in design and urbanism, and an encouragement to further use the forest aesthetic in design language and design outcomes. Case study projects featured include the Chilotan building craft of Southern Chile, the yaki sugi of Japan, the Biltmore Forest in the Southeastern United States, the Australian capital city Canberra, Bosco Verticale in Milan, Italy, the Beijing Olympic Forest Park in China, and more.", "num_citations": "6\n", "authors": ["549"]}
{"title": "Practitioners views on Web development: an industrial survey by semi-structured interviews\n", "abstract": " Several companies with experience in web development were interviewed about aspects of software engineering (SE) when developing Web applications. A semi-structured questionnaire was used to investigate their development processes, quality assurance (including metrics used) and tool support. The interviews are a first stage of empirical assessment. Among research observations identified are the lack of methods, activities and artefacts to reflect hypermedia characteristics (structure, content and navigation) of web applications. Another finding highlights the difficulties and lack of rigour when planning web-based applications because of the novelty of this type of application. In general, quality is assessed in an ad-hoc manner, without following any process or guidelines. Equally, reuse is also carried out in an ad-hoc manner and sometimes components are developed from scratch because developers do not trust the quality of the components or the sources. Last but not least, there is a lack of quantitative feedback to quality improvements of both processes and products related to web development. Future work will investigate some of the issues raised from the interviews. Investigations will consist of evaluating different hypermedia methods and processes to model Web applications (eg, extending UML) by means of sound quality models such as ISO9216, ISO15504, etc. Further, our approach will incorporate quality metrics in the development processes by which could be automated and analysed to estimate and enhance quality characteristics of the software process itself and those of the product.", "num_citations": "6\n", "authors": ["549"]}
{"title": "Multi-disciplinary and Interdisciplinary Research Methods and their Impact on Software and System Design\n", "abstract": " Good design holds the key to the success of the majority of software projects. Without careful consideration of all the factors that are involved in a software project, the successful integration of a system into the environment for which it is intended may fail. Communication has become a vital two-way link between software engineers and information systems in the design process. Software engineers should be aware of changing organisational requirements in current day environments. On the other hand organisations are continually evolving to adapt to changing working environments and technology, and need to be kept informed of the technology that will be more effective for their business in terms of cost and productivity. In order to adapt to evolving organisational requirements software engineers need to extend the research methods used to inform the design process and need to evaluate the efficacy of software tools and methods to capture both qualitative and quantitative data. Backg...", "num_citations": "6\n", "authors": ["549"]}
{"title": "Mutation-based evolutionary fault localisation\n", "abstract": " Fault localisation is an expensive and time-consuming stage of software maintenance. Research is continuing to develop new techniques to automate the process of reducing the effort needed for fault localisation without losing quality. For instance, spectrum-based techniques use execution information from testing to formulate measures for ranking a list of suspicious code locations at which the program may be defective: the suspiciousness formulae mainly combine variables related to code coverage and test results (pass or fail). Moreover previous research has evaluated mutation analysis data (mutation spectra) instead of coverage traces, to yield promising results. This paper reports on a Genetic Programming (GP) solution for the fault localisation problem together with a set of experiments to evaluate the GP solution with respect to baselines and benchmarks. The innovative aspects are the joint investigation of …", "num_citations": "5\n", "authors": ["549"]}
{"title": "Organisational Learning: An integrated HR and knowledge management perspective\n", "abstract": " Organizational Learning: An Integrated HR and Knowledge Management Perspective draws on a broad and multi-disciplinary base to look at the origins and practice of organizational learning. It critically considers the nature of organizational knowledge as a social construct; pedagogical issues around learning as individuals, groups, teams and whole organisations; and technological issues around the development of knowledge-based information systems. Supporting case studies are provided throughout the book, and readers will also benefit from a companion website which expands on the key themes of the text.", "num_citations": "5\n", "authors": ["549"]}
{"title": "The synergies between goal sketching and enterprise architecture\n", "abstract": " This paper introduces a pragmatic and practical method for requirements modeling. The method is built using the concepts of our goal sketching technique together with techniques from an enterprise architecture modeling language. Our claim is that our method will help project managers who want to establish early control of their projects and will also give managers confidence in the scope of their project. In particular we propose the inclusion of assumptions as first class entities in the ArchiMate enterprise architecture modeling language and an extension of the ArchiMate Motivation Model principle to allow radical as well as normative analyses. We demonstrate the usefulness of this method using a simple university library system as an example.", "num_citations": "5\n", "authors": ["549"]}
{"title": "A typed generic process model for product focused process improvement\n", "abstract": " The motivation behind the idea of product focused process improvement is to make a process improvement program address certain product quality features in an explicit manner. The PROFES methodology (http://www.profes.org) describes such an improvement program through the notion of a PPD (Product-Process Dependency) repository. The typed generic process model (TGPM) (Satpathy et al., 2000) is a parametric template which relates each process attribute with the way it is likely to affect the quality of the intermediate as well as the end products. TGPM could be instantiated to generate process models for individual processes. This paper shows how the TGPM and the PROFES methodology both address product quality in a similar manner and how they could be complementary to each other as regards to product focused process improvement.", "num_citations": "5\n", "authors": ["549"]}
{"title": "Empirical assessment of object-oriented design metrics\n", "abstract": " Empirical Assessment of Object-Oriented Design Metrics - ePrints Soton The University of Southampton Courses University life Research Business Global About Visit Alumni Departments News Events Contact × Search the Site Search Filter your search: All Courses Projects Staff University of Southampton Institutional Repository Search Advanced Search Policies & Help Latest Download Statistics Browse by Year Browse by Divisions LeftRight Empirical Assessment of Object-Oriented Design Metrics Harrison, R., Counsell, SJ and Nithi, R. (1997) Empirical Assessment of Object-Oriented Design Metrics. Proc. Empirical Assessment and Evaluation in Software Engineering Conf.. pp. 1-17 . Record type: Conference or Workshop Item (Other) Full text not available from this repository. More information Published date: March 1997 Additional Information: Address: Keele, UK Venue - Dates: Proc. Empirical Assessment and …", "num_citations": "5\n", "authors": ["549"]}
{"title": "An empirical evaluation of object-oriented design metrics\n", "abstract": " An Empirical Evaluation Of Object-Oriented Design Metrics - ePrints Soton The University of Southampton Courses University life Research Business Global About Visit Alumni Departments News Events Contact × Search the Site Search Filter your search: All Courses Projects Staff University of Southampton Institutional Repository Search Advanced Search Policies & Help Latest Download Statistics Browse by Year Browse by Divisions LeftRight An Empirical Evaluation Of Object-Oriented Design Metrics Harrison, R. and Nithi, R. (1996) An Empirical Evaluation Of Object-Oriented Design Metrics. Proc. Electronic proceedings of the OOPSLA 96 Workshop. Record type: Conference or Workshop Item (Other) Full text not available from this repository. More information Published date: October 1996 Venue - Dates: Proc. Electronic proceedings of the OOPSLA 96 Workshop, 1996-09-30 Organisations: Electronics & …", "num_citations": "5\n", "authors": ["549"]}
{"title": "Assessing the maturity of requirements through argumentation: A good enough approach\n", "abstract": " Requirements engineers need to be confident that enough requirements analysis has been done before a project can move forward. In the context of KAOS, this information can be derived from the soundness of the refinements: sound refinements indicate that the requirements in the goal-graph are mature enough or good enough for implementation. We can estimate how close we are to `good enough' requirements using the judgments of experts and other data from the goals. We apply Toulmin's model of argumentation to evaluate how sound refinements are. We then implement the resulting argumentation model using Bayesian Belief Networks and provide a semi-automated way aided by Natural Language Processing techniques to carry out the proposed evaluation. We have performed an initial validation on our work using a small case-study involving an electronic document management system.", "num_citations": "4\n", "authors": ["549"]}
{"title": "Modeling social media collaborative work\n", "abstract": " This paper proposes an approach for modeling Social Media Collaborative Work (SMCW). We consider Social Media Collaborative Work to consist of multi-stakeholder viewpoints and human activity linked together by social media. SMCW has great potential within complex multifaceted domains such as healthcare. In this paper we describe how to model SMCW in a way which shows the multi-stakeholder intentions, concerns and priorities. We are conducting empirical studies to develop our approach for modeling SMCW. In particular we are using action research with a self-help community to develop and validate our SMCW modeling approach. In our approach we make use of the soft systems methodology in combination with i* modeling and social psychology.", "num_citations": "4\n", "authors": ["549"]}
{"title": "Information system evolvability, feedback and pattern languages\n", "abstract": " Information systems for business are frequently heavily reliant on software. Two important feedback-related effects of embedding software in a business process are identified. First, the system dynamics of the software maintenance process can become complex, particularly in the number and scope of the feedback loops. Secondly, responsiveness to feedback can have a big effect on the evolvability of the information system. Ways have been explored to provide an effective mechanism for improving the quality of feedback between stakeholders during software maintenance. Understanding can be improved by using representations of information systems that are both service-based and architectural in scope. The conflicting forces that encourage change or stability can be resolved using patterns and pattern languages. A morphology of information systems pattern languages has been described to facilitate the …", "num_citations": "4\n", "authors": ["549"]}
{"title": "Parallel programming with pure functional languages\n", "abstract": " The use of pure functional languages is often quoted as facilitating the production of parallel algorithms. In this paper we examine the claim that programs written in pure functional languages can be easily transformed into programs which are suitable for implementation on a parallel machine. In particular, we investigate the transformation of a program to a form which is suitable for implementation on a pipelined process network, and then annotate the resulting network using a declarative language called Caliban.             The case study which is used for this investigation is an abstract programming model which was designed by Banâtre and Le Métayer, chosen as it is a non-trivial application which is not obviously well-suited to implementation in a functional language, and which is itself established as a model for concurrency.             Program transformation is used to improve the efficiency of the …", "num_citations": "4\n", "authors": ["549"]}
{"title": "A note on the method of replicate blood sampling when assessing the mean concentration of insulin, prolactin and growth hormone in the plasma of heifers fed different diets at …\n", "abstract": " Two groups of six heifers of mean age 284 days and mean body weight 233 kg were offered respectively, a barley-beef (BB) diet and a diet based on dried grass and sugar beet pulp (DG) at a rate calculated to give a live-weight gain of 0·5 kg/day. Three heifers from each group were fed twice daily, and the remaining three were fed through an out-of-parlour concentrate dispenser, and, during the period of blood sampling, hourly. Following a period of adaptation, blood samples were taken hourly during 24 h and the plasma analysed for insulin, prolactin and growth hormone (GH). The experiment was repeated 28 days later using the same heifers offered the same diets except that the twice-daily fed heifers were fed hourly and vice versa.Comparing the heifers fed the BB diet and those fed the DG diet, insulin in plasma was higher (7·11 v. 3·54 mU/1, P < 0·001) and GH lower (2·48 v. 3·41 uxg/l, P < 0·05) in heifers fed …", "num_citations": "4\n", "authors": ["549"]}
{"title": "The role of usability engineering in the development of an intelligent decision support system\n", "abstract": " This paper presents an overview of the usability engineering process for the development of a personalised clinical decision support system for the management of type 1 diabetes. The tool uses artificial intelligence (AI) techniques to provide insulin bolus dose advice and carbohydrate recommendations that adapt to the individual. We describe the role of human factors and user-centred design in the creation of medical systems that must adhere to international standards. We focus specifically on the formative evaluation stage of this process. The preliminary analysis of data shows promising results.", "num_citations": "3\n", "authors": ["549"]}
{"title": "Evolutionary Composition of Customized Fault Localization Heuristics.\n", "abstract": " Fault localisation is one of the most difficult and costly parts in software debugging. Researchers have tried to automate this process by formulating measures for assessment of code elements’ suspiciousness. This paper reports an evolutionary-based approach to combine non-linearly 34 previous measures to formulate a new program oriented fault localisation heuristic. The method was evaluated with 107 single-bug programs and compared against 35 approaches–34 spectrum-based heuristics and a previous evolutionary linear combination approach. The experiments have shown that the proposal consistently achieved competitive results compared to the others according to several effectiveness metrics.", "num_citations": "3\n", "authors": ["549"]}
{"title": "Genetic programming-based composition of fault localization heuristics\n", "abstract": " Spectrum-based fault localization techniques assess code elements suspiciousness with heuristics inspired by probabilistic and statistic models. This paper proposes a Genetic Programming (GP) approach to combine 18 existing spectrum-based fault localization heuristics into a project oriented fault localization formula. We evaluated the proposal with the 7 programs from the Siemens Suite with single-bugs and compared it against 19 approaches–18 coverage-based heuristics and one combination approach. The results show that the proposal outperformed the others. Thus, we conclude the GP is a promising metaheuristic to formulate customized fault localization heuristics.", "num_citations": "3\n", "authors": ["549"]}
{"title": "Social media collaboration in software projects\n", "abstract": " Social media has had a big impact on the way that software projects are managed and the way that stakeholders interact with each other: indeed, the nature of software projects has evolved substantially in keeping with the evolution of technology. A direct consequence of the ubiquity of the Internet is the increasing trend toward cooperation outside the boundaries of an office. The interactions involved in software projects have changed accordingly and can be broadly divided into two types: (1) interactions among stakeholders who are in a single location (e.g., people sharing the same office space) and (2) interactions among stakeholders who are in distributed locations (e.g., software projects that are partly implemented offshore). Social media has been and remains a significant facilitator to these kinds of interactions. This chapter looks at the implications of the use of social media software projects in today’s …", "num_citations": "3\n", "authors": ["549"]}
{"title": "Experimental comparison of the comprehensibility of a uml-based formal specification versus a textual one\n", "abstract": " CiteSeerX — Experimental Comparison of the Comprehensibility of a UML-based Formal Specification versus a Textual One Documents Authors Tables Log in Sign up MetaCart DMCA Donate CiteSeerX logo Documents: Advanced Search Include Citations Authors: Advanced Search Include Citations Tables: DMCA Experimental Comparison of the Comprehensibility of a UML-based Formal Specification versus a Textual One (2007) Cached Download as a PDF Download Links [www.bcs.org] [eprints.soton.ac.uk] [eprints.ecs.soton.ac.uk] [eprints.soton.ac.uk] Save to List Add to Collection Correct Errors Monitor Changes by CF Snook , R. Harrison Venue: Proceedings of 11 th International Conference on Evaluation and Assessment in Software Engineering (EASE Citations: 10 - 3 self Summary Citations Active Bibliography Co-citation Clustered Documents Version History Share Facebook Twitter Reddit Bibsonomy …", "num_citations": "3\n", "authors": ["549"]}
{"title": "Embedding “Softer” Aspects into the Grid\n", "abstract": " “Currently most studies focus on the e-Science infrastructure behind the socket on the wall. However this infrastructure will not be used unless it fits in with the working environment of the e-Scientists”[2]. Once the infrastructure is in place, constraints on utilising the Grid more effectively may arise from the “softer” aspects, which have not been paid much attention and are not easy to be incorporated into the Grid.We focus on three “softer” aspects of the Grid. The semantics of the Grid refers to behavioural aspects, such as functionality, available services, service properties and technical constraints. It includes all possible behaviours of service available within the Grid and of the service request.(We call these affordances [4]). Pragmatics is concerned with how the Grid is used in e-Science, particularly relevant issues being collaboration processes and degrees of access (determined by responsibility, obligation, right and …", "num_citations": "3\n", "authors": ["549"]}
{"title": "Evaluation of the functional and object-oriented programming paradigms: a replicated experiment\n", "abstract": " The importance of replication of software engineering ezperimentation to validate ezperimental results,(considered normal practice in other scientific domains) has often been overlooked. This paper presents the results of an internal replication of a case study which quantitatively investigates and compares the quality of code produced in a functional programming language, SML, with that produced in an object-oriented language, C++.Several relationships were identified between the process mettics and product metrics. In particular, several'design-time'metrics were found to be related to features of the development process and the delivered code. Thus, it may be possible to use these design-time metrics for prediction purposes. Further analysis involved investigating the effects of software size and code reuse on'error density', and the differences between the two paradigms in terms of programmer productivity and …", "num_citations": "3\n", "authors": ["549"]}
{"title": "Design Metrics in the Reengineering of Object-Oriented Systems\n", "abstract": " Various sets of OO metrics have recently been proposed as a way of identifying problem areas before they permeate to the latter development stages. However, these metrics are often only amenable to collection at the code level, often too late to prevent excessive maintenance costs being incurred. OO design metrics can be used to ease extraction of the design, thus facilitating reengineering. They also facilitate quantication of the extracted design, permitting reengineering decisions to be made more eectively. The OO metrics we developed helped us to extract essential characteristics of OO analysis and design such as inheritance, coupling, cohesion etc. We dened seven class metrics. The number of methods per class and the depth in the inheritance tree of a class are just two examples. As well as these class metrics, eleven system metrics were dened to give a system-wide view of OO features, for example the number of associations in the system and number of classes in the system. Data from a number of C++ systems of varying sizes and application domains was collected, for example, CRS: a commercial retail system consisting of about 23.8 KLOC 57 classes and GNU: a C++ Class Library, consisting of 53.5 KLOC 96 classes. Correlation analyses of the metrics were performed against dependent variables such as non-comment source lines NCSL and a measure of subjective understandability. Analysis revealed a strong positive relationship between the number of methods per class and NCSL for the majority of systems studied; similarly for the number of attributes per class. Evidence suggested sparse use of method inheritance and …", "num_citations": "3\n", "authors": ["549"]}
{"title": "Relationship between oestrous behaviour and frequency of visits made by dairy cows to out-of-parlour concentrate dispensers.\n", "abstract": " Sixty-five oestruses in 38 cows were confirmed either by using progesterone concentration determined in milk or by conception to a service on the same day. The cows were fed concentrates through variable-time out-of-parlour dispensers and the number of visits made by each cow to the dispensers was automatically recorded daily and a 10-day running mean calculated. A significant increase or decrease in visits was recorded when the number of visits on one day differed from the mean number of visits during the previous 10 days by at least two standard deviations. Ninety-three increases and 40 decreases in visits occurred within+/-10 days of the 65 confirmed oestruses. There were significantly more (16) than the expected number of increases on the day before oestrus (P less than 0.001) but at no other time. Recording increased visits to out-of-parlour concentrate dispensers may help to identify oestrus in dairy cows.", "num_citations": "3\n", "authors": ["549"]}
{"title": "A declarative development technique\n", "abstract": " A declarative development technique R. Harrison Department of Electronics and Computer Science, University of Southampton, Hampshire, UK ABSTRACT We present a way in which structured analysis and structured design can be used together with functional languages to produce a complete declarative development technique. We also examine the use of prototyping in the software development process by considering the use of functional languages for evolutionary prototyping. Our main conclusion is that the combination of structured analysis and structured design, evolutionary prototyping and functional languages produces a powerful methodology which facilitates the development of quality software. Keywords: rapid prototyping, specification, functional languages INTRODUCTION In this paper we demonstrate how structured analysis and structured design [1, 2] can be used together with functional languages to produce a complete declarative development technique. We hypothesize", "num_citations": "3\n", "authors": ["549"]}
{"title": "Eigth International Workshop on Artificial Intelligence and Requirements Engineering (AIRE’21)\n", "abstract": " Welcome to the Eigth International Workshop on Artificial Intelligence and Requirements Engineering (AIRE’21). The purpose of this workshop is to explore synergies between Artificial Intelligence (AI) and Requirements Engineering (RE). AIRE aims to strengthen the links in the community, including those between industry and academia. As such, we welcome submissions in the intersection between RE and AI. An important goal is to inspire a new and broad community for interdisciplinary discussions concerning novel research directions for Requirements Engineering and Artificial Intelligence. The edition of the workshop in 2021 received 18 submissions, which were independently reviewed by at least three program committee members. In the end, 12 long papers were accepted. All the conflicts of interest were treated seriously and independently. The high quality of submissions are a sign of a healthy research …", "num_citations": "2\n", "authors": ["549"]}
{"title": "Maram: Tool support for mobile app review management\n", "abstract": " Mobile apps today have millions of user reviews available online. Such reviews cover a large broad of themes and are usually expressed in an informal language. They provide valuable information to developers, such as feature requests, bug reports, and detailed descriptions of one’s interaction with the app. Due to the overwhelmingly large number of reviews apps usually get associated with, managing and making sense of reviews is difficult. In this paper, we address this problem by introducing MARAM, a tool designed to provide support for managing and integrating online reviews with other software management tools available, such as GitHub, JIRA and Bugzilla. The tool is designed to a) automatically extract app development relevant information from online reviews, b) support developers’ queries on (subsets of) the user generated content available on app stores, namely online reviews, feature requests, and bugs, and c) support the management of online reviews and their integration with other software management tools available, namely GitHub, JIRA or Bugzilla.", "num_citations": "2\n", "authors": ["549"]}
{"title": "A Conversation with Peter Fend\n", "abstract": " Peter Fend: Ocean Earth was the name of a corporation invented for a group of artists. And it remains a name of some sort. To get a corporation, you need a legally registered name. A lawyer I knew when we were kids discovered that I was working in a collaborative team with other artists, and he said,“You have to incorporate.” So I applied to the New York State authorities, in early 1980. The certificate of incorporation was issued on July 3, 1980. The first choice of a name had been Ecological Development Corporation, but that was taken. It turned out that the second choice was available, Ocean Earth Construction and Development Corporation. The acronym happened to be OECD, the same as for the international quasi-state organization [the Organization for Economic Cooperation and Development]. But the lawyer said,“Go ahead.” He did not think there could be any, to use a legal term,“confusion.” Under this …", "num_citations": "2\n", "authors": ["549"]}
{"title": "Design Patterns with Aspects: A case study.\n", "abstract": " This paper reports on a case study in which four programs were implemented in both aspect-oriented and object-oriented versions using four different design patterns. We report on our experiences with the use of these design patterns and the trade-offs that needed to be considered. Furthermore, we present additional evidence for a reduction of coupling through the use of aspect-oriented versions of popular design patterns identifying those that may have a beneficial influence on software maintenance.", "num_citations": "2\n", "authors": ["549"]}
{"title": "Evolution in software systems: Foundations of the SPE classification\n", "abstract": " The primary aim of this work is to contribute to the development of the theory of software evolution by re-examining and clarifying Lehman's SPE taxonomy of evolving software systems. The SPE classification scheme has had mixed fortunes since it was first proposed in 1980. The E (Evolving) category, which includes most software systems, has been influential and has become widely accepted. In contrast, the S (Specified) and P (Problem) categories have not been studied in detail, and the taxonomy's rationale has received little attention. It has been known from empirical studies, for example,(Lawrence 1982; Godfrey and Tu 2000; Cook et al. 2001; Siebel et al. 2003), that software systems are not uniform in their patterns of evolution. However, studies of such differences have made little use of either theory-based classifications such as SPE, or classifications based on observed properties of systems such as development process, application domain and so on. The juxtaposition of these developments raises some interesting questions. Do the same general principles of evolution apply to all software systems? Can the ‘Laws of Software Evolution', which were based on empirical data obtained from E-type sys-tems, be modified or extended to apply more generally, or even universally? What would constitute a sound basis for classifying evolving software systems?", "num_citations": "2\n", "authors": ["549"]}
{"title": "Acknowledging the Implications of Requirements.\n", "abstract": " The traditional software requirements specification (SRS) used as the principal instrument for management and planning and as the foundation for design can play a pivotal role in the successful outcome of a project. However this can be compromised by uncertainty and time-to-market pressures. In this paper we recognise that the SRS must be kept in a practical and useful state. We recognise three prerequisites to this end and introduce a programme of research aimed at developing a Requirements Profile that changes the emphasis of requirements engineering from defining the requirements to defining what is known about the requirements. The former (being a subset of the latter) leaves the traditional idea of a SRS unaffected whereas the latter adds much to the avoidance of misunderstanding.", "num_citations": "2\n", "authors": ["549"]}
{"title": "A practical approach to goal modelling for time-constrained projects\n", "abstract": " Goal modelling is a well known rigorous method for analysing problem rationale and developing requirements. Under the pressures typical of time-constrained projects its benefits are not accessible. This is because of the effort and time needed to create the graph and because reading the results can be difficult owing to the effects of crosscutting concerns. Here we introduce an adaptation of KAOS to meet the needs of rapid turn around and clarity. The main aim is to help the stakeholders gain an insight into the larger issues that might be overlooked if they make a premature start into implementation. The method emphasises the use of obstacles, accepts under-refined goals and has new methods for managing crosscutting concerns and strategic decision making. It is expected to be of value to agile as well as traditional processes.", "num_citations": "2\n", "authors": ["549"]}
{"title": "Emergent Behaviour of Human Activity Systems\n", "abstract": " IT systems must incorporate continuous change because organisation change is vital to organisational survival,(Truex et al., 1999). According to Truex et al.,‘this incorporation goes beyond adaptable systems, and includes creating support for organisations that cannot help but emerge.’We suggest similarities in interactive behaviour between organisation, technical and human systems to concepts within the framework of Activity Theory on the basis that human activity is shaped by the environment in which it is situated. Activity Theory is an approach that has its roots in the Soviet cultural-historical psychology founded by Vygotsky in the 1920s (Leont'ev, 1974). Activity Theory is a philosophical and interdisciplinary framework ‘for studying different forms of human practices as development processes, with both individual and social levels interlinked at the same time’(Nardi, 1996). Key ideas include studying human …", "num_citations": "2\n", "authors": ["549"]}
{"title": "Object oriented software understandability: An empirical investigation\n", "abstract": " In this paper, the results of an empirical investigation into the relationship between software understandability and features of object-oriented software are described. Five C++ Systems of varying sizes were analysed and data relating to understandability, inheritance, coupling and other class features collected for each. A number of hypotheses were then investigated to identify relationships between understandability and properties of each system. The hypotheses asked whether the extent of class coupling in a system, inheritance in a system, or class size features methods and attributes a ected the understandability of software.Signi cant relationships between understandability and class coupling were found for three of the systems studied indicating that as coupling increases, understandability decreases. Only limited evidence of a relationship between understandability and inheritance was found for the ve …", "num_citations": "2\n", "authors": ["549"]}
{"title": "Pure functional languages and parallelism\n", "abstract": " Pure functional languages and parallelism - ePrints Soton The University of Southampton Courses University life Research Business Global About Visit Alumni Departments News Events Contact × Search the Site Search Filter your search: All Courses Projects Staff University of Southampton Institutional Repository Search Advanced Search Policies & Help Latest Download Statistics Browse by Year Browse by Divisions LeftRight Pure functional languages and parallelism Harrison, R. (1991) Pure functional languages and parallelism. University of Southampton, : Dept. of Electr. and Comp. Sci, Univ. of Southampton, UK, Doctoral Thesis. Record type: Thesis (Doctoral) Full text not available from this repository. More information Published date: March 1991 Organisations: University of Southampton, Electronics & Computer Science Learn more about Electronics & Computer Science research Identifiers Local EPrints ID…", "num_citations": "2\n", "authors": ["549"]}
{"title": "Becoming less eligible? Intellectual disability services in the age of austerity\n", "abstract": " The'financial crisis' of 2008 caused the UK to make cuts to health and social care. The commissioning of cheaper care, leading to less attractive wages, resulted in lower recruitment and retention of care workers. The influence of Brexit on an already overstretched workforce capacity has resulted in a fragile adult social care market.", "num_citations": "1\n", "authors": ["549"]}
{"title": "Search-based fault localisation: A systematic mapping study\n", "abstract": " ContextSoftware Fault Localisation (FL) refers to finding faulty software elements related to failures produced as a result of test case execution. This is a laborious and time consuming task. To allow FL automation search-based algorithms have been successfully applied in the field of Search-Based Fault Localisation (SBFL). However, there is no study mapping the SBFL field to the best of our knowledge and we believe that such a map is important to promote new advances in this field.ObjectiveTo present the results of a mapping study on SBFL, by characterising the proposed methods, identifying sources of used information, adopted evaluation functions, applied algorithms and elements regarding reported experiments.MethodOur mapping followed a defined process and a search protocol. The conducted analysis considers different dimensions and categories related to the main characteristics of SBFL methods …", "num_citations": "1\n", "authors": ["549"]}
{"title": "Data-flow-based evolutionary fault localization\n", "abstract": " Fault localization is the activity of precisely indicating the faulty commands in a buggy program. It is known to be a highly costly and tedious process. Automating this process has been the goal of many studies, showing it to be a challenging problem. The coverage-spectrum based approaches commonly apply heuristics grounded on the execution of control-flow components to calculate the odds of each program element to be the defective one. The present study aims to investigate another source of fault information by assessing how data-flow analysis is useful when computing suspiciousness scores; and how the combination of scores from different sources impacts fault localization. We present an approach to calculate the suspiciousness score for each program command by using the execution of data-flow components. Then we use an evolutionary algorithm to search sets of weights to combine heuristics from …", "num_citations": "1\n", "authors": ["549"]}
{"title": "Application of Usability Engineering to the Development of a Personalised Decision Support System for Type 1 Diabetes Self-Management [Pòster]\n", "abstract": " PEPPER (Patient Empowerment through Predictive PERsonalised decision support) is an EU-funded research project which aims to improve the self-management behaviour of adults with type 1 diabetes (T1D).  Human factors and ergonomics play a key role in the development of this system", "num_citations": "1\n", "authors": ["549"]}
{"title": "A Questionnaire on Monuments\n", "abstract": " “A Questionnaire on Monuments” features 49 responses to questions formulated by Leah Dickerman, Hal Foster, David Joselit, and Carrie Lambert-Beatty: “From Charlottesville to Cape Town, there have been struggles over monuments and other markers involving histories of racial conflict. How do these charged situations shed light on the ethics of images in civil society today? Speaking generally or with specific examples in mind, please consider any of the following questions: What histories do these public symbols represent, what histories do they obscure, and what models of memory do they imply? How do they do this work, and how might they do it differently? What social and political forces are in play in their erection or dismantling? Should artists, writers, and art historians seek a new intersection of theory and praxis in the social struggles around such monuments and markers? How might these …", "num_citations": "1\n", "authors": ["549"]}
{"title": "Guest editorial: special issue on realising artificial intelligence synergies in software engineering\n", "abstract": " The aim of realising artificial intelligence synergies in software engineering (RAISE) workshop series is to bring together academics and industrial practitioners to exchange and discuss the latest innovative synergistic artificial intelligence (AI) and software engineering (SE) techniques and practices. Mutually beneficial characteristics have appeared in the past few decades and are still evolving due to new challenges and technological advances. Hence, the question that motivates and drives the RAISE Workshop series is: Are SE and AI researchers ignoring important insights from AI and SE?.To pursue this question, RAISE 2015, the fourth in the series, explored not only the application of AI techniques to SE problems but also the application of SE techniques to AI problems. During the workshop, Prof. John Mylopoulos, University of Toronto, provided an excellent example of such exploration in his keynote titled …", "num_citations": "1\n", "authors": ["549"]}
{"title": "Increasing transparency of recommender systems for type 1 diabetes patients\n", "abstract": " Self-management of type 1 diabetes is a challenging and complex task due the constant need for self monitoring and the diverse range of factors to consider in order to effectively regulate blood glucose levels. Recommender systems have been demonstrated to be effective for supporting patient self-management of type 1 diabetes by providing recommendations for insulin doses. Recent studies have expanded on this approach by incorporating case based reasoning within existing recommender systems for type 1 diabetes, to provide a more flexible and personalised approach to making recommendations. However, recommendations made by such systems may be ignored, even when users consider the system’s performance to be good. To address this, we propose a complimentary approach to increase the transparency of such systems through the provision of explanatory summaries that expose the reasoning process for making the recommendation. Greater transparency may increase recommendation acceptance rates and improve users’ trust and acceptability of these systems.", "num_citations": "1\n", "authors": ["549"]}
{"title": "Self-Administration Of a Novel Subcutaneous Bradykinin B2 Receptor Antagonist, Icatibant (Firazyr®), As An Effective Treatment Option In Patients With Hereditary Angioedema (HAE)\n", "abstract": " MethodsDuring each icatibant self-administration event, a diary method was used to collect the following patient-reported outcomes: attack intensity, anatomical location & trigger, number of doses, onset of relief, time elapsed until complete resolution, and adverse reactions.ResultsDuring 2012-2013, the patient logged a total of 10 events, in which she treated each attack with a single self-administered 30 mg dose of icatibant via subcutaneous injection. She experienced moderate to severe abdominal and peripheral HAE attacks. Onset of relief occurred within 15–30 minutes and complete resolution occurred within 4-hours to 5-days. Adverse reactions were mild in severity, transient, and resolved without further intervention. They included local injection site reaction (100%), headache (60%), fatigue (30%), feeling “fuzzy-brained”(30%), and hot flush (20%).ConclusionsThis case report provides supporting evidence …", "num_citations": "1\n", "authors": ["549"]}
{"title": "Goal sketching from a concise business case\n", "abstract": " This paper describes how the business case can be characterized and used to quickly make an initial and structurally complete goal-responsibility model. This eases the task of bringing disciplined support to key decision makers in a development project in such a way that it can be instantiated quickly and thereafter support all key decisions. This process also greatly improves the understanding shared by the key decision makers and helps to identify and manage loadbearing assumptions. Recent research has revealed two interesting issues, which are highlighted in this paper.", "num_citations": "1\n", "authors": ["549"]}
{"title": "Goal sketching and the Business Case\n", "abstract": " This paper describes how the business case can be characterized and used to quickly make an initial and structurally complete goal-responsibility model. This eases the problem of bringing disciplined support to key decision makers in a development project in such a way that it can be instantiated quickly and thereafter support all key decision gateways. This process also greatly improves the understanding shared by the key decision makers and helps to identify and manage load-bearing assumptions.", "num_citations": "1\n", "authors": ["549"]}
{"title": "Multidisciplinary solutions for multidisciplinary problems\n", "abstract": " The implications and challenges for Empirical Software Engineering (ESE) are increasing. The entire software design and development process is affected by the impact of human, organisational, and social issues. Collaboration with different disciplines is becoming necessary in order to fully understand issues that do not obviously fall within the remit of software engineering practices. ESE can draw upon the knowledge and experience of other disciplines not only to understand ethical issues to protect human participants, but to become more familiar with research methods that investigate organisational and human development processes and behaviours. The first part of this paper looks at guidelines from psychology to guide the establishment of a code of ethics suitable for ESE practices. As ESE turns its attention to human issues, it is important to establish such an agreed code of ethics to protect human …", "num_citations": "1\n", "authors": ["549"]}
{"title": "Media Liaison: Lessons from the Front Line\n", "abstract": " In this chapter, which is based on the experiences of a number of press officers at major incidents, we will be drawing out some of the lessons learned about liaison with the media.", "num_citations": "1\n", "authors": ["549"]}
{"title": "Summary: empirical studies of software development and evolution\n", "abstract": " , Empirical, Studies, of, Software, Development, and, Evolution, Rachel, Harrison, University, of, Southampton, Dept., of, Electronics, and, Computer, Science, University, of, Southampton, Southampton, SO17, 1BJ, UK,+ 44,(0), 1703 593249, rh@ ecs. soton. ac. uk, Keywords, Empirical Software Engineering, Systems Evolution, PROGRAM, COMMITTEE, Lionel, Briand,, Fraunhofer, Institut,(IESE),, Germany, Rachel, Harrison, University, of, Southampton,, UK, Marc, Kellner,, SEI,, CMU,, USA, Manny, Lehman,, Imperial, College,, UK, Steve MacDonell, University, of, Otago,, New, Zealand, Linda, Ott,, Michigan, Technological University,, USA, David Raffo,, Portland, State, University,, USA, Carolyn, Seaman,, University, of, Maryland,, USA, Martin Shepperd, Bournemouth, University,, UK, INTRODUCTION, The, 1st Process Modelling, and, Empirical, Studies, of, Software, Evolution Workshop, was, held in, Boston,, USA …", "num_citations": "1\n", "authors": ["549"]}
{"title": "Metrics Applied to Hypermedia Authoring for Education\n", "abstract": " Metrics Applied to Hypermedia Authoring for Education - ePrints Soton The University of Southampton Courses University life Research Business Global About Visit Alumni Departments News Events Contact × Search the Site Search Filter your search: All Courses Projects Staff University of Southampton Institutional Repository Search Advanced Search Policies & Help Latest Download Statistics Browse by Year Browse by Divisions LeftRight Metrics Applied to Hypermedia Authoring for Education Mendes, MEX, Harrison, R and Hall, W (1998) Metrics Applied to Hypermedia Authoring for Education. Proceedings of ED-MEDIA'98 - World Conference on Educational Multimedia and Hypermedia, Freiburg, Germany. Record type: Conference or Workshop Item (Other) Full text not available from this repository. More information Published date: 1998 Venue - Dates: Proceedings of ED-MEDIA'98 - World Conference on …", "num_citations": "1\n", "authors": ["549"]}
{"title": "Measuring Reusability and Maintainability in Hypermedia Applications for Education\n", "abstract": " Measuring Reusability and Maintainability in Hypermedia Applications for Education - ePrints Soton The University of Southampton Courses University life Research Business Global About Visit Alumni Departments News Events Contact × Search the Site Search Filter your search: All Courses Projects Staff University of Southampton Institutional Repository Search Advanced Search Policies & Help Latest Download Statistics Browse by Year Browse by Divisions LeftRight Measuring Reusability and Maintainability in Hypermedia Applications for Education Mendes, MEX, Harrison, R and Hall, W (1998) Measuring Reusability and Maintainability in Hypermedia Applications for Education. Proceddings of EASE'98 - Empirical Assessment and Evaluation in Software Engineering, UK. Record type: Conference or Workshop Item (Other) Full text not available from this repository. More information Published date: 1998 Venue …", "num_citations": "1\n", "authors": ["549"]}
{"title": "O Auxilo a Autopria de Aplicacoes Hipermedia Atraves da Aplicacao de Metricas\n", "abstract": " O Auxilo a Autopria de Aplicacoes Hipermedia Atraves da Aplicacao de Metricas - ePrints Soton The University of Southampton Courses University life Research Business Global About Visit Alumni Departments News Events Contact × Search the Site Search Filter your search: All Courses Projects Staff University of Southampton Institutional Repository Search Advanced Search Policies & Help Latest Download Statistics Browse by Year Browse by Divisions LeftRight O Auxilo a Autopria de Aplicacoes Hipermedia Atraves da Aplicacao de Metricas Mendes, MEX, Harrison, R and Hall, W (1998) O Auxilo a Autopria de Aplicacoes Hipermedia Atraves da Aplicacao de Metricas. Proceedings of the Third Symposium on Educational Software Research and Development, Evora, Portugal. Record type: Conference or Workshop Item (Other) Full text not available from this repository. More information Published date: 1998 …", "num_citations": "1\n", "authors": ["549"]}
{"title": "An assessment of object-oriented design in the maintenance of a large-scale system\n", "abstract": " An Assessment of Object-Oriented Design in the Maintenance of a Large-Scale System - ePrints Soton The University of Southampton Courses University life Research Business Global About Visit Alumni Departments News Events Contact × Search the Site Search Filter your search: All Courses Projects Staff University of Southampton Institutional Repository Search Advanced Search Policies & Help Latest Download Statistics Browse by Year Browse by Divisions LeftRight An Assessment of Object-Oriented Design in the Maintenance of a Large-Scale System Harrison, R. and Smith, AP (1996) An Assessment of Object-Oriented Design in the Maintenance of a Large-Scale System. Briand, L. (ed.) Proc. 1st Int. Workshop Emperical Studies of Software Maintenance (WESS'96). pp. 45-48 . Record type: Conference or Workshop Item (Other) Full text not available from this repository. More information Published date: …", "num_citations": "1\n", "authors": ["549"]}
{"title": "Metrics collection for quality improvement\n", "abstract": " Metrics Collection for Quality Improvement - ePrints Soton The University of Southampton Courses University life Research Business Global About Visit Alumni Departments News Events Contact × Search the Site Search Filter your search: All Courses Projects Staff University of Southampton Institutional Repository Search Advanced Search Policies & Help Latest Download Statistics Browse by Year Browse by Divisions LeftRight Metrics Collection for Quality Improvement Harrison, R. and Samaraweera, LG (1996) Metrics Collection for Quality Improvement. Proc. 6th Int. Conf. on Software Quality. pp. 85-97 . Record type: Conference or Workshop Item (Other) Full text not available from this repository. More information Published date: October 1996 Additional Information: Address: Ottawa, Canada Venue - Dates: Proc. 6th Int. Conf. on Software Quality, 1996-09-30 Organisations: Electronics & Computer Science Learn …", "num_citations": "1\n", "authors": ["549"]}
{"title": "An Empirical Study of a Software Maintenance Process\n", "abstract": " This paper describes how a process support tool is used to collect metrics about a major upgrade to our own electronic retail system. An incremental prototyping lifecycle is adopted in which each increment is categorised by an effort type and a project component. Effort types are Acquire, Build, Comprehend and Design and span all phases of development. Project components include data models and process models expressed in an OO modelling language and process algebra respectively as well as C++ classes and function templates and build components including source files and data files. This categorisation is independent of incremental prototyping and equally applicable to other software lifecycles. The process support tool (PWI) is responsible for ensuring the consistency between the models and the C++ source. It also supports the interaction between multiple developers and multiple metric-collectors. The first two releases of the retailing software are available for ftp from oracle.ecs.soton.ac.uk in directory pub/peter. Readers are invited to use the software and apply their own metrics as appropriate. We would be interested to correspond with anyone who does so.", "num_citations": "1\n", "authors": ["549"]}
{"title": "Relating product metrics to process attributes: an empirical investigation\n", "abstract": " Relating Product Metrics to Process Attributes: An Empirical Investigation - ePrints Soton The University of Southampton Courses University life Research Business Global About Visit Alumni Departments News Events Contact × Search the Site Search Filter your search: All Courses Projects Staff University of Southampton Institutional Repository Search Advanced Search Policies & Help Latest Download Statistics Browse by Year Browse by Divisions LeftRight Relating Product Metrics to Process Attributes: An Empirical Investigation Harrison, R., Samaraweera, LG, Dobie, Mark R. and Lewis, Paul H. (1994) Relating Product Metrics to Process Attributes: An Empirical Investigation sn Record type: Monograph (Project Report) Full text not available from this repository. More information Published date: 1994 Organisations: Web & Internet Science Identifiers Local EPrints ID: 250878 URI: http://eprints.soton.ac.uk/id/eprint/…", "num_citations": "1\n", "authors": ["549"]}
{"title": "Dynamic programming in a pure functional language\n", "abstract": " In this paper we show how a pure functional language can be used to solve problems using the methodology of dynamic progr arnming. We also investigate the way in which structured analysis and structured design can be used, together with functional languages. to produce a complete software development methodology. Our main conclusions are that fimcrional languages can be used to implement the application of dynamic programming in an elegant and natural way. and that the use of functional lartguag= fits weUwith the methodology of structured analysis and structured design.", "num_citations": "1\n", "authors": ["549"]}
{"title": "Reusable software components through parameterized modules and data abstraction\n", "abstract": " Data abstraction has been long been recognised as an important facility for software engineering. In this paper we demonstrate how data abstraction can be used to facilitate and promote software reuse. In particular, we show how generic abstract data types (ADTs) can be implemented by using parameterized modules in SML, together with the abstype mechanism. Indeed, it turns out that SML provides facilities which enable and encourage programmers to develop high quality, reusable code by harnessing the methodology of data abstraction. The examples given in the paper show how parameterized modules can be used to facilitate the production of reusable software, and how ADTs can be reused to build hierarchies of software components.", "num_citations": "1\n", "authors": ["549"]}
{"title": "The Gamma model as a functional programming tool\n", "abstract": " In this paper we investigate the way in which the Gamma model, proposed by Banâtre and Le Metayer [1], might be supported in a functional language. We discuss the mechanism behind the model and examine the difficulties which arise when implementing Gamma in a functional language. We also explore its applicability as a programming paradigm by developing a library of higher order functions which can be used to facilitate the programming process.", "num_citations": "1\n", "authors": ["549"]}
{"title": "Effects of the anabolic steroid trenbolone acetate, implanted alone or in combination with oestradiol-17β, on liver cell ultrastructure in steers\n", "abstract": " The ultrastructural changes in hepatocytes of steers were studied in animals implanted with 140 mg trenbolone acetate, alone or in combination with 20 mg oestradiol. The mean volume of the nucleus in the hepatocytes of the animals implanted with trenbolone acetate alone was significantly greater than that in control animals (P<0 001) and in animals implanted with the combined preparation (P<0 05). It is suggested that the increase indicates an androgen-mediated response in the nuclei which is not seen when oestradiol is included in the implant. Similarly, the peroxisome volume density was elevated significantly above that in the controls by trenbolone acetate (P<0’001); although the inclusion of oestradiol in the implant significantly reduced this level (P<0 001) it was still greater than the control values (P<0 05). No mitochondrial abnormalities were observed.", "num_citations": "1\n", "authors": ["549"]}
{"title": "Comparative scrapie activity of brain material and cerebrospinal fluid from scrapie-affected rats\n", "abstract": " Clinical scrapie was produced with a 10− 6 dilution of scrapie brain material but no scrapie was produced with a 10− 2 dilution of scrapie cerebrospinal fluid used as inoculum. This result and that of an associated electron microscopical observation are discussed.", "num_citations": "1\n", "authors": ["549"]}