{"title": "Collaboration tools for global software engineering\n", "abstract": " Software engineering involves people collaborating to develop better software. Collaboration is challenging, especially across time zones and without face-to-face meetings. We therefore use collaboration tools all along the product life cycle to let us work together, stay together, and achieve results together. This article summarizes experiences and trends chosen from recent IEEE International Conference on Global Software Engineering (IGSCE) conferences.", "num_citations": "267\n", "authors": ["181"]}
{"title": "Global software development in practice lessons learned\n", "abstract": " More than a decade ago, organizations seeking lower costs and access to skilled resources began to experiment with remotely located software development facilities. This change is having a profound impact not only on marketing and distribution but also on the way products are conceived, designed, constructed, tested, and delivered to customers. The number of organizations distributing their software development processes worldwide keeps increasing. As a result, software development is becoming a multi‐site, multicultural and globally distributed undertaking. More recently, attention has turned toward trying to understand the factors that enable multinationals and virtual corporations to operate successfully across geographic and cultural boundaries. On the basis of these factors, we present the lessons learned from case studies in two software development units from multinational organizations located in …", "num_citations": "255\n", "authors": ["181"]}
{"title": "Usage of Scrum practices within a global company\n", "abstract": " Global companies that experimented extensive waterfall phased plans are trying to improve their existing processes to expedite team engagement. SCRUM has become an acceptable path to follow for those companies because it comprises project management as part of its practices. SCRUM has been used with the objective of simplifying project control through simple processes, easy to update documentation and higher team iteration over exhaustive documentation. Instead of investing team effort on producing static documentation, SCRUM proposes to focus on team continuous improvement aiming to add value to business processes. The purpose of this industry report is to describe two projects that experimented SCRUM practices within a globally distributed company. This company has development centers across North America, South America and Asia. This report covers challenges faced by the project …", "num_citations": "131\n", "authors": ["181"]}
{"title": "Desenvolvimento distribuído de software\n", "abstract": " A necessidade para o Desenvolvimento Distribuído de Software (DDS) não é nova. Entretanto, atualmente vivenciamos ao mesmo tempo o amadurecimento da globalização e das relações de outsourcing, e a visível mudança de como os sistemas de informação estão relacionados com a estratégia das organizações. Estes dois fatores têm modificado a forma como o software tem sido desenvolvido nos últimos anos. Esta não é uma mudança simples, e nem rápida. É necessário pensar e planejar ações sólidas e concretas. É necessário também ter um bom entendimento das conseqüências e riscos que este novo cenário impõe ao desenvolvimento de software. Nesta linha, ainda não se tinha conhecimento de uma obra, em língua portuguesa, que apresentasse o Desenvolvimento Distribuído de Software de uma forma objetiva e clara, abordando suas dificuldades e soluções práticas para alunos ou profissionais envolvidos em ambientes de DDS. Este livro busca suprir exatamente esta necessidade. Inicialmente, apresenta um histórico bastante acessível de como o desenvolvimento de software evoluiu nas últimas décadas, criando um ponto de conexão com o leitor. Logo em seguida, relaciona este histórico com o surgimento do DDS, enfatizando os itens críticos, sob os pontos de vista técnico e organizacional. O modelo de referência apresentado pelos autores cria o framework teórico (bastante prático) que fornece suporte para os capítulos subseqüentes.Em um ambiente tradicional de desenvolvimento de software, as organizações ganharam experiência–e aprenderam–por várias décadas. Como resultado de pesquisas e …", "num_citations": "126\n", "authors": ["181"]}
{"title": "Process models in the practice of distributed software development: A systematic review of the literature\n", "abstract": " ContextDistributed Software Development (DSD) has recently become an active research area. Although considerable research effort has been made in this area, as yet, no agreement has been reached as to an appropriate process model for DSD.PurposeThis paper is intended to identify and synthesize papers that describe process models for distributed software development in the context of overseas outsourcing, i.e. “offshoring”.MethodWe used a systematic review methodology to search seven digital libraries and one topic-specific conference.ResultsWe found 27 primary studies describing stage-related DSD process models. Only five of such studies looked into outsourcing to a subsidiary company (i.e. “internal offshoring”). Nineteen primary studies addressed the need for DSD process models. Eight primary studies and three literature surveys described stage-based DSD process models, but only three of …", "num_citations": "100\n", "authors": ["181"]}
{"title": "Systematic literature review on agile practices in global software development\n", "abstract": " ContextDeveloping software in distributed development environments exhibits coordination, control and communication challenges. Agile practices, which demand frequent communication and self-organization between remote sites, are increasingly found in global software development (GSD) to mitigate said challenges.ObjectiveWe aim to provide detailed insight into what is reported on the successful application of agile practices in GSD from 1999 to 2016 and also identify the most frequently applied agile practices and reported distribution scenarios. We further strive to uncover research opportunities and gaps in the field of agile GSD.MethodWe build our systematic literature review on top of a previous review, which investigated studies published between 1999 and 2009, and extend the review by years 2010–2016, for which we conduct both a quantitative and a qualitative analysis.ResultsOur results show that …", "num_citations": "93\n", "authors": ["181"]}
{"title": "Systematic literature reviews in software engineering\n", "abstract": " Editorial: Systematic literature reviews in software engineering: Information and Software Technology: Vol 55, No 6 ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Information and Software Technology Periodical Home Latest Issue Archive Authors Affiliations Award Winners More HomeBrowse by TitlePeriodicalsInformation and Software TechnologyVol. , No. Editorial: Systematic literature reviews in software engineering article Editorial: Systematic literature reviews in software engineering Share on Authors: Claes Wohlin profile image Claes Wohlin Information and Software Technology, Blekinge Institute of Technology, Sweden Information and Software Technology, Blekinge Institute of Technology, , , ()(…", "num_citations": "87\n", "authors": ["181"]}
{"title": "A reference model for global software development: findings from a case study\n", "abstract": " The purpose of this paper is to present a reference model for global software development, based on the results found in a case study conducted in two software development units from multinational organizations located in Brazil. A preliminary description of this model was originally published in 2004. In this paper, we present the reference model in detail, improving the description and discussing the factors that enable multinationals corporations to operate successfully across geographic and cultural boundaries. At the end, we also discuss a preliminary evaluation of the reference model usage", "num_citations": "87\n", "authors": ["181"]}
{"title": "Métodos ágeis para desenvolvimento de software\n", "abstract": " Este livro traz informações completas sobre conceitos e práticas ágeis. Reúne a visão de 23 profissionais de todo o país, agregando em uma única obra conhecimentos e experiências sobre o tema, de projetos pequenos a grandes, dos simples aos complexos, de empresas públicas às privadas.", "num_citations": "84\n", "authors": ["181"]}
{"title": "MuNDDoS: um modelo de referência para desenvolvimento distribuído de software\n", "abstract": " Abstract (native): Atualmente, é cada vez mais significativo o número de empresas que estão distribuindo seus processos de desenvolvimento de software ao redor do mundo, visando ganhos de produtividade, redução de custos e melhorias na qualidade. Por isso, o desenvolvimento distribuído tem atraído um grande número de pesquisas na área de engenharia de software nos últimos anos. Os engenheiros de software têm reconhecido a grande influência desta nova forma de trabalho e estão em busca de modelos que facilitem o desenvolvimento de software com equipes geograficamente dispersas. Além dos engenheiros, os gerentes e os executivos têm enfrentado desafios e dificuldades em diferentes níveis, envolvendo fatores técnicos e não-técnicos. Neste sentido, essa dissertação de mestrado tem como objetivo propor um modelo de referência para desenvolvimento distribuído de software, contemplando as dimensões técnicas e não-técnica e os fatores envolvidos em cada uma. O principal método de pesquisa utilizado foi o estudo de caso e a base empírica da pesquisa envolveu duas unidades de desenvolvimento de software de duas empresas multinacionais de grande porte localizadas no Brasil. A pesquisa contribui no sentido de propor um modelo de referência para a área de desenvolvimento distribuído de software, além de apresentar dados empíricos e sistematizar parte da teoria recente da área. Também contribui ao propor um modelo de classificação do nível de dispersão de projetos distribuídos, considerando os atores envolvidos.", "num_citations": "79\n", "authors": ["181"]}
{"title": "Distributed Software Development: Toward an Understanding of the Relationship Between Project Team, Users and Customers.\n", "abstract": " The objective of this paper is to propose a typology for distributed software development comprising the relation between the three main stakeholders: project team (developers, analysts, managers, testers, system administrator, etc), customers and users. We propose a set of criteria to define geographically distributed environments. As a result, a model to define the distribution level for an organization in a Distributed Software Development (DSD) environment is presented. The model is applied to two exploratory case studies and its results discussed. These cases studies involve companies with headquarters in the United States and a development unit in Brazil. Advantages of this model as well as some aspects of the increasing distribution of software development particularly in a few Brazilian organizations are discussed.", "num_citations": "71\n", "authors": ["181"]}
{"title": "Software configuration management over a global software development environment: lessons learned from a case study\n", "abstract": " Software configuration management is an important support activity in the software development process. In global environments, the software configuration becomes critical due to the characteristics of the distributed development (physical distance, cultural differences, trust, communication and other factors). The objective of this paper is to analyze the software configuration management in a global software development environment, identifying the main challenges. The results are based on a case study carried on at a multinational organization that has offshore software development centers in Brazil, India and Russia, and was recently recognized in the CMM Model level 2 in the Brazilian unit. The results suggest the necessity to adapt and implement some activities in the software configuration management process addressing the main existing challenges. These activities were identified as lessons learned …", "num_citations": "57\n", "authors": ["181"]}
{"title": "Requirements management in global software development: Preliminary findings from a case study in a sw-cmm context\n", "abstract": " The requirements analysis is an important phase in the software development process. In geographically distributed environments (Global Software Development), requirements management becomes critical due to the characteristics of the distributed development (physical distance, cultural differences, trust, communication, etc). The objective of this paper is to analyze the requirements management in geographically distributed environments, identifying the main challenges. The results are based on a case study carried on at Dell Computers, a multinational organization that has offshore software development centers in Brazil, India and Russia, and was recently certified in SW-CMM Model level 2 in the Brazilian unit. The results suggest the necessity to adapt the requirements management to the distributed software development environment, addressing the main existing challenges. The problems and the solutions adopted are presented, aiming to relate these solutions to the organization distribution level, considering the project team, users and customers.", "num_citations": "54\n", "authors": ["181"]}
{"title": "Ensino de engenharia de software: desafios, estratégias de ensino e lições aprendidas\n", "abstract": " This paper presents a set of teaching experiences in Software Engineering from four Universities in Brazil. These experiences were planned and executed based on the identification of important challenges faced during the learning processes in the last years. Lessons learned and plans for future activities are also presented.Resumo. Neste artigo apresenta-se um conjunto de experiências de ensino em Engenharia de Software vivenciadas por quatro Instituições de Ensino Superior no Brasil. Estas experiências foram planejadas e executadas a partir da identificação de desafios importantes durante o processo de ensino nos últimos anos. Junto com as experiências são apresentadas algumas lições aprendidas e passos futuros.", "num_citations": "53\n", "authors": ["181"]}
{"title": "Um olhar sociotécnico sobre a engenharia de software\n", "abstract": " As novas tecnologias modificam a forma e a substância do controle, da participação e da coesão social. Porém, ao fazê-lo, são também modificadas pela experiência social, de sorte que o técnico e o social constituem um movimento de\" co-modificação\", somente percebido por uma aproximação concomitantemente social e técnica, por um olhar sociotécnico. O artigo pretende apresentar algumas das principais características deste olhar, bem como discutir os desafios que coloca para a engenharia de software.Abstract: New technologies modify the form and the substance of social control, participation and cohesion. However, as they modify, they are also modified by social practices in such a way it is possible to argue that social and technical dimensions constitute a process of mutual construction, only apprehended through an approach simultaneously social and technical, trough a sociotechnical frame. This article presents some of this frame’s main features, as well as its challenges to software engineering.", "num_citations": "49\n", "authors": ["181"]}
{"title": "Distributed pair programming: A systematic literature review\n", "abstract": " ContextGeographically distributed teams have adopted agile practices as a work strategy. One of these practices is Distributed Pair Programming (DPP). DPP consists in two developers working remotely on the same design, algorithm or code.ObjectiveIn this paper we sought to identify and synthesize papers that describe and analyze DPP both from teaching and practice perspectives.MethodWe conducted a Systematic Literature Review to search for empirical evidence in eight digital libraries.ResultsMost of the 34 DPP primary studies identified explore DPP from a teaching perspective. We found that DPP requires a specific infrastructure, but the existing studies do not explore the impact of the distribution in the details. There are many tools proposed that support DPP practice, but few of them are evaluated within a software development team.ConclusionWe need more studies that explore the effects of Pair …", "num_citations": "48\n", "authors": ["181"]}
{"title": "Global software engineering: Evolution and trends\n", "abstract": " Professional software products and IT systems and services today are developed mostly by globally distributed teams, projects, and companies. Successfully orchestrating Global Software Engineering (GSE) has become the major success factor both for organizations and practitioners. Yet, more than a half of all distributed projects does not achieve the intended objectives and is canceled. This paper summarizes experiences from academia and industry in a way to facilitate knowledge and technology transfer. It is based on an evaluation of 10 years of research, and industry collaboration and experience reported at the IEEE International Conference on Software Engineering (ICGSE) series. The outcomes of our analysis show GSE as a field highly attached to industry and, thus, a considerable share of ICGSE papers address the transfer of Software Engineering concepts and solutions to the global stage. We found …", "num_citations": "45\n", "authors": ["181"]}
{"title": "An empirical study on global software development: Offshore insourcing of IT projects\n", "abstract": " The objective of this paper is to present lessons learned from a case study conducted in a Brazilian software development unit owned by a multinational organization. The focus of this study is to understand the factors that enable multinationals and virtual corporations to operate successfully across geographic and cultural boundaries. Since the number of organizations distributing their software development processes worldwide keeps increasing, this change is having a profound impact not only on marketing and distribution but also on the way products are conceived, designed, constructed, tested, and delivered to customers. Our results show empirical results towards the identification of problems the organizations involved in offshore insourcing of IT projects have faced when going global.", "num_citations": "42\n", "authors": ["181"]}
{"title": "Global software processes definition in a distributed environment\n", "abstract": " Global software development projects are passing through the boundaries of a company or a country. In order to manage global teams effectively, it is necessary to define a software process adapted to different organizational cultures. A global software process gives all team members a common language to define tasks and activities allowing the better understanding of the business domain terms and the project milestones in spite of their differences in terms of culture and organizational structures. This paper presents the practices adopted to define a global software process for a distributed environment and the factors that impacted in the process definition", "num_citations": "39\n", "authors": ["181"]}
{"title": "Effort estimation in global software development projects: Preliminary results from a survey\n", "abstract": " Global Software Development (GSD) has intensified over the past years. Many reasons drove this development practice rise, where reducing development costs can be highlighted. In this context, software development effort estimation plays a very important role to achieve this goal of reducing costs. Once the effort required to develop software is a key component of the cost of development, the correct application of effort estimation techniques is crucial for the success of these projects. However, the current set of effort estimation techniques and models have been used without a clear definition of what has to be different when such techniques or models are used in the context of GSD projects. This paper presents preliminary results towards the understanding of effort estimation in GSD projects. The results found indicate that the teams don't have clear criteria to guide the selection of an effort estimation technique for …", "num_citations": "38\n", "authors": ["181"]}
{"title": "Risk management in global software development: A position paper\n", "abstract": " The number of organizations distributing their software development processes worldwide keeps increasing, and this change is having a profound impact on the way products are conceived, designed, constructed, tested, and delivered to customers. Global software development exhibits certain features that make it fundamentally different from traditional co-located software development. As the global software development involves additional steps and decisions, these steps also impact the risk management process. The goal of this paper is to discuss some of these impacts and to suggest the development of a process taking into account the dispersion, time zone difference, and cultural boundaries, not only in the operational level, but also in the organizations tactical and strategic level. The paper discussion intends to motivate risk identification, analysis and risk mitigation as earlier as possible in global software …", "num_citations": "38\n", "authors": ["181"]}
{"title": "An evidence‐based model of distributed software development project management: results from a systematic mapping study\n", "abstract": " Distributed software development (DSD) has intensified over the past few years, and DSD project management is more complex than collocated project management. However, no systematic research effort has focused on aggregating evidence from the scientific literature to build models to support project management on DSD context. For these reasons, the goal of this paper is to build an evidence‐based model of DSD project management from the research findings about challenges of DSD and the practices, models and tools proposed and used to overcome these challenges. We based the construction of this model on the evidence collected and synthesized by a comprehensive systematic mapping study of 70 research papers published between 1997 and 2009. We believe that our results can help practitioners and researchers to better understand the challenges and implement more effective solutions to …", "num_citations": "34\n", "authors": ["181"]}
{"title": "Uma Análise Comparativa de práticas de Desenvolvimento Distribuído de Software no Brasil e no exterior\n", "abstract": " More than a decade ago, seeking lower costs and access to skilled resources, many organizations began to experiment with remotely located software development facilities. The purpose of this paper is to present the results of case studies conducted in the last four years with four companies located in Brazil and other countries, where those companies have some distributed development strategies. The analysis is presented according to the strategies, practices and challenges identified. The results are analyzed under the Software Engineering, Software Quality, and Software Project Management point of view.Resumo. Nas últimas décadas, grandes investimentos têm permitido um movimento de transformação de um mercado local para mercados globais, em um processo que têm criado novas formas de colaboração e competição na área de Engenharia de Software, entre elas o Desenvolvimento Distribuído de Software. O objetivo deste artigo é apresentar os resultados de estudos de caso desenvolvidos nos últimos quatro anos com quatro empresas presentes neste cenário, localizadas no Brasil e no exterior. Apresenta-se a análise, levando-se em consideração as estratégias e práticas adotadas, e os desafios identificados. Os resultados são analisados do ponto de vista da Engenharia de Software, da Qualidade de Software e da Gerência de Projetos de Software.", "num_citations": "33\n", "authors": ["181"]}
{"title": "What do we know about high performance teams in software engineering? Results from a systematic literature review\n", "abstract": " A high performance team is one that exceeds all reasonable expectations and produces extraordinary results. In this work, we are interested in understanding contexts and conditions in which software engineering teams are likely to achieve this status. To this end, we are carrying out a systematic literature review to identify what are the known factors that booster or hinder the performance of software engineering teams, and what evidence is available to support such factors. In this preliminary effort, we selected 15 papers from SCOPUS, analyzed them following a qualitative meta-summary procedure. As a result, we present a summary of characteristics that positively and negatively influence different process of the teamwork, based on evidence available in the literature. This work constitutes a key preliminary result towards the design of more elaborate models and theories to predict and explain the performance of …", "num_citations": "32\n", "authors": ["181"]}
{"title": "Risk management in distributed software development: A process integration proposali\n", "abstract": " The goal of this paper is to propose a process to manage risks in globally distributed software development environments. We propose a process integration, aiming to reflect in the operational level all information and decisions taken in the strategic and tactical levels. The operational level is defined as the project risk management process, and the strategic and tactical levels are defined as all work concerning the decision to develop a project using geographically distributed resources. The integration was proposed based on the results found in a case study conducted in a software development center from a multinational organization located in Brazil. Thus, the focus of this study is to help in the understanding of what it is involved when managing risks in distributed software development environments.", "num_citations": "32\n", "authors": ["181"]}
{"title": "Planejamento & Gerência de projetos\n", "abstract": " Prikladnicki sobre Gerência de Projetos envolve um tema de grande relevância na área de Sistemas de Informação na atualidade. Os novos ambientes de trabalho, fruto dos impactos da globalização e das características de uma sociedade cada vez mais baseada no conhecimento, têm apresentado gran-des desafios para profissionais de diferentes áreas. Neste ce-nário, é importante que o tema de Gerência de Projetos deva ser abordado nos cursos de Graduação, preparando os alu-nos para esta nova realidade do mercado de trabalho, cada vez mais complexa, em especial nas áreas tecnológicas. O Professor Afonso Inácio Orth desenvolveu ao longo de sua carreira uma grande experiência no desenvolvimento de material didático voltado para o apoio a alunos de gradu-ação em disciplinas introdutórias de temas relevantes para os cursos da área de Ciências da Computação. Contando com a participação do Prof. Rafael Prikladnicki, com experiência na área de desenvolvimento de projetos distribuídos de software, ambos os autores têm experiência docente lecio-nando as disciplinas de Gerência de Projetos de Software e Desenvolvimento de Software, enfocando aspectos socio-técnicos destes conteúdos, do planejamento ao gerenciamento do processo de desenvolvimento.", "num_citations": "31\n", "authors": ["181"]}
{"title": "Strategic alignment of software process improvement programs using QFD\n", "abstract": " Software process improvement programs increase the competitiveness of software development organizations. But a critical success factor in this context is the proper alignment between the strategy of such programs and the organization's business strategy. In this paper, we discuss how Quality Function Deployment can be used as a technique to align strategic goals and software process within an organization, presenting results of its application in a small company in Brazil.", "num_citations": "31\n", "authors": ["181"]}
{"title": "Wholly owned offshore subsidiaries for IT development: A program of research\n", "abstract": " Information Technology (IT) offshore outsourcing is a non-reversible trend due to its cost implications, and as a result, target of much inquiry in different areas of knowledge. We propose to focus research efforts on a smaller niche within that larger set of questions: the wholly owned subsidiary (WOS) created with the purpose of IT development. In particular, our first step will be to develop a fully testable maturity model for such endeavors in the context of distributed IT projects. The proposed maturity model will not only identify best practices along difference maturity stages but also help to benchmark across similar organizations. Our preliminary research suggests that there is a consistent sequence of phases that this type of IT offshore sourcing follows.", "num_citations": "31\n", "authors": ["181"]}
{"title": "Managing global software engineering: A comparative analysis of offshore outsourcing and the internal offshoring of software development\n", "abstract": " In this article, the authors compare offshore outsourcing and the internal offshoring of software development. Empirical evidence is presented from a case study conducted in five companies. Based on a detailed literature review, a framework was developed that guided the authors' analysis of the differences in the challenges faced by companies and the patterns of evolution in the practice of software development in each business model.", "num_citations": "30\n", "authors": ["181"]}
{"title": "Risk management in distributed it projects: Integrating strategic, tactical, and operational levels\n", "abstract": " Distributed IT projects exhibit certain features that make them fundamentally different from traditional co-located projects, not only involving additional steps and decisions, but also impacting the risk management process. The goal of this paper is to discuss these impacts and to suggest the development of an integrated risk management process taking into account site dispersion, time zone difference, and cultural boundaries not only at the operational, but also at the tactical and strategic level. We also report results of an exploratory case study conducted in a software development center (a Brazilian subsidiary of a US corporation) in support of such a model, and conclude with a discussion of theoretical and practical implications of our work.", "num_citations": "29\n", "authors": ["181"]}
{"title": "Is time-zone proximity an advantage for software development? The case of the Brazilian IT industry\n", "abstract": " Brazil has been emerging as a destination for IT software and services. The country already had a strong domestic base of IT clients to global companies. One of the competitive factors is time zone location. Brazil has positioned itself as easy for collaboration because of time zone overlap with its primary partners in North America and Europe. In this paper we examine whether time zone proximity is an advantage for software development by conducting a country-level field study of the Brazilian IT industry using a cross section of firms. The results provide some support for the claims of proximity benefits. The Brazil-North dyads use moderate timeshifting that is perceived as comfortable for both sides. The voice coordination that the time overlap permits helps address coordination challenges and foster relationships. One company, in particular, practiced such intense time zone aligned collaboration using agile …", "num_citations": "28\n", "authors": ["181"]}
{"title": "Global software engineering: An industry perspective\n", "abstract": " Professional software products and IT systems and services today are developed mostly by globally distributed teams, projects, and companies. This issue's column summarizes experiences and guidance from industry to facilitate knowledge and technology transfer. It's based on industry feedback from the annual IEEE International Conference on Global Software Engineering.", "num_citations": "26\n", "authors": ["181"]}
{"title": "Propinquity in global software engineering: examining perceived distance in globally distributed project teams\n", "abstract": " In social psychology, propinquity refers to the physical (objective) or psychological (subjective) proximity between people. In this paper, we explore the psychological dimension of propinquity by examining the phenomenon of feeling distant from geographically distributed people, in the context of distributed software teams. The perceived distance is an important challenge faced by distributed teams, and it is frequently based on factors beyond the physical distance, such as communication and cultural differences. The purpose of this paper is to present a model to assess and make more visible the construct of ‘perceived distance’ among members of global software engineering teams. The model was applied in three real‐world cases to assess its effectiveness in uncovering hidden and useful information during the project lifecycle. The practical experience lived with the quantification of perceived distance gave us …", "num_citations": "26\n", "authors": ["181"]}
{"title": "Distributed Requirements Specification: Minimizing the Effect of Geographic Dispersion.\n", "abstract": " Requirements specification is an important phase of the requirements engineering area in the software development process. In geographically distributed environments, this phase becomes critical due to the characteristics of the distributed development (physical and temporal distance, cultural differences, trust, communication, etc). The objective of this paper is to analyze the requirements specification in geographically distributed environments, identifying the main challenges and proposing a process to minimize the impacts of this scenario. The results are based on a case study carried on a multinational organization that has software development units in multiple countries, and was recognized as a SW-CMM level 2 organization in 2 of them. The results suggest the necessity to adapt the requirements specification phase to the distributed software development environment, addressing the main existing …", "num_citations": "26\n", "authors": ["181"]}
{"title": "Collaboration models in distributed software development: A systematic review\n", "abstract": " Several years ago software development has become critical to the global market. In the past decade, as a reflection of globalization, software companies began to distribute their development processes in different places, creating distributed software development (DSD). With the growing of Distributed Software Development, organizations have attempt to sketch the best possible development structure, in order to improve productivity and quality. The aim of this paper is to present a Systematic Review of Literature to identify which ways of collaboration are commonly used by software organizations where teams are temporal and geographically dispersed, with also different native languages and culture. Further, the research was based on the basic life cycle of the traditional development, and where phases of the project are performed: onsite, distributed/offshore and multi-site. The systematic review have examined 868 papers published between 2000 and 2010.", "num_citations": "25\n", "authors": ["181"]}
{"title": "Software crowdsourcing platforms\n", "abstract": " Software crowdsourcing is mediated by platforms that connect requesters (buyers) with online workers--the crowd. Thus, these platforms have emerged as an important stakeholder in software development. This article introduces them and groups them by development phase.", "num_citations": "24\n", "authors": ["181"]}
{"title": "Software kaizen: Using agile to form high-perfomance software development teams\n", "abstract": " The process of teaching Software Engineering has undergone questions about the methods that have been used in training activities. Recent studies show that these methods involve traditional teaching strategies, such as presentation of theory and lectures. For this reason, students usually find in industry a different scenario than what is taught in the classroom. In parallel, other studies indicate that the emergence of agile methods in the 90s led to the formation of high performance teams with great level of knowledge in technical, business and behavioral domains. For this reason, we have proposed a training method called Software Kaizen, which provides temporary immersion of a team in a high-performance environment, based on agile methodologies. This paper presents the method and the results obtained from its application. We report on four replications of the method, with good results in learning, posture …", "num_citations": "24\n", "authors": ["181"]}
{"title": "A Systematic Literature Review of Requirements Engineering in Distributed Software Development Environments.\n", "abstract": " On analyzing the main characteristics of Distributed Software Development (DSD) phenomenon, we can notice that they particularly affect Requirements Engineering (RE). With the evolution of this phenomenon, the result is an increasing in the existent literature. For this reason, in this paper we report from a systematic review of the DSD literature, where we looked for challenges and possible solutions related to RE in DSD environments. We also discuss gaps of this research area, which can be used to guide future researches.", "num_citations": "23\n", "authors": ["181"]}
{"title": "Data collection in global software engineering research: learning from past experience\n", "abstract": " Global Software Engineering has become a standard in today’s software industry. Research in distributed software development poses severe challenges that are due to the spatial and temporal distribution of the actors, as well as to language, intercultural and organizational aspects. These challenges occur in addition to “traditional” challenges of the domain itself in large-scale software projects, like coordination and communication issues, requirements volatily, lack of domain knowledge, among others. While several authors have reported empirical studies of global software development projects, the methodological difficulties and challenges of this type of studies have not been sufficiently discussed. In this paper, we share our experiences of collecting and analysing qualitative data in the context of Global Software Engineering projects. We discuss strategies for gaining access to field sites, building trust …", "num_citations": "22\n", "authors": ["181"]}
{"title": "Brazil software crowdsourcing: a first step in a multi-year study\n", "abstract": " Crowdsourcing means outsourcing to a large network of people—a crowd. This form of managing work allocation has become much more sophisticated in recent years due to improvements in technology and changes in the work ecosystem. Crowdsourcing portends--not only the disruption of outsourcing--but the disruption of the entire global labor market. Small, atomized, tasks that can be completed and paid for in small increments are unprecedented in the history of work. Software has been the pioneer in all the large mega-trends of the last generation: in computer technology, technological entrepreneurship, offshore outsourcing, and now--in crowdsourcing. This paper describes the starting point of a research project that aims to investigate the Brazilian software labor and industry markets. These markets are being transformed and disrupted as a result of the new phenomena of crowdsourcing. To be more …", "num_citations": "22\n", "authors": ["181"]}
{"title": "Ensino de Gerência de Projetos de Software com o Planager\n", "abstract": " Neste artigo é apresentada a ferramenta Planager, um jogo para apoio no treinamento de gerência de projetos de software. O jogo foi desenvolvido para auxiliar gerentes de projeto iniciantes e experientes a entenderem os conceitos envolvidos em suas atividades, através de um jogo interativo, baseado em cenários e no PMBOK. Esta versão suporta inicialmente as principais atividades de planejamento presentes no PMBOK. Este artigo também apresenta os principais desafios identificados durante o desenvolvimento e algumas propostas de evoluções para a ferramenta.Abstract: In this paper, we present Planager, a game developed to support software project management training. It is designed to help novel and experienced project managers to understand the concepts involved in the project management activity, through an interactive and scenario-based game. The game was initially developed to support the main planning activities according to the PMBOK. This paper also presents the challenges identified during the development, and the tool improvement opportunities.", "num_citations": "22\n", "authors": ["181"]}
{"title": "Task allocation for crowdsourcing using AI planning\n", "abstract": " Crowdsourcing is a relatively new phenomenon in computer science and software engineering. In crowdsourcing a task is delivered to a crowd of participants who will work on this task. Task allocation is then an important aspect in the context of crowdsourcing. If done properly, it delivers successful results based on the answers provided by the crowd. However, task allocation in crowdsourcing is not a trivial problem. Factors like a task's requirements, the knowledge required for its resolution, and the size and heterogeneity of the participants in the crowd all impact task allocation, and therefore, the expected quality of the task results. In this case, the execution of actions from a plan, which assist the dynamic tasks' allocation in crowdsourcing systems, become relevant as an alternative solution. This paper formalizes task allocation in crowdsourcing scenarios as an artificial intelligence planning problem. Our results …", "num_citations": "20\n", "authors": ["181"]}
{"title": "Uma Abordagem Baseada em Gestão do Conhecimento para Gerência de Requisitos em Desenvolvimento Distribuído de Software.\n", "abstract": " A distribuição das equipes de desenvolvimento tem provocado diversos desafios ao processo de software. Dentre os desafios, a engenharia de requisitos destaca-se, sofrendo impacto de fatores como distância, diferença de cultura e fuso-horário, bem como dos meios de comunicação disponíveis. Nesse contexto, o gerenciamento das informações relacionadas a requisitos torna-se crítico para garantir que as informações necessárias sobre um determinado domínio ou aplicação estão disponíveis para as equipes de desenvolvimento, bem como que estas informações sejam organizadas de forma a permitir futuro acesso por projetos de manutenção no mesmo escopo. Nesse sentido, este artigo propõe-se a analisar a engenharia de requisitos em projetos de desenvolvimento distribuído de software sob a ótica da gestão de conhecimento. A principal contribuição apresentada é a identificação das informações pertencentes às categorias de conhecimento envolvidas, bem como a forma com que devem ser disponibilizadas.", "num_citations": "20\n", "authors": ["181"]}
{"title": "Does time zone proximity matter for Brazil? A study of the Brazilian IT industry\n", "abstract": " Nations now compete in their time zone position. Indian IT has long positioned itself as ideal in time zone geography: we get the work done while you're sleeping! So, since the beginning of this decade the Brazilian IT industry, in order to differentiate from India, has proclaimed: we are accessible and easy to work with because we're working while you're working. 38% of Brazilian firms boast about time zone location in their marketing literature–as does the industry association Brasscom.", "num_citations": "19\n", "authors": ["181"]}
{"title": "Improving contextual skills in global software engineering: A corporate training experience\n", "abstract": " Global software engineering is a reality in today's software development industry. With the fast development of this area, it is also necessary to better prepare software development professionals to develop software when located in distributed settings. In this paper, we present an experience of corporate training initiatives related to distributed development in a multinational company with global operations. We have interviewed and collected qualitative data from 39 employees aiming at the identification of challenges and the improvement of their distributed development skills. The results show an interesting profile indicating the existence of a distance between technical and non-technical knowledge, mainly in the beginning of a globally distributed operation. Based on these profiles, we present recommendations to reduce the distance and to manage risks associated with the lack of skill in this scenario.", "num_citations": "19\n", "authors": ["181"]}
{"title": "PDS-E: Em direção a um processo para desenvolvimento de Software Educacional\n", "abstract": " Os programas educacionais, conforme a metodologia utilizada pelo professor, podem ser explorados de diferentes formas. Neste sentido, estes ambientes requerem um conjunto de funcionalidades para atender os aspectos pedagógicos, identificados pelos professores especialistas. Como esta tarefa não é de fácil execução dado o perfil diferenciado da equipe interdisciplinar, faz-se necessário que se utilize uma metodologia para guiar e organizar todo o projeto de desenvolvimento do software. Neste artigo apresenta-se um relato de experiência em uma disciplina da graduação da PUCRS no intuito de formalizar as práticas de engenharia de software adotadas para o projeto e desenvolvimento de software educacional, através do projeto PDS-E.Abstract: Educational software can be explored in different ways according teachers goals and methodologies. The design of such systems needs to support a great variety of requirements related to educational functionalities. This paper presents PDS-E, a set of Software Engineering practices applied to design educational applications. PDS-E was written to help teachers and others educators to organize and to formalize their ideas concerning the system design, including pedagogical features. It was tested in real situation with teachers from High Schools with different backgrounds.", "num_citations": "19\n", "authors": ["181"]}
{"title": "Applying customer development for software requirements in a startup development program\n", "abstract": " Startups face a dynamic environment and need to overcome several challenges in order do become successful. One of these challenges is related to the software requirement process. Since the customer is often unknown in a startup, the development team must find a strategy to avoid developing features that will not meet customers needs. This work presents the application of the customer development process for software requirement activities. Our preliminary results indicate that using customer development can help development teams improve their software requirement elicitation processes.", "num_citations": "18\n", "authors": ["181"]}
{"title": "Evaluating collaborative practices in acquiring programming skills: Findings of a controlled experiment\n", "abstract": " [Context] Collaborative programming is achieved when two or more programmers develop software together. Pair Programming and Coding Dojo Randori are two increasingly adopted practices for collaborative programming. While the former encourages the collaboration in pairs, the latter promotes collaboration in groups. However, there is no broad understanding about the impact of these practices on the acquisition of programming skills. [Goal] In this study, we empirically compare the influence of both collaborative practices on two essential aspects of skill acquisition: motivation and learning. [Method] We conducted a controlled experiment with novice programmers applying solo programming and both collaborative practices to three different programming exercises using a crossed design. [Results] Our results showed that, while both practices outperformed solo programming, they also presented …", "num_citations": "18\n", "authors": ["181"]}
{"title": "The importance of the use of an estimation process\n", "abstract": " Software cost estimation and effort estimation are crucial activities in software development, once they help to decide whether continues with a software development effort. Poor estimation is the cause of significant challenges in project management and in the software quality, therefore it is important the correct use of estimation models and techniques to avoid issues caused by poor estimation. Since early sixties, this subject has been researched which caused the creation of several estimation techniques. All techniques proved that can be applied to estimate software effort and cost, but none of them always provide an accurate estimate. For this reason, research has been done to improve the estimation accuracy. In this context, this paper reports from a survey about software effort estimation usage. The results indicate that when the techniques are used with estimation processes, projects have better results in …", "num_citations": "18\n", "authors": ["181"]}
{"title": "Identifying code smells with collaborative practices: A controlled experiment\n", "abstract": " Code smells are often considered as key indicators of software quality degradation. If code smells are not systematically removed from a program, its continuous degradation may lead to either major maintenance effort or the complete redesign of the system. For several reasons, software developers introduce smells in their code as soon as they start to learn programming. If novice developers are ought to become either proficient programmers or skilled code reviewers, they should be early prepared to effectively identify code smells in existing programs. However, effective identification of code smells is often not a non-trivial task in particular to a novice developer working in isolation. Thus, the use of collaborative practices may have the potential to support developers in improving their effectiveness on this task at their early stages of their careers. These practices offer the opportunity for two or more developers …", "num_citations": "17\n", "authors": ["181"]}
{"title": "Trust in virtual teams: theory and tools\n", "abstract": " We present a workshop in which trust in virtual teams is the central theme. Trust is essential for effective and efficient collaborations to take place and is more challenging when people are unable to meet face-to-face. The workshop aims to generate discussions which address three key issues within this general theme: 1) the factors that engender and inhibit trust, 2) the structure of a trust framework, 3) and the requirements for software tools that support the development of trust during virtual collaborations.", "num_citations": "16\n", "authors": ["181"]}
{"title": "Technologies to support collaboration across time zones\n", "abstract": " Time zone differences are a challenge to global software engineering. This column surveys the key technologies and tools that support collaboration across time zones. The insights on technologies derive from a meta- analysis of the 2010 and 2011 IEEE International Conference on Global Software Engineering (ICGSE), among others.", "num_citations": "16\n", "authors": ["181"]}
{"title": "MuNDDoS: a research group on global software development\n", "abstract": " The purpose of this paper is to present the MuNDDoS Research Group, located at PUCRS University, in Porto Alegre, Brazil. This group was created in 2001, and since then is conducting several research projects on Global Software Development in Brazil, collaborating with research groups from other universities in Brazil and other countries. We present the research group goals, some of the projects developed, and the current projects", "num_citations": "16\n", "authors": ["181"]}
{"title": "Desenvolvimento distribuído de software: um modelo de classificação dos níveis de dispersão dos stakeholders\n", "abstract": " O objetivo deste artigo é propor um modelo de classificação dos níveis de dispersão dos stakeholders envolvidos em projetos de desenvolvimento distribuído de software. Para isto, propõem-se alguns critérios para a definição dos níveis de dispersão. O modelo de classificação proposto é parte resultante de uma dissertação de mestrado e foi aplicado em dois estudos de caso, cujos resultados são apresentados e discutidos. Estes estudos de caso compreendem uma organização multinacional que desenvolve projetos com equipes distribuídas em diversos países em mais de um continente. Esta pesquisa é caracterizada como exploratória, com estudo de caso como método de pesquisa principal. Como resultado, apresenta-se o modelo proposto, discutindo suas vantagens e a sua representação.", "num_citations": "16\n", "authors": ["181"]}
{"title": "Adopting agile methods in the public sector: a systematic literature review.\n", "abstract": " Agile software development (ASD) has become an important research topic. However, despite the increase in the number of studies in this area in the last few years, there is a lack of structured information about its adoption in the public sector. Since the public sector is the part of the economy concerned with providing various government services, the goal of this study is to report from a systematic literature review and provide information that may enhance the understanding of the implications of adopting ASD within public companies. As the main results, we found that ASD could indeed be adopted in the public sector. The analysis suggests that a good alternative is to start the adoption of ASD with people willing to change-strongly supported by senior management-working on important pilotprojects. Second, we found that job satisfaction is greater when adopting agile methods within public companies. Finally, we also found some barriers that are difficult to overcome, including the ingrained use of plan-drive methods, as well as big bang deliveries and lack of experience in ASD.", "num_citations": "15\n", "authors": ["181"]}
{"title": "An experiment on teaching coordination in a globally distributed software engineering class\n", "abstract": " The importance of planning and management skills in software development is very difficult to convey in software engineering courses. We present the synopsis of an assignment whose purpose is to demonstrate the significance of such skills, including effective communication, team coordination and collaboration, and overall project planning. The assignment is organized in the context of a distributed software engineering course carried out in collaboration with 12 universities in South America, Europe and Africa. The assignment is a globally distributed contest issued before most development activities related to the course's software project are performed, aiming at favoring the collaboration between students prior to project development. The contest does not involve any programming, and is not related to the project development activities. Instead, it consists of making teams in different countries compete in …", "num_citations": "15\n", "authors": ["181"]}
{"title": "Models and tools for managing distributed software development: a systematic literature review\n", "abstract": " Background: In the last decade, it was possible to notice a significant increas e in Distributed Software Development approach (DSD). Objective/Method: This research aimed to identify effective models and tools for supporting the DSD management through a systematic literature Review. Results/Conclusion: 25 primary studies reveal that since 2000, the number of studies on DSD has significantly increased, while only few tools have been developed. Therefore, there is a dearth of tools for supporting the overall managerial process on distributed software development.", "num_citations": "15\n", "authors": ["181"]}
{"title": "Global software engineering\n", "abstract": " SOFTWARE, LIKE ALL industry products, is the result of complex multinational supply chains with many partners from concept to development to production and maintenance. Global software engineering (GSE), IT outsourcing, and business process outsourcing during the past decade have showed growth rates of 10 to 20 percent per year. 1–3 This instalment of Practitioner’s Digest summarizes experiences and guidance from industry to facilitate knowledge and technology transfer for GSE. It’s based on industry feedback from the annual IEEE International Conference on Global Software Engineering, which had its 10th edition in 2015 (for more on ICGSE, see the sidebar).", "num_citations": "15\n", "authors": ["181"]}
{"title": "Exploring propinquity in global software engineering\n", "abstract": " In social psychology, propinquity refers to the physical (objective) or psychological (subjective) proximity between people. In this paper, we explore the psychological dimension of propinquity, by examining the phenomenon of feeling distant from geographically distributed people, in the context of distributed software teams. The lack of perceived distance is an important challenge faced by distributed teams, and it is frequently caused by factors beyond the physical distance, such as communication and cultural differences. The purpose of this paper is to propose and evaluate the usage of an innovative model to quantitatively evaluate the perceived distance in this context. The model was applied in a software development project with teams located in India and Brazil, and feedback was given by experts in the field. We present the model, details of its applications, analysis of the results, lessons learned, and practical …", "num_citations": "15\n", "authors": ["181"]}
{"title": "Comparing offshore outsourcing and the internal offshoring of software development: A qualitative study\n", "abstract": " Distributed Software Development involves a number of different business models. Most of the companies, when searching for external solutions in other countries (offshoring), usually have two main options: offshore outsourcing (contracting services with an external organization) and internal offshoring (contracting with a wholly owned subsidiary). Both models have been studied for a long time, and indicate the need for a great collaboration among the stakeholders to succeed in distributed development. For this reason, in this paper we compare offshore outsourcing and internal offshoring from the viewpoint of three management levels: strategic, tactical and operational. We present findings from a case study conducted in five multinational companies. The findings are presented in terms of aspects identified to improve the performance in offshore software development, and were analyzed based on two dimensions …", "num_citations": "15\n", "authors": ["181"]}
{"title": "A systematic mapping study on software startups education\n", "abstract": " This study aims to characterize the state-of-the-art of the software startup education by analyzing and identifying best practices, opportunities and gaps on this field. To do so, we conducted a systematic mapping study in order to analyze and evaluate studies on software startup education. As a result, we found 31 publications in this process. These studies were classified into four categories: real projects, multidiscipline, environment and teaching. We concluded that research on software startup education is still scarce. Furthermore, there are several gaps and opportunities to be explored in future works. One of them is the difficulty in providing a real world experience in a educational setting. Successful cases reported combine three major components: real world projects, the right environment and a multidisciplinary context.", "num_citations": "14\n", "authors": ["181"]}
{"title": "The good, the bad and the ugly: an onboard journey in software crowdsourcing competitive model\n", "abstract": " This paper reports on a study that aimed to characterize how crowd workers experienced for the first time the use of TopCoder, a crowdsourcing platform for software development that implements a competitive model. We explored how they perceived collaboration in this setting, what challenges they faced to perform a single task, and reflect upon their suggestions to overcome the challenges their experienced. More specifically, we asked graduate students to select a development challenge task, work on it, and submit their contribution to the platform. Early analysis of the results: (1) reveal the potential benefits of software crowdsourcing from the crowd perspective, (2) discuss collaboration in a competitive model, and (3) highlight that the onboarding process for newcomers is seen as challenging. We discuss our findings in light of current literature.", "num_citations": "14\n", "authors": ["181"]}
{"title": "The role of culture in interpreting qualitative data: methodological issues in an exploratory study of cross-cultural distributed software development\n", "abstract": " In this manuscript, we discuss several challenges for analyzing qualitative data in a study composed of an international research project team. The subject of the study is an exploratory examination of requirements engineering in an international and cross-cultural work environment. In undertaking this study, we have recognized that an important challenge in our study’s methodology, analysis of qualitative interviews, is that the members of the research team live in different countries, rely on different languages and originate from different cultures. Interestingly, we also recognize that these challenges are in many ways analogues to those inherent in the subject we are researching, requirements engineering. To explore these issues, we begin the paper by discussing requirements engineering and the challenges of working across distance, languages and cultures. We then discuss similar challenges for our analyzing the qualitative research data we plan to collect. Next are presented the research method and strategy we are developing to overcome these challenges.", "num_citations": "14\n", "authors": ["181"]}
{"title": "Innovation in information systems education-v the management of outsourcing: development of a module with implications for the it curriculum\n", "abstract": " We describe the development of a short module involving a globally distributed task with the objective of not only creating student awareness about the difficulties of managing outsourcing but also giving them experience in the process of learning about subtleties of project management and information requirements determination in a distributed environment. Professors from the US and Brazil at both the graduate and undergraduate level were involved. Courses ranging from IS Strategy and Introduction to IS to IS Project Management and Systems Analysis and Design were the target of the modules developed. A detailed discussion of the exercise, its role in the courses in which it was used and the results achieved are also presented.", "num_citations": "14\n", "authors": ["181"]}
{"title": "Diversity in software engineering\n", "abstract": " 1 Studies about diversity in Software Engineering (SE) are important to understand the disparity occurring nowadays at information technology workplaces. The goal of this work is to analyze the characteristics of diversity in SE and how to adapt SE practices when we have teams with diversity characteristics. We collected data by conducting a Systematic Literature Review (SLR) and semi-structured interviews aiming to identify what impacts of diversity can be observed in software development teams. We found that there are several challenges and barriers encountered in the work environment, and that inclusion and diversity can affect the software development teams positively.", "num_citations": "13\n", "authors": ["181"]}
{"title": "Facilitating contagion trust through tools in Global Systems Engineering teams\n", "abstract": " ContextIn Global Systems Engineering teams, researchers have found that trust can be transitive to some degree or imported (swift trust) under certain conditions. We argue that trust can be contagion and seeded by tools (spread from one individual to another through tools).ObjectiveWe sought to investigate the potential for using tools to support the development of trust in such teams and facilitate contagion trust. Specifically, we sought to investigate whether any existing tools support the development of trust in such teams and which information helps such development, whether the visualization of past collaborations would help developing trust, and what tools or features practitioners would wish for, if they had a magic wand.MethodWe interviewed 71 employees from five multinational organizations. We focused on gaining an understanding of the tools that are currently used to engender trust and the information …", "num_citations": "13\n", "authors": ["181"]}
{"title": "The Evolution of the Internal Offshore Software Development Model at Dell Inc.\n", "abstract": " Global software development not only enables lower operational costs, but makes it possible for companies to have an organizational branch which can drive standardization across all IT segments. Dell Inc global development services took off in 2001 and since then has expanded to Brazil, two centers in India, and one center in Russia. For six years these centers were to some extent independent, and performed the role of a software development consulting/factory inside Dell. Now, the global development centers have migrated to a business centric model, on which they are no longer a separate structure, but directly bound to the IT segments of each business area. The purpose of this paper is to show the evolution of the internal offshore software development model adopted by Dell and the results achieved by this endeavor.", "num_citations": "13\n", "authors": ["181"]}
{"title": "RiskFree–Uma ferramenta de gerenciamento de riscos baseada no PMBOK e aderente ao CMMI\n", "abstract": " Neste artigo é apresentada a ferramenta RiskFree, uma ferramenta desenvolvida para auxiliar as equipes de projetos de desenvolvimento de software a gerenciarem riscos em seus projetos. O enfoque principal do artigo é apresentar como a ferramenta está baseada nas boas práticas do PMBOK e aderente à área de processo de gerência de riscos do modelo CMMI. Também serão apresentadas algumas propostas de evoluções para a ferramenta.", "num_citations": "13\n", "authors": ["181"]}
{"title": "A reference model for global software development\n", "abstract": " The objective of this paper is to propose a reference model for global software development, based on the results found in a case study conducted in two software development units from multinational organizations located In Brazil. Since the number of organizations distributing their software development processes worldwide keeps increasing, this change is having a profound impact on the way products are conceived, designed, constructed, tested, and delivered to customers. The focus of this study is to understand the factors that enable multinationals and virtual corporations to operate successfully across geographic and cultural boundaries. Lessons learned and reference model are presented. Moreover, part of this model is being implemented in one of the organizations studied, and a preliminary evaluation is made.", "num_citations": "13\n", "authors": ["181"]}
{"title": "An evidence‐based model of distributed software development project management: results from a systematic mapping study\n", "abstract": " Distributed software development (DSD) has intensified over the past few years, and DSD project management is more complex than collocated project management. However, no systematic research effort has focused on aggregating evidence from the scientific literature to build models to support project management on DSD context. For these reasons, the goal of this paper is to build an evidence‐based model of DSD project management from the research findings about challenges of DSD and the practices, models and tools proposed and used to overcome these challenges. We based the construction of this model on the evidence collected and synthesized by a comprehensive systematic mapping study of 70 research papers published between 1997 and 2009. We believe that our results can help practitioners and researchers to better understand the challenges and implement more effective solutions to improve project management within distributed project management teams. These results also provide a mapping of the research about DSD project management, identifying areas where further research is needed. Copyright © 2011 John Wiley & Sons, Ltd.", "num_citations": "12\n", "authors": ["181"]}
{"title": "Requirements specification in distributed software development a process proposal\n", "abstract": " Distributed software development presents several characteristics that differentiate from co-located software development. Currently, one of the main difficulties imposed by geographically distributed software teams is the requirements engineering process. Traditional approaches to requirements process don’t cover the fundamental difficulties of dispersion, like communication and coordination. The objective of this study is to present a proposal to adapt the specification process to address the main challenges found in distributed software development environments.", "num_citations": "12\n", "authors": ["181"]}
{"title": "Requirements engineering in global software development: Preliminary findings from a case study in a SW-CMM context\n", "abstract": " The requirements engineering is an important phase in the software development process. In geographically distributed environments (Global Software Development), requirements become critical due to the characteristics of the distributed development (physical distance, cultural differences, trust, communication, etc). The objective of this paper is to analyze the requirements engineering in geographically distributed environments, identifying the main challenges. The results are based on a case study carried on at Dell Inc., a multinational organization that has offshore software development centers in Brazil, India and Russia, and was recently recognized as a level 2 organization in the SW-CMM Model in the Brazilian unit. The results suggest the necessity to adapt the requirements engineering to the distributed software development environment, addressing the main existing challenges. The problems and the …", "num_citations": "12\n", "authors": ["181"]}
{"title": "Knowledge transfer, translation and transformation in the work of information technology architects\n", "abstract": " ContextInformation Technology (IT) architects are the professionals responsible for designing the information systems for an organization. In order to do that, they take into account many aspects and stakeholders, including customers, software developers, the organization’s business, and its current IT infrastructure. Therefore, different aspects influence their work.ObjectiveThis paper presents results of research into how IT architects perform their work in practice and how different aspects are taken into account when an information system is developed. An understanding of IT architects’ activities allows us to better support their work. This paper extends our own previous work (Figueiredo et al., 2012) [30] by discussing aspects of knowledge management and tool support.MethodA qualitative study was conducted using semi-structured interviews for data collection and grounded theory methods (Strauss and Corbin …", "num_citations": "10\n", "authors": ["181"]}
{"title": "Challenge based startup learning: a framework to teach software startup\n", "abstract": " The advances in technology have enabled people to develop services and products that can reach millions of people around the world. Facebook and Google are examples of successful startups. However, most startups fail in their first years of life. From an education standpoint, even though universities are adapting their curriculums in order to embrace startup education content, the challenge still remains: how can we provide real world experiences for students to build relevant startups? In order to fill this gap, this paper introduces the Challenge Based Startup Learning, a framework that combines the Challenge Based Learning methodology with Lean Startup and Customer Development concepts, supported by software development techniques. We have applied and evaluated the framework in an undergraduate digital entrepreneurship course. Our preliminary results indicate that students not only understood …", "num_citations": "9\n", "authors": ["181"]}
{"title": "Perceptions on diversity in Brazilian agile software development teams: A survey\n", "abstract": " A lot has been said about the importance of talking about diversity in Computer Science and Software Engineering. There is a clear lack of representativeness when we observe gender distribution in Information Technology jobs and students in universities, for example. Diversity is good beyond ethic reasons, it's recognized as valuable and, lot of studies have been done about it. Large technology companies have been creating annual reports of their efforts to have a more diverse workforce, increasing minority numbers through recruiting, working to minimize unconscious bias and also investing in programs to increase representativeness. In this paper, we present a work in progress study that links a definition of diversity to the results of a survey applied to explore the perceptions of diversity in agile software development teams in Brazil and an initial analysis focusing mainly on the role of women in those teams.", "num_citations": "9\n", "authors": ["181"]}
{"title": "Revisiting the factors that engender trust of global systems engineers\n", "abstract": " Trust is generally considered a key element of effective and productive distributed team collaborations. In this paper, we report the results of our investigation into the factors that engender trust in Global Systems Engineering (GSE) teams in five multinational organizations. We extend our previous work by conducting a new field study focused solely on factors that engender trust and identify the implications of these factors. Our work provides significant contributions to practitioners, researchers and tool developers. Managers working in study field sites have confirmed that our findings will be used to inform future team management strategies. Our results can also be used to structure and guide future research in this field, as it identifies gaps in existing literature. Finally, our findings can be used to inform the development of future tools that aim to support collaborative work in general and GSE teams specifically.", "num_citations": "9\n", "authors": ["181"]}
{"title": "Modelos de Colaboração no Desenvolvimento Distribuído de Software: uma Revisão Sistemática da Literatura\n", "abstract": " With the rise of Distributed Software Development, software houses attempt to find out the best strategy to improve the development of products and services in a distribuited way, but without losing quality at a low cost. This work proposes to identify what models of collaboration are used by organizations to develop software within a distributed context, based on the traditional development life cycle, where the phases thereof are performed (onsite, distributed/offshore and multi-site). The research method used to investigate the forms of cooperation was a systematic literature review that have examined 841 papers published from 2000 to 2009.Resumo. Com a ascensão do Desenvolvimento Distribuído de Software as organizações tentam distribuir da melhor maneira possível suas atividades de desenvolvimento com interesse de melhorá-las. O objetivo deste trabalho é identificar quais modelos de colaboração são utilizados pelas organizações para desenvolver software no contexto distribuído, tendo como base o ciclo de vida básico do desenvolvimento tradicional, e onde as fases do mesmo são realizadas (onsite, distribuído/offshore e multi-site). O método de pesquisa utilizado para levantar as formas de colaboração foi uma revisão sistemática da literatura que analisou 841 trabalhos publicados desde 2000 até 2009.", "num_citations": "9\n", "authors": ["181"]}
{"title": "Transitioning from Distributed and Traditional to Distributed and Agile: An Experience Report\n", "abstract": " Global companies that experienced extensive waterfall phased plans are trying to improve their existing processes to expedite team engagement. Agile methodologies have become an acceptable path to follow because it comprises project management as part of its practices. Agile practices have been used with the objective of simplifying project control through simple processes, easy to update documentation and higher team iteration over exhaustive documentation, focusing rather on team continuous improvement and aiming to add value to business processes. The purpose of this chapter is to describe the experience of a global multinational company on transitioning from distributed and traditional to distributed and agile. This company has development centers across North America, South America and Asia. This chapter covers challenges faced by the project teams of two pilot projects, including …", "num_citations": "9\n", "authors": ["181"]}
{"title": "Padrões de evolução na prática de desenvolvimento distribuído de software em ambientes de internal offshoring: um modelo de capacidade\n", "abstract": " Abstract (native): A comunidade de Engenharia de Software (ES) tem testemunhado uma mudança significativa na forma com que os projetos de software têm sido desenvolvidos nos últimos anos. As equipes vêm sendo organizadas de forma distribuída, e o termo Desenvolvimento Distribuído de Software (DDS) tem sido cada vez mais utilizado na indústria. Para se inserir em um ambiente distribuído, uma organização geralmente define a estratégia baseada em um modelo de negócio de DDS. No DDS em escala global os dois principais modelos são o offshore outsourcing (contratação de uma organização externa, localizada em outro país) e o internal offshoring (criação de uma unidade da própria organização, também localizada em outro país). Esta pesquisa tem por objetivo entender e identificar padrões de evolução das práticas das organizações envolvidas com o internal offshoring, contribuindo com o ainda incipiente corpo de conhecimento na área. Este entendimento também é útil para aquelas empresas iniciando operações de DDS, que poderão se beneficiar do conhecimento de práticas que foram aplicadas em outras organizações no passado. Desta forma, o resultado desta pesquisa é um modelo de capacidade que descreve padrões de evolução na prática de DDS em uma ou mais unidades (centros de desenvolvimento) no modelo de internal offshoring. O modelo está organizado em três dimensões, quais sejam: níveis de capacidade, áreas de capacidade (pessoas, projetos, portfólios e unidades) e atributos de capacidade. Para propor o modelo de capacidade optou-se por um estudo qualitativo em retrospectiva …", "num_citations": "9\n", "authors": ["181"]}
{"title": "A systematic mapping study of diversity in software engineering: a perspective from the agile methodologies\n", "abstract": " Diversity is being discussed intensively by different knowledge areas. Some studies show that diversity builds better teams, delivers better results, and more. Cognitive diversity is linked to better outcomes, and studies show that cognitive diversity is influenced by identity diversity (e.g., gender, race, age, etc.), mainly when tasks are related to problem-solving and prediction. The discussions about diversity in Software Engineering are increasing as well. There is a known lack of representativeness from some groups when we talk about identity diversity as, for example, gender and race. To support diversity in Software Engineering is valuable and it is especially relevant once we are dealing with problem-solving. In this work, we are interested in understanding how the subject is being conducted in Software Engineering-related research and more specifically, in Agile Methodologies. For that we conducted a …", "num_citations": "8\n", "authors": ["181"]}
{"title": "A collaborative approach to teaching software startups: findings from a study using challenge based learning\n", "abstract": " Education on software startups is taken its first steps. A multidisciplinary and collaborative approach seems to be key to deliver a high quality software startup development program. In this sense, we conducted a study describing the path of 191 students through a startup mobile application development program. Our preliminary results indicate that using Challenge Based Learning methodology combined with agile practices can strengthen students' collaboration and engagement into the process.", "num_citations": "8\n", "authors": ["181"]}
{"title": "Software startup education around the world: a preliminary analysis\n", "abstract": " New software startups are born everyday around the world. Nonetheless, failure is the fate of most of them. The community already knows that several facts, such as market competition or lack of resources, can impact the destiny of a startup. However, little has been explored in term of the impact of software startup education on the success of failure of startups. In this sense, this study presents the initial steps that we are taking to understand how software startups are taught around the world. To do so, we design a qualitative survey aimed at software startup educators at Universities. Our goal is to gather enough information so we can help the academic community in improving their own courses. So far, we have gathered 10 responses from lecturers across the globe. This paper describes these findings.", "num_citations": "8\n", "authors": ["181"]}
{"title": "Reporting empirical evidence in distributed software development: An extended taxonomy\n", "abstract": " Distributed Software Development (DSD) has been discussed by industry and academia for almost two decades now, and, as consequence, there is a large number of empirical scientific papers and industrial reports on it. However, the description of the context in which the empirical study was conducted is not always clear or complete, making the process of searching for empirical evidence burdensome. It becomes difficult to understand or to judge the relevance of study given that DSD scenarios are diverse. What works in one context might not apply to another. To reduce such difficulty, we need, as a research community, to have means to standardize how we report empirical studies and their findings aiming to make them more readily available to practitioners and researchers. In this paper we present an extended taxonomy to classify empirical DSD evidence. We conducted an expert opinion survey with …", "num_citations": "8\n", "authors": ["181"]}
{"title": "Crowdsourcing in the Brazilian IT industry: what we know and what we don't know\n", "abstract": " Crowdsourcing means outsourcing to a large network of people–a crowd. It has emerged as a new option for a global labor market; it is another valuable option in the make or buy software decision and has been gaining attention in countries where global software engineering plays a significant role, such as Brazil. The adoption of this practice in the Brazilian IT industry is not well known yet. For this reason, this paper presents findings from an empirical study about the topic, in the context of a multi-year study that has the goal of investigating how the Brazilian software labor and industry market is being transformed and disrupted by crowdsourcing. We interviewed professionals from several companies and identified how crowdsourcing is being adopted in Brazil, including possible benefits, main concerns and factors that may avoid some companies to adopt it from three different perspectives: the buyers, the …", "num_citations": "8\n", "authors": ["181"]}
{"title": "Follow-the-sun methodology in a stochastic modeling perspective\n", "abstract": " Stochastic modeling of globally distributed projects has become a way to evaluate the performance of teams working in different time zones. The interest in extracting and analyzing quantitative data from geographically dispersed teams has grown throughout the years as major development companies were attracted by potential benefits. We direct our attention to Follow-The-Sun (FTS), a special case of globally distributed projects, where work is handed off every day from one development site to the next on a different time zone. The main benefit of FTS is to reduce project duration providing continuous software development. Our objective in this paper is to discuss a formal mapping of FTS characteristics to a stochastic model in order to predict performance indices of teams such as availability and risk assessment. The modeling effort aims to enhance understanding and feasibility evaluation for FTS projects.", "num_citations": "8\n", "authors": ["181"]}
{"title": "Avaliando os impactos dos aspectos não-técnicos da engenharia de software em ambientes de desenvolvimento global de software: um caso prático\n", "abstract": " Global software development has attracted a great number of researches in software engineering in the last years. Managers and executives face many challenges and difficulties in all levels, including technical and non-technical aspects. In particular the non-technical aspects include dimensions that go beyond the “right-wrong” method of acting. Very often these factors are under evaluated, showing a significant impact for the whole project. For this reason, the purpose of this paper is to present the results of a case study where we observed the main non-technical aspects of software engineering in global software development environments.Resumo. O desenvolvimento global de software tem atraído um grande número de pesquisas na área de engenharia de software nos últimos anos. Gerentes e executivos têm enfrentado diversos desafios e dificuldades em diferentes níveis, desde os aspectos técnicos até os aspectos não-técnicos. Em particular, os aspectos não-técnicos englobam dimensões que vão além do método “certo-errado” de se agir. Freqüentemente, o esforço empreendido nos aspectos não-técnicos é subestimado, mas são aspectos fundamentais neste contexto. O objetivo deste artigo é apresentar os resultados de um estudo de caso onde foram observados alguns dos principais aspectos não técnicos da engenharia de software em ambientes de desenvolvimento global.", "num_citations": "8\n", "authors": ["181"]}
{"title": "Enablers and inhibitors of experimentation in early-stage software startups\n", "abstract": " Software startups are temporary organizations that develop innovative software-intensive products or services. Despite of numerous successful stories, most startups fail. Several methodologies were proposed both in the scientific and commercial literature to improve their success rate, and a common element among them is the idea of experimentation. This concept was brought to software development as an approach focused on taking critical product assumptions as hypotheses and developing experiments to support or refute them. Although well-known methodologies are based on this idea, the literature shows that software startups still do not follow this approach. The goal of this paper is to identify the enablers and inhibitors of experimentation in early-stage software startups. To achieve the goal, we performed a multiple-case study of four software startups. The results comprise a set of enablers and …", "num_citations": "7\n", "authors": ["181"]}
{"title": "An empirical study on software engineering and software startups: findings from cases in an innovation ecosystem\n", "abstract": " Todos os itens no Repositório da PUCRS estão protegidos por copyright, com todos os direitos reservados, e estão licenciados com uma Licença Creative Commons-Atribuição-NãoComercial 4.0 Internacional. Saiba mais.", "num_citations": "7\n", "authors": ["181"]}
{"title": "Can distributed software development help the practitioners to become better software engineers? insights from academia\n", "abstract": " Distributed software development is a reality. While this area is increasing, it is also necessary to prepare software development professionals to develop software in distributed environments. with the evolution of this area, it has been observed that the experience acquired in DSD projects can help to improve the performance in traditional projects as well. In this context, the purpose of this paper is to explore in what extent the experience with DSD can improve the performance of software development professionals, even in collocated environments. Data was collected based on the evaluation of a DSD teaching experience in a course taught in Brazil. The preliminary results indicate that experiences lived in a distributed context could help software engineers to become better practitioners.", "num_citations": "7\n", "authors": ["181"]}
{"title": "Uma Abordagem para a Realização de Diagnóstico Inicial em Empresas que Implementam o MPS. BR\n", "abstract": " This paper describes an approach to perform a gap analysis as the first activity to take place in a MPS. BR project in companies located in Rio Grande do Sul, in a project coordinated by Softsul (Softex agent). We share in this paper our experience creating this approach, using as references the MPS. BR and the CMMI models, and the appraisal methods CBA IPI and SCAMPI. We also considered a mapping between MPS. BR and CMMI models and ISO/IEC 12007 standard to help in the interpretation and the results analysis.Resumo. Este artigo descreve uma abordagem para a realização de um diagnóstico inicial em empresas que estão implementando o modelo MPS. BR no Rio Grande do Sul, em um projeto coordenado pela Softsul (agente Softex). O artigo descreve nossa experiência na criação desta abordagem, que está baseada nos modelos de referência MPS. BR e CMMI e nos métodos de avaliação CBA IPI e SCAMPI. Considerou-se ainda um mapeamento entre os modelos MPS. BR, CMMI e norma ISO/IEC 12207, utilizado para facilitar o entendimento e interpretação dos resultados encontrados.", "num_citations": "7\n", "authors": ["181"]}
{"title": "A Maturity Model for Offshore Insourcing: A Research Proposal\n", "abstract": " The objective of this paper is to present a research proposal toward a maturity model for distributed IT projects for those organizations involved with offshore insourcing. Although offshore insourcing bypasses some of the tough contracting difficulties found in organizations that are involved with traditional offshore outsourcing, a whole different set of issues is created. However, some of the “new” issues that surface a particular organization may have already been dealt with by more experienced organizations. The maturity model will therefore not only identify best practices along difference maturity stages but also help to benchmark against similar organizations. Our research suggest that there is a very consistent sequence of phases that this particular type of IT offshore sourcing follows, and the study is based on a rigorous research method. We expect to have preliminary results by August 2004.", "num_citations": "7\n", "authors": ["181"]}
{"title": "Desenvolvimento distribuído de Software e Processos de Desenvolvimento de Software\n", "abstract": " Hoje em dia, ao mesmo tempo em que a área da engenharia de software se desenvolve de uma forma cada vez mais rápida, é necessário desenvolver software de altíssima qualidade. Com o passar dos anos e durante a evolução desta área, é interessante observar como alguns dos princípios fundamentais desse desenvolvimento permanecem os mesmos de 30 anos atrás e como os desafios que os engenheiros de software encontram hoje são semelhantes aos existentes quando a engenharia de software ainda engatinhava. Após 30 anos, ainda temos que nos esforçar para desenvolver softwares confiáveis [PET 01]. Neste contexto, percebe-se cada vez mais a necessidade das organizações desenvolverem software tendo por base um processo bem definido. De acordo com o que foi escrito em [PRI 02b], um processo de software é representado por um modelo. Existem diversos modelos na área de …", "num_citations": "7\n", "authors": ["181"]}
{"title": "Towards a model of software development process for a physically distributed environment\n", "abstract": " The goal of this article is to present the first results of a study looking forward to propose a model of software development for a physically distributed environment (United States and Brazil). Thus, the objective is to combine empirical and theoretical knowledge in the software development area, aiming to minimize communication problems found in this specific environment. As result, the article proposes the addition of two new phases in the software development process, planning and evaluation, based on Unified Process and the UML language. The purpose is to demonstrate through illustrations and discussions, how these two phases are engaged in the process as a whole and what they represent. Some points open to discussion, which are themes for future researches, are identified, aiming to propose a model of software development for a physically distributed environment. The empirical basis of the study involves the EBusiness Research Center, a partnership of Dell Computers with PUCRS.", "num_citations": "7\n", "authors": ["181"]}
{"title": "Brazilian Startups and the Current Software Engineering Challenges: The Case of Tecnopuc.\n", "abstract": " Brazil is consolidating itself in the world of software startups, both by the strength of the market and by the innovation ecosystems that help these new companies to start and grow. In this chapter, we present the technical challenges that these software startups encounter. We share our experience at Tecnopuc, one specific STP located in the south of Brazil, with more than 170 organizations, from which 90 are startups. We present a set of technical challenges that relate to the following steps in developing an MVP: requirements engineering, product prototyping, architectural design, and software testing. Based on the analysis of these challenges, we reflect on how innovation ecosystems such as science and technology parks (STP) could help startups on addressing the challenges identified.", "num_citations": "6\n", "authors": ["181"]}
{"title": "Perceived benefits and challenges of learning startup methodologies for software engineering students\n", "abstract": " The need of skills other than technical from software developers is becoming evident. The DevOps movement is an example of that applied to operational tasks. Startup development methodologies focus on business activities in innovative organizations. Several universities offer courses based on these methodologies to software engineering students, mainly to improve their creativity, problem solving, and business skills. This paper investigates how software engineering students learned startup development methodologies and discusses what are the challenges and benefits in their learning process. We conducted a multi-method study in three different universities. The data was collected in two phases and analyzed using thematic analysis. Our study reveals that students realized the importance of collaboration with other courses and the importance of user involvement in development. However, students tend to …", "num_citations": "6\n", "authors": ["181"]}
{"title": "Um Modelo para o Cálculo da Distância Percebida Relativa em Equipes Distribuídas de Desenvolvimento de Software\n", "abstract": " One of the great challenges faced by distributed software development teams is the lack of perceived distance among project team members. The lack of perception is frequently caused by factors beyond the physical distance, such as communication problems and cultural differences. In this paper, we present a model to quantitatively calculate the perceived distance in distributed software development teams, based on a conceptual model. Preliminary results indicate the possibility to use the model in industry to help and guide the management of distributed stakeholders.Resumo. Uma das maiores dificuldades enfrentadas por equipes distribuídas de desenvolvimento de software é a falta de percepção da distância existente entre colaboradores em um mesmo projeto. Esta falta de percepção geralmente é causada por um conjunto de fatores além da distância física, tais como diferenças culturais e dificuldades de comunicação. Neste artigo, a partir de um modelo conceitual de dispersão de equipes distribuídas, é proposto um modelo para o cálculo da distância percebida relativa destas equipes. Resultados preliminares indicam a possibilidade de utilizar o modelo para apoiar a gestão dos colaboradores distribuídos.", "num_citations": "6\n", "authors": ["181"]}
{"title": "The best software development teams might be temporary\n", "abstract": " A study of a large company's software development projects indicates that quality often suffers if team members have worked together previously. Thus, in many cases, temporary teams might be best.", "num_citations": "5\n", "authors": ["181"]}
{"title": "Virtual Team Configurations that Promote Better Product Quality\n", "abstract": " Managers need to decide on how they will configure their virtual teams each time a new project starts. So questions such as' Which countries should be involved in the project?'and'How large should the team size be?'need to be answered before hand. Project configurations are known to affect communication, coordination and collaboration aspects of a project, and as a consequence, its performance. Therefore, a challenge managers face is knowing which configurations promote better project outcomes when working with virtual software teams. This article reveals a set of configurations that have promoted the quality of software products developed by virtual teams to support the business of a Fortune 500 large IT multinational company. These configurations can be used as a guideline by managers to set up their own virtual teams. Recommendations on how to set up virtual teams based on the study are then …", "num_citations": "5\n", "authors": ["181"]}
{"title": "On the Agile Transformation in a Large-Complex Globally Distributed Company: Why Boarding this Journey, Steps Taken and Main Foreseen Concerns\n", "abstract": " ORG, fictitious name, is a large company with complex-globally distributed projects that has recently started a \"big-bang\" transition to agile. About a year ago the new CIO announced it was time to aim for faster deliveries and decided on a company-wide roll-out to agile, including legacy systems. In this paper we report on an interview-based qualitative study that aimed to identify the reasons of why the company is moving to an agile approach, the steps took towards becoming agile during this first year of work, and the main concerns of management given the size of the company, the complexity of the projects developed, and the team's global distribution. We interviewed 18 managers, including members of the board committee that support the CIO in strategic decisions. Our findings add to the current literature on the topic by discussing the transformation in a large-complex scenario that, to the best of our knowledge …", "num_citations": "5\n", "authors": ["181"]}
{"title": "The interplay among trust, risk, and reliance in global systems engineering teams\n", "abstract": " Trust is an integral element of any collaboration. We sought to investigate the interplay among trust, risk, and reliance within the context of Global Systems Engineering (GSE) teams. To this end, we conducted an empirical study of individuals' processes and considerations when presented with hypothetical scenarios that required long-term and short-term commitments, in addition to relinquishing control to others in their team. In this paper, we present the results of our 1-1 interviews of 57 individuals collaborating in GSE teams within five organizations. Our results suggest that study participants often readily trust their peers and those higher in the organizational hierarchy when no long-term commitment is required, and the participant retains control of the scenario. Our study findings also suggest that this finding does not necessarily extend to scenarios in which their decision entailed loss of control and thus higher …", "num_citations": "5\n", "authors": ["181"]}
{"title": "Trust in Electronically-Supported Networks of Political Activists\n", "abstract": " This position paper is based on experiences and insights gathered in several long-term studies of the ICT usage of political activists and civil society networks. These studies include the introduction of a community system for Iranian NGOs,(participant) observation of the European Social Forum (and its respective organization committees), and interviews with Palestine activists fighting against Israeli occupation, using social media platforms. The position paper is mainly interested in the particular need for trust of political activists, who quite often are endangered by political conflicts, disrupted environments and instable situations, investigation by authorities, imprisonment etc.", "num_citations": "5\n", "authors": ["181"]}
{"title": "On the role of information technology systems architects\n", "abstract": " Information Systems in large organizations are seldom built from scratch. They have to be built taking into account different existing aspects like customers, organization’s business, and its current Information Technology (IT) infrastructure, among others. IT architects are the professionals who take all these aspects into account when designing an information system. Despite their importance, the work of these professionals is barely understood. This research aims to fill this gap by describing a qualitative study we conducted with IT architects. We use semi-structured interviews for data collection and analyzed our data using grounded theory methods. Our results suggest that there are different IT architect roles in every company and that the activities performed by them are highly interconnected and these interconnections are fundamental for the information diffusion and collaboration in projects.", "num_citations": "5\n", "authors": ["181"]}
{"title": "Towards a requirements reuse method using Product Line in distributed environments.\n", "abstract": " Distributed Software Development (DSD) is a recent approach where the teams are geographically distributed. Some characteristics of these environments have significant impact in activities that require constant communication, shared vision and stakeholder’s cooperation, as we have in Requirements Engineering (RE).", "num_citations": "5\n", "authors": ["181"]}
{"title": "RiskFree–Uma Ferramenta de Apoio à Gerência de Riscos em Projetos de Software\n", "abstract": " Neste artigo é apresentada a ferramenta RiskFree. A ferramenta tem como objetivo auxiliar gerentes de projetos e suas equipes a gerenciar riscos em projetos de desenvolvimento de software. Uma das principais características da ferramenta é o fato de poder ser adaptada para contemplar a realidade da organização em que for inserida. Além disso, ela foi desenvolvida de acordo com as práticas e objetivos da área de processo de gerência de riscos do nível três do modelo CMMI.", "num_citations": "5\n", "authors": ["181"]}
{"title": "Uma Avaliação das Equipes de Projeto em um Momento Pré-Avaliação Oficial de um Programa de Melhoria de Processo de Software visando o CMMI nível 2\n", "abstract": " Geralmente, a participação das equipes de projetos em programas de melhoria da qualidade está centrada na definição de processos, ajuda na validação, podendo ainda ministrar treinamentos ou ainda participar do SEPG da empresa. Mas ao mesmo tempo, sabe-se que existe um desafio entre o tempo de dedicação para um projeto como este e as atividades rotineiras de projetos de software. Além disso, a necessidade de preparação das equipes de projeto para uma avaliação oficial sempre é considerado um fator crítico. Desta forma, o objetivo deste artigo é relatar uma avaliação realizada com equipes de projeto selecionados para uma avaliação oficial no modelo CMMI visando o nível 2. Ao final, lições aprendidas são identificadas.", "num_citations": "5\n", "authors": ["181"]}
{"title": "Um Caso Prático de Implantação da Gerência de Risco em Ambientes de Desenvolvimento Distribuído de Software, baseado no Modelo CMMI\n", "abstract": " O objetivo deste artigo é apresentar um relato de implantação de um processo de gerência de risco em um ambiente de desenvolvimento distribuído de software, visando atender os requisitos do modelo CMMI nível 3. A implantação foi realizada em um centro de desenvolvimento de software de uma organização multinacional. Ao final, identificam-se algumas lições aprendidas do acompanhamento realizado.", "num_citations": "5\n", "authors": ["181"]}
{"title": "Os Aspectos Não-Técnicos Intervenientes no Desenvolvimento Distribuído de Software\n", "abstract": " O desenvolvimento distribuído tem atraído um grande número de pesquisas na área de engenharia de software nos últimos anos. Os engenheiros de software têm reconhecido a grande influência desta nova forma de trabalho e estão em busca de modelos que facilitem o desenvolvimento de software com equipes geograficamente distantes. Além dos engenheiros, gerentes e executivos têm enfrentado diversos desafios e dificuldades em diferentes níveis, desde os aspectos técnicos até os aspectos não-técnicos. No caso dos aspectos não-técnicos, são cada vez mais freqüentes as dificuldades que um ambiente de desenvolvimento distribuído de software apresenta. Neste sentido, o objetivo deste artigo é identificar os principais aspectos não-técnicos da engenharia de software presentes nestes ambientes, além de convergir para a necessidade de uma abordagem mais interdisciplinar para tratar os aspectos identificados.", "num_citations": "5\n", "authors": ["181"]}
{"title": "Surveying the impacts of COVID-19 on the perceived productivity of Brazilian software developers\n", "abstract": " The new coronavirus pandemic has forced companies around the world to adopt measures to stop the spread of this virus and the associated COVID-19 disease. In Brazil, this was no different with software development professionals having to work from home (WFH) due to the need of social isolation. WFH was an imposition and was a new experience for many professionals, generating unpredictable impacts. In this article, we present the results of a survey to understand the impacts of social isolation on the perceived productivity of Brazilian software developers. Data were collected during March and April/2020 with a sample of 413 respondents. The results indicate developers' perceived productivity has increased, mainly because there are fewer interruptions throughout the day. In addition, most respondents informed that they wish to continue working most of the time remotely. We contrast our results with …", "num_citations": "4\n", "authors": ["181"]}
{"title": "Practices and tools for software start-ups\n", "abstract": " Software start-ups have become increasingly important to the economy and are a key to innovation. However, these companies face many challenges, such as balancing short-term and future needs with respect to technology, processes, and tools.", "num_citations": "4\n", "authors": ["181"]}
{"title": "ADAPT: A Framework for Agile Distributed Software Development\n", "abstract": " A growing number of developers are using agile practices in distributed software projects. Researchers have created the ADAPT (Agile Distributed Adaptable Process Toolkit) framework to guide the implementation of agile practices in distributed environments. The Web Extras detail the research methods the authors employed.", "num_citations": "4\n", "authors": ["181"]}
{"title": "A Set of Practices for Distributed Pair Programming.\n", "abstract": " Geographically distributed teams have adopted agile practices as a work strategy. One of these practices is Distributed Pair Programming (DPP) that consists in two developers working remotely on the same design, algorithm, or code. In this paper, we describe a set of practices for DPP. In our research we seek to understand how distributed teams can use and adopt DPP in a more effective way. Based on a systematic literature review and a field study, we suggest twelve practices that can help both professionals and software organizations in the practice of DPP.", "num_citations": "4\n", "authors": ["181"]}
{"title": "Ensino da Engenharia de Software por meio de Fábricas de Software no contexto Distribuído: Um Relato de Experiência\n", "abstract": " Globalization has enabled the development of software evolved significantly, creating the Distributed Software Development. Given this development environment, it is necessary to hire professionals who can perform well development activities in this scenario. Therefore, the learning centers need to create a motivating environment in which to prepare professionals for the market. This paper aims to report the experience of students in learning the concepts of software engineering, using a pedagogical tool a small software factory through of a real project and working in a distributed environment.Resumo. A globalização permitiu que o desenvolvimento de software evoluísse significativamente, criando o Desenvolvimento Distribuído de Software. Diante deste ambiente de desenvolvimento, faz-se necessário a contratação de profissionais que possam desempenhar bem as atividades de desenvolvimento neste cenário. Dessa forma, os centros de ensino precisam criar um ambiente motivador, no qual seja possível preparar profissionais para o mercado. O objetivo nesse artigo é relatar a experiência de alunos no aprendizado dos conceitos de engenharia de software, utilizando como ferramenta pedagógica uma pequena fábrica de software com um projeto real trabalhando de maneira distribuída.", "num_citations": "4\n", "authors": ["181"]}
{"title": "QUASE-A quantitative approach to analyze the human aspects of software development projects\n", "abstract": " A manager's most important and most difficult job is to manage people. If software is created by people, the human side of software development is crucial to the success of a project. In this position paper, we argue that a quantitative approach to analyze the human aspects of software development may contribute to a better understanding of different expectations and a better management of people and projects.", "num_citations": "4\n", "authors": ["181"]}
{"title": "O uso de jogos educacionais para o ensino de gerência de projetos de software\n", "abstract": " Hoje em dia, existe uma demanda cada vez maior pelo aprendizado de gerenciamento de projetos e de formas não-triviais para ensinar aqueles que ainda não possuem experiência na área. Por este motivo, este artigo apresenta a idéia de usar jogos para apoiar o ensino de gerência de projetos de software, a partir da experiência da PUCRS e na UNIVALI. Apresentamos a motivação para o uso de jogos no ensino de gerência de projetos e três jogos desenvolvidos nas duas instituições para o ensino nesta área.", "num_citations": "4\n", "authors": ["181"]}
{"title": "'S introduction: The challenge of a sociotechnical perspective to software engineering'\n", "abstract": " Henrique Cukierman, 'S introduction: The challenge of a sociotechnical perspective to software engineering' - PhilPapers Sign in | Create an account PhilPapers PhilPeople PhilArchive PhilEvents PhilJobs PhilPapers home Syntax Advanced Search Syntax Advanced Search Syntax Advanced Search 'S introduction: The challenge of a sociotechnical perspective to software engineering' Henrique Cukierman Scientia 18 (1):4-6 (2007) Abstract This article has no associated abstract. (fix it) Keywords No keywords specified (fix it) Categories Software in Philosophy of Computing and Information (categorize this paper) Options Edit this record Mark as duplicate Export citation Find it on Scholar Request removal from index Revision history Download options PhilArchive copy Upload a copy of this paper Check publisher's policy Papers currently archived: 59,290 External links This entry has no external links. Add one. Setup …", "num_citations": "4\n", "authors": ["181"]}
{"title": "Towards specific software engineering practices for early-stage startups\n", "abstract": " In this position paper, our goal is to argue the need for specific software development practices to early-stage startups. In order to reach this goal, we discuss the consequences of innovative and marketdriven contexts, which are two of the key elements when describing software startups. We also argue that these practices could be applied to innovative initiatives within established companies since they share similar characteristics and challenges as those from startups.", "num_citations": "3\n", "authors": ["181"]}
{"title": "How machine learning has been applied in software engineering?\n", "abstract": " Machine Learning (ML) environments are composed of a set of techniques and tools, which can help in solving problems in a diversity of areas, including Software Engineering (SE). However, due to a large number of possible configurations, it is a challenge to select the ML environment to be used for a specific SE domain issue. Helping software engineers choose the most suitable ML environment according to their needs would be very helpful. For instance, it is possible to automate software tests using ML models, where the model learns software behavior and predicts possible problems in the code. In this paper, we present a mapping study that categorizes the ML techniques and tools reported as useful to solve SE domain issues. We found that the most used algorithm is Naıve Bayes and that WEKA is the tool most SE researchers use to perform ML experiments related to SE. We also identified that most papers use ML to solve problems related to SE quality. We propose a categorization of the ML techniques and tools that are applied in SE problem solving, linking with the Software Engineering Body of Knowledge (SWEBOK) knowledge areas.", "num_citations": "3\n", "authors": ["181"]}
{"title": "MVP Development Process for Software Startups\n", "abstract": " This paper presents a proposal of a Minimal Viable Development Process for Software Startups that can be used during the MVP development process. Defining a methodology is a major challenge for startups because they are creative, flexible, and reluctant to include bureaucratic measures in their day-to-day procedures that may disrupt their natural attributes. Thus, to make the process simple, we defined it in 3 main phases: requirements gathering, software development, and market validation.", "num_citations": "3\n", "authors": ["181"]}
{"title": "Confidence in programming skills: gender insights from StackOverflow developers survey\n", "abstract": " Diversity is being intensively discussed by different knowledge areas of society and discussions in Software Engineering, are increasing as well. There are unconscious bias and lack of representativeness and when we talk about characteristics as ethnicity and gender, to mention a few. Studies say that diversity builds better teams and delivers better results, among other benefits. StackOverflow is a popular community question & answer forum, with a high engagement of software developers. Yearly, they apply a survey, present straightforward results, and made the anonymized results available for download, so it is possible to perform additional analysis beyond the original ones. Using data visualization techniques, we analyzed 2018 data to extract some insights about how genders see their confidence in programming skills. Results show that respondents from under-represented groups tend to believe they are …", "num_citations": "3\n", "authors": ["181"]}
{"title": "Integrating Challenge Based Learning Into a Smart Learning Environment: Findings From a Mobile Application Development Course (P).\n", "abstract": " Training students on mobile application development inherits the challenges of teaching software engineering where the target computer is a device that has a large number of features accessible by software. Furthermore, the most related experience in teaching students reveals difficulties in developing software engineering competencies. In this paper we present results from an iOS course held in a smart learning environment that adopted the Challenge Based Learning framework as the teaching methodology. Our results indicate that combining an active methodology along with an engaging environment can foster and improve software development learning.", "num_citations": "3\n", "authors": ["181"]}
{"title": "How the Scrum Adoption Relates to Productivity of Software Development Teams?\n", "abstract": " Implementation projects of new technologies should understand the immediate impact that this change causes on professionals involved in relation to the work process.In the first months of technological change is possible to identify a certain resistance and even some conflicts affecting the satisfaction and productivitys levels in teams.In this sense, the aim of this paper is to present a conceptual model of how the Scrum adoption relates to productivity of software development teams.", "num_citations": "3\n", "authors": ["181"]}
{"title": "The Emerging Brazilian IT Industry and its Time-Zone Proximity Advantage\n", "abstract": " Brazil has been emerging as an offshore destination for offshore IT software and services. The country already had a strong domestic base of IT clients to global companies. One of the competitive factors is time zone location. Brazil has now positioned itself as easy for collaboration because of time zone overlap with its primary partners in North America and Europe. In this paper we examine whether time zone proximity is indeed an advantage for software development by conducting a country-level field study of the Brazilian IT industry using a cross section of firms. The results provide some support for the claims of proximity benefits. The Brazil-to-North dyads use moderate timeshifting that is perceived as comfortable and advantageous for both sides of these dyads. The voice coordination that the time overlap permits helps address coordination challenges and foster relationships. These and other practices relating …", "num_citations": "3\n", "authors": ["181"]}
{"title": "WAVE–Um Modelo de Capacidade para Desenvolvimento de Software com Captive Centers\n", "abstract": " O objetivo deste artigo é apresentar um modelo de capacidade proposto com o objetivo de documentar os padrões de evolução das práticas das organizações envolvidas com o internal offshoring. O modelo proposto é útil para aquelas empresas iniciando operações de DDS com captive centers, que poderão se beneficiar do conhecimento de práticas que foram aplicadas em outras organizações no passado. O modelo foi avaliado em duas empresas e os resultados são apresentados e discutidos.", "num_citations": "3\n", "authors": ["181"]}
{"title": "Global software engineering and the Brazilian perspective\n", "abstract": " Since the rise of the Internet in the 1990s, we have entered the era of Global Software Engineering (GSE). High-tech companies are now located in nearly 100 nations. Many Latin America nations have flourished in this new era: Costa Rica lured Intel, Argentina lured EDS (now HP), and Brazil has lured many global high-tech firms and many investments in the IT sector. The rules developed by the Brazilian government in order to reduce tariff barriers, exclude the market reserve and reestablish the National Computer Policy have actively added to the position of Brazil as an interesting option to receive foreign investments in the high technology sector.The government’s goal of supporting industries already based in Brazil and the need to create an attractive environment for the foreign capital led to the creation of the Computer Tax Incentive Law (Laws 8248/91, 10176/01, and 11077/04). This law allows companies to …", "num_citations": "3\n", "authors": ["181"]}
{"title": "Desafios e Boas Práticas para o Gerenciamento de Projetos no Desenvolvimento Distribuído de Software\n", "abstract": " Distributed software development (DSD) has made even more complex the problem of managing software projects. Additionally, in the literature, there is not a widely recognized knowledge body supporting distributed projects management. This research aims to collect and organize, existing knowledge on the challenges and practices for distributed software development, through a systematic literature review.Resumo. O Desenvolvimento Distribuído de Software (DDS) acrescentou desafios a já complexa atividade de gerenciar projetos de software. Além disso, não existe um corpo de conhecimento amplamente reconhecido e aceito para o gerenciamento nesse contexto. Desta forma, essa pesquisa objetiva coletar e reunir desafios e boas práticas para o gerenciamento de projetos no DDS através de uma revisão sistemática da literatura.", "num_citations": "3\n", "authors": ["181"]}
{"title": "Interdisciplinaridade na engenharia de software\n", "abstract": " O objetivo deste artigo é discutir a importância de pesquisas multidisciplinar, interdisciplinar e transdisciplinar na Engenharia de Software. São apresentados os diversos conceitos envolvidos, ilustrados com dois exemplos práticos relacionados ao desenvolvimento distribuído de software e programas de melhoria de processo de software.", "num_citations": "3\n", "authors": ["181"]}
{"title": "Oportunidades de Melhoria Identificadas no MR MPS a partir do Mapeamento com o Modelo CMMI e as Normas ISO/IEC 12207 e ISO/IEC 15504, no contexto do Projeto Cooperativa MPS. BR …\n", "abstract": " Para manter-se em dia com os avanços da indústria de software, os modelos de melhoria de processos são periodicamente revisados e atualizados, tomando por base, entre outros, feedbacks fornecidos por organizações e profissionais que os utilizam, e que contribuem para seu aperfeiçoamento e consolidação no mercado. Este artigo apresenta um conjunto de oportunidades de melhoria identificadas no MPS. BR–Melhoria de Processo de Software Brasileiro e propõe alternativas para a sua resolução, elaboradas por um grupo de profissionais envolvidos na implementação do projeto Cooperativa MPS. BR–SOFTSUL.", "num_citations": "3\n", "authors": ["181"]}
{"title": "Construção do conhecimento e complexidade na Área de engenharia de software\n", "abstract": " Distributed software development has attracted a great number of researches in software engineering over the last years. The analysis of these researches let us to conclude that considering the challenges involved, this is an area where some integration among other disciplines or fields of knowledge such as Computer Science, Business Administration, Psychology, Sociology, etc, is necessary. For this reason, the purpose of this paper is to discuss the knowledge fragmentation in software engineering. Also, we discuss how multidisciplinary, interdisciplinary and transdisciplinary researches can contribute to the research on software engineering.Resumo. O desenvolvimento distribuído tem atraído um grande número de pesquisas na área de engenharia de software nos últimos anos. A análise destas pesquisas nos permitiu concluir que, devido a sua característica e os desafios envolvidos, estas pesquisas …", "num_citations": "3\n", "authors": ["181"]}
{"title": "Cauduro,(2015) F\n", "abstract": " Este trabalho apresenta o programa Startup Garagem sob o ponto de vista da formação do empreendedor. O programa criado pela incubadora RAIAR, sediada no parque científico e tecnológico da PUCRS, visa munir os novos empreendedores com ferramentas e conhecimento necessário para qualquer pessoa que queira abrir sua startup.O programa está separado em três fases principais: O desenvolvimento de um autoconhecimento e da identificação do problema e clientes, utilizando como base o quadro de validação. Depois dessa fase, os empreendedores iniciam o trabalho de construção dos seus modelos de negócio, usando o Business Model Canvas. Na fase final, assuntos relacionados à estruturação de negócios como, por exemplo, estrutura social, contabilidade, marcas e patentes, entre outros, são abordados.", "num_citations": "3\n", "authors": ["181"]}
{"title": "Agile Accelerator Program: From Industry-Academia Collaboration to Effective Agile Training\n", "abstract": " The agile accelerator program takes place in a Brazilian technology park, as a collaboration between a university and a world-renowned technology company, specialized in agile development and consulting. This partnership has 8-year long with the main goal of preparing undergraduate students to work in high-performance agile teams. This partnership created a culturally rich environment for student learning while influencing other companies to follow the same initiative within this technology park. We conducted a Case Study aiming to characterize this partnership (explaining how it works) and the resulting program, understanding the benefits to the program students. Our results point out the importance of the kind of partnership that provides an immersive learning environment to students, where students can learn empirically, with real projects and real stakeholders and how important it was for the program's …", "num_citations": "2\n", "authors": ["181"]}
{"title": "MVP and experimentation in software startups: a qualitative survey\n", "abstract": " The Lean Startup methodology disseminated the concept of MVP. Since then, the term has been used in several contexts aside startups with a blur definition. Practitioners name several artifacts as MVPs, such as prototypes or initial versions of a new product, rather than an instrument for experimentation. Given the importance of experimentation to the success rate of software startups, it is essential to understand if the experimentation element is still present in practitioners’ understanding of the term and how they applied MVPs. To achieve this objective, we performed a survey with practitioners and coded their answers according to aspects found in a systematic mapping study on MVP. Our results indicate that MVP is mostly associated with the ideas of a product version and customer value rather than hypothesis testing and learning processes. Additionally, those respondents that focused on the first related group of …", "num_citations": "2\n", "authors": ["181"]}
{"title": "Incorporating real projects into a software engineering undergraduate curriculum\n", "abstract": " Software engineering researchers and practitioners are increasingly more concerned about non-technical issues like user involvement and interaction as a way to improve software development process efficiency. This issue is also present in software engineering education. The IEEE/ACM software engineering guidelines highlights that an undergraduate course in this matter should have a real-world basis. In this paper, we present an undergraduate program that connect students with real-world projects throughout their studies. To evaluate educational results, we performed a survey with 111 students from this software engineering program. The results indicate that students in the end of this program has a much better chance of taking users' desires into consideration instead of focusing on software implementation.", "num_citations": "2\n", "authors": ["181"]}
{"title": "From Voice of Evidence to Redirections\n", "abstract": " The Voice of Experience department is being relaunched as Redirections, which will focus on the surprises in software engineering.", "num_citations": "2\n", "authors": ["181"]}
{"title": "Formação de Equipes de Alto Desempenho Para Desenvolvimento de Software\n", "abstract": " Este artigo apresenta uma discussão em relação às atuais abordagens de capacitação para desenvolvimento de software e a formação de equipes de alto desempenho. Foi realizado um estudo sobre as abordagens de capacitação e sobre as características das equipes de alto desempenho e, a partir destes estudos, uma reflexão sobre os desafios de capacitar equipes de alto desempenho para desenvolvimento de software.", "num_citations": "2\n", "authors": ["181"]}
{"title": "Desenvolvimento de Software na Administração Pública: Uma Revisão Sistemática da Literatura\n", "abstract": " No âmbito do governo, as administrações públicas (APs) vem passando por um período de grandes mudanças para atender os compromissos atuais e emergentes da sociedade, bem como, para melhorar a qualidade dos serviços públicos prestados e agregar valor as atividades da AP, sendo que a maioria das transformações tem sido sustentada por um investimento pesado em tecnologia da informação e comunicação [Bal10]. Esta realidade implica diretamente no aumento da demanda por produtos de software e indiretamente implica na busca por melhores abordagens e processos para desenvolvê-los ou adquiri-los [Bas08]. Se durante muitos anos o desenvolvimento de software foi guiado por processos prescritivos, que tinham por finalidade colocar ordem no caos, proporcionando um roteiro razoavelmente eficaz para as equipes de projetos, nos dias atuais observa-se a introdução cada vez maior de processos adaptativos de desenvolvimento de software, focados no produto e nas pessoas que o desenvolvem e recomendados para ambientes onde os requisitos são voláteis [Pre11]. Modelos, processos e métodos de Engenharia de Software (ES) se encaixam neste contexto e tem gradativamente despertado o interesse da AP brasileira, principalmente se já foram experimentados e avaliados pelo setor privado. Neste sentido, o objetivo desta monografia é apresentar um estudo sobre o desenvolvimento de software na AP, apresentando evidências sobre a utilização de modelos, processos e métodos de ES no setor público, incluindo os problemas encontrados, desafios enfrentados, lições aprendidas, benefícios alcançados …", "num_citations": "2\n", "authors": ["181"]}
{"title": "Designing tools to support trust in distributed software teams\n", "abstract": " Software development is an inherently collaborative activity requiring team members to coordinate and communicate with each other in order to accomplish their tasks. Software development in a distributed setting exacerbates the challenges of collaborating as team members are forced to interact with remote colleagues and emphasizes the importance of trust. We posit that tools can support the development of trust is distributed teams; however, we also recognize that the understanding of how to develop such tools is still limited. This position paper argues that we need to further the understanding of what features and software requirements are needed to better support trust development and to subsequently design better tools for such a purpose.", "num_citations": "2\n", "authors": ["181"]}
{"title": "Effort Estimation in Global Software Development Projects\n", "abstract": " Global Software Development (GSD) has intensified over the past years. Many reasons drove this development practice rise, where reducing development costs can be highlighted. In this context, software development effort estimation plays a very important role to achieve this goal of reducing costs. Once the effort required to develop software is a key component of the cost of development, the correct application of effort estimation techniques is crucial for the success of these projects. However, the current set of effort estimation techniques and models have been used without a clear definition of what has to be different when such techniques or models are used in the context of GSD projects. This paper presents preliminary results towards the understanding of effort estimation in GSD projects. The results found indicate that the teams don’t have clear criteria to guide the selection of an effort estimation technique for …", "num_citations": "2\n", "authors": ["181"]}
{"title": "Desenvolvimento Distribuído de Software com Captive Centers\n", "abstract": " O objetivo deste artigo é apresentar um modelo de capacidade proposto com o objetivo de documentar os padrões de evolução das práticas das organizações envolvidas com o internal offshoring. Este modelo é útil para aquelas empresas iniciando operações de DDS com captive centers, que poderão se beneficiar do conhecimento de práticas que foram aplicadas em outras organizações no passado.", "num_citations": "2\n", "authors": ["181"]}
{"title": "Minimizing the Challenges of Risk Management in Distributed IT Projects: The Importance of the Alignment of Strategic, Tactical, and Operational Levels\n", "abstract": " Distributed IT projects exhibit certain features that make them fundamentally different from traditional colocated projects, not only involving additional steps and decisions, but also impacting the risk management process. The goal of this chapter is to discuss these impacts and to suggest the development of an integrated risk management process taking into account site dispersion, time-zone difference, and cultural boundaries not only at the operational but also at the tactical and strategic level. We also report results of an exploratory case study conducted in a software development center (a Brazilian subsidiary of a US corporation) in support of such a model, and conclude with a discussion of theoretical and practical implications of our work.", "num_citations": "2\n", "authors": ["181"]}
{"title": "GRADUAW-Um Sistema Colaborativo baseado em Wiki para Apoio ao Ensino de Graduação\n", "abstract": " Este artigo apresenta a ferramenta Graduaw, um sistema colaborativo para apoio ao ensino de graduação, baseado em Wiki. A ferramenta foi desenvolvida em ambiente Web, e está totalmente funcional. Avaliações preliminares indicam alguns benefícios e oportunidades de integração com outras ferramentas existentes.Abstract: The purpose of this paper is to present Graduaw, a web-based collaborative system based on Wiki to support interactive learning in undergraduate courses. Preliminary evaluations indicate interesting benefits and the integration with existing tools.", "num_citations": "2\n", "authors": ["181"]}
{"title": "Distributed Project Management\n", "abstract": " Software development involves teamwork and a lot of communication. It seems rational to put all your team members in one place, encourage them to share objectives, and let the project run. But the movement toward globally distributed software development is changing the way projects are planned, developed, tested, and delivered to customers. Is this article, we present the concepts involved in distributed software development, and particularly the challenges of distributed project management, that is, when a project manager has to manage a distributed development team. The article is focused on a specific type of distributed development, when a company transfers work to one or more subsidiaries of the same company, and the subsidiaries are geographically distributed in multiple locations.", "num_citations": "2\n", "authors": ["181"]}
{"title": "Uma Análise Quantitativa da Implantação do MR-MPS em Projetos Cooperados: Avaliação sob a ótica das Empresas\n", "abstract": " In this paper we present quantitative results of an evaluation conducted with five companies from the first group of companies implementing the MR MPS, coordinated by Softsul in RS. The evaluation considered the companies’ point of view and two dimensions: the importance and the satisfaction of some selected criteria. The results are presented and discussed. We believe that the information in this paper can contribute to improve future projects with group of companies in Brazil.Resumo. Neste artigo são apresentados os resultados quantitativos de uma avaliação realizada com cinco empresas do primeiro grupo do projeto cooperado de implementação do MR MPS, coordenado pela Softsul no RS. A avaliação considerou a percepção das empresas sob duas dimensões: à importância e a satisfação de dos critérios identificados. Os resultados são apresentados e discutidos. Acredita-se que os dados apresentados neste artigo contribuem para melhorar a execução de futuros projetos cooperados no país.", "num_citations": "2\n", "authors": ["181"]}
{"title": "Challenges Women in Software Engineering Leadership Roles Face: A Qualitative Study\n", "abstract": " Software engineering is not only about technical solutions. To a large extent, it is also concerned with organizational issues, project management, and human behavior. There are serious gender issues that can severely limit the participation of women in science and engineering careers. It is claimed that women lead differently than men and are more collaboration-oriented, communicative, and less aggressive than their male counterparts. However, when talking with women in technology companies' leadership roles, a list of problems women face grows fast. We invite women in software engineering management roles to answer the questions from an empathy map canvas. We used thematic analysis for coding the answers and group the codes into themes. From the analysis, we identified seven themes that support us to list the main challenges they face in their careers.", "num_citations": "1\n", "authors": ["181"]}
{"title": "Improving a Startup Learning Framework Through an Expert Panel\n", "abstract": " It is not easy to provide real-world experience to students in an academic setting. When it comes to the development of a software startup, the connection with real users and customers is a must; otherwise, it becomes just a technical challenge. Furthermore, universities and the academic environment are paying more attention to this topic in the past years. One interesting work developed in this regard is the Challenge Based Startup Learning. In this sense, this paper aims at exploring, studying, and extending the Challenge Based Startup Learning Framework by running an expert panel. The idea behind this approach is to collect useful feedback in order to improve the framework to provide student with a better software startup development experience.", "num_citations": "1\n", "authors": ["181"]}
{"title": "Collaborative practices for software requirements gathering in software startups\n", "abstract": " Capturing requirements during the software development process has always been a challenge. Usually, there is a customer with a defined problem or a problem to be explored. However, when we talk about software startups, the requirements gathering process changes. The entrepreneurs need to systematically work with hypotheses and experimentations, and test them as quickly as possible, trying to understand whether these assumptions can become requirements for a system or not. In this context, entrepreneurship training programs, specially for technical students, help these entrepreneurs to understand this new way of gathering systems requirements. This paper describes how some of these practices were performed in a program for new entrepreneurs that took place in a science and technology park. Our preliminary results indicate that several collaborative practices can foster the understanding of the …", "num_citations": "1\n", "authors": ["181"]}
{"title": "Reinforcing diversity company policies: Insights from StackOverflow Developers Survey\n", "abstract": " Todos los ítems en el Repositorio de la PUCRS están protegidos por derechos de autor, con todos los derechos reservados, y están bajo una licencia de Creative Commons Reconocimiento-NoComercial 4.0 Internacional. Sepa más.", "num_citations": "1\n", "authors": ["181"]}
{"title": "High impact drivers in innovation ecosystems: the case of Tecnopuc-FBK joint lab\n", "abstract": " Innovation ecosystems are developing new organization models of collaboration towards sustainability and creation of high impact. It requires the development of new ways of collaboration, both from the academic and company’s point of view. This research analyzes the way of working of two innovation ecosystems that are highly supported by Information and Communication Technology (ICT). This way helps research, companies, and society to address their needs by the identification of four impact drivers of success, which are: consultancy, collaboration, education, and mobility. The main findings observed during the long-term collaboration of two innovation ecosystems extend the field of living labs and innovation platforms. Further research could validate and measure the success of the four drivers in the generation of high impact. The research presents practical implications for managers of innovation ecosystems.", "num_citations": "1\n", "authors": ["181"]}
{"title": "An Empirical Study on the Adoption of Agile Software Development in Public Organizations\n", "abstract": " The government has been adopting agile software development in order to improve the results of their IT projects. However, there is a lack of structured information about its adoption in this context. Since the public sector have undergone a significant process of modernization to improve the quality of public service, the goal of this study is to report from an empirical study, provide information that may enhance the understanding of the implications of adopting agile software development within public organizations, proposing a set of recommendations for its adoption.", "num_citations": "1\n", "authors": ["181"]}
{"title": "8th International Workshop on Cooperative and Human Aspects of Software Engineering (CHASE 2015)\n", "abstract": " Software is created for and with a wide range of stakeholders, from customers to management, from value-added providers to customer service personnel. These stakeholders work with teams of software engineers to develop and evolve software systems that support their activities. All of these people and their interactions are central to software development. Thus, it is crucial to investigate the dynamic and frequently changing Cooperative and Human Aspects of Software Engineering (CHASE), both before and after deployment, in order to understand current software practices, processes, and tools. In turn, this enables us to design tools and support mechanisms that improve software creation, software maintenance, and customer communication.Researchers and practitioners have long recognized the need to investigate these aspects, however, their articles are scattered across conferences and communities …", "num_citations": "1\n", "authors": ["181"]}
{"title": "Metodologias ágeis na administração pública: uma revisão sistemática da literatura.\n", "abstract": " Conteúdo: O objetivo deste artigo é apresentar os resultados de uma revisão sistemática sobre o uso de metodologias ágeis na AP, apresentando evidências sobre seus benefícios, motivação e ameaças, além de recomendações para seu uso.", "num_citations": "1\n", "authors": ["181"]}
{"title": "On the Identification of Factors that Promote High-Performance Projects in Distributed Development\n", "abstract": " Todos os itens no Repositório da PUCRS estão protegidos por copyright, com todos os direitos reservados, e estão licenciados com uma Licença Creative Commons-Atribuição-NãoComercial 4.0 Internacional. Saiba mais.", "num_citations": "1\n", "authors": ["181"]}
{"title": "Lições aprendidas com o uso da emulação de proximidade física no Desenvolvimento Distribuído de Software\n", "abstract": " Os avanços tecnológicos verificados nos últimos anos permitiram às organizações simular a co-localização no contexto de Desenvolvimento Distribuído de Software. O objetivo de simular a proximidade física é dar a percepção de que os times distribuídos estão no mesmo local de trabalho, comunicando-se, colaborando e sendo coordenada de maneira similar a realizada por equipes locais. O objetivo deste de artigo é apresentar a forma como a simulação de proximidade física está sendo usada por equipes de desenvolvimento distribuído de software, incluindo vantagens, desvantagens, desafios e lições aprendidas. O método de pesquisa utilizado é o estudo de caso e a base empírica envolve projetos de desenvolvimento de software.", "num_citations": "1\n", "authors": ["181"]}
{"title": "A utilização da Programação em Par Distribuída no ensino de programação.”\n", "abstract": " Courses taken at a distance are an increasingly present reality in different areas of knowledge. In Computing is not different, programming teaching at a distance requires new challenges and practices for learning to be effective. In the literature, the practice of Pair Programming (PP) has proved to be an effective practice in the learning process. However few studies have examined the PP in the distributed context as a teaching tool and its importance to compose a resume of a computer course. This paper aims to present a conceptual basis of Distributed Pair Programming (DPP) in teaching, presenting the main lessons learned from studies conducted in the area.Resumo. Cursos realizados a distância são uma realidade cada vez mais presente em diversas áreas do conhecimento. Na Computação não é diferente, o ensino de programação a distância requer novos desafios e práticas para que o aprendizado seja efetivo. Na literatura a prática de Programação em Par (PP) mostrou ser uma prática efetiva no processo de aprendizado. Contudo, poucos estudos analisaram a PP no contexto distribuído como ferramenta de ensino e a sua importância de compor um currículo de um curso de Computação. Este artigo tem como objetivo apresentar uma base conceitual de Programação em Par Distribuída (PPD) no ensino, apresentando as principais lições aprendidas dos estudos conduzidos na área.", "num_citations": "1\n", "authors": ["181"]}
{"title": "SOA Practices and Patterns Applied in Global Software Development.\n", "abstract": " Prior research has established a relationship between coordination of software development activities and software architecture both in collocated and distributed projects. Despite the recognized importance of the software architecture in the coordination of development activities, it is still unclear how software architects design the architecture of software systems in distributed projects. To better understand this scenario, this paper reports from a qualitative empirical study where we interviewed software architects to collect information about the software architecture of distributed projects. Information collected has exposed the wide adoption of Service Oriented Architectures (SOA), indicating a trend towards the usage of this low coupling architectural style by companies developing projects with distributed teams. More detailed data collected by follow-up interviews suggested a set of best practices for designing SOA architectures to facilitate the work of the project members.", "num_citations": "1\n", "authors": ["181"]}
{"title": "Classificando organizações de Desenvolvimento Distribuído de Software no modelo de capacidade WAVE\n", "abstract": " The aim of this paper is to classify the Brazilian unit of two companies with extensive experience in global software development in the WAVE capability model. This work presents the artifacts and process designed to make those assessments, the results and suggested improvements. Finally, we evaluated the relevance of the WAVE model in the two chosen companies, based on the outcome of the study.Resumo. O objetivo desse artigo é classificar a unidade brasileira de duas empresas com ampla experiência em desenvolvimento global de software no modelo de capacidade WAVE. Nesse trabalho são apresentados os artefatos e processo criados para viabilizar essas avaliações, os resultados das mesmas e as melhorias sugeridas. Por fim é avaliada a relevância do modelo WAVE nas duas empresas escolhidas, baseando-se no resultado do estudo.", "num_citations": "1\n", "authors": ["181"]}
{"title": "Desafios nas Fases do ciclo de vida de Projetos Distribuídos\n", "abstract": " The Distributed Software Development inherited the problems existent on the traditional development and for many reasons, added other difficulties. This paper presents the challenges of each stage of the software development life cycle on companies. To identify the challenges of the development stages, a field research was performed on the domestic software market, through a questionnaire the companies have cited the problems they face. This way, it's possible to view some of the challenges the domestic industry faces on each development stage.Resumo. O Desenvolvimento Distribuído de Software herdou os problemas existentes no desenvolvimento tradicional e por diversas razões acrescentou outras dificuldades. Este artigo apresenta quais são os desafios de cada fase do ciclo de vida do desenvolvimento de software das empresas. Para identificar os desafios das fases do desenvolvimento foi realizada uma pesquisa de campo no mercado nacional de software, que através de um questionário as empresas citaram os problemas que enfrentam. Dessa forma, é possível visualizar alguns desafios que a indústria nacional enfrenta para cada fase do desenvolvimento.", "num_citations": "1\n", "authors": ["181"]}
{"title": "Comparando a Implantação de Projetos Cooperados baseados no MR-MPS através da Replicação de um Instrumento de Avaliação: Análise Quantitativa sob a Ótica das Empresas\n", "abstract": " Neste artigo são apresentados os resultados quantitativos de uma avaliação realizada com dez empresas do primeiro e segundo grupos de um projeto cooperado de implementação do MR MPS. A avaliação considerou a percepção das empresas sob duas dimensões: à importância e a satisfação de dos critérios identificados. Os resultados são apresentados e discutidos. Acredita-se que os dados apresentados neste artigo contribuem para melhorar a execução de futuros projetos cooperados no país.", "num_citations": "1\n", "authors": ["181"]}
{"title": "An Approach to Support the Strategic Alignment of Software Process Improvement Programs.\n", "abstract": " The alignment between the strategy of a software process improvement program and the organizations’ business strategies has been mentioned as a critical factor of success. However, the main software process reference models do not explicitly guide the companies towards defining processes which meet their strategic goals. Based on this context, the purpose of this paper is to present a process for the strategic alignment of software process improvement programs. Preliminary results indicate benefits beyond the demands of a software process reference model itself, which include the planning and execution of a software process improvement program taking into account the organization’s strategic goals in a more systematic way.", "num_citations": "1\n", "authors": ["181"]}
{"title": "O Papel da Interdisciplinaridade em Programas de Melhoria de Processo de Software: Um Relato de Treze Experiências\n", "abstract": " During the last years, Brazilian companies have been experiencing many software process improvement projects. Based on this context, we have observed many software process improvement projects in Brazil during the last six years. A careful analysis on these projects led us to identify the integration among some areas such as Psychology, Computer Science, Education, and Business in an interdisciplinary approach. For this reason, the purpose of this paper is to discuss the importance of the interdisciplinary experience in software process improvement projects. To achieve this goal, we shared some observations and lived experience in thirteen projects. In the end, we emphasize some initial proposals on how to be interdisciplinary in this context, and what benefits an organization can have following this approach.Resumo. Nos últimos anos, o Brasil tem vivenciado um crescimento bastante significativo em relação ao investimento na melhoria e qualidade dos produtos de software. Isto tem gerado um aumento considerável de empresas brasileiras envolvidas em programas de melhoria de processo. Baseado neste cenário observou-se ao longo dos últimos seis anos diversos programas desta natureza no Brasil. Uma análise mais aprofundada nos permitiu identificar a integração de diversas disciplinas e áreas do conhecimento, tais como Psicologia, Ciência da Computação, Educação, entre outras, em uma visão interdisciplinar. Desta forma, o objetivo deste artigo é discutir a importância da experiência interdisciplinar em programas de melhoria de processo de software. Para isso, serão utilizadas as observações realizadas e os relatos …", "num_citations": "1\n", "authors": ["181"]}
{"title": "Pesquisas Qualitativas em Desenvolvimento Distribuído de Software: Um Relato de Experiências com Estudo de Caso e Etnografia\n", "abstract": " In this paper, we report some challenges for conducting qualitative research in distributed software development based on our experience. Distributed software development is a recent area of research from a Software Engineering point of view, and planning and execution of research in this context may cause additional difficulties to researchers. Based on our experience conducting research in this area since 2002, we present some of these difficulties, focusing on the data collection phase in two qualitative research methods: case study and ethnography. The experiences described in this paper indicate a greater effort in planning and managing research projects in a distributed software development environment, as well as a greater formalism in the whole research process.Resumo. Este artigo discute alguns desafios enfrentados na condução de pesquisas qualitativas em desenvolvimento distribuído de software, a partir da experiência de dois pesquisadores atuantes na área desde 2002. Por ser uma área recente para a comunidade de Engenharia de Software, o planejamento e execução de pesquisas neste contexto acaba gerando uma série de dificuldades adicionais para pesquisadores. Algumas destas dificuldades são apresentadas, com foco principal na fase de coleta de dados de dois métodos de pesquisa qualitativos: estudo de caso e etnografia. As experiências relatadas indicam uma maior necessidade de planejamento e gerência de uma pesquisa quando esta é realizada em ambientes de desenvolvimento distribuído de software, bem como um maior formalismo de todo o processo de pesquisa.", "num_citations": "1\n", "authors": ["181"]}
{"title": "Gestão Quantitativa de Pessoas em DDS: primeira aplicação de um modelo para o cálculo da distância percebida relativa em equipes distribuídas de desenvolvimento de software\n", "abstract": " One of the main challenges faced by distributed software development teams is the lack of perceived distance among project team members. The lack of perception is frequently caused by factors beyond the physical distance, such as communication problems and cultural differences. The purpose of this paper is to evaluate the usage of a model to quantitatively calculate the perceived distance within distributed software development teams, in a project developed with teams in India and Brazil. We present how the model was applied, the analysis of the results found, and the influence of this model in the management of distributed teams.Resumo. Uma das principais dificuldades enfrentadas por equipes distribuídas de desenvolvimento de software é a falta de percepção da distância existente entre colaboradores em um mesmo projeto. Esta falta de percepção geralmente é causada por um conjunto de fatores além da distância física, tais como diferenças culturais e dificuldades de comunicação. Neste sentido, o objetivo deste artigo é avaliar o uso de um modelo proposto para o cálculo da distância percebida relativa de equipes de DDS em um projeto desenvolvido com parte da equipe no Brasil e parte da equipe na Índia. São apresentados os detalhes da aplicação do modelo, a análise dos resultados e a influência do modelo na gestão das equipes distribuídas.", "num_citations": "1\n", "authors": ["181"]}
{"title": "Cooperativa MPS. BR–Relato de experiências, lições aprendidas, melhores práticas e dificuldades da II e IOGE SOFTSUL do RS\n", "abstract": " This paper describes the experience implementing the MR-MPS in groups of companies in RS, coordinated by SOFTSUL, with support from SOFTEX. We present the evaluation, best practices and lessons learned from the point of view of the organizing committee, consultants and companies.Resumo. Este artigo relata a experiência pioneira de grupos de empresas do Rio Grande do Sul na implantação do modelo de referência MR-MPS de forma cooperada, sob coordenação da SOFTSUL e com apoio da SOFTEX. São apresentadas as práticas de sucesso e as lições aprendidas, segundo as visões do comitê organizador dos consultores de implantação e das empresas envolvidas.", "num_citations": "1\n", "authors": ["181"]}
{"title": "Como Evoluem as Organizações de DDS em Ambientes de Internal Offshoring? Um Estudo Qualitativo Preliminar\n", "abstract": " Distributed software development has been evolved based on the selection of certain business models. Among the existing models, the offshore outsourcing is one of the best known. But in the last years, it has been observed an increasing on the creation of subsidiaries of companies located in a different country, to provide software development services, in a business model known as internal offshoring. In this context, the purpose of this paper is to present a set of attributes and their evolution in the internal offshoring environment, from the perspective of the subsidiaries. Preliminary results indicate an interesting evolution in the practices of these companies, which sometimes is not ideal, and can compromise the projects performance.Resumo. O desenvolvimento distribuído de software, na prática, tem sido operacionalizado através de modelos de negócios. Entre eles, o offshore outsourcing é um dos mais conhecidos e explorados em pesquisas. Nos últimos anos, tem sido comum a criação de subsidiárias de empresas, geralmente localizadas em outro país, para prover serviços de desenvolvimento de software, em um modelo de negócio chamado de internal offshoring. Desta forma, o objetivo deste artigo é apresentar, através um estudo de caso de base qualitativa, um conjunto de atributos e sua evolução em um contexto de internal offshoring, sob o ponto de vista das subsidiárias. Resultados preliminares indicam uma evolução muitas vezes de uma forma considerada não ideal, podendo comprometer o desempenho dos projetos.", "num_citations": "1\n", "authors": ["181"]}
{"title": "Uma Ferramenta para Modelagem de Software Educacional voltada a Professores de Escolas\n", "abstract": " Os programas educacionais podem ser explorados de diferentes formas conforme a metodologia utilizada pelo professor, Para que estes ambientes permitam esta multiplicidade de uso, eles necessitam oferecer um conjunto de funcionalidades para suportar estas atividades docentes e discentes. O desenvolvimento de um ambiente deste porte vai requerer o estabelecimento de um conjunto de atividades para organizar todo o software educacional. Esta tarefa, de cunho interdisciplinar, vai requerer da equipe de projeto uma comunicação formalizada, a fim de garantir que o produto final esteja de acordo com as expectativas dos professores. Neste artigo apresenta-se a descrição da ferramenta FASE (Ferramenta de Apoio ao projeto de Software Educacional) e sua validação em uma disciplina da graduação da PUCRS no intuito de formalizar as práticas de engenharia de software adotadas para o projeto e desenvolvimento de software educacional, através da metodologia PDS-E.Abstract: Educational software can be explored in different ways according to teachers’ goals and methodologies. The design of such systems needs to support a great variety of requirements related to educational functionalities. This paper presents the FASE–an environment developed to support PDS-E activities. PDS-E is a set of Software Engineering practices applied to design educational applications. PDS-E was created to help teachers and others educators to organize and to formalize their ideas concerning the system design, including pedagogical features. It was tested in real situation with teachers from High Schools with different backgrounds.", "num_citations": "1\n", "authors": ["181"]}