{"title": "Impact Analysis for Supporting the Co-Evolution of Business Processes and Supporting Software Systems.\n", "abstract": " The co-evolution of business processes and supporting software systems is needed for keeping them aligned and it requires managerial and technological effort for adequately planning it. In fact, any modification performed in the business process activities and/or supporting software systems may impact the process activities in terms of input/output and/or purpose of the software system and, therefore, cause misalignment. A coarse grained strategy is proposed for detecting misalignment between business processes and supporting software systems when changes are executed, and for identifying which objects should be considered by additional change for restoring the alignment. The strategy proposes the exploitation of quality parameters, for codifying the alignment concept, and impact analysis techniques, for propagating the change and identifying all the process objects impacted by the change and requiring new interventions.", "num_citations": "37\n", "authors": ["983"]}
{"title": "Supporting decisions on the adoption of re-engineering technologies\n", "abstract": " Evolving software systems requires their preliminary analysis and assessment. In particular, information on the performance and costs of software system components must be gathered for identifying the most appropriate strategy for their evolution. A critical point is finding suitable data gathering means to effectively support the decision makers. This paper presents a strategy composed of a methodological approach and supporting toolkit to help maintainers in the evolution process. The strategy integrates measurement and decision-making tools, and critiquing techniques. It analyzes software systems and identifies a set of alternative evolution approaches by mapping critiques to specific innovation actions. The proposed strategy is validated by case studies conducted with a major software enterprise and public administration.", "num_citations": "21\n", "authors": ["983"]}
{"title": "CODACS prototype: CHIARA language and its compiler\n", "abstract": " We present CHIARA, the programming language used to program CODACS (a general purpose dataflow architecture exploiting FPGA technology), and describe the compiling strategies leading from CHIARA programs to the CODACS dataflow graphs. CHIARA is a functional programming language based on Backus'FP. We designed both the language and the compiling tools in such a way that CHIARA programs can be efficiently compiled and run onto the overall architecture and CODACS platform-processors being, for the latter, also the low-level (assembly) programming language. Some preliminary experimental results are discussed, demonstrating that the CHIARA approach to CODACS programming is feasible and promising.", "num_citations": "11\n", "authors": ["983"]}
{"title": "Evolving legacy system towards e-business\n", "abstract": " In e-business, addressing the technical issues alone is not enough to drive the evolution of existing legacy applications, but it is necessary to consider problems concerning the strict relationship that exists between the evolution of the legacy system and the evolution of the e-business process. To fulfill this purpose, this chapter proposes a strategy for extracting the requirements for a legacy system evolution from the requirements of the e-business process evolution. The strategy includes a toolkit composed of a set of decision tables and a measurement framework, both referring to the organization, business processes, and legacy software systems. The decision tables allow the identification of the processes to be evolved, the actions to be performed on them and their activities, and the strategies to be adopted for evolving the information systems. The measurement framework aims at achieving a greater …", "num_citations": "9\n", "authors": ["983"]}
{"title": "Evolution of business processes towards eBusiness using a critiquing approach\n", "abstract": " Innovating the business processes of an enterprise requires their preliminary analysis and assessment. In particular, information on the performance and costs of activities and processes must be gathered in order to identify candidates for innovation. A critical point is finding suitable presentation means of the gathered data in order to support effectively the decision makers. This paper presents a strategy and supporting tools for business process innovation. The strategy integrates measurement, decision making, and critiquing techniques, for analyzing business processes, identifying activities and software systems that are candidate to innovation, and mapping critiques onto specific innovation actions. The strategy is supported by a toolkit, named WebEv+, that integrates the WebEv environment [2], for managing the assessment and evaluation tasks, and ArgoUML [1], for modeling and critiquing business processes.", "num_citations": "4\n", "authors": ["983"]}
{"title": "The role of the impedivity in the magnetotelluric response\n", "abstract": " We study the influence of the resistivity frequency dispersion effects on the magnetotelluric (MT) response. Impedivity is the term used to indicate the frequency dependent resistivity in rocks. The impedivity functions, used in this paper, have been derived from the general solution of the motion equation of a charge carrier, discussed in a previous paper. A 1D three-layered earth section, with the second layer assumed to be dispersive, is considered to analyze the distortions due to dispersion on the modulus and phase of the MT responses on the earth's free surface. The MT responses of the section, where the dispersive layer is attributed an impedivity function describing at first a positive, then a negative and finally a resonant dispersion model, are computed for various combines of the dispersion parameters. A general conclusion is that the dispersion effects can strongly influence the MT response either in recognizable or in subtle forms. In the former case, the distortions appear as either steeply rising and/or descending curve branches or spike-like deltas, not compatible with a dispersion-free section. In the latter case, instead, the MT curves preserve the typical behavior for a dispersion-free section, and may thus erroneously be modeled by a section, where the dispersive layer is totally suppressed. In both case, disregarding the distortion effects may lead to misleading conclusions as to the physical properties of the surveyed structures", "num_citations": "3\n", "authors": ["983"]}
{"title": "The magnetotelluric response over a 3D polarizable structure\n", "abstract": " This paper analyses the 3D magnetotelluric (MT) response in the presence of resistivity frequency dispersion. The aim is to give further insight into this topic, already approached in previous papers dedicated to 1D and 2D cases. We show the MT diagrams along three parallel profiles, normal to the longitudinal axis of a dispersive conductive prism of finite horizontal and vertical extent, buried in a non-dispersive resistive half-space. The Cole–Cole dispersion law has been assumed to represent the dispersion features of the prism. The MT responses along the same profiles in the complete absence of dispersion effects are also provided for reference. The results confirm that the TE mode, as in the 2D case, is mostly affected by dispersion. Compared with the non-dispersive responses, a notable increase in the amplitude of the anomaly is observed along the profile passing through the center of the prism, while …", "num_citations": "2\n", "authors": ["983"]}
{"title": "Valore della coronarografia post-mortem nella diagnosi di morte improvvisa da accidente cardio-vascolare.\n", "abstract": " Valore della coronarografia post-mortem nella diagnosi di morte improvvisa da accidente cardio-vascolare/L. PISCITELLI; R. ESPOSITO; VACCHIANO G; C. BUCCELLI; L. ROMANO; C. ROMANO.-In: RIVISTA ITALIANA DI MEDICINA LEGALE.-ISSN 1124-3376.-(1980).", "num_citations": "1\n", "authors": ["983"]}