{"title": "A preliminary analysis of mobile app user reviews\n", "abstract": " The advent of online software distribution channels like Apple Inc.'s App Store and Google Inc.'s Google Play has offered developers a single, low cost, and powerful distribution mechanism. These online stores help users discover apps as well as leave a review. Ratings and reviews add value to both the developer and potential new users by providing a crowd-sourced indicator of app quality. Hence, for developers it is important to get positive reviews and high ratings to ensure that an app has a viable future. But, what exactly do users say on these app stores? And more importantly, what is the experience that compels a user to leave either a positive or a negative rating? Our analysis of 8.7 million reviews from 17,330 apps shows that users tend to leave short, yet informative reviews, and the rating as well as the category influences the length of a review. In this preliminary study, we found that users will leave …", "num_citations": "130\n", "authors": ["1909"]}
{"title": "A preliminary analysis of vocabulary in mobile app user reviews\n", "abstract": " Online software distribution channels such as Apple Inc.'s App Store and Google Inc.'s Google Play provide a platform for third-party app distribution. These online stores feature a public review system, allowing users to express opinions regarding purchased apps. These reviews can influence product-purchasing decisions via polarised sentiment (1 to 5 stars) and user expressed opinion. For developers, reviews are a user-facing crowd-sourced indicator of app quality. Hence, high ratings and positive reviews affect the viability of an app's commercial feasibility. However, it is less clear what information is contained within these reviews, and more importantly, if an analysis of these reviews can inform developers of design priorities as opposed to just influencing purchasing decisions. We analysed 8.7 million reviews from 17,330 apps on the App Store and found that the most frequently used words in user reviews …", "num_citations": "57\n", "authors": ["1909"]}
{"title": "Growth and change dynamics in open source software systems\n", "abstract": " In this thesis we address the problem of identifying where, in successful software systems, maintenance effort tends to be devoted. By examining a larger data set of open source systems we show that maintenance effort is, in general, spent on addition of new classes. Interestingly, efforts to base new code on stable classes will make those classes less stable as they need to be modified to meet the needs of the new clients.This thesis advances the state of the art in terms of our understanding of how evolving software systems grow and change. We propose an innovative method to better understand growth dynamics in evolving software systems. Rather than relying on the commonly used method of analysing aggregate system size growth over time, we analyze how the probability distribution of a range of software metrics change over time. Using this approach we find that the process of evolution typically drives the popular classes within a software system to gain additional clients over time and the increase in popularity makes these classes change-prone.", "num_citations": "36\n", "authors": ["1909"]}
{"title": "Agile practices in software development-experiences from student projects\n", "abstract": " To address the problems of traditional software development methodologies, recent years have seen the introduction of more light-weight or \"agile\" development processes. These processes are intended to support early and quick production of working code by structuring the development into small release cycles and focus on continual interaction between developers and customers. As these kinds of software development processes are becoming more and more popular in industry, there is a growing demand to expose Software Engineering students to agile development practices. This, however, is not a straightforward task as the corresponding practices cannot be adjusted easily to a learning environment or may even run counter to educational goals. In this paper, we discuss our experiences in introducing agile practices in student software development projects and reflect on both the benefits and drawbacks …", "num_citations": "34\n", "authors": ["1909"]}
{"title": "Detecting structural changes in object oriented software systems\n", "abstract": " It is an increasingly accepted fact that software development is a non-linear activity with inherently feedback driven processes. In such a development environment, however, it is important that major structural changes in the design and/or architecture of a software system under development are introduced with care and documented accordingly. In order to give developers appropriate tools that can identify such changes, we need to have a good understanding how software systems evolve over time so that evolutionary anomalies can be automatically detected. In this paper, we present recurring high-level structural and evolutionary patterns that we have observed in a number of public-domain object-oriented software systems and define a simple predictive model that can aid developers in detecting structural changes and as a consequence, improve the underlying development processes.", "num_citations": "33\n", "authors": ["1909"]}
{"title": "Reporting usability defects: do reporters report what software developers need?\n", "abstract": " Reporting usability defects can be a challenging task, especially in convincing the software developers that the reported defect actually requires attention. Stronger evidence in the form of specific details is often needed. However, research to date in software defect reporting has not investigated the value of capturing different information based on defect type. We surveyed practitioners in both open source communities and industrial software organizations about their usability defect reporting practices to better understand information needs to address usability defect reporting issues. Our analysis of 147 responses show that reporters often provide observed result, expected result and steps to reproduce when describing usability defects, similar to the way other types of defects are reported. However, reporters rarely provide usability-related information. In fact, reporters ranked cause of the problem is the most difficult …", "num_citations": "28\n", "authors": ["1909"]}
{"title": "Awesome! conveying satisfaction on the app store\n", "abstract": " In a competitive market like the App Store, high user perceived quality is paramount, especially due to the public review system offered. These reviews give developers feedback on their own apps, as well as help provide data for competitor analysis. However, given the size of the data set, manual analysis of reviews is unrealistic, especially given the need for a rapid response to changing market dynamics. Current research into mobile app reviews has provided an insight into the statistical distributions, but there is minimal knowledge about the content in these reviews. In particular, we do not know if the aggregated numerical rating is a reliable indicator of the information within a review. This work reports on an analysis of reviews to determine how closely aligned the numerical ratings are to the textual description. We observed that short user reviews mostly contain a small set of words, and the corresponding …", "num_citations": "23\n", "authors": ["1909"]}
{"title": "Toward a Social Media Usage Policy\n", "abstract": " Social media has become the archetype of technology underpinning communication and collaboration across all lifestyles, from the personal to the public. Despite its increasing deployment into corporate technology infrastructures, the encroachment of social media poses several doubts, including its business value, need for a social media strategy and its appropriate management. Although given a pressing need, there is a lack of clear guidance from IS literature around how to study these challenges, and ultimately to answer the question—is the use of social media a distraction at the work place? This research-in-progress paper lays the foundation to answer this specific question. Our work positions social media as a platform that can enable business and service value co-creation. We propose the Social Media-Beliefs, Action and Outcomes (SM-BAO) model, to help develop a framework that can inform social media use policy in the workplace.", "num_citations": "22\n", "authors": ["1909"]}
{"title": "Helix software evolution data set\n", "abstract": " The Helix Data Set is a compilation of release histories of a number of non-trivial Java Open Source Software Systems. It has been developed to assist researchers in the field of empirical software engineering with a focus on software evolution. Each of the systems available as part of the Helix Data Set includes: (1) The releases: the JARs containing the class files for each release of the systems along with meta data; (2) The metrics: a metric history derived from extraction of the releases. You can use this data directly for your research projects. The complete dataset is currently 84 .zip files (each containing .jar files, .version files and html files) and 42 .txt files. The collection of release histories currently measures approximately 2.23 GB in total but is available for download in separate components from the project's website.", "num_citations": "17\n", "authors": ["1909"]}
{"title": "Patterns of component evolution\n", "abstract": " Contemporary software systems are composed of many components, which, in general, undergo phased and incremental development. In order to facilitate the corresponding construction process, it is important that the development team in charge has a good understanding of how individual software components typically evolve. Furthermore, software engineers need to be able to recognize abnormal patterns of growth with respect to size, structure, and complexity of the components and the resulting composite. Only if a development team understands the processes that underpin the evolution of software systems, will they be able to make better development choices. In this paper, we analyze recurring structural and evolutionary patterns that we have observed in public-domain software systems built using object-oriented programming languages. Based on our analysis, we discuss common growth …", "num_citations": "17\n", "authors": ["1909"]}
{"title": "On the use of properties in java applications\n", "abstract": " When building software systems, developers have to weigh the benefits of using one specific solution approach against the risks and costs of using another one. This process is not random. Certain preferences, architectural styles, and solution domain pressures create systematic biases that we can measure in order to assess their impact on the system being built and the underlying development process itself. In this paper we explore, whether the getter and setter methods in Java give rise to a bias also. Getter and setter methods, called \"properties\", are perceived commonplace and considered by some as a threat to data encapsulation. However, little empirical evidence exists that can reliably inform us about the real impact of the use of properties in Java. For this reason, we examined 102 open-source Java systems and discovered that properties are employed much more carefully than one might expect. Contrary …", "num_citations": "16\n", "authors": ["1909"]}
{"title": "Learning better inspection optimization policies\n", "abstract": " Recent research has shown the value of social metrics for defect prediction. Yet many repositories lack the information required for a social analysis. So, what other means exist to infer how developers interact around their code? One option is static code metrics that have already demonstrated their usefulness in analyzing change in evolving software systems. But do they also help in defect prediction? To address this question we selected a set of static code metrics to determine what classes are most \"active\" (i.e., the classes where the developers spend much time interacting with each other's design and implementation decisions) in 33 open-source Java systems that lack details about individual developers. In particular, we assessed the merit of these activity-centric measures in the context of \"inspection optimization\" — a technique that allows for reading the fewest lines of code in order to find the most defects. For …", "num_citations": "14\n", "authors": ["1909"]}
{"title": "Evolution of cyclomatic complexity in object oriented software\n", "abstract": " It is a generally accepted fact that software systems are constructed and gradually refined over a period of time. During this time, code is written and modified until stable releases of the system emerge. Many researchers have studied systems over a longer period of time in order to understand how they change and evolve. Despite these efforts, we still lack a precise understanding how various properties of software change over time, in particular in the area of object-oriented systems. Such an understanding is of great importance if we want to come up with techniques to provide feedback on the evolution of quality and predictions about further evolution of software systems. Historically, collection of sufficient data to build useful models was not practical as source code and build histories were not freely available. It is our opinion that by focusing our attention towards Open source software OSS) repositories, we have a better hope of building predictive models to help developers and managers. In this paper, we will report on an exploratory study analyzing object oriented OSS projects and present our findings based on this analysis.", "num_citations": "14\n", "authors": ["1909"]}
{"title": "Examining digital assisted living: towards a case study of smart homes for the elderly\n", "abstract": " Actualising assisted living for increasing aging populations, who want to continue living at home, is a significant challenge in many countries. IT enabled assistive systems can address this challenge by providing services such as home automation, providing security, identifying potential health risks, and monitoring environmental hazards. However, current solutions often undervalue the effects of user perceptions of, and interactions with, technology when deploying such systems. As a result, current systems do not accurately represent the goals of the elderly users, who often do not identify the potential uses of such systems and perceive them to be too complex, invasive and/or irrelevant. Consequently such solutions frequently fail to be utilised to their full potential, thus deterring the successful adoption of technology for assisted living. This study aims to better understand the role of IT in assisted living by examining case studies in the literature through an affordance lens. We identify IT affordances of such digital assisted living systems based on the existing affordances of the ‘home environment’, and explore inter-relations between the IT affordances. These findings will form the theoretical foundations of a smart home project currently under development, which aims to help people to remain healthy and safe in their own home as they grow older. The initial iteration of this technology is planned to be trialled in homes of elderly users shortly, and will provide the case study for our future work.", "num_citations": "13\n", "authors": ["1909"]}
{"title": "A conceptual model for architecting mobile applications\n", "abstract": " Quality attributes are essential in software architecture and they are determined by identifying the concerns of the stakeholders of a system. The concerns of constructing mobile applications (apps) are quite specific due to the characteristics of mobile devices. These concerns have not been adequately addressed in industry standards and practices. In this paper, we present a mobile app development conceptual model comprising six key concepts that impact quality. Using two case studies, we show that these interrelated concepts influence the architectural decisions of mobile apps and their tradeoffs need to be well considered. As such, we suggest that these concepts should be first class entities when designing mobile app architecture to ensure that the quality attributes are satisfied.", "num_citations": "12\n", "authors": ["1909"]}
{"title": "App reviews: Breaking the user and developer language barrier\n", "abstract": " Apple, Google and third party developers offer apps across over twenty categories for various smart mobile devices. Offered exclusively through the App Store and Google Play, each app allows users to review the app and their experience with it. Current literature offers a general statistical picture of these reviews, and a broad overview of the nature of discontent of apps. However, we do not yet have a good framework to classify user reviews against known software quality attributes like performance or usability. In order to close this gap, in this paper, we develop an ontology encompassing software attributes derived from software quality models. This decomposes into approximately five thousand words that users employ to review apps. By identifying a consistent set of vocabulary that users communicate with, we can sanitise large datasets to extract stakeholder actionable information from reviews. The …", "num_citations": "9\n", "authors": ["1909"]}
{"title": "Intelligent sensing to inform and learn (InSTIL): a scalable and governance-aware platform for universal, smartphone-based digital phenotyping for research and clinical …\n", "abstract": " In this viewpoint we describe the architecture of, and design rationale for, a new software platform designed to support the conduct of digital phenotyping research studies. These studies seek to collect passive and active sensor signals from participants' smartphones for the purposes of modelling and predicting health outcomes, with a specific focus on mental health. We also highlight features of the current research landscape that recommend the coordinated development of such platforms, including the significant technical and resource costs of development, and we identify specific considerations relevant to the design of platforms for digital phenotyping. In addition, we describe trade-offs relating to data quality and completeness versus the experience for patients and public users who consent to their devices being used to collect data. We summarize distinctive features of the resulting platform, InSTIL (Intelligent Sensing to Inform and Learn), which includes universal (ie, cross-platform) support for both iOS and Android devices and privacy-preserving mechanisms which, by default, collect only anonymized participant data. We conclude with a discussion of recommendations for future work arising from learning during the development of the platform. The development of the InSTIL platform is a key step towards our research vision of a population-scale, international, digital phenotyping bank. With suitable adoption, the platform will aggregate signals from large numbers of participants and large numbers of research studies to support modelling and machine learning analyses focused on the prediction of mental illness onset and disease trajectories.", "num_citations": "8\n", "authors": ["1909"]}
{"title": "Measuring traffic congestion: an approach based on learning weighted inequality, spread and aggregation indices from comparison data\n", "abstract": " As cities increase in size, governments and councils face the problem of designing infrastructure and approaches to traffic management that alleviate congestion. The problem of objectively measuring congestion involves taking into account not only the volume of traffic moving throughout a network, but also the inequality or spread of this traffic over major and minor intersections. For modeling such data, we investigate the use of weighted congestion indices based on various aggregation and spread functions. We formulate the weight learning problem for comparison data and use real traffic data obtained from a medium-sized Australian city to evaluate their usefulness.", "num_citations": "8\n", "authors": ["1909"]}
{"title": "Designing an Evaluation Tool to Measure Emotional Goals\n", "abstract": " Human emotions have been widely researched in many disciplines such as psychology, philosophy, neuroscience and medicine. Their importance cannot be underestimated. Unfortunately, so far in software engineering, requirements engineers focus mostly on gathering functional and quality requirements and rarely consider how stakeholders feel or would like to feel when using a software product. Incorporating the user's emotional goals in software engineering can be very challenging considering that emotions are very complex and subjective. Moreover, when it comes to incorporating user emotions in software engineering, existing methodologies or frameworks provide very little guidance to software professionals. In this paper, the authors present work on evaluating emotional goals in a software engineering context. The authors describe the development of a questionnaire as an evaluation tool and evaluate …", "num_citations": "8\n", "authors": ["1909"]}
{"title": "Leveraging emerging web technologies for community engagement project success in higher education\n", "abstract": " The widespread availability of Web 2.0 technologies such as Facebook and Twitter has led to the adoption in a number of community engagement projects. Unfortunately, the breath and depth of these web technologies leads to a disjointed and incoherent adoption. In light of the above, there is a need for a model to structure its planning and execution. In this article, we present a model to assist community engagement projects. The model comprises of four crucial dimensions: functional quality, degree of psychological attachment, hedonic attitude of members and amount of social relationships. We discuss how each dimension can leverage on Web 2.0 technology capabilities in the context of uniS—the Information and Communications Faculty in a leading Australian University. The emphasis on community engagement follows for one, strategic recommendations proposed through Australian Universities Quality Agency (AUQA) reviews. Given this, we discuss two specific initiatives currently in place at UniS that attempts to improve community engagement. The implications of this article are twofold. For educators, it recommends a set of considerations for establishing and designing community engagement programs and initiatives for higher education. For managers, it proposes a tool for systematically evaluating engagement success of initiatives within a community of practice.", "num_citations": "7\n", "authors": ["1909"]}
{"title": "Do metrics help to identify refactoring?\n", "abstract": " Many iterative software development methodologies, such as for example eXtreme Programming, state that refactoring is one of the key activities to be undertaken in order to keep the code-base of a project well-structured and consistent. In such a context, poorly structured code may become a significant obstacle in adding new or in enhancing existing functionality. However, there is some anecdotal evidence that in many software projects, the underlying code-base is not necessarily refactored post-release, often due to time constraints or the misconception that refactoring does not add any apparent value. In order to get further insights into this problem area, we propose to investigate the usage frequency of refactorings in the context of open-source, object-oriented software systems. In this work, we will outline our approach to detecting refactoring and present results obtained from an initial pilot study.", "num_citations": "7\n", "authors": ["1909"]}
{"title": "What influences usability defect reporting?—A survey of software development practitioners\n", "abstract": " Software development organizations invest in test automation tools and methods to optimize defect discovery rates. The true value of these tools is realized when the defects are addressed before release, and hence good quality defect reports are critical. We describe a survey we conducted to better understand usability defect reporting, in particular, influences on the quality of usability defect reports. We analyze feedback from nearly 150 software developers and usability defect reporters and identify key determinants of quality defect reports, aspects of usability defects that are challenging to report and directions for future research into usability defect reporting tools to improve usability defect reports quality.", "num_citations": "6\n", "authors": ["1909"]}
{"title": "Viewpoint modelling with emotions: a case study\n", "abstract": " In modern software development, considering the viewpoints of stakeholders is an important step in building the right system. Over the past decade, several authors have proposed solutions to capture and model these viewpoints. While these solutions have been successful, one viewpoint they have largely ignored is the emotional viewpoint of stakeholders. Considering the emotional needs of stakeholders is important, because users' perceptions of a product are influenced by emotion as much as cognition. Building on their recent work in modelling the emotional goals of stakeholders, the authors extend an existing viewpoint framework to capture emotional viewpoints, and to carry these from early-phase requirements to detailed software design. They demonstrate this with a case study of an emergency alarm system for older people, presenting the entire suite of models for this case study.", "num_citations": "6\n", "authors": ["1909"]}
{"title": "A large-scale comparative analysis of Coding Standard conformance in Open-Source Data Science projects\n", "abstract": " Background: Meeting the growing industry demand for Data Science requires cross-disciplinary teams that can translate machine learning research into production-ready code. Software engineering teams value adherence to coding standards as an indication of code readability, maintainability, and developer expertise. However, there are no large-scale empirical studies of coding standards focused specifically on Data Science projects. Aims: This study investigates the extent to which Data Science projects follow code standards. In particular, which standards are followed, which are ignored, and how does this differ to traditional software projects? Method: We compare a corpus of 1048 Open-Source Data Science projects to a reference group of 1099 non-Data Science projects with a similar level of quality and maturity. Results: Data Science projects suffer from a significantly higher rate of functions that use an …", "num_citations": "5\n", "authors": ["1909"]}
{"title": "Hub Map: A new approach for visualizing traffic data sets with multi-attribute link data\n", "abstract": " Visualizing road traffic datasets involves representing junctions, their links, and the attributes of those links. Current traffic visualization techniques are not sufficient for professional traffic engineers, as they are limited in the number of attributes that can be represented. This paper proposes a new approach to visualize multiple attributes on graph edges without compromising their visibility. In particular, we introduce a parameterized connector symbol that increases the number of attributes that can be displayed on graph edges. We demonstrate that our approach can significantly increase the number of traffic parameters that can be displayed compared to existing traffic visualizations.", "num_citations": "5\n", "authors": ["1909"]}
{"title": "The Role of Process Integration for Supply Chain Agility: An Information Processing Perspective\n", "abstract": " As businesses strive to respond to customer demand at an acceptable cost in the face of market turbulence and volatility, interest in supply chain agility as the ability to address such market uncertainties has grown. As a research in progress paper, we examine the ways in which supply chain agility is enabled through IT-enabled information processing capabilities. We will apply a case study design to investigate the interactions between these capabilities (sensemaking and sensegiving), supply chain process integration and supply chain agility in the order fulfilment process of Visy, a large paper packaging and recycling company within the state of New South Wales. The data is expected to suggest the constituents of supply chain process integration supporting the relationship of information processing capabilities enabling supply chain agility. We will propose a process model of enabling supply chain agility from the sensemaking and sensegiving capabilities through supply chain coordination and network as the characteristics of process integration.", "num_citations": "5\n", "authors": ["1909"]}
{"title": "Agile development spikes applied to computer science education\n", "abstract": " Spikes are an agile software development technique used by software teams to investigate, close gaps and reduce risk. Computer science education can benefit from the application of agile techniques. In this paper we document our definition of spikes, adapted from agile software development practice, applied to computer science education across a number of different units. Our view is that spikes align well with many educational objectives. We also reflect on our educational experiences to present guidance on how and why spikes might be applied, including specific benefits, limitations and drawbacks.", "num_citations": "5\n", "authors": ["1909"]}
{"title": "Spectrum-based runtime anomaly localisation in service-based systems\n", "abstract": " Runtime anomalies occurring to service-based systems (SBSs) must be located and fixed in a timely manner in order to guarantee successful delivery of outcomes in response to user requests. Monitoring all component services constantly is impractical due to excessive resource consumption. Inspecting all component services upon anomalies is time-consuming and thus also impractical. In this work, we propose a novel approach that employs spectrum-based fault localisation techniques to locate runtime anomalies in SBSs. Large-scale experiments are conducted and experimental results are presented to demonstrate the effectiveness and efficiency of the proposed approach.", "num_citations": "4\n", "authors": ["1909"]}
{"title": "Examining the Role of Is Affordances in Enabling Time Critical Clinical Practices: An Information Processing Perspective\n", "abstract": " Globally, the healthcare domain is seeing quality improvements through the adoption of Information Technologies in its delivery, processes and culture. Healthcare quality is further refined as technology allows for knowledge dissemination, informing existing practices across countries with minimal effort. However, what affordance does the introduction of technology offer in a time critical environment? In this paper, we present an ongoing case study of a decision support system deployment at The Alfred Hospital, in Melbourne, Australia. This work outlines the affordances in: i) the time critical Trauma Centre from an information processing perspective, and ii) clinician use of the Algorithm Designer component to enrich the supported system processes. We observe how information standards, synergy and renewal were developed between the system and the users, to reduce error rates. We present a preliminary model of the important role Information Technology plays in the context of the Trauma Centre practices.", "num_citations": "3\n", "authors": ["1909"]}
{"title": "ICT-enabled time-critical clinical practices: Examining the affordances of an information processing solution\n", "abstract": " In this paper, we present a case study of a decision-support system deployment at The Alfred Hospital, in Melbourne, Australia. This work outlines Information and Communications Technology (ICT) affordances and their actualisations in time-critical clinical practices to enable better information processing. From our study findings, we present a stage-wise model describing the role played by ICT in the context of the Trauma Centre practices. This addresses a knowledge gap surrounding the role and impact of ICT in the delivery of quality improvements to processes and culture in time-critical environments, amid increasing expenditure on ICT globally. Our model has implications for research and practice, such that we observe for the first time how information standards, synergy and renewal are developed between the system and its users in order to reduce error rates in the healthcare context. Through the study findings, we demonstrate that healthcare quality can be further refined as ICT allows for knowledge dissemination and informs existing practices.", "num_citations": "2\n", "authors": ["1909"]}
{"title": "Mobile learning in corporate businesses: A review of literature focusing on journal articles\n", "abstract": " The growth in mobile devices has brought many opportunities for corporate businesses via mobile learning. However, corporate businesses seem to be slow in capitalising on mobile learning and limited empirical research has been found addressing this. This paper sets out to find the latest on the subject of mobile learning in corporate businesses by reviewing two prominent journal lists relevant to the Business and Information Systems domain; Australian Business Deans Council (ABDC) and the Computing Research and Education Association of Australasia (CORE). A Systematic Literature Review (SLR) approach was used to uncover the current thinking on the subject, including areas of focus and potential gaps. Findings show that highly ranked journals have neither featured mobile learning in the corporate business context nor do they feature any substantial Australian context. This research highlights the gap within literature and brings practical implication for those researching and intending to contribute to this domain.", "num_citations": "2\n", "authors": ["1909"]}
{"title": "Proceedings of the 24th Australian Computer-Human Interaction Conference\n", "abstract": " Abstract Source Materials Authors References Cited By Index Terms Publication Reviews Comments Table of Contents", "num_citations": "2\n", "authors": ["1909"]}
{"title": "Partition refinement of component interaction automata: why structure matters more than size\n", "abstract": " Automata-based modeling languages, like Component Interaction Automata, offer an attractive means to capture and analyze the behavioral aspects of interacting components. At the center of these modeling languages we find finite state machines that allow for a fine-grained description how and when specific service requests may interact with other components or the environment. Unfortunately, automata-based approaches suffer from exponential state explosion, a major obstacle to the successful application of these formalisms in modeling real-world scenarios. In order to cope with the complexity of individual specifications we can apply partition refinement, an abstraction technique to alleviate the state explosion problem. But this technique too exhibits exponential time and space complexity and, worse, does not offer any guarantees for success. To better understand as to why partition refinement succeeds in some cases while it fails in others, we conducted an empirical study on the performance of a partition refinement algorithm for Component Interaction Automata specifications. As a result we have identified suitable predictors for the expected effectiveness of partition refinement. It is the structure, not the size, of a specification that weighs heavier on the outcome of partition refinement. In particular, Component Interaction Automata specifications for real-world systems are capable of producing scale-free networks containing structural artifacts that can assist the partition refinement algorithm not only converge earlier, but also yield a significant state space reduction on occasion.", "num_citations": "2\n", "authors": ["1909"]}
{"title": "Data Provenance for Sport\n", "abstract": " Data analysts often discover irregularities in their underlying dataset, which need to be traced back to the original source and corrected. Standards for representing data provenance (i.e. the origins of the data), such as the W3C PROV standard, can assist with this process, however require a mapping between abstract provenance concepts and the domain of use in order to apply them effectively. We propose a custom notation for expressing provenance of information in the sport performance analysis domain, and map our notation to concepts in the W3C PROV standard where possible. We evaluate the functionality of W3C PROV (without specialisations) and the VisTrails workflow manager (without extensions), and find that as is, neither are able to fully capture sport performance analysis workflows, notably due to limitations surrounding capture of automated and manual activities respectively. Furthermore, their notations suffer from ineffective use of visual design space, and present potential usability issues as their terminology is unlikely to match that of sport practitioners. Our findings suggest that one-size-fits-all provenance and workflow systems are a poor fit in practice, and that their notation and functionality need to be optimised for the domain of use.", "num_citations": "1\n", "authors": ["1909"]}
{"title": "An interaction model for de-identification of human data held by external custodians\n", "abstract": " Reuse of pre-existing industry datasets for research purposes requires a multi-stakeholder solution that balances the researcher's analysis objectives with the need to engage the industry data custodian, whilst respecting the privacy rights of human data subjects. Current methods place the burden on the data custodian, whom may not be sufficiently trained to fully appreciate the nuances of data de-identification. Through modelling of functional, quality, and emotional goals, we propose a de-identification in the cloud approach whereby the researcher proposes analyses along with the extraction and de-identification operations, while engaging the industry data custodian with secure control over authorising the proposed analyses. We demonstrate our approach through implementation of a de-identification portal for sports club data.", "num_citations": "1\n", "authors": ["1909"]}
{"title": "Spatio-Temporal Reference Frames as Geographic Objects\n", "abstract": " It is often desirable to analyse trajectory data in local coordinates relative to a reference location. Similarly, temporal data also needs to be transformed to be relative to an event. Together, temporal and spatial contextualisation permits comparative analysis of similar trajectories taken across multiple reference locations. To the GIS professional, the procedures to establish a reference frame at a location and reproject the data into local coordinates are well known, albeit tedious. However, GIS tools are now often used by subject matter experts who may not have the deep knowledge of coordinate frames and projections required to use these techniques effectively.", "num_citations": "1\n", "authors": ["1909"]}
{"title": "Impact of viral propagation on user interface design\n", "abstract": " In recent times application developers are endeavouring to achieve viral growth of the application user base ecosystems. Viral Meme Propagation is the underlying phenomenon, which enables these applications to reach multiple users in a short period of time. In this paper we will analyse the basic properties that are required by an application and its user interface to achieve such growth. We propose a model that describes the lifecycle of a meme. Furthermore we support this model with a framework, which identifies user interface elements and application features that are the foundation to the meme propagation and classify these based on the stage of the lifecycle they belong to. The goal of this framework is to assist software developers in selecting these elements early on in the application design lifecycle, in order to improve the user experience.", "num_citations": "1\n", "authors": ["1909"]}