{"title": "Micro-payments based on iKP\n", "abstract": " Micro-payments are payments too small in amount to warrant the overhead costs of current nancial clearing networks. Furthermore one can expect that content servers for the global information infrastructure (GII) will have to process so many of these low value transactions that computationally complex and costly cryptographic protocols will be impractical. This report proposes a micro-payment scheme that can be bootstrapped with the already wellknown payment protocols for larger amounts, but does not depend on them for each microtransaction. Special attention is given to its integration into IBM's Internet Keyed Payment Systems (iKP).", "num_citations": "213\n", "authors": ["860"]}
{"title": "Secure anonymous information exchange in a network\n", "abstract": " Computer network management for electronic commerce requires technical implementations of business processes. The process addressed here is a technical method for a communication in which two or more parties legitimately want to communicate anonymously, often before discussing a deal or closing a business, eg for anonymous bidding or auctioning in electronic commerce. Essentially, the invention is a method, described by a protocol, for safely exchanging data in a network that provides a public key infrastructure and an anonymous communication possibility between network users. It consists of a sequence of steps in which both sender (eg customer) and addressee (eg merchant) compose data sets (ie, requests and replies) that are based on received data and/or prior knowledge. The data sets are enciphered to provide anonymity, and digitally signed to provide proof of the partner. The invention is …", "num_citations": "171\n", "authors": ["860"]}
{"title": "Reducing the cost of security in link-state routing\n", "abstract": " Security in link-state routing protocols is a feature that is both desirable and costly. This paper examines the cost of security and presents two techniques for efficient and secure processing of link state updates. The first technique is geared towards a relatively stable internetwork environment while the second is designed with a more volatile environment in mind.", "num_citations": "159\n", "authors": ["860"]}
{"title": "Method and system for changing an authorization password or key in a distributed communication network\n", "abstract": " A robust and secure password (or key) change method between a user and an authentication server in a distributed communication network is disclosed. The protocol requires the exchange of only two messages between the user desiring the key change and the server, the user's request including, at least partly encrypted, an identification of the sending user, old and new keys, and two nonces, at least one including a time indication. The authentication server's response includes a possibly encrypted accept/reject indication and the regularly encrypted request from the user.", "num_citations": "154\n", "authors": ["860"]}
{"title": "Method and Devices For User Authentication\n", "abstract": " For authenticating a user using a communication terminal (1) to access a server (4) via a telecommunications network, a personal identification code is received from the user From secure session establishment protocol messages exchanged (S1, S2, S3) between the communication terminal (1) and the server (4), a data set is generated (S4). Based on the data set, a transaction authentication number is generated (S52) using the personal identification code. The transaction authentication number is transmitted (S54) from the communication terminal (1) to the server (4). In the server (4), the transaction authentication number received is verified (S20) based on the secure session establishment protocol messages exchanged with the communication terminal (1). The transaction authentication number enables session aware user authentication that protects online users against real-time man-in-the-middle attacks.", "num_citations": "123\n", "authors": ["860"]}
{"title": "Lowering security overhead in link state routing\n", "abstract": " Security services in routing protocols are at the same time very important and very costly. This paper examines the cost of security in link state routing and develops techniques for efficient and secure processing of link state updates. Different approaches are recommended for stable and volatile network environments. Applications to mobile ad hoc networks are also considered.", "num_citations": "77\n", "authors": ["860"]}
{"title": "Does licensing require new access control techniques?\n", "abstract": " Licensing is a topic of increasing importance for software publishers and users. More and more, the magnitude of financial transfers between these two partners are determined by some electronic licensing service being part of the system on which the licensed software is running. In order to ease the use and management of such licensing schemes and to enable economic software usage in enterprise-wide computer systems through flexible and fair billing structures, various organizations are working on formulating requirements, defining architectures, and building standard interfaces for so called license brokerage systems. The trustworthiness of these services is essential because large amounts of money can depend on them. Most of these licensing services are currently operating independently of access control and rely on proprietary and unpublished security algorithms. This paper proposes an extension of …", "num_citations": "72\n", "authors": ["860"]}
{"title": "Method for performing a secure cash-free payment transaction and a cash-free payment system\n", "abstract": " A method for performing a cash-free payment transaction that comprises: a) a provider (PPPP) receives a pre-authorization message (2′) for a payment to be made by a buyer (B), the pre-authorization message being authenticated for example by a personal identification number; b) the provider (PPPP) generates a payment nonce in response to this pre-authorization message; c) the provider (PPPP) forwards this payment nonce (3′) to the buyer (B) and the provider (PPPP) approves the payment when asked or when being debited by a seller (S′) interface. The method further comprises that the above mentioned steps are performed by a private pre-authorization and payment provider (PPPP) and that the provider (PPPP) accepts a pre-authorization message being sent by a buyer's personal trusted device (PTD) being independent of the seller's interface and that the provider (PPPP) generates the payment …", "num_citations": "48\n", "authors": ["860"]}
{"title": "Control of information distribution and access\n", "abstract": " It is a well-known hypothesis that information will become the centerpiece of the society of the twenty-first century—if it is not already. The expectations reach as far as that information will have an importance to the coming society similar to that of “money” to a market economy.This article discusses some ingredients in the worldwide information infrastructure in which information is expected to assume such an important role, and it lists some of the issues that have to be solved before such statements can become true. First, the distribution of information over open computer networks such as the Internet is under focus. Then, access by users to information and ways to reward the information creator financially for granting such access are discussed. Next, not only the decision on disclosure, but also the control on the duration and intensity of the information usage is discussed. Lastly, an idea for a technical framework is …", "num_citations": "32\n", "authors": ["860"]}
{"title": "LTTP Protection—A Pragmatic Approach to Licensing\n", "abstract": " Licensing is a topic of increasing importance for software publishers and users. More and more, software licensing is performed electronically by mechanisms running on the system on which the licensed software operates. In order to facilitate the use and management of such licensing systems and to enable economic software usage in enterprise-wide computer systems, various organizations are formulating requirements and defining architectures and standard interfaces for license systems. The trustworthiness of these systems is essential because large amounts of revenue can depend on them. A long term solution called Stateful Access Control (SAC) has been proposed, which aims for maximal flexibility in the definition of the license policy and still minimizes the restrictions inferred by the system. To achieve a satisfactory long-term solution like SAC requires a perfectly orchestrated effort by all partners …", "num_citations": "30\n", "authors": ["860"]}
{"title": "Security of microsoft's identity metasystem and cardspace\n", "abstract": " Microsoft has designed and proposed an identity metasystem that is user-centric and consistent with open Web services (WS-*) standards. An implementation of the metasystem is, for example, available in the .NET Framework 3.0. It interfaces to the user by providing an identity selector named CardSpace (formerly codenamed InfoCard). Various applications can make use of CardSpace, including, for example, Microsoft Internet Explorer 7. We therefore expect Microsoft's identity metasystem and CardSpace to become widely deployed on the Internet and a popular target to attack. In this paper, we elaborate on the security of Microsoft's identity metasystem and CardSpace.", "num_citations": "12\n", "authors": ["860"]}
{"title": "Generic Extensions of WWW Browsers.\n", "abstract": " Current WWW browsers provide two main services: communication and information rendering. While this is su cient for some purposes, many future applications will need more sophisticated processing on the user side before server-data can be presented to the user or before the user input can be transferred to the servers. For example, electronic payments ought to be seamlessly integrated into a customer's browser to enable him to shop via the Web. This paper proposes two pragmatic approaches to ful ll these requirements without altering current browser technology. We conclude with the proposal of a generalized extension framework for WWW browsers.", "num_citations": "11\n", "authors": ["860"]}
{"title": "Verification and modelling of authentication protocols\n", "abstract": " With the emergence of numerous distributed services, the importance of electronic authentication in networks is rapidly increasing. Many authentication protocols have been proposed and discussed. Burrows, Abadi and Needham [BAN1] created a logic of authentication to formally analyze authentication protocols. This BAN-logic has been subject to critique and several extensions have been suggested. Nonetheless, due to its straightforward design and its ease-of-use, it attracts the attention of current research. In this paper, an authentication logic is proposed which is built closely after the BAN-logic. It addresses answers to important criticisms of BAN like the non-disclosure problem, and avoids some newly discovered weaknesses of BAN, e.g. with respect to freshness. It also does not require any idealization which is a major hurdle to the correct usage of BAN. This extended BAN-logic is instrumented as a …", "num_citations": "11\n", "authors": ["860"]}
{"title": "Using the Internet to decrease Software Piracy-on Anonymous Receipts, Anonymous ID Cards, and Anonymous Vouchers\n", "abstract": " Copyright piracy occurs both on the producer side of copyrighted information as well as the consumer side. The producer side experiences two forms of pirating: i) Entirely illegal reproduction and distribution of pirated software, and the more subtle problem of ii) authorized vendors defrauding their software producers. for example, by placing bootlegged copies on their shelves that are indistinguishable by a consumer from authentic packages. This paper discusses how the problems on the producer's side could be alleviated by a different software vending method supported by Internet technologies.", "num_citations": "8\n", "authors": ["860"]}
{"title": "Protecting TLS‐SA implementations for the challenge‐response feature of EMV‐CAP against challenge collision attacks\n", "abstract": " Secure Sockets Layer (SSL)/Transport Layer Security (TLS) session‐aware user authentication (TLS‐SA) can be used to protect SSL/TLS‐based e‐commerce applications against man‐in‐the‐middle (MITM) attacks. The main idea is to make the user authentication depend not only on the user's credentials, but also on state information related to the SSL/TLS session in which the credentials are transferred to the server. This, in turn, allows the server to detect inconsistencies caused by an MITM. There are many possibilities to implement TLS‐SA and to make a user authentication scheme be SSL/TLS session‐aware. In this paper, we take the challenge‐response (C/R) feature of the Europay International, MasterCard, and Visa (EMV) Chip Authentication Program (CAP) as an example, and we argue that a TLS‐SA implementation for this feature is appropriate but susceptible to challenge collision attacks. We then …", "num_citations": "5\n", "authors": ["860"]}
{"title": "Robust and secure password and key change method\n", "abstract": " This paper discusses issues and idiosyncrasies associated with changing passwords and keys in distributed computer systems. Current approaches are often complicated and fail to provide the desired level of security and fault tolerance. A novel and very simple approach to changing passwords/keys is presented and analyzed. It provides a means for human users and service programs to change passwords and keys in a robust and secure fashion.", "num_citations": "5\n", "authors": ["860"]}
{"title": "Management von Sicherheitsdiensten in verteilten Systemen\n", "abstract": " Immer mehr wird in vernetzte Arbeitsplatzrechner investiert, um außer Benutzerfreundlichkeit auch den Nutzen billiger Hardware und Standardsoftware zu haben. Neben Sicherheit ist deren Management eine der wichtigsten Anforderungen, welche in solch verteilten Systemen gestellt werden. Insbesonders sind Werkzeuge gefordert, die große Benutzerpopulationen und von ihnen zugreifbare Betriebsmittel kohärent verwalten. Wir stellen in diesem Beitrag die SAMSON Sicherheitsmanagement-Architektur vor. Besonderes Augenmerk liegt auf der Sicherung der Infrastruktur und der Verwaltung heterogener Verzeichnisse, welche die autorisierten Benutzer und Betriebsmittel definieren.Erschienen in Sicherheit in Informationssystemen, Proceedings der Fachtagung SIS’94, ISBN 3 7281 2039 Permission to copy without fee all or part of this material is granted provided that the copies are not made or distributed for …", "num_citations": "2\n", "authors": ["860"]}