{"title": "Una visión de la enseñanza de la ingeniería de software como apoyo al mejoramiento de las empresas de software\n", "abstract": " El desarrollo de software es una actividad compleja que requiere la integración de factores técnicos, gerenciales y organizacionales. Consecuentemente, es un reto para la academia preparar estudiantes orientados a mejorar la práctica del desarrollo en las organizaciones de software. Los principios y estrategias propuestos en este trabajo, parten de dos requerimientos básicos: a) Los profesores deben tener una vista unificada acerca del cuerpo de conocimiento que soporta esta área; b) La academia debe tener un percepción de la realidad de esta práctica en las organizaciones de software y los problemas que dichas organizaciones enfrentan, debido a la falta de aplicación de buenas prácticas de ingeniería de software. Las estrategias definidas están encaminadas a formar las competencias requeridas de tal forma que los futuros desarrolladores estén convencidos que las prácticas de ingeniería de software son claves para el desarrollo exitoso de software.", "num_citations": "61\n", "authors": ["1381"]}
{"title": "MDA y el papel de los modelos en el proceso de desarrollo de software\n", "abstract": " El papel de los modelos es fundamental en el desarrollo de software para potenciar el reúso de los diferentes elementos del software y facilitar la labor de los diferentes roles que participan del proceso. La Arquitectura Dirigida por Modelos (MDA) propone un proceso de desarrollo basado en la realización y transformación de modelos. Los principios en los que se fundamenta MDA son la abstracción, la automatización y la estandarización. El proceso central de MDA es la transformación de modelos que parten del espacio del problema (CIM) hasta modelos específicos de la plataforma (PSM), pasando por modelos que describen una solución independientemente de la computación (PIM). Para explicar el papel de los modelos en el proceso de desarrollo de software este artículo explora los principales conceptos presentados en la propuesta de MDA.", "num_citations": "57\n", "authors": ["1381"]}
{"title": "Hacia una comunidad educativa interactiva\n", "abstract": " El grupo de investigación en informática educativa de la Universidad EAFIT haliderado, desde 1987, procesosde incorporación de tecnologías de información y comunicación en los ambientes de aprendizaje. Las diversas experiencias vividas por el grupo de investigadores, asistentes, auxiliares, estudiantesy actores de lacomunidad educativa, que de manera comprometida han formado parte de los equipos de trabajo, son en gran parte larazón por laque, durante los últimos cinco años, la preocupación por la modelación de espacios electrónicos que respondan a las necesidades del contexto educativo, y asus actores, hayasido una línea de investigación para el grupo. Las experiencias obtenidas con la construcción del Modelo Conexiones2, dirigido a los ambientes de aprendizaje escolar, y cuya proyección al entorno comunitario hizo posible recorrer un nuevo camino en torno al concepto de comunidades rurales y urbanas marginales y su relación con las tecnologías de información y comunicación, dieron pie a la primera aproximación al tema de comunidades virtuales, que fue realizada a través de la investigación Comunidades educativas virtuales: aprendiendo dela comunidad real paraterraformar el ciberespacio3, durante lacual se construyó un primer estado del arte en el temade comunidades virtualesaescalamundial, incluyendo los principales autores y sus posicionesfrentealaevolucióntecnológicay lasimplicacionesmultidi-", "num_citations": "39\n", "authors": ["1381"]}
{"title": "Potencial agroindustrial de cáscaras de mango de las variedades Keitt, y Tommy Atkins (Mangifera indica)\n", "abstract": " En el estudio se evaluó el potencial agroindustrial de las cáscaras de mango de las variedades Keitt y Tommy Atkins, por sus características de rendimientos, contenidos en compuestos fenólicos totales y composición proximal (materia seca, proteína, extracto etéreo, cenizas, fibras dietéticas y energía bruta). Las cáscaras se liofilizaron con el fin de preservar sus compuestos antioxidantes. Se utilizó un diseño unifactorial con dos niveles (variedades) y los datos se presentan como media±desviación estándar (P= 0.05). Con el procesamiento artesanal se produjeron 13.5±0.48% de cáscaras para la variedad Tommy Atkins y 16.1±0.5% para la variedad Keitt, con materia seca de 18 y 17%, respectivamente. Por sus contenidos de materia seca, estos residuos agroindustriales tienen un alto potencial para desarrollar productos de valor agregado. Ambas variedades presentaron cáscara con alto contenido de fibras soluble e insoluble (Keitt 22.1% bs y Tommy Atkins19. 9% bs). Se concluye que las cáscaras de mango de estas variedades tienen potencial como ingrediente o suplemento alimentario y en la formulación de alimentos funcionales prebióticos, ya que son una excelente fuente de fibra dietética y de compuestos fenólicos (> 3000 mg/100 g de MS).", "num_citations": "36\n", "authors": ["1381"]}
{"title": "A Domain Specific Language to Generate Web Applications.\n", "abstract": " Nowadays building a web application is still a complex process that requires a big effort to get several tasks done. This article presents a domain specific language aimed to simplify web application development by using it within a MDSD generation process, based on the construction and transformation of high level models from a domain structure viewpoint. this leads software development to focus on understanding the problem and doing a better business analysis, leaving the construction of the solution to a code generation process, thus reducing time and cost.", "num_citations": "19\n", "authors": ["1381"]}
{"title": "Juegos en la Enseñanza de la Ingeniería del Software\n", "abstract": " Serious games, mainly videogames, have increased their use in the teaching of software engineering as motivation factors for the significant learning. This paper stresses on the existence or lack of their pedagogical and didactic supports, through the analysis derived from the state of the art of the serious games related to the software engineering. Furthermore, this work proposes pedagogical postulates that bear these games and makes a classification of them. The results shown here make part of a research developed under the projects: Information and Communication Technologies as a Support for Teaching (TICAD for its acronym in Spanish) of the Instituto Tecnológico Metropolitano (ITM) and Information and Communication Technologies used for software engineering teaching (TICSOFT for its acronym in Spanish) of Masters in Computer Engineering of the Eafit University.", "num_citations": "15\n", "authors": ["1381"]}
{"title": "Análisis de la Ingeniería de Requisitos Orientada por Aspectos según la Industria del Software\n", "abstract": " La aplicación de buenas prácticas en la gestión de requisitos de software es una condición fundamental para lograr productos de calidad. Por lo tanto, es importante que las compañías de desarrollo de software mantengan una investigación constante alrededor de nuevas técnicas que mejoren actividades de requisitos tales como levantamiento, especificación y modelado. En este artículo se presenta un estudio de los enfoques más representativos de la ingeniería de requisitos orientada por aspectos que podrían ayudar a resolver problemas que enfrentan las compañías de software durante las etapas tempranas de desarrollo. Se hace un análisis comparativo entre los enfoques, a partir de los criterios de alcance, trazabilidad, composición de requisitos, manejo de conflictos, mapeo, validación-verificación y escalabilidad. Los resultados obtenidos permiten detectar las oportunidades que el enfoque de aspectos ofrece para mejorar el proceso de los requisitos.", "num_citations": "15\n", "authors": ["1381"]}
{"title": "Marco de Referencia para la Evaluación de Herramientas basadas en MDA.\n", "abstract": " La Arquitectura Dirigida por Modelos o MDA, es una propuesta reciente de OMG que muestra un proceso de desarrollo basado en la realización y transformación de modelos, en donde las herramientas de apoyo juegan un papel fundamental. En este trabajo se definen los mecanismos, referentes y estrategias para evaluar herramientas basadas en MDA. Este marco de referencia estudia diez herramientas, implementando en cada una el estudio de un caso y clasificándolas en cinco categorías así: OptimalJ y AndroMDA en la categoría de despliegue de aplicaciones, UMT y ATL en la categoría de transformación, Enterprise Architect y Jdeveloper en la categoría de clásicas de modelado y desarrollo, OCLE y Octopus en la categoría de entornos de verificación de modelos, y EMF y Jamda en la categoría de apoyo al desarrollo de herramientas. Este trabajo compila y extiende trabajos anteriores, de tal manera …", "num_citations": "14\n", "authors": ["1381"]}
{"title": "Géneros de Braconidae del estado de Guanajuato (Insecta: Hymenoptera)\n", "abstract": " Se realizaron un total de 153 oolectas de bracónidos en diferentes localidades del estado de Guanajuato, México, el período de colecta comprendió del 20 oe mayo de 1995 al ll de noviembre de i998. Para complementar la información acerca de los bracónidos presentes en el estado, se revisaron las colecciones del Instituto de Fitosanidad del Colegio de Postgraduados (CEIFIT), del Instituto Nacional de Investigaciones Forestales, Agrícolas y Pecuarias (INIFAPI y de Ia Escuela Superior de Agricultura del Copal, Irapuato, Gto.(LTC). Se registraron ﬁl géneros, pertenecientes a 31 tribus y 19 stibfamilias de Braconidae. Los géneros más abundantes fueron Aphidrus, Opius y Apanteïes. Los géneros con mayor número de especies representadas fueron Bracon y Opfus. Las sublamilias con mayor número de géneros representados en Guanajuato fueron Alysiinae y Euphorinae. De los géneros que se encontraron …", "num_citations": "10\n", "authors": ["1381"]}
{"title": "Lecciones Aprendidas en el Acompañamiento Masivo para Mejora de Procesos en Empresas de Software: Un Caso Colombiano.\n", "abstract": " Los programas de acompañamiento masivo para la mejora del proceso software, son una estrategia utilizada en países latinoamericanos que busca mejorar la competitividad de la industria de software. Este tipo de programas tiene mayores retos que cuando una empresa aborda el programa de manera individual. En este trabajo se presentan las lecciones aprendidas de este tipo de programa realizado en Colombia, utilizando CMMI-DEV como modelo referente. Las lecciones han sido agrupadas en 4 categorías: con respecto al contexto de las empresas participantes, con respecto al acompañamiento realizado por el equipo, con respecto al proyecto de la mejora en cada empresa y, finalmente, con respecto al modelo de calidad utilizado; estas lecciones se contrastan con las identificadas en trabajos similares.", "num_citations": "9\n", "authors": ["1381"]}
{"title": "Una revisión de modelos y semánticas para la trazabilidad de requisitos\n", "abstract": " Realizar el seguimiento a los requisitos a lo largo del proceso de desarrollo de software no es tarea fácil. Todo artefacto de software cambia en el tiempo por la evolución en las necesidades de los usuarios. Para minimizar el impacto causado por dicha evolución, la práctica de la trazabilidad ha sido estudiada e implementada con diferentes modelos y técnicas que permiten lograr mayor calidad en los productos de software. En este artículo se muestra una revisión conceptual de algunas de las más representativas aproximaciones de la práctica de la trazabilidad de requisitos y se analiza la forma como contribuyen a la verificación de la consistencia y completitud de los modelos de desarrollo.", "num_citations": "7\n", "authors": ["1381"]}
{"title": "New host record for Urosigalphus mimosestes Gibson and first record of U. neomexicanus Crawford (Hymenoptera: Braconidae) in México.\n", "abstract": " New distribution record and host (bruchid) associations data for Urosigalphus (Bruchiurosigalphus) mimosestes are given, together with new distribution records for U.(Microurosigalphus) neomexicanus in Mexico mexico Subject Category: Geographic Entities", "num_citations": "7\n", "authors": ["1381"]}
{"title": "Un esquema de modelado para soportar la separación y transformación de intereses durante la ingeniería de requisitos orientada por aspectos\n", "abstract": " En el proceso de desarrollo de software, el control de la evolución de los requisitos es uno de los factores más relevante para lograr software fiable y exacto. Nuevos paradigmas, como el Desarrollo de Software Orientado por Aspectos y el Desarrollo Dirigido por Modelos, ofrecen mecanismos y estrategias de separación y transformación de intereses para soportar la evolución de lus requisitos. En este artículu se presenta un esquema de modelado que integran los dos paradigmas en un patrón de transformación. Éste estandariza la separación arquitectónica de intereses en diferentes niveles de abstracción y pruvee un conjunto de reglas de transformación que suportan la trazabilidad de los requisitos. Se desarrolla un caso de estudio para validar el esquema.", "num_citations": "6\n", "authors": ["1381"]}
{"title": "A Model to Classify Knowledge Assets of a Process-Oriented Development\n", "abstract": " Knowledge assets are knowledge regarding markets, products, technologies and organizations, that a business needs to own and that enable its business processes to generate profits. Today, how to model knowledge assets is a concern of the organizational modeling community; mostly because consensus on a knowledge asset model is far from achieved. This chapter is aiming at identifying a model to characterize knowledgeable assets and their relationships in a software organization. Generally speaking, knowledge assets represent intellectual capital for a software organization and support the whole organizational process. The model proposed here is an initial step towards defining knowledge management as a transversal process at the organization. An instantiation of the model is illustrated through a case study in a real software company that recognizes the value of knowledge as a tool to support and …", "num_citations": "6\n", "authors": ["1381"]}
{"title": "La ingeniería de requisitos orientada a aspectos: una experiencia de aplicación en un sistema de ayuda en línea\n", "abstract": " La Ingeniería de Rrequisitos Orientada a Aspectos provee enfoques para la elicitación y especificación de los asuntos y asuntos transversales en etapas tempranas de desarrollo de software. Este artículo presenta un caso de estudio para evaluar un modelo de la separación multidimensional de asuntos orientados a aspectos. Con el caso de estudio, se revisan sus características para la elicitación, análisis y trazabilidad de requisitos, así como algunas limitaciones del modelo y cómo este puede ser adaptado al proceso de desarrollo. Además, planteamos un conjunto de argumentos que podrían promover el desarrollo y evolución de este modelo.", "num_citations": "5\n", "authors": ["1381"]}
{"title": "How face the top mde adoption problems\n", "abstract": " Model Driven Engineering (MDE) refers to the creation and manipulation of models in the end-to-end application lifecycle. When adopting a model-based development approach many challenges arise, some of these are related to the immaturity of the methods and tools that support this paradigm. This paper presents an exploratory case study developed to analyze how the renowned MDE technology solutions contribute to face the adoption problems. The case study consisted of developing a Web application for an incident management process based on ITIL (Information Technology Infrastructure Library) using tools from three different MDE approximations: MDA, MDSD, and BPM. As a result of our study, we suggest different strategies to help practitioners face the top MDE adoption problems.", "num_citations": "4\n", "authors": ["1381"]}
{"title": "Las bodegas de datos como apoyo a los sistemas de información acerca del negocio\n", "abstract": " El contexto dinámico y competitivo de la organización actual exige permanentes soluciones informáticas que apoyen efectivamente sus estrategias y objetivos. Las bodegas de datos-Datawarehouse, han incursionado en el mercado como una solución innovadora al problema del manejo de datos enmarcando dicha solución mayormente, desde el punto de vista tecnológico, sin considerar los aspectos organizacionales y metodológicos involucrados.", "num_citations": "4\n", "authors": ["1381"]}
{"title": "An empirical study of application of PSP methodology with students of a Systems Technology program with different levels of training\n", "abstract": " It seeks to determine the feasibility and appropriateness of applying the first level of Personal Software Process in Systems Technology program with emphasis on software development, in order to develop in the students, basic and technical skills in Project Management and Quality. It was designed and implemented a pilot test for four groups of different levels of training. Each group performed two individual practices, according to their level of training, from which they collected some data that showed the learning outcomes. The main findings are: (a) the opening of freshman students to the application of PSP, in contrast to the resistance of students from last semester to the application of PSP, (b) the complexity of the tool in time and defects recording that generates more work to students and divert their attention from the technical work; (c) positive relationship between final product quality and adoption of PSP.", "num_citations": "2\n", "authors": ["1381"]}
{"title": "Un lenguaje formal para especificación y refinamiento de Objetos de Negocio\n", "abstract": " La descomposición, tanto horizontal como vertical, es una estrategia para enfrentar la complejidad del problema y construír componentes software reusables. El lenguaje extendido de Oasis permitirá formalizar el proceso de especificación y refinamiento de los componentes, incorporando dos tipos de clases: Las clases tipo actividad que establecen la comunicación desde y hacia el entorno, implementan las reglas del negocio del comportamiento global y definen el mecanismo de sincronización de servicios. Las clases tipo recurso que describen la estructura y el compromiso (rol) de los objetos en un comportamiento. Según el nivel de abstracción, estos dos tipos representan conceptos abstractos en el dominio del problema o conceptos específicos en el dominio de la solución. El proceso de refinamiento representa un cambio de granularidad que transforma un requerimiento abstracto en un diseño concreto …", "num_citations": "2\n", "authors": ["1381"]}
{"title": "Un modelo para el desarrollo de componentes reusables\n", "abstract": " El proceso de desarrollo de componentes de especificación es una secuencia de transformaciones de un nivel de abstracción a otro donde el centro del análisis son las colaboraciones que se suceden entre los objetos de un dominio del problema. La notación extendida del diagrama de secuencia permite derivar una colaboración compartida en nuevas colaboraciones; en cada nivel se define un modelo de roles que representa el vocabulario de la especificación. El proceso de refinamiento puede darse tanto para los comportamientos como para los objetos; este proceso es soportado formalmente por el principio de reificación y el lenguaje Oasis puede ser extendido para formalizar este proceso. Las primitivas básicas de transformación del componente son: refinar, confrontar, derivar y ejecutar.", "num_citations": "2\n", "authors": ["1381"]}
{"title": "ESTUDIO DE MEDICIÓN DE CALIDAD EN UN MERCADO FRACTURADO Y EN COMPETENCIA La calidad percibida y objetiva en el sector eléctrico canario\n", "abstract": " El objetivo de esta investigación es exponer los resultados obtenidos como conclusión de los estudios realizados con la Calidad Percibida y la Calidad Objetiva de los consumidores en los segmentos residencial y empresas en relación con la actividad energética.  Los datos los hemos obtenido realizando encuestas para la medición de la calidad percibida y presencialmente los referentes a la objetiva. Con estos datos se ha realizado un estudio detallado de su importancia cuantitativa y su comportamiento durante dos años consecutivos, así como la toma de decisiones orientada a mejorar aquellos indicadores de peor valoración  Haremos especial hincapié en aquellos conceptos que nos han servido de punto de partida para el análisis y desarrollo de la calidad, basándonos en una discusión lógica de lo que afecta, desde la óptica de la regulación, situación de los prestadores que operan en el sector …", "num_citations": "1\n", "authors": ["1381"]}
{"title": "Caso de estudio sobre apropiación de SCRUM en empresas que han adoptado CMMI\n", "abstract": " Actualmente la industria de software local se enfrenta a una situación interesante: de una parte se evidencia un auge en la adopción de las prácticas ágiles, que buscan encontrar mejores formas de trabajo de los equipos de desarrollo de software y, de otra parte, algunas de estas industrias, ya han realizado proyectos de mejora de procesos utilizando CMMI como el modelo referente, e incluso algunas de estas compañías cuentan con valoraciones oficiales de madurez en niveles 2, 3 y superiores -- El presente trabajo analiza esta situación con el propósito de conocer como ha sido la adopción de estas prácticas ágiles en empresas de desarrollo que anteriormente han adoptado prácticas orientadas a planes como CMMI o PSP/TSP -- En algunos casos, las empresas buscan convivir con ambos enfoques entendiendo que se debe elegir la práctica dependiendo del contexto o teniendo la apertura de realizar una mezcla de prácticas tradicionales y ágiles, por otro lado también hay empresas que buscan  adoptar solo las prácticas ágiles de manera estricta para cualquier tipo de proyecto quizá buscando agilidad -- El objetivo de este trabajo es acumular, estructurar y divulgar información veraz sobre los retos y logros que las empresas de desarrollo de software han tenido al adoptar prácticas ágiles como Scrum, dentro del marco de un proyecto liderado por Ruta N (organismo que promueve la transferencia tecnológica en la ciudad de Medellín) en el que participaron un total de 10 empresas de la ciudad -- Con el apoyo de un método para estudio experimental de tipo cualitativo (Grounded Theory), se busca identificar una teoría alrededor …", "num_citations": "1\n", "authors": ["1381"]}
{"title": "Contaminación de metales en zonas residenciales debido a jales de actividades mineras en ambientes semiáridos: Caso: Nacozari, Sonora México\n", "abstract": " El contenido metálico se midió en las escombreras, sales eflorescentes, el polvo del camino y los suelos residenciales para investigar la contaminación derivada de la actividad minera pasada en Nacozari, Sonora, México. Efectos climáticos como vientos fuertes y lluvias pueden tener gran impacto en la dispersión de metales en las zonas semi-áridas, ya que los suelos suelen ser de escasa vegetación. Los análisis geoquímicos de este sitio revelaron que a pesar de que el contenido total de metal en las escombreras fue relativamente bajo (por ejemplo, Cu= 1000 mg/Kg), metales como Mn, Ba, Zn, Cu fueron encontrados en niveles significativamente más altos en las sales eflorescentes formadas por la evaporación en la superficie del embalse de relaves después de la temporada de lluvias (por ejemplo, Cu= 68.000 mg/Kg). Estas sales eflorescentes de grano fino son susceptibles a la erosión eólica dando lugar a una gran dispersión hacia suelos residenciales. Nuestros resultados resaltan la importancia según la temporada de la formación de sales y la erosión del viento en la determinación de los niveles de riesgo asociados con la inhalación o ingestión potencial de partículas aéreas procedentes de sitios contaminados, tales como diques de relaves. En escombreras con bajo contenido de metales ubicadas en ambientes áridos y semi-áridas, las sales eflorescentes podrían representar un riesgo para la salud humana y un desafío para el establecimiento de vegetación en residuos mineros.", "num_citations": "1\n", "authors": ["1381"]}
{"title": "Aspect-oriented software engineering: An experience of application in a help desk system\n", "abstract": " TABARES, MARTA S.; ANAYA, RAQUEL and ARANGO, FERNANDO. ASPECT-ORIENTED SOFTWARE ENGINEERING: AN EXPERIENCE OF APPLICATION IN A HELP DESK SYSTEM. Dyna rev. fac. nac. minas [online]. 2007, vol. 74, n. 153, pp. 285-299. ISSN 0012-7353.", "num_citations": "1\n", "authors": ["1381"]}