{"title": "Real time pothole detection using android smartphones with accelerometers\n", "abstract": " The importance of the road infrastructure for the society could be compared with importance of blood vessels for humans. To ensure road surface quality it should be monitored continuously and repaired as necessary. The optimal distribution of resources for road repairs is possible providing the availability of comprehensive and objective real time data about the state of the roads. Participatory sensing is a promising approach for such data collection. The paper is describing a mobile sensing system for road irregularity detection using Android OS based smart-phones. Selected data processing algorithms are discussed and their evaluation presented with true positive rate as high as 90% using real world data. The optimal parameters for the algorithms are determined as well as recommendations for their application.", "num_citations": "533\n", "authors": ["1951"]}
{"title": "Towards vehicular sensor networks with android smartphones for road surface monitoring\n", "abstract": " Road surface monitoring, including automated pothole and bump detection, is essential for both drivers and road maintainers. This paper presents preliminary results from an ongoing experimental study with the central question: is a smartphone with Android operating system capable of performing road surface monitoring using participatory sensing approach? The test results with 3 Android models and several tracks are presented and demonstrate feasibility of the approach.", "num_citations": "106\n", "authors": ["1951"]}
{"title": "Lynxnet: Wild animal monitoring using sensor networks\n", "abstract": " Monitoring wild animals, especially those that are becoming endangered (for example, lynxes and wolves) is important for biology researchers. Solutions for the monitoring already exist; however, they all have drawbacks, such as limited range or lifetime, sensing modality, reporting delays, unreliability of operation. In this work we describe our experiences in designing an improved animal monitoring sensor system and low-level software for sensor node control and communication. The target animals for this particular research are wild lynxes or canines, however it can be extended to other animal species. The LynxNet system is based on tracking collars, built around TMote Mini sensor nodes, sensors, GPS and 433MHz radio, and stationary base stations, placed at the locations that are frequented by the animals. We present preliminary field results of our radio communication range tests.", "num_citations": "63\n", "authors": ["1951"]}
{"title": "SADmote: a robust and cost-effective device for environmental monitoring\n", "abstract": " Time to deployment for wireless sensor networks could be reduced by using commercial sensor nodes. However, this may lead to suboptimal flexibility, power consumption and cost of the system. Our pilot deployment for precision agriculture and fruit growing research showed similar conclusions and outlined the design decisions leading to SADmote: a new sensor node for environmental monitoring. It was evaluated both in the lab and field, showing improved energy consumption over commercial solutions such as Tmote Sky and Waspmote.", "num_citations": "16\n", "authors": ["1951"]}
{"title": "Virtual ground truth in vehicular sensing experiments: How to mark it accurately\n", "abstract": " Road surface quality monitoring is an important requirement for efficient, safe and comfortable transportation. However, the data collection is made difficult by the scope of the data source. Therefore, participatory sensing is a promising approach for road damage assessment. We are developing a vehicular participatory sensing application using Android smart-phones for pothole detection. This paper describes lessons learned from our field tests, which have exposed the deficiencies in terms of collected data quality. Nevertheless, the tests provide invaluable experience for planing future field tests and improvements to the test execution procedure for vehicular sensing researchers. Based on empirical and analytical results, we conclude, that semi-automated ground-truth reference point recording by a human observer in a moving vehicle while doing the actual data collection is imprecise as a consequence of multiple technical and human factors. We also discuss the motivation, why careful pothole position marking and categorization by walking along the test track is capable of providing highly accurate ground-truth.", "num_citations": "13\n", "authors": ["1951"]}
{"title": "RFID communication: How well protected against reverse engineering?\n", "abstract": " The most important advantages of RFID technology are transmitting and receiving of information wirelessly as well as low implementation and maintenance costs. Such attractive features are reason for widespread usage of RFID systems - from tracking of assets to measurement of the timing during sporting events. To ensure secure operation of such systems they should have appropriate protection against reverse engineering. The contribution of this paper is a method for reverse engineering of specific RFID system used for time measurements during sporting events. Selected communication protocol aspects are discussed and their replication with off-the-shelf hardware and software with the aim to simulate a non-existing RFID tag with certain self selected ID number are presented.", "num_citations": "7\n", "authors": ["1951"]}
{"title": "Team University of Latvia GCDC 2011 Technical Paper\n", "abstract": " Our team consists of researchers and engineers affiliated with University of Latvia and Institute of Electronics and Computer science, both located in Riga, Latvia. Our expertise is in computer hardware and software, including signal processing, sensor networks and wireless communication. In GCDC challenge context we have the following roles: Leo Selavo: project lead; Andris Gordjusins: vehicle control; Georgijs Kanonirs: positioning; Vadims Kurmis: communication; Artis Mednis: system analysis; Girts Strazdins: algorithms; Reinholds Zviedris: user interface.", "num_citations": "3\n", "authors": ["1951"]}
{"title": "Team “Latvia” GCDC 2011 Technical Paper\n", "abstract": " Our team consists of researchers and engineers affiliated with University of Latvia and Institute of Electronics and Computer science, both located in Riga, Latvia. Our expertise is in computer hardware and software, including signal processing, sensor networks and wireless communication. In GCDC challenge context we have the following roles: Leo Selavo: project lead; Andris Gordjusins: vehicle control; Georgijs Kanonirs: positioning; Vadims Kurmis: communication; Artis Mednis: system analysis; Girts Strazdins: algorithms; Reinholds Zviedris: user interface.", "num_citations": "3\n", "authors": ["1951"]}
{"title": "Heterogeneous tool kit for real-time edutainment\n", "abstract": " In today’s world, digital technology is taking over our lives more and more including education and entertainment. In both fields situations occurs when someone needs to control or coordinate tasks in different locations to be performed just in time. There exists certain amount of modus operandi characterized by various levels of complexity that tries to solve this issue. During state-of-the-art research authors found a lack of simple solutions that could be easily adapted for specific user requirements while still suitable for wide area of needs. In this paper we describe our experience taken from developing of hardware and software tool kit suitable for education or entertainment event staging and management where real time user-assigned task control or task reassignment is required. Hardware part includes embedded device that performs SRD interface control and configured information output. Development of this part was done with energy economy in mind to ensure the utmost possible autonomous operation of device. Software part is lightweight web based application that can be accessed by event organizers and participants using HTML-enabled Internet browser from PC or smartphone. Mobile phone's built-in camera and matrix bar code interface can be used as an option for access to the system or execution of specific tasks. Over the course of last 5 years tool kit has been progressively implemented in hardware and software prototypes that found multiple applications in various “Autoliste” and “CDT” organized events.", "num_citations": "2\n", "authors": ["1951"]}