{"title": "An overview of the software engineering process and tools in the Mozilla project\n", "abstract": " The Mozilla Project is an Open Source Software project which is dedicated to development of the Mozilla Web browser and application framework. Possessing one of the largest and most complex communities of developers among Open Source projects, it presents interesting requirements for a software process and the tools to support it. Over the past four years, process and tools have been refined to a point where they are both stable and effective in serving the project's needs.This paper describes the software engineering aspect of a large Open Source project. It also covers the software engineering tools used in the Mozilla Project, since the Mozilla process and tools are intimately related. These tools include Bugzilla, a Web application designed for bug tracking, bug triage, code review and correction; Tinderbox, an automated build and regression testing system; Bonsai, a tool which performs queries to the …", "num_citations": "165\n", "authors": ["585"]}
{"title": "Towards brazilian portuguese automatic text simplification systems\n", "abstract": " In this paper we investigate the main linguistic phenomena that can make texts complex and how they could be simplified. We focus on a corpus analysis of simple account texts available on the web for Brazilian Portuguese and propose simplification strategies for this language. This study illustrates the need for text simplification to facilitate accessibility to information by poor literacy readers and potentially by people with other cognitive disabilities. It also highlights characteristics of simplification for Portuguese, which may differ from other languages. Such study consists of the first step towards building Brazilian Portuguese text simplification systems. One of the scenarios in which these systems could be used is that of reading electronic texts produced, eg, by the Brazilian government or by relevant news agencies.", "num_citations": "146\n", "authors": ["585"]}
{"title": "Facilita: reading assistance for low-literacy readers\n", "abstract": " Texts are the media content primarily available on Web sites and applications. However, this heavy use of texts creates an accessibility barrier to those who cannot read fluently in their mother tongue due to both text length and linguistic complexity. To offer an accessible alternative to these readers, shorter and simplified versions of text content should be provided. Taking that into consideration, this paper introduces Facilita, an assistive technology to help lower-literacy users to understand the text content of Web applications. Facilita generates an accessible content from Web pages automatically, using summarization and simplification techniques. It is also important to consider interface design requirements, since Facilita's target audience (the functionally illiterate) is often classified as computer illiterate as well. Thus, interaction and user interface design were developed considering the limitations and skills of the …", "num_citations": "108\n", "authors": ["585"]}
{"title": "A survey on the accessibility awareness of people involved in web development projects in Brazil\n", "abstract": " Accessibility has become a very important issue to promote inclusion in the Information Society, and people involved in Web development projects have a very important role to contribute with the development of a more inclusive Web. In this paper, we propose an investigation on the accessibility awareness of people involved in Web development in Brazil. We have conducted the research by means of an exploratory survey with a Web based questionnaire and a sample with subjects from academy, industry and government. The study had 613 valid answers and involved representatives from all of the 27 states of Brazil. The results show that accessibility is still far from being actually considered in Web development projects in Brazil, as only 19.9% of the participants have stated that accessibility is considered in their projects. The lack of education on accessibility, as well as the poor spread of the Brazilian …", "num_citations": "96\n", "authors": ["585"]}
{"title": "An evaluation of web accessibility metrics based on their attributes\n", "abstract": " Accessibility is a concept related to providing access to Web content to people with different abilities and people using different devices. A number of metrics have been proposed in the last years to help to obtain quantitative Web accessibility levels. Each Web development project has different aspects, and the choice of a given Web accessibility metric should be carefully considered according to the needs of the project. In this paper, we present a review on the main existing Web accessibility metrics, emphasizing the main features and comparing their correlations from experimental data obtained from large scale evaluations. Project managers and evaluators should consider specific features for each given project to effectively choose a proper metric. Needs to adjust customized coefficients or to adhere to automatic evaluation tools are important issues to be observed.", "num_citations": "77\n", "authors": ["585"]}
{"title": "Techniques for developing more accessible web applications: a survey towards a process classification\n", "abstract": " The Web has become one of the most important communication media, since it is spread all over the world. In order to enable everyone to access this medium, Web accessibility has become an emerging topic, and many techniques have been evolved to support the development of accessible Web content. This paper presents a survey on techniques for Web accessibility and proposes a classification into the processes of ISO/IEC 12207 standard. The survey was carried out applying systematic review principles during the literature review. The results include analysis obtained from the synthesis of 53 studies, selected from an initial set of 844. Although the survey results indicate a growth in research on techniques for design and evaluation of Web applications, they also indicate that several development activities have been poorly addressed by scientific research efforts.", "num_citations": "76\n", "authors": ["585"]}
{"title": "Caracterizaç ao de um Processo de Software para Projetos de Software Livre\n", "abstract": " Software Livre é software fornecido com código fonte, e que pode ser livremente usado, modificado e redistribuıdo. Projetos de Software Livre sao organizaçoes virtuais formadas por indivıduos que trabalham juntos no desenvolvimento de um software livre especıfico. Estes indivıduos trabalham geograficamente dispersos, utilizando ferramentas simples para coordenar e comunicar seu trabalho através da Internet.Este trabalho analisa esses projetos do ponto de vista de seu processo de software; em outras palavras, analisa as atividades que realizam para produzir, gerenciar e garantir a qualidade do seu software. Na parte inicial do trabalho é feita uma extensa revisao bibliográfica, comentando os principais trabalhos na área, esao detalhadas as caracterısticas principais dos projetos de software livre. O conteúdo principal deste trabalho resulta de dois anos de participaç ao ativa na comunidade, e de um levantamento realizado através de questionário, detalhando mais de quinhentos projetos diferentes. Sao apresentadas treze hipóteses experimentais, e os resultados do questionário sao discutidos no contexto destas hipóteses.", "num_citations": "70\n", "authors": ["585"]}
{"title": "Revealing the whiteboard to blind students: An inclusive approach to provide mediation in synchronous e-learning activities\n", "abstract": " Promoting the inclusion of students with disabilities in e-learning systems has brought many challenges for researchers and educators. The use of synchronous communication tools such as interactive whiteboards has been regarded as an obstacle for inclusive education. In this paper, we present the proposal of an inclusive approach to provide blind students with the possibility to participate in live learning sessions with whiteboard software. The approach is based on the provision of accessible textual descriptions by a live mediator. With the accessible descriptions, students are able to navigate through the elements and explore the content of the class using screen readers. The method used for this study consisted of the implementation of a software prototype within a virtual learning environment and a case study with the participation of a blind student in a live distance class. The results from the case study have …", "num_citations": "67\n", "authors": ["585"]}
{"title": "The perception of accessibility in web development by academy, industry and government: a survey of the brazilian scenario\n", "abstract": " Accessibility has become a serious issue to be considered by various sectors of the society. However, what are the differences between the perception of accessibility by academy, government and industry? In this paper, we present an analysis of this issue based on a large survey carried out with 613 participants involved with Web development, from all of the 27 Brazilian states. The paper presents results from the data analysis for each sector, along with statistical tests regarding the main different issues related to each of the sectors, such as: government and law, industry and techniques, academy and education. The concern about accessibility law is poor even amongst people from government sector. The analyses have also pointed out that the academy has not been addressing accessibility training accordingly. The knowledge about proper techniques to produce accessible contents is better than other sectors …", "num_citations": "54\n", "authors": ["585"]}
{"title": "Using screen readers to reinforce web accessibility education\n", "abstract": " This paper discusses an approach for Web accessibility education tacking advantage of short introductory courses. In this approach, screen readers were used toallimmerse students in the problems experienced by blind users while using the Web. Experimental results from an evaluation exercise carried out by students showedallthat the use ofallscreen readers was helpful to better understand and to reinforce the concepts of Web accessibility.", "num_citations": "50\n", "authors": ["585"]}
{"title": "A corpus analysis of simple account texts and the proposal of simplification strategies: first steps towards text simplification systems\n", "abstract": " In this paper we investigate the main linguistic phenomena that can make texts complex and how they could be simplified. We focus on a corpus analysis of simple account texts available on the web for Brazilian Portuguese (BP). This study illustrates the need for text simplification to facilitate accessibility to information by poor readers and by people with cognitive disabilities. It also highlights features of simplification for BP, which may differ from other languages. Moreover, we propose simplification strategies and a Simplification Annotation Editor. This study consists of the first step towards building BP text simplification systems. One of the scenarios in which these systems could be used is that of reading electronic texts produced, eg, by the Brazilian government or by news agencies.", "num_citations": "42\n", "authors": ["585"]}
{"title": "An approach based on metrics for monitoring web accessibility in Brazilian municipalities web sites\n", "abstract": " Monitoring and measuring the accessibility of government Web sites is an important challenge for regulators and policy makers. Moreover, over the next few years, e-government (e-gov) services are expected to expand and it is necessary to ensure access for everyone. In this paper, we present a metric based approach for evaluating municipalities Web pages using automatic accessibility evaluation tools. The sampling of the pages was done by the tool E-GOVMeter, and the accessibility evaluation and generation of the metrics was done by means of an adaptation of the tool Hera. The results show that much work should be done to improve the accessibility of Brazilian municipalities Web sites. Although it has limitations, the use of automatically generated accessibility metrics is a powerful tool for helping measuring and monitoring the accessibility of e-gov Web sites.", "num_citations": "41\n", "authors": ["585"]}
{"title": "Improving WCAG for elderly web accessibility\n", "abstract": " The increase of aging people and the possibilities that are extended to the Internet users have led studies into improvement of web accessibility solutions for older people [30]. Most older adults present some decline in their cognitive, visual, hearing and motor skills [13]. Nowadays, however, the Web faces new technological challenges that extend the initial idea of cross-platform and inter-operational nature of the HTML and HTTP. The challenges are posed as accessibility barriers and consider the skills, capabilities, culture, languages, disabilities, among other characteristics related to the user as a human being, in contrast to the hardware and software requirements previously addressed. The human characteristics of the challenge can be seeing as the ultimate barrier of the initial Web requirements of cross-platform and inter-operational environment, and goes towards social inclusion of people whatever …", "num_citations": "39\n", "authors": ["585"]}
{"title": "Acessibilidade dos sítios web dos governos estaduais brasileiros: uma análise quantitativa entre 1996 e 2007\n", "abstract": " A utilização da web para a disponibilização de informações e serviços de órgãos governamentais para os cidadãos tem se tornado cada vez mais expressiva. Assim, a garantia de que esses conteúdos e serviços possam ser acessíveis a qualquer cidadão é imprescindível, independentemente de necessidades especiais ou de quaisquer outras barreiras. No Brasil, o Decreto-Lei nº5.296/2004 determinou que todos os órgãos governamentais deveriam adaptar seus sítios na web de acordo com critérios de acessibilidade até dezembro de 2005. Com o objetivo de verificar a evolução da acessibilidade ao longo dos anos e como foi o impacto dessa legislação, este artigo analisa a acessibilidade dos sítios dos governos estaduais brasileiros por meio de amostras coletadas entre 1996 e 2007. Foram efetuadas análises por meio de métricas, obtidas por avaliações com ferramentas automáticas. Os resultados indicam que a legislação teve pouco impacto para a melhoria real da acessibilidade dos sítios no período indicado, com uma melhora somente em 2007. Verifica-se que se faz necessário adotar políticas públicas mais efetivas para que as pessoas com necessidades especiais tenham os seus direitos para acesso a informações e aos serviços públicos na web assegurados mais amplamente.", "num_citations": "34\n", "authors": ["585"]}
{"title": "Adapting web content for low-literacy readers by using lexical elaboration and named entities labeling\n", "abstract": " This paper presents an approach for assisting low-literacy readers in accessing Web online information. The “Educational FACILITA” tool is a Web content adaptation tool that provides innovative features and follows more intuitive interaction models regarding accessibility concerns. Especially, we propose an interaction model and a Web application that explore the natural language processing tasks of lexical elaboration and named entity labeling for improving Web accessibility. We report on the results obtained from a pilot study on usability analysis carried out with low-literacy users. The preliminary results show that “Educational FACILITA” improves the comprehension of text elements, although the assistance mechanisms might also confuse users when word sense ambiguity is introduced, by gathering, for a complex word, a list of synonyms with multiple meanings. This fact evokes a future solution in which the …", "num_citations": "33\n", "authors": ["585"]}
{"title": "A study on the acceptance of website interaction aids by older adults\n", "abstract": " The goal of the present work is to investigate the potential acceptance of a set of web interaction aids by older adults, in order to help them overcome difficulties associated with ageing and help them continue using the web as a source of information, communication and services.  This paper presents a survey with older adults concerning their perceptions about a set of web interaction aids defined after a field observation study, a study with questionnaires and user tests of web applications.  The survey involved 313 participants, of which about 44 % were older adults and elderly users. The results showed that the use of aids to support the interaction of older adults with the web promotes improvements in the interaction of older adults and younger users alike, which supports the argument for enhanced universal usability. Finally, it was possible to diagnose barriers that still remain and which aids had best …", "num_citations": "32\n", "authors": ["585"]}
{"title": "Strategies for automatic LOM metadata generating in a web-based CSCL tool\n", "abstract": " In this paper, we describe our experience of implementing an application profile based on Learning Object Metadata (LOM) and increased with elements to adjust it to our application domain. The educational resources considered here are collaborative Web pages based on Wiki. We discuss strategies for automatic and semi-automatic generation of metadata. Furthermore, we also report the implementation and evaluation of an interface to support the application profile and these strategies.", "num_citations": "31\n", "authors": ["585"]}
{"title": "Using acceptance tests to validate accessibility requirements in RIA\n", "abstract": " Accessibility stands as a quality requirement for Web applications. However, current accessibility automatic evaluation tools are not capable of evaluating DOM dynamic generated content that characterizes Ajax applications and RIAs-Rich Internet Applications. In this context, this paper describes an approach for testing accessibility requirements in RIA, by using acceptance tests. The authors had implemented a set of assistive technology user scenarios in the acceptance tests, in order to guarantee keyboard accessibility in web applications. As the scenarios were implemented as acceptance tests scenarios, they provide accessibility analysis over all layers of the software, from server-side to client-side implementations (JavaScript and dynamically generated DOM elements) in RIA. The test scenarios are automatically executed, and by doing so, fit the Continuous Integration process of constant delivery of new …", "num_citations": "30\n", "authors": ["585"]}
{"title": "Automatic summarization for text simplification: Evaluating text understanding by poor readers\n", "abstract": " In this paper we present experiments on summarization and text simplification for poor readers, more specifically, functional illiteracy readers. We test several summarizers and use summaries as the basis of simplification strategies. We show that each simplification approach has different effects on readers of varied levels of literacy, but that all of them do improve text understanding at some level.", "num_citations": "29\n", "authors": ["585"]}
{"title": "Web communication and interaction modeling using model-driven development\n", "abstract": " During the development of web-based applications, communication and interaction issues have become even more important, due to the variety of user types that can work together. In this paper we describe the adoption of Model-Driven Development (MDD) approach to support a feasible way to help developers to take into account the issues, regarding to the Web users variety. In general, a good design of the interactions and communication issues implies in high cost and time consuming tasks, and requires that developers be flexible and rapidly change the conception of the interfaces. The meta-models approach presented in this paper aims to map interaction and communication requirements in a practical and useful way during the web application development.", "num_citations": "27\n", "authors": ["585"]}
{"title": "Usability and UX practices in small enterprises: lessons from a survey of the Brazilian context\n", "abstract": " The role of small and medium enterprises (SME), especially small businesses, has significantly increased in the developing of interactive applications. Given the relevance of these companies in the market, the adoption of usability and user experience (UX) practices in these organizations is fundamental for the improvement of interactive systems. This paper performed a survey with 26 Brazilian small businesses of software about their Usability and UX practices. The results showed that Usability Tests and Heuristic Evaluation were the evaluation methods most frequently reported to be used by the surveyed companies. Although the results suggest an improvement in the adoption of usability and UX practices, they also show the need for significant improvement in training and awareness of the importance of usability and UX and appropriating techniques and practices in the context of small businesses. Our results …", "num_citations": "26\n", "authors": ["585"]}
{"title": "Versionweb: a tool for helping web pages version control\n", "abstract": " In the continually changing world of computing, the Web is an example of an environment where information evolves very rapidly. In addition to Web information that changes very much and very frequently, Webmasters are faced with hard work when many people are involved in the parallel development of a set of related Web pages. In the face of such problems, a software tool, VersionWeb, was developed. The idea behind this tool is to make Web page version control available during browsing to users. The main goal of VersionWeb is to provide the Webmasters with an easy way of controlling Web page versions, through the Web itself.", "num_citations": "22\n", "authors": ["585"]}
{"title": "A survey on accessibility awareness of Brazilian web developers\n", "abstract": " A huge amount of content has been made available on the Web. Although there are several initiatives to guide an accessible web development, researchers have showed that web developers are rarely aware of accessibility issues in their web projects. In this paper, we conducted a survey to verify the evolution of web accessibility awareness in Brazil. We have conducted an exploratory study based on web questionnaire, using a self-selected and non-probabilistic sampling method. The study had 404 valid answers, covering all regions of Brazil. The results show that most of participants has never developed an accessible website and 33.2% of them are not worried about considering accessibility in their future projects. Therefore, it is important to create public policies that improve the current web accessibility scenario, raising the awareness of the people involved in web development, as well as obligating …", "num_citations": "21\n", "authors": ["585"]}
{"title": "Automatic accessibility evaluation of dynamic web pages generated through XSLT\n", "abstract": " Much effort has been dedicated to develop software aids for authoring and evaluating Web pages using accessibility guidelines and standards. The evaluation of dynamic Web pages is a problem still unsolved in the field of automatic evaluation tools, since the current evaluators are only able to evaluate static Web pages. Stone and Dhiensa have addressed this problem, and proposed a method for evaluating the accessibility of dynamic Web pages using a generalized page which contains all possible outputs that can be generated by a script. In this paper, we present another approach for evaluating the accessibility of dynamic Web pages generated using XML and XSLT. The approach consists of analysing an XSLT using a structure descriptor such as DTD or XSD to determine the different types of XML documents that can be generated. The strength of the presented approach is given by the fact that the use of …", "num_citations": "21\n", "authors": ["585"]}
{"title": "Uma visão da participação feminina nos cursos de ciência da computação no Brasil\n", "abstract": " Observa-se um número relativamente pequeno de mulheres envolvidas em Ciência da Computação, embora seja um dos temas mais modernos das áreas de Ciências e Engenharias, bem como seja essencial, para a sociedade atual que depende de infraestrutura digital. No início, mais mulheres em universidades foram atraídas para a Ciência da Computação, mas diferentes tendências culturais que fizeram com que as mulheres desencorajassem a prosseguir nessa carreira têm sido discutidas desde os primeiros tempos. Embora a Ciência da Computação continue mudando consideravelmente, um número menor de mulheres tem ingressado na área. Este trabalho discute a presença das mulheres em Ciência da Computação nas instituições brasileiras. Nesse contexto, os dados coletados nessas instituições foram analisados. Foi constatado que, como na maioria dos países, a proporção de mulheres …", "num_citations": "20\n", "authors": ["585"]}
{"title": "Evolving Heuristic Evaluation for multiple contexts and audiences: Perspectives from a mapping study\n", "abstract": " This paper presents the results concerning an update of a previous mapping study about usability heuristics applied in Heuristic Evaluation of mobile usability. Heuristic Evaluation is a popular method of usability evaluation, and its applicability to inspect the mobile usability may be improved by the development of context and audience specific heuristics. Additionally to a previous mapping, we present analysis of the recent usage of context and audience specific heuristics, and the application of Heuristic Evaluation to evaluate multiple contexts and audiences. The results showed the use of specific heuristics for the Healthy context and Malaysian audience. In addition, the results turned out the evolving of Heuristic Evaluation for multiple contexts and audiences, such as: Health Sector, Games, Learning, Elderly and Accessibility.", "num_citations": "19\n", "authors": ["585"]}
{"title": "Usability evaluation of horizontal navigation bar with drop-down menus by middle aged adults\n", "abstract": " The Web has become an extremely important source of information and services that have been made widely available. Navigation is an important aspect in designing a Web site in order to make the information easy to find, however the task of organizing and structuring information from a website can become complex as the set of information and services provided increases. The aim of this study is to investigate the effect of eight different types of menus while performing two tasks for each menu. The target for the experiment was of people aged over 40 and some experience in using the Internet. The experiment revealed that menus which presented properties more commonly found in web applications, the task completion time and number of errors was lower, during the sessions.", "num_citations": "19\n", "authors": ["585"]}
{"title": "An open linking service supporting the authoring of web documents\n", "abstract": " Both content driven web authors and application designers may have their attention deviated from their main task when they have to be concerned with the generation of elaborated linking structures. This work aims to demonstrate how a metadata-enhanced web-based open linking service can be exploited towards supporting content driven authors in their tasks. The following results are presented in this paper:(a) the Web Linking Service (WLS), a novel open hypermedia system that stores and exchanges metadata in RDF standard syntax for hypertext structures across the wire and (b) two case studies in which applications offer to their users the ability to create linking structures upon existing contents by making use the WLS service.", "num_citations": "19\n", "authors": ["585"]}
{"title": "Caracterização de um modelo de processo para projetos de software livre\n", "abstract": " Software Livre, que neste texto abrange software também conhecido como Open Source, é software que é fornecido acompanhado de código fonte e que pode ser livremente modificado e redistribuıdo. Uma conseqüência indireta desta liberdade é o aparecimento de comunidades de desenvolvimento de software que trabalham de forma descentralizada por meio da Internet, desenvolvendo e mantendo os diferentes projetos de software livre. Estas comunidades,a primeira vista, parecem estar caoticamente organizadas do ponto de vista de um processo de engenharia de software; no entanto, grande parte do software produzido é de alta qualidade, assim como é alta a produtividade e satisfaç ao dos desenvolvedores. O objetivo deste trabalho é verificar esta aparente inconsistência, e desenvolver um modelo de processo para este tipo de software.", "num_citations": "19\n", "authors": ["585"]}
{"title": "A review of senescent's motivation in the use of tactile devices\n", "abstract": " Researchers report that people older than 60 years old could benefit from easier access to information by using technologies. However, they have been marginalized from the digital inclusion process. The main reason is that the development of devices and interfaces does not consider particularities that allow its use by this range of senior users. Mobile devices with touch screens have the potential to solve these problems. It is because interactions based on touch are more intuitive, regardless of age. However, the use rate of tactile devices for the elderly is considered low compared to other age groups, because they tend to use their mobile phones for relatively limited purposes. The aim of this study is, through interviews and specific tasks encourage the use of technology by those who have not demonstrated the receptive to the devices, and verify the existence of motivations to use a schedule on a tactile device …", "num_citations": "18\n", "authors": ["585"]}
{"title": "An approach to improve the accessibility and usability of existing web system\n", "abstract": " The Web is currently the main way of providing computing services, reaching a larger number of users with different characteristics. As the complexity and interactivity of systems is increased, users become more demanding towards all the requirements associated to their distinct needs. Implementing the interaction requirements in the Web has become the main focus of accessibility and usability studies, describing essential design features which provide users with quality, assured systems. The focus on the users reinforced that as the number of users grows and the system became available to a wide variety of users, accessibility and usability features become even more critical to a Web application's success. In this paper, we present ACCESSA, a practical approach to rapidly improve the accessibility of existing Web systems, acting mainly in the interface design with no changes to the functional requirements of …", "num_citations": "18\n", "authors": ["585"]}
{"title": "Developing and evaluating web multimodal interfaces-a case study with usability principles\n", "abstract": " In this paper we describe an approach to facilitate the design of Web multimodal interfaces aiming at improving the user experience and the user interface usability using speech recognition together with the usual graphical user interfaces. We present a proposal for usability evaluation based on the heuristic evaluation, which considers the multimodal principles identified during a case study. As a result of using the proposed approach in the case study and from literature review, we report our considerations for the design, development and improvement of the Web multimodal interfaces.", "num_citations": "18\n", "authors": ["585"]}
{"title": "Comparative evaluation of the maintainability of RESTful and SOAP-WSDL web services\n", "abstract": " Web services not only are one of the most promising technologies in terms of the availability of network services but also solve the problem of integrating heterogeneous applications on the web. Because of their increasing popularity, maintainability has become an important issue as it helps to reduce maintenance costs and improve software quality. However, from the perspective of evolution and maintenance, there are many issues to be examined. This paper describes a controlled experiment to compare RESTful and SOAP-WSDL web services in terms of specific modifiability sub-characteristics and time spent on web services maintenance. The findings indicate that RESTful web services are more maintainable on the server-side, while SOAP-WSDL web services are more maintainable on the client-side. Studies based on controlled experiments are promising and may help reduce the maintenance costs of web …", "num_citations": "17\n", "authors": ["585"]}
{"title": "An approach based on multiple text input modes for interactive digital TV applications\n", "abstract": " The development of interactive digital TV applications is hindered by the user-interaction options allowed when traditional remote controls are used. In this work, we describe the model of a software component that allows text entry in interactive TV applications based on an interface with multiple input modes---the component offers a virtual keyboard mode, a cell keypad mode, and a speech mode. We discuss our considerations with respect to the design, development and evaluation of a prototype corresponding to our model, built according to the user-centered design methodology. After conducting a research on existing text input methods in television systems, we interviewed four experts in the interactive TV domain. We also applied 153 questionnaires to TV users, with the aim of gathering a user profile of users who make use of text entry mechanisms. During the development of the prototype, we conducted …", "num_citations": "17\n", "authors": ["585"]}
{"title": "Increasing the quality of web systems: By inserting requirements of accessibility and usability\n", "abstract": " The traditional software development is not entirely suitable for development of Web systems. These systems must be developed supported by a fast life cycle, considering usersÂ' characteristics. In this context, this paper describes how to improve the quality of Web systems including accessibility and usability non-functional requirements during development. For this propose, this paper explains how to extends the requirements engineering phase of a process of Web development with activities related to usersÂ' profile and needs.", "num_citations": "16\n", "authors": ["585"]}
{"title": "Acceptance tests for validating ARIA requirements in widgets\n", "abstract": " Accessibility refers to a quality requirement for web applications. However, current accessibility automatic evaluation tools cannot evaluate dynamic generated content that characterizes Ajax applications and RIAs. In this context, this paper describes an approach for evaluating Accessible Rich Internet Applications (ARIA) requirements, by using acceptance tests. The authors implemented a set of disabled user interaction scenarios as acceptance tests in order to verify keyboard accessibility in RIA and automatically evaluate ARIA conformance in widgets. The inclusion of disabled user interaction scenarios in the evaluation process is necessary to analyse ARIA requirements since dynamic changes are accommodated in the DOM structure. Two evaluation tool prototypes were developed and validated in separate case studies. The results show evidence that the proposed evaluation approach is capable of …", "num_citations": "15\n", "authors": ["585"]}
{"title": "StudyConf: Infra-estrutura de suporte ao aprendizado cooperativo na WWW\n", "abstract": " Muitos dos sistemas computacionais atuais de apoio ao ensino podem ser considerados parte de uma evolução que tem enfatizado a exploração de sistemas hipermídia em geral, e da Web em particular. A pesquisa associada ao trabalho aqui reportado tem como objetivo explorar as tecnologias de Hipermídia e Computer Supported Cooperative Work (CSCW) para viabilizá-las em um ambiente que suporta o acesso de alunos a hiperdocumentos de conteúdo didático de forma cooperativa ¾ o ambiente StudyConf. Para promover a interação entre alunos que navegam pelos hiperdocumentos, o StudyConf controla a navegação e gera, dinamicamente, sessões de discussão com os alunos que visitam o mesmo material. O StudConf mantém o registro das discussões realizadas na forma de hiperdocumentos estruturados, viabilizando a exploração de propostas para a geração cooperativa de documentos presentes em várias ferramentas Computer Supported Cooperative Learning (CSCL).", "num_citations": "15\n", "authors": ["585"]}
{"title": "Tools for Authoring and Presenting Structured Teaching Material in the WWW.\n", "abstract": " This paper presents aspects of modeling, authoring and presenting structured documents corresponding to teaching material presented in the World Wide Web. In this context, it is discussed the importance of providing the formalization of the structure of the documents using SGML. Next, specifications for structured documents corresponding to didactic texts and questionnaires are presented. Software tools to the authoring and presentation of those documents are then discussed. The paper concludes with a discussion on related work and next steps of this research.", "num_citations": "15\n", "authors": ["585"]}
{"title": "A support for developers implement the accessibility guidelines regarding to web menus\n", "abstract": " Web pages are composed of elements, such as menus that are responsible for assisting navigation on the website. However, many of the menus are not developed properly, which creates accessibility barriers and hinders access to the contents. This paper aims to present a method for creating accessible menus. Initially, we studied the different types of menus and the accessibility guidelines involving the creation of accessible menus. From the studies, we developed a meta-model that gave rise to AMenu language, where we included all the technical details regarding to accessibility. Then, we developed the AMeG tool to facilitate the use of language. Finally, we conducted a case study with developers, in order to verify the feasibility of the approach, arguing its efficiency and limitations. The results indicate a reduction in efforts to develop accessible web menus, since developers do not have to deal with technical …", "num_citations": "14\n", "authors": ["585"]}
{"title": "Web videos–concerns about accessibility based on user centered design\n", "abstract": " Recently, the production and availability of multimedia Web content, as videos, have increased. In this scenario it is important to consider accessibility requirements so that any user can whelm the barriers to access content regardless of the limitations imposed by either deficiency or some temporary restriction. One of the main barriers found in the current players is the restriction to make videos accessible on the Web and little research on how to overcome those limitations has been conducted. This paper describes the three phases of User Centered Design, in which an evaluation with real users of an accessible video player is conducted. A video player, called Facilitas, is proposed in order to provide the rationale of how some of those barriers or limitations could be overcome. Its controls are new and different from the ones in other players. We have observed that by reducing accessibility barriers, the design …", "num_citations": "14\n", "authors": ["585"]}
{"title": "WCAG conformance approach based on model-driven development and WebML\n", "abstract": " Accessibility is an important quality attribute for Web applications. The W3C has defined a set of guidelines that must be followed to deploy accessible web applications, however there is no process that support WCAG requirements during the software development lifecycle. This work proposes the inclusion of the WCAG 2.0 accessibility concerns in a Model-Driven Development, more specifically in the WebML process.", "num_citations": "14\n", "authors": ["585"]}
{"title": "Accessibility and software engineering processes: A systematic literature review\n", "abstract": " Guidelines, techniques, and methods have been presented in the literature in recent years to contribute to the development of accessible software and to promote digital inclusion. Considering that software product quality depends on the quality of the development process, researchers have investigated how to include accessibility during the software development process in order to obtain accessible software. Two Systematic Literature Reviews (SLR) have been conducted in the past to identify such research initiatives. This paper presents a new SLR, considering the period from 2011 to 2019. The review of 94 primary studies showed the distribution of publications on different phases of the software life cycle, mainly the design and testing phases. The study also identified, for the first time, papers about accessibility and software process establishment. This result reinforces that, in fact, accessibility is not …", "num_citations": "13\n", "authors": ["585"]}
{"title": "Accessible modeling on the web: a case study\n", "abstract": " With the growth of software engineering disciplines and visual languages like the UML (Unified Modeling Language) and consequently increase of modeling activities that use this visual languages, the access of the visually impaired is harmed and they need the assistance of other people both for reading and editing this models. In this paper we present a case study conducted to evaluate the effectiveness of a prototype tool developed by the authors and was designed to allow users to model using UML class diagrams using two distinct views: a traditional graphical view that sighted users are used to work with and an equivalent textual view where blind or visually impaired users can read, create models and also collaborate on models created by the graphical view. The study was conducted with one totally blind subject and counted with a previous pilot with a visually impaired subject to validate the study design …", "num_citations": "13\n", "authors": ["585"]}
{"title": "Uma Revisão Sistemática sobre a inserção de Acessibilidade nas fases de desenvolvimento da Engenharia de Software em sistemas Web\n", "abstract": " A acessibilidade consiste na possibilidade de acesso e de uso de ambientes, produtos e serviços por qualquer pessoa e em diferentes contextos. Para diminuir as dificuldades apresentadas pelos usuários durante a interação com sistemas Web, estudos têm sido realizados visando a minimizá-las, de maneira geral. Seus resultados se encontram sintetizados em normas/orientações a serem seguidas visando proporcionar melhor usabilidade e acessibilidade para toda diversidade de usuários. Nesse contexto, a presente pesquisa pretende investigar um suporte ao desenvolvedor de sistemas que se preocupa em disponibilizar seu conteúdo de forma acessível a todos. Neste artigo, é reportado um estudo referente ao estado da arte de técnicas da Engenharia Web (EW) para acessibilidade a partir de uma Metodologia de desenvolvimento de software formalizada. A seleção e análise dos estudos foram efetuadas por meio de atividades selecionadas do método de Revisão Sistemática. Os resultados incluem a análise obtida por meio da síntese de 65 estudos, selecionados de um conjunto inicial de 301. A partir dos dados analisados nesta pesquisa, pôde-se concluir que as pesquisas em Acessibilidade na Web têm crescido muito desde 2007. Apesar de haver muitas técnicas de acessibilidade no desenvolvimento de software, o estudo também indica algumas atividades relacionadas à EW que ainda estão escassas de técnicas para obter aplicações acessíveis.", "num_citations": "13\n", "authors": ["585"]}
{"title": "Addressing mobile usability and elderly users: Validating contextualized heuristics\n", "abstract": " Diverse heuristic sets were proposed in order to evolve Heuristic Evaluation for new contexts, as contexts related to the elderly and mobile devices. However, heuristics for evaluation of mobile usability regarding elderly users still need aditional validations. For this reason, our study aimed to enhance the validation of a heuristic set proposed by Al-Razgan et al. for evaluation of mobile usability regarding elderly users. Results showed that the major part of heuristics proposed by Al-Razgan et al. matches with traditional heuristics of Nielsen, while a few remain valuable for evaluations in this context. Also, after validations, we found evidences that the heuristics of Al-Razgan et al. have a great coverage of usability problems of mobile applications used by the elderly, as detected from test with users.", "num_citations": "11\n", "authors": ["585"]}
{"title": "Game accessibility evaluation methods: A literature survey\n", "abstract": " Identifying a set of methods to be applied specifically for game accessibility evaluation is a relevant issue to boost and enable further research in the field. To fulfill this objective, we defined five research questions and conducted a literature survey based on snowballing technique. To gather the studies in our survey, we defined a start set of works to serve as ground for the review and performed searches using references and citations of these studies. We found a set of accessibility evaluation methods focused on game accessibility and how they can be classified according to ISO standards. We also found that methods focused on mobile game context still need to be better explored because only a few evidences were retrieved regarding such a domain. Besides traditional accessibility aspects as barriers and users’ satisfaction, results show that distinct game aspects are considered during game …", "num_citations": "11\n", "authors": ["585"]}
{"title": "A fine-grained and flexible version control for software artifacts\n", "abstract": " Version control is an activity very important for high-quality software production. The structure used by version control systems is the same used by file systems, but in general the abstraction level made by software developers considers the file contents and its internal structure, including details as classes, methods, control blocks and others. Fine-grained version control tools can provide a more detailed version control. However traditional tools and models provide very low flexibility and present high cost and impact of deployment in software development environments. In this paper, there are presented a model and a tool which aim at providing support to fine-grained version control activities.", "num_citations": "11\n", "authors": ["585"]}
{"title": "Drop-down menu widget identification using HTML structure changes classification\n", "abstract": " Widgets have been deployed in rich internet applications for more than 10 years. However, many of the widgets currently available on the web do not implement current accessibility design solutions standardized in ARIA (Accessible Rich Internet Applications) specification, hence are not accessible to disabled users. This article sets out an approach for automatically identifying widgets on the basis of machine-learning algorithms and the classification of mutation records; it is an HTML5 technology that logs all changes that occur in the structure of a web application. Automatic widget identification is an essential component for the elaboration of automatic ARIA evaluation and adaptation strategies. Thus, the aim of this article is to take steps toward easing the software-engineering process of ARIA widgets. The proposed approach focuses on the identification of drop-down menu widgets. An experiment with real-world …", "num_citations": "10\n", "authors": ["585"]}
{"title": "A model-driven development for creating accessible web menus\n", "abstract": " Web pages are composed by several elements that allow users to interact with available content. Some of these elements, such as menus, are responsible for assisting the navigation in the website, helping in the localization and access of the information requested by the user. However, many of menus available in Internet are not developed in an accessible manner, which creates accessibility barriers for many users, especially users with disabilities. Non-accessible menus hinder users find the information that they are looking for and therefore they can give up accessing the web site. This paper aims at addressing the problem by helping developers to create accessible web menus based on model-driven approach. Adopting this approach can help developers build accessible menus without knowing the technical details about accessibility. In direction to this objective, we initially studied the different types of …", "num_citations": "10\n", "authors": ["585"]}
{"title": "Tests with blind programmers using awmo: An accessible web modeling tool\n", "abstract": " With the increase of public utility services being offered by many organizations, such as companies and government institutions, over the Internet and on other electronic medium, the concern related to the access blind and visually impaired citizens is raised. But still, some types of data remain intrinsically unaccessible such as software models, that are generally represented by visually rich diagrams which are inaccessible to screen readers. The goal of this paper is to categorize and evaluate the navigation strategies of blind users using a web application that allows access to UML class diagrams by using a specialized textual language. The investigation was done by analyzing videos with screen capture that were collected as part of a case study conducted with two blind programmers to evaluate the AWMo efficacy in enabling access to visual diagrams for blind and visually impaired software developers …", "num_citations": "10\n", "authors": ["585"]}
{"title": "HEUA: A Heuristic Evaluation with Usability and Accessibility requirements to assess Web systems\n", "abstract": " Nowadays, the Web represents the main way of providing computing services to a huge variety of users with different characteristics. Thus, accessibility and usability features become even more critical to a Web application's success. Researchers have been worried in providing mechanisms to serve as guidelines that Web systems should provide, in terms of usability and accessibility requirements. However, there not exists an instrument to provide a measure to help the specialists to verify how much these requirements are presented in a Web system. In this paper, we describe HEUA, a proposed questionnaire to assess the usability and accessibility of existing (or legacy) Web systems, to support measuring how much effort a Web system needs to be improved.", "num_citations": "10\n", "authors": ["585"]}
{"title": "An accessible video player for older people: Issues from a user test\n", "abstract": " There is a huge availability of videos that have been produced in a very fast and wide way, along with the popularity of Internet. This scenario should be carefully considered by the video authors since many users have different needs. It is important to keep in mind the accessibility requirements so that any user can overcome the barriers to access content regardless of their limitations imposed by either impairment or some temporary restriction. The current video players present barriers for many people, especially to the elderly, and one of the main barriers is the restriction to reproduce videos accessible on the Web. This paper describes a research, and the design and evaluation of an accessible video player (called Facilitas), in which a user test with older people is conducted. As a result, we discuss the issues reported by older people and the controls that were developed to assist them.", "num_citations": "10\n", "authors": ["585"]}
{"title": "An Assessment of accessibility in contact forms of Brazilian public universities\n", "abstract": " This paper presents an assessment of accessibility in contact forms of Brazilian public universities. Thus, we checked the websites of these institutions by assessing strengths and weaknesses of them according to several criteria based on W3C WCAG 2.0, in its initiative to accessibility, WAI.", "num_citations": "10\n", "authors": ["585"]}
{"title": "Facilita: auxílio à leitura de textos disponíveis na Web\n", "abstract": " Although there are recently multiple ways of delivering media on the web, most web contents are still mainly presented in the textual form. The heavy use of texts pose an accessibility barrier to those who do not read fluently because of both the length and linguistic complexity of the written texts. To deal with that barrier, this paper presents the Facilita, an assistive technology to help lower literacy users to comprehend web applications’ textual content. Facilita automatically generates accessible content from web pages, using syntactic simplification and summarization techniques. It is also described the use of technologies aiming at keeping users interactions simple, since lower literacy users, frequently, also show lower computer skills.", "num_citations": "10\n", "authors": ["585"]}
{"title": "Web accessibility metrics: Effects of different computational approaches\n", "abstract": " Assessing and monitoring the accessibility of web pages are important challenges for ensuring universal accessibility of the web. In this paper, we analyse the quantitative results of the evaluation of web pages using four different metrics with different approaches to the aggregation of results from accessibility audits. The web pages evaluated are from three different Virtual Learning Environments (VLEs). The impact of the different aggregation approaches on the ranges of the values of the resulting metrics and on the ranking of web pages are discussed. We observe that the different approaches may provide different outcomes for comparison purposes, and argue that further investigations on the use of user data to improve the measurement of accessibility should be conducted.", "num_citations": "10\n", "authors": ["585"]}
{"title": "System description: An orienteering strategy to browse semantically-enhanced educational wiki pages\n", "abstract": " Wikis have been adopted along the years, aiming to provide an easy and simple support to people keep the information systems on the Internet up-to-date, and making possible efficient collaborative authoring. As the number of pages and corresponding contents increases, wiki users face difficulties when browsing for wiki pages. This paper presents a system prototype based on orienteering to browse semantically-enhanced educational wiki pages. The results of a user-based evaluation of the system prototype are also presented.", "num_citations": "10\n", "authors": ["585"]}
{"title": "Strategies for filling out LOM metadata fields in a Web-based CSCL tool\n", "abstract": " In this paper, we describe our experience of implementing an application profile based on learning object metadata (LOM) and increased with elements to adjust it to our application domain. The educational resources considered are collaborative Web pages based on wiki. Furthermore, we discuss strategies for automatic and semi-automatic generation of metadata.", "num_citations": "10\n", "authors": ["585"]}
{"title": "Heuristic evaluation for novice evaluators\n", "abstract": " Adapting the method of Heuristic Evaluation for novice evaluators can capacitate organizations of low monetary power that, usually, do not have conditions to resort to experts. In one of the courses given by the authors, 12 in 15 novice evaluators (80 %) said they had difficulties to distinguish the difference among the traditional usability heuristics. The aim of this study was to explore this affirmation and develop possible adaptations in order to mitigate this problem. Surveys with 13 usability experts and 15 novice evaluators showed that the 3rd and the 7th heuristics, from the traditional set of Nielsen and Molich, are probably more difficult for novices to understand and distinguish between each other. In a third survey, with 7 usability experts, we discussed a new description for heuristics 3 and 7 in order to make them easier for novice evaluators to understand and distinguish. Future studies can validate of the …", "num_citations": "9\n", "authors": ["585"]}
{"title": "Fona: Quantitative metric to measure focus navigation on rich internet applications\n", "abstract": " The Web 2.0 brought new requirements to the architecture of web systems. Web applications’ interfaces are becoming more and more interactive. However, these changes are severely impacting how disabled users interact through assistive technologies with the web. In order to deploy an accessible web application, developers can use WAI-ARIA to design an accessible web application, which manually implements focus and keyboard navigation mechanisms. This article presents a quantitative metric, named Fona, which measures how the Focus Navigation WAI-ARIA requirement has been implemented on the web. Fona counts JavaScript mouse event listeners, HTML elements with role attributes, and TabIndex attributes in the DOM structure of webpages. Fona’s evaluation approach provides a narrow analysis of one single accessibility requirement. But it enables monitoring this accessibility requirement in a …", "num_citations": "9\n", "authors": ["585"]}
{"title": "Keyboard navigation mechanisms in tab widgets: an investigation on ARIA's conformance\n", "abstract": " This study presents an investigation on how keyboard accessibility has been delivered in RIA-Rich Internet Applications. We conducted an evaluation on 32 websites which contained Tab Widgets, from the 150 websites of Alexa's top most accessed websites list. The evaluation process consisted of checking if the Widgets implemented ARIA-Accessible Rich Internet Applications requirements, like the use of role/state semantic attributes and presentation of keyboard interaction strategies. The results showed that, even though the ARIA specification achieved the status of W3C Candidate Recommendation in 2011, few websites implemented Tab Widgets according to ARIA in the Web. The study also identified alternative keyboard navigation mechanisms that are accessible to Assistive Technologies users, despite the disadvantages they might represent.", "num_citations": "9\n", "authors": ["585"]}
{"title": "Dificuldades de usuários cegos na interação com a web: uma análise sobre as pesquisas\n", "abstract": " Acessibilidade na Web tem como objetivo possibilitar que qualquer pessoa possa entender e interagir com o conteúdo de uma página Web, independente de deficiências ou outros fatores que possam restringir o acesso. Estudos mostram que, apesar de uma grande quantidade de trabalhos realizados na área, as pessoas com deficiência visual total (cegos) ainda apresentam grande dificuldade para interagir com a Web. Diante desse contexto, torna-se necessário identificar os principais aspectos que influenciam na dificuldade dos usuários cegos durante a sua interação e compreensão dos serviços e informações disponibilizados nos aplicativos Web. A partir da identificação das reais dificuldades reportadas pelos cegos, é possível que sejam formuladas soluções e definidas medidas a serem tomadas para minimizar estas dificuldades. Este artigo apresenta uma visão geral dos trabalhos e pesquisas encontrados na literatura, que mencionam dificuldades dos cegos na interação com aplicativos Web. Para tanto, foi realizada uma revisão sistemática com este objetivo. Além disso, são analisados os trabalhos obtidos da literatura de maneira a oferecer um conjunto de classes das dificuldades identificadas. Os resultados da revisão mostram que diversos dos problemas enfrentados pelas pessoas cegas sequer são abordados pelas principais referências para que autores e desenvolvedores Web tornem suas aplicações Web acessíveis.", "num_citations": "9\n", "authors": ["585"]}
{"title": "Avaliação da acessibilidade de websites por usuários com deficiência\n", "abstract": " O desenvolvimento de Websites acessíveis é fundamental para que pessoas com deficiência possam ter acesso a conteúdo e a serviços essenciais do dia-a-dia. Apesar da utilização de guidelines auxiliar na identificação de alguns problemas de acessibilidade em Websites, a avaliação por usuários com deficiência é o método mais adequado para identificar os problemas reais enfrentados por usuários, problemas estes que muitas vezes não são completamente cobertos por guidelines técnicas. Este minicurso tem como objetivo apresentar os principais conceitos e técnicas para a realização de avaliações de acessibilidade de Websites por usuários com diferentes tipos de deficiência. O minicurso inclui conceitos fundamentais sobre acessibilidade Web, Tecnologia Assistiva, bem como aspectos práticos envolvidos no planejamento, condução e análise de resultados de avaliações de acessibilidade de …", "num_citations": "9\n", "authors": ["585"]}
{"title": "Where and with whom do you wanna meet? Session-based collaborative work\n", "abstract": " In this paper we revisit the concept of session applied to collaborative work and define a set of operators to manipulate session information related to workspaces and tools scheduling in collaborative environments. By means of a proof-of-concept implementation which uses web services and context-aware tools, we show an example of how session information provided by the operators can be used to leverage the ubiquitous capabilities of collaborative applications.", "num_citations": "9\n", "authors": ["585"]}
{"title": "Multimodal interfaces design issues: the fusion of well-designed voice and graphical user interfaces\n", "abstract": " This poster describes a novel approach that is intended to combine graphical user interfaces (GUI) and voice interaction in the Web throughout the design and the development of intuitive and user-friendly multimodal interfaces. We are considering the user interface design modeling aspects, principles and guidelines that are being used to design voice and GUI. Our goal is to get an organized process to the design of multimodal interfaces that will let the designers to evaluate the interfaces with real users, find out usability issues and report the rationale to correct those issues. Moreover it will capture and store the acquired knowledge gathered during the multimodal interfaces design by using the design rationale (DR) and design patterns techniques.", "num_citations": "9\n", "authors": ["585"]}
{"title": "A support to evaluate web accessibility and usability issues for older adults\n", "abstract": " The constant evolution of the Web has enabled that new online services in various segments be offered. Following this evolution, it is crucial that its content allows access to the different user's profiles. Older adults (age 60+) are users who typically have limited capacities due to ageing process and they have encountered difficulties in interacting with websites. Several accessibility and usability issues still have to be solved, despite the legislation and guidelines established for the development of accessible and usable web content. In particular, little attention has been devoted to the difficulties faced by older adults because most websites are not designed with these users in mind. This paper addresses the development of a checklist, a support to web accessibility and usability evaluations for the older adults profile and its validation. The checklist was elaborated from analysis of the state of the art, based on a …", "num_citations": "8\n", "authors": ["585"]}
{"title": "CanIHelp: a platform for inclusive collaboration\n", "abstract": " Technology plays a key role in daily life of people with special needs, being a mean of integration or even communication with society. By built up experience, we find that support tools play a crucial part in empowerment of persons with special needs and small advances may represent shifts and opportunities. The diversity of solutions and the need for dedicated hardware to each feature represents a barrier to its use, compromising the success of the solutions against, among others, problems of usability and scale. This paper aims to explore the concept of inclusive collaboration to enhance the mutual interaction and assistance. The proposed approach combines and generalizes the usage of human computation in a collaborative environment with assistive technologies creating redundancy and complementarity in the solutions provided, contributing to enhance the quality of life of people with special …", "num_citations": "8\n", "authors": ["585"]}
{"title": "Supporting the developer in an accessible edition of web communications: a study of five desktop tools\n", "abstract": " Existing guidelines on Web applications development with accessibility are currently not applied by many developers. In this study, the existence and operation of accessibility features in Web authoring tools were verified. In order to do this, five authoring tools were selected to perform an analysis by inspection for several accessibility features. In the same way, a set of criteria involving the search and testing of 14 features which support developers was defined. Inspected features are directly related to the W3C documents ATAG 1.0 and WCAG 2.0. As a result, important considerations about the inspection were made and it was determined that the tools already provide some support for accessibility although they are still far from ideal scenario.", "num_citations": "8\n", "authors": ["585"]}
{"title": "The link-offset-scale mechanism for improving the usability of touch screen displays on the web\n", "abstract": " Touch-screen interfaces have become a widespread-input-device tendency for computer systems. In this context, many studies investigate how to improve general usability for touch-screen devices. These studies consider different interaction design features that improve the usability for touch sensitive surfaces, considering the low accuracy it presents, given obstacles such as the “fat finger problem”, low-perception of pointing mechanisms, difficulties in the selection of small objects, among others. This work aims at presenting the link-offset-scale touch interaction mechanism for improving the usability for touch-screen devices. The link-offset-scale mechanism makes use of web-application-structure meta-data (identifying links) to provide feedback information about the selection of links in touch interfaces, while the surface is touched by the user. The link-offset-scale mechanism’s primary goal is to reduce …", "num_citations": "8\n", "authors": ["585"]}
{"title": "Accessibility and usability evaluation of rich internet applications\n", "abstract": " Popularity of Internet applications has reached significant scales. In consequence, a wide diversity of solutions has been created based on Web features. Rich Internet Application (RIA) is a relevant term adopted for technological advances in software developed for the Web, which refers to Web applications aimed to provide users with a desktop similar experience. RIAs usually have wider capabilities in comparison with traditional hypertext applications, specially regarding to the interactive elements of their interfaces. New possibilities that have emerged from RIA are essential to support relevant aspects of Web 2.0, such as participation and collaboration. As among other applications, developing accessible and usable RIAs is a valuable and fundamental aspect for development teams, since these new interaction features available on the Web are not always accessible for people with disabilities or reduced mobility …", "num_citations": "7\n", "authors": ["585"]}
{"title": "What is hidden in a heuristic evaluation: tactics from the experts\n", "abstract": " Usability of software is recognized as an important factor to develop software quality and ergonomics, and is capable of improving the efficiency and effectiveness of users. In addition, higher usability increases the satisfaction of customers. One of the most popular and economical accessible methods for usability evaluation is the Heuristic Evaluation (HE). However, a conduction of HE still depends on the participation of expert evaluator to produce the best results with quality; and expert evaluators are expensive and rare to find. Still, a little is know about adaptations of HE for novice evaluators. The development of adaptations to HE that can support the performance of novice evaluators, reducing the costs of applying it, remains as a challenge in the literature. In this context, organizations with a low monetary power rarely conduct usability evaluation in their process of software development. Researches that intend to investigate new approaches to enhance the performance of novice evaluators during HE are highly important to help these organizations to increase the quality of their products and satisfaction of their customers. The purpose of this study was to adapt the HE for novice evaluators, developing a set of tactics based on the knowledge of expert evaluators use during their performance of HE. We conducted a survey with four experts in usability related area in order to collect their main procedures used to perform a HE that were not described in the original method, since it is a lean method. Each expert informed tactics that he/she believed could help novice evaluators in their performance of a HE. A total of 38 tactics was collected from the …", "num_citations": "7\n", "authors": ["585"]}
{"title": "Definindo, Implantando e Melhorando Processos de Software em Ambiente Acadêmico\n", "abstract": " Models described in the literature for software development are sufficiently generic and need to be adapted according to the necessities for the environment in which they will be used. In this paper we talk about the improvement of the process adopted in an academic project development. Lessons learned during the development of such project, characteristics of the academic environment that differentiate the software process and requirements presented in the literature about software educational process are being considered. With the improvement initiative we hope to attend the specific necessities for the academic context regarding software process.Resumo. Modelos propostos na literatura para desenvolvimento de software são bastante genéricos e precisam ser adaptados de acordo com as necessidades do ambiente em que são utilizados. Neste artigo apresentam-se as melhorias que estão sendo implementadas no processo utilizado no desenvolvimento de um projeto acadêmico. Para isso, estão sendo consideradas as lições aprendidas no desenvolvimento de tal projeto, características do ambiente acadêmico que diferenciam o processo de software e requisitos apresentados na literatura sobre processos educacionais de software. Com a iniciativa de melhoria, espera-se atender, de forma mais satisfatória, as necessidades específicas do contexto acadêmico em termos de processo de software.", "num_citations": "7\n", "authors": ["585"]}
{"title": "Smart toys and children's privacy: usable privacy policy insights from a card sorting experiment\n", "abstract": " Smart toys are new to the Internet of Things market, and its connectivity to the cloud have raised concerns about children's privacy. Parents and legal guardians have striven to protect the privacy of their owns. However, current approaches for privacy control still lack usability for lay people. In this paper, we have explored the use of Card Sorting to enhance the usability of a privacy control for smart toys. Our goal was to identify and describe benefits of this technique to the design of more usable privacy controls. For this reason, we conducted a case study with voluntarily participants. We chose a parental control model from the literature to be the subject of evaluation for the experiment. Therefore, we extracted 19 units of information from its interface, and put them into cards for the Card Sorting evaluation. After the experiment, we obtained 30 valid responses. From these responses we performed a cluster analysis to …", "num_citations": "6\n", "authors": ["585"]}
{"title": "Gesture4All: a framework for 3D gestural interaction to improve accessibility of Web videos\n", "abstract": " Recently the interest in video consumption and sharing has increased considerably. Although initiatives such as WCAG 2.0 set guidelines for video players development, there is still a need for investigation about how to improve accessibility of Web videos for blind and low vision users. To enable researchers and developers new ways of interaction based on 3D gestural interaction, we introduce a JavaScript based framework, called Gesture4All, for Web videos interactions using four sensors (Smartphone, Webcam, Myo, and Leap Motion). Our framework is seamlessly integrated with the interface, receiving and interpreting gesture interactions performed by the user in order to control the Web video player functionalities. In this paper, we present the Gesture4All features as well as details of its architecture, demonstrating how the framework improve the accessibility through a case-study by 20 blind and visually …", "num_citations": "6\n", "authors": ["585"]}
{"title": "Designing for parental control: enriching usability and accessibility in the context of smart toys\n", "abstract": " Designing usable parental control interfaces remains as a challenge in the field. This chapter reviewed traditional Human-Computer Interaction methods, with examples focused on Parental Control interfaces in the context of Smart Toys, aiming practitioners from security and privacy area. We reviewed stages of the User Centered Design (UCD) with greater attention to the evaluation stage. Thus, we detailed activities of evaluation such as: User Testing, Usability Inspection, Accessibility Inspection and Automated Accessibility Testing Tools. Also, we suggested directions for the development of new methods of UCD focused on the context of Smart Toys. Finally, we discussed future trends in the context of Smart Toys: designing for elderly healthcare and interfaces of family control.", "num_citations": "6\n", "authors": ["585"]}
{"title": "Automatic identification of drop-down menu widgets using mutation observers and visibility changes\n", "abstract": " Drop-down Menus are JavaScript/CSS based Widget implementations which frequently represent the main navigation mechanism of a web application. These Widgets are used to display sub-level navigation links which are presented only as users position the mouse over the Widget. However many of the Widgets available on theWeb do not implement Accessible Rich Internet Applications (ARIA) requirements which address how to make these Widgets accessible. This paper presents an automatic approach for identifying these Drop-down Menu Widgets in web applications. The automatic identification of these Widgets works towards the implementation of ARIA automatic evaluation tools to assist web developers while developing accessible Widgets. The proposed approach was implemented in a tool called aria-check-menus which is open-source available. The tool was evaluated through a case study and the …", "num_citations": "6\n", "authors": ["585"]}
{"title": "A web service for CSCW applications\n", "abstract": " The Open Source Software (OSS) community came with a new paradigm for software development, and the tools commonly used by OSS teams to coordinate their work include version control systems and communication tools. However, there is a lack of groupware support for coordinating the development of OSS projects due to the fact that these tools are non-integrated. In this paper we describe the WS4CSCW, a web service that provides groupware support by integrating communication & coordination tools under a common conceptual model. This work is part of the SAFE project, which aims to develop a framework for supporting the OSS development process.", "num_citations": "6\n", "authors": ["585"]}
{"title": "Uma ferramenta web colaborativa para apoiar a engenharia de requisitos em software livre\n", "abstract": " Comunicação e prazos, principalmente em empresas, são problemas menores (ao menos passíveis de solução). Já a documentação... Arquivos textos, páginas Web, listas de email. Sem uma organização bem definida. Atualmente utilizam-se ferramentas de uso geral. Manutenção da documentação é cara. Existe uma carência por ferramentas que apoiem a engenharia de requisitos em software livre.", "num_citations": "6\n", "authors": ["585"]}
{"title": "An analysis of application usage for notes and reminders by older persons-eldernote case study\n", "abstract": " Population ageing represents an opportunity and a challenge for Gerontechnology innovation. The usability should be considered in the design of applications on mobile devices for older users because as we age, cognitive functions begin to decline and older people may have more difficulty to cope with managing a eventfully daily routine, even those experiencing a healthy ageing process. Thus, the opportunities that may be brought by the use of smartphones and solutions for the daily difficulties are still in demand. Therefore, co-design and focus on preferences and needs are necessary in order to make applications for mobile devices really accessible to older users. From data collected in a previous study, the authors developed a note-taking application with older user centered design for aid routine management. The purpose of the present study was to investigate the use by older users of this note-taking …", "num_citations": "5\n", "authors": ["585"]}
{"title": "Personalizing health-related ict interface and application: older adults and elderly caregivers preferences\n", "abstract": " Despite potential for preventing social isolation and loneliness, providing health care access and other benefits, older persons tend to be less receptive to digital devices. Elderly people frequently appoint complex interface and perceived usefulness as cause for not using health-related ICT. There is little information about preferences and interests of this specific population for tailored and customized technology, but according to the current literature; older users and caregivers both think that accessible and interactive design is the main aspiration. Besides that, they consider important some functionalities, especially for social interactions purposes. This study was conducted to address the interest, preferences and problems with an application for personalizing the tablet; with health older adults and social networking of dependent elderly individuals and to propose a new design for it. After using a skin app prototype …", "num_citations": "5\n", "authors": ["585"]}
{"title": "Keyboard navigation mechanisms in widgets: an investigation on ARIA's implementations\n", "abstract": " This study presents an investigation on how keyboard accessibility has been delivered in RIA-Rich Internet Applications. We conducted an evaluation on 32 websites which contained Tab Widgets and 74 websites which contained Menu Widgets, from the 150 websites of Alexa's top most accessed websites list. The evaluation process consisted of checking if the Widgets implemented ARIA-Accessible Rich Internet Applications requirements, like the use of role/state semantic attributes and presentation of keyboard interaction strategies. The results showed that, even though the ARIA specication achieved the status of W3C Candidate Recommendation in 2011 and W3C Recommen-dation in 2014, few websites implemented Tab and Menu Widgets according to ARIA in the Web. The study also identied alternative keyboard navigation mechanisms that are accessible to Assistive Technologies users, despite the disadvantages they might rep-resent. Moreover, the study proposes a framework to classify these alternative keyboard navigation mechanisms and map the technological requirements which need to be ad-dressed in order to make the Tab and Menu Widgets implement the ARIA specication.", "num_citations": "5\n", "authors": ["585"]}
{"title": "RestML: Modeling RESTful Web Services\n", "abstract": " In the last decade the paradigm of service-oriented computing is gaining more and more space in industry and academia in order to improve the communication among different information systems that exist in a corporate environment. Due to recent advances of so-called “Web 2.0”, a new architectural style called Web Oriented Architecture (WOA) was proposed in order to ensure a simple way to connect IT (Information Technology) components dynamically. The new architectural style describes the use of RESTful Web services as one of its principles in order to achieve a functional interface simple and uniform. This chapter will discuss the use of the paradigm of Model Driven Development in the construction of RESTful web services, presenting a domain-specific language (DSL) capable of representing the static characteristics and behavior of these services, enabling the generation of source code in an …", "num_citations": "5\n", "authors": ["585"]}
{"title": "Creating a project towards universal access: is it possible\n", "abstract": " As more people perceive the potential of the Web and become users of its facilities, there is a growing concern with contemplating the diverse ways in which they interact with information and services available. The increased popularity of the Web has also boosted innovations in technological resources (languages, interaction elements, and design issues) in a very fast speed. As a result, users and project developers alike face problems, as users face usability and accessibility barriers, whereas project developers find it difficult to employ innovative resources while minimizing such barriers in a consistent way. In this context, we present a Reference Architecture for Web development based on the WCAG 2.0 guidelines and other patterns, choosing the guidelines that require less effort to implement and have stronger impact on accessibility. The Reference Architecture has been adopted in the development of two …", "num_citations": "5\n", "authors": ["585"]}
{"title": "CMS instance of a tool to support the scheduling of undergraduate’s final year project on the Web\n", "abstract": " Uma importante atividade acadêmica consiste na apresentação dos Trabalhos de Conclusão de Curso (TCC) pelos alunos, que em geral os apresentam individualmente para uma banca de professores. Para agendamento das diversas apresentacões, o auxílio dos GCS se torna imprescindível. Apresentamos uma ferramenta para agendamento de bancas de TCC, como instância de CMS. Destacamos o potencial dos CMSs para atender requisitos específicos e manter as características genéricas para otimizar os recursos do ambiente de interação com a Web.", "num_citations": "5\n", "authors": ["585"]}
{"title": "Accessible organizational elements in wikis with model-driven development\n", "abstract": " Wiki is a web collaborative tool for promoting rapid publication of information, by allowing users to edit, add or revise content through a web browser. Despite various benefits offered by the use of wikis, there is no guarantee of a good structure of its content. This occurs, especially, because of the flexibility and easiness on creating and referencing pages and also for the reason that difficulty to graphically visualize the information architecture. In this paper it is proposed a Model-Driven Development (MDD) approach that supports creating graphical models of namespaces to generate structured wikis code. In addition, this approach also aims to include accessibility features on models from official W3C guidelines such as WCAG and ATAG, allowing access by a wider range of users.", "num_citations": "5\n", "authors": ["585"]}
{"title": "OntoMap: an ontology-based architecture to perform the semantic mapping between an interlingua and software components\n", "abstract": " This paper is about the use of natural language to communicate with computers. Most researches that have pursued this goal consider only requests expressed in English. A way to facilitate the use of several languages in natural language systems is by using an interlingua. An interlingua is an intermediary representation for natural language information that can be processed by machines. We propose to convert natural language requests into an interlingua [universal networking language (UNL)] and to execute these requests using software components. In order to achieve this goal, we propose OntoMap, an ontology-based architecture to perform the semantic mapping between UNL sentences and software components. OntoMap also performs component search and retrieval based on semantic information formalized in ontologies and rules.", "num_citations": "5\n", "authors": ["585"]}
{"title": "Design Rationale in Academic Software Development: Requirements for a Representation Model.\n", "abstract": " Design rationale is the description of “how” and “why” an artifact has been designed in a certain way. The recording and management of this information are important issues in achieving better support for software maintenance. We have experimented with design rationale in academic setting and have perceived weak motivation of students with traditional design rationale approaches. In this paper, we introduce a set of requirements for a design rationale model within the context of academic software research.", "num_citations": "5\n", "authors": ["585"]}
{"title": "A family of link based metrics for the evaluation of Web documents\n", "abstract": " 1t we11 kn0wn that we6 51te5 de519n 15 n0t an exact pr0ce55; a5 the de519n act1v1ty Pr09re55e5, many d1fferent a5pect5 c0ncern1n9 the 501ut10n 0f the pr061em 0f pr0duc1n9 a•• 900d\" hyperd0cument 5h0u1d 6e c0n51dered. 51nce hypermed1a de519n pr0v1de5 many d1fferent and a1ternat1ve way5 0f 0r9an121n9 1nf0rmat10n, there are n0t 5tr1ct ru1e5 wh1ch 5h0u1d 6e f0110wed 1n 0rder t0 acc0mp115h a•• 900d\" de519n. 7he ex15tence 0f pract1-ca11y n0 ru1e5 a60ut what 5h0u1d 6e taken 1nt0 acc0unt when creat1n9 a hyperd0cument make5 th15 ta5k hard and the 1ack 0f c0n5en5u5 0n h0w t0 appr0ach 1t make5 the ta5k even harder. May6e th15 15 0ne 0f the rea50n5 f0r the ex15tence 0f 50 many p00r1y wr1tten hyperd0cument5, 1ack1n9 an we11-0r9an12ed 5tructure. 50me pr0pert1e5 0f hyperd0cument5 that can 6e u5ed f0r 1dent1fy1n9 p00r1y de519ned hypertext5 have 6een p01nted 0ut …", "num_citations": "5\n", "authors": ["585"]}
{"title": "Análise e Avaliação de Hiperdocumentos: uma abordagem baseada na Representação Estrutural\n", "abstract": " A construção de um hiperdocumento envolve, geralmente, a composição de um volume significativo de informações e é considerada uma atividade com grande risco de erros. Uma análise do hiperdocumento que auxilie a atividade de autoria e conduza melhoria de sua qualidade, exige do autor, uma visão completa do hiperdocumento a partir de varias perspectivas; muitas vezes necessitando o auxilio de algum procedimento sistemático ou mesmo automatizado. Este trabalho investiga formas automáticas de avaliação de hiperdocumentos com base na sua estruturação, com o objetivo de melhorar a qualidade da organização das ligações (links) construídas pelo (s) autor (es). Uma sistemática para exame de hiperdocumentos, baseada na análise relacional de reuso de links, aqui proposta, subsidiou o desenvolvimento do sistema LiOS (link oriented system), uma ferramenta para auxiliar no processo de avaliação da estrutura de hiperdocumentos. A partir dessa formalização, foi proposta uma classificação de reuso de links, que se constitui em uma nova métrica para avaliação de hiperdocumentos. O uso do sistema LiOS para o exame de hiperdocumento da world-wide web comprovou que, por meio da identificação dos casos de reuso de links, a qualidade da estrutura do hiperdocumento pode ser melhorada, revelando a eficiência da simetria proposta neste trabalho", "num_citations": "5\n", "authors": ["585"]}
{"title": "Acessibilidade Digital Durante a Pandemia da COVID-19-Uma Investigação sobre as Instituições de Ensino Superior Públicas Brasileiras\n", "abstract": " A educação remota emergencial tornou-se a principal alternativa para manter o processo de ensino e aprendizagem ativo com o isolamento social ocorrido como consequência da pandemia da COVID-19. Apesar de muitas instituições de ensino superior terem pouca ou nenhuma experiência com esta modalidade de ensino, elas tiveram que adequar suas metodologias rapidamente e adotar ferramentas que permitissem a comunicação síncrona e assíncrona entre professores e estudantes, a disponibilização de material didático e a realização de atividades didáticas. A acessibilidade digital torna-se imprescindível neste contexto, para permitir que todos os estudantes, incluindo estudantes com deficiência, tenham acesso ao aprendizado de forma igualitária. O objetivo deste artigo é apresentar um diagnóstico sobre as tecnologias e outros recursos disponíveis nas instituições de ensino superior federais e estaduais brasileiras para dar suporte ao ensino remoto emergencial durante a pandemia da COVID-19, com foco no provimento de acessibilidade digital. A metodologia utilizada foi a solicitação de informações por meio da Lei de Acesso à Informação a 142 instituições, com análise dos dados de 97 respostas completas ou parciais. Os resultados mostraram que a maioria das instituições possui dados sobre estudantes de graduação com deficiência e muitas utilizam ferramentas de software e recursos acessíveis, com número menor de instituições que mantém registro sobre alunos de pós-graduação com deficiência. A maioria das instituições que respondeu aos pedidos utiliza abordagens de ensino remoto durante o período da …", "num_citations": "4\n", "authors": ["585"]}
{"title": "Challenges of automatically evaluating Rich Internet Applications accessibility\n", "abstract": " Over the past decade, the Web has provided users with interactivity through Rich Internet Applications (RIAs). However, most applications still have not implemented accessible solutions in their components. Apart from the high level of difficulty of manual assessments of accessibility in RIAs, such applications lack automatic tools that support the process. The dynamic nature of web content leads to the updating of automated tools to include techniques that identify and classify the several components that comprise RIAs. This paper discusses the state-of-the-art and limitations of current automatic tools that assess the accessibility of RIAs, and presents a meta-review of multidisciplinary techniques towards motivating research on improvements in such tools. The study contributes to the availability of accessible RIAs for disabled users, which include components with recent technologies and innovative features in web …", "num_citations": "4\n", "authors": ["585"]}
{"title": "Dynamic Web Content\n", "abstract": " Web applications have provided a good deal of information that is dynamically rendered to users in accordance with their needs. The continuous evolution of web technologies has enhanced the flexibility of interactions with increasingly varied and resourceful web interfaces (i.e. rich interfaces) that support dynamic web content. However, the increase in web interactivity has created accessibility barriers, because users of Assistive Technology (AT) tools may not be aware of the web’s dynamic behaviour and its available controls. The goal of this chapter was to clarify technical factors, as well as to address the main concerns and their outcomes that developers have to deal with, and provide a brief account of current trends in research on this subject. For this reason, this chapter describes the main mechanisms used in web applications that are responsible for providing the dynamic content. In addition, there is …", "num_citations": "4\n", "authors": ["585"]}
{"title": "Accessibility in mobile applications for elderly users: a systematic mapping\n", "abstract": " This Research Full Paper presents a systematic mapping that aims to characterize the current scenario of mobile application development considering accessibility issues for elderly people. Currently, the use of mobile devices has been growing exponentially, giving way to new ways of relating, working, performing daily tasks and learning. In this context, mobile learning has emerged seeking to democratize access to knowledge for different audiences. To achieve this democratization, it is necessary to develop mobile learning applications considering accessibility issues, in order to reduce barriers that might exist. Due to the increase of the life expectancy, such applications must also be accessible for elderly users. In this context, we conducted a systematic mapping that aims to characterize the current scenario of mobile application development considering accessibility issues for older people. The idea is that the …", "num_citations": "4\n", "authors": ["585"]}
{"title": "An analysis of crossword learning: a mobile application for the elderly\n", "abstract": " Mobile learning (or m-learning) is a learning modality that lies on using mobile devices by the people involved in the apprenticeship process, enabling learning to occur anytime, anywhere. Many different kinds of people should have access to this modality of learning, including senior users. Considering such particular audience, the main purpose of this paper is to present and discuss the results of an accessibility and usability evaluation of a mobile educational application called Crossword Learning. The prototype app was structured based on the users profile and aims to teach seniors about several subjects with a crossword support. In total, ten users participated in the accessibility and usability evaluation. The obtained results showed that the problems found in the mobile educational application were the same that could occur in applications from other domains. This study evidences the accessibility …", "num_citations": "4\n", "authors": ["585"]}
{"title": "Adapting web menus to mobile devices for Elderly interactions\n", "abstract": " The Web portability is a usually wished feature and, due to the recent dissemination of mobile devices such as smartphones, it motivated the development of methods to adapt web content to many kinds of interfaces. However, an increasing diversity of user profiles can be observed consuming Web resources. The elderly, as part of this diverse group of users, face barriers that hinder their access to applications and Web content in general. This paper presents a web content adaptation strategy for mobile devices, and in particular, the interaction by the elderly with menu Widget, generated by a tool, Adapte-me!, is analysed. A Case Study to evaluate this strategy was produced, and the results demonstrated that participants performed better while using the menu Widget generated by the tool. Furthermore, all participants showed increased satisfaction interacting with the adapted menu Widget, since they all managed …", "num_citations": "4\n", "authors": ["585"]}
{"title": "Video accessibility on the most accessed Websites-A case study regarding visual disabilities\n", "abstract": " The availability of video content has increased along with the popularity of the Web due to the large amount of interactive systems and video sharing. This scenario should be carefully considered by video authors since the content needs to be accessible to a variety of final users (including people with disabilities). Although efforts have been made to improve accessibility for embedded videos on webpages, there still the need to develop accessibility solutions for video content. In this study we aim to analyze the video accessibility on the most accessed websites, identify the accessibility controls they had or not and which navigation mode they used to help people with visual disabilities. We analyze each video player of the top 50 websites to identify which controls they use. Also, we made a case study with a blind user, who was interviewed too. As results we realize that the most accessed websites are not …", "num_citations": "4\n", "authors": ["585"]}
{"title": "A user test with accessible video player looking for user experience\n", "abstract": " There is a huge availability of videos that have been produced in a very fast and wide way, along with the popularity of Internet. The video authors should carefully consider the scenario since many users have different needs. It is important to keep in mind the user experience because involves a person’s behaviors, attitudes, and emotions about using a particular system, for example, the video player. In addition, usability and accessibility of video players need to be considered. The object of this study is to examine users’ needs, expectations and requirements for accessible videos. We developed an accessible video player to evaluate with users. We present the results in the form of guidelines, which highlight the characteristics of users; the characteristics that the video need to satisfy the users’ needs and the context in which users commonly watch the videos.", "num_citations": "4\n", "authors": ["585"]}
{"title": "A nonintrusive approach for implementing single database, multitenant services from web applications\n", "abstract": " In the Software as a Service (SaaS) distribution model, the software belongs to the service provider and clients act as tenants who pay to use the software. However, sparse documentation and problem-specific solutions imply that building a scalable, secure and configurable Software as a Service is not an easy task. This paper describes a reusable approach for implementing Single Database, Multitenant Software as a Service from existing Web Applications by adding multitenancy as an aspect of the Software. The approach uses architectural components, design patterns and current main-stream programming language functionality without requiring extensive changes to the original Web application. We used our approach to develop both a real-world use case, built in Ruby on Rails, and a reference application, built in Java, which is freely available.", "num_citations": "4\n", "authors": ["585"]}
{"title": "Accessibilityutil: a tool for sharing experiences about accessibility of web artifacts\n", "abstract": " Existing guidelines on how to develop web applications with accessibility are currently not applied in many organizations. The lack of\" closeness\" of these guidelines to the developers is one of the most significant reasons for this scenario, as developers often do not know them or find it difficult to apply them. As a proposed solution to increase the use of guidelines in development practices, we present a proposal of a collaborative tool for sharing and disseminating experiences. The proposal is based on capturing and disseminating Design Rationale (DR) related to experiences with developing web artifacts, following the Web Content Accessibility Guidelines (WCAG) 2.0.", "num_citations": "4\n", "authors": ["585"]}
{"title": "Accessibility of Brazilian state government websites: a quantitative analysis between 1996 and 2007\n", "abstract": " A utilização da web para a disponibilização de informações e serviços de órgãos governamentais para os cidadãos tem se tornado cada vez mais expressiva. Assim, a garantia de que esses conteúdos e serviços possam ser acessíveis a qualquer cidadão é imprescindível, independentemente de necessidades especiais ou de quaisquer outras barreiras. No Brasil, o Decreto-Lei nº5. 296/2004 determinou que todos os órgãos governamentais deveriam adaptar seus sítios na web de acordo com critérios de acessibilidade até dezembro de 2005. Com o objetivo de verificar a evolução da acessibilidade ao longo dos anos e como foi o impacto dessa legislação, este artigo analisa a acessibilidade dos sítios dos governos estaduais brasileiros por meio de amostras coletadas entre 1996 e 2007. Foram efetuadas análises por meio de métricas, obtidas por avaliações com ferramentas automáticas. Os resultados indicam que a legislação teve pouco impacto para a melhoria real da acessibilidade dos sítios no período indicado, com uma melhora somente em 2007. Verifica-se que se faz necessário adotar políticas públicas mais efetivas para que as pessoas com necessidades especiais tenham os seus direitos para acesso a informações e aos serviços públicos na web assegurados mais amplamente.", "num_citations": "4\n", "authors": ["585"]}
{"title": "Desenvolvimento de componentes de interfaces multimodais ricas para a Web utilizando X+ V e Dojo Widgets\n", "abstract": " In this paper it is described an approach to develop Web multimodal applications using X+ V and widgets. The X+ V technology itself doesn't suffice the development of rich multimodal applications. So it's required to implement the integration in VoiceXML with the aid of EcmaScript in order to make the interface's component manipulation more intuitive. A case study of such components implementation with the Dojo toolkit filtering select widget and X+ V is reported. The issues involved in the development as well as the limitations of such integration are described in this paper.", "num_citations": "4\n", "authors": ["585"]}
{"title": "Aprendendo JavaScript\n", "abstract": " De fato, concordamos que essas respostas falam verdade! Mas essa fama de ser uma linguagem’leve’, para fazer truques em páginas, faz com que muitas pessoas pensem que JavaScript não é uma linguagem de programação séria. Muitos lembram dela como se fosse apenas uma extensão do HTML. A sigla DHTML (Dynamic HTML) é uma das causadoras dessa impressão, porque sugere que é um novo tipo de HTML e não que é usado JavaScript e HTML juntos. Na verdade, JavaScript é uma linguagem de programação de propósito geral, dinâmica e possui características do paradigma de orientação a objetos. Ela é capaz de realizar virtualmente qualquer tipo de aplicação, e rodará no browser do cliente.Atualmente, uma empresa que utiliza JavaScript em praticamente todos os seus aplicativos é a Google Inc., como por exemplo: no site de busca Google Search1, no GMail2, no Google Maps3, entre outros. O que torna esses aplicativos tão populares é a forma como são interativos, e isso se deve em maior parte ao JavaScript.", "num_citations": "4\n", "authors": ["585"]}
{"title": "Model for Academic Software Development Including Design Rationale Elements\n", "abstract": " In the academic scenario projects are generally developed by different people during the extent of some years, with the objective of investigating scientific issues and proposal of new theories. Providing resources to guarantee the evolution of such projects is important because, commonly, research results proceed from collaboration of many students and researchers and they are related to well-elaborated extensions of preliminary ideas.Software projects evolution is closely related to software projects maintenance. According to Kemerer and Slaughter, software maintenance refers to activities that take place at any time after the new project is implemented and software evolution is defined as examining the dynamic behavior of systems, how they change over time [1]. We assume, in this research, that evolution is a more abstract concept and, as stated by Lehman and Ramil, it is related to progressive change in …", "num_citations": "4\n", "authors": ["585"]}
{"title": "Preparing, extending and retrieving captured information\n", "abstract": " In the area of ubiquitous computing, \"capture and access\" has been defined as \"the task of preserving a record of some live experience that is then reviewed at some point in future\". Capture and access applications have been built in domains such as meetings and classrooms. However, the work reported so far focus on the capture portion of the application and, although the Web is commonly used to deliver the captured information, the documents are mostly static and hard to reuse. Therefore, there is a lack of support for integrated user-driven tasks, such as allowing reuse when preparing the information before the live experience and adding annotations or references to the captured contents after live experience has been finished. We present An integrated environment that can be used to prepare, extend and retrieve the corresponding information.", "num_citations": "4\n", "authors": ["585"]}
{"title": "Uma Ferramenta de Apoio à Utilização de Statecharts para Especificação do Comportamento de Sistemas de Tempo-Real Complexos\n", "abstract": " Uma das características dos Sistemas de Tempo-Real é a sua reação imediata a estímulos (eventos) ocorridos no mundo real. Os métodos para especificação e projeto de STRs sugerem o uso de técnicas para especificação desse comportamento reativo dos STRs. Nesta dissertação faz-se uma revisão bibliográfica de vários métodos para especificação de STRs, verificando-se quais são as técnicas usadas para especificação do aspecto comportamental. Uma dessas técnicas, STATECHARTS, foi escolhida para apoio por Computador. O trabalho descreve uma ferramenta desenvolvida para esse fim. São discutidos também os requisitos que levaram à construção da ferramenta e mostrada sua arquitetura. Exemplifica-se o uso da ferramenta em um caso abrangente, enfatizando-se as características principais dos Statecharts.", "num_citations": "4\n", "authors": ["585"]}
{"title": "Usability heuristics on parental privacy controls for smart toys: From an exploratory map to a confirmatory research\n", "abstract": " In this paper, we aimed to indicate usability heuristics for the design of parental privacy controls for smart toys. During a snowballing mapping process, we examined 589 candidate studies. Our mapping findings draw from 13 included studies and indicate the heuristics for IT Security Management, proposed by Jaferian et al., as the best to address problems that affect laypeople’s interaction with privacy policy tools. With the participation of 14 inspectors, we compared the effectiveness of Nielsen’s and the IT Security Management heuristics in heuristic evaluations of a parental privacy control model for smart toys. The results show that the IT Security Management heuristics have better coverage of usability problems (Kruskal–Wallis, p-value≈ 0.01), which confirms the mapping findings. Future studies can compare these heuristics based on outcomes from test with users as a benchmark. Also, future studies can …", "num_citations": "3\n", "authors": ["585"]}
{"title": "Uma revisão sobre acessibilidade no desenvolvimento de Internet das Coisas: oportunidades e tendências\n", "abstract": " A Internet das Coisas (IoT) tornou-se um tópico de significativo interesse nos últimos anos. Bilhões de dispositivos do cotidiano estarão conectados e novas formas de interação crescerão com esse novo paradigma. No entanto, o futuro papel da IoT em relação à inclusão em ambientes inteligentes ainda não está bem definido. Mais estudos ainda são necessários para investigar se essas tecnologias serão facilitadoras ou se introduzirão mais barreiras. Neste estudo, conduzimos um mapeamento sistemático para fornecer uma visão geral de como a acessibilidade foi considerada no desenvolvimento de sistemas IoT. Os resultados mostram que a comunidade apresentou soluções de Tecnologia Assistiva baseadas em recursos de IoT e uma falta de estudos sobre acessibilidade e estudos de usuários em projetos de IoT. Portanto, os resultados fornecem uma visão geral da pesquisa atual em IoT, bem como implicações para novas oportunidades de pesquisa.", "num_citations": "3\n", "authors": ["585"]}
{"title": "Um estudo sobre o uso de dispositivos móveis e aplicações de aprendizagem móvel com foco em usuários idosos\n", "abstract": " Este artigo apresenta um estudo sobre o uso de dispositivos móveis e aplicações de aprendizagem móvel no contexto de usuários idosos. No estudo foi aplicado um questionário para 28 usuários idosos, o qual foi complementado por meio da realização de entrevistas com dois especialistas no ensino dos usuários mais velhos. Os resultados apontam um considerável interesse desses aprendizes em aplicações de aprendizagem móvel e indicam a importância de se desenvolver esse tipo de aplicação com características específicas, dando especial atenção à necessidade de serem intuitivas. A partir desses resultados, foi proposta, ainda, a Crossword Learning, aplicação que trabalha com aspectos de ensino e aprendizagem dos idosos por meio de palavras cruzadas.", "num_citations": "3\n", "authors": ["585"]}
{"title": "Um Mapeamento Sistemático sobre Acessibilidade e Usabilidade no Desenvolvimento de Jogos Digitais para Idosos\n", "abstract": " Este mapeamento buscou conhecer como, quando e onde aspectos de acessibilidade e usabilidade são abordados durante o desenvolvimento de jogos digitais para usuários idosos. Abordamos 20.270 resultados iniciais, amostramos 1.755 e identificamos 46 publicações após o processo do mapeamento. Os resultados deste mapeamento mostraram uma preferência em pesquisas que abordem avaliação de acessibilidade e de usabilidade neste domínio. Este mapeamento também evidenciou que, neste domínio e na amostragem considerada, pesquisas apenas abordaram acessibilidade quando usabilidade também foi abordada por alguma razão. Ainda, as análises de resultados indicaram a predominância significativa (, ) de abordagens que consideram usabilidade (43) sobre abordagens que consideram acessibilidade (11). Neste contexto, sugerimos questões de pesquisa para revisões sistemáticas futuras na área.", "num_citations": "3\n", "authors": ["585"]}
{"title": "Towards characteristics of accessibility and usability issues for older people-a brazilian case study\n", "abstract": " The constant evolution of the Web is a worldwide phenomenon that needs to deal quickly with the various segments of current society. Thus, Web content should be accessible to the different user profiles. In this century, the aging population has presented a high rate of demographic growth. Older people (aged 60+) have some of their capacities limited and may face barriers to interact with services and content available on the Web. Despite of legislation and recommendations concerning how to make Web content more accessible and usable, there are still many problems related to accessibility and usability to be solved, especially those related to recent technological advances of current Web resources. The purpose of this study was to investigate the main accessibility and usability issues on websites. The study involved a sample of 20 Brazilian older people. Results showed the most common issues …", "num_citations": "3\n", "authors": ["585"]}
{"title": "Florch: Challenges on developing a new social network accessible for senescent users\n", "abstract": " Brazilian senescent population can grow three times the actual number in the next 20 years [18], being over 88 million people in 2035. This senescent growing number brings new challenges on quality of life for Brazilian society. How to promote digital inclusion to this profile of user is still a challenge in the literature. We believe that a social network focused on senescent users can enhance the digital inclusion for them. However, it's essential that the social network be designed for senescent users. This study aims to create a project with this characteristics. We analyzed a successful social network (WhatsApp) in order to propose a new one (Florch) for senescent users. We developed a high fidelity prototype of Florch and tested it. Our findings show usability and accessibility problems faced on the project's development. In addition, a Hierarchical Task Analysis of our social network showed that it has less and simpler …", "num_citations": "3\n", "authors": ["585"]}
{"title": "Applying an Approach to Develop Web Applications Considering Accessibility Practices Using Design Rationale\n", "abstract": " Regardless of the techniques and methods that have been developed to improve web applications, there are still gaps that need to be solved in order to reduce the accessibility barriers. Aiming to contribute to this area, this study presents an controlled experiment to validate an approach which uses Design Rationale. The participants attended an initial training and, after being classified according to their experience and divided into different groups, they were asked to develop a web application. Such process gave rise to useful concerns that were shared among the work teams. This paper reports this experiment and presents relevant contributions to approach accessibility issues.", "num_citations": "3\n", "authors": ["585"]}
{"title": "Acessibilidade sensível ao contexto para adultos mais velhos em sistemas web.\n", "abstract": " Neste artigo é proposto um mecanismo de apoio para a interação de adultos de meia-idade e idosos com páginas Web. A abordagem proposta baseia-se em pesquisas anteriores sobre os problemas mais comuns encontrados por esses usuários e a solução apresentada abrange a personalização de layouts de páginas da Web e o envio de mensagens de voz para o usuário. Uma das principais contribuições deste trabalho é o uso de ajudas contextualizadas de acordo com a categoria das páginas Web e os tipos de recursos que elas contêm. Um esquema de categorização automática página foi desenvolvido, juntamente com uma ferramenta para coletar o conhecimento dos usuários sobre a natureza de páginas. Os resultados preliminares de uma inspeção de usabilidade da ferramenta são discutidos e propostas para futuras investigações sobre o impacto desta tecnologia a respeito da acessibilidade de sites para adultos de meia-idade e idosos também são apresentadas.", "num_citations": "3\n", "authors": ["585"]}
{"title": "Context sensitive accessibility aid to middle-aged adults and elderly users in web systems\n", "abstract": " This paper describes an interaction mechanism aimed at enhancing the accessibility of Web pages to middle-aged adults and seniors. The proposed approach builds on previous research on problems commonly encountered by these users. The presented solution encompasses the customization of Web page layouts and the use of automatically-generated voice prompts to users. One of the main contributions of this work is the use of contextualized aids according to the genre of Web pages and the types of features they contain. An automatic page categorization scheme has been developed, alongside with a tool to collect knowledge from users about the nature of pages. The preliminary results from a usability inspection of the tool are discussed, and proposals for future investigations on the impact of this technology on the accessibility of websites for middle-aged adults and senior users are also outlined.", "num_citations": "3\n", "authors": ["585"]}
{"title": "Functional and device interoperability in an architectural model of geographic information system\n", "abstract": " Providing communication in Geographic Information Systems (GIS) is an instigating development challenge, due to the high complexity of these systems and to the difficulty of modeling them properly. This paper presents a model of an architecture to represent the structure of a GIS. The architecture is based on standard technologies, such as XML, XSLT and SVG. These technologies are used to represent GIS and to provide functional and device interoperability. Moreover, web services are used for exchanging information between systems used by different devices in different contexts. The proposed architecture is transparent to users and provides information adaptation to different devices using context information. The main contributions of the proposed architecture is the geographic representation using SVG, the functional and device interoperability and cartographic generalization.", "num_citations": "3\n", "authors": ["585"]}
{"title": "Supporting web page accessibility by using earl reports\n", "abstract": " This paper presents a way to evaluate web accessibility pages using HTML source code and EARL reports. EARL reports are XML files generated by automatic accessibility checker tools such as AChecker. Our main motivation is that all accessibility evaluators use the absolute amount of HTML elements from the web page structure being evaluated, once EARL reports identify potential problems in web pages but they do not specify how much HTML elements can be found on such pages. Our proposal aims at reading the HTML source code and EARL reports to calculate evaluation metrics based on how much elements compound them. Two parsers were developed in order to obtain key elements, one for HTML pages and another one for EARL reports. A third program computes the metric suite generating results about page accessibility.", "num_citations": "3\n", "authors": ["585"]}
{"title": "DocRat: Produto da Re-engenharia da Ferramenta DocRationale\n", "abstract": " O desenvolvimento de interfaces que facilitem a operacao de sistemas computacionais requer contınuos esforcos de pesquisa. A aplicacao de conceitos de usabilidade no contexto de ferramentas CASE (Computer Aided Software Engineering) e de extrema importancia, devidoa grande resistencia ao uso deste tipo de ferramenta por parte dos desenvolvedores. A DocRationalee uma ferramenta CASE baseada na Web para apoioa captura, armazenamento e recuperacao de Design Rationale de artefatos de projetos de software. A partir do uso da ferramenta em disciplinas de graduacao e pos-graduacao, foram detectados diversos problemas de usabilidade que prejudicavam o uso da ferramenta e causavam ainda mais resistencia ao seu uso. Desta forma, foi efetuada uma re-engenharia da Ferramenta DocRationale, que culminou em uma nova versao desta, denominada DocRat. Neste relatorio tecnico sao …", "num_citations": "3\n", "authors": ["585"]}
{"title": "Documentação do software WS4CSCW (web services for CSCW).\n", "abstract": " Service que tem como objetivo facilitar a integração de ferramentas e sistemas CSCW (Computer Supportes Collaborative Work). O WS4CSCW permite o gerenciamento de usuários, grupos, recursos, permissões e papéis de usuários e grupos.Uma característica comum na maioria das aplicações CSCW refere-se ao controle e gerenciamento de usuários e grupos. Quando essas ferramentas são integradas para trabalharem em conjunto, com o objetivo de acrescentar funcionalidades e facilidades ao usuário ou grupos de usuários, é possível que essas informações fiquem redundantes ou mesmo inconsistentes caso sejam tratadas isolada e localmente.", "num_citations": "3\n", "authors": ["585"]}
{"title": "No Risk Planning-um sistema web de agenda para grupos\n", "abstract": " A aplicaçao No Risk Planninge um sistema web de agenda para grupos, desenvolvida para atender principalmente aos requisitos de gerenciamento de tarefas academicas. Adotando o conceito de Separaçao de Interesses, a aplicaçao foi re-escrita, de forma que os mecanismos de logica, conteudo e layout foram implementados na linguagem PHP, e utilizando documentos XML e folhas de estilo XSLT, respectivamente.", "num_citations": "3\n", "authors": ["585"]}
{"title": "Implantação de Gestão Descentralizada de Recursos Acadêmicos–um estudo de caso\n", "abstract": " A eficiência na realização de tarefas rotineiras de cunho administrativo em instituições de ensino, em especial as que são efetuadas de forma centralizada, muitas vezes comprometem o bom andamento das tarefas acadêmicas primordiais. Neste artigo apresentamos as atividades realizadas na implantação de uma abordagem de gestão descentralizada para utilização de salas em uma instituição de ensino. Assim, são apresentadas as questões referentes ao processo de desenvolvimento da solução de software adotada, assim como as questões referentes à implantação do software e aos fatores humanos associados, principalmente quanto à aceitação por parte dos participantes dessa nova abordagem.", "num_citations": "3\n", "authors": ["585"]}
{"title": "Documentação do Sistema de Reserva de Salas da Intranet do ICMC-USP\n", "abstract": " Este relatório, na forma de Documentação de software do Sistema de Reserva de Salas, apresenta informações técnicas sobre o referido sistema. O objetivo é o de registrar suas principais características e as soluções de implementação que foram adotadas.", "num_citations": "3\n", "authors": ["585"]}
{"title": "Documentação do Software Agenda “No Risk Planning”.\n", "abstract": " Este relatório apresenta a documentação do software denominado Agenda NoRisk Planning que implementa funções do domínio de informações de Groupware. Esta documentação foi recuperada devido a Agenda possuir soluções de projeto para WIS ( Web Information System) simples, mas que estão em contínua evolução. Dessa forma, necessitava do apoio de um documento que a representasse numa visão mais abstrata para que suas próximas alterações pudessem ser melhor conduzidas, bem como para que outros projetos também pudessem se beneficiar delas. Por meio de um processo de engenharia reversa, parcialmente baseado no método Fusion-RE/I (Fusion , Reverse Engineering/Interface) - desenvolvído no ICMC-USP [Costa 1997 ], a documentação pôde ser obtida. Para a modelagem dos artefatos que documentam a Agenda NoRisk Planning, foram utilizados alguns modelos próprios do …", "num_citations": "3\n", "authors": ["585"]}
{"title": "A Formal Approach to Consistency and Reuse of Links in World-Wide Web Applications\n", "abstract": " This chapter addresses the problem of evaluating hyperdocuments. It presents a framework for perusing hyperdocuments regarding their structure, aiming to improve the quality of their link organisation. It describes a tool which checks for consistency and reuse of link components, presents some empirical results of its use and proposes a formalism which provides a systematic method of approaching consistency and reuse through link recovery and examination. 1. Introduction It is widely known that hypermedia systems, which are strongly based on human computer interaction, have been accepted as an innovative framework which plays an important role in current computing environments. Hypermedia design is a human activity that is complex mainly due to the large amount of information to be processed. The lack of guidelines on what factors should be considered when creating a hyperdocument makes the task even harder. Since there is no consensus on what methodology to use in order to produce a...", "num_citations": "3\n", "authors": ["585"]}
{"title": "LiOS: a tool for supporting evaluation in the WWW\n", "abstract": " Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS", "num_citations": "3\n", "authors": ["585"]}
{"title": "Startup workplace, mobile games, and older adults: A practical guide on UX, usability, and accessibility evaluation\n", "abstract": " Mobile game applications stand as a profitable market, being mostly represented by independent startups striving to overcome their lack of experience. One of their big challenges refers to the adoption of mobile games by older adults. Appropriated methods for usability, accessibility and user experience (UX) evaluation of such domain remains a few in the literature. Engineering methods are still required for startup companies to overcome the challenge. In this paper, we sought to build evaluation methods for the context of startups, mobile games and older adults. This study is an empirical research based on techniques from the constructivist grounded theory methodology. Our findings show a lean framework aiming to guide startup practitioners to diagnose usability, accessibility and UX issues from tests of mobile games with older adults. We also provide a guide to usability and accessibility heuristics that can be …", "num_citations": "2\n", "authors": ["585"]}
{"title": "An Overview of Web Accessibility in Different Countries\n", "abstract": " The web is increasingly present in people's lives, as well as in public administration. With the advancement of technology, it has become possible to offer online access to information and services in a democratic and transparent way and greater interaction of the population with its rulers, called EGovernment. One of the key features of a government website should be accessibility. The purpose of this article is to present a panorama of the accessibility of the official government websites of different countries, using automatic tests according to the guidelines of the Web Content Accessibility Guidelines 2.0. It was concluded that none of the countries has minimally accessibility requirements. For a small number of countries it was possible to observe the relationship between economic and social indicators and accessibility in government portals, but it was not possible to generalize the results.", "num_citations": "2\n", "authors": ["585"]}
{"title": "Enhancing usability of a Citizen Observatory based on User-centered Design\n", "abstract": " Several crowdsourcing-based systems have been employed to gather information from individuals in natural disaster domain. They involve a wide diversity of users, which make their usability an important aspect. This article deals with the understanding of users' needs and design of a new interface for the Citizen Observatory of Floods. An User-centered Design (UCD) approach was employed and users were the main focus of the development process. The outcomes of a heuristic evaluation conducted revealed several problems of the prototype regarding usability aspects.", "num_citations": "2\n", "authors": ["585"]}
{"title": "Guiding Usability Newcomers to Understand the Context of Use: Towards Models of Collaborative Heuristic Evaluation\n", "abstract": " Usability inspection methods are liable to the expertise effect among distinct evaluators. Hence, understanding the difficulties faced by evaluators of low expertise (novices and newcomers) is a requirement to move forward in the field. However, the following question remains: Which of the terms that compose usability (User, Goal, Effectiveness, Efficiency, Satisfaction, Context of Use and Task) is the most difficult for newcomers to understand? This exploratory study aims to compare usability newcomers’ difficulties on understanding different terms that compose the usability, based on the definition showed by the ISO/IEC 25066. To achieve this goal, we conducted a survey with 38 usability newcomers. Observations on our survey show the Context of Use may be the most difficult term to be understood by newcomers. Thus, we suggest the adoption of scenarios, storyboards, and domain-specific principles as …", "num_citations": "2\n", "authors": ["585"]}
{"title": "Avaliação de Acessibilidade e Usabilidade em RIA\n", "abstract": " A popularidade de aplicações de Internet atingiu escalas abrangentes. Como consequência, uma grande diversidade de soluções foram criadas baseadas em funcionalidades Web. Aplicações de Internet Ricas (RIAs) é um termo importante adotado para avanços tecnológicos em software desenvolvidos para a Web, e que confere a aplicações Web meios para prover aos usuários uma experiência similar à experiência de uso de desktops. RIAs possuem, usualmente, capacidades mais amplas em comparação com aplicações tradicionais de hipertexto, especialmente considerando elementos interativos de interfaces. Novas possibilidades que emergiram a partir de RIAs foram essenciais para suportar aspectos de Web 2.0, como a participação e colaboração. Como entre outras aplicações, o desenvolvimento de RIAs usáveis e acessíveis é aspecto valioso e fundamental para as equipes de desenvolvimento. Algumas das novas funcionalidades de interação RIA disponíveis na Web ainda não são acessíveis por usuários com deficiências ou mobilidade reduzida. Por esta razão, este minicurso visa apresentar alguns dos principais conceitos usualmente aplicados para avaliação de usabilidade e acessibilidade RIA; ele abrange perspectivas sobre referenciais práticos e teóricos, a partir de Padrões de Qualidade até implementação de conteúdos para aplicações Web. A abordagem deste minicurso cobriu práticas sobre principais técnicas de codificação RIA, e roteiros para métodos de avaliação de acessibilidade e usabilidade como Avaliação Heurística e Testes com Usuários. Este minicurso foi desenvolvido para novatos e profissionais …", "num_citations": "2\n", "authors": ["585"]}
{"title": "Exploring smart environments through human computation for enhancing blind navigation\n", "abstract": " In this paper the orchestration of wearable sensors with human computation is explored to provide map metadata for blind navigation. Technological navigation aids for blind must provide accurate information about the environment and select the best path to reach a chosen destination. Urban barriers represent dangers for the blind users. The dynamism of smart cities promotes a constant change of these dangers and therefore a potentially “dangerous territory” for these users. Previous work demonstrated that redundant solutions in smart environments complemented by human computation could provide a reliable and trustful data source for a new generation of blind navigation systems. We propose and discuss a modular architecture, which interacts with environmental sensors to gather information and process the acquired data with advanced algorithms empowered by human computation. The gathered …", "num_citations": "2\n", "authors": ["585"]}
{"title": "Panorama of the accessibility add-ons use in Firefox\n", "abstract": " This paper is based on the add-ons directed to accessibility, an essential requirement nowadays. The purpose is to analyze Firefox and its set of options that facilitates the navigation to specific groups of the society formed by disabled people. To facilitate the comprehension and analysis, these groups were divided in three types of deficiencies: visual, physical and cognitive. Thus, the Firefox add-ons were analyzed in order to verify its use and so, provide support related to accessibility issues. The points observed were classified according their utility, their relevance related to help the developers and the deficiency type addressed.", "num_citations": "2\n", "authors": ["585"]}
{"title": "Improving multimodal interaction design with the MMWA authoring environment\n", "abstract": " Multimodal Interfaces are designed to increase the human-machine communication bandwidth and to enhance user's satisfaction and task completion efficiency by providing a more natural way of interacting with computers. In contrast, developing multimodal interfaces is still a difficult task due to the lack of tools that consider not only code generation, but usability of such interfaces. In this paper, we present the MultiModal Web Approach's authoring environment, whose main goal is enhancing the dissemination of knowledge used in a project for future developments that are benefited by proven solutions to recurring problems in the multimodal context.", "num_citations": "2\n", "authors": ["585"]}
{"title": "MMWA-ae: boosting knowledge from Multimodal Interface Design, Reuse and Usability Evaluation.\n", "abstract": " The technological progress designing new devices and the scientific growth in the field of Human-Computer Interaction are enabling new interaction modalities to move from research to commercial products. However, developing multimodal interfaces is still a difficult task due to the lack of tools that consider not only code generation, but usability of such interfaces. In this paper, we present the MultiModal Web Approach and its authoring environment, whose main goal is boosting the dissemination of project knowledge for future developments benefited by the solutions to recurring problems in that multimodal context.", "num_citations": "2\n", "authors": ["585"]}
{"title": "Uma ferramenta para edição colaborativa de diagramas em wikis\n", "abstract": " Wikis are web applications that allow a very productive way for collaborative authoring and communication over the internet. In addition, they have limitations to edit some kinds of contents, since the edition must be a very simple proccess not hindering the participation of less skilled people. This work proposes a new method to insert/edit diagrams on wiki pages. Pursuing to make the editing task simple and incremental, the proposed approach allows editing a diagram from its last state, instead of replacing it with a completely new one. In this paper we present: the developed tool, WebDia, and the proccess of integration with the wiki MediaWiki. We also show a comparison between the required tasks to update a diagram on a wiki page,\" with\" and\" without\" using WebDia. It was possible to analyse the potential of editing vector graphics within a web browser, and to show an easier way of writing wiki articles, making …", "num_citations": "2\n", "authors": ["585"]}
{"title": "Abordagem para o desenvolvimento e avaliação de interfaces multimodais Web pautada em princípios de usabilidade\n", "abstract": " Neste artigo é descrita uma abordagem para facilitar o projeto de interfaces multimodais Web com o objetivo de melhorar a usabilidade e a experiência do usuário por meio de reconhecimento e síntese de voz em conjunto com as interfaces gráficas convencionais. Também é apresentada uma proposta de avaliação heurística que considera princípios multimodais identificados em um estudo de caso. Como resultado, nossas considerações para o projeto, desenvolvimento e avaliação das interfaces multimodais Web são apresentadas.", "num_citations": "2\n", "authors": ["585"]}
{"title": "A Comparative Review of Processes for Research Development on Applied Computing\n", "abstract": " The increasing volume of research projects on applied computing is a motivation for analyzing processes which are used to develop such projects. There are significative differences between research projects on applied computing and industrial software projects, for example, in research domain there is the interest in prototype development instead of product development. As a consequence,definition of specific processes to attend this context is required. Additionally, these processes are relevant because, with the wide spread of the Internet, many researchers are working on collaborative projects from geographically distant areas and an adjusted process can help management overtime of artifacts like models, prototypes, and scientific documents. In this paper, the goal is to provide a comparative review of processes for research development on applied computing, based on requirements described in the …", "num_citations": "2\n", "authors": ["585"]}
{"title": "Levantamento sobre técnicas para desenvolvimento de aplicações web acessíveis.\n", "abstract": " A acessibilidade a informacão é um fator essencial para garantir a inclusão digital e o acesso  à cidadania. Em particular, a acessibilidade na Web tem se tornado um importante topico no contexto da Engenharia de Web, e muitas técnicas tem sido propostas para prover suporte aos desenvolvedores para obter aplicacões  acessíveis. Neste relatorio, é reportado um estudo referente ao estado da arte em técnicas de Engenharia de Web para acessibilidade. A selecão e análise dos estudos foi efetuada por  meio de atividades selecionadas do método de revisão  sistemática. Os resultados incluem a análise obtida por meio da síntese de 53 estudos, selecionados de um conjunto inicial de 844. A partir dos dados analisados nesta pesquisa, pode-se concluir que as pesquisas em técnicas para Acessibilidade na Web tem crescido recentemente. Apesar de haver muitas técnicas para projeto e avaliacão de acessibilidade de aplicacões Web, o estudo também indica diversas atividades relacionadas a Engenharia de Web que tem pouco ou nenhum suporte de técnicas.", "num_citations": "2\n", "authors": ["585"]}
{"title": "VersionWeb: a tool for open source software development support\n", "abstract": " The amount of communities dedicated to software development has grown up stimulated by the support provided by Internet. Although the Web freedom has its benefits, the communities face lack of organization and privacy when using versions control systems. This paper proposes functional increments in a tool that tackle the requirements of providing access control and different types of users and consequently gives support to groups of software developers.", "num_citations": "2\n", "authors": ["585"]}
{"title": "Avaliaçao e Re-engenharia da Interface de Uma Aplicaçao Web de Acordo com Normas de Acessibilidade\n", "abstract": " A difusao do uso da web e a diversificaçao dos meios de acesso tem sido motivaçao para o estabelecimento e disseminaçao de padroes para a publicaçao de conteudo acessıvel aos usuarios, independente da tecnologia utilizada, ou de possıveis deficiencias fısicas que ele possua. Neste artigo, e discutida a avaliaçao de acessibilidade de No Risk Planning, uma agenda web para grupos, de acordo com as normas do Web Content Accessibility Guidelines (WCAG) do W3C, assim como a atividade de re-engenharia das suas interfaces.", "num_citations": "2\n", "authors": ["585"]}
{"title": "Documentação do software DocRationale.\n", "abstract": " Documentação do software DocRationale. USP USP Repositório Institucional ICMC Documentação do software DocRationale. Repositório Digital Entrar Sobre | Políticas | Créditos Repositório Digital → Repositório Institucional ICMC → Publicações do ICMC → Ver Item Documentação do software DocRationale. Lara, Silvana Maria Affonso de; Fortes, Renata Pontin de Mattos URI: http://repositorio.icmc.usp.br//handle/RIICMC/6850 Data: 10/2004 Descrição/resumo: [ sem resumo ] Apresentar o registro completo Arquivos neste Item Thumbnail Nome: relatorio_239.pdf Tamanho: 38.73Mb Formato: PDF Visualizar/Abrir Este Item aparece na(s) seguinte(s) Coleção(ões) Publicações do ICMC [334] Busca Busca Nesta coleção Visualizar Todo o Repositório Digital Comunidades e coleções Data Todos os autores Autores USP Título Assunto Esta coleção Data Todos os autores Autores USP Título Assunto Minha conta …", "num_citations": "2\n", "authors": ["585"]}
{"title": "Requisitos de Hiperdocumentos de suporte ao domínio de Engenharia Reversa de Software.\n", "abstract": " Este trabalho apresenta os requisitos funcionais identificados no processode Engenharia Reversa de Software que possam ser suportados por um SistemaHipertexto. Por meio da modelagem conceitual e navegacional do domíniode informações relativas ao método de engenharia reversaFusion-RE/I, foram estabelecidos os requisitos funcionais de um aplicativohipermídia de suporte ao método, de forma a nortear o engenheirode software responsável pelo processo de engenharia reversa e possibilitaro acompanhamento da evolução desse processo.", "num_citations": "2\n", "authors": ["585"]}
{"title": "Teaching-learning practices and methods for the elderly: support for pedagogical and accessibility guidelines\n", "abstract": " This research full paper presents an investigation on pedagogical practices and educational methods used by professionals who work in the teaching of the elderly. The study of the ageing process is one of the most significant research trends of the 21st century and represents new social, educational and computational challenges. Increased life expectancy and the number of elderly elevate the heterogeneity in the segment, beyond the age. This research focuses on education and mobile learning (m-learning) application. Considering the elderly audience, it is necessary to develop m-learning apps based on accessibility and pedagogical proposals, since the elderly may have their physical and cognitive abilities compromised due to age. Currently, there are consolidated accessibility guidelines for software development. However, these guidelines do not regard cognitive, language and learning disabilities. These …", "num_citations": "1\n", "authors": ["585"]}
{"title": "Acc-MobileCheck: a Checklist for Usability and Accessibility Evaluation of Mobile Applications\n", "abstract": " Mobile devices have gained more attention from the society that is using them increasingly for a variety of purposes. For complete insertion of the population in this constant digital evolution it is fundamental that mobile applications also offer access to different user profiles, regardless of their disabilities or limitations. Considering quality, productivity, and speed of application creation, there is a wide range of good development practices and evaluations. However, methods that involve usability and accessibility are still developing. The purpose of this article is to present the Acc-MobileCheck, which is a checklist of accessibility and usability for mobile devices apps, based on good software development practices and guided by Design Patterns. It aims to address difficulties that can be faced by people with hearing, visual, intellectual, or mobility impairment. Five experts and three developers of mobile apps had evaluated the Acc-MobileCheck. The conclusive results show that the checklist is usable and includes essential issues for the evaluation of accessibility and usability. The data obtained allowed a restructuring of the evaluation method developed, and the positive comments about the checklist demonstrate its adequacy to attend the demand.", "num_citations": "1\n", "authors": ["585"]}
{"title": "Computing in smart toys and the related Internet of Things (IoT) applications\n", "abstract": " Toys have been a part of human existence for thousands of years, across every culture, being uncovered from as far back as ancient Egyptian times. A toy is an item or product intended for learning or play, which can have various benefits to childhood development. Children's toys have become increasingly sophisticated over the years, with a growing shift from simple physical products to toys that engage the digital world as the Internet of Thing (IoT). Toy makers are seizing this opportunity to develop products that combine the characteristics of traditional toys such as dolls and stuffed toys with computing software and hardware called Smart Toys. A smart toy is defined as a device consisting of a physical toy component in an electronic form that connects to a computing system with online services through networking and sensory technologies to enhance the functionality of a traditional toy [1],[2]. A smart toy can easily …", "num_citations": "1\n", "authors": ["585"]}
{"title": "Automatic Identification of Widgets and their Subcomponents Based on a Classification Pipeline for DOM Mutation Records\n", "abstract": " Since Web 2.0, web developers have increased the use of more sophisticated interaction mechanisms and visual effects, called widgets, to design the Rich Internet Applications'(RIA) user interface. However, many of the widgets currently available on websites do not implement accessibility design solutions standardized in the Accessible Rich Internet Applications (ARIA) specification and hence they are not accessible to disabled people. This paper come up with an approach for automatically classifying dropdown menu widgets and their subcomponents using a machine learning pipeline which analyses mutations that occur in RIAs' Document Object Model (DOM) structure, triggered by users interactions or visual effects. Classifying widgets and their subcomponents is an essential step for automatic evaluation of ARIA conformance and HTML code adaptation to mitigate accessibility issues. Thus, we also aim to …", "num_citations": "1\n", "authors": ["585"]}
{"title": "A4U-an approach to evaluation considering accessibility and usability guidelines\n", "abstract": " The Web presents an extensive information content available to diverse people, with different abilities and needs. For this reason, the evaluation for the universal accessibility and the usability are difficult tasks, even though having automatic tools to support them. In this context, it is also observed that the relationship between usability attributes and accessibility is too little explicitly considered, consisting of a research issue to be investigated. To support the integrated evaluation of accessibility and usability criteria, it was developed an environment for analyzing results of accessibility and usability assessments, thus allowing human evaluation, and the inclusion of evaluation results generated by semi-automatic tools, leading the evaluator to produce improvements on both fronts. We performed a case study, in which we observed the difficulties of inexperienced developers related to the description of the guidelines …", "num_citations": "1\n", "authors": ["585"]}
{"title": "Gestural interaction for accessibility of web videos: a case study analysis with blind and visually impaired users\n", "abstract": " This article describes a gestural interaction case study conducted with 36 blind and visually impaired users. Task-based user evaluations were undertaken on three phases to answer the question: Can gesture interactions improve the experience of blind or visually impaired users for Web videos accessibility? After the study case analysis, 97% of the users would use a gestural interface and 92% preferred gesture interaction compared to the usual interaction. To obtain the conclusions, the variables were analyzed by comparisons of percentages and chi-square test.", "num_citations": "1\n", "authors": ["585"]}
{"title": "AMeG: Accessible Menu Generator-Manual técnico e operacional\n", "abstract": " Atualmente, devido à popularização da Internet, grande parte das tarefas diárias (compras, movimentações financeiras, comunicação entre as pessoas, etc.) passaram a ser desempenhadas por meio da Web, tornando-a indispensável na rotina da maioria das pessoas. Assim, com o crescimento do número de usuários e de recursos oferecidos na Web, a acessibilidade passou a ser um fator muito importante, tendo em vista o caráter essencial de se promover a inclusão digital de pessoas com deficiências ou com restrições temporárias de mobilidade.Segundo dados do XII Censo Demográfico realizado pelo Instituto Brasileiro de Geografia e Estatística (IBGE) em 2010 1, 45, 6 milhões de brasileiros possuíam algum tipo de deficiência. Esse número representa cerca de 23, 91% de toda a população do país. Entretanto, a obtenção de interfaces que satisfaçam e possibilitem que todos os usuários, em especial aqueles que possuem algum limitação temporária ou permanente, realizem suas tarefas não é simples, visto a diversidade de perfil das pessoas e suas diferentes necessidades (NICHOLL, 2001).", "num_citations": "1\n", "authors": ["585"]}
{"title": "Awmo: Accessible web modeler\n", "abstract": " Com o aumento do uso das atividades de modelagem em processos de desenvolvimento de software, a participação de pessoas com deficiência visual em tais processos fica comprometida. Os modelos são em sua maioria visuais e, portanto, seu processo de construção requer o posicionamento de elementos no espaço do documento por meio de um dispositivo de apontar com o mouse e sua leitura requer o uso da visão. Neste contexto foi desenvolvida ferramenta Web que possibilita a edição de modelos de software por meio de duas visões equivalentes: uma visão gráfica, tradicional e outra textual, totalmente compatível com leitores de tela. Um estudo de caso foi conduzido com o objetivo de avaliar a efetividade da visão textual para possibilitar que deficientes visuais construam e alterem modelos de software de maneira independente e os resultados indicam que a abordagem é funcional e possui potencial para ser utilizada profissionalmente por engenheiros de software, quer sejam ou não deficientes visuais.", "num_citations": "1\n", "authors": ["585"]}
{"title": "Facilitas: an accessible video player\n", "abstract": " Recently, the production and availability of multimedia Web content, as videos, have increased. In this scenario it is important to consider accessibility requirements so any user can whelm the barriers to access content regardless of limitations imposed. One of the main barriers found is to make videos accessible on the Web but few researches have been made on how to overcome those limitations. In this paper we describe a video player, called Facilitas, designed in order to provide the rationale of how some of video related barriers or limitations could be overcome. Facilitas player has new controls different from the ones in other players. We describe a user testing to explain which controls participants frequently use to complete a task. Finally, results are discussed.", "num_citations": "1\n", "authors": ["585"]}
{"title": "Accessibility approach to Web applications development: An Experimental Study\n", "abstract": " Despite the number of studies available in the literature, about the use of accessibility during Web application development, there are some gaps related to lack of empirical results about it, and so, accessibility barriers are intrinsically present in the organizational culture. In order to contribute to the accessibility domain, we developed an approach used to provide support and facilitate the use of accessibility during Web applications development. In this paper, we presented the results identified through the use of such approach in a controlled experiment. In this sense, we could verify the benefits and drawbacks with the use of it, and so propose improvements for it. This experiment was carried out with the contribution of participants, which were divided in two groups. We understand that such scenario may not enable us to generalize our findings to a diversity of scenarios, however, this study could serve as an initial point towards validating our approach, and may serve to establish baseline values for future studies.", "num_citations": "1\n", "authors": ["585"]}
{"title": "AccessibiltyUtil. com: uma ferramenta para colaboração de experiências de acessibilidade na web\n", "abstract": " Atualmente as diretrizes existentes sobre como se desenvolver com acessibilidade não são aplicadas em muitos processos de criação de aplicações web. Um dos motivos mais significativos para isso é a falta de “proximidade” dessas diretrizes com os desenvolvedores, que não as conhecem ou consideram difícil aplicá-las. Como uma proposta de solução para aproximar a prática de desenvolvimento às guidelines, é apresentada a ferramenta colaborativa AccessibilityUtil. com, que permite compartilhamento e difusão de experiências em acessibilidade na web, relacionadas com as técnicas na produção de artefatos de desenvolvimento web, seguindo as diretrizes WCAG 2.0 (W3C).", "num_citations": "1\n", "authors": ["585"]}
{"title": "Acessibilidade para Adultos de Meia-Idade e Idosos em e-Commerce\n", "abstract": " Com a evolução da Internet, que oferece atualmente uma ampla variedade de serviços que ultrapassam os limites do entretenimento e da comunicação, os adultos de meia-idade e os idosos que a utilizam podem usufruir vários benefícios, tais como: compras, bancos on-line, serviços governamentais e informações de forma geral, de modo a preservar sua autonomia e independência funcional na realização das suas tarefas diárias. Mas, apesar de todos os benefícios que podem ser obtidos por meio da Web, existe ainda grande resistência por parte dos adultos mais velhos em utilizá-la. A acessibilidade na web se destina a, além de prover meios para que pessoas com necessidades especiais possam utilizá-la de forma natural e independente, àquelas pessoas cuja interação constitui uma barreira intransponível, seja pela insegurança, por medo ou pelo simples preconceito de que é muito difícil aprender algo relacionado à tecnologia. Este trabalho propõe uma abordagem para a elaboração de uma interface acessível para um site de comércio eletrônico para o público mais velho, visando fornecer apoio em praticamente todos os passos da interação como forma de minimizar as diferenças de performance com relação ao público jovem.", "num_citations": "1\n", "authors": ["585"]}
{"title": "Support for collaboration in wikis using graphical modeling to achieve improvements in information architecture and accessibility\n", "abstract": " Wiki is a collaborative tool for designing web communications allowing users to edit, add or revise content through a web browser. Despite of various benefits offered by the wikis use, there is no guarantee of a good structure of its content. This occurs especially by the difficulty to graphically visualize the information architecture. In this paper is proposed a Model-Driven Development (MDD) approach that supports creating graphical models of namespaces to generate wikis and facilitates the collaboration organization. Finally, the approach also aims to include accessibility features on models from official W3C guidelines such as WCAG and ATAG, allowing the wiki access by a wider range of user's types.", "num_citations": "1\n", "authors": ["585"]}
{"title": "Design of communication in multimodal web interfaces\n", "abstract": " In this paper we present our considerations for the design, development and evaluation of Web multimodal interfaces using as example the analysis and the results of three Case Studies. Two usability methods were applied in these Case Studies as part of our approach for Web multimodal interfaces design. The objective is to smooth the progress of the design activities provided by the Multimodal Web Approach (MMWA) recovering Design Rationale from previous projects and improving the usability and user experience in the multimodal interaction. From the experience got performing three case studies with the MMWA, we derive a general framework for design of communication in Web Multimodal Interfaces.", "num_citations": "1\n", "authors": ["585"]}
{"title": "Facilita: helping the reading of texts available on the web\n", "abstract": " Although there are recently multiple ways of delivering media on the web, most web contents are still mainly presented in the textual form. The heavy use of texts pose an accessibility barrier to those who do not read fluently because of both the length and linguistic complexity of the written texts. To deal with that barrier, this paper presents the Facilita, an assistive technology to help lower literacy users to comprehend web applications' textual content. Facilita automaticallygenerates accessible content from web pages, using syntactic simplication and summarization techniques. It is also described the use of technologies aiming at keeping users interactions simple, since lower literacy users, frequently, also show lower computer skills.", "num_citations": "1\n", "authors": ["585"]}
{"title": "Implantação de Acessibilidade em Organizações de Software\n", "abstract": " A revolução tecnológica tem promovido a disseminação da informação cada vez mais precisa e rápida, além de se tornar um importante meio de negócio, educação e entretenimento. Porém, problemas relacionados à acessibilidade do conteúdo tem sido um fator preponderante para a exclusão de pessoas com deficiência. Neste contexto, este mini-curso pretende explorar elementos de acessibilidade de sistemas de software e, principalmente, as atividades que uma organização deve cumprir para ainstitucionalização da acessibilidade.", "num_citations": "1\n", "authors": ["585"]}
{"title": "Uma abordagem de MDA para gerenciamento de handover ciente de contexto e embasado por feedback\n", "abstract": " Next Generation Networks should allow mobile users to switch network (handover) according to requirements of quality of service attributes while improving the user's experience in the network. In this paper we propose the use of MDA (Model Driven Architecture) to support the management of\" handover aware of context and based on feedback\". We develop an environment comprised of a networks modeling tool that takes into account context information, called Context Case. This tool makes a service in charge of collecting and presenting, via Web services, information which we call Wireless Footprint. The service is responsible for registering a number of network attributes which are important to keep the user in a topology ABC (Always Best Connect). We present our proposal in the context of a literature review, and include the application of the environment in a typical scenario.", "num_citations": "1\n", "authors": ["585"]}
{"title": "Esteganografia em vídeos: um estudo sobre o estado da arte.\n", "abstract": " A crescente preocupacão com privacidade dos dados trafegados pela Internet tem levado à pesquisas que visam manter o sigilo dos mesmos. Para este fim, tradicionalmente, tem-se utilizado técnicas de criptografia. Outra técnica que vem crescendo atualmente é a esteganografia, usualmente aplicada a imagens. A implementacão de esteganografia em vídeos digitais, possibilita o ocultamento de uma quantidade maior de informações  enquanto mantém o sigilo dos mesmos. Este relatório técnico apresenta um estudo aprofundado de técnicas de compressão em imagens e vídeos e descreve uma revisão sistemática sobre o tema de esteganografia em vídeos visando evidenciar o estado da arte de pesquisa na área.", "num_citations": "1\n", "authors": ["585"]}
{"title": "Um framework web colaborativo baseado em ontologias para recuperaçao e descoberta de conhecimento em imagens médicas\n", "abstract": " Imagens médicas têm sido utilizadas como uma opçao fundamental para visualizar de uma forma nao-invasiva as estruturas dos corpos de pacientes. Devido ao crescimento em quantidade e em complexidade de exames digitais, a tarefa de encontrar um subconjunto de imagens interessante para uma pesquisa médica tem se tornado difıcil. Entretanto, essa tarefa pode ser facilitada através do uso de recuperaçao de imagens baseada em conteúdo, de processos de descoberta de conhecimento e de ontologias para representaçao de informaçao semântica. Estas técnicas possibilitam a realizaçao", "num_citations": "1\n", "authors": ["585"]}
{"title": "Whiteboard: a collaborative pen-based annotation tool for e-learning\n", "abstract": " The Whiteboard is a synchronous, collaborative annotation tool that captures pen-based annotations during an e-learning session and produces corresponding documents for review. This tool has been developed by the Intermidia development team in the context of the TIDIA-Ae Project", "num_citations": "1\n", "authors": ["585"]}
{"title": "Separaçao entre Logica, Conteudo e Layout-um Estudo de Caso de Implementaçao em uma Aplicaçao Web\n", "abstract": " Alternativas de soluçoes tecnologicas para desenvolvimento de aplicaçoes web com qualidade e de forma produtiva tem sido alvo de diversos esforços recentes.“Separaçao de Interesses” é uma abordagem que visa concentrar os focos das aplicaçoes web (conteudo, layout e logica) de maneira que possam ser independentemente desenvolvidos. No entanto, para desenvolver aplicaçoes web utilizando essa abordagem de separaçao de interesses, e necessario que sejam utilizadas ferramentas adequadas para tratar, de maneira independente, os elementos de informaçao da aplicaçao. Neste artigo, e apresentada uma soluçao simplificada para efetuar a separaçao de interesses por meio de uma abordagem baseada no uso de linguagens de script, processadores de templates e processadores de XSLT, aplicada durante a implementaçao de No Risk Planning, uma aplicaçao web de agenda para grupos.", "num_citations": "1\n", "authors": ["585"]}
{"title": "Consideraç oes sobre controle de grupos em repositórios CVS durante a evoluç ao de uma ferramenta web\n", "abstract": " To perform version control activities at Open Source projects, systems as CVS are often used. However, considerable extra efforts are made to ensure that users control has been made in such projects, and in many cases the desired control is not reached. VersionWeb is a tool that is being evolved to ease the versions control activities and to provide a better users control at Open Source projects development. This tool shall work as an extra layer to CVS.Resumo. Para realizar as atividades de controle de versoes nos projetos de Software Livre, sistemas como CVS sao freqüentemente utilizados. No entanto, grande esforço extra é necessário para se fazer o controle de usuários nesses projetos, e, muitas vezes, o controle desejado nao é alcançado. VersionWeb é uma ferramenta que está sendo evoluıda para facilitar as atividades de controle de versoes e prover melhor controle de usuários no desenvolvimento de projetos de Software Livre, funcionando como uma camada extra do CVS.", "num_citations": "1\n", "authors": ["585"]}
{"title": "Introdução ao uso de CVS (concurrent version system).\n", "abstract": " Introdução ao uso de CVS (concurrent version system). USP USP Repositório Institucional ICMC Introdução ao uso de CVS (concurrent version system). Repositório Digital Entrar Sobre | Políticas | Créditos Repositório Digital → Repositório Institucional ICMC → Publicações do ICMC → Ver Item Introdução ao uso de CVS (concurrent version system). Paiva, Débora Maria Barroso; Junqueira, Daniel Carnio; Fortes, Renata Pontin de Mattos URI: http://repositorio.icmc.usp.br//handle/RIICMC/6887 Data: 09/2002 Descrição/resumo: [ sem resumo ] Apresentar o registro completo Arquivos neste Item Thumbnail Nome: relatorio_172.pdf Tamanho: 7.485Mb Formato: PDF Visualizar/Abrir Este Item aparece na(s) seguinte(s) Coleção(ões) Publicações do ICMC [334] Busca Busca Nesta coleção Visualizar Todo o Repositório Digital Comunidades e coleções Data Todos os autores Autores USP Título Assunto Esta coleção …", "num_citations": "1\n", "authors": ["585"]}
{"title": "Ferramenta DB-LiOS para Avaliação de Reuso de links em WWW\n", "abstract": " A dinâmica e a flexibilidade da autoria de hiperdocumentos na Web, por um lado popularizam a cada dia o uso da Internet, mas por outro, propiciam que facilmente muitas informações fiquem inconsistentes. Basta uma definição errônea de um hiperlink 2, para que o usuário se depare com uma inconsistência e se sinta “perdido”. Um procedimento comum durante o desenvolvimento de um site 3 é a reutilização dos componentes de link, seja por haver na mesma página origem mais de um link, ou o mesmo rótulo de link em diversas páginas, ou ainda vários links para uma mesma página destino. Como um site, geralmente, contém uma grande quantidade de links, torna-se inviável a verificação manual da reusabilidade de seus links. A ferramenta DB-LiOS foi desenvolvida com o objetivo de automatizar a verificação da reusabilidade de links de um site da Web, através de processos de extração e classificação de links. Com a utilização de DB-LiOS, os autores de um site podem obter um auxílio efetivo para avaliação da consistência de seus links.", "num_citations": "1\n", "authors": ["585"]}
{"title": "Aspectos de Validação do Método de Engenharia Reversa Fusion-RE/I aplicado a um Sistema Hipermídia\n", "abstract": " The growth of the software market has leading to an increasing use of development techniques, which are, sometimes, informal ones. The maintenance of such software is problematic, since its documentation rarely reflects the implemented code. In this context Reverse Engineering of Software can help by means of recovering the project information lost during the development phase and documenting the current software state. This article discusses the issues emerged during the application of the method of reverse engineering named Fusion-RE/I. The described experiment is part of the re-engineering of a prototype hypermedia system, which has, as main goal, to adapt it to a Software Engineering domain. Since the target is a hypermedia system, the results obtained during the use of Fusion-RE/I can be registered as a hyperdocument. By doing that, it is possible to observe and analyse some relevant issues concerning the method Fusion-RE/I.", "num_citations": "1\n", "authors": ["585"]}
{"title": "Supporting Structured Teaching Material in the WWW1\n", "abstract": " This paper presents aspects of modelling, authoring and presenting structured documents corresponding to teaching material presented in the World Wide Web. In this context, it is discussed the importance of providing the formalization of the structure of the documents using SGML. Specifications for structured documents corresponding to didactic texts and questionnaires in SGML are described. Software tools to the authoring and presentation of those documents are also presented in order to manipulate and delivery them in the Web, showing an effective support for structured web teaching material.", "num_citations": "1\n", "authors": ["585"]}
{"title": "Documentation Process in Interactive Systems–A Case Study to Abstract its Structure\n", "abstract": " The difficulties on leading with a variety of docu-ments during software processes by teams of software developers have been addressed in relevant researches, and Web technologies have emerged bringing new solutions that must be considered. In this context, we report a case study regarding to the process of analyzing and structuring documentation produced by 20 student groups who have developed different projects as a task for an HCI (Human-Computer Interaction) course. Consequently, a DTD could be defined. The result, as a structured set of documents, has being re-written according to XML-DTD specification to be available for improved searching and ex-changing tasks, commonly performed by software developers. Finally, the process of abstracting such structure based on existing documents was concluded to be an iteractive activity, corresponding to alternate between bottom-up and top-down approaches.", "num_citations": "1\n", "authors": ["585"]}
{"title": "Educational FACILITA: helping users to understand textual content on the Web\n", "abstract": " In this paper, we present a solution combining a Web technology and Natural Language Processing (NLP) systems to adapt web content for poor literacy readers. Particularly, we explore the NLP tasks of lexical elaboration and named entity labeling.", "num_citations": "1\n", "authors": ["585"]}