{"title": "Defining, measuring, and facilitating intercultural learning: a conceptual introduction to the Intercultural Education double supplement\n", "abstract": " If you do not already think so, the papers in this volume will convince you that study abroad has changed. At the university level, it has transcended its history as a ‘grand tour’for the leisure class and the more plebian ‘junior year abroad’. Now university study abroad encompasses massive mobility of students among European Union universities and to and from the US and other countries through a myriad school-based and consortia-based programs. At the secondary (high school) level, the traditional AFS Intercultural Programs year in the US or Europe has been expanded by AFS and other organizations to include shorter programs to and from a broader range of countries. Added to the change in format and destination are educational foci that go well", "num_citations": "349\n", "authors": ["1147"]}
{"title": "Automating mappings between use case diagrams and feature models for software product lines\n", "abstract": " Features have been widely used by the product line community to model variability. They represent the common and variable characteristics of the members of a product line. They are very well suited for the configuration of product line members. Outside the product line community, use cases are also widely used to model the functionality of systems at a similar level of abstraction but from a user perspective. Significant work has been done by several authors regarding the possible relationship between these two perspectives of a system. Nonetheless, this has been done in an informal way. In this paper we explore the relationships between these two perspectives and describe a possible approach to automate the transformation from UML use case to feature models.", "num_citations": "70\n", "authors": ["1147"]}
{"title": "Modeling industrial embedded systems with UML\n", "abstract": " The main purpose of this paper is to present how the Unified Modeling Language (UML) can be used for modeling industrial embedded systems. By using a car radios production line as a running example, the paper demonstrates the modeling process that can be followed during the analysis phase of complex control applications. In order to guarantee the continuity mapping of the models, the authors propose some guidelines to transform the use case diagrams into a single object diagram, which is one of the main diagrams for the next development phases.", "num_citations": "67\n", "authors": ["1147"]}
{"title": "Transformation of UML models for service-oriented software architectures\n", "abstract": " The main aim of this paper is to present how to transform user requirements models into a software architecture for mobile applications. The technique (called \"4SRS\") is essentially based on the mapping of UML use case diagrams into UML object diagrams. UML sequence, activity, and state diagrams and other artifacts can also be considered within the transformation decisions. The applicability of this technique is illustrated by presenting some results from an e-government mobile application. The development of mobile applications typically follow a service-oriented approach. A service is a software entity running on one or more machines and providing a particular type of function to a priori unknown clients. These services must communicate with each other, whose combination makes up a service-oriented architecture. The communication can involve either simple data passing or it could involve two or more …", "num_citations": "59\n", "authors": ["1147"]}
{"title": "Extending UML 2.0 metamodel for complementary usages of the/spl Lt/extend/spl Gt/relationship within use case variability specification\n", "abstract": " Software product lines and related approaches, like software factories, are starting to capture the attention of the industry practitioners. Nevertheless, their adoption outside the research community and big companies is still very restricted. We believe that model-driven approaches, like OMG's MDA, with proper tool support, can bring the advantages of product lines to a broader audience. For this to become a reality, model-driven methods should integrate requirements models into the software development process. In this paper, we discuss the semantics of use case relationships and their formalization using activity diagrams to support variability specification. Particularly, we propose an extension to the LtextendGt relationship that supports the adoption of UML 2.0 use case diagrams into model-driven methods. Our proposal results from our work with 4SRS (4 step rule set), a model-driven method in which use …", "num_citations": "53\n", "authors": ["1147"]}
{"title": "Requirements in engineering projects\n", "abstract": " Nowadays, software and systems engineers are facing many challenges when they develop new systems. Society is expecting those systems to have high quality, provide exciting functionalities, and be produced at low cost. To cope with the growing complexity and diversity of engineering problems, the adoption of systematic and disciplined approaches to deal with requirements is of paramount importance. Over the past years, researchers and practitioners, most notably from the software and information systems domain, have contributed to create an extensive body of knowledge related to the engineering and management of requirements.Although requirements engineering has essentially grown in the software and information systems domain, this book aims to have a broader perspective, since the process of characterising, for instance, a building, automobile, boat, or house includes many similar issues to …", "num_citations": "51\n", "authors": ["1147"]}
{"title": "From business process modeling to data model: A systematic approach\n", "abstract": " Business process modeling and management approaches are increasingly used and disclosed between organizations as a means of optimizing and streamlining the business activities. Among the various existing modeling languages, we stress the Business Process Model and Notation (BPMN), currently in version 2.0. BPMN is a widespread OMG standard that is actually used either in academia and in organizations. BPMN enables business process modeling, but does not facilitate the modeling of the information infrastructure involved in the process. However, interest in the data and its preservation has increased in BPMN's most recent version. The aim of this paper is to study BPMN 2.0, particularly on the usage and persistence of data, and present an approach for obtaining an early data model from the business process modeling, which may then be used as a starting data model in the software development …", "num_citations": "40\n", "authors": ["1147"]}
{"title": "Mapping RUP roles to small software development teams\n", "abstract": " In the last decades the complexity of software development projects had a significant increase. This complexity emerges from the higher degree of sophistication in the contexts they aim to serve and from the evolution of the functionalities implemented by the applications However, many software corporations have a reduced dimension (micro, small or medium) which imposes a considerable constraint to the number of individuals that might be involved in each project. This limitation has obvious consequences to the individual’s efficiency and effectiveness. In this paper we describe a Rational Unified Process (RUP) tailoring to simplify the number of RUP roles. With this tailoring we obtain one set of RUP roles that, without neglecting any critical role of the software development process, may easily be adopted by a small or medium software development team. In this paper, we present and justify a complete …", "num_citations": "40\n", "authors": ["1147"]}
{"title": "A program and project management approach for collaborative university-industry R&D funded contracts\n", "abstract": " This paper presents a new program and project management (PPM) approach especially devoted to support collaborative university-industry R&D funded contracts. While the literature provides some advice on how to embark on designing such PPM approach, university-industry collaboration contexts require specific guidance. The research described in this paper aims to make some contribution to theory as well as to practice by discussing the PPM approach adoption in a case study collaborative university-industry R&D funded contract between the University of Minho and Bosch Car Multimedia Portugal S.A., named – HMIExcel. The results show that emphasis should be given to structured objective setting, good progress monitoring and effective communication. The research study is ongoing through the use of a questionnaire and focus groups, in order to improve the presented PPM approach conceptualization.", "num_citations": "39\n", "authors": ["1147"]}
{"title": "The roles of a Programme and Project Management Office to support collaborative university–industry R&D\n", "abstract": " While the literature provides some advice on managing programmes and projects in general, the specific context of the university–industry collaboration is being scarcely reported, demanding a strong research effort to produce effective guidelines. Pursuing this effort, a Programme and Project Management Office (PgPMO) structure, specifically devoted to support collaborative university–industry R&D funded contracts, is proposed. This paper is focused on the set of key functions and responsibilities established for the overall PgPMO, as well as on the equivalent ones for the four proposed PgPMO roles: the PgPMO Officer, PgPMO Finance, PgPMO Communication and PgPMO Quality Assurance Management. Additionally, it discusses the implementation process of such structure, shedding light on the success factors for its implementation. The PgPMO described in this paper has been implemented in two case …", "num_citations": "37\n", "authors": ["1147"]}
{"title": "Specification of industrial digital controllers with object-oriented Petri nets\n", "abstract": " The main purpose of this paper is to present an object-oriented PN model (shobi-PN) to specify industrial digital controllers. The shobi-PN model (synchronous, hierarchical, object-oriented and interpreted Petri net), was developed to support the use of hierarchy to model both the control unit and the plant of the systems. A CAD environment, SOFHIA, was developed to model digital controllers, to validate their properties and to simulate their behaviour. SOFHIA has an open architecture, which eases the integration of multiple code generator blocks to allow the implementation of the system in a wide range of technologies (hardwired, microprogrammed, programmed). Modelling of an industrial reactor control system is considered as a case study to illustrate the model's applicability and capabilities.", "num_citations": "37\n", "authors": ["1147"]}
{"title": "Effects of roller massager on muscle recovery after exercise-induced muscle damage\n", "abstract": " Two experiments (n = 10) were conducted to determine the effects of roller massager (RM) on ankle plantar flexor muscle recovery after exercise-induced muscle damage (EIMD). Experiment 1 examined both functional [i.e., ankle plantar flexion maximal isometric contraction and submaximal (30%) sustained force; ankle dorsiflexion maximal range of motion and resistance to stretch; and medial gastrocnemius pain pressure threshold] and morphological [cross-sectional area, thickness, fascicle length, and fascicle angle] variables, before and immediately, 1, 24, 48, and 72 h after an EIMD stimulus. Experiment 2 examined medial gastrocnemius deoxyhaemoglobin concentration kinetics before and 48 h after EIMD. Participants performed both experiments twice: with (RM) and without (no-roller massager; NRM) the application of a RM (6 × 45 s; 20-s rest between sets). RM intervention did not alter the functional …", "num_citations": "36\n", "authors": ["1147"]}
{"title": "Local anaesthesia for endovascular repair of infrarenal aortic aneurysms\n", "abstract": " ObjectiveThe study aimed to analyse and report the results of a ‘local anaesthesia first’ approach in elective endovascular aneurysm repair (EVAR) patients.Material and methodsBetween January 2007 and August 2010, a total of 217 continuous patients (187 men, median age 76 years, range 52–94 years) underwent elective EVAR using this approach, with predefined exclusion criteria for local anaesthesia (LA). A retrospective analysis regarding technical feasibility, mortality, complication and endoleak rate was performed. The results are reported as an observational study.ResultsLA was applied in 183 patients (84%), regional anaesthesia (RA) in nine patients (4%) and general anaesthesia (GA) in 25 patients (12%). Anaesthetic conversion from LA to GA was necessary in 14 patients (7.6%). Airway obstruction (n = 4) and persistent coughing (n = 3) were the most common causes for conversion to GA. Thirty-day …", "num_citations": "35\n", "authors": ["1147"]}
{"title": "From business process models to use case models: A systematic approach\n", "abstract": " One of the most difficult, and crucial, activities in software development is the identification of system functional requirements. A popular way to capture and describe those requirements is through UML use case models. A business process model identifies the activities, resources and data involved in the creation of a product or service, having lots of useful information for developing a supporting software system. During system analysis, most of this information must be incorporated into use case descriptions. This paper proposes an approach to support the construction of use case models based on business process models. The proposed approach obtains a complete use case model, including the identification of actors, use cases and the corresponding descriptions, which are created from a set of predefined natural language sentences mapped from BPMN model elements.", "num_citations": "34\n", "authors": ["1147"]}
{"title": "Refinement of software architectures by recursive model transformations\n", "abstract": " The main aim of this paper is to present how to refine software logical architectures by application of a recursive model-based transformation approach called 4SRS (four step rule set). It is essentially based on the mapping of UML use case diagrams into UML object diagrams. The technique is based on a sequence of steps that are inscribed in a tabular representation that is used to derive the software architecture for a focused part of the global system.", "num_citations": "33\n", "authors": ["1147"]}
{"title": "From use cases to objects: an industrial information systems case study analysis\n", "abstract": " Identifying the objects that constitute a software system is a critical task for any object-oriented system development and several techniques have already been introduced to tackle this problem. This paper introduces a new approach to partially solve that problem, based on the use cases that define the system’s functionality. The application of the approach is exemplified with a real industrial case study, which highlights some of the approach’s main characteristics for complex embedded systems development.", "num_citations": "33\n", "authors": ["1147"]}
{"title": "Derivation of process-oriented logical architectures: An elicitation approach for cloud design\n", "abstract": " The benefits of cloud computing approaches are well known but designing logical architectures for that context can be complicated. Prior to designing a logical architecture, a proper requirements elicitation must be executed. When requirements are not properly elicited, and there are insufficient inputs for a product approach to requirements elicitation, a process-level perspective is an alternative way for achieving the intended base requirements for the logical design. Our proposed solution regards the adaptation and extension of the 4SRS (Four-Step-Rule-Set) method to derive logical architectural models, in a process-level perspective. This perspective creates context for the product-level requirements elicitation conducing to cloud design. We present a real industrial case where the method was applied and assessed. The method application results in the creation of a validated architectural model and in …", "num_citations": "32\n", "authors": ["1147"]}
{"title": "Tailoring RUP to small software development teams\n", "abstract": " In the last decades we have been witnessing a significant increase in the complexity inherent to software development projects, due not only to a higher degree of sophistication in the contexts they aim to serve, but also to the natural evolution of the features implemented by the available software systems and applications. However, the reduced dimension of many software corporations imposes a significant constraint to the group of individuals that might be involved in each project, with obvious consequences to their efficiency and effectiveness. This paper describes how to accomplish a configuration of the Rational Unified Process (RUP) in order to obtain one set of RUP roles that, without neglecting any critical role of the software development process, may easily be adopted by a small or medium software development team during the project execution period.", "num_citations": "31\n", "authors": ["1147"]}
{"title": "Inception of software validation and verification practices within CMMI Level 2\n", "abstract": " Validation and verification are mandatory activities that software companies must perform when developing software products with a high degree of quality. Currently, more companies become aware that adopting CMMI (the software process maturity model developed by the Software Engineering Institute) can be a way to develop quality software. However, some companies are resistant to adopt CMMI maturity level 2 because they do not considerer this maturity level a benefit since its implementation is expensive and does not cover the validation and verification efforts. The simultaneous adoption of CMMI maturity level 2 with validation and verification process areas (from maturity level 3) lacks some methodological recommendations, since some dependencies exist between those two CMMI maturity levels. This PhD thesis will propose one approach to conciliate validation and verification practices with of CMMI …", "num_citations": "28\n", "authors": ["1147"]}
{"title": "A requirements engineering and management training course for software development professionals\n", "abstract": " Devising a course for software professionals working in industry depends on several factors. In order to create a course that fulfils professionals' expectations, it is important to take account of the skills of the participants, the time available, and the specific topics to be covered. This paper presents the curriculum of a course in requirements engineering and management intended for software developers with a first-level academic degree in computing and experience in developing real software solutions. This context requires the course to concentrate on topics that were not taught in the participants' previous education and that can have a positive impact on their daily practices.", "num_citations": "28\n", "authors": ["1147"]}
{"title": "Deriving a Data Model from a Set of Interrelated Business Process Models.\n", "abstract": " Business process modeling and management approaches are increasingly used and disclosed between organizations as a means of optimizing and streamlining the business activities. A business process model identifies the activities, resources and data involved in the creation of a product or service, having lots of useful information that can be used to create a data model for the supporting software system. A data model is one of the most important models used in software development. Usually an organization deals with several business processes. As a consequence a software product does not usually support only one business process, but rather a set of business processes. This paper proposes an approach to generate a data model, based on a set of interrelated business processes, modeled in BPMN language. The approach allows aggregating in one data model all the information about persistent data that can be extracted from the set of business process models serving as a basis for the software development.", "num_citations": "27\n", "authors": ["1147"]}
{"title": "Deriving software product line's architectural requirements from use cases: An experimental approach\n", "abstract": " One of the most important artifacts of a product line is the product line architecture. In this paper we present an approach for deriving a product line’s architecture from the requirements of the product line. This approach is based on a transformational technique that has been developed and applied to obtain system architectures from requirements specified as UML use cases. In this paper we evaluate if such a technique can be applied to product lines and, if so, what adaptations are required. For presentation purposes we use the public available IESE report of the GoPhone product line that uses the UML modeling language.", "num_citations": "27\n", "authors": ["1147"]}
{"title": "Specification of requirements models\n", "abstract": " The main aim of this chapter is to present and discuss a set of modeling and specification techniques, in what concerns their ontology and support in the requirements representation of computer-based systems. A systematic classification of meta-models, also called models of computation, is presented. This topic is highly relevant since it supports the definition of sound specification methodologies in relation to the semantic definition of the modeling views to adopt for a given system. The usage and applicability of Unified Modeling Language (UML) diagrams is also related to their corresponding meta-models. A set of desirable characteristics for the specification methodologies is presented and justified to allow system designers and requirements engineers to more consciously define or choose a particular specification methodology. A heuristic-based approach to support the transformation of user into …", "num_citations": "27\n", "authors": ["1147"]}
{"title": "Component-based design: Towards guided composition\n", "abstract": " We present a mathematical model for the composition of software components, at a semantic modelling level. We describe a mathematical concept of a single software component and identify properties that ensure its potential behaviour can be captured. Based on that, we give a formal definition of composition and examine its effect on the individual components. We argue that properties of the individual components can, under certain conditions, be preserved in the composite. The proposed model can be used for guiding the composition of components as it advocates formal reasoning about the composite before the actual composition takes place.", "num_citations": "26\n", "authors": ["1147"]}
{"title": "Requirements validation: Execution of UML models with CPN Tools\n", "abstract": " Requirements validation is a critical task in any engineering project. The confrontation of stakeholders with static requirements models is not enough, since stakeholders with non-computer science education are not able to discover all the inter-dependencies between the elicited requirements. Even with simple unified modelling language (UML) requirements models, it is not easy for the development team to get confidence on the stakeholders’ requirements validation. This paper describes an approach, based on the construction of executable interactive prototypes, to support the validation of workflow requirements, where the system to be built must explicitly support the interaction between people within a pervasive cooperative workflow execution. A case study from a real project is used to illustrate the proposed approach.", "num_citations": "25\n", "authors": ["1147"]}
{"title": "Bridging the Gap between a Set of Interrelated Business Process Models and Software Models.\n", "abstract": " A business process model identifies the activities, resources and data involved in the creation of a product or service, having lots of useful information for starting to develop a supporting software system. With regard to software development, one of the most difficult and crucial activities is the identification of system functional requirements. A popular way to capture and describe those requirements is through UML use case models. Usually an organization deals with several business processes. As a consequence, a software product does not usually support only one business process, but rather a set of business processes. This paper presents an approach that allows aggregating in one use case model all the information that can be extracted from the set of business process models that will be supported by the software under development. The generated use case model serves as a basis for the software development process, helping reducing time and effort spent in requirements elicitation. The approach also helps to ensure the alignment between business and software, and enables traceability between business processes and the corresponding elements in software models.", "num_citations": "24\n", "authors": ["1147"]}
{"title": "A method for measuring the success of collaborative university-industry R&D funded contracts\n", "abstract": " This paper describes a method specially devoted to quantitatively measure the success of collaborative university-industry R&D funded contracts, which could be managed as a singular project or a program of projects. The method aims to measure the success throughout the program/project lifecycle, combining both retrospective (lagging) and prospective (leading) performance indicators. The method uses tangible/specific outcomes as performance indicators, like patents or publications, as well as intangible/subjective performance indicators such as social relationships, organizational arrangements or motivations.The proposed method was conceived by conducting a thorough review of the published literature on this area, and by analyzing, as case studies, two consecutive R&D collaborative funded programs, between University of Minho and Bosch Car Mutimedia, amounting to an overall investment of over 70 …", "num_citations": "22\n", "authors": ["1147"]}
{"title": "Using scrum together with UML models: a collaborative university-industry R&D software project\n", "abstract": " Conducting research and development (R&D) software projects, in an environment where both industry and university collaborate, is challenging due to many factors. In fact, industrial companies and universities have generally different interests and objectives whenever they collaborate. For this reason, it is not easy to manage and negotiate the industrial companies’ interests, namely schedules and their expectations. Conducting such projects in an agile framework is expected to decrease these risks, since partners have the opportunity to frequently interact with the development team in short iterations and are constantly aware of the characteristics of the system under development. However, in this type of collaborative R&D projects, it is often advantageous to include some waterfall practices, like upfront requirements modeling using UML models, which are not commonly used in agile processes like …", "num_citations": "22\n", "authors": ["1147"]}
{"title": "SOFHIA: A CAD Environment to Design Digital Control Systems\n", "abstract": " Petri Nets (PNs) prove to be an efficient methodology to model discrete-event systems with parallel activities. The main advantages lie on the graphical interface and on the availability of a set of techniques for formal analysis, including the validation and the test of the modelled system. A proposal to modify the normal PN behaviour is presented, which aims a fast specification of synchronous parallel digital systems, including both the data path and the control unit. A CAD environment, SOFHIA, was developed to model digital systems, to validate their properties and to simulate their behaviour. The environment includes the automatic generation of VHDL code to allow simulation and synthesis on existing CAD tools.", "num_citations": "22\n", "authors": ["1147"]}
{"title": "Project management practices for collaborative university-industry R&D: a hybrid approach\n", "abstract": " This paper aims to help stakeholders involved in collaborative university-industry R&D initiatives by presenting a hybrid project management (PM) approach, with a set of key distinct PM practices for this particular context.Collaborative university-industry R&D initiatives are usually organized as programs with a set of related projects associated. Therefore, a hybrid PM approach was developed based on a case study research strategy. During the large case study analysis two research methods were applied: participant observation and document analysis.The hybrid management approach was developed based on the contingency theory, which identifies a set of 24 Must Have PM practices, and that are transversal to all projects in the program as the program governance must have to be assured. Additionally, it identifies three different sets of Nice to Have PM practices, which are optional and are dependent on the …", "num_citations": "21\n", "authors": ["1147"]}
{"title": "Molecular‐Level Processing of Si‐(B)‐C Materials with Tailored Nano/Microstructures\n", "abstract": " The design of Si‐(B)‐C materials is investigated, with detailed insight into the precursor chemistry and processing, the precursor‐to‐ceramic transformation, and the ceramic microstructural evolution at high temperatures. In the early stage of the process, the reaction between allylhydridopolycarbosilane (AHPCS) and borane dimethyl sulfide is achieved. This is investigated in detail through solid‐state NMR and FTIR spectroscopy and elemental analyses for Si/B ratios ranging from 200 to 30. Boron‐based bridges linking AHPCS monomeric fragments act as crosslinking units, extending the processability range of AHPCS and suppressing the distillation of oligomeric fragments during the low‐temperature pyrolysis regime. Polymers with low boron contents display appropriate requirements for facile processing in solution, leading to the design of monoliths with hierarchical porosity, significant pore volume, and high …", "num_citations": "20\n", "authors": ["1147"]}
{"title": "Transformation patterns for multi-staged model driven software development\n", "abstract": " Model driven approaches are shifting software development from a code based activity to a model based activity. Models can be refined and transformed from requirements into code specific to a platform. Although several model transformations can occur, they usually take place at a single development stage. In the case of software product lines, and particularly of software factories, the modeling of a system can occur at several stages, for instance, at the software house, at the systems integrator and at the final customer site. Basically, this requires that the model used at a particular stage can be refined at the next stage. In this paper, we explore the issues related to such an approach and we propose model transformation patterns that can be generically applied to models so that they can be used in multi staged modeling approaches. We show how to realize the approach with the Eclipse Modeling Framework and …", "num_citations": "20\n", "authors": ["1147"]}
{"title": "On the derivation of class diagrams from use cases and logical software architectures\n", "abstract": " The transformation of user requirements into system requirements models can be achieved using the 4 Step Rule Set (4SRS) method that transforms UML use case diagrams into system-level object diagrams. These diagrams represent the logical architecture of the system, integrating the system-level entities, their responsibilities and the relationships among them. The logical architecture captures the system functional requirements and its non-functional intentionalities. Although contributing to the formalization of the design of software architectures, the 4SRS method needs to be extended in order to support the design of the database subsystems that may be considered pertinent within the specified logical architecture. This paper presents the extension of the 4SRS method to support the construction of the class diagram that complements the logical architecture, and shows, through the presentation of a …", "num_citations": "19\n", "authors": ["1147"]}
{"title": "Model driven development of software product lines\n", "abstract": " Software product lines and related approaches, like software factories, are starting to capture the attention of the industry practitioners. Nevertheless, their adoption outside the research community and big companies is still very restricted. We believe that model-driven approaches, like OMG's MDA, with proper tool support, can bring the advantages of product lines to a broader audience. In this thesis we propose an approach to achieve this goal in which modeling is inspired by UML and automation is based on metamodeling and transformation languages using publicly available tools.", "num_citations": "19\n", "authors": ["1147"]}
{"title": "Heterogeneous information systems integration: organizations and methodologies\n", "abstract": " In this paper, a methodology for integrating heterogeneous industrial information systems is presented. The methodology is strongly based on the extensive reuse of already-made components and is conceptually divided in three levels, one for each kind of designer that is typically involved in this type of projects. To accomplish a better integration of the activities and tools necessary to develop industrial information systems with the proposed methodology, three appropriate organizational configurations are adopted.", "num_citations": "19\n", "authors": ["1147"]}
{"title": "On the decomposition of use cases for the refinement of software requirements\n", "abstract": " Requirements elicitation is a complex and usually longstanding but crucial activity to the software development. UML use case models are one of the most popular techniques to describe the functional requirements of a system. Use cases can be written with a high-abstraction level or with a low-abstraction level. In fact, when one needs to see the system as a whole, the high-abstraction level use cases are useful. But when the system's details need to be known, low-abstraction level use cases are a lot more useful. This paper describes an iterative and incremental approach to support the construction of UML use case diagrams as a first documentation effort of the requirements elicitation activities. The approach adopts a refinement mechanism to detail use cases, in a controlled way, as a mean to obtain a functional requirements model of the system. This allows relating an abstract use case with the corresponding …", "num_citations": "18\n", "authors": ["1147"]}
{"title": "A methodology for complex embedded systems design\n", "abstract": " This paper focuses mainly on the analysis phase, describing a UML-based approach for designing complex embedded systems, and specifically the usefulness of using shobi-PN v2.0 specifications, a Petri net extension, for modelling the dynamic behaviour. A relatively complex case study is used to show the usefulness of the suggested specification approach.", "num_citations": "18\n", "authors": ["1147"]}
{"title": "Generating a business model canvas through elicitation of business goals and rules from process-level use cases\n", "abstract": " Business Models play a pivotal role in organizations, especially in building bridges and enabling the dialogue between business and technological worlds. Complementarily, while Use Cases are one of the most popular techniques for eliciting requirements in the design of Information Systems, Business Goals and Business Rules associate with Business Process Use Cases to compose a Business Model base structure. However, methods for relating Business Processes, Goals and Rules (PGR) are scarce, dissonant or highly analyst-dependent. In this sense, we propose a two-step method to help in guiding the elicitation of Business Goals and Rules from Process-level Use Cases, and their mapping to a Business Model representation. As a result, a solution Business Model generated by aligning the resulting trios (PGR) with a Business Model Canvas is presented to the organization stakeholders for …", "num_citations": "17\n", "authors": ["1147"]}
{"title": "Delivering user stories for implementing logical software architectures by multiple scrum teams\n", "abstract": " In software projects, agile methodologies are based in small development cycles and in continuous communication with customers with low needs on modeling formalism for requirements elicitation and documentation. However, there are projects whose context requires formal modeling and documentation of requirements in order to raise and manage critical issues from the very beginning of the project, like architectural diagrams. This work presents an approach for deriving a list of User Stories using a logical architectural diagram as input. Derived User Stories are then delivered to multiple Scrum teams.", "num_citations": "17\n", "authors": ["1147"]}
{"title": "An Object-Oriented Model for Rapid Prototyping of Data Path/Control Systems–A Case Study\n", "abstract": " The aim of this article is to present how to use shobi-PN, an Object Oriented Petri Net model to specify data path/control systems. In a case study, a transputer link adaptor is specified for rapid-prototyping by applying the shobi-PN model and the generation of VHDL code for simulation is presented. The case study demonstrates the applicability and the capability of a development process, supported by the use of object-oriented principles to model both the control unit and the data path of complex systems, with a developed CAD tool", "num_citations": "17\n", "authors": ["1147"]}
{"title": "A model-driven approach for the derivation of architectural requirements of software product lines\n", "abstract": " The alignment of the software architecture and the functional requirements of a system is a demanding task because of the difficulty in tracing design elements to requirements. The four-step rule set (4SRS) is a unified modeling language (UML)-based model-driven method for single system development which provides support to the software architect in this task. This paper presents an evolution of the 4SRS method aimed at software product lines. In particular, we describe how to address the transformation of functional requirements (use cases) into component-based requirements for the product line architecture. The result is a UML-based model-driven method that can be applied in combination with metamodeling tools such as the eclipse modeling framework (EMF) to derive the architecture of software product lines. We present our approach in a practical way and illustrate it with an example. We also …", "num_citations": "16\n", "authors": ["1147"]}
{"title": "Model-driven methodologies for pervasive information systems development\n", "abstract": " This paper intends to introduce the concept of pervasive information systems (PIS) and the issues that arise from the software development for pervasive information systems. The model driven approach is generally described and its benefits to the software design are identified. Finally, some future directions for the usage of model driven methodologies within the development of PIS are highlighted, presenting some specific problems that nowadays that kind of methodologies have not yet been able to overcome.", "num_citations": "16\n", "authors": ["1147"]}
{"title": "A quantitative study to assess a program and project management approach for collaborative university-industry R&D funded contracts\n", "abstract": " While the literature provides some advice on managing programs and projects, the specific context of university-industry collaboration, being scarcely reported, demands a strong research effort to produce effective guidelines. Pursuing this effort, a new program and project management (PPM) approach specifically devoted to support collaborative university-industry R&D funded contracts is incrementally being developed. The management of a program of projects requires also the management of all the constituent projects. Therefore, the PPM approach introduces two layers: one layer for supporting the management of the program at the strategic level and another layer for manageming the constituent projects in strait alignment with the program strategy. A common and consistent set of management phases is being established for both layers with several key program and project management activities/practices …", "num_citations": "15\n", "authors": ["1147"]}
{"title": "Teaching embedded systems engineering in a software-oriented computing degree\n", "abstract": " Traditional software-oriented computing degrees do not include courses on embedded systems design in their syllabus, since in the past embedded applications were seen as small-sized solutions developed without the need of engineering approaches. This reality has dramatically changed in the last decade and nowadays several embedded systems are quite complex. Embedded systems present several idiosyncrasies that make their development more difficult and complex than desktop solutions, namely when considering non-functional requirements, time-related deadlines, or the correctness of the solution. To be well prepared for their professions, students of software-oriented computing degrees must acquire skills and competencies in embedded systems engineering. Being able to master high-level programming languages and to develop solutions only for desktop computers means that the students …", "num_citations": "15\n", "authors": ["1147"]}
{"title": "Model-driven software development for pervasive information systems implementation\n", "abstract": " Model-driven development (MDD) conceptions and techniques essentially centre the focus of development on models. They are subject of current research as they allow enhanced productivity, technological platform independence and longevity of software artifacts. Another area of current research is the ubiquitous/pervasive computing area. This field of computing research focuses on the widespread adoption of embedded or mobile heterogeneous computing devices, which, when properly orchestrated, globally compose pervasive information systems (PIS). This work intends to clarify how should be MDD concepts and techniques structurally consolidated into an approach to software development for PIS. It involves two projects as case studies. From these case studies, it will be proposed methodological insights to design approaches for software development of PIS. While clarifying several issues pertaining to …", "num_citations": "15\n", "authors": ["1147"]}
{"title": "Adopting computational independent models for derivation of architectural requirements of software product lines\n", "abstract": " The alignment of the software architecture and the functional requirements of a system is a demanding task because of the difficulty in tracing design elements to requirements. The 4SRS (Four Step Rule Set) is a UML based model driven method for single system development which provides support to the software architect in this task. This paper presents an evolution of the 4SRS method aimed at product lines. In particular, we describe how to address the transformation of functional requirements (use cases) into component based requirements for the product line architecture. In order to achieve this, we have extended the 4SRS method to explicitly handle variability. This evolution of 4SRS is based on an extension of the UML-F profile proposed by the authors. The UML-F profile provides UML notational extensions required to model variability. We present our approach in a practical way and illustrate it with an …", "num_citations": "15\n", "authors": ["1147"]}
{"title": "Assessment of maturity models for smart cities supported by maturity model design principles\n", "abstract": " The concept of smart cities has gained relevance over the years. City leaders plan investments with the aim of evolving the city towards a smart city. Several models and frameworks, of which maturity models, provide directions or support such investment decisions. Nevertheless, it is not always clear whether the maturity models developed so far are able to fulfil their proposed objectives. This paper identifies smart city maturity models and assesses them, taking into account an approach based on the design principles framework proposed by Pöppelbuß & Röglinger [1]. The main objective of this paper is to infer on the relevance of current maturity models for smart cities, taking into account their purpose. Furthermore, it aims at creating awareness towards the need for completeness when developing a maturity model.", "num_citations": "14\n", "authors": ["1147"]}
{"title": "Using process-level use case diagrams to infer the business motivation model with a RUP-based approach\n", "abstract": " Building a business model for a software-based information system in ill-defined contexts is close to an impossible mission. Our recent work in eliciting and managing requirements from a process-perspective allows deriving a logical architecture but fails to provide a business and strategic view of the system. Adaptation of standard techniques to infer goals and requirements from scenarios and process-like diagrams, mapping backwardly the traditional business to process workflow, could help in building a business model and defining a strategy for the information system. We extend our V-Model approach with a Business Motivation Model representation, guided by a RUP-based backward transformation from process to business, so allowing for better and continuous alignment between Business and IS/IT, with improved traceability.", "num_citations": "14\n", "authors": ["1147"]}
{"title": "A V-model approach for business process requirements elicitation in cloud design\n", "abstract": " The benefits of cloud computing approaches are well known but designing logical architectures for that context can be difficult. When there are insufficient inputs for a typical (product) approach to requirements elicitation, a process-level perspective is an alternative way for achieving the intended logical design. We present a V-Model based approach to derive logical architectural models to execute in the different cloud layers from a process-level perspective, instead of the traditional product-level perspective. This V-Model approach encompasses the initial definition of the project goals and the process-level perspective of the systems intended logical architecture. The approach application results in the creation of a validated process-level structure and behavior architectural models that create a context for eliciting requirements for a cloud product. Throughout this process, we assess our decisions based on …", "num_citations": "14\n", "authors": ["1147"]}
{"title": "Modeling the alignment between business and IS/IT: a requirements engineering perspective\n", "abstract": " Requirements Engineering plays a central role on software-based information system specification and evolution, and in the alignment between Business and IS/IT, nevertheless, contributes from other areas of research are important to advance and mature existing solutions. Our recent work in eliciting and managing requirements in ill-defined contexts, from a process-perspective, presents some challenges that need to be tackled from other perspectives. We present some insights from three different areas (business model, strategy and goals, and enterprise architecture) concerning innovative methods and techniques, to apply in our existing V-process solution. At the moment, we have defined the methods and techniques to include and adapt, and will empirically test and evaluate their suitability and results in new contexts.", "num_citations": "14\n", "authors": ["1147"]}
{"title": "On the refinement of use case models with variability support\n", "abstract": " Modeling software product lines shall imply modeling from different perspectives with different modeling artifacts such as use case diagrams, component diagrams, class diagrams, activity diagrams, sequence diagrams and others. In this paper, we elaborate on use cases for modeling product lines and we explore them from the perspective of variability by working with the unified modeling language (UML) «extend» relationship. We also explore them from the perspective of detail by (functionally) refining use cases with «extend» relationships between them. This paper’s intent is to provide for comprehension about use case modeling with functional refinement when variability is present.", "num_citations": "14\n", "authors": ["1147"]}
{"title": "Refinement of software product line architectures through recursive modeling techniques\n", "abstract": " Currently, modeling methods applicable to software product line architectures do not explicitly comprise refinement, which implies dealing with a lot of complexity during their application to a high number of requirements. This paper suggests the extension of a modeling method applicable to product line architectural modeling, the 4SRS (Four Step Rule Set), to support the refinement of product lines. We have used the GoPhone case study to illustrate the approach and the recursion capability of the method as a solution to the challenges of modeling product line architectures. The strength of our approach resides in its stepwise nature and in allowing the modeler to work at the user requirements level without delving into lower abstraction concerns.", "num_citations": "14\n", "authors": ["1147"]}
{"title": "Value of project management in university–industry R&D collaborations\n", "abstract": " PurposeUniversity–industry projects provide special challenges in understanding and expressing the values required of project management (PM) in delivering stakeholder benefits. This paper presents a framework for understanding, identifying and managing the values of PM in major university–industry R&D projects.Design/methodology/approachThe value framework identifies for each of the key stakeholders, the key PM values that may require to be managed and are largely derived from research literature. Empirical research then explores, prioritises and selects key PM values that need to be managed for a specific project. A large case study is used involving one university and one industry collaborating on a multi-million Euro initiative over six years. Empirical research was conducted by researchers who observed at close quarters, the challenges and successes of managing the competing values of key …", "num_citations": "13\n", "authors": ["1147"]}
{"title": "Planning benefits realization in a collaborative university-industry R&D funded program\n", "abstract": " This paper presents a benefits management (BM) approach adopted during the planning of a collaborative university-industry R&D funded program, named IC-HMI Program, in order to pursue benefits realization. The BM approach embraced four main phases: `Identify expected benefits' `Plan benefits realization' `Pursue benefits realization' and `Transfer and ensure benefits realization' each one comprising key activities that should be performed with a clear set of outputs to be generated. Particular focus is given to the benefits identification, and to the development of a Benefit Breakdown Structure (BBS), assuming the key role of such a formatting technique to target project benefits. It is the first and critical step in the BM process. Based on a review of literature, and the three research methods adopted during the IC-HMI case study analysis: a set of 33 benefits were identified, which can be used by professionals and …", "num_citations": "13\n", "authors": ["1147"]}
{"title": "Perceptions of different stakeholders on managing collaborative university-industry R&D funded contracts\n", "abstract": " A new program and project management (PgPM) approach especially devoted to support collaborative university-industry R&D funded contracts is being developed from an exploratory study. This paper describes how the identified key program management activities/practices are dependent on the program stakeholders’ characteristics, namely contractual relationship - university vs. industry, professional category, role in the program context, PM experience, level of education, gender and age. A sample of 170 questionnaire responses from stakeholders of a real program, named HMIExcel, is used. There were few different perceptions observed between program stakeholders, which might indicate that the key program management activities within the PgPM approach are so relevant that there is a general consensus between different stakeholders.", "num_citations": "13\n", "authors": ["1147"]}
{"title": "A SoaML approach for derivation of a process-oriented logical architecture from use cases\n", "abstract": " Designing logical architectures for cloud computing environments can be a complex endeavor, moreover when facing ill-defined contexts or insufficient inputs to requirements elicitation. Existing solutions are no longer enough to embrace challenges brought by complex scenarios and multi-stakeholder realities, as in Ambient Assisted Living ecosystems. As new concepts and cross-domain solutions emerge, these problems are tackled by connecting evermore the world of requirements and architectures, of business and technology, through service-oriented approaches. This due, we propose to extend the Four-Step-Rule-Set (4SRS) method, which has proven successful in generating a proper candidate logical architecture for an information system in ill-defined contexts, to a Service-Oriented Architecture approach for greater business integration, flexibility, and agility, by using the SoaML language. We …", "num_citations": "13\n", "authors": ["1147"]}
{"title": "Execution of UML models with CPN Tools for workflow requirements validation\n", "abstract": " Requirements validation is a critical task in any engineering project. The confrontation of stakeholders with static requirements models is not enough, since stakeholders with non computer science education are not able to discover all the inter-dependencies between the elicited requirements. Even with simple UML (unified modelling language) requirements models it is not easy for the development team to get confidence on the stakeholders’ requirements validation. This paper describes an approach, based on the construction of executable interactive prototypes, to support the validation of workflow requirements, where the system to be built must explicitly support the interaction between people within a pervasive cooperative workflow execution. A case study from a real project is used to illustrate the proposed approach.", "num_citations": "13\n", "authors": ["1147"]}
{"title": "An OMG-based meta-framework for alignment of IS/IT architecture with business models\n", "abstract": " The topic of alignment between Business and Information Systems has been for some time, and remains actually, a top concern of research in diverse areas. It presents many open roads for research, even if leading to much dispersion and fuzziness due to the different views and subjects involved. On the path to build a conceptual, structured framework that incorporates the related topics of requirements engineering, enterprise architecture and strategy alignment, our literature search uncovered three main themes: the business model artifact, strategy and goal modelling, and enterprise modelling. Following, the research problem and its related research questions, which answers will give origin to artifacts, through design science (working on existing knowledge) and action research (working in live projects), were laid out. Initial steps in our incremental research approach, with a perspective on the requirements …", "num_citations": "12\n", "authors": ["1147"]}
{"title": "Derivation of data-driven software models from business process representations\n", "abstract": " Business process modelling and management approaches are increasingly used and disclosed between organizations as a means to improve their products or services quality and to improve their productivity. If on one hand Business Processes Management and Modelling is becoming increasingly important to organizations, on the other hand, software development teams still have serious difficulties in defining the requirements for the software that supports the business processes which primarily have been based on lists of needs felt by users. As a result, we have software models and applications that are not aligned with business processes. Basing requirements elicitation in the Business Process Modelling would ensure the alignment between Business Processes and software models and applications. The main objective of this research is helping to close the gap between the business processes and the …", "num_citations": "12\n", "authors": ["1147"]}
{"title": "BIM: a methodology to transform business processes into software systems\n", "abstract": " This manuscript proposes a guiding methodology to obtain a software system that supports the execution of the business processes existing within an organization. The methodology promotes the usage of business process reference models and intends to reduce the implementation time of the software systems. The methodology assumes four distinct phases and several abstraction levels and is applicable both when developing systems from scratch or in re-engineering contexts. The methodology embodies a special phase to handle the diversity of the business processes of an organization. By tailoring process reference models and by considering the characteristics of a specific organization, a proper set of business processes is derived for that organization. Then, we can obtain a suitable information system and implement its automatable parts in a software solution that can run on top of open source …", "num_citations": "12\n", "authors": ["1147"]}
{"title": "An Evolutionary Approach to the Use of Petri Net Based Models\n", "abstract": " The main purpose of this article is to present how Petri Nets (PNs) have been used for hardware design at our research laboratory. We describe the use of PN models to specify synchronous parallel controllers and how PN specifications can be extended to include the behavioural description of the data path, by using object-oriented concepts. Some hierarchical mechanisms which deal with the specification of complex digital systems are highlighted. It is described a design flow that includes, among others, the automatic generation of VHDL code to synthesize the control unit of the system. The use of PNs as part of a multiple-view model within an object-oriented methodology for hardware/software codesign is debated. The EDgAR-2 platform is considered as the reconfigurable target architecture for implementing the systems and its main characteristics are shown.", "num_citations": "12\n", "authors": ["1147"]}
{"title": "Aligning domain-related models for creating context for software product design\n", "abstract": " A typical software product is developed so that it can fulfill the specific needs (problem that needs to be solved) within a given business domain, based on a proper product design context. Although, assuring an alignment between the technological developments with the business domain is a demanding task. With the purpose of clarifying the relations between the models that support the business and the software representations, we present in this paper a V-Model based approach to align the business domain requirements with the context for product design. This V Model encompasses the models that support the initial definition of the project goals, expressed through organizational configurations, and the analysis and design of models that result in a process-level perspective of the system’s logical architecture. Our approach adopts a process-level perspective with the intent to create context for product …", "num_citations": "11\n", "authors": ["1147"]}
{"title": "Ontologies for product and process traceability at manufacturing organizations: a software requirements approach\n", "abstract": " A Traceability business process is mandatory and unavoidable on manufacturing organizations. Customers, particularly original equipment manufacturers, require it on contracts, while governments enforce it, through rules and regulations. Organizations fail to create and sustain a business process satisfying traceability demands. IT departments are one of the main players on efforts to create a solution, as this process is only manageable when supported by software. This document presents an approach to improve the understanding of traceability business process by using ontologies as a requirements modeling technique.", "num_citations": "11\n", "authors": ["1147"]}
{"title": "An agile modeling oriented process for logical architecture design\n", "abstract": " Stakeholders are crucial participants for eliciting requirements towards a new software solution. However, agreeing a common understanding among them is a complex task in a project’s initial phase when solution requirements and design need to be refined and/or are unknown. In order to not delay the initial phase and thus endanger the entire project, this paper proposes a process to elicit functional requirements and to design a candidate logical architecture (i.e., without refining information), called Agile Modeling Process for Logical Architectures (AMPLA). By eliciting a set of “just-enough” UML Use Cases, i.e., that includes at least the core requirements information, it is proposed the use of a logical architecture derivation method, the Four-Step-Rule-Set (4SRS). This approach is suitable in agile software development contexts, where the solution’s architecture is not known upfront.", "num_citations": "10\n", "authors": ["1147"]}
{"title": "Project and program management implications in the portfolio management of IT projects in applied R&D organizations\n", "abstract": " Nowadays, projects represent a significant investment for organizations, their intrinsic role as organizational change mechanisms is being increasingly recognized. In this context, project portfolio management efforts are considered as a main efficiency and effectiveness mechanism to align the projects execution with the organization strategy. The components of a project portfolio management should be measured, ranked, and prioritized according to criteria preestablished. The main objective of the PhD research work is to develop a new method for portfolio management of Information and Technology projects, by taking into account the implications from Project Management Institute and Office of Government Commerce project and program management reference models.", "num_citations": "10\n", "authors": ["1147"]}
{"title": "Transition from process-to product-level perspective for business software\n", "abstract": " When there are insufficient inputs for a product-level approach to requirements elicitation, a process-level perspective is an alternative way for achieving the intended base requirements. We define a V+V process approach that supports the creation of the intended requirements, beginning in a process level perspective and evolving to a product-level perspective trough successive models derivation with the purpose of creating context for the implementation teams. The requirements are expressed through models, namely logical architectural models and stereotyped sequence diagrams. Those models alongside with the entire approach are validated using the architecture validation method ARID.", "num_citations": "10\n", "authors": ["1147"]}
{"title": "Endovascular aortic aneurysm repair in kidney transplant recipients\n", "abstract": " Aortic aneurysm, chronic renal failure, and kidney transplantation are common clinical entities that rarely coexist. The increased number of kidney transplant patients, their greater survival, and the sharing of risk factors for aortic aneurysms, suggest the emergence of a larger number of diagnoses of aortic aneurysms among kidney transplant patients. These patients cases present the particularities of immunosuppression that can alter the healing of the wounds or the development of infections. There is a need to protect the kidney during aortic clamping and several co-morbidities that increase the surgical morbidity and mortality. The advent in 1991 of the endovascular aortic aneurysm repair (EVAR), with less physiologic aggression, brought a new therapeutic perspective that minimizes these problems. Our experience with renal transplantation began in 1987 and with EVAR in 2001. During this period we had the …", "num_citations": "10\n", "authors": ["1147"]}
{"title": "The UML «include» relationship and the functional refinement of use cases\n", "abstract": " Developing software with model-driven approaches involves dealing with diverse modeling artifacts such as use case diagrams, component diagrams, class diagrams, activity diagrams, sequence diagrams and others. In this paper we focus on use cases for software development and we analyze them from the perspective of detail. In that context we explore the UML (Unified Modeling Language) ≪include≫ relationship. This work allows understanding the use case modeling activity with support for refinement and provides for specific guidelines on how to conduct such activity.", "num_citations": "10\n", "authors": ["1147"]}
{"title": "Geração automática de modelos de simulação de uma linha de produção na indústria electrónica\n", "abstract": " Esta dissertação relata o desenvolvimento de uma aplicação informática para apoio à decisão, visando a geração automática de modelos de simulação com diferentes estratégias de controlo para a redefinição de fluxos de processamento de materiais ao longo de uma linha de produção da indústria electrónica.", "num_citations": "10\n", "authors": ["1147"]}
{"title": "A petri net meta-model to develop software components for embedded systems\n", "abstract": " This paper presents a new Petri net (PN) meta-model, called shobi-PN v2.0, that can be used to specify, the dynamic behaviour of concurrent systems, using object-oriented modelling concepts together with a generalised arc set capable of coping with the complexity of the current embedded systems. This new Petri net meta-model can also be used to support a component-based development approach in the design of generic and parametrisable control-oriented software components for embedded systems.", "num_citations": "10\n", "authors": ["1147"]}
{"title": "Hierarchical Mechanisms for High-level Modeling and Simulation of Digital Systems\n", "abstract": " The main purpose of this paper is to present a useful set of hierarchical mechanisms of specification to model and simulate digital systems. The shobi-PN model (Synchronous, Hierarchical, Object-Oriented and Interpreted Petri Net), was developed to support the use of hierarchy to model both the control unit and the data path of the systems. Modeling of a pipelined architecture unit of a microprocessor is considered as a case study to illustrate the capabilities of the hierarchical mechanisms proposed.", "num_citations": "10\n", "authors": ["1147"]}
{"title": "Managing a successful university-industry collaborative funded innovation programme\n", "abstract": " This paper describes the results of a qualitative study to identify the key programme and project management practices in a successful universityindustry collaborative funded innovation programme between the University of Minho (UMinho) and Bosch Car Multimedia Portugal (BOSCH), named–HMIExcel. While the literature provides some advice on managing programs and projects, the specific context of university-industry R&D collaboration is being scarcely reported, demanding a strong research effort to produce effective guidelines. HMIExcel programme embraced an investment of 19.2 M€ and involved around 300 people during two years (2013-2015). HMIExcel is considered a successful programme for several reasons, namely the decision of the UMinho and BOSCH partnership for developing a second programme named–IC-HMI–which foresees an investment of 54.7 M€. The success of the HMIExcel programme was partially due to the programme and project management practices adopted.", "num_citations": "9\n", "authors": ["1147"]}
{"title": "A transformation of business process models into software-executable models using mda\n", "abstract": " Traditional software development projects for process-oriented organizations are time consuming and do not always guarantee the fulfillment of the functional requirements of the client organization, and thus the quality of the resulting software product. To reduce the time spent for developing software and improve its quality, we adopt the inclusion of automation in some parts of the software development process. Thus, in this paper, we propose a model transformation approach to derive an executable model for the business processes of a given organization. We execute a mapping between processes (described with a business process execution language) and software components. We also propose a supporting software architecture based on an Enterprise Service Bus and on Java Business Integration, and we use an already defined methodology to execute the model transformation project.", "num_citations": "9\n", "authors": ["1147"]}
{"title": "An ontology-based approach to model-driven software product lines\n", "abstract": " Software development in highly variable domains constrained by tight regulations and with many business concepts involved results in hard to deliver and maintain applications, due to the complexity of dealing with the large number of concepts provided by the different parties and system involved in the process. One way to tackle these problems is thru combining software product lines and model-driven software development supported by ontologies. Software product lines and model-driven approaches would promote reuse on the software artifacts and, if supported by an ontological layer, those artifacts would be domain-validated. We intend to create a new conceptual framework for software development with domain validated models in highly variable domains. To define such a framework we will propose a model that relates several dimensions and areas of software development thru time and abstraction …", "num_citations": "9\n", "authors": ["1147"]}
{"title": "Model-driven development for pervasive information systems\n", "abstract": " This chapter focuses on design methodologies for pervasive information systems (PIS). It aims to contribute to the efficiency and effectiveness of software development of ubiquitous services/applications supported on pervasive information systems. Pervasive information systems are comprised of conveniently orchestrated embedded or mobile computing devices that offer innovative ways to support existing and new business models. Those systems are characterized as having a potentially large number of interactive heterogeneous embedded/mobile computing devices that collect, process, and communicate information. Also, they are the target of technological innovations. Therefore, changes in requirements or in technology require frequent modifications of software at device and system levels. Software design and evolution for those require suitable approaches that consider such demands and characteristics of …", "num_citations": "9\n", "authors": ["1147"]}
{"title": "Critical factors for benefits realisation in collaborative university-industry R&D programs\n", "abstract": " This study aims to help academics and practitioners to realise the benefits resulting from collaborative university-industry research and development (R&D), by identifying the most critical factors for benefits' realisation. A literature review was conducted allowing us to compile a list of 33 most acknowledged benefits resulting from university-industry R&D collaborations, and a list of 66 critical factors for the realisation of the most acknowledged benefits identified. A benefit breakdown structure and a critical factors breakdown structure were developed to provide a better description of the 'variables' that are involved in managing benefits. A two-stage Delphi survey method, involving data analysis from seven invited experts, was conducted to identify the critical factors that should be leveraged in order to realise the most acknowledged benefits from collaborative university-industry R&D. The most common types of critical …", "num_citations": "8\n", "authors": ["1147"]}
{"title": "Adoption of architecture reference models for industrial information management systems\n", "abstract": " Manufacturing is one of the European economy main pillar. Technological advances in fields such as computing, sensorisation, digitization, etc., changes in market behavior, value chains importance, brought new challenges to industrial production. Therefore, it requires the increase of flexibility, autonomy and adaptability of industrial systems and their interconnection to all other resources and integration into value chains. Those challenges are the main goal of Industry 4.0 vision. It emphasizes the idea of a total transformation of industrial production through the fusion of digital technology and the internet with the conventional industry; by digitally connect everything in and around the manufacturing operation. For that reason, it is crucial and urgent to prepare the national industry for this announced change, developing the knowledge, tools, and methods, to assist the manufacturing industry in the required digital …", "num_citations": "8\n", "authors": ["1147"]}
{"title": "Specifying software services for fog computing architectures using recursive model transformations\n", "abstract": " Due to massive amounts of data transfer between smart devices, the adoption of mobile  Internet and Internet of Things (IoT) within Cloud  Computing applications has resulted in numerous issues including data decentralizing challenges. As a resolution, a new service-oriented  approach called Fog  Computing has appeared to resolve at least some of these. However, the design of Fog Computing architectures also lacks a systematized approach for using models aiming to abstract the fog environments’ services specification. In this context, this chapter proposes the use of a set of software engineering approaches for Fog-based architecture design , centered in UML artifacts and executing the four-step-rule-set (4SRS ) method. Here, the Fog Computing microservices are modeled in SoaML’s Service Participant , Capabilities , Service Interface , and Service Architecture  diagrams. The approach is …", "num_citations": "8\n", "authors": ["1147"]}
{"title": "Requisitos em projetos de software e de sistemas de informação\n", "abstract": " Este livro se baseia em diversas temáticas relacionadas aos requisitos de sistemas de engenharia, sobretudo o levantamento, a negociação, a priorização e a documentação (seja em linguagem natural, seja por meio de modelos gráficos), com o objetivo de proporcionar ao leitor o acesso a métodos e técnicas que o ajudem a caracterizar, de forma sistemática, os requisitos dos sistemas que se pretendem projetar. Esta obra pode ser adotada como referência principal em disciplinas de bacharelado e mestrado relativas à problemática dos requisitos em projetos de software, ou como obra de apoio à temática dos requisitos em disciplinas de âmbito mais amplo (por exemplo, engenharia de sistemas, engenharia de software, engenharia de sistemas de informação, gestão de projetos). Pode igualmente ser utilizada em cursos de formação profissional ou em ações de reciclagem de profissionais ligados à análise e à concepção de sistemas e gestão de projetos, que têm a oportunidade de abordar, de forma sistematizada e organizada, algumas temáticas de seu interesse. Cada um dos capítulos inclui no final um conjunto de exercícios que o leitor poderá explorar, a fim de testar os conhecimentos sobre as temáticas abordadas.", "num_citations": "8\n", "authors": ["1147"]}
{"title": "A three-dimensional, requirements-based, balanced scorecard business model\n", "abstract": " Business models play a pivotal role in organizations, building bridges and enabling dialogue between business and technological worlds, where goals and rules associate with processes to compose its base structure, driving and supporting the organization's strategy. In addition, as balanced scorecard is the reference in strategy management, a combination of these three dimensions could lead to a stronger, more strategy-oriented, business model. In this sense, we propose the specification of a three-dimensional business model, covering the elicitation of business goals and rules from process-level use cases, and their connection to balanced scorecard, aggregating functional, nonfunctional and strategy dimensions. Along-side it, the definition of a method (within a SPEM approach), adaptable to this model variations, allows for different approaches and viewpoints from diverse stakeholders.", "num_citations": "8\n", "authors": ["1147"]}
{"title": "An application to select collaborative project management software tools\n", "abstract": " In an increasingly competitive market the use of project management techniques can help controlling scope, time, and cost in an efficient way. Either due to size or complexity that may exist in a project, it may be essential to use project management software tools. Some projects involve teams of people who may be geographically dispersed, being essential to exchange information among project stakeholders, hence the need for collaborative tools, best known as groupware. In this paper, we present an overview of project management and collaborative project management techniques and tools. Next, we present a framework, based on ISO 9126 and ISO 14598, to classify collaborative project management software tools. Finally, we present a model and an application to help on the selection of this type of tools.", "num_citations": "8\n", "authors": ["1147"]}
{"title": "Geração automática de modelos de simulação de uma linha de montagem de auto-rádios\n", "abstract": " Neste artigo apresenta-se uma aplicaçao informática para apoioa decisao, visando a geraçao automática de modelos de simulaçao com diferentes estratégias de controlo para a redefiniçao de fluxos de processamento de materiais ao longo de uma linha de produçao da indústria electrónica. Esta linha de produçao é constituıda por linhas de fabrico de autorádios em que o transporte e a respectiva decisao sao realizados de uma forma automática, e sob a coordenaçao de um sistema de controlo. Pretende-se que o recursoa simulaçao em cс 2005 Associaçao Portuguesa de Investigaçao Operacional", "num_citations": "8\n", "authors": ["1147"]}
{"title": "System-level object-orientation in the specification and validation of embedded systems\n", "abstract": " The main aim of this paper is to present how the Unified Modeling Language (UML) can be used as the notation to specify the requirements of an embedded system. By, using a relatively small, but real, system (a supervision application) as a running example, the paper illustrates the design flow that can be followed during the analysis phase of complex control applications. To assure the continuous mapping of the models, the authors propose some guidelines to transform the use case diagrams into a single object diagram, which is the main diagram for the next development phases (design and implementation). The Java programming language is used for developing a system's prototype, to allow the system's validation by the customers.", "num_citations": "8\n", "authors": ["1147"]}
{"title": "A logical architecture design method for microservices architectures\n", "abstract": " The use of microservices architectures has been widely adopted in software development, especially for cloud-based solutions. Developing such solutions faces several challenges beyond typical architecture and service design concerns, including service exposition (API), inter-service communication, and infrastructure deployment, among others. Although model-driven approaches allow abstracting microservices behavior from the business domain, there is a lack of proper methods for addressing the referred challenges. In this paper, the elicitation of microservices, their identification uses using functionally decomposed UML use cases as input within a logical architecture derivation method, namely an adapted version of the Four Step Rule Set (4SRS), using SoaML diagrams, that responds to microservices specific characteristics. We demonstrate the approach using a scenario within a live industrial project.", "num_citations": "7\n", "authors": ["1147"]}
{"title": "Mapping Between Artefacts and Portfolio Processes from the PMI Standard for Portfolio Management\n", "abstract": " Among the decisions that software development organizations need to take is to define which projects should developed, as these are, ultimately, the reason for their existence. This decision is part of a broader decision-making process than the strictly project management efforts of every day, involving aspects that go beyond the limits of a project itself, such as: strategic alignment, economic viability, risks that an organization is willing to assume, the capacity of available resources and the returns that will be achieved. These concerns are within the scope of project portfolio management. The Project Management Institute (PMI) has developed the ‘Standard for Portfolio Management’, whose objective is to propose a strategy for project portfolio management throughout processes. This paper presents the dependencies between all portfolio management process and artefact’s from that PMI standard with …", "num_citations": "7\n", "authors": ["1147"]}
{"title": "Deriving software design models from a set of business processes\n", "abstract": " Requirements elicitation is a crucial activity and one of the first steps in software development process. A popular way to capture and describe requirements is through UML use case models. Transforming requirement specifications into software design models is a complex and error prone software development activity. Software design usually involves several models, each one representing a different perspective. One of those perspectives is the data perspective which can be modeled using a data model. Although of the importance of this model, few works has been done to derive a data model from use case model. The 4SRS (4-Step Rule Set) method generates a logical architecture of a software-based system, based on a use case model. This paper proposes an approach to adapt and extend the 4SRS method in order to generate a data model supporting the generated logical architecture and the elicited …", "num_citations": "7\n", "authors": ["1147"]}
{"title": "Integrated framework of agile and CMMI: an alternative path towards product focused SPI for small companies\n", "abstract": " Developing quality software product is a challenging activity and yet necessary asset for most software companies especially small and medium size companies. For a Software process improvement (SPI) activity to be effective in such companies, the day to day product-focused activities needs to align with SPI activity.Different process maturity models have been developed, among them the Capability Maturity Model Integration (CMMI) is the most widely used process maturity framework. However, it is considered difficult to implement for small and medium companies due to various reasons related with its difficulty and financial requirement. On the other hand, the recent software development approach is being directed towards application of agile software development methodologies. But some difficulties have also been reported regarding agile methods limitations of long term and continues guide to process improvement. Researches findings and experience reports demonstrated that, combination of agile methods and CMMI has advantages where most of which can be considered as a solution to problems associated with implementing process maturity activities in immature companies.", "num_citations": "7\n", "authors": ["1147"]}
{"title": "Consulta de acessos vasculares para hemodiálise: experiência de um centro\n", "abstract": " Introdução: Os acessos vasculares são responsáveis por elevada morbilidade nos doentes em hemodiálise. A fístula arteriovenosa", "num_citations": "7\n", "authors": ["1147"]}
{"title": "Business modeling in process-oriented organizations for RUP-based software development\n", "abstract": " Several organizations are nowadays not particularly comfortable with their internal structuring based on a hierarchical arrangement (sub-divided in departments), where collaborators with a limited view of the overall organization perform their activities. Those organizations recognize the need to move to a model where multi-skilled teams run horizontal business processes that cross the organization, and impact suppliers and clients. To develop software systems for any organization, the development process must always be appropriate and controlled. Additionally for organizations who want to migrate to a horizontal business processes view, it is required to model the organizational platform where the organizational processes will run. This necessity is also true when the organization under consideration is a software house. In this chapter, a proposal of a generic framework for process-oriented software houses is …", "num_citations": "7\n", "authors": ["1147"]}
{"title": "A demonstration case on the transformation of software architectures for service specification\n", "abstract": " This paper presents a demonstration case on the successive application of a model-based technique to assist on the refinement of software logical architectures. The technique is essentially based on the transformation of use cases into object diagrams. The applicability of the technique is illustrated by presenting some results from a mobile application. For mobile software, the definition of the underlying service-oriented architecture must consider as user requirements the services themselves, the mobile operators entry points and the final clients interfaces, and use them to characterize the platform. Within the presented demonstration case, the specification of one service of the mobile application was obtained by successively applying the technique.", "num_citations": "7\n", "authors": ["1147"]}
{"title": "Applying a method for measuring the performance of university-industry R&D collaborations: case study analysis\n", "abstract": " Collaborations between university and industry are possibly the most important strategic instrument used to increase the efficiency and effectiveness of industrial investments in Research and Development (R&D), and have been increasing, which assigns even more importance to the need for measuring their performance. Therefore, a method to measure university-industry R&D collaborations, named MPUIC, developed based on Design Science Research methodology (DSRM), was applied and validated through a case study. This paper firstly describes some improvements made to the previously developed MPUIC method before its application to a large program between the University of Minho and Bosch Car Multimedia (Portugal). The MPUIC method adopted a weighted scoring approach, and is composed by 31 performance indicators, distributed through the program management life cycle. Secondly, the …", "num_citations": "6\n", "authors": ["1147"]}
{"title": "Modeling in agile software development: decomposing use cases towards logical architecture design\n", "abstract": " [Context and motivation] There are a plethora of agile practices that relate to management (e.g., Sprints, Scrum ceremonies), development (e.g., pair programming, TDD, BDD, DevOps) or strategy (e.g., Lean Startup), [Question/problem] but lack a comprehensive description on how its adoption influences requirements modeling and “You Aren’t Gonna Need It” (YAGNI) features. [Principal ideas/results] This paper presents Agile Modeling Process for Logical Architectures (AMPLA), an Agile Modeling (AM) oriented process composed by UML diagrams (namely, Sequence, Use Cases and Component). [Contributions] AMPLA uses agile practices in order to deliver small increments (of a requirements package) and to promote continuous customer feedback. The proposed AM process also includes a candidate architecture and further requirements refinement in parallel with a software increment delivery.", "num_citations": "6\n", "authors": ["1147"]}
{"title": "Project-based learning: an environment to prepare IT students for an industry career\n", "abstract": " The lack of preparation of Software Engineering (SE) graduates for a professional career is a common complaint raised by industry practitioners. One approach to solving, or at least mitigating, this problem is the adoption of the Project-Based Learning (PBL) training methodology. Additionally, the involvement of students in real industrial projects, incorporated as a part of the formal curriculum, is a well-accepted means for preparing students for their professional careers. The authors involve students from BSc, MSc, and PhD degrees in Computing in developing a software project required by a real client. This chapter explains the educational approach to training students for industry by involving them with real clients within the development of software projects. The educational approach is mainly based on PBL principles. With the approach, the teaching staff is responsible for creating an environment that enhances …", "num_citations": "6\n", "authors": ["1147"]}
{"title": "A terapia da realidade virtual e a pessoa queimada: redução da dor nos cuidados à ferida-Uma revisão integrativa da literatura\n", "abstract": " INTRODUÇAO: Terapias farmacológicas nao têm conseguido um controle efetivo da dor na pessoa queimada nas três dimensoes da dor aquando os cuidados à ferida. Assim, a Terapia da Realidade Virtual (TRV) baseia-se numa abordagem tecnológica que isola a pessoa do mundo real, visualizando apenas um ambiente virtual.OBJETIVO: Nesta Revisao Integrativa da Literatura pretende-se: identificar se a aplicaçao da TRV reduz a dor nas três dimensoes aquando os cuidados à ferida; verificar em que medida a aplicaçao da TRV reduz a dor em cada uma das três dimensoes de dor; verificar se a aplicaçao da TRV permite a reduçao de administraçao da analgesia opioide.MÉTODO: Efetuou-se pesquisa em motores de busca online, num período temporal de dez anos por meio de descritores e critérios de inclusao predefinidos. Definiu-se como questao de investigaçao\" Qual é a eficácia da aplicaçao da Terapia da Realidade Virtual na reduçao da dor nos cuidados à ferida à pessoa numa unidade de queimados?\". Na consecuçao deste trabalho, teve-se como método os Sete Passos do Cochrane Handbook, sendo incluídos seis artigos.RESULTADOS: Pela análise dos resultados, evidencia-se a reduçao da dor nas três dimensoes, na maioria dos estudos, quando associada a TRV a terapias farmacológicas.CONCLUSOES: Propoem-se mais estudos randomizados controlados para definir os benefícios da TRV, comparativamente com terapias nao farmacológicas menos dispendiosas.", "num_citations": "6\n", "authors": ["1147"]}
{"title": "Using the NIST reference model for refining logical architectures\n", "abstract": " The emergence of the Internet as a ubiquitous means of communication fostered the growth of new business and service models based on Cloud Computing. Information and Communication Technology companies use reference models to define their Cloud Computing strategies. NIST Cloud Computing Reference Architecture is one of these reference models that assist in the design of business, services, and architecture models. This paper aims to present the use of NIST reference architecture in the design of Cloud Computing architectures by employing a method that enables the application of the reference architecture to the refinement of logical architectures.", "num_citations": "6\n", "authors": ["1147"]}
{"title": "A demonstration case on the derivation of process-level logical architectures for ambient assisted living ecosystems\n", "abstract": " When representing the requirements for an intended software solution during the development process, a logical architecture is a model that provides an organized vision of how functionalities behave regardless of the technologies to be implemented. If the logical architecture represents an ambient assisted living (AAL) ecosystem, such representation is a complex task due to the existence of interrelated multidomains, which, most of the time, results in incomplete and incoherent user requirements. In this chapter, we present the results obtained when applying process-level modeling techniques to the derivation of the logical architecture for a real industrial AAL project. We adopt a V-Model–based approach that expresses the AAL requirements in a process-level perspective, instead of the traditional product-level view. Additionally, we ensure compliance of the derived logical architecture with the National Institute of Standards and Technology (NIST) reference architecture as nonfunctional requirements to support the implementation of the AAL architecture in cloud contexts. coNTeNTSIntroduction................................................................................................................................. 104 AAL4ALL Project................................................................................................................... 107 Requirements Elicitation............................................................................................................ 108 Derivation of Logical Architectures.......................................................................................... 109 V-Model Process and 4SRS Method..................................................................................... 109 AAL4ALL Examples.............................................................................................................. 114 The AAL4ALL Scenarios for Ageing …", "num_citations": "6\n", "authors": ["1147"]}
{"title": "The UML «extend» relationship as support for software variability\n", "abstract": " The development of software product lines with model-driven approaches involves dealing with diverse modeling artifacts such as use case diagrams, component diagrams, class diagrams, activity diagrams, sequence diagrams and others. In this paper we focus on use cases for product line development and we analyze them from the perspective of variability. In that context we explore the UML (Unified Modeling Language) «extend» relationship. This work allows understanding the activity of use case modeling with support for variability.", "num_citations": "6\n", "authors": ["1147"]}
{"title": "On the transformation of UML models for service-oriented software\n", "abstract": " The main aim of this paper is to present how to trans-form user requirements models into a software architecture for mobile applications. The technique (called “4SRS”) is essentially based on the mapping of UML use case dia-grams into UML object diagrams. UML sequence, activity, and state diagrams and other artifacts can also be consid-ered within the transformation decisions. The applicability of this technique is illustrated by presenting some results from an e-government mobile application. The development of mobile applications typically follow a service-oriented approach. A service is a software entity running on one or more machines and providing a particu-lar type of function to a priori unknown clients. These ser-vices must communicate with each other, whose combina-tion makes up a service-oriented architecture. The commu-nication can involve either simple data passing or it could involve two or more services coordinating some activity. Some means of connecting services to each other is needed, so workflow is a critical part of making services effective. When those services react to changes on user context, ap-plication are context-aware. For mobile applications, the definition of the underly-ing service-oriented software architecture must consider the services themselves as user requirements, as well as the mo-bile operators entry-points and the final clients interfaces, and use them to characterize the platform. 1.", "num_citations": "6\n", "authors": ["1147"]}
{"title": "Run-time variability issues in software product lines\n", "abstract": " The Product line approach promises productivity and flexibility gains through reuse. In order to achieve higher levels of productivity and flexibility, companies may need to adopt run-time variability realization techniques. However, such an approach can raise issues that companies need to face in order to fully implement run-time variability in their product lines. This is the case of I2S; a Portuguese software-house specialized in software solutions for the insurance industry. In this paper, we present and discuss two major run-time variability issues that were identified in the insurance domain. We also present our approach to solve these issues and how it is being implemented in the I2S product line. We also relate our approach to other techniques documented in the field literature.", "num_citations": "6\n", "authors": ["1147"]}
{"title": "An extension of the improving and embedding project management practice framework: Case study analysis\n", "abstract": " PurposeThe purpose of this paper is to develop and test an extension of a previously conceived framework for improving and embedding project management (PM) practice in organisations. The framework identifies the most useful project management improvement initiatives (PMIIs) and the key factors for embedding PM practice. However, professionals need guidance on how to operationalise such framework in their organisations, therefore a method for applying the framework is developed.Design/methodology/approachThe method being proposed for applying the framework is demonstrated and tested with a large University–Industry consortium case study. During the case study analysis three research methods were applied: participant observation, document analysis and focus groups.FindingsIn what concerns both the PMIIs and key embedding factors in the framework, the proposed method comprises their …", "num_citations": "5\n", "authors": ["1147"]}
{"title": "UH4SP: a software platform for integrated management of connected smart plants\n", "abstract": " Digitization of industrial processes has enabled access to production data from external entities within the supply chain. While interoperability standards and protocols support data integration, horizontally and vertically, within the factory, the design of production integration solutions often are not performed adequately. This paper presents the Unified Hub for Smart Plants (UH4SP) system and its related use case within Industry 4.0 and \"Connected Smart Plants\". The UH4SP uses technologies such as cloud computing, internet of things, microservices and API gateways, to address data integration and collaborative processes between plants, corporative groups, and third-party entities.", "num_citations": "5\n", "authors": ["1147"]}
{"title": "Risk response strategies for collaborative university-industry R&D funded programs\n", "abstract": " Universities are centers of knowledge in our societies and their role when it comes to innovation has become more important over the years. Companies have several reasons to engage in research collaborations with universities, namely to gain access to innovative technologies. University-Industry R&D collaborations are expected to play an important role in regional economies, and to fulfill the industry’s demand for innovative products, technologies and processes. However, the knowledge on what are the potential risks resulting from these collaborations and the risk response strategies to reduce the negative risk impacts and to enhance positive risk impacts is still limited. Thus, this paper aims to fill the gap in literature when it comes to risk identification and risk responses’ planning, by identifying, based on a case study analysis, 19 potential risks and 53 potential risk response strategies.", "num_citations": "5\n", "authors": ["1147"]}
{"title": "Analysis of dengue outbreaks using big data analytics and social networks\n", "abstract": " The term Big Data can be defined as analysis a large volume of data in unstructured databases, organizations of different segment and size, has been employing the Big Data Analytics philosophy as support tool strategic to anticipate valuable insights and trends on the behavior of consumers and their expectations, thus gaining a competitive advantage in the market in which they operate. However, to extract information from values as the goal of turning that volume of data into predictive information or insights is still a big challenge in Big Data. The main objective of this work is to present an implementation of a Big Data project, using data originated from social networks, as well as text mining techniques and machine learning, through the implementation of K-Means and SVM algorithms, with intention of identifying patterns from dengue outbreaks, through analyzes that show insights of probable outbreaks of …", "num_citations": "5\n", "authors": ["1147"]}
{"title": "Summarization and classification of wearable camera streams by learning the distributions over deep features of out-of-sample image sequences\n", "abstract": " A popular approach to training classifiers of new image classes is to use lower levels of a pre-trained feed-forward neural network and retrain only the top. Thus, most layers simply serve as highly nonlinear feature extractors. While these features were found useful for classifying a variety of scenes and objects, previous work also demonstrated unusual levels of sensitivity to the input especially for images which are veering too far away from the training distribution. This can lead to surprising results as an imperceptible change in an image can be enough to completely change the predicted class. This occurs in particular in applications involving personal data, typically acquired with wearable cameras (e.g., visual lifelogs), where the problem is also made more complex by the dearth of new labeled training data that make supervised learning with deep models difficult. To alleviate these problems, in this paper we …", "num_citations": "5\n", "authors": ["1147"]}
{"title": "Sociomaterial enactment drive of business/IT alignment: from small data to big impact\n", "abstract": " Business/IT alignment is an information systems research field with a long existence and a high number of researchers and represents a central direction on the thinking about the relation between business and the information systems. It aims to achieve a paradigm, one in which there is a high degree of visibility and availability of information, about the information systems sociomateriality. Complex-networks constitute an approach to the study of emergent properties of complex systems that strongly focuses and relies on models and measures, through which build the system interdependence. Several contributions of complex-networks are: topology always affects the function; separated from the domain; quantification of element's relationships; visibility and capture of emergent properties. This work expects to contribute for the appropriate use of complex-networks models and measure in the drive of the information …", "num_citations": "5\n", "authors": ["1147"]}
{"title": "A software framework for supporting ubiquitous business processes: An ansi/isa-95 approach\n", "abstract": " Nowadays, organizations to survive competitively they need to be, innovative and efficient. The way the Internet has been expanding along with other technological changes is leading us to a future in which all the objects that surround us will be seamlessly integrated into information networks. The possibility to implement concepts related with the ubiquitous computing in the business process-level will influence how they are designed, structured, monitored, and managed. One of the most remarkable possibilities of ubiquitous computing can be the real-time monitoring of a particular business process: it should be possible to analyze the flow of materials and information, identify possible points of failure or improve energetic efficiency with a small delay on they occur in reality. Currently, there is no direct and automated link between ubiquitous business processes descriptions and their physical executions which …", "num_citations": "5\n", "authors": ["1147"]}
{"title": "Method for processing and routing financial transactions from capture points and authorized by financial institutions, implemented through software\n", "abstract": " A method for the routing of messages coming from capture points directly, or indirectly, connected to the Tecban network, and authorized by the Financing Institutions, which are also connected to the Tecban network, remarkably conceived to consolidate the ATM network of Tecban, as well as the proprietary networks of the Financing institutions administered by Tecban, through a number of encoded instructions, contained in a software used in computer networks to exchange messages among the several elements involved.", "num_citations": "5\n", "authors": ["1147"]}
{"title": "A two-year software engineering M. Sc. degree designed under the Bologna Declaration principles\n", "abstract": " This paper presents and discusses the syllabus of a second cycle degree on Software Engineering in which any student that finishes any undergraduate Computing degree (Computer Engineering, Computer Science, Information Systems, Information Technology, and Software Engineering) can enroll. In the first year, the degree is composed of two 30-ECTS modules, one dedicated to software analysis and design and the other devoted to software quality and management. Each module is composed of five curricular units, being one of them dedicated to the experimental integration of the module's topics. The second year allows two different paths to be followed by the students. The professional path includes a 30-ECTS industrial project, while in the scientific path students must write a 45-ECTS master dissertation. The degree is mainly structured to consider the Bologna Declaration that is now being used in …", "num_citations": "5\n", "authors": ["1147"]}
{"title": "Integration of Embedded Software with Corporate Information Systems.\n", "abstract": " Abstract; This paper describes a methodology and corresponding tools to support the development of information systems, by integrating and interconnecting a network of embedded devices, that supervise processes in industrial environments, with the corporate information system of an organization. We discuss in detail how the LabVIEW environment was customized, so that it effectively supports a component-based and data-flow approach in the development of the gateway responsible for the integration.", "num_citations": "5\n", "authors": ["1147"]}
{"title": "A Methodological Approach to Domain Engineering for Software Variability Enhancement\n", "abstract": " Flexibility is one of the major quality aspects that are required for today’s applications. Variability realization techniques provide a mean to achieve this flexibility. Some variability realization techniques that provide higher levels of flexibility also imply more complex engineering processes. This is the case of more recent techniques like reflection and run-time code generation. This paper addresses the problem of the increasing of complexity in the engineering process caused by the adoption of very flexible variability realization techniques. We present an approach that is based on the adoption of domain engineering methods within the context of single application development. These methods, when applied in parallel with the application engineering methods, can provide support to manage the complexity of variability realization techniques.", "num_citations": "5\n", "authors": ["1147"]}
{"title": "A simulação como ferramenta de apoio à decisão na engenharia da produção–O sistema GAMS\n", "abstract": " O trabalho descrito neste artigo teve como principal objectivo o desenvolvimento de um Sistema de Apoio à Decisão, que possibilite a geração automática de modelos de simulação com diferentes estratégias de controlo para a redefinição de fluxos de processamento de materiais, ao longo de uma linha de produção da indústria electrónica.", "num_citations": "5\n", "authors": ["1147"]}
{"title": "On the rim between business processes and software systems\n", "abstract": " The constant change and rising complexity of organizations, mainly due to the transforming nature of their business processes, has driven the increase of interest in business process management by organizations. It is recognized that knowing business processes can help to ensure that the software under development will meet the business needs. Some of software development processes (like unified process) already refer to business process modeling as a first effort in the software development process. A business process model usually is created under the supervision, clarification, approval, and validation of the business stakeholders. Thus, a business process model is a proper representation of the reality (as is or to be), having lots of useful information that can be used in the development of the software system that will support the business. The chapter uses the information existing in business process …", "num_citations": "4\n", "authors": ["1147"]}
{"title": "An experience report on using architectural models within distributed Scrum teams contexts\n", "abstract": " Model artifacts in agile software development (or agile modeling) are used to establish a shared understanding on the requirements that the items from the product backlog will address. A common challenge is to have a proper balance between the project's agility and architecture. This shared understanding gains more importance in large-scale contexts composed by multiple agile teams. Teams must clearly define their work scope and interactions with other teams, and architects must design a proper amount of design. This paper describes the application of a process for modeling a candidate logical architecture to be used within a distributed Scrum teams context. The process encompasses agile modeling of a candidate architecture and traceability tools for delivering user stories in a team backlog and usage in inter-team coordination.", "num_citations": "4\n", "authors": ["1147"]}
{"title": "Is Scrum Useful to Mitigate Project’s Risks in Real Business Contexts?\n", "abstract": " This work aims to determine the impact of the agile methodologies usage in software development, in particular, the usefulness and impact of the adoption of Scrum in a real business scenario. The aim is thus whether the adoption and implementation of this methodology, has contributed, and to what extent, for the mitigation of the risk management of software project and for the quality of the software. In order to be possible this study was carried out an investigation, which was distributed internationally, via discussion groups of professionals, followers and supporters of this methodology. Some of the issues explored were: the impact on elicitation of requirements; communication between team’s members and the result of the development - the product. The aim is to also check if the function, role or the culture of the element is an influential factor in your opinion and attitude towards this methodology.", "num_citations": "4\n", "authors": ["1147"]}
{"title": "Dependency analysis between PMI portfolio management processes\n", "abstract": " Software projects are no longer managed in isolation, but as a core business activity increasingly exposed to a high-level of rigor and responsibility. In this context, portfolio management efforts should be adopted in order to meet the organization’s strategic goals. The Project Management Institute (PMI) has developed the ‘Standard for Portfolio Management’, whose objective is to propose a strategy for project portfolio management through processes. An efficient adoption of this PMI standard to manage projects in software development companies benefits from a thoroughly understanding of the existing dependencies among all portfolio management process. This paper presents the dependencies among all portfolio management process from the standard for portfolio management from PMI. The presented dependencies were identified by performing a systematic analysis of the process groups and …", "num_citations": "4\n", "authors": ["1147"]}
{"title": "Aligning business requirements with services quality characteristics by using logical architectures\n", "abstract": " Derivation of logical architectures has been largely focused on the elicitation of functional requirements, disregarding the non-functional ones. Consequently, relevant business requirements content is not reflected in the information system architectural solution, so lowering its quality. Although research has recently been approaching this issue, much is left to do, especially regarding the alignment of business requirements with the logical architecture components. Following our proposed metamodel for relating processes, goals and rules (PGR), elicited from business requirements, and the 4SRS-SoaML method for the derivation of a logical architecture in SOA environments, we now aim to extend our work by generating the quality information associated to architectural services from business requirements. By extending our PGR metamodel to include the architectural services and associated quality …", "num_citations": "4\n", "authors": ["1147"]}
{"title": "Generating a Business Model through the Elicitation of Business Goals and Rules within a SPEM approach\n", "abstract": " Business Models play a pivotal role in organizations, especially in building bridges and enabling dialogue between business and technological worlds. Complementarily, as Use Cases are one of the most popular techniques for eliciting requirements in the design of Information Systems, Business Goals and Business Rules associate with Business Process Use Cases to compose a Business Model base structure. However, methods for relating Business Processes, Goals and Rules (PGR) are scarce, dissonant or poorly grounded. In this sense, we propose the specification of a method, within a SPEM approach, covering the elicitation of Business Goals and Rules from Process-level Use Cases, and their mapping to a Business Model representation. As a result, a tailorable method for the generation of a solution Business Model, by aligning the resulting trios (PGR) with a Business Model Canvas, is …", "num_citations": "4\n", "authors": ["1147"]}
{"title": "A demonstration case on steps and rules for the transition from process-level to software logical architectures in enterprise models\n", "abstract": " At the analysis phase of an enterprise information system development, the alignment between the process level requirements (information systems) with the product level requirements (software system) may not be properly achieved. Modeling the processes for the enterprise’s business is often insufficient for implementation teams, and implementation requirements are often misaligned with business and stakeholder needs. In this paper, we demonstrate, though a real industrial case, how transition steps and rules are used to assure that process- and product-level requirements are aligned, within an approach that supports the creation of the intended requirements. The input for the transition steps is an information system logical architecture, and the output is a product-level (software) use case model.", "num_citations": "4\n", "authors": ["1147"]}
{"title": "Building green systems with green students: An educational experiment with geni infrastructure\n", "abstract": " Experimentation in system-oriented courses is often challenging, due to the raw and complex nature of the underlying infrastructure. In this work, we present our findings in teaching cloud computing to upper-level and graduate level students with GENI testbeds that are in use by the distributed systems community. The possibility of giving students practical and relevant experience was explored in the context of new course assignment objectives. Furthermore, students were able to explore systems concepts using GENI testbeds, and contribute to a collaborative class wide project with medium scale computation using satellite data. Our proposed set of experiments and course project provide a basis for an evaluation of the tradeoffs of teaching cloud and distributed systems. However, the software engineering challenges in these environments proved to be daunting. The amount of installation, configuration, and …", "num_citations": "4\n", "authors": ["1147"]}
{"title": "Fruits of Mimosa foliolosa (Fabales: Fabaceae) as Sleeping Shelter for Megachile (Pseudocentron) botucatuna (Hymenoptera: Megachilidae)\n", "abstract": " Several plant parts or organs are often used by insects for aggregation and even as resting areas. We first report the use of fruits of the legume Mimosa foliolosa pachycarpa as a night shelter for Megachile (Pseudocentron) botucana Schrottky (Hymenoptera: Megachilidae) in Serra do Cipó, southeastern Brazil. Only a single bee was found per fruit, in 86 fruits out of 1,003 fruits opened. The present findings augmented the occurrence of the phenomenon among bees, which is new to the harsh mountaintop environments in the Brazilian rupestrian fields.", "num_citations": "4\n", "authors": ["1147"]}
{"title": "Modeling Organizational Information System Architecture Using\" Complex Networks\" Concepts\n", "abstract": " Organizations live in a world where interdependence, self-organization and emergence are factors for agility, adaptability and flexibility plunged into networks. Software-based information systems go into a service oriented architecture direction and the same goes to Infrastructures where services are become structures available in networks. Inspired into empirical studies of networked systems such as Internet, social networks, and biological networks, researchers have in recent years developed a variety of techniques and models to help us structurally understand or predict the behavior of these systems. Those findings are characterized by been supported on the \"complex networks\" concepts. On this PhD research we present the use of the concepts of complex networks from physics to develop organizational information system architectural models, as requirements modeling technique. The research is about the …", "num_citations": "4\n", "authors": ["1147"]}
{"title": "Profiling and framing structures for pervasive information systems development\n", "abstract": " Pervasive computing is a research field of computing technology that aims to achieve a new computing paradigm. Software engineering has been, since its existence, subject of research and improvement in several areas of interest. Model-Based/Driven Development (MDD) constitutes an approach to software design and development that potentially contributes to: concepts closer to domain and reduction of semantic gaps; automation and less sensitivity to technological changes; capture of expert knowledge and reuse. This paper presents a profiling and framing structure approach for the development of Pervasive Information Systems (PIS). This profiling and framing structure allows the organization of the functionality that can be assigned to computational devices in a system and of the corresponding development structures and models, being. The proposed approach enables a structural approach to PIS …", "num_citations": "4\n", "authors": ["1147"]}
{"title": "Systematic use of software development patterns through a multilevel and multistage classification\n", "abstract": " Software patterns are reusable solutions to problems that occur often throughout the software development process. This chapter formally states which sort of software patterns shall be used in which particular moment of the software development process and in the context of which Software Engineering professionals, technologies and methodologies. The way to do that is to classify those patterns according to the proposed multilevel and multistage pattern classification based on the software development process. The classification is based on the OMG modeling infrastructure or Four-Layer Architecture and also on the RUP (Rational Unified Process). It considers that patterns can be represented at different levels of the OMG modeling infrastructure and that representing patterns as metamodels is a way of turning the decisions on their application more objective. Classifying patterns according to the proposed …", "num_citations": "4\n", "authors": ["1147"]}
{"title": "Can UML be a System-Level Language for Embedded Software?\n", "abstract": " The main purpose of this paper is to discuss if the Unified Modeling Language (UML) can be used as a system-level language (SLL) for specifying embedded systems, in co-design environments. The requirements that a language has to fulfil to be considered as an SLL are presented and the advantages and disadvantages of using UML as an SLL are also indicated. The contribution of this paper consists on the explicit discussion of the key issues that must be taken into account when deciding if UML is to be used in a project as an SLL for embedded software.", "num_citations": "4\n", "authors": ["1147"]}
{"title": "Genetic regulatory mechanisms by means of Extended Interactive Petri Nets\n", "abstract": " We choose to integrate formalism for knowledge representation with formalism for process representation as a way to specify and regulate the overall activity of a multi cellular agent. The result of this approach is XP/sub i/N, another formalism, wherein a distributed system can be modeled as a collection of interrelated sub nets sharing a common explicit control structure. Each sub net represents a system of asynchronous concurrent threads modeled by a set of transitions. XP/sub i/N combines local state and control with interaction and hierarchy to achieve a high level abstraction and to model the complex relationships between all the components of a distributed system. Viewed as a tool, XP/sub i/N provides a carefully devised conflict resolution strategy that intentionally mimics the genetic regulatory mechanism used in an organic cell to select the next genes to process.", "num_citations": "4\n", "authors": ["1147"]}
{"title": "Business process modeling languages and their data representation capabilities\n", "abstract": " Business Process Management enables organizations to accomplish the needs of change and simultaneously support the adaptation to new situations, improving their own business performance. Business process modeling is the core technical sub-phase during which the process design and the process modeling techniques can be used in information systems development. Within this context, a business process model is considered the main interface for implementing business processes. For this purpose, several different approaches for business process modeling have been developed, making available many different Business Process Modeling Languages. In particular, we refer to Business Process Model and Notation, Data Flow Diagram, Event-driven Process Chains, Unified Modeling Language, Integration DEFinition Methods, Business Process and Role Activity Diagram. Specifically, in BPMN 2.0, the …", "num_citations": "3\n", "authors": ["1147"]}
{"title": "A conceptual social media tool for supporting collaborative university-industry R&D programs\n", "abstract": " This paper aims to help professionals and academics involved in collaborative university-industry R&D programs and projects, by presenting a conceptual social media tool that can be used to improve communication and collaboration between internal stakeholders. The social media tool conceptualization was developed based on a case study research strategy. The case selected was a large publicly funded R&D collaborative program that covers 30 R&D projects carried out by a university and an industry partner. During the case study analysis three research methods were applied: participant observation, document analysis, and focus groups. The social media tool is conceptualized in seven functional building blocks: identity, relationships, sharing, presence conversations, reputation and groups. For each building block, its main objectives and requirements are detailed, within this particular context of …", "num_citations": "3\n", "authors": ["1147"]}
{"title": "Tailoring ISO/IEC/IEEE 29119-3 standard for small and medium-sized enterprises\n", "abstract": " IT companies tend to overlook software development processes, and, consequently, end up following poorly defined or inconsistent software development and testing process, in part due to their associated high costs, complexity and extensiveness of some of these processes and associated standards. In addition, according to our experience, these organizations show severe difficulties when attempting to follow and apply existing standards related to regulation and software testing processes, as is the case of the ISO 29119-3 standard. Therefore, this paper discusses the applicability of this ISO 29119-3 standard in Small and Medium-size Enterprises (SMEs), by presenting an iterative and interactive process for tailoring. The goal is to satisfy the testing process needs of these SMEs, combining the software development process with key points of the ISO 29119-3 standard, without infringing its integrity. The tailoring …", "num_citations": "3\n", "authors": ["1147"]}
{"title": "Input and output artefacts in portfolio practices from the OGC standard for Management of Portfolios\n", "abstract": " There is a new economic paradigm that establishes the need for continuous updating, concern with customer satisfaction and the generation of products and services with higher added value in the software development organizations. The organizations execute projects with the objective of support their operations, to respond the strategic objectives or a challenge/idea, to resolve a problem or investment opportunities. The projects represent the business of software development organizations, thus, the decision making of which projects to be developed is very important. Within the scope of management of project portfolios these concerns are included.. The Office of Government Commerce (OGC) developed “Management of Portfolios” (MoP), whose objective is to propose a set of practices for management of project portfolios. This paper presents input and output artefacts in portfolio practices from the OGC …", "num_citations": "3\n", "authors": ["1147"]}
{"title": "Transition from information systems to service-oriented logical architectures: formalizing steps and rules with QVT\n", "abstract": " Specifying functional requirements brings many difficulties namely when regarding the cloud services. During the analysis phase, the alignment between the process-level requirements (information systems) with the product-level requirements (service-based software) may not be properly achieved or even understood. In this chapter, we describe an approach that supports the creation of the intended requirements, beginning in a process-level and evolving to a product-level perspective, to elicit requirements for specifying services that execute in a cloud computing environment. The transition between perspectives are supported by UML model transformations, encompassing a set of transition rules using QVT, from one perspective to the other, in order to assure that process- and product-level requirements are aligned.", "num_citations": "3\n", "authors": ["1147"]}
{"title": "Omission and Resupply of Nitrogen Affect Physiological and Enzymatic Activities and the Gene Expression of Eucalypt Clones\n", "abstract": " The mineral nutrient uptake of plants in the field occurs in pulses, due to variations in the substance concentrations at the root surface. The fluctuations in nutrient supply probably induce changes in the plant, which are to date unknown for Eucalyptus. This study evaluated these changes in plant growth, nutritional status, photosynthesis, and gene expression, which can serve as biomarkers of the nitrogen status, of four eucalypt clones exposed to N omission and resupply. A greenhouse experiment with four Eucalyptus clones was installed, and after initial growth exposed to N omission for 21 d, followed by N resupply in nutrient solution for 14 d. Nitrogen omission decreased the total N and photosynthetic pigments, net photosynthesis and photochemical dissipation, and increased enzyme activity especially in leaves and the gene expression in leaves and roots. Nitrogen resupply decreased these variations, indicating recovery. The total N concentration was highly and significantly correlated with net photosynthesis, enzyme activity, expression of genes GS2;1 and Gln1;3 in the leaves and AMT1;2 in the roots, contents of chlorophyll a and b, and photochemical energy dissipation. The enzymes GS and NR in the leaves and the genes AMT1;2, GS2;1 and Gln1;3 proved to be sensitive N indicators.", "num_citations": "3\n", "authors": ["1147"]}
{"title": "MATRA: A Framework for Assessing Model-based Approaches on the Transformation between Requirements and Architecture\n", "abstract": " The activity of linking requirements and software engineering, as described by the Twin Peaks model, has set the standard for the transformation between business requirements and system architectures. Still, much is left to do regarding model-based activities in this topic where numerous proposals occur. Although counting on a set of common issues vital for their success, analysing or comparing any of these approaches remains a challenging task. Following previous work on their systematic review and comparison, and supported in a set of selected proposals focused in model-based approaches, we present a framework covering their involved key issues which allows classifying and assessing the different approaches. Accordingly, besides proposing the conceptual design of the framework we demonstrate its use by applying it to the selected transformation approaches, in order to validate this solution …", "num_citations": "3\n", "authors": ["1147"]}
{"title": "A Three-dimensional Approach for a Quality-based Alignment between Requirements and Architecture\n", "abstract": " The relation between requirements and architecture is a crucial part of an information system, standing as one of the main challenges for its successful development, with traditional projects focused on the connection of functional requirements with architecture components having a tendency to ignore quality concerns. As the quality attributes of a system support its architecture high level structure and behavior, also being highly related to its early nonfunctional requirements, there is a pressing need to align these two realities. Following our solution for aligning business requirements with services quality characteristics by derivation of a logical architecture, we now propose the specification of a metamodel and method supporting a three-dimensional approach for handling the alignment of quality issues between requirements and architecture. Taking advantage of a cube structure and method definition …", "num_citations": "3\n", "authors": ["1147"]}
{"title": "iFloW: an integrated logistics software system for inbound supply chain traceability\n", "abstract": " Visibility plays an important role in supply chain management. Such visibility is not only important for better planning, but especially for real-time execution related with the traceability of goods. In inbound supply chain management, logistics planners need to trace raw materials from their requests in order to properly plan a plant’s production. The iFloW (Inbound Logistics Tracking System) integrates logistics providers IT applications and Global Positioning System (GPS) technology to track and trace incoming freights. The Estimated Time of Arrival (ETA) is updated in real-time allowing an improved materials planning process. This paper presents the iFloW project and describes how these issues are addressed and validated in a real pilot project.", "num_citations": "3\n", "authors": ["1147"]}
{"title": "Requirements Negotiation and Prioritisation\n", "abstract": " The quality of a software application is highly dependent on its ability to meet the necessities of customers and users, so it is crucial to capture and specify all requirements that the system must possess. However, many projects have more candidate requirements than those that can be built without exceeding the available time and budget. This chapter presents and discusses the need to allow stakeholders to collectively negotiate the requirements in order to decide which ones shall be incorporated in the system. The chapter also discusses the importance of assigning priorities to requirements, in the context of a system project. The aspects related to requirements prioritisation and some of the most popular prioritisation techniques are also presented.", "num_citations": "3\n", "authors": ["1147"]}
{"title": "Requirements elicitation\n", "abstract": " Requirements elicitation is one of the crucial tasks of the requirements engineering process, as it allows one to discover which requirements the users want to see incorporated into the system at hand. The core content of this chapter is the description of some techniques that can be applied to elicit requirements. The chapter presents a non-exhaustive, but sufficiently representative, set of requirements elicitation techniques that can be used in engineering projects. Additionally, the chapter discusses a generic process that can be adopted for eliciting requirements and it describes some of the potential stakeholders of the system.", "num_citations": "3\n", "authors": ["1147"]}
{"title": "Exploring a three-dimensional, requirements-based, balanced scorecard business model: on the elicitation and generation of a business model canvas\n", "abstract": " Business models play a pivotal role in organizations, building bridges and enabling dialogue between business and technological worlds. Also, goals and rules associate with processes to compose its base structure, driving and supporting the organization's strategy. Additionally, as balanced scorecards are the reference in strategy management, a combination of these three dimensions can lead to a stronger, more strategy-oriented, business model, aggregating functional, nonfunctional and strategy dimensions. Following our proposal for the specification of a three-dimensional business model, covering the elicitation of business goals and rules from process level use cases, and their connection to balanced scorecard, we now aim to explore it with a practical application scenario. Taking advantage of a cube structure and a method definition within a SPEM approach, which is adaptable to model variations, our …", "num_citations": "3\n", "authors": ["1147"]}
{"title": "Deriving UML logical architectures of traceability business processes based on a GS1 standard\n", "abstract": " A good traceability business process (BP) regards a powerful tool for industrial and manufacturing organizations to pursuit effective productivity. However, there is a lack of a common understanding among its key stakeholders on implementing a proper traceability BP. In this paper, we propose the use of software engineering approaches, namely the design of a process-level logical architecture for the traceability BP. This logical architecture captures the main activities, responsibilities, boundaries, and services involved in the traceability BP. The logical architecture was derived based on a use case model that arose from the requirements elicitation of activities as the ones proposed by the GS1 standard.", "num_citations": "3\n", "authors": ["1147"]}
{"title": "Importance of risk process in management software projects in small companies\n", "abstract": " Since the attacks of Sept. 11, companies around the world started to value and adopt the process of risk management in their operations. Models and frameworks have been created and enhanced with focus in risk. Successive studies have been published about the failure in software projects where the percentage has remained high. One of the reasons for the failures are directed to cases of non-adoption of systemic processes in their activities. Begin to identify, analyze, assess and treat risks systematically is not an obvious task. Specifically in small companies, where financial and human resources are limited, the difficulty in introducing new processes is even greater. To contribute to these software projects, this work presents the activities of a risk management process, in order to insert the culture and capacity of professionals who work in such projects, can objectively target to the mitigation of risks into …", "num_citations": "3\n", "authors": ["1147"]}
{"title": "Modularization of logical software architectures for implementation with multiple teams\n", "abstract": " In the end of a requirements elicitation phase, it is expectable that all information can be properly perceived by the implementation teams. In our work, we faced the problem of dealing with a large set of requirements that need to be implemented by different teams, to ensure on-time delivery. The teams are physically separated and with different working cultures and skills. The system requirements were (semi)automatically derived from user requirements, are framed within a logical architecture (of the intended system) and the desired high-level execution scenarios are defined and included in the requirements description. Due to the large size of the architecture and to the nature of the working environment, the architecture must be divided before being delivered. In this paper, we present our approach for dividing the logical architecture of the intended system into modules to be delivered for implementation. The …", "num_citations": "3\n", "authors": ["1147"]}
{"title": "Complex-Networks model analysis for the conceptualization of information systems development\n", "abstract": " Typically, each information system implementation includes technological components that store data that reflects the interplay between the information technology and its users. That interplay reflect the information system connectivity (the way how, when and who information systems elements interact). The understanding about the behavior of that connectivity can play an important role on the conceptualization of the development of the information systems. This behavior of connectivity can be modeled with what is traditionally called complex-networks; ie, quantified representations of the information system connectivity that allows the analysis of the information system behavior.This paper presents a framework to construct complex-networks models (CN-Models) of information systems and how these models can be analyzed to conceptualize some characteristics of the information system. The conceptualization includes measurements of the connectivity. Those measurements allow the characterization of the information systems integration, segregation, centrality and resilience developing a quantified conceptualization of the information systems development. We apply the conceptualization to an exploratory case study of an Enterprise Resource Systems (ERP).", "num_citations": "3\n", "authors": ["1147"]}
{"title": "On the use of model transformations for the automation of the 4SRS transition method\n", "abstract": " Automation is the essence of MDD (Model-Driven Development). Transforming models into models following a set of rules is at the core of automation. It allows using tools to enliven processes that have been defined. Transition methods are most likely the most important player in the engineering of software. The 4SRS (Four Step Rule Set) is a transition method we adopt in this paper to focus the discussion on the transition from the analysis to the design of software. It has been formalized as a small software development process that can be plugged into larger software development processes. That formalization was conducted with the SPEM (Software & Systems Process Engineering Metamodel), which is a process modeling language for the domain of software and systems. This paper exemplifies how a transition method like the 4SRS can be modeled with the SPEM as a way to study the benefits of the …", "num_citations": "3\n", "authors": ["1147"]}
{"title": "Work in progress-IEEEXtreme: From a student competition to the promotion of real-world programming education\n", "abstract": " IEEEXtreme is an IEEE Student Activities Committee initiative to create a worldwide programming contest for IEEE student branches. The success of the past editions and the way IEEEXtreme is evolving, suggests that it will become the only worldwide competition capable of promoting the computer programming skills of collegiate students within a global software engineering approach of real-world programming problems. Real-world problems that require programming skills are invariably framed within a software engineering approach, where code writing is just the visible dimension of the global effort. Professionals are increasingly compelled to work in multidisciplinary contexts where soft skills are as important as technical ones. This reality should be expressly considered when educational courses are planned to teach programming techniques at undergraduate level. This paper discusses the positive impact …", "num_citations": "3\n", "authors": ["1147"]}
{"title": "Recent advances in model-based methodologies for pervasive and embedded software\n", "abstract": " We report on recent advances in Model-based Methodologies for Pervasive and Embedded Software. This paper describes the research presented at MOMPES 2009, the 6th edition of a workshop series. The MOMPES workshops focus on the theoretical and practical aspects related to the adoption of model-based development methodologies for supporting the construction of software for pervasive and embedded systems. The workshops usually gather researchers from both industry and academia. In 2009, the workshop included papers tackling both foundational and application research themes related to embedded systems. We describe the main contributions of these papers, and point out further results on recent advances in this area.", "num_citations": "3\n", "authors": ["1147"]}
{"title": "An object-oriented approach to the co-design of industrial control-based information systems\n", "abstract": " This paper defines a system-level hardware/software co-design approach to the development of real-time applications, which allows the implementation of industrial control-based information systems. The relevance of the co-design-based development presented resides in the fact that with the three-level project decoupling proposed it is easier to benefit from the speed-up that results from the use of reconfigurable processing architectures in the implementation of critical and real-time requirements. This methodology defends the use of homogeneous, neutral-object-oriented and executable specifications, the adoption of the operational approach and the spiral process model to support an architectural-pattern-based inward-level microprocess design flow. Copyright© 2000 IFAC", "num_citations": "3\n", "authors": ["1147"]}
{"title": "Smart Cities: Using Gamification and Emotion Detection to Improve Citizens Well Fair and Commitment\n", "abstract": " World population is shifting near cities to get closer to amenities, to obtain improved working conditions or just because they enjoy the nearness of a huge availability of services that cities offer. In recent times, there has been an exponential growth on this tendency. This tension that residents force into cities, needs an improved administration of public organizations and services. Adding to that the extensively available technology, predominantly the huge evolution of mobile device users, the need and the opportunity for new digital services and platforms arises. Turning a city into a so-called “smart city” is the new approach to mitigate problems generated by the urban population growth and rapid urbanization. Newer and better ways of achieving the envisioned goals are being developed and experienced. Gamification is one of such examples; where communication between organizations and people’s is …", "num_citations": "2\n", "authors": ["1147"]}
{"title": "Does the Lean Inception Methodology Contribute to the Software Project Initiation Phase?\n", "abstract": " This work aims to make a comparative analysis of the Lean Inception methodology and the Scrum methodology applied in the initiation phase of the embedded software project that consists of a small greenhouse for the indoor cultivation of sage, controlled by a cell phone application. The Lean Inception methodology is a combination of Lean Startup and Design Thinking that, at the end of the process, quickly obtains the Minimum Viable Product (MVP). Some of the questions explored in this paper were how much the Lean Inception methodology interferes in the agility of the production of MVP, how much it influences in the quality of the final product and depicting advantages in using this methodology in the project initiation phase.", "num_citations": "2\n", "authors": ["1147"]}
{"title": "Key initiatives to successfully manage collaborative university-industry R&D: IC-HMI case study\n", "abstract": " This paper describes the results of a qualitative study to identify the key management initiatives in a successful university-industry (UI) collaborative funded program between the University of Minho (UMinho) and Bosch Car Multimedia Portugal (Bosch), named IC-HMI. The IC-HMI program embraced an overall investment of 54.7 M€ and involved around 500 people throughout the Program’s duration (2015-2018). While the literature provides some advice on managing programs and projects, the specific context of UI R&D collaboration is being scarcely reported, demanding a strong research effort to produce effective guidelines. The IC-HMI is considered a successful program for several reasons, as evidenced by the decision of UMinho and Bosch partners to develop a subsequent R&D collaborative program from 2018 to 2021, doubling its investment. The success attained with the IC-HMI program could be …", "num_citations": "2\n", "authors": ["1147"]}
{"title": "Systems development for the industrial IoT: challenges from Industry R&D projects\n", "abstract": " Industrial paradigms such as Industry 4.0 (I4.0), also known as Industrial Internet of Things (                   IIoT                                    ), provide an insight into the use of underlying Internet of Things (IoT) technologies in an integrated manner. In order to follow the IoT vision and gain the inherent benefits, industrial information systems providers have been modernizing their solutions. However, the complexity of such systems has been proving an obstacle in developing efficient solutions. Following the trends of the industrial IoT including Smart Manufacturing, Connected Factories, and Factories of the Future, industrial and academic projects have also been aiming at developing better solutions for IIoT-related projects. Such solutions typically heavily rely on interoperability requirements between sensors, actuators and other IoT-based diverse smart devices toward, for example, supply chain and production …", "num_citations": "2\n", "authors": ["1147"]}
{"title": "I&DT em colaboração universidade-indústria: modelo de governação\n", "abstract": " O presente documento visa a apresentação, de forma sistematizada, de um Modelo de Governação, cujo objetivo é o de providenciar funções e responsabilidades, processos e ferramentas que ajudem a garantir a governação dos Programas e Projetos desenvolvidos em contexto colaborativo entre Universidade-Industria (UI), no âmbito de programas de financiamento. O principal objetivo do Modelo de Governanção é garantir os quatro princípios da governação: accountability, responsability, transparency and fairnes (OECD, 2004), de forma a promover a confiança entre os parceiros. Sendo a confinça um dos principais factor critícos para o sucesso das colaborações universidade-industria. Deste modo, o Modelo de Governação tem em consideração a existência de entidades parceiras (Promotor e Copromotores), entidade financiadora e intermédia e entidades externas, ao longo da sua descrição.  O Modelo de Governação apresentado neste documento tem por base a abordagem de Program and Project Management Approach for Collaborative University-industry R&D Funded Contracts de Fernandes et al. (2015), e de outras publicações dos autores no tema (ver secção de bibliografia), os processos e ferramentas desenvolvidos e aplicados na prática nos Programas de Colaboração UI, HMIExcel  e IC-HMI , e as respetivas lições aprendidas recolhidas ao longo do ciclo de vida dos Programas. Todos as processos e ferramentas explanadas neste documento, visam uma melhor coordenação entre as entidades parceiras, sendo, em especial, destinado à  Coordenação de Programa e à Equipa Project Management Office (PMO). A …", "num_citations": "2\n", "authors": ["1147"]}
{"title": "Mapping between PMI and OGC artefacts for project portfolio management\n", "abstract": " This paper presents a mapping between the artefacts from the two recognized portfolio management standards: the `Standard for Portfolio Management' from Project Management Institute (PMI) and the `Management of Portfolios' (MoP) from Axelos developed by the Office Government Commerce (OGC). The purpose of this paper is to increase our understanding of \"how to perform\" project portfolio management as the project portfolio management in organizations is still not well structured. The overall mapping between PMI and OGC artefacts shows that PMI artefacts has more detailed by OGC artefacts. Only two artefacts from PMI and OGG have a similar correspondence, `Portfolio' and the `Portfolio Roadmap'. The OGC artefacts `Portfolio's Business Case' and the `Portfolio Skills Register', are not concepts explored in PMI artefacts. The paper shows the explanatory power of the portfolio artefacts for conducting the …", "num_citations": "2\n", "authors": ["1147"]}
{"title": "Guimarães: innovative and engaged city\n", "abstract": " This paper addresses the theme of smart cities and all their influence on citizens. The concept of intelligent city is diverse, as it is influenced by the different technologies and solutions that provide citizens well-being. The solutions presented intend to go beyond the smart city definition, focusing on issues of citizen engagement, commitment and participation, walking towards the happy city definition. Artificial Intelligence, Cognitive Computing and IoT as basis for integrating innovative solutions.", "num_citations": "2\n", "authors": ["1147"]}
{"title": "Deriving user stories for distributed Scrum teams from iterative refinement of architectural models\n", "abstract": " Models provide are beneficial when the solution has a perceived complexity, and may be used as a shared understanding when the project is composed by distributed teams. However, the use of models needs contextualization for agile-oriented backlog items. This paper proposes a process for modeling in UML a set of\" just-enough\" requirements and a candidate architecture, ending with a set of user stories included in a team backlog.", "num_citations": "2\n", "authors": ["1147"]}
{"title": "Product focused software process improvement through integrated framework of agile and CMMI: A case in small settings\n", "abstract": " Software process improvement (SPI) is an important requirement in a software company. The search for better approach brought different kinds of models with multiple sets of principles for SPI to be founded. The framework is proposed to mainly address an alternative way of achieving a better process capability. The approach focuses on the implementation of SPI which can seamlessly align with the organization nature, day to day business activities, and financial capability. The paper provides the detailed implementation guideline and application of the framework through case study results.The case study is performed in a software development unit placed under academic institution. The unit is founded specifically for application development for internal and external customers. The case study is designed to be implemented in two software development projects in the development unit. From the ongoing case study, the results from the first project which is completed in six iterations are presented in this paper. Considering SPI implementation, the development team followed the framework and associated procedures throughout the development process. The results obtained in terms of aligning SPI to the daily development task and CMMI KPAs capability improvement achieved showed promising results.", "num_citations": "2\n", "authors": ["1147"]}
{"title": "Improving photovoltaic applications through the paraconsistent annotated evidential logic eτ\n", "abstract": " The contrast between large urban centers and other isolated locations where even the most basic resources are scarce, leads the development of self-sustainable solutions, a panorama in which the electrical power is an important demand to be supplied. Through Bibliographic and Experimental research, plus practical implementation and testing, it was possible to develop an improving solution which fits within the proposed needs. This paper aims to present a self-oriented photovoltaic system based upon the Paraconsistent Annotated Evidential Logic Eτ, its construction and practical tests, where an average yield of 3.19 W was obtained against 2.44 W from a fixed panel, representing an increase of 31.56 % in the overall power.", "num_citations": "2\n", "authors": ["1147"]}
{"title": "Modeling an IaaS broker based on two cloud computing reference models\n", "abstract": " Due to its rapid growth, short history and lack of regulation, eliciting the requirements for an information system broker in an IaaS Cloud Computing context can be a challenging task. Reference models such as the NIST Cloud Computing Reference Architecture and The Open Group Cloud Ecosystem Reference Model stand as recognized models in this domain. Additionally, Use Case models allow representing the process view of a system and can be considered as an adequate elicitation method for the cloud. Mapping these processes on both reference models may allow for a Cloud Computing-suitability check for a proposed solution. Along these lines, we present the results of our work on an industrial project for a cloud broker platform in an IaaS service model. This approach allows for a feasibility and consistency check of the elicited system, pointing some incompletions and flaws, but also important …", "num_citations": "2\n", "authors": ["1147"]}
{"title": "SPEM 2.0 extension for pervasive information systems\n", "abstract": " Pervasive computing is a research field of computing technology that aims to achieve a new computing paradigm. In this paradigm, the physical environment has a high degree of pervasiveness and availability of computers and other information technology (IT) devices, usually with communication capabilities. Pervasive Information Systems (PIS), composed by these kinds of devices, bring issues that challenge software development for them. Model-Driven Development (MDD), strongly focusing and relying on models, has the potential to allow: the use of concepts closer to the domain and the reduction of semantic gaps; higher automation and lower dependency to technological changes; higher capture of expert knowledge and reuse; an overall increased productivity. Along with the focus and use of models, software development processes are fundamental to efficient development efforts of successful software systems. For the description of processes, Software & Systems Process Engineering Meta-Model Specification (SPEM) is the current standard specification published by the Object Management Group (OMG). This paper presents an extension to SPEM (version 2.0) Base Plug-In Profile that includes stereotypes needed to support a suitable structural process organization for MDD approaches aiming to develop software for PIS. A case study is provided to evaluate the applicability of the extension.", "num_citations": "2\n", "authors": ["1147"]}
{"title": "Support for variability in use case modeling with refinement\n", "abstract": " The development of software product lines with model-driven approaches involves dealing with diverse modeling artifacts such as use case diagrams, component diagrams, class diagrams, activity diagrams, sequence diagrams and others. In this paper we focus on use cases for product line development and we analyze them from the perspective of variability. In that context we explore the UML (Unified Modeling Language)«extend» relationship. We also explore the functional refinement of use cases with «extend» relationships between them. This work allows understanding the activities of use case modeling with support for variability and of use case modeling with functional refinement when variability is present.", "num_citations": "2\n", "authors": ["1147"]}
{"title": "Multistage model transformations in software product lines\n", "abstract": " Raising the level of abstraction for software engineers to write applications is still an undergoing issue. So, models will most likely become the dominant artifact in the development of software. However, models are nothing without the framing of a methodology, like the software factories methodology, which includes the software product lines approach. In the context of software product lines, model-driven development imposes the structuring of the software development process around models adequate to each one of the moments within the software supply chain. The different moments are the different stages that comprise different development teams, as well as the target user of the different software family members. This multistage process is a powerful vision of software development in general when compared with the current software development processes' state-of-the-art and this is the vision that feeds the …", "num_citations": "2\n", "authors": ["1147"]}
{"title": "Automated Information Systems Generation for Process-Oriented Organizations\n", "abstract": " Currently, the development of organizational information systems remains a complex task. Final software product quality often does not match expectations. The existence of organizational models is the first step to reduce complexity in the development of information systems. Within the life cycle of an information system, activities are still very dependent in quality, time, and costs on the human resource skills that staff them. The existence of automated mechanisms to transform client requirements into characteristics of running systems would bring added value to the resulting software product, either in product quality and time perspectives. In this proposal, the manipulation of requirements must be done using an understandable model for both software engineers and business process experts. This model should be used to automatically reshape the running organizational information system and be the basis for an …", "num_citations": "2\n", "authors": ["1147"]}
{"title": "Os sistemas de informação geográfica no suporte a serviços móveis para o cidadão\n", "abstract": " O seguinte artigo descreve os trabalhos de investigação efectuados no âmbito do projecto USE-ME.GOV (USability-drivEn open platform for Mobile GOVernment), um projecto do 6º Programa Quadro, que tem como objectivo o fornecimento de uma plataforma aberta para a disponibilização de serviços móveis ao cidadão, podendo ser partilhada por uma rede de autarquias, instituições públicas e outros fornecedores de serviços de informação. O artigo explica como a informação geográfica e de localização dá suporte à contextualização do utilizador móvel, podendo essa informação ser cruzada e processada com outras dimensões que definem o contexto.", "num_citations": "2\n", "authors": ["1147"]}
{"title": "Run-time Feature Realization based on Domain-Specific Platforms\n", "abstract": " The reuse approach to software engineering is gaining considerable adoption in the software industry. In order to implement such an approach, variability mechanisms are needed. These allow the implementation of the variants in a product line and can be applied at several stages in the software development process. If these mechanisms are used at later stages of the development process, the resulting applications will exhibit a higher degree of variability. This is the case of I2S; a Portuguese software house specialized in software solutions for the insurance industry. Resulting from the need to handle specific requirements from almost all of its customers, and because of the nature of the insurance domain, the company has developed and adopted an approach based on domain-specific languages and domain-specific execution environments. These tools provide support for run-time functional feature variability …", "num_citations": "2\n", "authors": ["1147"]}
{"title": "Engenharia de Domínio no Suporte ao Aumento de Flexibilidade nos Sistemas de Software.\n", "abstract": " A flexibilidade é uma das principais qualidades que são requeridas actualmente às aplicações. As técnicas de implementação de variabilidade fornecem meios para atingir essa flexibilidade. A indústria de software adopta correntemente diversas técnicas de implementação de variabilidade. Estas técnicas fornecem diversos graus de variabilidade. As técnicas que fornecem níveis mais elevados de variabilidade também implicam processos mais complexos de engenharia. Este artigo aborda esta problemática. É proposto um método simples para medir o grau de variabilidade. Mostra-se também como a adopção de métodos de engenharia do domínio, aplicados em paralelo com o método de engenharia da aplicação, pode fornecer um suporte adequado para gerir a complexidade resultante da adopção de algumas técnicas de implementação de variabilidade.", "num_citations": "2\n", "authors": ["1147"]}
{"title": "Redes de Petri e VHDL na prototipagem rápida de sistemas digitais\n", "abstract": " O objectivo principal deste artigo é exemplificar a utilização de uma metodologia de especificação de sistemas digitais, baseada em Redes de Petri orientadas por objectos, para obter de uma forma rápida e simplificada um protótipo em VHDL do sistema pretendido. É considerado para exemplificação um sistema digital, para o qual se efectua a especificação no modelo RdP-shobi e a geração automática de código VHDL. Este exemplo permite concluir acerca da utilidade desta metodologia no projecto de sistemas digitais, suportado por princípios de orientação por objectos e por uma ferramenta de EDA desenvolvida propositadamente para o efeito.", "num_citations": "2\n", "authors": ["1147"]}
{"title": "Extending the scope of reference models for smart factories\n", "abstract": " Industry 4.0 (I4.0), Smart Manufacturing, Industrial Internet, Intelligent Manufacturing, and so forth, are different designations for different initiatives, all contributing to the digital transformation of the industrial ecosystem. Besides several reference models/architectures have been developed, a framework to structure and understand the implications and to identify I4.0 action fields is still needed. A harmonized model would allow guiding the developments on how to organizationally prepare for the change. This paper attempts to clarify the implications and action fields of the I4.0, trying to reveal its mostly alleged dimensions and the main planes in which they intervene in the industrial ecosystem. Through the analysis of the most relevant architectures for I4.0, IoT and Cyber-Physical Systems (CPS), and the consequent awareness of which components are missing, the paper proposes a framework for digital factories …", "num_citations": "1\n", "authors": ["1147"]}
{"title": "A Unified Reference Model for Smart Cities\n", "abstract": " Smart city is a multi-faceted concept perceived in many different perspectives. Cities are multidimensional and highly complex interconnected systems of people, software, machines, and data, bringing new design, construction, and operational challenges. Work has been done on models and reference architectures for smart cities that can help to cope with those challenges. However, also because of the variability of concepts, arrangements of key components, and technology heterogeneity, a unique and universal smart city reference architecture for real world deployment is distant. This paper attempts to clarify the meaning of the concept smart cities, trying to reveal its mostly accepted dimensions and the best arrangement between them. Through an in-depth literature review of relevant studies from academia, international organizations, corporations, and standards development organizations, that gathered and …", "num_citations": "1\n", "authors": ["1147"]}
{"title": "Inputs from a Model-Based Approach Towards the Specification of Microservices Logical Architectures: An Experience Report\n", "abstract": " Adopting microservices architectures (MSA) in software projects include specific concerns on design, development and deployment. Projects often struggle for taking decisions for properly bound the microservices, partition databases, address communication and messaging, among others. Proposing a model-driven approach allows abstracting microservices behavior from the business domain. However, there is still lack of modeling methods supporting architecture design alignment with business requirements that cover microservices principles. In this paper, microservices logical architectures are derived from functional requirements, which are modeled in SoaML diagrams. This paper discusses design, data management, inter-service communication and automatization based on the derived architecture diagram.", "num_citations": "1\n", "authors": ["1147"]}
{"title": "From Program Strategic Planning to Program Initiation: Lessons learned from a collaborative University-Industry R&D case study\n", "abstract": " This paper aims to contribute to knowledge by presenting the lessons learned resultant from a large case study composed by three collaborative University-Industry R&D funded programs between the University of Minho (UMinho) and Bosch Car Multimedia Portugal (Bosch). The three programs selected amount to a total investment of above €109 million, over the period between 2013 and 2021, involving more than one thousand University researchers and Industry collaborators. The lessons learned are limited to the time span from Program Strategic Planning, where new project ideas/innovation opportunities are identified and developed for the preparation of the `Funding Application', to Program Initiation, where the program effectively initiates after the negotiation of the `Funding Contract'. The collection, analysis and implementation of lessons learned allowed the development of a structured process to guide …", "num_citations": "1\n", "authors": ["1147"]}
{"title": "4SRS-SoaML Method for Deriving a Service-Oriented Architecture From Use Cases Within a SPEM Approach\n", "abstract": " The transformation of requirements specification into an architectural design has been a crucial endeavor for the information systems analysis and design community, with ever-new challenges to tackle. Despite the wide and diverse existing proposals, the lack of a common structure and use of different strategies makes it close to impossible to analyze or compare these approaches. Therefore, the use of model-based methods benefits from a detailed specification in order to support their analysis and evolution, also in comparison to other approaches. Following work on the derivation of a logical architecture from business-process use-cases requirements in a service-oriented approach, the authors propose a detailed specification, within a SPEM approach, of a transformation method, which they further analyze and refurbish in order to meet current and future challenges.", "num_citations": "1\n", "authors": ["1147"]}
{"title": "Patient-centric e-Prescription Services-An Integrated System Architecture Proposal\n", "abstract": " Nowadays, it is increasingly important to provide health services that are more comfortable to patients and avoiding some unnecessary costs, such as hospital admissions, hospitalization expenses, unnecessary waiting time to be attended and unnecessary movement of fragile patients. The success of healthcare is related to the communication between health professionals, patients and the services that support the quality of health. Many diseases (e.g., cardiovascular disease) can be monitored from home, and the necessary medicines can reach the patient's home as well. This paper intends to present a proposal for a system architecture to improve the e- Prescription process by placing the patient in the center of the action, allowing to have access to the e-prescribing services and medication without moving from home.", "num_citations": "1\n", "authors": ["1147"]}
{"title": "Incremental architectural requirements for agile modeling: a case study within a scrum project\n", "abstract": " Models may be used as a shared understanding when the project is composed by distributed agile teams. This paper describes the applicability of a process for modeling a small set of requirements and a candidate architecture for a distributed Scrum teams context, addressing the use of such models within the delivery of user stories included in a team backlog and inter-team coordination.", "num_citations": "1\n", "authors": ["1147"]}
{"title": "Applying the paraconsistent annotated evidential logic eτ in a solar tracker for photovoltaic panels: An analytical approach\n", "abstract": " There is an increasing contrast between large urban centers and rural areas, even nowadays, where the most basic resources can be scarce, leading an increasing development of technologies based upon self-sustainable solutions, where the electrical power is an important demand to be supplied. Through Bibliographic and Experimental research, plus a prototype using embedded and real-time software, and its testing, it was possible to develop a workable solution. This paper presents a self-oriented solar panel based on Paraconsistent Annotated Evidential Logic Eτ, its construction and practical tests, where total power of 3.19375 W was obtained against 2.427556 W from a fixed panel of same type, representing an increase of 31.56239% in the overall power.", "num_citations": "1\n", "authors": ["1147"]}
{"title": "Business modeling and requirements in RUP: a dependency analysis of activities, tasks and work products\n", "abstract": " Most artifacts developed during the requirements engineering process relate themselves in different ways. In order to understand in detail how they affect each other during the software development process, it is relevant to identify their interdependencies. This paper presents a systematization of the existing interdependencies between the different elements of the Rational Unified Process (RUP) in the Business Modeling and Requirements disciplines. This work, which highlights knowledge about the different interdependencies and traceability of RUP elements, is useful to avoid unconscious decisions during software the development process and also, to detect potential problems due to the violation of the existing interdependencies.", "num_citations": "1\n", "authors": ["1147"]}
{"title": "Industrial interoperability issues when adopting Scrum in research projects: the case of the iFloW system\n", "abstract": " Developing industrial software systems is challenging mainly due to the required integration with other systems. Any project in this field requires a significant effort in acquiring knowledge from both the industrial field and the technological domain. For this reason, it is very difficult to define an early schedule to any software development project without high probability of delays. Conducting such projects in an agile framework decreases these risks, since customers have the opportunity to frequently interact with the development team in short iterations. Thus, the customers are constantly aware of the characteristics of the product under development. This paper presents issues that the project team faced on adopting Scrum framework in a research and development (R&D) project where integration and interoperability challenges were present.", "num_citations": "1\n", "authors": ["1147"]}
{"title": "Power optimization in photovoltaic panels through the application of paraconsistent annotated evidential logic Eτ\n", "abstract": " The contrast between large urban centers and other isolated locations where even the most basic resources are scarce, leads the development of self-sustainable solutions, a panorama in which the electrical power is an important demand to be supplied. Through Bibliographic and Experimental research, plus practical implementation and testing, it was possible to develop a solution which fits within the proposed needs. This paper presents a self-oriented solar panel based on Paraconsistent Annotated Evidential Logic Eτ, its construction and practical tests, where an average yield of 3.19 W was obtained against 2.44 W from a fixed panel, representing an increase of 31.56 % in the overall power.", "num_citations": "1\n", "authors": ["1147"]}
{"title": "Software Business: 6th International Conference, ICSOB 2015, Braga, Portugal, June 10-12, 2015, Proceedings\n", "abstract": " This book contains the refereed proceedings of the 6th International Conference on Software Business, ICSOB 2015, held in Braga, Portugal, in June 2015. The theme of the event was\" Enterprising Cities\" focusing on a noticeable spillover of software within other industries enabling new business models: Companies bundle their physical products and software services into solutions and start to sell independent software products in addition to physical products. The 16 full, five short, and three doctoral symposium papers accepted for ICSOB were selected from 42 submissions. The papers span a wide range of issues related to contemporary software business—from strategic aspects that include external reuse, ecosystem participation, and acquisitions to operational challenges associated with running software business.", "num_citations": "1\n", "authors": ["1147"]}
{"title": "-Promoting Independent Living and Recreation in Life through Ambient Assisted Living Technology\n", "abstract": " Introduction ................................................................................................................................. 510 AAL4ALL Project ........................................................................................................................ 512Selected AAL Life Settings .................................................................................................... 513 AAL Developments................................................................................................................ 514 Scenario Specification ............................................................................................................ 515State of the Art ............................................................................................................................. 518 Mobile Device Application Development of the AAL4ALL Architecture .......................... 519Integration Features of AAL4ALL ....................................................................................... 519 Mobile Device Application ................................................................................................... 521Functional Profiles for Independent Living and Recreation in Life Scenarios .................. 523 Conclusions …", "num_citations": "1\n", "authors": ["1147"]}
{"title": "A case studies approach to the analysis of profiling and framing structures for pervasive information systems\n", "abstract": " Model-Based/Driven Development (MDD) constitutes an approach to software design and development that potentially contributes to: concepts closer to domain and reduction of semantic gaps, automation and less sensitivity to technological changes, and the capture of expert knowledge and reuse. The widespread adoption of pervasive technologies as basis for new systems and applications lead to the need of effectively design pervasive information systems that properly fulfil the goals they were designed for. This paper presents a profiling and framing structure approach for the development of Pervasive Information Systems (PIS). This profiling and framing structure allows the organization of the functionality that can be assigned to computational devices in a system and of the corresponding development structures and models, being. The proposed approach enables a structural approach to PIS development …", "num_citations": "1\n", "authors": ["1147"]}
{"title": "CULTURis: Leadership for Learning supported by information systems\n", "abstract": " CULTURis fosters the development of collective knowledge, where the primary concern focuses on citizens of all ages and social conditions integrated in a common regional network, to desirably communicate with formal and informal learning and development spaces. Within a collaborative action research methodology, pervasive and ubiquitous technologies (Fernandes, Machado & Carvalho, 2007) are adopted to make tangible the concept of leadership for learning and innovation.  What is evident from the project, as part of the paper that we propose, is the relevance of generating contextual activities for learners in areas of personal and collective action, where the family assumes a nuclear environment of belonging and, as such, the key for involving learners in natural contexts of learning that the community/city can provide in a creative, entertaining, constructively critical, transformative and inclusive way. These activities contextualized within natural environments of belonging, mean structuring niches of daily multiple and significant learning experiences (in the work of Dunst, 2001), configured for glocal innovative postures. Capable of providing, quality and diversity meaningful life opportunities that enable transmuting life with joy, with confidence, while structural axes for plural and global integrated learning and development of citizens, of learners, assuming in itself a concept of leadership and inclusion (Viana & Serrano, 2010).  CULTURis propose creates spaces that represent different learning styles, needs and interests of learners and a contextually model of teacher’s training, which generates learning beyond institutional walls. The …", "num_citations": "1\n", "authors": ["1147"]}
{"title": "A importância da adoção da abordagem de riscos no ensino da engenharia de software\n", "abstract": " Num mercado global cada vez mais competitivo, os engenheiros de software, para atender as demandas empresariais as quais são submetidos, realizam atividades e procedimentos com alta exposição a riscos, nem sempre conhecidos e mensurados. Tendo em vista que, uma minoria dessas empresas adota a gestão de riscos em seus processos, essa exposição pode comprometer a participação e o sucesso dos projetos que estão envolvidos. Para garantir a qualidade do processo, uma abordagem focada em riscos deve ser adotada sistematicamente. Entre as incertezas dos projetos de software, alguns fatores de riscos devem ser tratados. Os prazos e custos estimados, a conformidade com os requisitos de negócios, entre outros, podem ser citados. Através de uma pesquisa bibliográfica foi possível compor um roteiro de atividades de riscos para propiciar um tratamento mais adequado. Para contribuir com o ensino dessas temáticas que envolvem projetos de software, neste trabalho é apresentado um processo de gestão de riscos com a finalidade de inserir a cultura e a capacidade nos profissionais que neles atuam, podendo direcionar objetivamente como mitigar os riscos aos quais são expostos. Completa a abordagem, o fato de este roteiro estar em conformidade com a ISO 31000: 2009.", "num_citations": "1\n", "authors": ["1147"]}
{"title": "Anonymization of Burned-in Annotations in Ultrasound Imaging\n", "abstract": " Most of the mcdical imaging modalities compliant with the Digital Imaging and Communication in Medicine (DICOM) standard are currently conveying patient information and other study related information as visual overlay objects on top of the proper imaging contents. Making these image data publicly available for teaching platforms, clinical trials or maintenance support requires some degree of anonymization. In these cases, identity attributes in a given Service-Object Pair (SOP) instance may be simply removed, encrypted or even replaced by dummy values. All these action will take place at the header of the associated DICOM files by changing the proper tag-value data structures and ensuring the overall file integrity. These procedures alone don't ensure full anonymization in some imaging modalities like ultrasound because identifying annotations are sill conveyed in a burned in manner. The anonymization …", "num_citations": "1\n", "authors": ["1147"]}
{"title": "Introduction to special issue: model-based development methodologies\n", "abstract": " Developing software solutions is not an easy task. Brown [1] names the following difficulties arising in the development of software solutions:(1) understanding highly complex business domains and management of the huge development effort;(2) time-to-market pressures;(3) complexity of target software platforms involving not only new hot technologies, but also a diverse and complex assortment of legacy technology infrastructure frequently kept with poor documentation. The effective development of today’s software applications requires consistent effort to research better approaches, languages, techniques and tools that allow us to face the continuously increasing of complexity. Today, when building large software systems, the main challenge for software developers is to “handle complexity and to adapt quickly to changes”[2]. Model-based development methodologies can be a response to this challenge, as they can “increase productivity and reduce time-to-market”, by developing concepts closer to the problem domain than “those offered by programming languages”[3].", "num_citations": "1\n", "authors": ["1147"]}
{"title": "From Model-Driven Design to Resource Management for Distributed Embedded Systems: IFIP TC 10 Working Conference on Distributed and Parallel Embedded Systems (DIPES 2006 …\n", "abstract": " Embedded computing systems have started to carry out the key control functions in diverse domains such as telecommunications, automotive electronics, avionics and even complete industrial manufacturing lines. Traditionally, such embedded control systems have been implemented in a monolithic, centralized manner. However, distributed and parallel solutions have been steadily gaining popularity. In a distributed setup, the control task is carried out by a number of controllers distributed over the entire system and interconnected as a network by communication components such as field buses. More demanding local control applications require controllers based on parallel architectures or processors with dedicated co-processors. Distribution and parallelism in embedded system design increase the engineering challenges and demand new development methods and tools. From Model-Driven Design to Resource Management for Distributed Embedded Systems contains 16 original contributions as well as 12 invited papers by distinguished invited speakers. These papers were presented at the Working Conference on Distributed and Parallel Embedded Systems (DIPES 2006), which was held in October 2006 in Braga, Portugal, and sponsored by the International Federation for Information Processing (IFIP). This volume covers the following very timely topics: model-driven design, test and evolution of embedded systems, timing analysis and predictability, scheduling, allocation, communication and resource management in distributed real-time systems.", "num_citations": "1\n", "authors": ["1147"]}
{"title": "Geração Automática de Modelos de Simulação de uma Linha de Produção na Indústria Têxtil\n", "abstract": " Esta dissertação tem como objectivo a construção de um sistema de apoio à decisão para estudar o impacto de diversas alternativas de gestão da produção aplicadas a um sistema produtivo da indústria têxtil.Desenvolveu-se um Modelo Base, em linguagem de simulação, que integra o processo de tricotar, no âmbito da produção para a indústria têxtil. As características específicas dos recursos utilizados nesta produção foram desenvolvidas de forma a permitir uma utilização iterativa e susceptível de serem parametrizáveis pelo utilizador. É feita uma abordagem à simulação e às suas vantagens na aplicação à monitorização remota e a estudos de viabilidade. Apoiado na simulação, construiu-se uma ferramenta interactiva, permitindo a geração automática de modelos com diferentes estratégias de controlo que sustenta a viabilidade do sistema a propor. Suportado pela simulação em ambiente Arena® …", "num_citations": "1\n", "authors": ["1147"]}
{"title": "A Multi-Level Design Pattern for Embedded Software\n", "abstract": " It is a common practice amongst programmers to construct parts of software programs by imitating parts of programs constructed by more experienced professionals. This “learn by example” approach can be applied at the design level by using patterns as sets of rules and recommendations to solve well-defined tasks within the development of computer-based systems. This paper describes the multi-level ICIS pattern, to be used at various design levels of industrial control-based information systems, where embedded devices are networked to interact with the industrial processes and equipment. The proposed pattern is described using several UML diagrams.", "num_citations": "1\n", "authors": ["1147"]}
{"title": "Sistemas de informação industriais orientados ao controlo: perspectivas metodológicas para tecnologias reconfiguráveis\n", "abstract": " Este artigo pretende descrever, de uma forma sumária, a metodologia proposta para suportar o desenvolvimento de aplicações tempo-real embebidas, capazes de suportar computacionalmente sistemas de informação industriais.", "num_citations": "1\n", "authors": ["1147"]}
{"title": "A UML-based approach for modeling industrial control applications\n", "abstract": " The main purpose of the poster is to present how the Unified Modeling Language (UML) can be used for diagnosing and optimizing real industrial production systems. By using a car radios production line as a case study, the poster shows the modeling process that can be followed during the analysis phase of complex control applications. In order to guarantee the continuity mapping of the models, the authors propose some guidelines to transform the use cases diagrams into a single object diagram, which is the main diagram for the next phases of the development.", "num_citations": "1\n", "authors": ["1147"]}
{"title": "Projecto de hardware digital orientado por objectos\n", "abstract": " Os limites entre os domínios do software e do hardware são cada vez mais ténues, pelo que técnicas inicialmente experimentadas no software têm vindo a ser gradualmente aplicadas no hardware. Este artigo pretende descrever o estado actual da utilização da tecnologia de programação orientada por objectos no projecto de hardware digital. São analisadas as vantagens e implicações quando se introduzem conceitos ligados à tecnologia orientada por objectos em projectos de hardware e é apresentado um exemplo utilizando uma das extensões orientadas por objectos da linguagem VHDL.", "num_citations": "1\n", "authors": ["1147"]}
{"title": "PROCESSOS DE QUALIDADE DE SOFTWARE COMO FATORES CRÍTICOS DE SUCESSO PARA O ENSINO DA ENGENHARIA DE SOFTWARE NO CONTEXTO BRASILEIRO\n", "abstract": " Os processos de Qualidade de Software passaram a fazer parte do processo de produção de software nas empresas brasileiras nos últimos anos. Essa adoção, não veio pela aderência e sim pela necessidade de desenvolver soluções empresariais que atendessem aos reais e complexos modelos de negócios presentes nas organizações no país. As adequações vindas de normas e modelos de qualidade direcionam o resultado e propicia melhoria contínua nos processos de desenvolvimento de software, tornandoo menos dispendioso. Dentre estes os processos, dez são considerados fatores críticos de sucesso: Engenharia de Requisitos, Gestão de Configuração, Gestão de Riscos, Modelagem Visual, Metodologias de Desenvolvimento, Normas e Modelos de Qualidade, Métricas, Cronogramação, Implementação e Testes. Eles permitem ainda que o profissional brasileiro tenha o seu valor agregado tanto na criatividade quanto na disciplina profissional, mitigando os riscos de fracasso e aumentando a participação em projetos anteriormente encaminhados para o exterior.", "num_citations": "1\n", "authors": ["1147"]}