{"title": "RELAP5/MOD3 code manual\n", "abstract": " [en] The RELAP5 code has been developed for best-estimate transient simulation of light water reactor coolant systems during a severe accident. The code models the coupled behavior of the reactor coolant system and the core during the severe accident transient, as well as large and small break loss-of-coolant accidents and operational transients, such as anticipated transients without scram, loss of offsite power, loss of feedwater, and loss of flow. A generic modeling approach is used that permits as much of a particular system to be modeled as necessary. Control system and secondary system components are included to permit modeling of plant controls, turbines, condensers, and secondary feedwater conditioning systems. RELAP5/MOD3 code documentation is divided into five volumes: Volume 1 describes modeling theory and associated numerical schemes, Volume 2 contains detailed instructions for code application and input data preparation, Volume 3 provides the results of developmental assessment cases that demonstrate and verify the models used in the code, and Volume 4 presents a detailed discussion of RELAP5 models and correlations. Volumes 1--4 are in varying stages of development. This document, Volume 5, contains guidelines that have evolved over the past several years through use of the RELAP5 code", "num_citations": "99\n", "authors": ["1406"]}
{"title": "Computational fluid dynamic analysis of core bypass flow phenomena in a prismatic VHTR\n", "abstract": " The core bypass flow in a prismatic very high temperature reactor (VHTR) is an important design consideration and can have considerable impact on the condition of reactor core internals including fuels. The interstitial gaps are an inherent presence in the reactor core because of tolerances in manufacturing the blocks and the inexact nature of their installation. Furthermore, the geometry of the graphite blocks changes over the lifetime of the reactor because of thermal expansion and irradiation damage. The occurrence of hot spots in the core and lower plenum and hot streaking in the lower plenum (regions of very hot gas flow) are affected by bypass flow.In the present study, three-dimensional computational fluid dynamic (CFD) calculations of a typical prismatic VHTR are conducted to better understand bypass flow phenomena and establish an evaluation method for the reactor core using the commercial CFD …", "num_citations": "63\n", "authors": ["1406"]}
{"title": "Heat transfer analysis of the passive residual heat removal system in ROSA/AP600 experiments\n", "abstract": " The passive residual heat removal (PRHR) system in the Westinghouse AP600 advanced passive reactor design is a natural-circulation-driven heat exchanger cooled by the water in the in-containment refueling water storage tank (IRWST). During the experiments, which simulated small-break loss-of-coolant accidents in the AP600 reactor using the ROSA-V Large-Scale Test Facility (LSTF), the PRHR system heat removal rates well exceeded the core decay power soon after the actuation of the PRHR. This resulted in continuous cooldown and depressurization of the primary side. The PRHR heat transfer performance in these experiments was analyzed by applying heat transfer correlations available in literature to the PRHR heat exchanger tube bundle. Also, the three-dimensional natural circulation in the IRWST was simulated numerically using the FLUENT code. The total heat transfer rate of the PRHR was …", "num_citations": "54\n", "authors": ["1406"]}
{"title": "Analysis of the hot gas flow in the outlet plenum of the very high temperature reactor using coupled RELAP5-3D system code and a CFD code\n", "abstract": " The very high temperature reactor (VHTR) system behavior should be predicted during normal operating conditions and postulated accident conditions. The plant accident scenario and the passive safety behavior should be accurately predicted. Uncertainties in passive safety behavior could have large effects on the resulting system characteristics. Due to these performance issues in the VHTR, there is a need for development, testing and validation of design tools to demonstrate the feasibility of the design concepts and guide the improvement of the plant components. One of the identified design issues for the gas-cooled reactor is the thermal mixing of the coolant exiting the core into the outlet plenum. Incomplete thermal mixing may give rise to thermal stresses in the downstream components. To provide flow details, the analysis presented in this paper was performed by coupling a VHTR model generated in a …", "num_citations": "53\n", "authors": ["1406"]}
{"title": "RELAP5/MOD3 Code Manual. Volume 5, Users Guidelines\n", "abstract": " The RELAP5 code has been developed for best-estimate transient simulation of light water reactor coolant systems during a severe accident. The code models the coupled behavior of the reactor coolant system and the core during the severe accident transient, as well as large and small break loss-of-coolant accidents and operational transients, such as anticipated transients without scram, loss of offsite power, loss of feedwater, and loss of flow. A generic modeling approach is used that permits as much of a particular system to be modeled as necessary. Control system and secondary system components are included to permit modeling of plant controls, turbines, condensers, and secondary feedwater conditioning systems. RELAP5/MOD3 code documentation is divided into five volumes: Volume 1 describes modeling theory and associated numerical schemes, Volume 2 contains detailed instructions for code application and input data preparation, Volume 3 provides the results of developmental assessment cases that demonstrate and verify the models used in the code, and Volume 4 presents a detailed discussion of RELAP5 models and correlations. Volumes 1--4 are in varying stages of development. This document, Volume 5, contains guidelines that have evolved over the past several years through use of the RELAP5 code.", "num_citations": "50\n", "authors": ["1406"]}
{"title": "Next generation nuclear plant methods technical program plan\n", "abstract": " One of the great challenges of designing and licensing the Very High Temperature Reactor (VHTR) is to confirm that the intended VHTR analysis tools can be used confidently to make decisions and to assure all that the reactor systems are safe and meet the performance objectives of the Generation IV Program. The research and development (R&D) projects defined in the Next Generation Nuclear Plant (NGNP) Design Methods Development and Validation Program will ensure that the tools used to perform the required calculations and analyses can be trusted. The Methods R&D tasks are designed to ensure that the calculational envelope of the tools used to analyze the VHTR reactor systems encompasses, or is larger than, the operational and transient envelope of the VHTR itself. The Methods R&D focuses on the development of tools to assess the neutronic and thermal fluid behavior of the plant. The fuel behavior and fission product transport models are discussed in the Advanced Gas Reactor (AGR) program plan. Various stress analysis and mechanical design tools will also need to be developed and validated and will ultimately also be included in the Methods R&D Program Plan. The calculational envelope of the neutronics and thermal-fluids software tools intended to more»", "num_citations": "37\n", "authors": ["1406"]}
{"title": "ROSA/AP600 testing: facility modifications and initial test results\n", "abstract": " Commission (USNRC) are jointly performing a series of confirmatory integral experiments on the safety response of the Westinghouse AP600 design (1) using the Large Scale Test Facility (LSTF)(2) of JAERI. The primary objective of this test series is to provide thermalhydraulic data of phenomena that would be expected during AP600 transients. Those data are then to be used for assessment of safety analysis codeso). Under this agreement, the LSTF was modified by adding scaled models of the passive safety features that characterize the AP600 design. The design specifications for the facility modifications were developed by the Idaho National Engineering Laboratory (INEL)(4) based on comparative analyses of the AP600 and modified-LSTF responses to selected accident scenarios using the RELAP5/MOD2. 5 code. The added components include two Core Makeup Tanks (CMTs), CMT Pressure Balance Lines (PBLs), a Passive Residual Heat Removal", "num_citations": "37\n", "authors": ["1406"]}
{"title": "Best Estimate Safety Analysis for Nuclear Power Plants: Uncertainty Evaluation. IAEA Safety Report Series\n", "abstract": " Deterministic safety analysis (frequently referred to as accident analysis)  is an important tool for confirming the adequacy and efficiency of provisions  within the defence in depth concept for the safety of nuclear power plants.  Requirements and guidance pertaining to the scope and content of accident  analysis have been described in various IAEA publications. To a certain extent,  accident analysis is covered in several publications of the revised Safety  Standards Series, mainly in the Safety Requirements on design (Safety of  Nuclear Power Plants: Design, Safety Standards Series No. NS-R-1) and in the  Safety Guide on Safety Assessment and Verification for Nuclear Power Plants  (Safety Standards Series No. NS-G-1.2). More detailed guidance has been  included in the IAEA safety report on Accident Analysis for Nuclear Power  Plants (Safety Reports Series No. 23). The safety report covers all the steps  required for accident analyses (i.e. selection of initiating events and acceptance  criteria, selection of computer codes and modelling assumptions, preparation  of input data and presentation of the calculation results).  The aforementioned safety standards and safety report recommend as  one of the options for demonstrating the inclusion of adequate safety margins  the use of best estimate computer codes with realistic input data in  combination with the evaluation of uncertainties in the calculation results. For  the evaluation of uncertainties, the sharing of experience and provision of  guidance are elements of vital importance.  This report has therefore been developed to complement the safety  standards and the safety report referred to above …", "num_citations": "27\n", "authors": ["1406"]}
{"title": "Core makeup tank behavior observed during the ROSA-AP600 experiments\n", "abstract": " Integral experiments simulating small-break loss-of-coolant accidents in the Westinghouse AP600 reactor are conducted using the ROSA-V large-scale test facility. These experiments show that the core makeup tank (CMT) behavior can be divided into two phases: the natural-circulation and the drain phases. The natural-circulation phase between the CMT and the rest of the primary is established immediately after the opening of the valve in the discharge line. The hot water from the primary, through the pressure balance line (PBL), accumulates in the top of the CMT, forming a clear thermal stratification above the cold initial inventory of the CMT. The drain phase is initiated by flashing in the CMT for break diameters ≤1 in. and by a gaseous flow from the primary for break diameters ≥2 in. Interactions between the CMT and the other safety components are observed: The CMT discharge rate is decreased by …", "num_citations": "27\n", "authors": ["1406"]}
{"title": "Studies related to the Oregon State University high temperature test facility: Scaling, the validation matrix, and similarities to the modular high temperature gas-cooled reactor\n", "abstract": " The Oregon State University (OSU) High Temperature Test Facility (HTTF) is an integral experimental facility that will be constructed on the OSU campus in Corvallis, Oregon. The HTTF project was initiated, by the US Nuclear Regulatory Commission (NRC), on September 5, 2008 as Task 4 of the 5 year High Temperature Gas Reactor Cooperative Agreement via NRC Contract 04-08-138. Until August, 2010, when a DOE contract was initiated to fund additional capabilities for the HTTF project, all of the funding support for the HTTF was provided by the NRC via their cooperative agreement. The US Department of Energy (DOE) began their involvement with the HTTF project in late 2009 via the Next Generation Nuclear Plant project. Because the NRC interests in HTTF experiments were only centered on the depressurized conduction cooldown (DCC) scenario, NGNP involvement focused on expanding the experimental envelope of the HTTF to include steady-state operations and also the pressurized conduction cooldown (PCC). Since DOE has incorporated the HTTF as an ingredient in the NGNP thermal-fluids validation program, several important outcomes should be noted: 1. The reference prismatic reactor design, that serves as the basis for scaling the HTTF, became the modular high temperature gas-cooled reactor (MHTGR). The more»", "num_citations": "26\n", "authors": ["1406"]}
{"title": "Next Generation Nuclear Plant Phenomena Identification and Ranking Tables (PIRTs) Volume 2: Accident and Thermal Fluids Analysis PIRTs\n", "abstract": " [en] An accident, thermal fluids, and reactor physics phenomena identification and ranking process was conducted by a panel of experts on the next generation nuclear plant (NGNP) design (consideration given to both pebble-bed and prismatic gas-cooled reactor configurations). Safety-relevant phenomena, importance, and knowledge base were assessed for the following event classes:(1) normal operation (including some reactor physics aspects),(2) general loss of forced circulation (G-LOFC),(3) pressurized loss-of-forced circulation (P-LOFC),(4) depressurized loss-of-forced circulation (D-LOFC),(5) air ingress (following D-LOFC),(6) reactivity transients-including anticipated transients without scram (ATWS),(7) processes coupled via intermediate heat exchanger (IHX)(IHX failure with molten salt), and (8) steam/water ingress. The panel's judgment of the importance ranking of a given phenomenon (or process) was based on the effect it had on one or more figures of merit or evaluation criteria. These included public and worker dose, fuel failure, and primary (and other safety) system integrity. The major phenomena of concern that were identified and categorized as high importance combined with medium to low knowledge follow:(1) core coolant bypass flows (normal operation),(2) power/flux profiles (normal operation),(3) outlet plenum flows (normal operation),(4) reactivity-temperature feedback coefficients for high-plutonium-content cores (normal operation and accidents),(5) fission product release related to the transport of silver (normal operation),(6) emissivity aspects for the vessel and reactor cavity cooling system (G-LOFC),(7) reactor …", "num_citations": "22\n", "authors": ["1406"]}
{"title": "Thermal hydraulics of the very high temperature gas cooled reactor\n", "abstract": " The US Department of Energy (DOE) is conducting research on the Very High Temperature Reactor (VHTR) design concept for the Next Generation Nuclear Plant (NGNP) Project. The reactor design will be a graphite moderated, thermal neutron spectrum reactor that will produce electricity and hydrogen in a highly efficient manner. The NGNP reactor core will be either a prismatic graphite block type core or a pebble bed core. The NGNP will use very high-burnup, low-enriched uranium, TRISO-coated fuel, and have a projected plant design service life of 60 years. The VHTR concept is considered to be the nearest-term reactor design that has the capability to efficiently produce hydrogen. The plant size, reactor thermal power, and core configuration will ensure passive decay heat removal without fuel damage or radioactive material releases during reactor core-accidents. The objectives of the NGNP Project are to: Demonstrate a full-scale prototype VHTR that is commercially licensed by the US Nuclear Regulatory Commission, and Demonstrate safe and economical nuclear-assisted production of hydrogen and electricity. The DOE laboratories, led by the INL, perform research and development (R&D) that will be critical to the success of the NGNP, primarily in the areas of:• High temperature gas reactor fuels behavior more»", "num_citations": "21\n", "authors": ["1406"]}
{"title": "RELAP5-3D code includes ATHENA features and models\n", "abstract": " Version 2.3 of the RELAP5-3D computer program includes all features and models previously available only in the ATHENA version of the code. These include the addition of new working fluids (i.e., ammonia, blood, carbon dioxide, glycerol, helium, hydrogen, lead-bismuth, lithium, lithium-lead, nitrogen, potassium, sodium, and sodium-potassium) and a magnetohydrodynamic model that expands the capability of the code to model many more thermal-hydraulic systems. In addition to the new working fluids along with the standard working fluid water, one or more noncondensable gases (e.g., air, argon, carbon dioxide, carbon monoxide, helium, hydrogen, krypton, nitrogen, oxygen, sf6, xenon) can be specified as part of the vapor/gas phase of the working fluid. These noncondensable gases were in previous versions of RELAP5-3D. Recently four molten salts have been added as working fluids to RELAP5-3D …", "num_citations": "16\n", "authors": ["1406"]}
{"title": "Stratified flows in horizontal piping of passive emergency core cooling systems\n", "abstract": " [en] In passive cooling systems of advanced light water reactors outside coolant enters the cold leg by gravity and flows towards the core. This coolant is at a substantially lower temperature and thus is heavier than the liquid in the reactor. The warmer liquid may intrude into the cold leg in the form of a wedge against the flow of the coolant. Such a flow system is analyzed here using the momentum conservation principle. The analysis results in an integral. Upon numerical integration, the length and shape of the wedge can be computed as a function of the specific weights of the fluids and the depth and flow rate of the heavier liquid. The flow system is also investigated experimentally using a brine-water system. The test loop and measurements are described. The laboratory data validates the analytical results.(authors)", "num_citations": "16\n", "authors": ["1406"]}
{"title": "RELAP5/MOD3 code manual\n", "abstract": " [en] Summaries of RELAP5/MOD3 code assessments, a listing of the assessment matrix, and a chronology of the various versions of the code are given. Results from these code assessments have been used to formulate a compilation of some of the strengths and weaknesses of the code. These results are documented in the report. Volume 7 was designed to be updated periodically and to include the results of the latest code assessments as they become available. Consequently, users of Volume 7 should ensure that the latest revision is available", "num_citations": "16\n", "authors": ["1406"]}
{"title": "CFD Analysis of Core Bypass Phenomena\n", "abstract": " The US Department of Energy is exploring the potential for the VHTR which will be either of a prismatic or a pebble-bed type. One important design consideration for the reactor core of a prismatic VHTR is coolant bypass flow which occurs in the interstitial regions between fuel blocks. Such gaps are an inherent presence in the reactor core because of tolerances in manufacturing the blocks and the inexact nature of their installation. Furthermore, the geometry of the graphite blocks changes over the lifetime of the reactor because of thermal expansion and irradiation damage. The existence of the gaps induces a flow bias in the fuel blocks and results in unexpected increase of maximum fuel temperature. Traditionally, simplified methods such as flow network calculations employing experimental correlations are used to estimate flow and temperature distributions in the core design. However, the distribution of temperature in the fuel pins and graphite blocks as well as coolant outlet temperatures are strongly coupled with the local heat generation rate within fuel blocks which is not uniformly distributed in the core. Hence, it is crucial to establish mechanistic based methods which can be applied to the reactor core thermal hydraulic design and safety analysis. Computational more»", "num_citations": "13\n", "authors": ["1406"]}
{"title": "Computational fluid dynamic analysis of the VHTR lower plenum standard problem\n", "abstract": " The United States Department of Energy is promoting the resurgence of nuclear power in the US for both electrical power generation and production of process heat required for industrial processes such as the manufacture of hydrogen for use as a fuel in automobiles. The DOE project is called the next generation nuclear plant (NGNP) and is based on a Generation IV reactor concept called the very high temperature reactor (VHTR), which will use helium as the coolant at temperatures ranging from 450 ºC to perhaps 1000 ºC. While computational fluid dynamics (CFD) has not been used for past safety analysis for nuclear reactors in the US, it is being considered for safety analysis for existing and future reactors. It is fully recognized that CFD simulation codes will have to be validated for flow physics reasonably close to actual fluid dynamic conditions expected in normal and accident operational situations. To this end, experimental data have been obtained in a scaled model of a narrow slice of the lower plenum of a prismatic VHTR. The present report presents results of CFD examinations of these data to explore potential issues with the geometry, the initial conditions, the flow dynamics and the more»", "num_citations": "13\n", "authors": ["1406"]}
{"title": "Validations of CFD code for density-gradient driven air ingress stratified flow\n", "abstract": " Air ingress into a very high temperature gas-cooled reactor (VHTR) is an important phenomenon to consider because the air oxidizes the reactor core and lower plenum where the graphite structure supports the core region in the gas turbine modular helium reactor (GT-MHR) design, thus jeopardizing the reactor’s safety. Validating the computational fluid dynamics (CFD) code used to analyze the air ingress phenomena is therefore an essential part of the safety analysis and the ultimate computation required for licensing. An experimental data set collected by ETH Zurich on a lock exchange experiment (Grobelbauser et al., Lowe et al. 2002; Lowe et al. 2005; and Shin et al. 2004) was selected for the validation. The experiment was based on a series of lock exchange flows with gases of different density ratios varying from 0.046 to 0.9 in a closed channel of a square cross-section. The focus was on the quantitative …", "num_citations": "12\n", "authors": ["1406"]}
{"title": "Processes and procedures for application of cfd to nuclear reactor safety analysis\n", "abstract": " Traditionally, nuclear reactor safety analysis has been performed using systems analysis codes such as RELAP5, which was developed at the INL. However, goals established by the Generation IV program, especially the desire to increase efficiency, has lead to an increase in operating temperatures for the reactors. This increase pushes reactor materials to operate towards their upper temperature limits relative to structural integrity. Because there will be some finite variation of the power density in the reactor core, there will be a potential for local hot spots to occur in the reactor vessel. Hence, it has become apparent that detailed analysis will be required to ensure that local ‘hot spots’ do not exceed safety limits. It is generally accepted that computational fluid dynamics (CFD) codes are intrinsically capable of simulating fluid dynamics and heat transport locally because they are based on ‘first principles.’Indeed, CFD analysis has reached a fairly mature level of development, including the commercial level. However, CFD experts are aware that even though commercial codes are capable of simulating local fluid and thermal physics, great care must be taken in their application to avoid errors caused by such things as inappropriate grid meshing, low-order discretization schemes, lack of iterative convergence and inaccurate time-stepping. Just as important is the choice of a turbulence model for turbulent flow simulation. Turbulence models model the effects of turbulent transport of mass, momentum and energy, but are not necessarily applicable for wide ranges of flow types. Therefore, there is a wellrecognized need to establish practices and …", "num_citations": "12\n", "authors": ["1406"]}
{"title": "PIV experiments to measure flow phenomena in a scaled model of a VHTR Lower Plenum\n", "abstract": " A report of experimental data collected at the Matched-Index-of-Refraction (MIR) Laboratory in support of contract DE-AC07-05ID14517 and the INL Standard Problem on measurements of flow phenomena occurring in a lower plenum of a typical prismatic VHTR concept reactor to assess CFD code is presented. Background on the experimental setup and procedures is provided along with several samples of data obtained from the 3-D PIV system and an assessment of experimental uncertainty is provided. Data collected in this study include 3-dimensional velocity-field descriptions of the flow in all four inlet jets and the entire lower plenum with inlet jet Reynolds numbers (ReJet) of approximately 4300 and 12,400. These investigations have generated over 2 terabytes of data that has been processed to describe the various velocity components in formats suitable for external release and archived on removable hard disks. The processed data from both experimental studies are available in multi-column text format.", "num_citations": "11\n", "authors": ["1406"]}
{"title": "Using the RELAP5-3D Advanced Systems Analysis Code with Commercial and Advanced CFD Software\n", "abstract": " The Idaho National Engineering and Environmental Laboratory (INEEL), in conjunction with Fluent Corporation, has developed a new analysis tool by coupling the Fluent computational fluid dynamics (CFD) code to the RELAP5-3D/ATHENA advanced thermal-hydraulic analysis code. This tool enables researchers to perform detailed, three-dimensional analyses using Fluent's CFD capability while the boundary conditions required by the Fluent calculation are provided by the balance-of-system model created using RELAP5-3D/ATHENA. Both steady-state and transient calculations can be performed using many working fluids and also point to three-dimensional neutronics. The Fluent/RELAP5-3D coupled code is intended as a state-of-the-art tool to study the behavior of systems with single-phase working fluids, such as advanced gas-cooled reactors. For systems with two-phase working fluids, particularly during loss-of-coolant accident (LOCA) scenarios where a multitude of flow regimes, heat transfer regimes, and phenomena are present, the Fluent-RELAP5-3D coupling will have less general applicability since Fluent's capabilities to analyze global two-phase problems are limited. Consequently, for two-phase advanced reactor analysis, INEEL plans to employ not only the Fluent-RELAP5-3D coupling, but also to make use of state-of-the-art experimental CFD tools such as CFDLib (available from the Los Alamos National Laboratory). A general description of the techniques used to couple the codes is given. A summary of the process used to checkout the coupled configuration is given. A demonstration calculation is presented. Finally, future …", "num_citations": "11\n", "authors": ["1406"]}
{"title": "Comprehensive thermal hydraulics research of the very high temperature gas cooled reactor\n", "abstract": " The Idaho National Laboratory (INL), under the auspices of the U.S. Department of Energy, is conducting research on the Very High Temperature Reactor (VHTR) design concept for the Next Generation Nuclear Plant (NGNP) Project. The reactor design will be a graphite moderated, thermal neutron spectrum reactor that will produce electricity and hydrogen in a highly efficient manner. The NGNP reactor core will be either a prismatic graphite block type core or a pebble bed core. The NGNP will use very high-burnup, low-enriched uranium, TRISO-coated fuel, and have a projected plant design service life of 60 years. The VHTR concept is considered to be the nearest-term reactor design that has the capability to efficiently produce hydrogen. The plant size, reactor thermal power, and core configuration will ensure passive decay heat removal without fuel damage or radioactive material releases during reactor core …", "num_citations": "10\n", "authors": ["1406"]}
{"title": "Implications of Air Ingress Induced by Density-Difference Driven Stratified Flow\n", "abstract": " One of the design basis accidents for the Next Generation Nuclear Plant (NGNP), a high temperature gas-cooled reactor, is air ingress subsequent to a pipe break. Following a postulated double-ended guillotine break in the hot duct, and the subsequent depressurization to nearly reactor cavity pressure levels, air present in the reactor cavity will enter the reactor vessel via density-gradient-driven-stratified flow. Because of the significantly higher molecular weight and lower initial temperature of the reactor cavity air-helium mixture, in contrast to the helium in the reactor vessel, the air-helium mixture in the cavity always has a larger density than the helium discharging from the reactor vessel through the break into the reactor cavity. In the later stages of the helium blowdown, the momentum of the helium flow decreases sufficiently for the heavier cavity air-helium mixture to intrude into the reactor vessel lower plenum through the lower portion of the break. Once it has entered, the heavier gas will pool at the bottom of the lower plenum. From there it will move upwards into the core via diffusion and density-gradient effects that stem from heating the air-helium mixture and from the pressure differences between the reactor cavity and the reactor vessel. This scenario (considering density-gradient-driven stratified flow) is considerably different from the heretofore commonly used scenario that attributes movement of air into the reactor vessel and from thence to the core region via diffusion. When density-gradient-driven stratified flow is considered as a contributing phenomena for air ingress into the reactor vessel, the following factors contribute to a much …", "num_citations": "10\n", "authors": ["1406"]}
{"title": "RELAP5-3D Code for Supercritical-Pressure Light-Water-Cooled Reactors\n", "abstract": " The RELAP5-3D computer program has been improved for analysis of supercritical-pressure, light-water-cooled reactors. Several code modifications were implemented to correct code execution failures. Changes were made to the steam table generation, steam table interpolation, metastable states, interfacial heat transfer coefficients, and transport properties (viscosity and thermal conductivity). The code modifications now allow the code to run slow transients above the critical pressure as well as blowdown transients (modified Edwards pipe and modified existing pressurized water reactor model) that pass near the critical point.", "num_citations": "10\n", "authors": ["1406"]}
{"title": "RELAP5 Code Manual Volume V: User’s Guidelines\n", "abstract": " The RELAP5-3D© code has been developed for best-estimate transient simulation of light water reactor coolant systems during postulated accidents. The code models the coupled behavior of the reactor coolant system and the core for loss-of-coolant accidents, and operational transients, such as anticipated transient without scram, loss of offsite power, loss of feedwater, and loss of flow. A generic modeling approach is used that permits simulating a variety of thermal hydraulic systems. Control system and secondary system components are included to permit modeling of plant controls, turbines, condensers, and secondary feedwater systems.RELAP5-3D© code documentation is divided into six volumes: Volume I provides modeling theory and associated numerical schemes; Volume II contains detailed instructions for code application and input data preparation; Volume III provides the results of developmental …", "num_citations": "10\n", "authors": ["1406"]}
{"title": "Scaling studies for high temperature test facility and modular high temperature gas-cooled reactor\n", "abstract": " The Oregon State University (OSU) High Temperature Test Facility (HTTF) is an integral experimental facility that will be constructed on the OSU campus in Corvallis, Oregon. The HTTF project was initiated, by the US Nuclear Regulatory Commission (NRC), on September 5, 2008 as Task 4 of the 5-year High Temperature Gas Reactor Cooperative Agreement via NRC Contract 04-08-138. Until August, 2010, when a DOE contract was initiated to fund additional capabilities for the HTTF project, all of the funding support for the HTTF was provided by the NRC via their cooperative agreement. The US Department of Energy (DOE) began their involvement with the HTTF project in late 2009 via the Next Generation Nuclear Plant (NGNP) project. Because the NRC's interests in HTTF experiments were only centered on the depressurized conduction cooldown (DCC) scenario, NGNP involvement focused on expanding the experimental envelope of the HTTF to include steady-state operations and also the pressurized conduction cooldown (PCC).", "num_citations": "9\n", "authors": ["1406"]}
{"title": "Scaled experimental modeling of VHTR plenum flows\n", "abstract": " 2 their performance objectives. Comparison of computer code calculations with experimental data is the key component of code verification. This paper addresses experimental modeling of lower and upper plenum flow and thermal mixing phenomena of importance during normal operation and during a loss of forced reactor cooling (pressurized conduction cooldown) scenario. A prismatic core gas-cooled reactor following the Gas Turbine-Modular Helium Reactor (GT-MHR) design from General Atomics [GA 1996] is assumed in this study. VHTR vessel thermal-hydraulic phenomena that are of importance during normal, reduced power, and accident operation were identified by McEligot and McCreery, 2004, and are indicated in Figure 1. The objectives of the experiments are, 1), provide benchmark data for assessment and improvement of codes proposed for NGNP designs and safety studies, and, 2), obtain a better understanding of related phenomena, behavior and needs.Various scaled heated gas and water flow facilities were investigated for modeling VHTR upper and lower plenum flows during the decay heat portion of a pressurized conductioncooldown scenario and for modeling thermal mixing and stratification (“thermal striping”) in the lower plenum during normal operation. The choice of facilities depends not only on scaling fidelity but on the practical considerations of instrumentation, flow visualization, power requirements, environmental and safety requirements, and cost.", "num_citations": "9\n", "authors": ["1406"]}
{"title": "Generation of a preliminary pirt (phenomena identification and ranking table) for very high temperature gas-cooled reactors\n", "abstract": " In an effort to identify the major thermal-hydraulic phenomena required for the development and validation of thermal-hydraulic analysis tools of Very High Temperature Gas-cooled Reactors (VHTR), preliminary Phenomena Identification and Ranking Tables (PIRT) have been developed. Since the VHTR designs have not yet been defined and are still evolving, preliminary PIRTs have been generated for two reference VHTR designs based on: 600MWth GT-MHR for the representative prismatic modular reactor (PMR) and 400MWth PBMR for the representative pebble bed reactor (PBR). The preliminary PIRTs focus on three highly-ranked event scenarios: high pressure conduction cooling (HPCC) event initiated by loss of flow and simultaneous failure of shutdown cooling system, low pressure conduction cooling (LPCC) event initiated by loss of coolant with air-ingress and load changes (LC) including normal operation conditions. In the case of events and, normal scram shutdown occurs. Each scenario is subdivided into several time phases reflecting the major thermal-hydraulic characteristics and processes of the event. For each phase, each component of the reference designs is examined to identify the various phenomena. The phenomena are then ranked with respect to their influence on the selected primary criteria, both safety and otherwise by an expert panel group in Korea and the US. The Korean experts from the institutes, universities and industries were involved in the ranking in which an Analytical Hierarchical Process (AHP) was employed. The PIRTs generated in this study are also intended for use in identifying the experimental …", "num_citations": "9\n", "authors": ["1406"]}
{"title": "Validating and verifying a new thermal-hydraulic analysis tool\n", "abstract": " The Idaho National Engineering & Environmental Laboratory (INEEL) has developed a new analysis tool by coupling the Fluent computational fluid dynamics (CFD) code to the RELAP5-3D©/ATHENA advanced thermal-hydraulic analysis code. This tool enables researchers to perform detailed, three-dimensional analyses using Fluent’s CFD capability while the boundary conditions required by the Fluent calculation are provided by the balance-of-system model created using RELAP5-3D©/ATHENA. Both steady-state and transient calculations can be performed, using many working fluids and point to three-dimensional neutronics. A general description of the techniques used to couple the codes is given. The validation and verification (V&V) matrix is outlined. V&V is presently ongoing.", "num_citations": "9\n", "authors": ["1406"]}
{"title": "Reverse primary-side flow in steam generators during natural circulation cooling\n", "abstract": " A TRAC model of the Large Scale Test Facility with a 3-tube steam-generator model was used to analyze natural-circulation test ST-NC-02. For the steady state at 100% primary mass inventory, TRAC was in excellent agreement with the natural-circulation flow rate, the temperature distribution in the steam-generator tubes, and the temperature drop from the hot leg to the steam-generator inlet plenum. TRAC also predicted reverse flow in the long tubes. At reduced primary mass inventories, TRAC predicted the three natural-circulation flow regimes: single phase, two phase, and reflux condensation. TRAC did not predict the cyclic fill-and-dump phenomenon seen briefly in the test. TRAC overpredicted the two-phase natural-circulation flow rate. Since the core is well cooled at this time, the result is conservative. An important result of the analysis is that TRAC was able to predict the core dryout and heatup at approximately the same primary mass inventory as in the test. 4 refs., 8 figs., 2 tabs.", "num_citations": "9\n", "authors": ["1406"]}
{"title": "Identification and characterization of thermal fluid phenomena associated with selected operating/accident scenarios in modular high temperature gas-cooled reactors\n", "abstract": " Dominant phenomena are identified and characterized for the loss-of-forced-convection (LOFC) scenario, the depressurized loss-of-forced-convection (DLOFC) scenario, and the moisture ingress scenario with relief valves available scenario. These scenarios are considered for the modular high temperature gas-cooled reactor (MHTGR) baseline design—with both a prismatic core and a pebble-bed core. The objectives of this effort, described in the above paragraph, were achieved by following a methodology identified by the US Nuclear Regulatory Commission (NRC) and recommended in their Regulatory Guide 1.203. The methodology employed is described. For the above scenarios, baseline phenomena identification and ranking tables (PIRTs) generated by a NRC-sponsored effort in 2008 for the LOFC and DLOFC scenarios and a baseline PIRT generated by a Department of Energy-sponsored effort in 2011 by their Next Generation Nuclear Plant (NGNP) Moisture Ingress Assessment Committee were used to identify the dominant phenomena and existing levels-of-knowledge. Ten dominant phenomena (with only medium or low levels-of-knowledge) were identified for the LOFC and DLOFC scenarios including:(1) Inlet plenum stratification and plumes,(2) core coolant flow distribution,(3) radiant heat transfer from the top of the core to the upper vessel head,(4) reactor cavity air circulation and heat transfer,(5) reactor cavity cooling system behavior, more»", "num_citations": "8\n", "authors": ["1406"]}
{"title": "Preliminary studies of coolant by-pass flows in a prismatic very high temperature reactor using computational fluid dynamics\n", "abstract": " Three dimensional computational fluid dynamic (CFD) calculations of a typical prismatic very high temperature gas-cooled reactor (VHTR) were conducted to investigate the influence of gap geometry on flow and temperature distributions in the reactor core using commercial CFD code FLUENT. Parametric calculations changing the gap width in a whole core length model of fuel and reflector columns were performed. The simulations show the effects of core by-pass flows in the heated core region by comparing results for several gap widths including zero gap width. The calculation results underline the importance of considering inter-column gap width for the evaluation of maximum fuel temperatures and temperature gradients in fuel blocks. In addition, it is shown that temperatures of core outlet flow from gaps and channels are strongly affected by the gap width of by-pass flow in the reactor core.", "num_citations": "8\n", "authors": ["1406"]}
{"title": "International Code Assessment and Applications Program: Summary of code assessment studies concerning RELAP5/MOD2, RELAP5/MOD3, and TRAC-B. International Agreement Report\n", "abstract": " Members of the International Code Assessment Program (ICAP) have assessed the US Nuclear Regulatory Commission (USNRC) advanced thermal-hydraulic codes over the past few years in a concerted effort to identify deficiencies, to define user guidelines, and to determine the state of each code. The results of sixty-two code assessment reviews, conducted at INEL, are summarized. Code deficiencies are discussed and user recommended nodalizations investigated during the course of conducting the assessment studies and reviews are listed. All the work that is summarized was done using the RELAP5/MOD2, RELAP5/MOD3, and TRAC-B codes.", "num_citations": "8\n", "authors": ["1406"]}
{"title": "Analysis on the Density Driven Air-Ingress Accident in VHTRs\n", "abstract": " Air-ingress following the pipe rupture is considered to be the most serious accident in the very high temperature gas-cooled reactor (VHTRs) because of its potential problems such as core heat-up, structural integrity and toxic gas release. Previously, it has been believed that the main air-ingress mechanism of this accident is the molecular diffusion process between the reactor core and the cavity. However, according to some recent studies, 1, 2 there is another fast air-ingress process that has not been considered before, namely density-driven stratified flow.The potential for density-driven stratified air ingress into the VHTR following a large-break loss of coolant accident (LOCA) was first described in the Next generation Nuclear Plant (NGNP) Methods Technical Program 2 based on stratified flow studies performed with liquid. 3 Studies on density-gradient driven stratified flow in advanced reactor systems has been the subject of active research for well over a decade since density-gradient dominated stratified flow is an inherent characteristic of passive systems used in advanced reactors.", "num_citations": "7\n", "authors": ["1406"]}
{"title": "Meeting the thermal-hydraulic analysis needs for advanced gas reactor systems\n", "abstract": " Simulation of some fluid phenomena associated with Generation IV reactors requires the capability of modeling mixing in two- or three-dimensional flow. At the same time, the flow condition of interest is often transient and depends upon boundary conditions dictated by the system behavior as a whole. Computational fluid dynamics (CFD) is an ideal tool for simulating mixing and three-dimensional flow in system components, whereas a system analysis tool is ideal for modeling the entire system. This paper presents the reasoning which has led to coupled CFD and systems analysis code software to analyze the behavior of advanced reactor fluid system behavior. In addition, the kinds of scenarios where this capability is important are identified. The important role of a coupled CFD/systems analysis code tool in the overall calculation scheme for a Very High Temperature Reactor is described. The manner in which …", "num_citations": "7\n", "authors": ["1406"]}
{"title": "Evaluating fluid behavior in advanced reactor systems using coupled computational fluid dynamics and systems analysis tools\n", "abstract": " [en] Simulation of some fluid phenomena associated with Generation IV reactors require the capability of modeling mixing in two-or three-dimensional flow. At the same time, the flow condition of interest is often transient and depends upon boundary conditions dictated by the system behavior as a whole. Computational Fluid Dynamics (CFD) is an ideal tool for simulating mixing and three-dimensional flow in system components, whereas a system analysis tool is ideal for modeling the entire system. This paper presents the reasoning which has led to coupled CFD and systems analysis code software to analyze the behavior of advanced reactor fluid system behavior. In addition, the kinds of scenarios where this capability is important are identified. The important role of a coupled CFD/systems analysis code tool in the overall calculation scheme for a Very High Temperature Reactor is described. The manner in which coupled systems analysis and CFD codes will be used to evaluate the mixing behavior in a plenum for transient boundary conditions is described. The calculation methodology forms the basis for future coupled calculations that will examine the behavior of such systems at a spectrum of conditions, including transient accident conditions, that define the operational and accident envelope of the subject system. The methodology and analysis techniques demonstrated herein are a key technology that in part forms the backbone of the advanced techniques employed in the evaluation of advanced designs and their operational characteristics for the Generation IV advanced reactor systems.(authors)", "num_citations": "7\n", "authors": ["1406"]}
{"title": "Ngnp Point Design-Results of the Initial Neutronics and Thermal-Hydraulic Assessments During FY-03, Rev. 1\n", "abstract": " This report presents the preliminary preconceptual designs for two possible versions of the Next Generation Nuclear Plant (NGNP), one for a prismatic fuel type helium gas-cooled reactor and one for a pebble bed fuel helium gas reactor. Both designs are to meet three basic requirements: a coolant outlet temperature of 1000 C, passive safety, and a total power output consistent with that expected for commercial high-temperature gas-cooled reactors. The two efforts are discussed separately below. The analytical results presented in this report are very promising, however, we wish to caution the reader that future, more detailed, design work will be needed to provide final answers to a number of key questions including the allowable power level, the inlet temperature, the power density, the optimum fuel form, and others. The point design work presented in this report provides a starting point for other evaluations, and directions for the detailed design, but not final answers.", "num_citations": "7\n", "authors": ["1406"]}
{"title": "A 10% cold leg break test at ROSA-IV large scale test facility\n", "abstract": " The Large Scale Test Facility (LSTF) in the ROSA-IV Program is an integral test facility for investigation of pressurized water reactor (PWR) thermal-hydraulic behavior during small break loss-of-coolant accidents (SBLOCAs) and operational transients.A 10% cold leg break test was conducted in the facility shakedown phase to assess and confirm the facility capability and to collect code assessment data. The test conditions, test procedures and test results are described. The test results are compared with a pretest analysis obtained using RELAP5/MOD1 Cy18.", "num_citations": "7\n", "authors": ["1406"]}
{"title": "Development of a consensus standard for verification and validation of nuclear system thermal-fluids software\n", "abstract": " With the resurgence of nuclear power and increased interest in advanced nuclear reactors as an option to supply abundant energy without the associated greenhouse gas emissions of the more conventional fossil fuel energy sources, there is a need to establish internationally recognized standards for the verification and validation (V&V) of software used to calculate the thermal–hydraulic behavior of advanced reactor designs for both normal operation and hypothetical accident conditions. To address this need, ASME (American Society of Mechanical Engineers) Standards and Certification has established the V&V 30 Committee, under the jurisdiction of the V&V Standards Committee, to develop a consensus standard for verification and validation of software used for design and analysis of advanced reactor systems. The initial focus of this committee will be on the V&V of system analysis and computational fluid …", "num_citations": "6\n", "authors": ["1406"]}
{"title": "Comparison: RELAP5-3D systems analysis code and fluent CFD code momentum equation formulations\n", "abstract": " Recently the Idaho National Engineering and Environmental Laboratory (INEEL), in conjunction with Fluent Corporation, have developed a new analysis tool by coupling the Fluent computational fluid dynamics (CFD) code to the RELAP5-3D advanced thermal-hydraulic analysis code. This tool enables researchers to perform detailed, two- or three-dimensional analyses using Fluent's CFD capability while the boundary conditions required by the Fluent calculation are provided by the balance-of-system model created using RELAP5-3D. Fluent and RELAP5-3D have strengths that complement one another. CFD codes, such as Fluent, are commonly used to analyze the flow behavior in regions of a system where complex flow patterns are expected or present. On the other hand, RELAP5-3D was developed to analyze the behavior of two-phase systems that could be modeled in one-dimension. Empirical relationships were used where first-principle physics were not well developed. Both Fluent and RELAP5-3D are exemplary in their areas of specialization. The differences between Fluent and RELAP5 fundamentally stem from their field equations. This study focuses on the differences between the momentum equation representations in the two codes (the continuity equation formulations are equivalent for single phase flow). First the differences between the momentum equations are summarized. Next the effect of the differences in the momentum equations are examined by comparing the results obtained using both codes to study the same problem, i.e., fully-developed turbulent pipe flow. Finally, conclusions regarding the significance of the …", "num_citations": "6\n", "authors": ["1406"]}
{"title": "Air Ingress Analysis: Computational Fluid Dynamics Models\n", "abstract": " Idaho National Laboratory (INL), under the auspices of the U.S. Department of Energy (DOE), is performing research and development that focuses on key phenomena important during potential scenarios that may occur in very high temperature reactors (VHTRs). Phenomena identification and ranking studies to date have ranked an air ingress event, following on the heels of a VHTR depressurization, as important with regard to core safety. Consequently, the development of advanced air-ingress-related models and verification and validation data are a very high priority. Following a loss of coolant and system depressurization incident, air will enter the core of the High Temperature Gas Cooled Reactor through the break, possibly causing oxidation of the core and reflector graphite structure. Simple core and plant models indicate that, under certain circumstances, the oxidation may proceed at an elevated rate with …", "num_citations": "5\n", "authors": ["1406"]}
{"title": "Generation IV Technologies\n", "abstract": " The development of nuclear power occurred in three general phases. The initial development of prototype reactor designs (Generation I) occurred in the 1950s and 1960s, development and deployment of large commercial plants (Generation II) occurred in the 1970s and 1980s, and development of advanced light water reactors (Generation III) occurred in the 1990s. The earlier generations of reactors have effectively demonstrated the viability of nuclear power, but the nuclear industry faces several challenges that must be addressed for nuclear power to achieve its full potential. Among these challenges are:(1) public concern about the safety of nuclear power in the wake of the Three Mile Island accident in 1979 and the Chernobyl accident in 1986;(2) high capital costs and licensing uncertainties associated with the construction of new nuclear power plants;(3) public concern over potential vulnerabilities of nuclear …", "num_citations": "5\n", "authors": ["1406"]}
{"title": "Computational Fluid Dynamics Analyses on Very High Temperature Reactor Air Ingress\n", "abstract": " A preliminary computational fluid dynamics (CFD) analysis was performed to understand density-gradient-induced stratified flow in a Very High Temperature Reactor (VHTR) air-ingress accident. Various parameters were taken into consideration, including turbulence model, core temperature, initial air mole-fraction, and flow resistance in the core. The gas turbine modular helium reactor (GT-MHR) 600 MWt was selected as the reference reactor and it was simplified to be 2D geometry in modeling. The core and the lower plenum were assumed to be porous bodies. Following the preliminary CFD results, the analysis of the air-ingress accident has been performed by two different codes: GAMMA code (system analysis code, Oh et al. 2006) and FLUENT CFD code (Fluent 2007). Eventually, the analysis results showed that the actual onset time of natural convection (∼160 sec) would be significantly earlier than the …", "num_citations": "5\n", "authors": ["1406"]}
{"title": "Analysis of two small break loss-of-coolant experiments in the BETHSY facility using RELAP5/MOD3\n", "abstract": " Small break loss-of-coolant accident (SBLOCA) data were recorded during tests 9. lb and 6.2 TC in the Boucle dEtudes Thermohydrouliques Systeme (BETHSY) facility at the Centre dEtudes Nucleares de Grenoble (CENG) complex in Grenoble, France. The data from test 9. lb form the basis for the International Standard Problem number 27 (ISP-27). For each test the primary system depressurization, break flow rate, core heat-up, and effect of operator actions were analyzed. Based on the test 9. lb/ISP-27 and 6.2 TC data, an assessment study of the RELAP5/MOD3 version 7 code was performed which included a study of the above phenomena along with countercurrent flow limitation and vapor pull-through. The code provided a reasonable simulation of the various phenomena which occurred during the tests.", "num_citations": "5\n", "authors": ["1406"]}
{"title": "Verification and Validation Strategy for LWRS Tools\n", "abstract": " The US Department of Energy Light Water Reactor Sustainability (LWRS) Program is focused on enabling the long-term operation of US commercial power plants. Commercial power plant owners will make the decisions on life extension–the information provided by the research and development activities in the LWRS Program will reduce the uncertainty (and therefore the risk) associated with making those decisions.Modeling and simulation activities are an important part of the LWRS Program. Advanced tools that represent more accurately (when compared with currently used tools) the behavior of nuclear power plants, in particular as they age, can be an important tool to inform life extension decisions, and could potentially be used in licensing activities. However, before these tools can be used to inform decisions or support licensing activities, they will need to be adequately verified and validated (V&V’ed). The acceptable level of V&V is ultimately the decision of the nuclear power plant owners (who would use the tools to inform life-extension decisions) and the NRC (if the tools are used to support licensing). Although this report is focused on the LWRS Program, it is broadly applicable to advanced modeling and simulation activities.", "num_citations": "4\n", "authors": ["1406"]}
{"title": "Development of a standard for verification and validation of software used to calculate nuclear system thermal fluids behavior\n", "abstract": " With the resurgence of nuclear power and increased interest in advanced nuclear reactors as an option to supply abundant energy without the associated greenhouse gas emissions of the more conventional fossil fuel energy sources, there is a need to establish internationally recognized standards for the verification and validation (V&V) of software used to calculate the thermal-hydraulic behavior of advanced reactor designs for both normal operation and hypothetical accident conditions. To address this need, ASME (American Society of Mechanical Engineers) Standards and Certification has established the V&V 30 Committee, under the jurisdiction of the V&V Standards Committee, to develop a consensus standard for verification and validation of software used for design and analysis of advanced reactor systems. The initial focus of this committee will be on the V&V of system analysis and computational fluid …", "num_citations": "4\n", "authors": ["1406"]}
{"title": "Effect of reacting surface density on the overall graphite oxidation rate\n", "abstract": " Graphite oxidation in an air-ingress accident is presently a very important issue for the reactor safety of the very high temperature gas cooled-reactor (VHTR), the concept of the next generation nuclear plant (NGNP) because of its potential problems such as mechanical degradation of the supporting graphite in the lower plenum of the VHTR might lead to core collapse if the countermeasure is taken carefully. The oxidation process of graphite has known to be affected by various factors, including temperature, pressure, oxygen concentration, types of graphite, graphite shape and size, flow distribution, etc. However, our recent study reveals that the internal pore characteristics play very important roles in the overall graphite oxidation rate.One of the main issues regarding graphite oxidation is the potential core collapse problem that may occur following the degradation of graphite mechanical strength. In analyzing this phenomenon, it is very important to understand the relationship between the degree of oxidization and strength degradation. In addition, the change of oxidation rate by graphite oxidation degree characterization by burn-off (ratio of the oxidized graphite density to the original density) should be quantified because graphite strength degradation is followed by graphite density decrease, which highly affects oxidation rates and patterns. Because the density change is proportional to the internal pore surface area, they should be quantified in advance. In order to understand the above issues, the following experiments were performed:(1) Experiment on the fracture of the oxidized graphite and validation of the previous correlations,(2 …", "num_citations": "4\n", "authors": ["1406"]}
{"title": "Modeling strategies for unsteady turbulent flows in the lower plenum of the VHTR\n", "abstract": " [en] Validation simulations are presented for turbulent flow in a staggered tube bank, geometry similar to that in the lower plenum of a block very high temperature reactor. Steady 2D RANS predictions are compared to unsteady 2D RANS results and experiment. The unsteady calculations account for the fact that nonturbulent fluctuations (due to vortex-shedding) are present in the flow. The unsteady computations are shown to predict the mean variables and the total shear stress quite well. Previous workers have presented results that indicated that 3D simulations were necessary to obtain reasonable results. Best practices are based on requirements for the ASME Journal of Fluids Engineering", "num_citations": "4\n", "authors": ["1406"]}
{"title": "Coupling the RELAP5-3d advanced systems analysis code with commercial and advanced CFD software\n", "abstract": " [en] The Idaho National Engineering and Environmental Laboratory (INEEL), in conjunction with Fluent Corporation, has developed a new analysis tool by coupling the Fluent computational fluid dynamics (CFD) code to the RELAP5-3D/ATHENA advanced thermal-hydraulic analysis code. This tool enables researchers to perform detailed, three-dimensional analyses using Fluent's CFD capability while the boundary conditions required by the Fluent calculation are provided by the balance-of-system model created using RELAP5-3D/ATHENA. Both steady-state and transient calculations can be performed using many working fluids and also point to three-dimensional neutronics. The Fluent/RELAP5-3D coupled code is intended as a state-of-the-art tool to study the behavior of systems with single-phase working fluids, such as advanced gas-cooled reactors. For systems with two-phase working fluids, particularly during loss-of-coolant accident (LOCA) scenarios where a multitude of flow regimes, heat transfer regimes, and phenomena are present, the Fluent-RELAP5-3D coupling will have less general applicability since Fluent's capabilities to analyze global two-phase problems are limited. Consequently, for two-phase advanced reactor analysis, INEEL plans to employ not only the Fluent-RELAP5-3D coupling, but also to make use of state-of-the-art experimental CFD tools such as CFDLib (available from the Los Alamos National Laboratory). A general description of the techniques used to couple the codes is given. A summary of the process used to checkout the coupled configuration is given. Finally, future tasks and plans are outlined.(author)", "num_citations": "4\n", "authors": ["1406"]}
{"title": "Rotordynamic design considerations for a 23 MW compressor with magnetic bearings\n", "abstract": " This paper describes a very demanding magnetic bearing application. A multi-stage centrifugal compressor, with a maximum discharge pressure of 130 barg, driven by a variable speed synchronous electric motor, with an operating speed range from 600 rpm to 6300 rpm. The requirements for the rotordynamic performance of the compressor are defined. Special engineering tools, covering the mechanical aspects as well as the electronic controller for the magnetic bearing system, are needed to comply with the requirements. The results of the calculations and an experimental verification are given.", "num_citations": "4\n", "authors": ["1406"]}
{"title": "Single and two-phase natural circulation in Westinghouse pressurized water reactor simulators: phenomena, analysis and scaling\n", "abstract": " [en] Natural circulation data obtained in the 1/48 scale W four loop PWR simulator-the Large Scale Test Facility (LSTF) are discussed and summarized. Core cooling modes, the primary fluid state, the primary loop mass flow and localized natural circulation phenomena occurring in the steam generator are presented. TRAC-PF1 LSTF model (using both a 1 U-tube and a 3 U-tube steam generator model) analyses of the LSTF natural circulation data including the SG recirculation patterns are presented and compared to the data. The LSTF data are then compared to similar natural circulation data obtained in the Primarkreislaufe (PKL) and the Semiscale facilities. Based on the 1/48 to 1/1705 scaling range which exists between the facilities, the implications of these data towrard natural circulation behavior in commercial plants are briefly discussed", "num_citations": "4\n", "authors": ["1406"]}
{"title": "Blind-blind prediction by RELAP5/MOD1 for a 0.1% very small cold-leg break experiment at ROSA-IV large-scale test facility\n", "abstract": " The large-scale test facility (LSTF) of the Rig of Safety Assessment No. 4 (ROSA-IV) program is a volumetrically scaled  pressurized water reactor (PWR) system with an electrically heated core used for integral simulation of small break loss-of-coolant accidents (LOCAs) and operational transients. The 0.1% very small cold-leg break experiment was conducted as the first integral experiment at the LSTF. The test provided a good opportunity to truly assess the state-of-the-art predictability of the safety analysis code RELAP5/MOD1 CY18 through a blind-blind prediction of the experiment since there was no prior experience in analyzing the experimental data with the code; furthermore, detailed operational characteristics of LSTF were not yet known. The LOCA transient was mitigated by high-pressure charging pump injection to the primary system and bleed and feed operation of the secondary system. The simulated …", "num_citations": "4\n", "authors": ["1406"]}
{"title": "Particle image velocimetry measurements and analysis of bypass data for a scaled 6mm gap\n", "abstract": " This report presents the results of fluid dynamics experiments conducted in the matched index-of-refraction flow system at Idaho National Laboratory. The experiments used primarily particle image velocimetry to measure the anticipated bypass flow associated with a prismatic gas turbine-modular helium reactor. A model which represents a stacked junction of six partial fuel blocks with nine coolant tubes and axial and radial gaps was manufactured and installed in the MIR; after which, stereo PIV was employed to measure the flow field within. Measurements were taken in three locations along the length of the model: in the upper plenum and in the midsections of both the large and small fuel blocks. Flow rates were calculated for the coolant channels and gaps for comparison. For the test conditions used, flow in the gaps was determined to be laminar while flow in the coolant channels was transitional. The bypass ratio was estimated to range from 6.8 to 15.8% for the considered flow rates.", "num_citations": "3\n", "authors": ["1406"]}
{"title": "Experimental and Analytic Study on the Core Bypass Flow in a Very High Temperature Reactor\n", "abstract": " Core bypass flow has been one of key issues in the very high temperature reactor (VHTR) design for securing core thermal margins and achieving target temperatures at the core exit. The bypass flow in a prismatic VHTR core occurs through the control element holes and the radial and axial gaps between the graphite blocks for manufacturing and refueling tolerances. These gaps vary with the core life cycles because of the irradiation swelling/shrinkage characteristic of the graphite blocks such as fuel and reflector blocks, which are main components of a core's structure. Thus, the core bypass flow occurs in a complicated multidimensional way. The accurate prediction of this bypass flow and counter-measures to minimize it are thus of major importance in assuring core thermal margins and securing higher core efficiency. Even with this importance, there has not been much effort in quantifying and accurately modeling the effect of the core bypass flow. The main objectives of this project were to generate experimental data for validating the software to be used to calculate the bypass flow in a prismatic VHTR core, validate thermofluid analysis tools and their model improvements, and identify and assess measures for reducing the bypass flow. To achieve these more»", "num_citations": "3\n", "authors": ["1406"]}
{"title": "Standard Problems for CFD Validation for NGNP-Status Report\n", "abstract": " The US Department of Energy (DOE) is conducting research and development to support the resurgence of nuclear power in the United States for both electrical power generation and production of process heat required for industrial processes such as the manufacture of hydrogen for use as a fuel in automobiles. The project is called the Next Generation Nuclear Plant (NGNP) Project, which is based on a Generation IV reactor concept called the very high temperature reactor (VHTR). The VHTR will be of the prismatic or pebble bed type; the former is considered herein. The VHTR will use helium as the coolant at temperatures ranging from 250 C to perhaps 1000 C. While computational fluid dynamics (CFD) has not previously been used for the safety analysis of nuclear reactors in the United States, it is being considered for existing and future reactors. It is fully recognized that CFD simulation codes will have to be validated for flow physics reasonably close to actual fluid dynamic conditions expected in normal operational and accident situations. The “Standard Problem” is an experimental data set that represents an important physical phenomenon or phenomena, whose selection is based on a phenomena identification and ranking table (PIRT) for the reactor in more»", "num_citations": "3\n", "authors": ["1406"]}
{"title": "Heat Transfer Boundary Conditions in the RELAP5-3D Code\n", "abstract": " The heat transfer boundary conditions used in the RELAP5-3D computer program have evolved over the years. Currently, RELAP5-3D has the following options for the heat transfer boundary conditions: (a) heat transfer correlation package option, (b) non-convective option (from radiation/conduction enclosure model or symmetry/insulated conditions), and (c) other options (setting the surface temperature to a volume fraction averaged fluid temperature of the boundary volume, obtaining the surface temperature from a control variable, obtaining the surface temperature from a time-dependent general table, obtaining the heat flux from a time-dependent general table, or obtaining heat transfer coefficients from either a time- or temperature-dependent general table). These options will be discussed, including the more recent ones.", "num_citations": "3\n", "authors": ["1406"]}
{"title": "DOE Advanced Reactor Research\n", "abstract": " Generation IV Program goals are aimed at developing advanced nuclear systems that are deployable by 2030 or earlier and:• Have adequate fuel resources and reserves for many years• Are economically competitive with all energy alternatives• Are even safer and more reliable than Generation III technology• Are exceptionally proliferation resistant. http://gif. inel. gov/roadmap", "num_citations": "3\n", "authors": ["1406"]}
{"title": "Development program of LOCA licensing calculation capability with RELAP5-3D in accordance with appendix K of 10 CFR 50.46\n", "abstract": " In light water reactors, particularly the pressurized water reactors, the severity of loss-of-coolant accidents (LOCAs) will limit how high the reactor power can extend. Although the best-estimate LOCA methodology can provide the greatest margin on the peak cladding temperature (PCT) evaluation during LOCA, it will take many more resources to develop and to get final approval from the licensing authority. Instead, implementation of evaluation models required by Appendix K of the Code of Federal Regulations, Title 10, Part 50 (10 CFR 50), upon an advanced thermal-hydraulic platform can also gain significant margin on the PCT calculation. A program to modify RELAP5-3D in accordance with Appendix K of 10 CFR 50 was launched by the Institute of Nuclear Energy Research, Taiwan, and it consists of six sequential phases of work. The compliance of the current RELAP5-3D with Appendix K of 10 CFR 50 has …", "num_citations": "3\n", "authors": ["1406"]}
{"title": "Quasi-static core liquid level depression and long-term core uncovery during a PWR LOCA\n", "abstract": " The possibility exists that the core liquid level can be depressed quasi-statically during long-term plant cooldown following a cold-leg-break loss-of-coolant accident in a pressurized-water reactor. Such a level depression can take place if the core steaming rate is almost balanced with the steam condensation rate in the reactor coolant system (RCS). Integral experiments simulating three steam condensation modes in the RCS have shown that quasi-static level depressions can happen and thus have the potential for causing a prolonged uncovery and heatup of the core upper regions.", "num_citations": "3\n", "authors": ["1406"]}
{"title": "Application of a universe-series code for inviscid flow over complex3-dimensional configurations\n", "abstract": " Simulation of flou, field over complex configurations is the perennial challenge in computational fluid dynamics. Solution methods based on structured grid topologies such as multi-zone’, 2 and overlapping grids3 have been successfully applied to a variety of complicated geometries. However, the conventional (structured grid) method involves a long and tedious trial and error process to generate a suitable grid for complex configurations. An alternate and potentially better method is to use an unstructured grid approach which has the advantage of inherent capability of handling three-dimensional objects of complex shapes. Recently, a new numerical capability ‘has been devel-oped at Rockwell Science Center for the conservation laws of fluid dynamics. The approach is based on algorithms that can be of higher than second order accuracy which are embedded in a very flexible geometric framework that includes …", "num_citations": "3\n", "authors": ["1406"]}
{"title": "Authors\n", "abstract": " Kenny C. Gross (top)(BS, 1975; MS, 1976; and PhD, 1977, nuclear engineering, University of Cincinnati) is with the Experimental Breeder Reactor II (EBR-II) Division of Argonne National Laboratory (ANL). His current technical interest is in the development of systems for detection, monitoring, and identification of failed fuel elements in liquid-metal-cooled reactors. BR Seidel (BS, metallurgy, Montana College of Mineral Science and Technology, 1967; MS, 1969, and PhD, 1975, materials science, Northwestern University; MRE, Religious Education, North American Baptist Seminary) has been responsible for the qualification and performance characterization of fuel, control, and blanket materials and related integral reactor components of the EBR-II fast breeder reactor for more than 11 years within the EBR-II Division of ANL. Currently, in addition to assessing fuels and materials performance and reliability, he …", "num_citations": "3\n", "authors": ["1406"]}
{"title": "Comparison of a TRAC calculation to the data from LSTF run SB-CL-05\n", "abstract": " Run SB-CL-05 is a 5% break in the side of the cold leg. The test results show that the core was uncovered briefly and that the rods overheated at certain core locations. Liquid holdup on the upflow side of the steam generator tubes was observed. When the loop seal cleared, the core refilled and the rods cooled. The TRAC results are in reasonable agreement with the test data, meaning that TRAC correctly predicted the major trends and phenomena. TRAC predicted the core uncovery, the resulting rod heatup, and the liquid holdup on the upflow side of the steam generator tubes correctly. The clearing of the loop seal allowed core recovery and cooled the overheated rods just as it had in the data, but TRAC predicted its occurrence 20 s late. The experimental and TRAC analysis results of run SB-CL-05 are similar to those for Semiscale Run S-UT-8. In both runs there was core uncovery, rod overheating, and steam generator liquid holdup. These results confirm scaling of these phenomena from Semiscale (1/1650) to LSTF (1/48).", "num_citations": "3\n", "authors": ["1406"]}
{"title": "Marviken Power Station critical flow data: a summary of results and code assessment applications\n", "abstract": " [en] Critical flow data were collected at the Marviken Power Station for short nozzles with inner diameters ranging from 200 to 500 mm. The facility is described, the test and analysis procedures are presented, the critical flow data are summarized, and the critical flow behavior of the nozzles is discussed. The article offers code assessment and verification of large thermal-hydraulic codes with specific examples using the Marviken critical flow data to assess the TRAC-BD1 code. Observations and conclusions regarding the Marviken test nozzles, the critical flow behavior, and the TRAC-BD1 assessment using the Marviken data are given", "num_citations": "3\n", "authors": ["1406"]}
{"title": "Station blackout in US light-water nuclear reactors\n", "abstract": " [en] Station blackout refers to a hypothetical sequence of events that leads to the loss of all offsite and onsite ac power sources at a pressurized-water reactor (PWR) or boiling-water reactor (BWR). Work supporting the Nuclear Regulatory Commission's resolution of station blackout as an unresolved safety issue is reviewed. A portion of the work, specifically deterministic plant analyses for the period from sequence initiation to the beginning of core heatup, is reported in detail for a PWR of each major reactor vendor and for a BWR", "num_citations": "3\n", "authors": ["1406"]}
{"title": "Station blackout transient at the Browns Ferry Unit 1 Plant: a severe accident sequence analysis (SASA) program study\n", "abstract": " [en] Operating plant transients are of great interest for many reasons, not the least of which is the potential for a mild transient to degenerate to a severe transient yielding core damage. Using the Browns Ferry (BF) Unit-1 plant as a basis of study, the station blackout sequence was investigated by the Severe Accident Sequence Analysis (SASA) Program in support of the Nuclear Regulatory Commission's Unresolved Safety Issue A-44: Station Blackout. A station blackout transient occurs when the plant's AC power from a comemrcial power grid is lost and cannot be restored by the diesel generators. Under normal operating conditions, fa loss of offsite power (LOSP) occurs [ie, a complete severance of the BF plants from the Tennessee Valley Authority (TVA) power grid], the eight diesel generators at the three BF units would quickly start and power the emergency AC buses. Of the eight diesel generators, only six are needed to safely shut down all three units. Examination of BF-specific data show that LOSP frequency is low at Unit 1. The station blackout frequency is even lower (5.7 x 10-4 events per year) and hinges on whether the diesel generators start. The frequency of diesel generator failure is dictated in large measure by the emergency equipment cooling water (EECW) system that cools the diesel generators", "num_citations": "3\n", "authors": ["1406"]}
{"title": "Marviken Critical Flow Test Program\n", "abstract": " [en] In the Marviken Full-Scale Critical Flow Test Program, a multinational project, 27 tests were conducted to obtain critical mass flow data for short nozzle geometries (200 to 509 mm in diameter with length-to-diameter ratios from 0.3 to 3.7) comparable to pipe sizes present in world nuclear reactor stations. The nozzle inlet pressures ranged from 5.2 to 2.6 MPa with the fluid subcooled as much as 50 0 C to low-quality saturation. A maximum nozzle mass flow rate of 14 Mg/s was measured. Typical data are presented and discussed in this article. These data provide an important link between the previously available small-scale critical mass flow rate data and existing operational hardware", "num_citations": "3\n", "authors": ["1406"]}
{"title": "Studies of Deteriorated Heat Transfer in Prismatic Cores Stemming from Irradiation-Induced Geometry Distortion\n", "abstract": " A reference design for the Next Generation Nuclear Plant (NGNP) is to use General Atomics Modular High Temperature Gas-cooled Reactor (MHTGR). For such a configuration in normal operation, the helium coolant flow proceeds from the upper plenum to the lower plenum principally through the core coolant channels and the interstitial gaps (bypass flow) that separate the prismatic blocks from one another. Only the core prismatic blocks have coolant channels. The interstitial gaps are present throughout the core, the inner reflector region, and the out reflector region. The bypass flows in a prismatic gas-cooled reactor (GCR) are of potential concern because they reduce the desired flow rates in the coolant channels and, thereby, can increase outlet gas temperatures and maximum fuel temperatures. Consequently, it is appropriate to account for bypass flows in reactor thermal gas dynamic analyses. The objectives of this project include the following: fundamentally understand bypass flow and heat transfer at scaled, undistorted conditions and with geometry distortions; develop improved estimates of associated loss coefficients, surface friction and heat transfer for systems and network codes; and obtain related data for validation of CFD (computational fluid dynamic) or system (eg, RELAP5) codes which can be employed in predictions for a more»", "num_citations": "2\n", "authors": ["1406"]}
{"title": "Wave Propagation in the Hot Duct of VHTR\n", "abstract": " In VHTR, helium from the reactor vessel is conveyed to a power conversion unit through a hot duct. In a hypothesized Depressurized Conduction Cooldown event where a rupture of the hot duct occurs, pressure waves will be initiated and reverberate in the hot duct. A numerical model is developed to quantify the transients and the helium mass flux through the rupture for such events. The flow path of the helium forms a closed loop but only the hot duct is modeled in this study. The lower plum of the reactor vessel and the steam generator are treated as specified pressure and/or temperature boundary to the hot duct. The model is based on the conservation principles of mass, momentum and energy, and on the equations of state for helium. The numerical solution is based on the method of characteristics with specified time intervals with a predictor and corrector algorithm. The rupture sub-model gives reasonable …", "num_citations": "2\n", "authors": ["1406"]}
{"title": "MHTGR core bypass flow patterns and pressure losses\n", "abstract": " The Modular High Temperature Gas-Cooled Reactor (MHTGR) has been chosen as a reference design for the Next Generation Nuclear Plant (NGNP) project. This reactor consists of concentric stacks of graphite blocks containing embedded fuel elements. Helium will be used as the coolant and will flow through coolant channels within the graphite blocks as well as in the gaps separating the blocks (called a bypass flow). A key phenomenon that may lead to localized hot spots in the reactor is the degradation of heat transfer effects in the bypass flow due to geometric distortions. Geometry distortions are the result of the graphite blocks being irradiated with energetic neutrons as well as thermal expansion effects due to temperature changes. Experimental data gathered from this project will be used to benchmark numerical codes used in the design and safety analysis of the MHTGR.Flow visualization and pressure loss experiments were conducted in order to characterize flow patterns approaching and within bypass channels and to quantify wall friction and pressure loss coefficients. A water-flow visualization apparatus was used to characterize bypass channel flow patterns using dye and particle tracers. The transparent acrylic model consisted of an inlet plenum, a beveled entrance to the simulated rectangular bypass channel, a diamond-shaped cut-out that simulated the junction between fuel blocks, and an exit bevel. The results were recorded photographically and with high-definition video. A water flow apparatus similar to that used for flow visualization was used to measure pressure distribution within the channel. Flows in both the …", "num_citations": "2\n", "authors": ["1406"]}
{"title": "Using stratified flow to mitigate condensation-induced water hammer\n", "abstract": " Research accomplished to determine whether stratified flow may be used to prevent the occurrence of condensation-induced water hammer (CIWH) in a horizontal pipe partially-filled with subcooled flowing water in the presence of saturated steam is described. Earlier researchers have shown that CIWH will readily occur in a horizontal pipe under such conditions when the void fraction is greater than 0.2 and the water is subcooled in excess of 20 C. Such conditions have been shown to occur in advanced reactor systems when using passive emergency core cooling systems designed to ensure the core remains covered. Flow rates from passive emergency core cooling systems, which do not use pumps, are dictated by buoyancy-driven flows that are governed by liquid density-gradients.", "num_citations": "2\n", "authors": ["1406"]}
{"title": "Characterizing Stratified Flow in Passive Emergency Core Cooling Systems for Advanced Light Water Reactors\n", "abstract": " Experiments performed to evaluate the Generation III Westinghouse AP600 advanced light water reactor (LWR) behavior during loss-of-coolant accidents demonstrated that passive emergency core cooling systems (ECCS), driven by density gradients, inject over a prolonged time period and keep the core covered and cool. When passive ECCS injection is underway the experiments showed that highly-subcooled water enters horizontal piping while a saturated stratified water layer may form part of the free surface. When a free surface is present, steam fills the volume above the free surface. Hence a three-layered system may exist as described in Liou, Schultz, and Kukita, 1997 and shown in Figure 1. These characteristics will likely also be observed in the Generation IV Supercritical Water Reactor (SCWR) passive cooling system. The presence of a subcooled water interface, in contact with steam, is a precursor for …", "num_citations": "2\n", "authors": ["1406"]}
{"title": "Preliminary Investigation of an Optimally Scramming Control Rod for Gas-Cooled Reactors\n", "abstract": " A passively safe control rod for gas-cooled reactors is proposed. This Optimally Scramming Control Rod (OSCR) is lifted out of the core region by the core coolant and descends back into the core when the coolant flow is not sufficient for core cooling purposes or in the event of depressurization. It is shown that for the current design of the OSCR, the reactor can be operated under normal lower power conditions down to about 80% of total power. It is also shown that cold shutdown can be achieved with rods of sufficiently low mass to allow naturally passive operation of the concept.", "num_citations": "2\n", "authors": ["1406"]}
{"title": "ROSA-AP600 experiment simulating a steam generator tube rupture transient\n", "abstract": " [en] Thermal hydraulic response of the Westinghouse AP600 reactor to a postulated steam generator tube rupture (SGTR) transient was investigated experimentally using the ROSAN Large Scale Test Facility (LSTF) which had been modified to simulate the AP600 reactor with a volume ratio of 1/30.5. The experiment simulated a simultaneous double-ended rupture of multiple U-tubes in one of two SGs. The AP600 passive safety features, passive residual heat removal (PRHR) and core makeup tanks (CMTs), were found to have an adequate heat removal capacity to keep the core filled with subcooled coolant without any operator actions. The primary-to-secondary heat transfer became reversed in the broken SG because of a rapid decrease in hot leg temperature due to the passive heat removal. The SG relief valves did not open after isolation of the SGs, for either broken or intact SG. Significant thermal-stratification, however, was present in the cold leg that includes the low-temperature PRHR return flow. 7 refs., 12 figs", "num_citations": "2\n", "authors": ["1406"]}
{"title": "Inviscid CFD for store separation using unified boundary conditions\n", "abstract": " A novel and versatile unification of \"exterior\" and \"interior\" boundary conditions has been developed This enables boundary conditions to be imposed at the ridges of the computational domain or in its interior. It leads to very easy treatment of multizonal, overlapped, non-overlapped, and sliding grids as wel1 as moving objects. The unification procedure is described along with several illustrative examples. In particular, the application of this unified boundary condition approach to computationally simulate the flow past separating stores is described.", "num_citations": "2\n", "authors": ["1406"]}
{"title": "Investigation of Abnormal Heat Transfer and Flow in a VHTR Reactor Core\n", "abstract": " The main objective of this project was to identify and characterize the conditions under which abnormal heat transfer phenomena would occur in a Very High Temperature Reactor (VHTR) with a prismatic core. High pressure/high temperature experiments have been conducted to obtain data that could be used for validation of VHTR design and safety analysis codes. The focus of these experiments was on the generation of benchmark data for design and off-design heat transfer for forced, mixed and natural circulation in a VHTR core. In particular, a flow laminarization phenomenon was intensely investigated since it could give rise to hot spots in the VHTR core.", "num_citations": "1\n", "authors": ["1406"]}
{"title": "Transient Mixed Convection Validation for NGNP\n", "abstract": " The results of this project are best described by the papers and dissertations that resulted from the work. They are included in their entirety in this document. They are:(1) Jeff Harris PhD dissertation (focused mainly on forced convection);(2) Blake Lance PhD dissertation (focused mainly on mixed and transient convection). This dissertation is in multi-paper format and includes the article currently submitted and one to be submitted shortly; and,(3) JFE paper on CFD Validation Benchmark for Forced Convection.", "num_citations": "1\n", "authors": ["1406"]}
{"title": "HTTF Core Stress Analysis\n", "abstract": " In accordance with the need to determine whether cracking of the ceramic core disks which will be constructed and used in the High Temperature Test Facility (HTTF) for heatup and cooldown experiments, a set of calculation were performed using Abaqus to investigate the thermal stresses levels and likelihood for cracking. The calculations showed that using the material properties provided for the Greencast 94F ceramic, cracking is predicted to occur. However, this modeling does not predict the size or length of the actual cracks. It is quite likely that cracks will be narrow with rough walls which would impede the flow of coolant gases entering the cracks. Based on data recorded at Oregon State University using Greencast 94F samples that were heated and cooled at prescribed rates, it was concluded that the likelihood that the cracks would be detrimental to the experimental objectives is small.", "num_citations": "1\n", "authors": ["1406"]}
{"title": "Saturated-Subcooled Stratified Flow in Horizontal Pipes\n", "abstract": " Advanced light water reactor systems are designed to use passive emergency core cooling systems with horizontal pipes that provide highly subcooled water from water storage tanks or passive heat exchangers to the reactor vessel core under accident conditions. Because passive systems are driven by density gradients, the horizontal pipes often do not flow full and thus have a free surface that is exposed to saturated steam and stratified flow is present. The subcooled water flows into the reactor vessel via the downcomer—which is an annular region separated from the core by a cylindrical, steel, inner liner. Under accident conditions, where the horizontal pipes are only partially full, both saturated water and saturated steam from the downcomer are likely to be present in the pipe. The saturated water is quasi-static and the fraction of the free surface that is saturated water is dictated by the physics of the flow. The …", "num_citations": "1\n", "authors": ["1406"]}
{"title": "Recent Hydrodynamics Improvements to the RELAP5-3D Code\n", "abstract": " The hydrodynamics section of the RELAP5-3D computer program has been recently improved. Changes were made as follows:(1) improved turbine model,(2) spray model for the pressurizer model,(3) feedwater heater model,(4) radiological transport model,(5) improved pump model, and (6) compressor model.", "num_citations": "1\n", "authors": ["1406"]}
{"title": "Computational Fluid Dynamic Analysis for the Proposed VHTR Lower Plenum Standard Problem\n", "abstract": " One of the reference designs for the Next Generation Nuclear Plant (NGNP) is a prismatic reactor configuration. A major concern in the operation of this design is the nature of the flow of hot gas as it exits the core into the lower plenum and then out the vessel exit duct. The two primary areas of concern are the impingement of hot jets onto the walls of the lower plenum and the degree of thermal mixing of the helium coolant as it flows out of the reactor vessel. Computational fluid dynamic (CFD) simulations have been proposed by general consensus to estimate the desired local fluid dynamic and temperature information. Successful CFD simulations require careful planning and extensive calculations to help ensure that they accurately represent the flow physics. An important aspect of the application of CFD is to validate the results against detailed validation data, for scaled problems that involve similar physics. A section of the lower plenum of the reference prismatic NGNP was employed to create a scaled model to use to obtain experimental data for use as validation data to compare with a CFD analysis. Extensive flow data were obtained from the scaled model while installed in the more»", "num_citations": "1\n", "authors": ["1406"]}
{"title": "Experiments to Investigate Flow Regime Transition for Steam and Subcooled Water From Stratified Flow to Slug Flow in Horizontal Pipe\n", "abstract": " Steam flowing over horizontally-stratified subcooled water in a circular-cross-section pipe may result in condensation-induced water hammer (CIWH). This subject has been studied by a number of researchers and representative data are given by Bjorge and Griffith 1986 who studied the conditions that lead to CIWH. Bjorge & Griffith give a good description of the phenomena including its precursors and characteristics.", "num_citations": "1\n", "authors": ["1406"]}
{"title": "On the choice between segregated and coupled solver approaches when using computational fluid dynamics for gas-cooled reactor analysis\n", "abstract": " In this study, computational fluid dynamics solutions are obtained for a General Atomics GT-MHR reactor core under a depressurization scenario involving highly compressible flow. It is found that while the FLUENT segregated solver is generally preferred for nuclear engineering applications, the coupled solver provides better performance at very high pressure ratios in this application.", "num_citations": "1\n", "authors": ["1406"]}
{"title": "Providing the Basis for Innovative Improvements in Advanced LWR Reactor Passive Safety Systems Design: An Educational R&D Project\n", "abstract": " This project characterizes typical two-phase stratified flow conditions in advanced water reactor horizontal pipe sections, following activation of passive cooling systems. It provides (1) a means to educate nuclear engineering students regarding the importance of two-phase stratified flow in passive cooling systems to the safety of advanced reactor systems and (2) describes the experimental apparatus and process to measure key parameters essential to consider when designing passive emergency core cooling flow paths that may encounter this flow regime. Based on data collected, the state of analysis capabilities can be determined regarding stratified flow in advanced reactor systems and the best paths forward can be identified to ensure that the nuclear industry can properly characterize two-phase stratified flow in passive emergency core cooling systems.", "num_citations": "1\n", "authors": ["1406"]}
{"title": "Next Generation Nuclear Plant Project: Preliminary Project Management Plan\n", "abstract": " This draft preliminary project management plan presents the conceptual framework for the Next Generation Nuclear Plant (NGNP) Project, consistent with the authorization in the Energy Policy Act of 2005. In developing this plan, the Idaho National Laboratory has considered three fundamental project planning options that are summarized in the following section. Each of these planning options is literally compliant with the Energy Policy Act of 2005, but each emphasizes different approaches to technology development risks, design, licensing and construction risks, and to the extent of commercialization support provided to the industry.The primary focus of this draft preliminary project management plan is to identify those activities important to Critical Decision-1, at which point a decision on proceeding with the NGNP Project can be made. The conceptual project framework described herein is necessary to establish …", "num_citations": "1\n", "authors": ["1406"]}
{"title": "Processes and Procedures for Application of CFD to Nuclear Reactor Safety Analysis\n", "abstract": " [en] Traditionally, nuclear reactor safety analysis has been performed using systems analysis codes such as RELAP5, which was developed at the INL. However, goals established by the Generation IV program, especially the desire to increase efficiency, has lead to an increase in operating temperatures for the reactors. This increase pushes reactor materials to operate towards their upper temperature limits relative to structural integrity. Because there will be some finite variation of the power density in the reactor core, there will be a potential for local hot spots to occur in the reactor vessel. Hence, it has become apparent that detailed analysis will be required to ensure that local''hot spots''do not exceed safety limits. It is generally accepted that computational fluid dynamics (CFD) codes are intrinsically capable of simulating fluid dynamics and heat transport locally because they are based on''first principles''. Indeed, CFD analysis has reached a fairly mature level of development, including the commercial level. However, CFD experts are aware that even though commercial codes are capable of simulating local fluid and thermal physics, great care must be taken in their application to avoid errors caused by such things as inappropriate grid meshing, low-order discretization schemes, lack of iterative convergence and inaccurate time-stepping. Just as important is the choice of a turbulence model for turbulent flow simulation. Turbulence models model the effects of turbulent transport of mass, momentum and energy, but are not necessarily applicable for wide ranges of flow types. Therefore, there is a well-recognized need to establish practices and …", "num_citations": "1\n", "authors": ["1406"]}
{"title": "Defining the research and development needs for the next generation nuclear plant: Neutronics and thermal-hydraulics\n", "abstract": " In May, 2004, the U.S. Department of Energy (DOE) released a 'Request for Information and Expressions of Interest' (EOI) on the Next Generation Nuclear Plant (NGNP). The DOE objective 'is to conduct research, development, and demonstration of a next-generation nuclear power reactor in order to establish advanced technology for the future production of safe, efficient, and environmentally-acceptable power and to demonstrate the economic and technical feasibility of such facilities to the U.S. electric power industry.' The process of demonstrating the NGNP will require rigorous analysis of the plant's projected behavior under all postulated operational and accident conditions such that the operational and accident envelopes for the NGNP are fully defined and understood. Thus, the analytical tools must be demonstrated to be capable of analyzing the plant's behavior in the plant's operational and accident envelopes. Research and development (R and D) specific to the NGNP and conducted to date is based on the very high temperature reactor (VHTR) concept promulgated in the Generation IV technology roadmap. Although the NGNP may or may not resemble this concept, early thinking on the most likely candidates for the NGNP has led researchers to consider the prismatic and pebble bed variants of the very high temperature gas cooled thermal reactor. These designs have been demonstrated and have been studied extensively. Because some of their operational and accident characteristics have been identified in past studies, these characteristics are a good starting point for research and development planning and studies. This paper only …", "num_citations": "1\n", "authors": ["1406"]}
{"title": "Stratified Flow Experiments Pertaining to Advanced LWR Reactor Passive Safety System Designs\n", "abstract": " During a loss-of-coolant-accident in advanced light water reactors, outside coolant enters the cold leg by gravity to cool the core. This coolant is at a substantially lower temperature and thus is heavier than the liquid in and from the reactor. Consequently, stratified flow may occur. A stratified flow may cause condensation-induced water hammer, and will influence the coolant flow behavior. Two sets of experiments are in progress to better understand stratified flow conditions that lead to water hammer, and the density stratification behavior. The first set uses air-oil-water as the test media. Its purposes are to conduct exploratory tests and to provide instruction an apparatus for education purposes. The second set of tests will use steam and water and, later, the refrigerant R123. This paper describes the exploratory test facility, gives a brief description of the facility that will be used for the steam-water and refrigerant tests …", "num_citations": "1\n", "authors": ["1406"]}
{"title": "Conceptual design of a passive, inherently safe emergency shutdown rod for high-temperature reactor applications\n", "abstract": " The concept of a passive, inherently safe, and fail-safe design for an emergency control rod is presented. The functioning of the rod is based solely on inexorable physical laws. The operation of the rod in its emergency function does not require the intervention of a human operator, nor does it rely on any signal from a monitoring or safety system. Although the concept could be applicable to a variety of reactors (provided a normal temperature range is specified), in this paper, the concept is applied to the emergency shutdown of a pebble-bed reactor. The preliminary study presented here demonstrates that the proposed Electro-Magnetic Optimally Scramming Control Rod (EM-OSCR) naturally operates when needed. The rod is held out of the core region by the force of an electromagnet. The force is generated by a current carried by a conductor, a portion of which passes near or through the reactor core region. When the temperature in the conductor increases because of an increase in temperature in the reactor, the conductor resistivity increases. This, in turn, leads to a current decrease. When the current decreases below the level necessary to hold the rod up, the rod is released and it falls into the core under the effect of gravity. (author)", "num_citations": "1\n", "authors": ["1406"]}
{"title": "NRC confirmatory AP600 safety system phase I testing in the ROSA/AP600 test facility\n", "abstract": " [en] The NRC confirmatory phase I testing for the AP600 safety systems has been completed in the modified ROSA (Rig of Safety Assessment) test facility located at the Japan Atomic Energy Research Institute (JAERI) campus in Tokai, Japan. The test matrix included a variety of accident scenarios covering both design and beyond-design basis accidents. The test results indicate the AP600 safety systems as reflected in ROSA appear to perform as designed and there is no danger of core heatup for the accident scenarios investigated. In addition, no detrimental system interactions nor adverse effects of non-safety systems on the safety system functions were identified. However, three phenomena of interest have been identified for further examination to determine whether they are relevant to the AP600 plant. Those three phenomena are:(1) a potential for water hammer caused by rapid condensation which may occur following the actuation of the automatic depressurization system (ADS),(2) a large thermal gradient in the cold leg pipe where cooled water returns from the passive residual heat removal system and forms a thermally stratified layer, and (3) system-wide oscillations initiating following the ADS stage 4 actuation and persisting until the liquid in the pressurizer drains and steam generation in the core becomes insignificant", "num_citations": "1\n", "authors": ["1406"]}
{"title": "Applications of active magnetic bearings to high speed turbomachinery with aerodynamic rotor disturbance\n", "abstract": " This paper describes the application of Glacier magnetic bearings in three high speed turbomachinery applications. The three turbomachinery applications described are:(1) A single stage gas turbine coupled to a high frequency alternator for portable power generation. The gas turbine operating speed is 80,000 RPM and the magnetic bearings see temperatures in excess of 450 {degrees} C due to the heat generation from combustion.(2) A single stage centrifugal compressor for impeller efficiency evaluation. The compressor is installed in a test loop and is driven with an electric motor through a step-up gearbox and the maximum speed is 23,000 RPM.(3) Two 600 KW turboexpanders with normal operating-speeds of 27,000 RPM. The turboexpanders are installed in tandem in an ethylene plant and are used for plant pressure control and efficiency enhancement. The expanders are designed for a 36,000 RPM overspeed and have been operated at 33,000 RPM. Each turbomachine generates unique, non-synchronous aerodynamically induced disturbances. Current aerodynamic technology does not allow the turbomachinery OEMs to accurately predict these disturbances. The magnetic bearing system monitoring capabilities are vital to characterize the disturbances and identify the control system optimization for attenuation of rotor response. Advantages of a velocity feedback control system are highlighted. The more»", "num_citations": "1\n", "authors": ["1406"]}
{"title": "RELAP/MOD3 code manual: User's guidelines. Volume 5, Revision 1\n", "abstract": " The RELAP5 code has been developed for best estimate transient simulation of light water reactor coolant systems during postulated accidents. The code models the coupled behavior of the reactor coolant system and the core for loss-of-coolant accidents, and operational transients, such as anticipated transient without scram, loss of offsite power, loss of feedwater, and loss of flow. A generic modeling approach is used that permits simulating a variety of thermal hydraulic systems. Control system and secondary system components are included to permit modeling of plant controls, turbines, condensers, and secondary feedwater systems.RELAP5/MOD3 code documentation is divided into seven volumes: Volume I provides modeling theory and associated numerical schemes; Volume II contains detailed instructions for code application and input data preparation; Volume III provides the results of developmental assessment cases that demonstrate and verify the models used in the code; Volume IV presents a detailed discussion of RELAP5 models and correlations; Volume V contains guidelines that have evolved over the past several years through the use of the RELAP5 code; Volume VI discusses the numerical scheme used in RELAP5; and Volume VII is a collection of independent assessment calculations.", "num_citations": "1\n", "authors": ["1406"]}
{"title": "Determination of the bias in LOFT fuel peak cladding temperature data from the blowdown phase of large-break LOCA experiments\n", "abstract": " Data from the Loss-of-Fluid Test (LOFT) Program help quantify the margin of safety inherent in pressurized water reactors during postulated loss-of-coolant accidents (LOCAs). As early as 1979, questions arose concerning the accuracy of LOFT fuel rod cladding temperature data during several large-break LOCA experiments. This report analyzes how well externally-mounted fuel rod cladding thermocouples in LOFT accurately reflected actual cladding surface temperature during large-break LOCA experiments. In particular, the validity of the apparent core-wide fuel rod cladding quench exhibited during blowdown in LOFT Experiments L2-2 and L2-3 is studied. Also addressed is the question of whether the externally-mounted thermocouples might have influenced cladding temperature. The analysis makes use of data and information from several sources, including later, similar LOFT Experiments in which fuel centerline temperature measurements were made, experiments in other facilities, and results from a detailed FRAP-T6 model of the LOFT fuel rod. The analysis shows that there can be a significant difference (referred to as bias) between the surface-mounted thermocouple reading and the actual cladding temperature, and that the magnitude of this bias depends on the rate of heat transfer between the fuel rod cladding and coolant. The results of the analysis demonstrate clearly that a core-wide cladding more»", "num_citations": "1\n", "authors": ["1406"]}
{"title": "An investigation of core liquid level depression in small break loss-of-coolant accidents\n", "abstract": " [en] Core liquid level depression can result in partial core dryout and heatup early in a small break loss-of-coolant accident (SBLOCA) transient. Such behavior occurs when steam, trapped in the upper regions of the reactor primary system (between the loop seal and the core inventory), moves coolant out of the core region and uncovers the rod upper elevations. The net result is core liquid level depression. Core liquid level depression and subsequent core heatups are investigated using subscale data from the ROSA-IV Program's 1/48-scale Large Scale Test Facility (LSTF) and the 1/1705-scale Semiscale facility. Both facilities are Westinghouse-type, four-loop, pressurized water reactor simulators. The depression phenomena and factors which influence the minimum core level are described and illustrated using examples from the data. Analyses of the subject experiments, conducted using the TRAC-PF1/MOD1 (Version 12.7) thermal-hydraulic code, are also described and summarized. Finally, the response of a typical Westinghouse four-loop plant (RESAR-3S) was calculated to qualitatively study coal liquid level depression in a full-scale system. 31 refs., 37 figs., 6 tabs", "num_citations": "1\n", "authors": ["1406"]}
{"title": "Core liquid level depression in 5% small break LOCAs: an investigation using subscale data\n", "abstract": " Proceedings of the US Nuclear Regulatory Commission fifteenth water reactor safety information meeting: Volume 4, Separate effects/experiments and analyses, Source term uncertainty analysis, Integral systems testing, 2D/3D research", "num_citations": "1\n", "authors": ["1406"]}
{"title": "A LSTF simulation of the TMI-2 scenario in a Westinghouse type four loop PWR\n", "abstract": " [en] The scenario was studied in preparation for upcoming tests in the ROSA-IV Program's Large Scale Test Facility (LSTF). The LSTF is a 1/48 scale simulator of a W type four loop PWR with full scale component elevation differences. TMI-2 scenario simulation analyses were conducted to establish a pretest prediction data base for RELAP5 code evaluation purposes and to furnish a means of evaluating the LSTF's capability to simulate the reference PWR. The basis for such RELAP5 calculations and the similarities between the LSTF and reference PWR thermal-hydraulic behavior during a TMI-2 scenario are presented.(orig./HP)", "num_citations": "1\n", "authors": ["1406"]}