{"title": "Situ-centric reinforcement learning for recommendation of tasks in activities of daily living in smart homes\n", "abstract": " In this paper, we propose a new recommendation system that considers the changing human mental state, behavior and environmental contexts to provide guidance to persons diagnosed of mild cognitive impairment (MCI) or Alzheimer's in performing their activities of daily living (ADLs). The recommendation system is based on the Situ-framework that represents an activity as a sequence of situations, and a situation is a 3-tuple <;M, B, E> where M denotes human mental state, B is the behavior context and E is the environmental context. More so, it uses an automaton to model an activity thereby generating corresponding task sequences. Interactions between the inhabitants and the sensor networks and the activity being performed are represented as an information space. It then uses a modified model learning algorithm as its decision making tool to recommend appropriate actions or tasks sequence to the …", "num_citations": "13\n", "authors": ["1492"]}
{"title": "Situation‐centered goal reinforcement of activities of daily living in smart home environments\n", "abstract": " Older adults with early‐stage dementia (ED) can experience confusion or lack clarity when performing routine activities of daily living (ADLs). These circumstances predispose the older adult to safety‐critical and often risky situations. A safety‐critical risky situation is one that constitutes a hazard. To support independent living, a sensor‐laden smart environment can be employed to mitigate such hazards. In this paper, we propose a situation‐centered goal reinforcement framework that supports older adults with ED in their decision making, and guides them through their ADL in order to fulfill their goal or intention and avoid hazards. First, we employ an LSTM (Long Short‐Term Memory) model to infer the current goal of the resident, using their previously observed normal ADL patterns. Secondly, we identify potentially risky situations in their currently observed goal path. We then incorporate a situ‐learning agent (SLA …", "num_citations": "6\n", "authors": ["1492"]}
{"title": "Situation Based Energy Management Framework on Mobile Devices\n", "abstract": " With the prevalent usage of mobile phones, energy saving has become a critical issue for manufacturers. Extended battery life with increasing battery capacity is a common solution for hardware-based improvements. However, energy efficient management mechanism has attracted matching attention. In this paper, we present a situation based energy management framework. First, we collect data of activities of daily living (ADL) and apply deep learning for training. Next, Long Short Term Memory (LSTM) of Recurrent Neural Network (RNN) is used as our forecasting model to predict what a user will do at a certain hour in a certain day. Such prediction model relies on sensor fusion in gesture detection, camera-based facial detection and touch events on LCD screen in dynamic contextual environment. Finally, an inference engine is used to recommend actions to be takes for energy saving by digesting the …", "num_citations": "3\n", "authors": ["1492"]}
{"title": "Situation-Driven Context-Aware Safety Model for Risk Mitigation Using LTL in a Smart Home Environment\n", "abstract": " Early-stage dementia impacts aging adults' cognitive functioning including the initiative and performance of instrumental activities of daily living (IADLs) that require a series of actions to be completed (e.g., meal preparation, medication management). Thus, cognitive impairment predisposes adults to temporal organization of action sequence error in IADLs that may constitute life-threatening injuries or accidents [11]–[13]. To mitigate this inherent risk in the performance of IADLs, a linear temporal logic (LTL)-based safety model is proposed for detection of risky behaviors inherent IADLs in smart home environments. Keywords-Safety; Aging; Situation; IADLs; Smart Home; Temporal Logic", "num_citations": "2\n", "authors": ["1492"]}
{"title": "On the Performance of Lossless Wavelet Compression Scheme on Digital Medical Images in JPEG, PNG, BMP and TIFF Formats\n", "abstract": " The major challenges facing digital radiological systems notably: teleradiology and picture archiving and communication systems (PACS) are not unconnected to: limited storage space and bandwidth requirements for storage, transmission, retrieval and archiving of digital medical images. Lossless compression techniques have been adopted by the medical community to help solve these problems as it does not degrades the quality of the medical image which is crucial for diagnosis while reducing the size (often in ratio 2: 1) of the original image. However, little attention has been paid to knowing the performance of a choice compression scheme on the medical image format type for efficient handling in the digital radiology system. Hence, this work presents an evaluation of the performance of a lossless wavelet compression scheme on samples of computed tomography (CT) images of the brain in JPEG, PNG, BMP and TIFF formats.", "num_citations": "1\n", "authors": ["1492"]}