{"title": "Batik image retrieval based on similarity of shape and texture characteristics\n", "abstract": " This research develops the concept of CBIR on the image motif. For processes that do not only find images that have been stored in database, but also be able to recognize some resemblance ornament image or texture as well as form. Although different size, direction of slope, and the layout of texture and shape, but the concept will be recognized. In calculating the percentage of similarity is not only based on performance measurement precision but also the image of the relevant. From the results of over 250 studies batik motif images and 25 images in the database query, it is used for texture feature extraction methods canny edge detection and shape invariant moment feature extraction. For the calculation of the similarity distance and Canberra distance is used euclid functions. Threshold Algorithm which will display the image based on the value of the highest grade representation on each image query, followed …", "num_citations": "23\n", "authors": ["1979"]}
{"title": "Implementation of a Modern Security Systems Honeypot Honey Network on Wireless Networks\n", "abstract": " Today's Internet technology is not free from problems. Unfortunately, it is used by people who have no right to steal important data. The National ICT Training and Research Center (PUSTIKNAS) Ministry of Communication and Information Technology the Republic of Indonesia is one of the government agencies that often suffer experimental intrusion by outsiders. One solution is to implement a honeypot system that can be used to improve the security of the Internet network and can detect intrusion attempts or attacks. A honeypot system with a Modern Honey Network (MHN) has been developed to make deployment and management easier and to make the honeypot more secure. The honeypots used in this study are the Kippo, Glastopf, Dionaea honeypots. With testing of the honeypot system in the form of an intrusive attack, it can be concluded that the honeypot system managed to outwit the attacker by opening …", "num_citations": "18\n", "authors": ["1979"]}
{"title": "Analysis of Image Similarity with CBIR Concept Using Wavelet Transform and Threshold Algorithm\n", "abstract": " This paper carried out to develop the concept of CBIR by using Wavelet Transform Methods for feature form and texture extraction and adaptive histogram for feature color extraction. The method is not only recognize the images that have been stored in database, but also be able to find some resemblance ornament image or texture as well as form. Although They are different size, direction of slope, and the layout of texture and color. In calculating the percentage of similarity is not only based on performance measurement precision but also the image of the relevant. Basically Grade value calculation is using the fuzzyfication process to get the similarity values with the S-curve which is then used as input to perform retrieval of image with the threshold algorithm. It will display the image based on the representation of the highest grade in each query image, which has been compared with the image database. High …", "num_citations": "17\n", "authors": ["1979"]}
{"title": "Analysis of statement branch and loop coverage in software testing with genetic algorithm\n", "abstract": " Software testing is one important aspect of the software development process. About 50% of the time and cost in the software development process used for software testing process. There are two methods of software testing, black-box testing and white-box testing. This research using white-box testing. Software testing can be done manually or automatically. Based on research conducted, genetic algorithm has been widely implemented in software testing, such as test data generator. The purpose of this study is to apply a genetic algorithm in software testing and comparing the results with manual testing, automated, and automated with genetic algorithm. The test parameters are coverage measurements (statement, branch and loop coverage) and the time of testing. The conclusion of this study is automated testing with genetic algorithm requires fewer time and test cases to achieve coverage of 100%.", "num_citations": "15\n", "authors": ["1979"]}
{"title": "Performance analysis of VoIP client with integrated encryption module\n", "abstract": " The number of VoIP users in Indonesia is very low, although the cost offered by VoIP is smaller than using pulsed phone. One of the reason is security provided by the VoIP service provider is still lacking. VoIP users have not received yet the security service to ensure the security of communications. This study tries to secure communications between VoIP users using encryption module that is integrated with VoIP client Sipdroid running on Android Smartphone. It is possible for VoIP users because VoIP client that can only be accessed by VoIP users. The result obtained after integration with encryption module using three encryption schemes, they are AES, DES, and RC4. Sipdroid able to resist passive attack from tapping information (eavesdropping) during the communication session. And the result of QoS measurements is an increase delay of 0.01 ms and no significant change in the throughput and the packet …", "num_citations": "15\n", "authors": ["1979"]}
{"title": "Empirical Approach of Ad hoc Path Loss Propagation Model in Realistic Forest Environments\n", "abstract": " An Internet of Things (IoT) application that employs wireless transmission data such as Wireless Sensor Node need to be designed well enough, So its data doesn't loss in its transmission between the node. Therefore to build an IoT application such as Wireless Sensor Node path loss propagation model is a must. In this paper, we proposed a new path loss model to be used on a near ground 2.4 GHz Wireless Sensor Node network in forest environment application. Our methods are using one of IoT node such as Microcontroller Wemos to do walk test and then capture statistical data the RSSI level every 5 meters and compare it to the simulation. Our new proposed model has a better result for forest environment at about 2.01 dB forest with High grass more than 30cm, 0.69 dB low grasses less than 10cm, and 0.26 dB without grass compare with other model and compare to the measurement at 65 meters.", "num_citations": "10\n", "authors": ["1979"]}
{"title": "Qr code augmented reality tracking with merging on conventional marker based backpropagation neural network\n", "abstract": " QR Code Augmented Reality (QRAR) is an Augmented Reality does not require preregistration, it has 10 7089  combination ID-encoded and can be used on the public AR application. The results from previous research are 6 DOF tracking method less accurate, require small computation power and unstable marker. We propose merging conventional marker with QR Code, but it will have noise on the QR Code Finder Patter (QRFP) under perspective distortion, so we propose a Backpropagation method to keep detecting the QRFP and the method preceded by feature extraction with low level image processing. The methods we have proposed, achieve accurate 6 DOF, runs at 35.41 fps and stable marker as conventional marker.", "num_citations": "9\n", "authors": ["1979"]}
{"title": "Cross-Project Defect Prediction For Web Application Using Naive Bayes (Case Study: Petstore Web Application)\n", "abstract": " Predicting defect in software is a complicated process and time-consuming. AI-Based software defect predictor can predict 75% defect in software and help developer team to detect and to fix defect module before performing unit testing/system testing by quality assurance. Some research tried to construct prediction model using other project datasets, which is called cross-project defect prediction. Nevertheless, the project should have the same software metric attribute. Recently, web application takes a crucial part in human life, for that reason assuring the quality of web application is very serious. This research will implement defect prediction on the petstore web application with other project datasets. CK OO metric is employed as the parameter. Naive bayes algorithm is an effortless and successful algorithm for predicting defect on software. The objective of this research is to apply naive bayes algorithm in cross …", "num_citations": "7\n", "authors": ["1979"]}
{"title": "Energy Efficiency and Loss of Transmission Data on Wireless Sensor Network with Obstacle\n", "abstract": " The growth of Wireless Sensor Network (WSN) in the late years, encourages a lot of research in it. The most investigated topics are energy consumption, coverage, and connectivity in WSN. This paper discusses connectivity for WSN with the presence of simple obstacles. The LEACH protocol is used and is modified based on the obstacle, to improve the clustering process. We propose an algorithm based on the intersection of line to improve the original LEACH. The result of simulation shown the modified LEACH algorithm works better than the original LEACH with the presence of obstacle based on energy consumption and loss of transmission data. The future work could be done to modify the LEACH for arbitrary obstacle.", "num_citations": "6\n", "authors": ["1979"]}
{"title": "Building a private cloud computing and the analysis against DoS (denial of service) attacks: Case study at SMKN 6 Jakarta\n", "abstract": " The development of Cloud Computing is growing and becoming a trend that is widely used in the world of telecommunications today. In education, cloud computing becomes something that is needed to support the teaching and learning process. We analyze and design the network infrastructure in schools to implement cloud computing in local area schools. Then we built a system to create a server for cloud computing that can be accessed through the wired network and wireless network. Once the server cloud computing is installed and then we test functions such as uploading and downloading files whether to run well. The next step is to perform the test by doing DOS (Denial Of Service). The results show when no server DoS attack goes well with a large throughput. However, after the DoS attacks decreased throughput value and the greater the number of attacks is increasingly reducing the throughput of the …", "num_citations": "6\n", "authors": ["1979"]}
{"title": "Software Defect Prediction Using Neural Network Based SMOTE\n", "abstract": " Software defect prediction is a practical approach to improve the quality and efficiency of time and costs for software testing by focusing on defect modules. The dataset of software defect prediction naturally has a class imbalance problem with very few defective modules compared to non-defective modules. This situation has a negative impact on the Neural Network, which can lead to overfitting and poor accuracy. Synthetic Minority Over-sampling Technique (SMOTE) is one of the popular techniques that can solve the problem of class imbalance. However, Neural Network and SMOTE both have hyperparameters which must be determined by the user before the modelling process. In this study, we applied the Neural Networks Based SMOTE, a combination of Neural Network and SMOTE with each hyperparameter of SMOTE and Neural Network that are optimized using random search to solve the class imbalance …", "num_citations": "5\n", "authors": ["1979"]}
{"title": "Comparative Analysis of LLQ Traffic Scheduler to FIFO and CBWFQ on IP Phone-Based Applications (VoIP) Using Opnet (Riverbed)\n", "abstract": " Nowadays, world is on going to “Convergence Era”, where data, voice, and video overcome to pass through same network, like IP network. Unfortunately, the fast growth of application technology has not been supported yet by default IP network in the case of quality of service. We have known, that voice over IP services have sensitivity to delay, jitter and latency. And it require of different bandwidth which is also required some service guarantee. How to comparing queue mechanism of VoIP attributed to QoS?. In this case, we need to give guarantee of QoS relied on operation of data packages to be delivered along with its scheduling. Scheduling represent queue mechanism from an applying of network QoS's, that is an arrangement process of an exit and entry of assumed data packages queuing exceed CIR (Committed Information Rate) specified. Regulation of this data exit and entry can be formed with specified …", "num_citations": "5\n", "authors": ["1979"]}
{"title": "Open data strategy for enhancing the productivity and competitiveness of fishery SMEs in Indonesia\n", "abstract": " The using of open data to improve transparency and public participation in the national development has become an issue in Indonesia. The public, including Small and Medium Enterprises (SMEs) can use the open data provided by the government and other related institutions in order to increase their profits and benefits. The SMEs in fish farming and processing are also trying to use open data in order to improve their productivity and competitiveness. However, current open data in fishery SMEs are scattered in different sites with different status and lack of strategy to integrate and utilize them efficiently. This paper proposed a top-down model as a strategy to identify problem, opportunity and challenges of integrating and using open data for fishery SMEs. The result is a model that can be used for supporting decisions made by SMEs.", "num_citations": "5\n", "authors": ["1979"]}
{"title": "Exploring the Influential Antecedents of Actual Use of Internet Banking Services in Indonesia\n", "abstract": " With the emergence of electronic banking use, satisfaction and trust become crucial and prominent factors in determining online banking success, whereas consumers' reluctance in directing their decisions to adopt and use e-commerce has remarked the significant aspect of trust, security, and privacy in either traditional and online commerce systems. This study proposes an extended framework based on the DeLone and McLean's IS Success Model incorporated into the development of consumer's usage and behaviors towards Internet-based banking services in Indonesia. The results of this study show that security was the most important concern for user satisfaction, which in turn strongly affected Internet banking usage in Indonesia. Satisfaction influenced both consumer's trust and usage significantly. Interestingly, trust was found insignificant on Internet banking usage. The study will derive conclusions …", "num_citations": "5\n", "authors": ["1979"]}
{"title": "A Study on Pre-Processing Methods for Copy-Move Forgery Detection Based on SIFT\n", "abstract": " Copy-move forgery detection is one of the most popular type of forgery in multimedia forensics. The attacks copy and paste desired area in the same images. In this paper, we aim to reduce the false matches of detected area of forgery by using the pre-processing methods, such as histogram equalization, smoothing filter with median and Gaussian filter and sharpening filter, combined with the SIFT algorithm. We presented the results of each of the pre-processing methods for total SIFT keypoints detected, total number of matches and total number of false matches. From 30 tampered images that fell into 3 groups, the SIFT method could be combined with pre-processing methods to reduce false matches and the best pre-processing method that gave the lowest false matches results was dependable on the types of images in the database.", "num_citations": "4\n", "authors": ["1979"]}
{"title": "Analysis of Travel Time Computation Accuracy from  Crowdsource Data of Hospitality Application in South of Tangerang City with Estimated Travel Time Method\n", "abstract": " There are so many applications using Crowdsource techniques in retrieving data, especially data on the traffic density of vehicles on certain roads, sample applications that already implementing the concept Crowdsourced data such as Waze, Google Maps, Bing Maps, etc. However, from that Crowdsouced data it will arise the question, whether the given data valid? Or how accurate the data provided by the “crowd”? that is why this research needs to be undertaken to prove the accuracy of data retrieval krom the application. The Author perform the comparison of data between the data retrieved from the application that the Author made (derived from data crowdsource Waze) with data obtained from manual calculations using estimated travel time method. The Author use the RAD (Rapid Application Development) as a method to develop applications. Retrieval method from source Waze Crowdsource Data using the …", "num_citations": "4\n", "authors": ["1979"]}
{"title": "Transmission of Real-time Video Signal with Interference Density and Human Traffic.\n", "abstract": " The use of mobile phone as a communication tool rapidly increases, as well as various types of functions therein. Among of the many applications on the mobile phone, which are used skype androidbased for teleconferencing via mobile phone. Things can not be separated from these applications is the need of qualified internet network access for these applications can be felt up function. One of the network access to the Internet is widely used today's society is a wi-fi network. Access to the Internet does not always provide the best performance, this is due to many factors, one of which is the presence of interference. In this study, we tested transmission of video signals in real-time using an application skype on the mobile phone. Skype run on wi-fi network, which is influenced by the presence of interference or objects such as human traffic in the network. Wireshark were used to obtain data reliability wi-fi network, known as QoS. While evalvid used to obtain the data QoE restricted only get the data PSNR (Peak Signal To Noise Ratio) and MSE (Mean Square Error).", "num_citations": "4\n", "authors": ["1979"]}
{"title": "ANALISIS DAN PERANCANGAN APLIKASI MOBILE COMMERCE TIKET TRAVEL (M-TICKETING) PADA SMARTPHONE ANDROID (STUDI KASUS : TRAVEL UMBARA TRANS)\n", "abstract": " Umbara Trans merupakan perusahaan penyedia jasa travel dengan jangkauan wilayah Jakarta-Bandung. Kemunculan beberapa penyedia jasa travel sejenis menjadikan Umbara Trans harus menyikapi persaingan ketat yang terjadi. Oleh karena itu diperlukan adanya perbaikan strategi dalam bisnisnya agar dapat meningkatkan pelayanan dan kepuasan penggunanya. Berdasarkan hasil wawancara dan penyebaran kuisioner kepada staff dan member Umbara Trans diketahui bahwa perbaikan yang diperlukan berupa inovasi dalam proses promosi, penyebaran informasi, pemesanan dan penjualan tiket yang mudah diakses oleh pengguna jasa, kapanpun dan dimanapun, serta sistem terkomputerisasi yang memudahkan pihak Umbara trans dalam memantau penjualan tiket yang lebih rapi dan dapat dipertanggung jawabkan kebenarannya. Untuk menjawab kebutuhan tersebut maka penulis mengajukan solusi berupa pengimplementasian m-commere tiket travel pada smartphone Android yang dikembangkan dengan metodelogi RAD (Rapid Application Development) dan UML (Unified Modelling Language) sebagai alat bantu dalam pengembangan sistem. Penelitian ini menghasilkan aplikasi M-Commerce Tiket Travel pada Smartphone Android yang berbasis client-server, dimana pada sisi server aplikasi dibangun dalam bentuk website menggunakan bahasa pemrograman PHP serta MySQL untuk proses input data dan manajemen database. Sedangkan pada sisi client berupa mobile aplikasi yang berjalan pada smartphone Android yang digunakan oleh member untuk melakukan pengaksesan informasi (jadwal, armada, lokasi pool …", "num_citations": "4\n", "authors": ["1979"]}
{"title": "Sistem informasi spasial potensi perikanan kabupaten cirebon berbasis Web\n", "abstract": " Kabupaten Cirebon yang merupakan salah satu kabupaten paling timur Provinsi Jawa Barat dengan luas wilayah 989,70 Km2, garis pantai 54 Km dan Luas areal tambak 7.500,0 Ha, Menjadikan Kabupaten Cirebon merupakan salah satu wilayah potensial usaha perikanan di propinsi Jawa Barat. Berdasarkan data perkembangan produksi perikanan tahun 2007, kabupaten cirebon menghasilkan produksi perikanan sebanyak 55.708 ton. Namun pada tahun 2008 nilai tersebut menurun menjadi 52.342,40 ton atau turun 6,04 %.(Dinas Kelautan dan Perikanan 2008 : 35). Penurunan hasil produksi ini disebabkan berbagai faktor diantaranya adalah kurangnya pemanfaatan wilayah potensi yang ada, minimnya informasi, terbatasnya pemanfaatan teknologi dibidang perikanan dan lain sebagainya. Minimnya informasi tentang sumberdaya perikanan menyebabkan kurang optimumnya pemanfaatan sumberdaya perikanan yang ada, sehingga diperlukan adanya pemanfaatan teknologi informasi seperti pengembangan sistem informasi spasial potensi perikanan Kabupaten Cirebon. Sistem informasi ini menampilkan lokasi potensi perikanan misalnya lokasi tambak, Pangkalan Pendaratan Ikan dan Tempat Pengolahan Hasil Perikanan dan disajikan dalam bentuk spasial dan disajikan dalam berbasis web, hal ini akan menjadi kemudahan dalam penggunaannya, Serta kelengkapan data yang disajikan dapat dijadikan sumber acuan bagi pemerintah daerah dalam rangka meningkatkan potensi sektor perikanan yang ada. Dengan sistem ini diharapkan mampu memberikan alternatif solusi bagi Dinas Kelautan dan Perikanan kabupaten Cirebon …", "num_citations": "4\n", "authors": ["1979"]}
{"title": "Cost-Benefits, NPV, IRR and QoS Analysis of the Dynamic Telecytology System in Indonesia\n", "abstract": " The need of pathologist to analyze tissue samples from remote, constrained by the high initial cost of the initial investment both hardware and software. Therefore researchers are trying to analysis the cost-benefit and QoS of the dynamic Telecytology system in Indonesia. The researchers have built the Telecytology systems with hardware and software, that are as an initial cost of the system. The observer needs an internet connection to connect to the dynamic Telecytology system. This telecommunication cost is as operational cost. There is 3 (three) dynamic Telecytology system to be implemented and compared, first, using the Raspberry Pi, second, using Android smartphones and third, using the iPhone. Then, the systems were compared with the commercial product, such as Skype System. This study tries to prove that the systems are quite affordable in terms of cost-benefit and try to analyze QoS of the systems …", "num_citations": "3\n", "authors": ["1979"]}
{"title": "IMPLEMENTATION OF PHYSICS SIMULATION IN SERIOUS GAME\n", "abstract": " Three dimension computer graphics has become important to present virtual objects to be more realistic and physically correct. One way to enhancing realism is by representing the physics simulation. We tried to implement physics simulation into a serious game. It is because of ability to increase realism in synthesis on virtual object motion. We design a serious game called “Traffic Drive”. Traffic Drive is a vehicle simulation game that has a goal to drive a vehicle, especially cars, with emphasis on safety and presented in a fun way. In physics simulation and game that are vehicle's physics a physics of gear and physics of rollover. It was expected that physics simulation can make the behavior of vehicles in the game resembles the behavior of the vehicle in terms of more realistics. And it is used as the object of research to compare the results of the data simulation with data from manual calculations. Comparison of …", "num_citations": "3\n", "authors": ["1979"]}
{"title": "Applying Merging Convetional Marker and Backpropagation Neural Network in QR Code Augmented Reality Tracking\n", "abstract": " Usability of QR Code in Augmented Reality system has been used for digital content accessible publicly. However, QR Code in AR system still has imprecision tracking. In this article we propose merging QR Code within conventional marker and backpropagation neural network (BPNN) algorithm to recognizing QR Code Finder Pattern. The method which our chosen to approaching conventional marker. The result of BPNN testing, QRFP detected in perspective distortion with ID-encoded character length 78, 53 and 32. The result has accuracy of 6DOF±10.65 º pitching,±15.03 yawing and±408.07 surging, marker stability has 97.625% and computation time runs at 35.41 fps.", "num_citations": "3\n", "authors": ["1979"]}
{"title": "Preliminary Research on E-Government Development Overview: An Assessment on e-Government Capabilities in Indonesia\n", "abstract": " E-Government implementation is growing widely follows dramatic enhancement in Information Technology exploitation. It also fosters on transferring information exchanges among the people who need a kind of services including advantages or benefits can be fully used and utilized. In other word, e-Government is an infrastructure applied to serve and to ease citizens or people in accessing related needs which have usually been provided by a government and become a mutual bridge in sharing information such as policies, regulations, acts and a medium place for both public and private institutions to do businesses. This paper tries to find the importance on figuring out, reviewing and assessing the e-Government performance by performing a current existing case study on e-procurement implementation in Indonesia.", "num_citations": "3\n", "authors": ["1979"]}
{"title": "WatsaQ: Repository of Al Hadith in Bahasa (Case Study: Hadith Bukhari)\n", "abstract": " The Hadith is one of the two sources of Islamic law after the Qur'an. It is a fact that there are a number of false hadith, recognised by Muslim scholars since the end of the first century of Hijra, and even earlier. In addition to the breadth of false hadith circulating among the public at this time, it is difficult to determine the source of authenticity and distinguish false from genuine. This is due to the configuration of the genuine documents which are revealed in Arabic. To that end, the authors have built a repository collection of hadith al-Bukhari in the Indonesian language. The hadith chosen have secured originality and standardisation has been applied that can assist users in learning the content of the hadith. The authors implemented a repository of translation in Bahasa of Bukhari Hadith using XML schema. To study the repository performance, we use a web presentation using PHP employing brute-force string match …", "num_citations": "2\n", "authors": ["1979"]}
{"title": "Cloud Based Drive Forensic and DDoS Analysis on Seafile as Case Study\n", "abstract": " The rapid development of Internet due to increasing data rates through both broadband cable networks and 4G wireless mobile, make everyone easily connected to the internet. Storages as Services (StaaS) is more popular and many users want to store their data in one place so that whenever they need they can easily access anywhere, any place and anytime in the cloud. The use of the service makes it vulnerable to use by someone to commit a crime or can do Denial of Service (DoS) on cloud storage services. The criminals can use the cloud storage services to store, upload and download illegal file or document to the cloud storage. In this study, we try to implement a private cloud storage using Seafile on Raspberry Pi and perform simulations in Local Area Network and Wi-Fi environment to analyze forensically to discover or open a criminal act can be traced and proved forensically. Also, we can identify …", "num_citations": "2\n", "authors": ["1979"]}
{"title": "Comparison  of  methods  for  localizing  the  source  position  of deauthentication  attacks  on  WAP  802.11n  using  Chanalyzer and Wi-Spy 2.4x\n", "abstract": " This paper descnbes a comparison of three methods used to locate the position of the source of deauthentication attacks on Wi-Fi using Chanalyzer, and Wi-Spy 2.4x adapter. The three methods are wardriving, absorption and trilateration. The position of constant deauthentication attacks is more easily analyzed compared to that of random attacks. Signal propagation may provide a comparison between signal strength and distance which makes the position of attackers more easily located. The results are shown on the chart patterns generated from the Received Signal Strength Indicator (RSS). And it is proven that these three methods can be used to localize the position of attackers, and can be recommended for use in the environment of organizations using Wi-Fi.", "num_citations": "2\n", "authors": ["1979"]}
{"title": "Analysis of Interference from Wireless Traffic Light Controller upon Remote Keyless Entry for Vehicles\n", "abstract": " This paper aims to analyze the interference between wireless traffic light controller and remote keyless entry for vehicles. Both systems are located closely to each other at the frequency 433-434 MHz. During the analysis, broadcast variant time delay on wireless traffic light versus distances between and RKE determined to ensure their interference. The interference impact is evaluated in a scenario where the wireless traffic light and RKE for vehicles operate on frequency 434 MHz and 433.9 MHz respectively. Three time delays 0 s, 0.2 s and 0.5 s were considered during the simulations. The results show that time delay 0 s and 0.2 s cause a very high probability of interference. Whereas time delay setting of 0.5 s provide probability of interference about 2 % at distance 5 m.", "num_citations": "2\n", "authors": ["1979"]}
{"title": "Analysis Provisioning Process in SIM Card Activation at Telecommunication Operator Using BPM and Balance Scorecard\n", "abstract": " In telecommunication, provisioning is the process of preparing and equipping a network to allow it to provide (new) services to its users, which the functionality and the most important concepts of business process in SIM Card provisioning is a process to activate the SIM Card network and services before it is used by customers. This research is about to analyze the provisioning process between the manual process and the automation process. The important element to measure the management process is performance evaluation. Measuring and managing performance constitutes a difficult task in any kind of organization, but the clearly defined of business process, goals and stakeholders can guide to a better company policy for company improvement in the future. This study contributes to the literature of business process in provisioning, business process management and balanced scorecard of an organization.", "num_citations": "2\n", "authors": ["1979"]}
{"title": "Forensic Audit Using Process Mining to Detect Fraud\n", "abstract": " Companies have been involved in scandals relating to financial fraud which present a large financial loss to their stakeholders. As high technology devices and online systems makes accounting transactions more complicated and easier to manipulate, process mining techniques to detecting fraud are under intense scrutiny by forensic auditors. The author analyses data of a Dutch Financial institute proposed by the Business Process Intelligence Challenge (BPIC) 2017, the BPIC provides a real life event logs. The process consists of 193849 events and 42995 cases. Various tools such as ProM (Process Mining) are been used for data analysis. The author choose process mining over other techniques because the data is recorded independently from the auditee, it an automated solution, less prone to human error, and less time consuming.", "num_citations": "1\n", "authors": ["1979"]}
{"title": "Comparative Analysis Of Business Process Litigation Using Queue Theory And Simulation (Case Study:Religious Courts Of South Jakarta)\n", "abstract": " Religious Courts of South Jakartais responsible for managing the filing of cases. However, the submission process uses manual and semi-automated systems that cause some problems, such as difficulties when requiring the exchange and accessing information between units in real-time. With regard to this problem, the performance of the system needs to be analyzed. In order to find the optimal modeling process in Religious Courts of South Jakarta with queuing and simulation theory. To build and manage the simulation model according to the proposed approach, the simulation system is designed, developed and tested in several scenarios, based on Business Process Model and Notation (BPMN) standards. The result of the research shows that the proof of the initial hypothesis. Where the difference between the two methods is due to the small amount of data used and the short duration. Overall, optimal …", "num_citations": "1\n", "authors": ["1979"]}
{"title": "Techno Economic Approach of Spectrum Sharing between Radar Bands and LTE Cellular System\n", "abstract": " Spectrum sharing using licensed shared access is one method of spectrum usage to be more optimal and efficient. In this paper we propose techno economic approach to know investment value and economic feasibility of using spectrum sharing at radar 2700-2900MHz band. Coverage area of spectrum sharing decided about 15km outside radar coverage at Soekarno Hatta international airport. By spectrum sharing, the number of site can decreased 25% maximum from total number which must be build. Economic analysis used three indicators i.e. Net Present Value (NPV), Incremental Rate of Return (IRR) and payback period used. From analysis result NPV more than zero, an IRR more than interest rate of Bank Indonesia.", "num_citations": "1\n", "authors": ["1979"]}
{"title": "A preliminary study: Implementation and QoS analysis of dynamic telecytology system on broadband and 3G/4G network in Indonesia\n", "abstract": " Nowadays major interest in the field of Dynamic Telecytology is growing rapidly. The need of the pathologist to analyze the specimens remotely both hardware and software[1][2]. Therefore, authors are trying to do a study to examine the Quality of Service (QoS) feasibility of the Telecytology system using Wireshark, Essential NetTools and Ping Plotter. This research was conducted in Greater Jakarta, Indonesia. There are 2 (two) systems that will be examined for this research. The first system is the Raspberry Pi 2 and WebCam. The second system is the Android smartphone and Universal Microscope Adapter. The purpose of this study is to prove that the Telecytology system can be implemented by displaying images captured by a microscope and displayed at a remote location with an image resolution, frame rate, delay, latency, jitter, throughput and Mean Opinion Score (MOS) are desired and with the expectations …", "num_citations": "1\n", "authors": ["1979"]}
{"title": "NETWORK FORENSIC INVESTIGASI PADA STEGANOGRAFI\n", "abstract": " Seiring dengan semakin berkembangnya teknologi semakin bermunculan aplikasi– aplikasi yang memudahkan dalam melakukan aktivitas. Dengan bermunsulannya Social Media seperti Messenger, setiap orang tidak perlu bertatap muka untuk menyampaikan sesuatu. Hal ini berbanding lurus dengan semakin mudahnya bagi orang yang berniat jahat untuk melakukan aksinya. Tidak perlu bertemu langsung untuk merencanakan sesuatu, mereka dapat dengan mudah bertukar informasi melalu Messenger atau aplikasi lainnya. Dengan didukung dengan teknik kriptografi yaitu teknik untuk menyembunyikan pesan dalam suatu file seperti teks, foto dan lainnya, bahkan sekarang kriptografi sudah berkembang dan muncul steganografi yaitu teknik menyemunyikan pesan dalam file berupa video atau audio, yang dapat memudahkan bagi pelaku kejahatan untuk berkomunikasi tanpa diketahui orang lain.", "num_citations": "1\n", "authors": ["1979"]}
{"title": "ANALISIS KINERJA ISCSI TARGET PADA WIRELESS LAN MEMAKAI STANDAR LIO\n", "abstract": " Semakin banyaknya kebutuhan data center maupun laboratorium komputer di Indonesia dipengaruhi oleh semakin banyaknya pengguna yang memanfaatkan komputer baik untuk bisnis maupun pendidikan. Salah satu kebutuhan utama yang tidak bisa dilepaskan dari pemakaian komputer adalah tempat penyimpanan baik berupa USB Flash Disk, HD Eksternal, HD Internal sampai HD untuk kebutuhan skala besar untuk komputer server yang berada di data center, laboratorium atau jaringan komputer. Ruang penyimpanan data atau data storage semakin berkembang dengan munculnya teknologi komputer jaringan yang memunculkan alternatif data storage berupa DAS, NAS, FC, FcoE dan iSCSI. iSCSI menggunakan standard TCP/IP protocol over Ethernet untuk menyediakan penyimpanan berbasis block. Saat ini ada 2 jenis multiprotocol SCSI Target utama di industri yaitu LIO dan COMSTAR yang menggantikan teknologi sebelumnya yaitu iET, SCST dan STGT. LIO (linux-iscsi. org) merupakan standard open source iSCSI Target untuk berbagi ruang penyimpanan di Linux. LIO mendukung storage fabrics, yaitu Fibre Channel (QLogic), FCoE, iEEE 1394, iSCSI, iSER (Mellanox InfiniBand), SRP (Mellanox InfiniBand), USB, vHost, dan lain-lain.", "num_citations": "1\n", "authors": ["1979"]}
{"title": "Perencanaan information technology service management ITSM menggunakan ISO 20000 pada Universitas Terbuka\n", "abstract": " ABSTRAK AZIZ MAULIAWATI, Perencanaan Information Technology Service Management (ITSM) Menggunakan ISO 20000 Pada Universitas Terbuka.. (Dibawah Bimbingan Rizal Bahawerez dan Nur Aeni Hidayah) Berdasarkan Keputusan Menteri Negara Pendayagunaan Aparatur Negara NomorKep/26/M.PAN/2/2009 mengenai peningkatan kualitas dan menjamin penyedia pelayanan publik dalam penyelenggaraan pelayanan. Universitas Terbuka (UT) merupakan satu-satunya perguruan tinggi negeri di Indonesia yang menerapkan sistem belajar jarak jauh dalam mengelola program pendidikannya. Dalam sistem belajar di Universitas Terbuka, belajar mandiri merupakan factor utama. Masalah ketersediaan bahan ajar merupakan faktor yang paling penting. Saat ini unit yang bertanggung jawab dalam melaksanakan manajemen SI/TI adalah Pusat Komputer (Puskom), Puskom inilah yang bertanggung jawab menyediakan layanan kepada seluruh unit / bagian dilingkungan UT. Dimana dalam pelayanan yang diberikan terdapat beberapa hal yang menjadi kendala sebelum upaya pencapaian penerapan standar service management diterapkan, yaitu diantaranya Tidak dapat menjalankan / mengelola TI dengan baik, kurangnya kepercayaan dari stakeholder, kurangnya control sehingga banyak resiko yang terjadi dan tidak adanya service level management yang jelas sehingga pelayanan yang diberikan oleh Puskom tidak ada indicator. Maka penulis mencoba untuk memberikan alternative pemecahan permasalahan dengan membuat penelitian terhadap layanan TI (IT Service Management). Oleh karena itu, pada penelitian terhadap …", "num_citations": "1\n", "authors": ["1979"]}