{"title": "Method and apparatus for enabling digital rights management in file transfers\n", "abstract": " Embodiments of the invention generally provide a method and apparatus for enabling digital rights management in file transfers. One embodiment of a method for transferring digital content from a first user to a second user, includes transferring ownership of an instance of the digital content to the second user, where the instance of the digital content resides on a first device belonging to the first user. Copies of the digital content are then deleted from one or more additional devices belonging to the first user (including at least one offline device).", "num_citations": "70\n", "authors": ["390"]}
{"title": "Watch their moves: Applying probabilistic multiple object tracking to autonomous robot soccer\n", "abstract": " In many autonomous robot applications robots must be capable of estimating the positions and motions of moving objects in their environments. In this paper, we apply probabilistic multiple object tracking to estimating the positions of opponent players in autonomous robot soccer. We extend an existing tracking algorithm to handle multiple mobile sensors with uncertain positions, discuss the specification of probabilistic models needed by the algorithm, and describe the required vision-interpretation algorithms. The multiple object tracking has been successfully applied throughout the RoboCup 2001 world championship.", "num_citations": "50\n", "authors": ["390"]}
{"title": "An Insider's View of CMM(R) Level 5\n", "abstract": " Many organizations in the software industry have adopted the Software Engineering Institute's Capability Maturity Model (CMM). However, only recently have enough organizations reached Level 5 to enable a coherent discussion of Level 5 issues. To facilitate such a discussion, the editors of Quality Time solicited questions about what it means to be a Level 5 organization from academic, industry, and government representatives.", "num_citations": "25\n", "authors": ["390"]}
{"title": "System providing sponsored content\n", "abstract": " A system receives an indication of selection of an item in a broadcast segment from an end device. A broadcast segment is identified by the selection and a broadcast segment schedule. An item ID is determined using the identified broadcast segment and the broadcast segment schedule, and a corresponding sponsor of the item is determined using the item ID and the identified broadcast segment. An anonymized message, including the item ID and a request for information, is sent to the corresponding sponsor. A reply is received from the corresponding sponsor, and forwarded to an end user contact.", "num_citations": "13\n", "authors": ["390"]}
{"title": "Software and development process quality metrics\n", "abstract": " This paper describes a framework for gathering and reporting software and development process quality metrics, as well as data engineering issues related to data collection and report generation. The framework is described in project-independent terms, including a methodology for applying metrics to a given software project. A key aspect of this application is the use of project milestones predicted by a failure rate model. For the purposes of this paper, a software project is one which delivers a software or system product, and involves between thirty and several hundred developers, testers, and project managers.", "num_citations": "3\n", "authors": ["390"]}
{"title": "How Can Software Reliability Engineering (SRE) Help System Engineers and SofWare Architects?\n", "abstract": " This panel session will discuss how Systems Engineers and Softwore ilrchitects can benejit jPom using,,'RE. Members of the panel will discuss how their respective organizations use (or anticipate using) SRE earlier in the software development life-cycle. The intent is to stimulate and encourage those involved in Systems Engineering and Sofiare-4rchitecture to adopt and use SRE in their work.A lot of attention has bcen shown to testcrs during the past several ISSRE's. Most papers at recent ISSRE's have focussed on applqing Soaware Reliability Engineering (SE) to testing. However, there are a number of ways system engneers (those who identlfl requirements for software) and software architects (those who develop high level designs for software) can benefit from SRE. Some of these ways have already been applied, while others appear very promising but need detailed application across a variety of systems …", "num_citations": "1\n", "authors": ["390"]}