{"title": "On damage diagnosis for a wind turbine blade using pattern recognition\n", "abstract": " With the increased interest in implementation of wind turbine power plants in remote areas, structural health monitoring (SHM) will be one of the key cards in the efficient establishment of wind turbines in the energy arena. Detection of blade damage at an early stage is a critical problem, as blade failure can lead to a catastrophic outcome for the entire wind turbine system. Experimental measurements from vibration analysis were extracted from a 9 m CX-100 blade by researchers at Los Alamos National Laboratory (LANL) throughout a full-scale fatigue test conducted at the National Renewable Energy Laboratory (NREL) and National Wind Technology Center (NWTC). The blade was harmonically excited at its first natural frequency using a Universal Resonant EXcitation (UREX) system. In the current study, machine learning algorithms based on Artificial Neural Networks (ANNs), including an Auto-Associative …", "num_citations": "136\n", "authors": ["1407"]}
{"title": "The use of pseudo-faults for novelty detection in SHM\n", "abstract": " The main problem associated with pattern recognition based approaches to Structural Health Monitoring (SHM) is that damage localisation and quantification almost always require supervised learning. In the case of high-value engineering structures like aircraft, it is simply not possible to generate the training data associated with damage by experiment. It is also unlikely that data can always be generated by simulation as the models required would often need to be of such high fidelity that the costs of development and the run-times would again be prohibitive. The object of this paper is to explore the potential of a simple experimental strategy, which involves adding masses to the structure, in the attempt to extract features for novelty detection. The idea itself is not presented as revolutionary based on the fact that adding masses has been considered as a case of damage before, however, an in-depth investigation of …", "num_citations": "59\n", "authors": ["1407"]}
{"title": "On model-and data-based approaches to structural health monitoring\n", "abstract": " Structural Heath Monitoring (SHM) is the term applied to the process of periodically monitoring the state of a structural system with the aim of diagnosing damage in the structure. Over the course of the past several decades there has been ongoing interest in approaches to the problem of SHM. This attention has been sustained by the belief that SHM will allow substantial economic and life-safety benefits to be realised across a wide range of applications. Several numerical and laboratory implementations have been successfully demonstrated. However, despite this research effort, real-world applications of SHM as originally envisaged are somewhat rare. Numerous technical barriers to the broader application of SHM methods have been identified, namely: severe restrictions on the availability of damaged-state data in real-world scenarios; difficulties associated with the numerical modelling of physical systems; and limited understanding of the physical effect of system inputs (including environmental and operational loads). This thesis focuses on the roles of law-based and data-based modelling in current applications of. First, established approaches to model-based SHM are introduced, with the aid of an exemplar ‘wingbox’ structure. The study highlights the degree of difficulty associated with applying model-updating-based methods and with producing numerical models capable of accurately predicting changes in structural response due to damage. These difficulties motivate the investigation of non-deterministic, predictive modelling of structural responses taking into account both experimental and modelling uncertainties. Secondly, a data …", "num_citations": "52\n", "authors": ["1407"]}
{"title": "Robust methods of inclusive outlier analysis for structural health monitoring\n", "abstract": " The key novel element of this work is the introduction of robust multivariate statistical methods into the structural health monitoring (SHM) field through use of the minimum covariance determinant estimator (MCD) and the minimum volume enclosing ellipsoid (MVEE). In this paper, robust outlier statistics are investigated, focussed mainly on a high level estimation of the “masking effect” of inclusive outliers, not only for determining the presence or absence of novelty-something that is of fundamental interest but also to examine the normal condition set under the suspicion that it may already include multiple abnormalities. By identifying and detecting variability at an early stage, the prospects of achieving good generalisation and establishing a correct normal condition classifier may be increased. It is critical to highlight that there is no a priori division between the damaged and the undamaged condition data when the …", "num_citations": "46\n", "authors": ["1407"]}
{"title": "On evolutionary system identification with applications to nonlinear benchmarks\n", "abstract": " This paper presents a record of the participation of the authors in a workshop on nonlinear system identification held in 2016. It provides a summary of a keynote lecture by one of the authors and also gives an account of how the authors developed identification strategies and methods for a number of benchmark nonlinear systems presented as challenges, before and during the workshop. It is argued here that more general frameworks are now emerging for nonlinear system identification, which are capable of addressing substantial ranges of problems. One of these frameworks is based on evolutionary optimisation (EO); it is a framework developed by the authors in previous papers and extended here. As one might expect from the ‘no-free-lunch’ theorem for optimisation, the methodology is not particularly sensitive to the particular (EO) algorithm used, and a number of different variants are presented in this paper …", "num_citations": "38\n", "authors": ["1407"]}
{"title": "Sensor placement optimization\n", "abstract": " Structural health monitoring (SHM) systems depend critically on using the correct number of sensors and on positioning them appropriately on the structure. A rigorous approach to this problem requires an optimization methodology as described in this article. The article begins with a definition of the problem and provides a literature review covering relevant methodologies. The basic theories of the main approaches are then discussed in more detail. Finally, the article provides an illustrative case study of a combinatorial optimization method based on the problem of impact location on a composite panel.", "num_citations": "33\n", "authors": ["1407"]}
{"title": "The use of pseudo-faults for damage location in SHM: An experimental investigation on a Piper Tomahawk aircraft wing\n", "abstract": " The application of pattern recognition-based approaches in damage localisation and quantification will eventually require the use of some kind of supervised learning algorithm. The use, and most importantly, the success of such algorithms will depend critically on the availability of data from all possible damage states for training. It is perhaps well known that the availability of damage data through destructive means cannot generally be afforded in the case of high value engineering structures outside laboratory conditions. This paper presents the attempt to use added masses in order to identify features suitable for training supervised learning algorithms and then to test the trained classifiers with damage data, with the ultimate purpose of damage localisation. In order to test the approach of adding masses, two separate cases of a dual-class classification problem, representing two distinct locations, and a three-class …", "num_citations": "29\n", "authors": ["1407"]}
{"title": "Identification of hysteretic systems using NARX models, Part I: evolutionary identification\n", "abstract": " Although there has been considerable work on the identification of hysteretic systems over the years, there has been comparatively little using discrete NARX or NARMAX models. One of the reasons for this may be that many of the common continuous-time models for hysteresis, like the Bouc-Wen model are nonlinear in the parameters and incorporate unmeasured states, and this makes a direct analytical discretisation somewhat opaque. Because NARX models are universal in the sense that they can model any input–output process, they can be applied directly without consideration of the hysteretic nature; however, if the polynomial form of NARX were to be used for a Bouc-Wen system, the result would be input-dependent because of the non-polynomial (indeed discontinuous) nature of the original model. The objective of the current paper is to investigate the use of NARX models for Bouc-Wen systems …", "num_citations": "17\n", "authors": ["1407"]}
{"title": "Aircraft parametric structural load monitoring using gaussian process regression\n", "abstract": " The work presented here demonstrates the capability of Gaussian Process (GP) regression for the prediction of aircraft structural loads based on recorded flight parameters. The objective of monitoring aircraft loads during operation is to develop a better understanding of aircraft usage and thus to provide the operator with an accurate estimate of the remaining useful life of components against their prescribed fatigue life. These loads are often difficult and expensive to measure and this motivates the use of advanced mathematical techniques to estimate them accurately based on other parameters that are typically measured during flight. Gaussian Process regression is a powerful Bayesian machine learning tool whereby predictions and their distributions can be obtained without having to specify a particular model/functional form. Data collected from a military trainer aircraft is used to demonstrate how the mapping of measured strains to basic flight parameters such as airspeed, accelerations, and control surface deflections can be performed using GP regression. It is also shown how these results can be applied in an aircraft usage monitoring context. The GP predictions for strain are compared to the actual measurements for 101 flights, and the results are presented in terms of fatigue life, correlation, and mean-squared error. The results are encouraging, with errors in fatigue life in the range of 5% to 30% in the worst cases.", "num_citations": "15\n", "authors": ["1407"]}
{"title": "Novelty detection applied to vibration data from a CX-100 wind turbine blade under fatigue loading\n", "abstract": " The remarkable evolution of new generation wind turbines has led to a dramatic increase of wind turbine blade size. In turn, a reliable structural health monitoring (SHM) system will be a key factor for the successful implementation of such systems. Detection of damage at an early stage is a crucial issue as blade failure would be a catastrophic result for the entire wind turbine. In this study the SHM analysis will be based on experimental measurements of Frequency Response Functions (FRFs) extracted by using an input/output acquisition technique under a fatigue loading of a 9m CX-100 blade at the National Renewable Energy Laboratory (NREL) and National Wind Technology Center (NWTC) performed in the Los Alamos National Laboratory. The blade was harmonically excited at its first natural frequency using a Universal Resonant Excitation (UREX) system. For analysis, the Auto-Associative Neural Network …", "num_citations": "15\n", "authors": ["1407"]}
{"title": "Vibration-based structural health monitoring using large sensor networks\n", "abstract": " Recent advances in hardware and instrumentation technology have allowed the possibility of deploying very large sensor arrays on structures. Exploiting the huge amount of data that can result in order to perform vibration-based structural health monitoring (SHM) is not a trivial task and requires research into a number of specific problems. In terms of pressing problems of interest, this paper discusses: the design and optimisation of appropriate sensor networks, efficient data reduction techniques, efficient and automated feature extraction methods, reliable methods to deal with environmental and operational variability, efficient training of machine learning techniques and multi-scale approaches for dealing with very local damage. The paper is a result of the ESF-S3T Eurocores project “Smart Sensing For Structural Health Monitoring”(S3HM) in which a consortium of academic partners from across Europe are attempting to address issues in the design of automated vibration-based SHM systems for structures.", "num_citations": "13\n", "authors": ["1407"]}
{"title": "Advanced feature selection for simplified pattern recognition within the damage identification framework\n", "abstract": " The paper is concerned with adopting a data-driven approach to damage detection and location on an aerospace structure without recourse to an artificial neural network. Five advanced features are selected, each detecting the removal of only one of five inspection panels on the structure. The features give perfect classification for damage location for single-site damage and 98.1% correct classification for multi-site damage scenarios, using a statistically calculated threshold. However, if the threshold values for two of the five features are altered slightly, 100% correct classification would be possible for single-and multi-site damage.", "num_citations": "12\n", "authors": ["1407"]}
{"title": "An experimental investigation of feature complexity and diversity in nominally similar test structures\n", "abstract": " It is perhaps well known that the uncertainty in realistic structures may complicate most efforts for modelling. Even seemingly identical structures may display enough diversity that the accurate modelling of one system will be rendered inadequate or of limited use for another similar structure, especially under specific conditions or in certain applications. This paper presents a preliminary attempt to explore and identify the complexity and the diversity of the different features which are present in seemingly identical or nominally similar structures. The main features examined here are natural frequencies and mode shapes which could be used alone or in combination with other features for the identification of different states of a structure. Two nominally identical structures, created by the separation of a full scale tail wing into two halves, are first tested. A third structure of similar shape, but of greater length and weight is also tested and compared with the other two. The overall comparison shows a good potential for the identification of common patterns to be used for SHM among populations of structures.", "num_citations": "11\n", "authors": ["1407"]}
{"title": "Damage detection in carbon composite material typical of wind turbine blades using auto-associative neural networks\n", "abstract": " The structure of a wind turbine blade plays a vital role in the mechanical and structural operation of the turbine. As new generations of offshore wind turbines are trying to achieve a leading role in the energy market, key challenges such as a reliable Structural Health Monitoring (SHM) of the blades is significant for the economic and structural efficiency of the wind energy. Fault diagnosis of wind turbine blades is a \"grand challenge\" due to their composite nature, weight and length. The damage detection procedure involves additional difficulties focused on aerodynamic loads, environmental conditions and gravitational loads. It will be shown that vibration dynamic response data combined with AANNs is a robust and powerful tool, offering on-line and real time damage prediction. In this study the features used for SHM are Frequency Response Functions (FRFs) acquired via experimental methods based on an LMS …", "num_citations": "10\n", "authors": ["1407"]}
{"title": "On multi-site damage identification using single-site training data\n", "abstract": " This paper proposes a methodology for developing multi-site damage location systems for engineering structures that can be trained using single-site damaged state data only. The methodology involves training a sequence of binary classifiers based upon single-site damage data and combining the developed classifiers into a robust multi-class damage locator. In this way, the multi-site damage identification problem may be decomposed into a sequence of binary decisions. In this paper Support Vector Classifiers are adopted as the means of making these binary decisions. The proposed methodology represents an advancement on the state of the art in the field of multi-site damage identification which require either: (1) full damaged state data from single- and multi-site damage cases or (2) the development of a physics-based model to make multi-site model predictions. The potential benefit of the proposed …", "num_citations": "9\n", "authors": ["1407"]}
{"title": "Robust methods for outlier detection and regression for SHM applications\n", "abstract": " In this paper, robust statistical methods are presented for the data-based approach to structural health monitoring (SHM). The discussion initially focuses on the high level removal of the masking effect of inclusive outliers. Multiple outliers commonly occur when novelty detection in the form of unsupervised learning is utilised as a means of damage diagnosis; then benign variations in the operating or environmental conditions of the structure must be handled very carefully, as it is possible that they can lead to false alarms. It is shown that recent developments in the field of robust regression can provide a means of exploring and visualising SHM data as a tool for exploring the different characteristics of outliers, and removing the effects of benign variations. The paper is not, in any sense, a survey; it is an overview and summary of recent work by the authors.", "num_citations": "9\n", "authors": ["1407"]}
{"title": "Machine learning applications for a wind turbine blade under continuous fatigue loading\n", "abstract": " Structural health monitoring (SHM) systems will be one of the leading factors in the successful establishment of wind turbines in the energy arena. Detection of damage at an early stage is a vital issue as blade failure would be a catastrophic result for the entire wind turbine. In this study the SHM analysis will be based on experimental measurements of vibration analysis, extracted of a 9m CX-100 blade under fatigue loading. For analysis, machine learning techniques utilised for failure detection of wind turbine blades will be applied, like non-linear Neural Networks, including Auto-Associative Neural Network (AANN) and Radial Basis Function (RBF) networks models.", "num_citations": "9\n", "authors": ["1407"]}
{"title": "Emerging trends in optimal structural health monitoring system design: From sensor placement to system evaluation\n", "abstract": " This paper presents a review of advances in the field of Sensor Placement Optimisation (SPO) strategies for Structural Health Monitoring (SHM). This task has received a great deal of attention in the research literature, from initial foundations in the control engineering literature to adoption in a modal or system identification context in the structural dynamics community. Recent years have seen an increasing focus on methods that are specific to damage identification, with the maximisation of correct classification outcomes being prioritised. The objectives of this article are to present the SPO for SHM problem, to provide an overview of the current state of the art in this area, and to identify promising emergent trends within the literature. The key conclusions drawn are that there remains a great deal of scope for research in a number of key areas, including the development of methods that promote robustness to modelling uncertainty, benign effects within measured data, and failures within the sensor network. There also remains a paucity of studies that demonstrate practical, experimental evaluation of developed SHM system designs. Finally, it is argued that the pursuit of novel or highly efficient optimisation methods may be considered to be of secondary importance in an SPO context, given that the optimisation effort is expended at the design stage. View Full-Text", "num_citations": "8\n", "authors": ["1407"]}
{"title": "A probabilistic risk-based decision framework for structural health monitoring\n", "abstract": " Obtaining the ability to make informed decisions regarding the operation and maintenance of structures, provides a major incentive for the implementation of structural health monitoring (SHM) systems. Probabilistic risk assessment (PRA) is an established methodology that allows engineers to make risk-informed decisions regarding the design and operation of safety-critical and high-value assets in industries such as nuclear and aerospace. The current paper aims to formulate a risk-based decision framework for structural health monitoring that combines elements of PRA with the existing SHM paradigm. As an apt tool for reasoning and decision-making under uncertainty, probabilistic graphical models serve as the foundation of the framework. The framework involves modelling failure modes of structures as Bayesian network representations of fault trees and then assigning costs or utilities to the failure events …", "num_citations": "7\n", "authors": ["1407"]}
{"title": "Bayesian system identification of dynamical systems using reversible jump Markov Chain Monte Carlo\n", "abstract": " The purpose of this contribution is to illustrate the potential of Reversible Jump Markov Chain Monte Carlo (RJMCMC) methods for nonlinear system identification. Markov Chain Monte Carlo (MCMC) sampling methods have come to be viewed as a standard tool for tackling the issue of parameter estimation using Bayesian inference. A limitation of standard MCMC approaches is that they are not suited to tackling the issue of model selection. RJMCMC offers a powerful extension to standard MCMC approaches in that it allows parameter estimation and model selection to be addressed simultaneously. This is made possible by the fact that the RJMCMC algorithm is able to “jump” between parameter spaces of varying dimension. In this paper the background theory to the RJMCMC algorithm is introduced. Comparison is made to a standard MCMC approach.", "num_citations": "7\n", "authors": ["1407"]}
{"title": "Identification of hysteretic systems using NARX models, part II: a Bayesian approach\n", "abstract": " Following on from the first part of this short sequence, this paper will investigate the use of a Bayesian methodology for the identification of Bouc-Wen hysteretic systems by NARX models. The approach—based on Markov Chain Monte Carlo—offers a number of advantages over the evolutionary approach of the first paper. Among them are the ability to sample from the probability density functions of the parameters in order to develop nonparametric estimators and the possibility of selecting model terms in a principled manner. The paper will investigate the use of the Deviance Information Criterion (DIC) as a means of selecting model terms, specifically the special basis functions developed for the Bouc-Wen system in Part I. Results for simulated data will be given.", "num_citations": "7\n", "authors": ["1407"]}
{"title": "Classification of multi-site damage using support vector machines\n", "abstract": " Pattern recognition is now well-known to be a powerful approach to addressing the higher levels of damage identification eg location and severity assessment of damage. However, a major problem in implementation for real structures is the need for training data associated with all possible damage states. Even if appropriate data were available for individual damage states, the combinatorial explosion in states which occurs when multiple simultaneous damages are present would usually prohibit a pattern recognition approach. One approach to the solution of this problem is to construct classifiers on the basis of single damage data which will generalise to multiple damage states; the current paper is a very preliminary step in this direction. In the first part, a comprehensive multiple damage feature database is established as the result of an experimental campaign on a full-sized aircraft wing structure; in the second …", "num_citations": "7\n", "authors": ["1407"]}
{"title": "$$$$ modal interactions of a three-degree-of-freedom system with cubic elastic nonlinearities\n", "abstract": " In this paper the  nonlinear modal interactions that occur in a nonlinear three-degree-of-freedom lumped mass system, where , are considered. The nonlinearity comes from springs with weakly nonlinear cubic terms. Here, the case where all the natural frequencies of the underlying linear system are close (i.e. ) is considered. However, due to the symmetries of the system under consideration, only  modes interact. Depending on the sign and magnitude of the nonlinear stiffness parameters, the subsequent responses can be classified using backbone curves that represent the resonances of the underlying undamped, unforced system. These backbone curves, which we estimate analytically, are then related to the forced response of the system around resonance in the frequency domain. The forced responses are computed using the continuation software AUTO-07p. A …", "num_citations": "6\n", "authors": ["1407"]}
{"title": "An experimental investigation of feature availability in nominally identical structures for population-based SHM\n", "abstract": " It is perhaps well known that the uncertainty in realistic structures may complicate most efforts for modelling and damage identification. In a population of structures which are considered identical, as in a wind farm for example, it is very often that the accurate modelling of one structure will be inadequate for the robust monitoring of the rest in an SHM approach. This paper presents an exploration of the common features which can be found in nominally identical structures and which can be used for damage identification with the ultimate purpose of population-based SHM. The concept of a population-based approach means that any additional new structures to the population will not need to be fully modelled in order to be monitored. Two different variants of the tail wing of a Piper PA-28 aircraft are used to create two pairs of nominally identical structures by separating the tail wings in half. The new population …", "num_citations": "6\n", "authors": ["1407"]}
{"title": "Topics in Model Validation and Uncertainty Quantification, Volume 4: Proceedings of the 30th IMAC, A Conference on Structural Dynamics, 2012\n", "abstract": " Topics in Model Validation and Uncertainty Quantification, Volume 4, Proceedings of the 30th IMAC, A Conference and Exposition on Structural Dynamics, 2012, the fourth volume of six from the Conference, brings together 19 contributions to this important area of research and engineering. The collection presents early findings and case studies on fundamental and applied aspects of Structural Dynamics, including papers on: Robustness to Lack of Knowledge in Design Bayesian and Markov Chain Monte Carlo Methods Uncertainty Quantification Model Calibration", "num_citations": "6\n", "authors": ["1407"]}
{"title": "Nonlinear modal interaction analysis for a three degree-of-freedom system with cubic nonlinearities\n", "abstract": " The majority of work in the literature on modal interaction is based on two degree-of-freedom nonlinear systems with cubic nonlinearities. In this paper we consider a three degree-of-freedom system with nonlinear springs containing cubic nonlinear terms. First the undamped, unforced case is considered. Specifically the modal interaction case that occurs when all the underlying linear modal frequencies are close is considered (i.e.  ). In the case considered, due to the symmetry of the system, the first mode is linear and not coupled with the other two modes. The analysis is carried out by using a normal form transformation to obtain the nonlinear backbone curves of the undamped, unforced response. In addition, the frequency response function (FRF) of the corresponding lightly damped and harmonically forced system obtained from the continuation software AUTO-07p is compared with the …", "num_citations": "5\n", "authors": ["1407"]}
{"title": "Towards an ontology for verification and validation in structural dynamics\n", "abstract": " Verification and validation practices attempt to increase the levels of accuracy and confidence in the predictions of numerical simulations. Developing reliable models is contingent on making the best decisions concerning the technologies and methodologies to be adopted for the damage detection scenario examined. In the case of data-based approaches the appropriate choice of damage-sensitive features and classication algorithms is determinant. According to the kind of system examined, ie nonlinear system, system identication methods of different complexity should be chosen. Such kind of choices are arguably an art more than a science and a systematic and principled approach is required. As a means of formalising knowledge, ontologies are widely used in knowledge engineering, semantics and computer science. Their concepts are used in these fields to define the relations comprising the vocabulary of a topic area. The applications in the previously mentioned fields suggest that ontological engineering is a valuable tool towards determining classes (performing classification) and describing the relations existing among them. In this paper, the use of ontology tools will be proposed as a means of creating a framework for knowledge sharing and reusing of the current verification and validation approaches.", "num_citations": "5\n", "authors": ["1407"]}
{"title": "Structural Health Monitoring of composite material typical of wind turbine blades by novelty detection on vibration response\n", "abstract": " New generations of offshore wind turbines are playing a leading role in the energy arena. One of the target challenges is to achieve reliable Structural Health Monitoring (SHM) of the blades. Fault detection at the early stage is a vital issue for the structural and economical success of the large wind turbines. In this study, experimental measurements of Frequency Response Functions (FRFs) are used and identification of mode shapes and natural frequencies is accomplished via an LMS system. Novelty detection is introduced as a robust statistical method for low-level damage detection which has not yet been widely used in SHM of composite blades. Fault diagnosis of wind turbine blades is a challenge due to their composite material, dimensions, aerodynamic nature and environmental conditions. The novelty approach combined with vibration measurements introduces an online condition monitoring method. This …", "num_citations": "5\n", "authors": ["1407"]}
{"title": "Autoregressive Gaussian processes for structural damage detection\n", "abstract": " This paper provides an application of damage detection from nonlinear time series through the use of a Gaussian Process Autoregressive model. Gaussian Processes are powerful nonparametric models that can be used for advanced nonlinear regression. On the other hand, autoregressive models have been examined extensively for fault detection on mechanical systems. However, when a mechanical system behaves nonlinearly in its baseline condition, a linear autoregressive model might not be able to distinguish between a baseline system response and a response from the system with damage. This paper is intended as a brief introduction to both data-driven damage detection and Gaussian Processes, and concludes with an example damage detection application to a simulated signal as well as a short review of Gaussian Processes for time series models.", "num_citations": "4\n", "authors": ["1407"]}
{"title": "A simplified treed gaussian process approach to the modelling of bridge data for structural health monitoring\n", "abstract": " Data-based modelling in the presence of uncertainties is a key challenge for Structure Health Monitoring (SHM) practitioners. In the scenario of applying damage detection methods using time series analysis, many of the approaches are based on Statistical Process Control (SPC). The inherent limitation within a SPC-based method is the restriction to stationary data. However, given the inevitable presence of uncertainties from the environment, stationary data acquisition is not guaranteed. To explore the potential relations behind the data while accommodating the issue of non-stationary behaviour, a Treed Gaussian Process (TGP) can be brought into action. TGP models have been shown to be successful in tackling non-stationary regression problems effectively, and have been adopted and applied across numerous research fields including SHM. However, a key limitation that has been found is the computational …", "num_citations": "3\n", "authors": ["1407"]}
{"title": "Bayesian parameter estimation and model selection of a nonlinear dynamical system using reversible jump Markov chain Monte Carlo\n", "abstract": " The aim of this paper is to demonstrate the potential of the Reversible Jump Markov Chain Monte Carlo (RJMCMC) algorithm when applied to system identification problems which involve both parameter estima- tion and model selection. Within the context of Bayesian Inference, Markov Chain Monte Carlo (MCMC) methods have been used for a long period of time to address the parameter estimation of linear and nonlinear systems, which are described approximately by a model. It is often the case that there are a set of competing model structures that could potentially produce good approximations of the real system - this raises the issue of model selection. Even though they address parameter estimation, many MCMC samplers cannot address model selection. As an extension to one of the most well known MCMC samplers, the Metropolis-Hastings algorithm, the RJMCMC algorithm is a MCMC method that covers model selection as well as parameter estimation simultaneously. RJMCMC can be applied when models contain different numbers of parameters. The algorithm is capable of moving between parameter spaces of different dimension in order to find the most appropriate model that describes the system and the most probable parameters within that model. In this contribution the RJMCMC algorithm is introduced in the context of nonlinear dynamical systems and is demonstrated on simulated data.", "num_citations": "3\n", "authors": ["1407"]}
{"title": "Impact damage detection for composite material typical of wind turbine blades using novelty detection\n", "abstract": " Offshore wind turbines are gaining a leading role in the electric energy market. The wind turbine blade plays a vital role in the lifetime operation of the turbine. Key challenges such as robust Structural Health Monitoring (SHM) of the blades is crucial for the economic and structural efficiency of the new generation of wind energy. In this study intelligent fault diagnosis methods are adopted such as novelty detection techniques. The methods used are a statistical outlier analysis which allows a diagnosis of deviation from normality, an Auto-Associative Neural Network (AANN) and an Artificial Neural Network (ANN) classification technique. Vibration responses combined with a novelty approach provide a robust statistical method for low-level structural damage detection. It will be shown that a neural network is a powerful tool, offering on-line and real time damage prediction and classification. This paper is adopting vibration data such as FRFs by exploiting multilayer neural networks and outlier detection. The outcomes of these approaches are demonstrated for a blade composite structure subject to gradually increased levels of impact damage.", "num_citations": "3\n", "authors": ["1407"]}
{"title": "Damage location using added masses in Piper Tomahawk aircraft wing\n", "abstract": " Pattern recognition (PR) has been successfully applied to many structural health monitoring (SHM) projects and has led to the development of robust and reliable damage identification algorithms. However, the attempt to locate or assess damage in structures with the help of any supervised learning algorithms, commonly used in PR approaches, will inevitably demand data from all possible damage states. The use of such data could become prohibitively expensive in the case of high-value engineering structures, especially if destructive means of fault induction into the structures are followed. In the current paper the very simple approach of adding masses on a structure as a means of simulating damage is applied on a full-scale aircraft wing with the ultimate purpose of damage location. Artificial neural networks are used as classifiers in order to locate the added masses and then the methodology is tested on realistic damage cases in the form of saw-cuts.", "num_citations": "3\n", "authors": ["1407"]}
{"title": "On Treed Gaussian Processes and piecewise-linear NARX modelling\n", "abstract": " In the scope of nonlinear system identification, traditional parametric models are widely adopted as simplifying approaches to modelling the complexity of nonlinearity. However, many high-order parametric models are disadvantaged due to their inherent demand for model detection and their tendency to overfit in the absence of additional validation processes. Nonparametric models, such as the Gaussian Process (GP), though being naturally exempt from model detection, can involve expensive procedures of model optimisation. This article presents a Linear Kernel Chipman-based Treed Gaussian Processes (LK-CTGP), which is essentially an assembly of simple linear parametric models using a decision tree framework, to model nonlinear systems. The piecewise-linear structure of the LK-CTGP offers a natural geometric solution to modelling nonlinear systems, where no model detection is required. The essence …", "num_citations": "2\n", "authors": ["1407"]}
{"title": "Structural health monitoring: a review of uncertainty quantification methods in wind turbine systems\n", "abstract": " Wind energy has been in the forefront of renewable energy sources and is expected to show continuous expansion in the future. Nevertheless, there is a considerable demand for the development of new technologies as the turbines get more complicated, bigger and requirements for design, operation and maintenance become stricter. Uncertainty quantification (UQ) can contribute to further technology development, it is important to analyse both data and model results to understand limitation of current modelling, data variability and take informed decisions because uncertainties are present in all domains of wind turbine design, modelling, manufacturing and maintenance. To have adequate UQ, it is important to consider the sources of the uncertainty, which can generally be either aleatory or epistemic. Composite material with complicated microstructures have become crucial to wind turbine systems and so have …", "num_citations": "2\n", "authors": ["1407"]}
{"title": "Cascaded Tanks Benchmark: Parametric and Nonparametric Identification\n", "abstract": " Cascaded tanks or liquid level systems have a long history as benchmark systems for system identification. The benchmark considered in this paper is a two-tank system which presents a number of challenges for identification:", "num_citations": "2\n", "authors": ["1407"]}
{"title": "An approach to fault detection using a unified linear gaussian framework\n", "abstract": " Presented in this paper is an approach to fault diagnosis based on a unifying review of linear Gaussian models. The unifying review draws together different algorithms such as PCA, factor analysis, hidden Markov models, Gaussian mixture models and linear dynamical systems as simple variations of a single linear Gaussian model. The focus in this work is on PCA, factor analysis and linear dynamical systems in order to compare static and dynamic data models. One of the advantages of using a unified framework for these already well known models is the quantification of uncertainty, and the ability to evaluate the probability of a dataset given a model. To highlight the applicability of such an approach to a fault diagnosis application and to establish in some way its robustness to environmental variability, a set of data collected from the suspension system of a ground vehicle is used.", "num_citations": "2\n", "authors": ["1407"]}
{"title": "Comparative study of robust novelty detection techniques\n", "abstract": " The central target of this work is to provide an alternative to machine learning approaches to structural health monitoring with one of robust multivariate statistic novelty detection. Damage detection and identification is a procedure that is hierarchical in nature. At its most sophisticated, diagnosis of the damage could include localisation, classification and severity assessment and even go so far as to estimate the time-to-failure of the structure. In this paper, robust multivariate statistics were investigated focused mainly on a high level estimation of the outliers which determines only the presence or absence of novelty-something that is of fundamental interest. These methods allow a diagnosis of deviation from normality and the option of identifying the presence of masking effects caused by multiple outliers. This paper is trying to introduce a new scheme for damage detection by adopting simple measurements and …", "num_citations": "2\n", "authors": ["1407"]}
{"title": "The Effect of Attenuation On the Identification of Impact Damage in CFRP Laminates\n", "abstract": " The subject of this study is the identification of impact damage in composite materials on the basis of response-only measurements. Low velocity impact events can lead to barely visible damage in composite structures which if left undetected can lead to degradation of performance and, in the worst case, to catastrophic failure of the structure. The increasing use of composite materials in aerospace and renewable energy applications motivates a desire to develop methods that allow detection of impact and identification of any resulting damage using measured responses only. In previous work it has been shown that low-dimensional ‘features’ drawn from surface mounted sensors may be used to develop a statistical basis for damage identification for Carbon Fibre-Reinforced Polymer (CFRP) coupon samples subjected to impact via a drop-test machine. This work has shown that not only can such features be used to indicate the presence of damage, but also that they show promise in indicating both the nature and extent of the damage that has occurred. There are several questions outstanding with regards to this method of damage identification. Prominent among these is the question of attenuation of the signal as it passes through the structure and whether this will hinder the practical application of the methodology. Attenuation is a particular concern given the nature of the composite materials under investigation, being both moderately damped and orthotropic in nature. In the present study, the effect of attenuation is investigated through a series of experiments on extensive plates with sensors at varying locations and orientations from the point …", "num_citations": "2\n", "authors": ["1407"]}
{"title": "Bayesian Sensitivity Analysis of Numerical Models for Structural Health Monitoring\n", "abstract": " The scarcity of damaged-state data is an abiding problem in practical applications of structural health monitoring. Given this scarcity, it is perhaps unsurprising that many of the techniques proposed for the SHM make use of physics-based modelling in order to ‘fill in the blanks'. The aim of developing the model is often, but not exclusively, to act as the basis for a model-update type SHM strategy. However, it is possible to get more out of a developed numerical model. By probing the physical interactions encapsulated in the model a comprehensive picture of the relationships between inputs and outputs can be constructed. In this paper, a global sensitivity analysis approach is demonstrated for this purpose. The techniques applied reflect progress in the field of analysis of complex computational models, and make use of both code emulation and Bayesian statistical methods.", "num_citations": "2\n", "authors": ["1407"]}
{"title": "Real-Time Digital Twin Updating Strategy Based on Structural Health Monitoring Systems\n", "abstract": " In structural health monitoring (SHM), model updating is concerned with identifying and updating system parameters (e.g. stiffness and mass) based on the measured response data of the monitored structure. With the increasing number of SHM systems deployed on modern structures in recent years, real-time model updating has become possible. This allows a digital twin of the monitored structure to be built, such that the structural behaviour can be monitored and predicted simultaneously throughout its life-cycle. In real applications, the structural response data are normally measured under operational conditions where the environment and loading condition cannot be directly controlled, which leads to significant identification uncertainty. The system model can also be complex, meaning that identifying system parameters directly from measured response data is challenging and time consuming. Focusing on the …", "num_citations": "1\n", "authors": ["1407"]}
{"title": "Health monitoring of composite structures by combining ultrasonic wave data\n", "abstract": " With the growing size of large-scale structures, composite materials are being increasingly used due to their high strength-to-weight ratio. As structures get larger, so too does the necessity for a robust health monitoring system; a well-founded and reliable method of doing so is by monitoring acoustic emissions. However, such a method encounters significant problems when employed on composite structures; such as high dispersion of extensional modes, propagation distance-dependent wave velocity and highly subjective characteristic frequencies of failure modes. Ultrasonic guided waves offer the abilities of location and severity detection to a more accurate level, whereas acoustic emission involves a more efficient passive approach. By analysis of ultrasonic waves in a carbon-fibre-reinforced-polymer (CFRP) plate, information is show here that will provide the stepping stones for the development of a robust …", "num_citations": "1\n", "authors": ["1407"]}
{"title": "On an application of probabilistic risk assessment to structural health monitoring\n", "abstract": " A key motivation for implementing structural health monitoring is to facilitate decisionmaking regarding the operation of a structure throughout its life. The notion of risk has been used to inform decision-making under uncertainty in industries such as nuclear energy and aerospace-formalised in a procedure known as probabilistic risk assessment. The current paper aims to exploit methods used in probabilistic risk assessment to demonstrate a novel risk-based approach to structural health monitoring. The approach utilises a probabilistic graphical model framework in which information is passed from a probabilistic classifier to an influence diagram representing a decision-process via a Bayesian network representation of a fault tree. The risk-based approach is demonstrated on simulated data from a finite element model of a four bay truss.", "num_citations": "1\n", "authors": ["1407"]}
{"title": "Model Validation and Uncertainty Quantification, Volume 3: Proceedings of the 36th IMAC, A Conference and Exposition on Structural Dynamics 2018\n", "abstract": " Model Validation and Uncertainty Quantification represents one of nine volumes of technical papers presented at the 36th IMAC, A Conference and Exposition on Structural Dynamics, organized by the Society for Experimental Mechanics, and held in Orlando, Florida, February 12–15, 2018. The full proceedings also include volumes on Nonlinear Dynamics; Dynamics of Civil Structures; Dynamics of Coupled Structures; Special Topics in Structural Dynamics; Structural Health Monitoring, Photogrammetry and DIC; Rotating Machinery, Vibro-Acoustics and Laser Vibrometry; Sensors and Instrumentation, Aircraft/Aerospace and Energy Harvesting; and Topics in Modal Analysis and Testing. Each collection presents early findings from experimental and computational investigations on an important area within structural dynamics. Model validation and uncertainty quantification (MVUQ) is one of these areas. Modeling …", "num_citations": "1\n", "authors": ["1407"]}
{"title": "A report on the 6th European Conference on Structural Control\n", "abstract": " A short report is provided on the 6th European Conference on Structural Control which took place in Sheffield from 11–13 July 2016", "num_citations": "1\n", "authors": ["1407"]}
{"title": "Bayesian inference and rjmcmc in structural dynamics: On experimental data\n", "abstract": " This paper is concerned with applying the Reversible Jump Markov Chain Monte Carlo (RJMCMC) algorithm on an MDOF system, within a Bayesian framework, in order to identify its parameters and do model selection simultaneously. Bayesian Inference has been widely used in the area of System Identification (SID) on issues of parameter estimation as well as model selection, due to its advantages of using prior knowledge and penalising model complexity, the Bayesian probability framework has been employed on issues of parameter estimation as well as model selection. Even though the posterior probabilities of parameters are often complex, the use of Markov Chain Monte Carlo (MCMC) sampling methods has made the application of the approach significantly more straightforward in structural dynamics. The most commonly applied MCMC sampling algorithm used within a Bayesian framework in the …", "num_citations": "1\n", "authors": ["1407"]}
{"title": "Linear and Nonlinear System Identification Using Evolutionary Optimisation\n", "abstract": " While system identification of linear systems is largely an established body of work encoded in a number of key references (including textbooks), nonlinear system identification remains a difficult problem and tends to rely on a “toolbox” of methods with no generally accepted canonical approach. Fairly recently, methods of parameter estimation using evolutionary optimisation have emerged as a powerful means of identifying whole classes of systems with nonlinearities which previously proved to be very difficult, e.g. systems with unmeasured states or with equations of motion nonlinear in the parameters. This paper describes and illustrates the use of evolutionary optimisation methods (specifically the self-adaptive differential evolution (SADE) algorithm) on a class of single degree-of-freedom (SDOF) dynamical systems with hysteretic nonlinearities. The paper shows that evolutionary identification also has …", "num_citations": "1\n", "authors": ["1407"]}
{"title": "An SHM view of a CFD model of Lillgrund wind farm\n", "abstract": " Reliability of offshore wind farms is one of the key areas for the successful implementation of these renewable power plants in the energy arena. Failure of the wind turbine (WT) in general could cause massive financial losses but especially for structures that are operating in offshore sites. Structural Health Monitoring (SHM) of WTs is essential in order to ensure not only structural safety but also avoidance of overdesign of components that could lead to economic and structural inefficiency. A preliminary analysis of a machine learning approach in the context of WT SHM is presented here; it is based on results from a Computational Fluid Dynamics (CFD) model of Lillgrund Wind farm. The analysis is based on neural network regression and is used to predict the measurement of each WT from the measurements of other WTs in the farm. Regression model error is used as an index of abnormal response.", "num_citations": "1\n", "authors": ["1407"]}
{"title": "Advanced tools for damage detection in wind turbines\n", "abstract": " The paper summarises some advanced damage detection approaches used for Structural Health Monitoring (SHM) and Condition Monitoring (CM) of wind turbine systems. In the signal processing part, recent time-frequency analysis methods will be presented and examples of their application on condition monitoring of gearboxes will be given. In the pattern recognition part, examples of damage detection in blades will be used to introduce different algorithms for novelty detection.", "num_citations": "1\n", "authors": ["1407"]}
{"title": "Some Recent Developments in Structural Health Monitoring\n", "abstract": " This paper is concerned with reporting some recent developments in Structural Health Monitoring (SHM) research conducted within the Dynamics Research Group at the University of Sheffield. The particular developments discussed are concerned with arguably the two main problems facing data-based approaches to SHM, namely: how to obtain data from damage states of a structure for supervised learning and how to remove environmental and operational effects from data when unsupervised learning (novelty detection) is indicated.", "num_citations": "1\n", "authors": ["1407"]}
{"title": "Multiple-site damage location using single-site training data\n", "abstract": " The identification of multiple-site damage is a challenging problem in data-based structural health monitoring (SHM). It is generally accepted that higher level damage identification via statistical pattern recognition requires the adoption of a supervised learning approach, with the need for data to be gathered from the structure in all damaged states of interest. The number of states for which data would be required to cover all damage combinations grows exponentially with the number of locations at which damage may occur. Damage state data sets of this extent are unlikely to be available in practical applications. The objective of this paper is to explore an interesting approach to the problem of multiple-site damage location. It is postulated that if sufficient information can be gleaned from single-site damage data to allow identification of multiplesite damage, then the requirement to gather data for all …", "num_citations": "1\n", "authors": ["1407"]}
{"title": "A comparative study of approaches to damage detection\n", "abstract": " The objective of the current paper is to discuss the relative strengths and weaknesses of the two main approaches to the diagnostic element of Structural Health Monitoring (SHM) and to try to indicate where they are best used in practice. Given the degree of commonality that is apparent, the paper will also discuss how the two approaches can support each other in the development of best practice and some speculation will be made as to how the approaches might be combined in order to exploit the strengths of both.", "num_citations": "1\n", "authors": ["1407"]}
{"title": "Feature extraction from spectral data using the Bayesian evidence framework\n", "abstract": " The optimal selection of discriminatory features from large datasets remains a pressing problem in damage identification. In this paper, a Bayesian approach to classification and feature selection is introduced and applied to a challenging experimental problem.", "num_citations": "1\n", "authors": ["1407"]}