{"title": "The cyber-physical attacker\n", "abstract": " The world of Cyber-Physical Systems ranges from industrial to national interest applications. Even though these systems are pervading our everyday life, we are still far from fully understanding their security properties. Devising a suitable attacker model is a crucial element when studying the security properties of CPSs, as a system cannot be secured without defining the threats it is subject to. In this work an attacker scenario is presented which addresses the peculiarities of a cyber-physical adversary, and we discuss how this scenario relates to other attacker models popular in the security protocol literature.", "num_citations": "22\n", "authors": ["701"]}
{"title": "Smart grid security a smart meter-centric perspective\n", "abstract": " The electricity grid is a key infrastructure for our society, therefore its security is a critical public concern. This physical system is becoming more and more complex as it is coupled with a cyber layer carrying information about power usage and control instructions for intelligent appliances, leading to what is known as the Smart Grid. The development of this Cyber-Physical System introduces new security issues, thus calling for efforts in studying possible attacks and devising suitable countermeasures. In this paper, we review a generic model for the Smart Grid, and present possible attacks and countermeasures focusing on a key component of the Smart Grid: the Smart Meter.", "num_citations": "17\n", "authors": ["701"]}
{"title": "A framework for semi-automated process instance discovery from decorative attributes\n", "abstract": " Process mining is a relatively new field of research: its final aim is to bridge the gap between data mining and business process modelling. In particular, the assumption underpinning this discipline is the availability of data coming from business process executions. In business process theory, once the process has been defined, it is possible to have a number of instances of the process running at the same time. Usually, the identification of different instances is referred to a specific “case id” field in the log exploited by process mining techniques. The software systems that support the execution of a business process, however, often do not record explicitly such information. This paper presents an approach that faces the absence of the “case id” information: we have a set of extra fields, decorating each single activity log, that are known to carry the information on the process instance. A framework is addressed, based …", "num_citations": "15\n", "authors": ["701"]}
{"title": "Security games for cyber-physical systems\n", "abstract": " The development of quantitative security analyses that consider both active attackers and reactive defenders is a main challenge in the design of trustworthy Cyber-Physical Systems. We propose a game-theoretic approach where it is natural to model attacker’s and defender’s actions explicitly, associating costs to attacks and countermeasures. Cost considerations enable to contrast different strategies on the basis of their effectiveness and efficiency, paving the way to a multi-objective notion of optimality. Moreover, the framework allows expressing the probabilistic nature of the environment and of the attack detection process. Finally, a solver is presented to compute strategies and their costs, resorting to a recent combination of strategy iteration with linear programming.", "num_citations": "12\n", "authors": ["701"]}
{"title": "Availability by Design-A Complementary Approach to Denial-of-Service\n", "abstract": " In computer security, a Denial-of-Service (DoS) attack aims at making a resource unavailable. DoS attacks to systems of public concern occur increasingly and have become infamous on the Internet, where they have targeted major corporations and institutions, thus reaching the general public. There exist various practical techniques to face DoS attacks and mitigate their effects, yet we witness the successfulness of many.", "num_citations": "8\n", "authors": ["701"]}
{"title": "Toward a threat model for energy-harvesting wireless sensor networks\n", "abstract": " Security is a crucial matter for Wireless Sensor Networks. With the recent introduction of Energy-Harvesting nodes, it has gained even more importance. By exploiting the ability of scavenging energy from the surrounding environment, the lifespan of a node has drastically increased. This is one of the reasons why security needs a new take in this topic. Traditional solutions may not work in this new domain. Brand new challenges and threats may arise and new solutions have to be designed. In this paper we present a first taxonomy of attacks, focusing on how they change in the energy-harvesting context compared to regular sensor networks. We also discuss existing security solutions specific for the energy harvesting world and comment on the trend that this topic may follow in the future. Finally, we draw a comparison between the cyber-physical attacker we define in our model and adversary models …", "num_citations": "6\n", "authors": ["701"]}
{"title": "Introducing the Cyber-Physical Attacker to Energy-Harvesting Wireless Sensor Networks\n", "abstract": " Cyber-Physical Systems based on Wireless Sensor Networks are pervading our everyday life, ranging from industrial to military applications. Due to the criticality of the tasks performed by these systems, and to the increasing number of fields in which they are employed, their security is a central concern. What is more, with the recent introduction of Energy-Harvesting nodes, securing such a system is even harder. An EH-node is able of scavenging energy from the surrounding environment, thus extending its lifespan, but this new feature introduces a new target for attackers. Traditional approaches to WSN security may not work in this new domain: new solutions have to be designed to cope with brand new challenges. A taxonomy of attacks is presented in this paper, which focuses on highlighting the novelties of the energy-harvesting context compared to regular sensor networks. We also discuss existing solutions specific to the energy harvesting world, and comment on the trend that this topic is likely to follow in the future. Finally, we sketch a comparison between the cyber-physical attacker we define and adversary models belonging to security protocols verification literature.", "num_citations": "3\n", "authors": ["701"]}
{"title": "Expressive power of definite clauses for verifying authenticity\n", "abstract": " Thanks to the work of Bruno Blanchet definite clauses are an established technique for verifying security properties of communication protocols. We investigate the expressive power of this approach with respect to verifying authenticity. A translation from protocols into definite clauses is given, and direct proofs for correctness and completeness of the authenticity verification based on these clauses are shown. These proofs are new, and in particular the completeness result is surprising. These results, beside their intrinsic value, shed light on some interesting issues about existing proposals for exploiting definite clauses in protocols verification.", "num_citations": "1\n", "authors": ["701"]}