{"title": "The linear time-branching time spectrum I. The semantics of concrete, sequential processes\n", "abstract": " In this paper various semantics in the linear time - branching time spectrum are presented in a uniform, model-independent way. Restricted to the class of finitely branching, concrete, sequential processes, only fifteen of them turn out to be different, and most semantics found in the literature that can be defined uniformly in terms of action relations coincide with one of these fifteen. Several testing scenarios, motivating these semantics, are presented, phrased in terms of ‘button pushing experiments’ on generative and reactive machines. Finally twelve of these semantics are applied to a simple language for finite, concrete, sequential, nondeterministic processes, and for each of them a complete axiomatization is provided.", "num_citations": "1327\n", "authors": ["1608"]}
{"title": "Branching time and abstraction in bisimulation semantics\n", "abstract": " In comparative concurrency semantics, one usually distinguishes between linear time and branching time semantic equivalences. Milner's notion of observatin equivalence is often mentioned as the standard example of a branching time equivalence. In this paper we investigate whether observation equivalence really does respect the branching structure of processes, and find that in the presence of the unobservable action τ  of CCS this is not the case.Therefore, the notion of branching bisimulation equivalence is introduced which strongly preserves the branching structure of processes, in the sense that it preserves computations together with the potentials in all intermediate states that are passed through,  even if silent moves are involved. On closed CCS-terms branching bisimulation congruence can be completely axiomatized by the single axion scheme: a.(τ.(y+z)+y)=a.(y+z) (where a ranges over all actions …", "num_citations": "1116\n", "authors": ["1608"]}
{"title": "Refinement of actions and equivalence notions for concurrent systems\n", "abstract": " We study an operator for refinement of actions to be used in the design of concurrent systems. Actions on a given level of abstraction are replaced by more complicated processes on a lower level. This is done in such a way that the behaviour of the refined system may be inferred compositionally from the behaviour of the original system and from the behaviour of the processes substituted for actions. We recall that interleaving models of concurrent systems are not suited for defining such an operator in its general form. Instead, we define this operator on several causality based, event oriented models, taking into account the distinction between deadlock and successful termination. Then we investigate the interplay of action refinement with abstraction in terms of equivalence notions for concurrent systems, considering both linear time and branching time approaches. We show that besides the interleaving …", "num_citations": "357\n", "authors": ["1608"]}
{"title": "Equivalence notions for concurrent systems and refinement of actions\n", "abstract": " We investigate equivalence notions for concurrent systems. We consider ”linear time” approaches where the system behaviour is characterised as the set of possible runs as well as ”branching time” approaches where the conflict structure of systems is taken into account. We show that the usual interleaving equivalences, and also the equivalences based on steps (multisets of concurrently executed actions) are not preserved by refinement of atomic actions. We prove that ”linear time” partial order semantics, where causality in runs is explicit, is invariant under refinement. Finally, we consider various bisimulation equivalences based on partial orders and show that the strongest one of them is preserved by refinement whereas the others are not.", "num_citations": "295\n", "authors": ["1608"]}
{"title": "The linear time-branching time spectrum\n", "abstract": " In this paper eleven semantics in the linear time — branching time spectrum are presented in a uniform, model-independent way. Restricted to the domain of finitely branching, concrete, sequential processes, most semantics found in the literature that can be defined uniformly in terms of action relations coincide with one of these eleven. Several testing scenarios, motivating these semantics, are presented, phrased in terms of ‘button pushing experiments’ on generative and reactive machines. Finally nine of these semantics are applied to a simple language for finite, concrete, sequential, nondeterministic processes, and for each of them a complete axiomatization is provided.", "num_citations": "234\n", "authors": ["1608"]}
{"title": "Comparative concurrency semantics and refinement of actions\n", "abstract": " Comparative concurrency semantics and refinement of actions (1990) | www.narcis.nl KNAW KNAW Narcis Back to search results CWI Publication Comparative concurrency semantics and refinement of actions (1990) Pagina-navigatie: Main Save publication Save as MODS Export to Mendeley Save as EndNote Export to RefWorks Title Comparative concurrency semantics and refinement of actions Author RJ van Glabbeek (Rob) Date issued 1990-05-16 Access Closed Access Language English Type Doctoral Thesis Publication https://ir.cwi.nl/pub/29064 OpenURL Search this publication in (your) library Persistent Identifier urn:NBN:nl:ui:18-29064 Metadata XML Source CWI Go to Website Navigation: Home about narcis login Nederlands contact Anna van Saksenlaan 51 2593 HW Den Haag narcis@dans.knaw.nl More >>> Youtube Newsletter >>> Privacy statement >>> Disclaimer >>> DANS is an institute of KNAW …", "num_citations": "208\n", "authors": ["1608"]}
{"title": "Configuration structures\n", "abstract": " Configuration structures provide a model of concurrency generalising the families of configurations of event structures. They can be considered logically, as classes of propositional models; then, sub-classes can be axiomatised by formulae of simple prescribed forms. Several equivalence relations for event structures are generalized to configuration structures, and also to general Petri nets. Every configuration structure is shown to be ST-bisimulation equivalent to a prime event structure with binary conflict; this fails for the tighter history-preserving bisimulation. Finally, Petri nets without self-loops under the collective token interpretation are shown to be behaviourally equivalent to configuration structures, in the sense that there are translations in both directions respecting history-preserving bisimulation. This fails for nets with self-loops.", "num_citations": "155\n", "authors": ["1608"]}
{"title": "Bounded Nondeterminism and The Approximation Induction Principle in Process Algebra\n", "abstract": " This paper presents a new semantics of ACP τ, the Algebra of Communicating Processes with abstraction. This leads to a term model of ACP τ which is isomorphic to the model of process graphs modulo rooted τδ-bisimulation of Baeten, Bergstra & Klop In this model, the Recursive Definition Principle (RDP), the Commutativity of Abstraction (CA) and Koomen's Fair Abstraction Rule (KFAR) are satisfied, but the Approximation Induction Principle (AIP) is not. The combination of these four principles is proven to be inconsistent, while any combination of three of them is not. In [2] a restricted version of AIP is proved valid in the graph model. This paper proposes a simpler and less restrictive version of AIP, not containing guarded recursive specifications as a parameter, which is still valid. This infinitary rule is formulated with the help of a family B n of unary predicates, expressing bounded nondeterminism.", "num_citations": "136\n", "authors": ["1608"]}
{"title": "Refinement of actions in causality based models\n", "abstract": " We consider an operator for refinement of actions to be used in the design of concurrent systems. Actions on a given level of abstraction are replaced by more complicated processes on a lower level. This is done in such a way that the behaviour of the refined system may be inferred compositionally from the behaviour of the original system and from the behaviour of the processes substituted for actions. We define this refinement operation for causality based models like event structures and Petri nets. For Petri nets, we relate it to other approaches for refining transitions.", "num_citations": "135\n", "authors": ["1608"]}
{"title": "Configuration structures, event structures and Petri nets\n", "abstract": " In this paper the correspondence between safe Petri nets and event structures, due to Nielsen, Plotkin and Winskel, is extended to arbitrary nets without self-loops, under the collective token interpretation. To this end we propose a more general form of event structure, matching the expressive power of such nets. These new event structures and nets are connected by relating both notions with configuration structures, which can be regarded as representations of either event structures or nets that capture their behaviour in terms of action occurrences and the causal relationships between them, but abstract from any auxiliary structure.A configuration structure can also be considered logically, as a class of propositional models, or—equivalently—as a propositional theory in disjunctive normal from. Converting this theory to conjunctive normal form is the key idea in the translation of such a structure into a net.For a …", "num_citations": "117\n", "authors": ["1608"]}
{"title": "On the expressiveness of higher dimensional automata\n", "abstract": " In this paper I compare the expressive power of several models of concurrency based on their ability to represent causal dependence. To this end, I translate these models, in behaviour preserving ways, into the model of higher dimensional automata (HDA), which is the most expressive model under investigation. In particular, I propose four different translations of Petri nets, corresponding to the four different computational interpretations of nets found in the literature.I also extend various equivalence relations for concurrent systems to HDA. These include the history preserving bisimulation, which is the coarsest equivalence that fully respects branching time, causality and their interplay, as well as the ST-bisimulation, a branching time respecting equivalence that takes causality into account to the extent that it is expressible by actions overlapping in time. Through their embeddings in HDA, it is now well-defined …", "num_citations": "114\n", "authors": ["1608"]}
{"title": "Document controlled workflow systems and methods\n", "abstract": " The document controlled workflow techniques are provided that can be represented by refinable Petri nets. A document may contain a control code that indicates to the document controlled workflow system to implement specified operations (ie, functions) at a refinable place. The operations implemented at the refinable place are determined by the control code in the document. An author of the document can customize a document controlled workflow system of the present invention by entering a control code into a document that triggers the implementation of operations customized to that particular document at a refinable place in the document workflow system. The operations specified by a control code in a document can be represented by a refinement network.", "num_citations": "112\n", "authors": ["1608"]}
{"title": "Proof nets for unit-free multiplicative-additive linear logic\n", "abstract": " A cornerstone of the theory of proof nets for unit-free multiplicative linear logic (MLL) is the abstract representation of cut-free proofs modulo inessential rule commutation. The only known extension to additives, based on monomial weights, fails to preserve this key feature: a host of cut-free monomial proof nets can correspond to the same cut-free proof. Thus, the problem of finding a satisfactory notion of proof net for unit-free multiplicative-additive linear logic (MALL) has remained open since the inception of linear logic in 1986. We present a new definition of MALL proof net which remains faithful to the cornerstone of the MLL theory.", "num_citations": "93\n", "authors": ["1608"]}
{"title": "Ntyft/ntyxt rules reduce to ntree rules\n", "abstract": " Groote and Vaandrager introduced thetyft/tyxt formatfor Transition System Specifications (TSSs), and established that for each TSS in this format that iswell-founded, the bisimulation equivalence it induces is a congruence. In this paper, we construct for each TSS in tyft/tyxt format an equivalent TSS that consists oftree rulesonly. As a corollary we can give an affirmative answer to an open question, namely whether the well-foundedness condition in the congruence theorem for tyft/tyxt can be dropped. These results extend to tyft/tyxt with negative premises and predicates.", "num_citations": "93\n", "authors": ["1608"]}
{"title": "The refinement theorem for ST-bisimulation semantics\n", "abstract": " INTRODUCTION Virtually all semantic equivalences employed in theories of concurrency are deﬁned in terms of actions that concurrent systems may perform (cf [l-18]). Mostly, these actions are taken to be atomic, mean-ing that they are considered not to be divisible into smaller parts. In this case, the deﬁned equivalences are said to be based on action atomicity. However, in the top~ down design of distributed systems it might be fruitful to model processes at different levels of abstraction. The actions on an abstract level then turn out to represent complex processes on a more concrete level. This methodology does not seem to be compatible with nondivisibility of actions and for this reason PRATT [15], LAMPORT [ll] and others plead for the use of semantic equivalences that are not based on action atomicity. As indicated in CASTELLANO, DE MICI-IELIS 8: POMELLO [4], the concept of action atomicity can be …", "num_citations": "93\n", "authors": ["1608"]}
{"title": "Branching bisimilarity with explicit divergence\n", "abstract": " We consider the relational characterisation of branching bisimilarity with explicit divergence. We prove that it is an equivalence and that it coincides with the original definition of branching bisimilarity with explicit divergence in terms of coloured traces. We also establish a correspondence with several variants of an action-based modal logic with until-and divergence modalities.", "num_citations": "87\n", "authors": ["1608"]}