{"title": "Traceability management meets information retrieval methods-strengths and limitations\n", "abstract": " This research abstract analyses the strengths and limitations of the application of information retrieval (IR) methods for traceability link recovery between software artefacts. This work also shows how the ideas behind an IR-based traceability recovery process combined with traceability information can be used to improve and monitor software artefact quality during software development.", "num_citations": "22\n", "authors": ["978"]}
{"title": "The architecture of an innovative smart T-shirt based on the Internet of Medical Things paradigm\n", "abstract": " This paper deals with a description of an innovative Internet of Medical Things (IoMT) system for implementing personalized health services. The proposed IoMT system has the following advantages respect to the state-of-the-art systems available in literature: (i) it fuses the data provided by several sensors, inertial measurement unit, the bio-impedance and electrocardiogram, (ii) it uses Compressed Sensing (CS) of data prior to transmission, and (iii) it adopts distributed artificial intelligence at the edge for anomaly detection. A description of the specific features and requirements of the wearable device that will be embedded on a smart T-shirt is reported. According to the delineated requirements, an architecture for the wearable device is proposed. Finally the contribution of Artificial Intelligence in the proposed IoMT system is discussed, aiming at identifying anomalies and supporting the process of decision making …", "num_citations": "20\n", "authors": ["978"]}
{"title": "Fixing of security vulnerabilities in open source projects: A case study of apache http server and apache tomcat\n", "abstract": " Software vulnerabilities are particularly dangerous bugs that may allow an attacker to violate the confidentiality, integrity or availability constraints of a software system. Fixing vulnerabilities soon is of primary importance; besides, it is crucial to release complete patches that do not leave any corner case not covered. In this paper we study the process of vulnerability fixing in Open Source Software. We focus on three dimensions: personal, i.e., who fixes software vulnerabilities; temporal, i.e., how long does it take to release a patch; procedural, i.e., what is the process followed to fix the vulnerability. In the context of our study we analyzed 337 CVE Entries regarding Apache HTTP Server and Apache Tomcat and we manually linked them to the patches written to fix such vulnerabilities and their related commits. The results show that developers who fix software vulnerabilities are much more experienced than the average …", "num_citations": "16\n", "authors": ["978"]}
{"title": "Recovering traceability links using information retrieval tools: a controlled experiment\n", "abstract": " Recovering Traceability Links using Information Retrieval Tools: a Controlled Experiment IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Università degli Studi del Molise Catalogo Ricerca 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno Recovering Traceability Links using Information Retrieval Tools: a Controlled Experiment Italiano Italiano Italiano Italiano English English Recovering Traceability Links using Information Retrieval Tools: a Controlled Experiment / DE LUCIA A; OLIVETO R; TORTORA G. - (2007), pp. 46-55. ((Intervento presentato al convegno International Symposium on Grand Challeges in Traceability tenutosi a Lexington, Kentucky, USA nel March 22-23, 2007. Scheda breve Scheda completa Titolo: Recovering Traceability Links using Information Retrieval Tools: a …", "num_citations": "9\n", "authors": ["978"]}
{"title": "Morphological Classification of Heartbeats in Compressed ECG.\n", "abstract": " The number of connected medical devices that are able to acquire, analyze, or transmit health data is continuously increasing. This has allowed the rise of Internet of Medical Things (IoMT). IoMT-systems often need to process a massive amount of data. On the one hand, the colossal amount of data available allows the adoption of machine learning techniques to provide automatic diagnosis. On the other hand, it represents a problem in terms of data storage, data transmission, computational cost, and power consumption. To mitigate such problems, modern IoMT systems are adopting machine learning techniques with compressed sensing methods. Following this line of research, we propose a novel heartbeat morphology classifier, called RENEE, that works on compressed ECG signals. The ECG signal compression is realized by means of 1-bit quantization. We used several machine learning techniques to classify the heartbeats from compressed ECG signals. The obtained results demonstrate that RENEE exhibits comparable results with respect to state-of-the-art methods that achieve the same goal on uncompressed ECG signals.", "num_citations": "5\n", "authors": ["978"]}
{"title": "Identification of R-peak occurrences in compressed ECG signals\n", "abstract": " Heart Rate (HR) is one of the mostly used electrocardiogram (ECG) feature in many automatic detectors of anomalies. This paper deals with a preliminary study on a novel approach which, through the combination of Machine Learning (ML) and Compressed Sensing (CS), aims at retrieving vital information from a digital compressed single-lead electrocardiogram (ECG) signal. As a potential key information to estimate the heart rate, this study focuses on the identification of R-peak occurrences. The study has been conducted on two different types of signal both obtained from the compressed samples provided by a CS algorithm, already available in literature. The results demonstrate that the use of CS in combination with a ML technique can find high competitiveness when compared to a state of the art method working on the uncompressed ECG signal.", "num_citations": "5\n", "authors": ["978"]}
{"title": "Recovering Traceability links between requirement artefacts: a case study\n", "abstract": " Recovering Traceability Links between Requirement Artefacts: a Case Study IRIS nascondi/visualizza icone a destra nascondi/visualizza menu in alto Aiuto Sfoglia Scorri i prodotti per: Autore Titolo Riviste Serie Login IRIS IRIS Università degli Studi del Molise Catalogo Ricerca 4 Contributo in Atti di Convegno (Proceeding) 4.1 Contributo in Atti di convegno Recovering Traceability Links between Requirement Artefacts: a Case Study Italiano Italiano Italiano Italiano English English Recovering Traceability Links between Requirement Artefacts: a Case Study / DE LUCIA A; FASANO F; FRANCESE R; OLIVETO R. - (2004), pp. 453-456. ((Intervento presentato al convegno International Workshop on Knowledge Oriented Maintenance (SEKE KOM) tenutosi a Banff, Alberta, Canada nel June 20-24, 2004. Scheda breve Scheda completa Titolo: Recovering Traceability Links between Requirement Artefacts: a Case Study …", "num_citations": "5\n", "authors": ["978"]}
{"title": "Freelancing in the economy 4.0: How information technology can (really) help\n", "abstract": " In the last years social media are increasing their importance in the context of digital freelancing by letting companies offer projects to external professionals through the Web. However, the available platforms for digital freelancing are still far from supporting the ecosystem of companies and professionals during the implementation of complex projects through an accurate definition of the required skills, roles, interdependencies and responsibilities. This chapter presents a roundup of the available systems of support to freelancers. The goal is to identify the essential features and structure of a comprehensive social media able to effectively manage and support the potential of an “economy 4.0” characterized by a free and flexible circulation of highly skilled professionals, that can be aggregated to support the needs of organizations.", "num_citations": "4\n", "authors": ["978"]}
{"title": "ATTICUS: Ambient-intelligent Tele-monitoring and Telemetry for Incepting and Catering over hUman Sustainability\n", "abstract": " Wearable devices as medical technologies are becoming an integral part of our lives. Many research studies are dedicated to these devices and are mainly focused on providing personal analytics, measuring physical status, and acquiring physiological signals and parameters. These continuously evolving technologies play an important role in telemedicine. Telemedicine can be broadly defined as the use of advanced telecommunications technologies to support many medical activities, such as the diagnosis, the analysis of patient data, the improvement of disease management and the treatment in remote areas. In this article, we present ATTICUS (Ambient-intelligent Tele-monitoring and Telemetry for Incepting and Catering over hUman Sustainability), an innovative remote monitoring system for ambient-assisted living based on the analysis of vital and behavioral parameters. The ATTICUS system consists of two essential components: a smart wearable—in the form of a short singlet—made of innovative textile which allows the acquisition of real-time body signals, eg, electrocardiogram (ECG), breathing wave, temperature, and a multi-level Decision Support System (DSS), a distributed software which integrates advanced machine learning methods to automatically detect anomalies. ATTICUS is capable of operating in different application scenarios. Especially, the system will support in-home and out-home monitoring, personal check-ups, and specialized check-ups. Thus, the system will positively impact the canonical medical practices allowing simultaneous and continuous monitoring of a large number of people.", "num_citations": "2\n", "authors": ["978"]}
{"title": "Supporting Project Management with Fine-Grained Artefact Managementin Adams\n", "abstract": " We present the project management support in ADAMS (ADvanced Artefact Management System), a web-based system that integrates project management features such as resource allocation and process control and artefact management features, such as coordination of cooperative workers and artefact versioning, as well as context-awareness and artefact traceability features. We also present an evaluation of the usefulness and adequacy of the functionalities that ADAMS provides to the project managed. This evaluation has been conducted during the last 3 years with Master students attending a course of Software Project Management at the University of Salerno.", "num_citations": "2\n", "authors": ["978"]}
{"title": "Source code analysis and manipulation\n", "abstract": " Source code analysis and manipulation × Close The Infona portal uses cookies, ie strings of text saved by a browser on the user's device. The portal can access those files and use them to remember the user's data, such as their chosen settings (screen view, interface language, etc.), or their login data. By using the Infona portal the user accepts automatic saving and using this information for portal operation purposes. More information on the subject can be found in the Privacy Policy and Terms of Service. By closing this window the user confirms that they have read the information on cookie usage, and they accept the privacy policy and the way cookies are used by the portal. You can change the cookie settings in your browser. I accept Polski English Login or register account remember me Password recovery INFONA - science communication portal INFONA Search advanced search Browse series books journals …", "num_citations": "1\n", "authors": ["978"]}