{"title": "Computational Intelligence and Financial Markets: A Survey and Future Directions\n", "abstract": " Financial markets play an important role on the economical and social organization of modern society. In these kinds of markets, information is an invaluable asset. However, with the modernization of the financial transactions and the information systems, the large amount of information available for a trader can make prohibitive the analysis of a financial asset. In the last decades, many researchers have attempted to develop computational intelligent methods and algorithms to support the decision-making in different financial market segments. In the literature, there is a huge number of scientific papers that investigate the use of computational intelligence techniques to solve financial market problems. However, only few studies have focused on review the literature of this topic. Most of the existing review articles have a limited scope, either by focusing on a specific financial market application or by focusing on a …", "num_citations": "415\n", "authors": ["1083"]}
{"title": "A survey of security in multi-agent systems\n", "abstract": " Multi-agent systems (MAS) are a relatively new software paradigm that is being widely accepted in several application domains to address large and complex tasks. However, with the use of MAS in open, distributed and heterogeneous applications, the security issues may endanger the success of the application. The goal of this research is to identify the security issues faced by MAS and to survey the current state of the art of this field of knowledge. In order to do it, this paper examines the basic concepts of security in computing, and some characteristics of agents and multi-agent systems that introduce new threats and ways to attack. After this, some models and architectures proposed in the literature are presented and analyzed.", "num_citations": "57\n", "authors": ["1083"]}
{"title": "An approach to handle concept drift in financial time series based on Extreme Learning Machines and explicit Drift Detection\n", "abstract": " Financial markets are very important to the economical and social organization of modern society. Due to they importance, several researchers have investigated how to predict future market movements by using both statistical and soft computing methods based on historical time series data. However, as a typical data stream, financial time series frequently present concept drift, which is a change in the relationship between input data and the target variable over time. The concept drift phenomenon affects negatively the forecasting accuracy since the learned model becomes outdated after a change in the current concept. In this paper we investigate how to handle concept drift in financial time series prediction in order to improve the forecasting accuracy. Two explicit drift detector mechanisms, namely the Drift Detection Mechanism (DDM) and the Exponentially Weighted Moving Average for Concept Drift Detection …", "num_citations": "26\n", "authors": ["1083"]}
{"title": "An autonomous trader agent for the stock market based on online sequential extreme learning machine ensemble\n", "abstract": " Financial markets are very important to the economical and social organization of modern society. In this kind of market, the success of an investor depends on the quality of the information he uses to trade in the market, and on how fast he is able to take decisions. In the literature, several statistical and soft computing mechanisms have been proposed in order to support investors decision in the financial market. In this work we propose an autonomous trader agent that is able to compute technical indicators of the stock market and take decisions on buying or selling stocks. Our trader agent is based on a single hidden layer feedforward (SLFN) ensemble trained with online sequential extreme learning machine (OS-ELM), a variant of ELM that is able to learn data one-by-one and dynamically accommodate changes in the market. In addition, we propose a set of trading rules that guides the trader agent in order to …", "num_citations": "16\n", "authors": ["1083"]}
{"title": "A multi-robot exploration approach based on distributed graph coloring\n", "abstract": " The assignment of target points to multiple robots in exploration missions is a combinatorial problem that is known to be NP-Hard. Negotiation-based methods, such as auctions, have been extensively investigated in the literature, but the provided solution is usually sub-optimal. In this study, we propose an approach which models the multi-robot exploration task as a distributed graph coloring problem, where the targets to be visited in the environment are the nodes of a graph that must be colored and each robot represents a different color to be used in the coloring process. As result, the coloring approach is able to minimize the exploration costs of the team, since it captures the synergy among targets and assigns them to a small number of robots. The proposed algorithm was tested in several experiments performed in environments with cluttered and clustered arrangements of targets, and compared the outcomes …", "num_citations": "16\n", "authors": ["1083"]}
{"title": "TEO: Uma suı́te de jogos interativos para apoio ao tratamento de crianças com autismo\n", "abstract": " Autism or ASD (Autistic Spectrum Disorder) is defined as a set of complex disorders that affect the brain and accompany the individual throughout life. Through the consolidation of current technologies in support of setting treatment and focus on education in the autistic universe, we propose in this article an evaluation and discussion of the methodology for the environment of interactive games called TEO (from portguese, Tratar, Estimular e Orientar-or Treat, Encourage and Guide). The purpose is, therefore, to aid in the treatment of transdisciplinary way, articulating through interactive games the development of logical reasoning, visual perception, concentration and other general skills.", "num_citations": "11\n", "authors": ["1083"]}
{"title": "Improving combinatorial auctions for multi-robot exploration\n", "abstract": " The use of multiple robots in exploration missions has attracted much attention in recent years. Here we deal with the specific problem in which a team of robots have to visit a set of target points to perform some action. Robots have a map of the environment and should compute and execute paths in a distributed way, trying to minimize the total mission cost that is dependent on the quality of the target-to-robot allocation. In this paper, we focus on this target allocation problem and use combinatorial auctions to solve it. We propose novel approaches for improving combinatorial auction mechanisms in the target allocation problem and compare them with approaches based on single-item auctions, sequential auctions, and other combinatorial auction algorithms. Experimental results showed that the auction approaches for multi-robot target allocation proposed in this work achieved better results than other auction …", "num_citations": "11\n", "authors": ["1083"]}
{"title": "Auxílio à classificação de nódulos pulmonares usando recuperação de imagens similares baseada em Análise de Textura 3D e Registro de Imagem 3D\n", "abstract": " The main purpose of this work was developing an algorithm to help the physicians in classify lung nodules. Another motivation of this work is the fact of we have believing that an accurate, robust and friendly computational solution can to encourage the use of the computer aided diagnosis that is an effective way to reduce the great volume of radiological film produced in the clinical routine. The Texture Analysis 3D and the Image Registration 3D (IR) were developed as similar image retrieval method (CBIR). The mean precision of the algorithms was higher than 70%. The IR method results are unpublished in the literature and shows the potential future of IR as CBIR method.Resumo. O objetivo deste trabalho foi desenvolver um algoritmo para auxiliar especialistas na classificação de nódulos pulmonares. A motivação deste trabalho advém também pelo fato de acreditarmos que uma solução computacional precisa, robusta e amistosa possa incentivar o diagnóstico auxiliado por computador que se constitui numa forma efetiva de reduzir o grande volume de impressão em filme radiológico. As técnicas de Análise de Textura 3D e Registro de Imagem 3D (RI) foram desenvolvidas como métodos de recuperação de imagens similares (CBIR). A precisão média dos algoritmos foi superior a 70%. Os resultados do RI são inéditos na literatura e evidenciaram o potencial futuro da técnica como método de CBIR.", "num_citations": "3\n", "authors": ["1083"]}
{"title": "A Local Search Approach for Improving Multi-Robot Routing in Exploration Missions\n", "abstract": " Cooperative multi-robot exploration is one of the fundamental problems in mobile robotics. A typical exploration problem is that in which robots have a model of the environment and they must visit a set of virtual, fixed target points in order to perform some task there. The assignment of multiple robots to target points in order to minimize the team costs, such as traveled distances, is an NP-Hard problem. Negotiation-based methods such as auctions have been widely used in literature, because they are easy to implement and present low communication and computational requirements. However, due to their simplicity, these methods produce sub optimal solutions. This paper presents a local search algorithm which can be combined with auctions to improve the solution quality of the assignment without increasing the communication requirements. The approach proposed in this paper is compared with three other …", "num_citations": "2\n", "authors": ["1083"]}