{"title": "Managing energy and server resources in hosting centers\n", "abstract": " Internet hosting centers serve multiple service sites from a common hardware base. This paper presents the design and implementation of an architecture for resource management in a hosting center operating system, with an emphasis on energy as a driving resource management issue for large server clusters. The goals are to provision server resources for co-hosted services in a way that automatically adapts to offered load, improve the energy efficiency of server clusters by dynamically resizing the active server set, and respond to power supply disruptions or thermal events by degrading service in accordance with negotiated Service Level Agreements (SLAs).Our system is based on an economic approach to managing shared server resources, in which services \"bid\" for resources as a function of delivered performance. The system continuously monitors load and plans resource allotments by estimating the …", "num_citations": "1821\n", "authors": ["1925"]}
{"title": "Model-Based Resource Provisioning in a Web Service Utility.\n", "abstract": " Internet service utilities host multiple server applications on a shared server cluster. A key challenge for these systems is to provision shared resources on demand to meet service quality targets at least cost. This paper presents a new approach to utility resource management focusing on coordinated provisioning of memory and storage resources. Our approach is model-based: it incorporates internal models of service behavior to predict the value of candidate resource allotments under changing load. The model-based approach enables the system to achieve important resource management goals, including differentiated service quality, performance isolation, storageaware caching, and proactive allocation of surplus resources to meet performance goals. Experimental results with a prototype demonstrate model-based dynamic provisioning under Web workloads with static content.", "num_citations": "368\n", "authors": ["1925"]}
{"title": "Methods, systems and computer program products for detecting a spoofed source address in IP datagrams\n", "abstract": " Methods, systems and computer program products are provided for determining if a packet has a spoofed source Internet Protocol (IP) address. A source media access control (MAC) address of the packet and the source IP address are evaluated to determine if the source IP address of the packet has been bound to the source MAC address at a source device of the packet. The packet is determined to have a spoofed source IP address if the evaluation indicates that the source IP address is not bound to the source MAC address. Such an evaluation may be made for packets having a subnet of the source IP address which matches a subnet from which the packet originated.", "num_citations": "353\n", "authors": ["1925"]}
{"title": "Secure integrated device with secure, dynamically-selectable capabilities\n", "abstract": " A method, system, computer program product, and method of doing business by providing a secure integrated device (such as a pervasive computing device) for which operating capabilities can be dynamically yet securely selected (including, but not limited to, pluggable connection of input/output devices and/or application processors that provide selected functions). Each input/output (I/O) device and application processor to be used is plugged in to a bus of a security core, and authenticates itself to the security core using public key infrastructure techniques, thereby creating a secure multi-function device. All of the multi-function device's input and output interactions with its environment necessarily traverse an I/O bus under the sole control of the security core. The only communication path between an application processor and the external environment (such as an I/O device) is through an application processor …", "num_citations": "335\n", "authors": ["1925"]}
{"title": "Smart card with integrated biometric sensor\n", "abstract": " A method, system, computer program product, and method of doing business by improving the security of transactions performed using smart cards, and also a card with an integrated biometric sensor. The disclosed techniques also improve the security of transactions carried out with devices such as personal or “pervasive computing” devices. Biometric sensors are used for obtaining identifying information from users of smart cards. In one aspect, this may be done by securely attaching a smart card reader and a biometric sensor to a security core which authenticates these devices using public key infrastructure techniques, and which securely controls information exchanged with these devices. In another aspect, this is done by integrating a biometric sensor with a smart card.", "num_citations": "309\n", "authors": ["1925"]}
{"title": "Multi-tier service level agreement method and system\n", "abstract": " A method for managing multi-tier SLA relationships. The method can include first computing costs of utilizing edge server resources in a CDN, costs of dedicating content host resources in a content host in lieu of the utilization, and prospective revenues which can be generated by the content host providing services based on the resources to content consumers. Minimum QoS levels can be identified which must be maintained when providing the services to the content consumers according to QoS terms in established SLAs between the content host and individual ones of the content consumers. Finally, a new SLA can be established between the content host and the CDN. Importantly, the new SLA can include QoS terms for selectively allocating resources in the CDN. Moreover, the QoS terms can optimize revenues generated by the content host providing services based on the selective allocation of resources and …", "num_citations": "298\n", "authors": ["1925"]}
{"title": "Security containers for document components\n", "abstract": " Methods, systems, computer program products, and methods of doing business whereby document components are secured or controlled using “security containers” which encapsulate the components (and other component metadata). A “security container” encapsulates the component (ie, content) that is to be controlled within a higher-level construct such as a compound document. The security container also contains rules for interacting with the encapsulated component, and one or more encryption keys usable for decrypting the component and rules for authorized requesters.", "num_citations": "290\n", "authors": ["1925"]}
{"title": "Secure logging of vehicle data\n", "abstract": " A secure event data recording system configured for use in a passenger vehicle. The secure event data recording system can include an event data recorder; a memory device coupled to the event data recorder and configured to store event data processed in the event data recorder; and, an input/output port communicatively linked to the memory device through which read/write access can be provided to the memory device. Significantly, a tamper proof sealing mechanism can be provided which bars access to the memory device, the event data recorder and the input/output port without causing an irreparable breach of the tamper proof sealing mechanism.", "num_citations": "256\n", "authors": ["1925"]}
{"title": "Technique for continuous user authentication\n", "abstract": " A method, system, computer program product, and method of doing business by improving security of a computing device. Continuous authentication of a user of the computing device, which may be (for example) a portable or personal computing device (also known as a “pervasive computing device”), is performed. The disclosed techniques also improve the security of operations or transactions carried out with such computing devices. Biometric sensors are preferably used for obtaining identifying information from users of computing devices, and this obtained information is compared to previously-stored biometric information which identifies the legitimate owner of the device. If the information matches, then it can be assumed that this user is the device owner, and a security-sensitive transaction is allowed to proceed so long as the biometric input is uninterrupted. Otherwise, when the obtained information does not …", "num_citations": "256\n", "authors": ["1925"]}
{"title": "Autonomic selection of a request routing policy based upon cache effectiveness\n", "abstract": " The present invention is a system, method and apparatus for autonomic request routing policy selection. The system of the invention can include a multiplicity of pre-configured request routing policies and a data store of cache metrics for the pre-configured request routing policies. A routing policy selector can be configured for communicative linkage to a server cluster having one or more servers and programmed to select a particular one of the request routing policies for use in routing content requests in the server cluster based upon the cache metrics. In this regard, the routing policy selector further can include a coupling to the routing policies and the data store of cache metrics.", "num_citations": "229\n", "authors": ["1925"]}
{"title": "Method and apparatus for client authentication and application configuration via smart cards\n", "abstract": " A data processing system for accessing a host computer. A smart card is detected at the data processing system, which in turn queries the smart card for an indication of a location of user information. A secure channel is established with the location of user information. User information is retrieved associated with the smart card from the location. A connection is established to the host computer with the user information. Key to this invention is the ability to use this infrastructure for authentication when a smart card cannot be used at the data processing system.", "num_citations": "212\n", "authors": ["1925"]}
{"title": "Energy management for server clusters\n", "abstract": " Geometric dilution of precision (GDOP) is defined as the ratio of the root-mean-square position determination error to the root-mean-square measurement error. Based on the Cramer-Rao lower bound (CRLB), new mathematical expressions of GDOP are presented in Time-of-Arrival (TOA) and Angle-of-Arrival (AOA) positioning systems in this paper. The expressions obviously reveal that the geometrical shape of the anchor nodes make a significant influence on GDOP. Then the influence of adding a new anchor node at different locations is analyzed. Simulations show that in both positioning systems, two optimal placement angles exist to make the GDOP smallest, when the original anchor nodes are no uniformly scattered. However, when uniformly scattered, the GDOP keeps constant no matter what angle the new anchor node is placed at. In AOA positioning systems, the GDOP is also affected by the distance …", "num_citations": "187\n", "authors": ["1925"]}
{"title": "Load balancing content requests using dynamic document generation cost information\n", "abstract": " Methods, systems, computer program products, and methods of doing business by performing load balancing of content requests using information regarding the cost of dynamically creating the requested document content. Cost metrics are gathered by a server which generates requested content, and may reflect processing at one or more other servers. This cost information is provided to a load balancing host. Several alternative approaches for providing the cost metrics may be used, including defining new headers for response messages, specifying cookie values, and so forth. The load balancing host may choose to route a subsequent request for that content to the server which most recently generated the content, or to another available server, depending on the cost of re-generating the content and the current load on those servers.", "num_citations": "150\n", "authors": ["1925"]}
{"title": "Addressing the name space mismatch between content servers and content caching systems\n", "abstract": " Techniques are disclosed for addressing the name space mismatch between content caching systems (which use Uniform Resource Locators, or “URLs”) and content servers (which use file and path names). A file name-to-URL mapping is created for use by content caching systems, and data in protocol response messages (and optionally in protocol request messages) is augmented to transmit information for use in creating this mapping, enabling a content caching system to automatically and dynamically populate its file name-to-URL mapping. By having the file name available, the caching system can now respond to content management messages which identify the cached content by only the content's associated file name. Techniques for encoding the message extensions include: use of new directives on existing cache-control headers in Hypertext Transfer Protocol (“HTTP”) messages; addition of new …", "num_citations": "133\n", "authors": ["1925"]}
{"title": "Automated cloud workload management in a map-reduce environment\n", "abstract": " A computing device associated with a cloud computing environment identifies a first worker cloud computing device from a group of worker cloud computing devices with available resources sufficient to meet required resources for a highest-priority task associated with a computing job including a group of prioritized tasks. A determination is made as to whether an ownership conflict would result from an assignment of the highest-priority task to the first worker cloud computing device based upon ownership information associated with the computing job and ownership information associated with at least one other task assigned to the first worker cloud computing device. The highest-priority task is assigned to the first worker cloud computing device in response to determining that the ownership conflict would not result from the assignment of the highest-priority task to the first worker cloud computing device.", "num_citations": "110\n", "authors": ["1925"]}
{"title": "The trickle-down effect: Web caching and server request distribution\n", "abstract": " Web proxies and Content Delivery Networks (CDNs) are widely used to accelerate Web content delivery and to conserve Internet bandwidth. These caching agents are highly effective for static content, which is an important component of all Web-based services.This paper explores the effect of ubiquitous Web caching on the request patterns seen by other components of an end-to-end content delivery architecture, including Web server clusters and interior caches. In particular, object popularity distributions in the Web tend to be Zipf-like, but caches disproportionately absorb requests for the most popular objects, changing the reference properties of the filtered request stream in fundamental ways. We call this the trickle-down effect.This paper uses trace-driven simulation and synthetic traffic patterns to illustrate the trickle-down effect and to investigate its impact on other components of a content delivery architecture …", "num_citations": "108\n", "authors": ["1925"]}
{"title": "User-based selective cache content replacement technique\n", "abstract": " The present invention provides a method, system, and computer program product for selectively replacing cached content (including, but not limited to, dynamically generated Web pages which have been cached) to provide a higher level of service to particular users or groups of users. Service providers may use the disclosed techniques to justify charging for an enhanced quality of service. The disclosed techniques enable reducing, in many cases, the system overhead and response time required for delivering content to those content requesters who have this type of enhanced service. When content is evaluated for potential caching and the cache is determined to be full, content is selected for overwriting according to the quality of service level of the content owner.", "num_citations": "89\n", "authors": ["1925"]}
{"title": "Grid service scheduling of related services using heuristics\n", "abstract": " A method and system for creating service instances in a computing grid. The method can include scheduling a service in the computing grid to process at least a portion of a requested transaction. At least one additional service related to the scheduled service can be identified, and a load condition can be assessed in the at least one additional service related to the scheduled service. A new instance of the at least one additional service can be created if the load condition exceeds a threshold load. In this way, an enhanced capacity for processing transactions can be established in the related services in advance of a predicted increase in load in the grid.", "num_citations": "87\n", "authors": ["1925"]}
{"title": "Flexible system and method for mirroring data\n", "abstract": " A flexible data mirroring system and method are adapted for use in a data processing system having first and second data storage devices. Upon receiving notification of a file update to be written to the first data storage device a mirror mode and mirror event associated with the updated file are determined from mirror information that has been provisioned on a per-file, per-directory or per-volume, etc. basis. The file update is mirrored to the second data storage device according to the provisioned mirror mode and mirror event. If the mirror mode is continuous, the mirror operation proceeds immediately. If the mirror mode is discrete, the file update is noted and the mirror operation proceeds following occurrence of the file's mirror event.", "num_citations": "81\n", "authors": ["1925"]}
{"title": "Attention deficits and the effects of visual distraction\n", "abstract": " The effects of a visual distractor on vigilance task performance were examined in a sample of LD and normal children. The vigilance task provides quantitative measures of the attentional deficit which is characteristic of many LD children. The results support previous findings that LDs tend to have a lower correct detection rate and higher false alarm, or random response, rate than normals. Detailed analysis supported the idea that most of the differences between these two broad groupings of children could be attributed to the hyperactive LDs. The study provided further support for the notion that the parameters of constructs such as Learning Disability can be Investigated and brought under experimental control.", "num_citations": "80\n", "authors": ["1925"]}
{"title": "Storage-assisted quality of service (QoS)\n", "abstract": " Storage-Assisted QoS. To provide storage-assisted QoS, a discriminatory storage system able to enforce a service discrimination policy within the storage system can include re-writable media; a storage system controller; a cache; and, a QoS enforcement processor configured to selectively evict entries in the cache according QoS terms propagated into the storage system through the storage system controller.", "num_citations": "79\n", "authors": ["1925"]}
{"title": "Certificate based security in SNA data flows\n", "abstract": " A method and system for enabling the use of a single client certificate to be used in SNA communications to ensure security such that the certificate cannot be intercepted and reused yet still allowing the use of a single certificate for multiple applications. This avoids the need for a connected trusted third party or a multiplicity of user id and password pairs.", "num_citations": "76\n", "authors": ["1925"]}
{"title": "Methods, systems and computer program products for distribution of requests based on application layer information\n", "abstract": " Methods, systems and computer program products are discussed for distributing workload between a plurality of servers. A plurality of requests are received over a first connection. The plurality of requests are parsed to determine application layer information associated with each of the plurality of requests. Destination servers are selected for each of the plurality of requests based on the determined application layer information. The plurality of requests are distributed to the selected destination servers over a plurality of second connections associated with each of the destination servers.", "num_citations": "62\n", "authors": ["1925"]}
{"title": "Method and apparatus for enhanced safety in hunting environments\n", "abstract": " The invention is a system combining a Global Positioning Satellite (GPS) receiver, an electronic compass and a two-way wireless communication system wherein a plurality of hunters each carry such a device. The device is adapted to determine its location using GPS, report that location to a base station or directly to other such devices, receive the location of the other hunters from the base station or directly from other of such devices, and to warn the hunter when aiming his weapon in the direction of another hunter that is within an unsafe distance.", "num_citations": "60\n", "authors": ["1925"]}
{"title": "Resource-aware system, method and program product for managing request traffic based on a management policy\n", "abstract": " Under the present invention, the performance of a set of system resources is monitored in response to incoming request traffic. When a system resource is approaching an overload condition, a corrective action is identified and implemented. Overload thresholds for each system resource and appropriate corrective actions are contained within a management policy. Based on a performance history of the corrective actions, the management policy can be changed/revised.", "num_citations": "57\n", "authors": ["1925"]}
{"title": "Autonomic failover of grid-based services\n", "abstract": " A grid coordinator which has been configured for autonomic failover can include a monitor communicatively linked to a multiplicity of grid hosts in a services grid. A metrics store can be coupled to the monitor and configured to store service metrics for individual service instances in the grid hosts. Optimization logic can be programmed to compute a best-fit between metrics stored for a set of service instances in a failed grid host, and platform metrics determined for a proposed replacement grid host. Finally, a failover processor can be coupled to the monitor and the optimization logic and communicatively linked to the grid hosts to create a new set of service instances in the proposed replacement grid host to replace the set of service instances in the failed grid host according to the best-fit in the optimization logic.", "num_citations": "55\n", "authors": ["1925"]}
{"title": "Methods, systems and computer program products for archiving topical search results of web servers\n", "abstract": " Methods, systems and computer program products are provided for archiving information from a plurality of web servers by specifying at least one topic to be searched, searching the plurality of web servers so as to locate information associated with the at least one topic to be searched and retrieving the located information from at least one of the plurality of web servers. The retrieved information is archived so as to allow subsequent retrieval of the archived information independent of the plurality of web servers. This process is then periodically repeated so as to provide a history of information associated with the at least one topic. Systems are also provided including servlets for searching and archiving information on a user specified topic.", "num_citations": "55\n", "authors": ["1925"]}
{"title": "Providing end-to-end user authentication for host access using digital certificates\n", "abstract": " A method, system, and computer program product for using a digital certificate to access legacy host applications and/or data which are protected by a host-based security system such as RACF (Resource Access Control Facility, a product offered by the IBM Corporation) and which typically require a separate user identification and password. Use of the present invention enables the client to access the host applications and/or data using a single system log on, without requiring modification to host programs.", "num_citations": "50\n", "authors": ["1925"]}
{"title": "Efficiently serving large objects in a distributed computing network\n", "abstract": " Techniques are disclosed for improving the serving of large objects (equivalently, large files) in distributed computing networks which include network-attached storage (“NAS”). Existing features of Hypertext Transfer Protocol (“HTTP”) and of Web server implementations are leveraged to achieve performance improvements in a novel way, and thereby greatly facilitate introduction of the present invention into existing networking environments. In particular, objects meeting certain criteria may be served using “redirect files” in which a redirect status code is used to cause content retrieval requests to be automatically redirected from the requesting client device to the NAS, such that the requested content is served from the NAS rather than through a Web server from a Web server farm.", "num_citations": "50\n", "authors": ["1925"]}
{"title": "Cache management method and system for storing dynamic contents\n", "abstract": " A cache management method and system for storing dynamic contents such as web pages. In a computing environment, a server maintains a cache for temporarily storing dynamic pages. Each of the cached pages is associated with resource information indicating a level of resources used to create the cached page. A newly created page replaces one of the cached pages in the cache if it is less expensive to recreate that cached page than to recreate the newly created page based on the resource information.", "num_citations": "48\n", "authors": ["1925"]}
{"title": "Biometric identification and thermostatic control method and system for temperature-sensitive water delivery in home plumbing systems\n", "abstract": " A method and system for providing temperature-sensitive water delivery using thermostatic controls on home plumbing systems including showers, sinks, and bathtubs. A biometric device is utilized to record user fingerprints and associate the user with a desired temperature setting. An electronic temperature control component is used to accurately specify the desired water temperature for the particular water outlet and a thermostatic gauge is used to determine when the desired temperature is reached. When the desired temperature is reached, then a specified action occurs to display this indication. An output display is used to indicate the fact that the desired temperature has been reached or the flow of water is diverted back to the output of the faucet. The water is routed to an input reservoir until the desired temperature is reached for the purpose of preventing burns or too hot (or cold) water coming out.", "num_citations": "46\n", "authors": ["1925"]}
{"title": "Method, system and program products for distributing portal content processing\n", "abstract": " The present invention generally relates to a method, system and program product for distributing portal content processing. Specifically, a request for portal content is received on a surrogate system and then passed to a portal system. The portal system will obtain and aggregate a first type of the requested content, and then package the aggregated content into a response. The response will also include place holders that correspond to the remaining type of the requested content. The response will then be transmitted to the surrogate system, which will, based upon the place holders, obtain the remaining type of portal content. Once obtained, the remaining type of portal content will replace the place holders in the response, and the response will be rendered for the requesting portal user.", "num_citations": "44\n", "authors": ["1925"]}
{"title": "Method and system for providing device driver configurations on demand\n", "abstract": " A method and system for providing device driver configurations on demand during runtime within a computer system is disclosed. In accordance with a method of the present invention, a Hardware Namespace is constructed by a Hardware Resource Manager and a Logical Device Namespace is constructed by a Logical Device Manager within the computer system. A determination is made as to whether or not the peripheral device is contained within the Hardware Namespace and whether or not a device driver for the peripheral device is also contained within the Logical Device Namespace, in response to a first attempt to access a peripheral device after system boot-up by an application software. In response to a determination that the peripheral device is not contained within the Hardware Namespace, a user is prompted to install the peripheral device within the computer system. On the other hand, in response to …", "num_citations": "44\n", "authors": ["1925"]}
{"title": "Using biometrics on pervasive devices for mobile identification\n", "abstract": " A method, system, and computer program product for using biometrics on pervasive devices for purposes of mobile identification. A biometric device of the prior art is attached to, or incorporated within, a pervasive device. This augmented pervasive device may then be used for capturing biometric information from an arbitrary third party in an arbitrary location. The captured information is analyzed to determine the third party's identification, access rights, etc. as needed by a particular application. This solution capitalizes on the portability and functionality of the pervasive device, as well as its built-in communication capability, to provide an extremely flexible, powerful biometric identification technique at relatively low cost.", "num_citations": "41\n", "authors": ["1925"]}
{"title": "Autonomic program error detection and correction\n", "abstract": " An autonomic system for diagnosing and correcting error conditions among interrelated components and resources. The system can include one or more commonly formatted log files utilizing standardized naming conventions for the interrelated components and resources. Each of the commonly formatted log files can include an association with one of the interrelated components and resources. An autonomic system administrator can be coupled to each of the interrelated components and resources and can be configured to parse the log files to identify both error conditions arising in associated ones of the interrelated components and resources, and also dependent ones of the interrelated components and resources giving rise to the identified error conditions. Preferably, the autonomic system can further include a codebase of analysis code and code insertion logic coupled to the autonomic system administrator …", "num_citations": "40\n", "authors": ["1925"]}
{"title": "Intelligent content placement in a distributed computing network\n", "abstract": " Techniques are disclosed for storing document content in a manner which improves efficiency and/or speed of servicing content requests. Expected and/or observed popularity of stored objects is used to determine where a particular object should be physically placed in a distributed computing network. The disclosed techniques may be used for initially placing objects and/or for subsequently placing objects at different and/or additional locations in the network.", "num_citations": "37\n", "authors": ["1925"]}
{"title": "Pacing method and apparatus\n", "abstract": " Abstract, Yasuteru, Y. et al.,“Significant Reduction of Mitral Regurgitation by Direct His-Bundle Pacing or Right Venticular Outflow Septal Pacing in Comparison with Right Ventricular Apical Pacing in Patients with Chronic Atrial Fibrillation and Mitral Regurgitation.” Bradycardia IV: Pacemaker Implantation Tech niques, Ch. 178 (May 5, 2001).* cited by examiner", "num_citations": "34\n", "authors": ["1925"]}
{"title": "Using build history information to optimize a software build process\n", "abstract": " Methods and systems for optimizing a build order of component source modules comprises creating a dependency graph based on dependency information. Historical build information associated with previous build failures is then used to calculate relative failure factors for paths of the dependency graph; and the relative failure factors are used to determine an order of traversal of the dependency graph during a build process in which component binary modules are built from the component source modules.", "num_citations": "33\n", "authors": ["1925"]}
{"title": "Method, system, service, and computer program product for identifying incorrect domain name to internet protocol (IP) address mappings\n", "abstract": " The present invention provides a method, system, service, and computer program product for identifying incorrect domain name to IP address mappings. The method comprises: providing a domain name and a valid IP address for the domain name to a plurality of nodes; and at each node: performing a local domain name system (DNS) lookup for the domain name; determining if an IP address returned by the local DNS lookup comprises the valid IP address for the domain name; and providing a notification that an invalid IP address was returned for the domain name if the IP address returned by the local DNS lookup does not comprise the valid IP address for the domain name.", "num_citations": "24\n", "authors": ["1925"]}
{"title": "Differentiated storage resource provisioning\n", "abstract": " A method for enforcing a service discrimination policy in a storage system. The service discrimination policy enforcement method can include monitoring load metrics for physical resources required to access content stored within the storage system. A request to access the content stored within the storage system can be received. A corresponding guaranteed service level can be identified from the request. In consequence, a particular one of the physical resources can be selected to service the request based upon a determination that the selected physical resource can service the request while satisfying the guaranteed service level at a load indicated by the monitored load metrics.", "num_citations": "24\n", "authors": ["1925"]}
{"title": "Method, system and computer program product for hierarchical load balancing\n", "abstract": " An improved load balancing method, system, and computer program product handles popular object requests using a front-end cache, and hashing is applied only to the requests in the stream that were not handled by the front-end cache. A cache (eg, a web proxy cache) is placed in front of a Level 7 switch, such that the cache services the popular requests from the cache based on the content of the request (eg, based on the portion of an HTTP request following the domain name). The remaining requests are hashed and then routed to the back-end server. This allows the requests that make it past the cache to still be routed to the back-end server and take advantage of the efficiencies provided therefrom.", "num_citations": "23\n", "authors": ["1925"]}
{"title": "Autonomic service routing using observed resource requirement for self-optimization\n", "abstract": " A method for routing service requests to service instances in a service providing infrastructure is disclosed. A service request is received. Computing resource vectots for at least two service hosts are computed, and each of the service hosts have a corresponding service providing infrastructure. A resource model for the service request is retrieved. The retrieved resource model are matched to each of the resource vectors to identify a best-fit resource vector. The service request is routed to a selected service host associated with the identified best-fit resource vector. Processing of received service requests is monitored. Individual resource components in the service hosts which are consumed during the processing are identified. Resource models for the service requests are produced based upon the identified individual resource components in the service hosts. A time series model is computed for each of the service …", "num_citations": "23\n", "authors": ["1925"]}
{"title": "Authentication for shared wireless peripherals having an internal memory store for sharing digital content across multiple hosts\n", "abstract": " The present solution can authenticate a first host to access a memory space of a shared wireless peripheral communicatively linked to the first host via a bus and a device controller. Digital content displayed within a graphical user interface of the first host can be selected. Either a CUT or COPY clipboard operation can be detected that is conducted from the first host. The selected content can be copied to the memory space of the peripheral. The second host can be authenticated to access a memory space of the peripheral communicatively linked to the second host via a bus and a device controller. A PASTE clipboard operation conducted from the second host can be detected. The selected content obtained from the first host can be conveyed from the memory space of the shared wireless peripheral to a cursor specified location within a graphical user interface of the second host.", "num_citations": "21\n", "authors": ["1925"]}
{"title": "Grid quorum\n", "abstract": " The present invention is a grid quorum system, method and apparatus. In a cluster of resources in a computing grid, a resource locking method can include acquiring a temporally limited lock on a grid service in the computing grid. Upon expiration of the temporally limited lock, a renewal of the temporally limited lock can be requested. Subsequently, the temporally limited lock can be renewed if a renewal has been granted by the grid service in response to the request. Notably, the renewing step can include determining whether the cluster has been partitioned into a plurality of sub-clusters. If the cluster has been partitioned, a parent sub-cluster can be identified and the temporally limited lock can be renewed only if a quorum exists in the parent sub-cluster.", "num_citations": "21\n", "authors": ["1925"]}
{"title": "Workload routing based on greenness conditions\n", "abstract": " Workload requests are routed in response to server greenness conditions. A workload request is received for a remotely invocable computing service executing separately in different remotely and geographically dispersed host computing servers. Greenness conditions pertaining to production or conservation of energy based upon external factors for each of the different remotely and geographically dispersed host computing servers are determined. The workload request is routed to one of the different remotely and geographically dispersed host computing servers based upon the determined greenness conditions.", "num_citations": "20\n", "authors": ["1925"]}
{"title": "Product, method and system for improved computer data processing capacity planning using dependency relationships from a configuration management database\n", "abstract": " The invention discloses a computer data processing capacity planning system that utilizes known workload planning information along with hardware and/or software configuration information from the actual operating environment to accurately estimate the production system capacity available for use in carrying out one or more processing task (s).", "num_citations": "20\n", "authors": ["1925"]}
{"title": "Vehicle assistance\n", "abstract": " A computer is programmed to receive a message from a second vehicle indicating a fault in a second vehicle component. The computer is further programmed to modify an area of control of the first vehicle to include a location of the second vehicle, and to provide a control instruction to the second vehicle.", "num_citations": "17\n", "authors": ["1925"]}
{"title": "Electronic receipt management\n", "abstract": " A receipt management system, method and article of manufacture. The article of manufacture can include a storage medium configured to store receipt data from multiple disparate vendors, communications logic for establishing a communicative link between the system and receipt data processing logic disposed within individual ones of the multiple disparate vendors, and a receipt management processor programmed to moderate access to the storage medium. Importantly, the storage medium can be a portable mass storage device. Notably, each of the storage medium, communications logic and receipt management processor can be disposed in a pervasive device, or in a personal article.", "num_citations": "17\n", "authors": ["1925"]}
{"title": "Using customizable templates to retrieve and display a system configuration topology graph\n", "abstract": " A method, system, and computer program product for implementing a customizable visual configuration (VC) template to retrieve and display a working set of system configuration objects. The computer-implementable method includes selecting a current system configuration object. Once a system configuration object is selected, a VC utility examines all available VC templates. The VC utility displays available VC templates whose starting configuration object matches the selected current system configuration object. In response to a selected VC template, the VC utility retrieves and displays system configuration objects defined by the selected VC template.", "num_citations": "17\n", "authors": ["1925"]}
{"title": "Programmatically allocating memory among competing services in a distributed computing environment\n", "abstract": " Techniques are disclosed for programmatically allocating memory among competing services in a distributed computing environment. Characteristics of web request streams and formulas for cache hit rates and client response times are used to create an objective function for memory allocation, such that maximum benefit can be realized from the memory allocations. When a particular service is allocated more memory, it can store more of its objects in cache, which improves client response time. Optionally, information from service level agreements may be used as input to the memory allocation computations.", "num_citations": "17\n", "authors": ["1925"]}
{"title": "Processing service level agreement (SLA) terms in a caching component of a storage system\n", "abstract": " A method and system for processing Service Level Agreement (SLA) terms in a caching component in a storage system. The method can include monitoring cache performance for groups of data in the cache, each the group having a corresponding SLA. Overfunded SLAs can be identified according to the monitored cache performance. In consequence, an entry can be evicted from among one of the groups which correspond to an identified one of the overfunded SLAs. In one aspect of the present invention, the most overfunded SLA can be identified, and an entry can be evicted from among the group which corresponds to the most overfunded SLA.", "num_citations": "17\n", "authors": ["1925"]}
{"title": "Method, system and program product for managing system resources\n", "abstract": " A method, system and program product for managing system resources. A resource is provisioned for a service based on a demand for the service and one or more attributes of the system. For example, provisioning a resource for the service can be based on the demand for the service as well as a demand for another service sharing the system. The provisioning can be based on any combination of various other attributes of the system along with or instead of the demand for another service.", "num_citations": "17\n", "authors": ["1925"]}
{"title": "Autonomic evaluation of web workload characteristics for self-configuration memory allocation\n", "abstract": " The present invention is a system, method and apparatus for selecting a cache memory allocation to provide an optimized target cache hit rate in a caching component of a content delivery system. The method of the invention can include identifying a current cache size and a contemporaneously experienced trace footprint. A hit rate produced in response to the current cache size and the contemporaneously experienced trace footprint can be determined and a Zipf alpha coefficient can be computed for the current cache size, trace footprint and hit rate. An optimal hit rate can be selected and an optimal cache size for the Zipf alpha coefficient, trace footprint and optimal hit rate can be computed in consequence. Once the optimal cache size has been computed, the cache memory allocation can be modified based upon the optimal cache size.", "num_citations": "16\n", "authors": ["1925"]}
{"title": "Method and system for dynamically translating bus addresses within a computer system\n", "abstract": " A method for dynamically translating bus address within a computer system is disclosed. In accordance with the method and system of the present invention, a computer system has a multiple of buses connected in a hierarchial manner. Information concerning a bus and a device attached to a bus are stored in a Hardware Namespace. In response to a request for an access to a device attached to one of the buses for the first time, a determination is made from the Hardware Namespace as to whether or not there is resource available for the device in a parent bus of the device. If there is resource available in the parent bus for the device, another determination is made from the Hardware Namespace as to whether or not the resource is exclusively allocated in the parent bus for the device. If the resource is exclusively allocated in the parent bus for the device, the device is configured according to the available resource …", "num_citations": "16\n", "authors": ["1925"]}
{"title": "Adaptive edge processing of application data\n", "abstract": " An adaptive data replication and caching system configured for deployment at the network edge. This system can include a data caching system configured to cache application data in a data store and to satisfy queries for application data from the cache. The system also can include a data replication system configured to replicate application data in the data store and to satisfy queries for application data against the replicated application data. Finally, the adaptive data replication and caching system can include a configurator for configuring portions of the data store for exclusive use by the data caching system and the data replication system.", "num_citations": "15\n", "authors": ["1925"]}
{"title": "Device certificate based appliance configuration\n", "abstract": " Embodiments of the present invention address deficiencies of the art in respect to configuring a computing appliance and provide a method, system and computer program product for device certificate based virtual appliance configuration. In one embodiment of the invention, a virtual appliance secure configuration method can be provided. The method can include mounting non-volatile storage to the virtual appliance, retrieving a device certificate from the mounted storage and extracting a signature from the device certificate, activating the virtual appliance in a network domain and acquiring an adapter address and unique identifier for the virtual appliance, and authenticating the signature with the adapter address and unique identifier to ensure a unique active instance of the virtual appliance.", "num_citations": "13\n", "authors": ["1925"]}
{"title": "Network-aware structured content downloads\n", "abstract": " A request for content is received at a content server via a first network connection from a client device. The content includes a set of portions represented within a root document. Based upon a download constraint of at least one portion of the content and a network characteristic of the first network connection, at least one portion of the content is deferred for download over a network connection other than the first network connection. The content is sent with each deferred portion of the content replaced with a content stub within the root document. Each content stub identifies the respective portion of the content as a deferred portion of the content and includes a content identifier of the respective deferred portion of the content.", "num_citations": "13\n", "authors": ["1925"]}
{"title": "Autonomic management of autonomic systems\n", "abstract": " A method for the autonomic management of autonomic systems can include monitoring a managed system and recommending a course of action to be performed in the managed system. It can be determined whether the recommended course of action has been performed by an administrator. Responsive to the determination, it further can be determined whether an outcome from the course of action comports with a predicted outcome. If so, a point count can be changed responsive to a further determination that the outcome from the course of action comports with the predicted outcome. Conversely, the point count can be oppositely changed responsive to a further determination that the outcome from the course of action does not comports with the predicted outcome. In any case, when the point count crosses a threshold value, the management of the managed system can be transitioned to an adaptive component.", "num_citations": "13\n", "authors": ["1925"]}
{"title": "Integrated content management and block layout technique\n", "abstract": " Techniques are disclosed for storing content in distributed computing environments to reduce storage overhead and improve efficiency and/or speed of accessing and delivering the stored content. A content management system (or other authoring system, such as a text editor) supplies hints about dependencies among objects or files, such as which objects are embedded into a web page and which objects are referenced by the web page. These hints are then used when deploying the corresponding files on a storage system, such that the files which are likely to be retrieved together are (preferably) stored together. Optionally, run-time observations by a web server may be used as input to this process to determine how best to store content during a subsequent redeployment.", "num_citations": "12\n", "authors": ["1925"]}
{"title": "The vigilance task and the measurement of attentional deficits\n", "abstract": " Jerison (1967) and other investigators (J. Mackworth, 1970; Bakan, 1966) have contended that certain critical questions about the nature of attention could best be studied by utilizing a vigi-lance paradigm. Jane Mackworth (1970) summarized the literature in which the vigilance task allowed investigation of the physiological-psychological parameters of human attention. Excellent examples of this approach to the study of attention are provided by her work which related vigilance to habituation and levels of arousal, and by the work of Kaider, Spong, and Lindsley (1964) which related vigilance performance to evoked cortical potentials. Norman Mackworth (1950) foresaw the discovery of a relation-ship between attention and vigilance when he observed the simi-larity between monitoring failure and failures of alertness in patients with brain damage. The term “vigilance” was adopted to describe his research primarily because it was the term in current vogue among British neurologists at that time to characterize the dimension of behavior involving arousal and activation. Mackworth applied the term “vigilance” to that dimension of behavior critical to the missing of signals by radar observers. A result of his work was the development of the Mackworth Clock Test (Mackworth, 1950), a vigilance task which simulated the attentiondemanding features of the radar system monitored by the observer. In current vigilance research, the typical vigilance experiment is structurally indistinguishable from many detection or discrimi-", "num_citations": "12\n", "authors": ["1925"]}
{"title": "Creating a virtual machine containing third party code\n", "abstract": " A Virtual Machine (VM) is created utilizing a virtual Operating System (OS) disk and virtual application disks, each of which may be from disparate third party suppliers. One or more files in the virtual application disk are then linked to a specific file system location (node) in the virtual OS disk.", "num_citations": "11\n", "authors": ["1925"]}
{"title": "The effects of distraction and attention deficits among children with learning disabilities on a vigilance task\n", "abstract": " I am deeply indebted to Professor Robert Anderson for his direction of this dissertation and to the other members of my committee, Professors Charles Halcomb and Charles Jones for their helpful criticism. I cim also grateful for the professional assistance of Del Ozolins in conducting the study and Norman Newton for allowing me to utilize his computers at DATA 2000.", "num_citations": "10\n", "authors": ["1925"]}
{"title": "Optimized resource management for map/reduce computing\n", "abstract": " Embodiments of the present invention include a method for resource optimization of map/reduce computing in a computing cluster. The method can include receiving a computational problem for processing in a map/reduce module, subdividing the computational problem into a set of sub-problems and mapping a selection of the sub-problems in the set to respective nodes in a computing cluster, for example a cloud computing cluster, computing for a subset of the nodes in the computing cluster a required resource capacity of the subset of the nodes to process a mapped one of the sub-problems and an existing capacity of the subset of the nodes, and augmenting the existing capacity to an augmented capacity when the required resource capacity exceeds the existing capacity, and when a cost of augmenting the existing capacity to the augmented capacity does not exceed a penalty for breaching a service level …", "num_citations": "9\n", "authors": ["1925"]}
{"title": "Machine learning model for identifying offensive, computer-generated natural-language text or speech\n", "abstract": " Provided is a process that includes: obtaining a training set of n-grams labeled as offensive; causing a machine learning model to be trained based on the training set of n-grams, wherein the machine learning model, when trained, is configured to classify natural language text as offensive or non-offensive; obtaining input natural language text expressing a computer-generated utterance; classifying after causing training, the computer-generated utterance as offensive or non-offensive using the machine learning model; and causing an output to be provided to a recipient, the output being based on whether the machine learning model classifies the computer-generated utterance as offensive or non-offensive.", "num_citations": "8\n", "authors": ["1925"]}
{"title": "Real-time supervised machine learning by models configured to classify offensiveness of computer-generated natural-language text\n", "abstract": " Provided is a process that includes: receiving a computer generated utterance classified as non-offensive by a machine learning model, wherein the machine learning model is configured to classify input text as offensive or non-offensive; obtaining feedback regarding the computer generated utterance, the feedback being indicative of a reaction by an audience to the computer generated utterance; determining and based on the feedback, whether the computer generated utterance is perceived as offensive by the audience; and causing one or more parameters of the machine learning model to be updated based on the computer generated utterance and a result of the determination of whether the computer generated utterance is perceived as offensive by the audience.", "num_citations": "8\n", "authors": ["1925"]}
{"title": "Generating training data from a machine learning model to identify offensive language\n", "abstract": " Provided is a process that includes: obtaining a corpus of unstructured natural language text statements and corresponding responses by responding users, wherein the corresponding responses are responsive natural language text statements or responding-user-expressed scores; obtaining demographic features associated with the responding users; scoring the corresponding responses based on whether the corresponding responses indicate offense to the unstructured natural language text statements to which the corresponding responses correspond in order to form offensiveness scores; forming a training set at least in part by: labeling the unstructured natural language text statements, or n-grams therein, with labels based on the offensiveness scores; and associating the labels with corresponding demographic features of the responding users; and causing a machine learning model to be trained based on …", "num_citations": "8\n", "authors": ["1925"]}
{"title": "Mobility aware cloud provisioning\n", "abstract": " Embodiments of the present invention provide a method, data processing system and computer program product for mobility aware cloud provisioning. In an embodiment of the invention, a method for mobility aware provisioning of access to a service instance executing in a host in a cloud computing can include receiving a request from a mobile computing device for access to a service in a cloud computing environment. Thereafter, an expected path of travel for the mobile computing device can be computed and a particular instance of the service executing in memory of a host in the cloud computing environment can be selected for its proximity to the expected path of travel. Finally, the particular instance of the service can be provisioned for access by the mobile computing device.", "num_citations": "7\n", "authors": ["1925"]}
{"title": "System, method and program product for satisfying a service requirement\n", "abstract": " An intermediary or intermediaries are provided to allow a service requestor to communicate with a service provider according to a service requirement or service policy set forth by the service provider which the service requester is unable to meet directly. To this end, the service requestor determines whether it can communicate with the service provider according to the service requirement. If the service requestor is unable to satisfy the service requirement, but does have some property which is translatable, then the service requestor finds an intermediary that can translate the service requestor's property in order to satisfy the service provider's service requirement. Once the intermediary is found, the service requestor requests translation of its property to satisfy the service provider's service requirement. Thus, the service requestor receives service from the service provider while adhering to the service provider's …", "num_citations": "7\n", "authors": ["1925"]}
{"title": "Method, system and program product for limiting insertion of content between computer programs\n", "abstract": " Under the present invention, one or more isolation zones are defined. Each isolation zone includes one or more computer programs grouped together, and can be defined manually by a user/administrator or automatically based on historical behavior. Once the isolation zone (s) are defined, a security prompt is displayed whenever an attempt is made to insert content across an isolation zone boundary. The security prompt can request confirmation by the user, or it can request a security credential before allowing the attempted content insertion.", "num_citations": "7\n", "authors": ["1925"]}
{"title": "Holistic task scheduling for distributed computing\n", "abstract": " Embodiments of the present invention provide a method for holistic task scheduling in a distributed computing environment. In an embodiment of the invention, a method for holistic task scheduling in a distributed computing environment is provided. The method includes selecting a first task for a first job and a second task for a different, second job, both jobs being scheduled for processing within a node of a distributed computing environment by a task scheduler executing in memory by at least one processor of a computer. The method also can include comparing an estimated time to complete the first and second jobs. Finally, the first task can be scheduled for processing in the node when the estimated time to complete the second job exceeds the estimated time to complete the first job. Otherwise the second task can be scheduled for processing in the node when the estimated time to complete the first job exceeds …", "num_citations": "6\n", "authors": ["1925"]}
{"title": "Network-aware structured content downloads\n", "abstract": " A request for content is sent, using a client device, to a content server through a first network connection. A root document is received from the content server. The root document includes at least one content stub, where each content stub identifies a respective portion of the content as a deferred portion of the content and includes a content identifier of the respective deferred portion of the content. A network connection change to the content server from the first network connection to a second network connection is detected. A determination is made to download at least one deferred portion of the content through the second network connection based upon a configured download constraint assigned to the deferred portion of the content and a network characteristic of the second network connection. The deferred portion of the content identified by the respective content stub is obtained.", "num_citations": "5\n", "authors": ["1925"]}
{"title": "Quality of service (QoS) based planning in web services aggregation\n", "abstract": " Embodiment of the present invention include a method, system and computer program product for a data processing system for QoS based planning in a Web services aggregation. The system can include Web service aggregation and coordination logic configured to identify accessible Web services in a registry and to arrange an aggregation of the Web services for invocation responsive to requests received from communicatively coupled clients over a computer communications network. The system further can include QoS planning logic coupled to the Web service aggregation and coordination logic. The QoS planning logic can be enabled to measure both the individual performance of the Web services in an aggregation of Web services and also the cumulative performance of the aggregation of Web services. Finally, the QoS planning logic can be enabled to modify the aggregation of Web services responsive …", "num_citations": "5\n", "authors": ["1925"]}
{"title": "Shared resources in a docked mobile environment\n", "abstract": " Sharing resources in a docked mobile environment comprises maintaining a set of execution tasks within a first data handling system having a system dock interface to physically couple to a second data handling system and assigning a task to be executed by the second data handling system while the two systems are physically coupled. The described method further comprises detecting a physical decoupling of the first and second data handling systems and displaying an execution result of the task via a first display element of the first data handling system in response to such a detection.", "num_citations": "4\n", "authors": ["1925"]}
{"title": "Network-aware structured content downloads\n", "abstract": " A request for content is received at a content server via a first network connection from a client device. The content includes a set of portions represented within a root document that are each configurable with assigned download constraints that specify network characteristics under which the individual portions of the content are downloadable. A determination to defer at least one portion of the content for download is made based upon a network characteristic of the first network connection not satisfying a configured download constraint assigned to the at least one portion of the content. The root document is sent with each deferred portion of the content replaced with a content stub within the root document. Each content stub identifies the respective deferred portion of the content as a deferred content portion and includes a deferred content portion identifier of the respective deferred portion of the content.", "num_citations": "4\n", "authors": ["1925"]}
{"title": "Optimized resource management for map/reduce computing\n", "abstract": " The present invention includes a method for resource optimization of map/reduce computing in a computing cluster. The method can include receiving a computational problem for processing in a map/reduce module, subdividing the computational problem into a set of sub-problems and mapping a selection of the sub-problems in the set to respective nodes in a computing cluster, for example a cloud computing cluster, computing for a subset of the nodes in the computing cluster a required resource capacity of the subset of the nodes to process a mapped one of the sub-problems and an existing capacity of the subset of the nodes, and augmenting the existing capacity to an augmented capacity when the required resource capacity exceeds the existing capacity, and when a cost of augmenting the existing capacity to the augmented capacity does not exceed a penalty for breaching a service level agreement (SLA …", "num_citations": "4\n", "authors": ["1925"]}
{"title": "Business process community input\n", "abstract": " A community input method can be provided. The method can include receiving from an end user a request to access a portion of a workflow in a business process instance, prompting the end user to provide community input to community documentation for the portion of the workflow, and rendering the community documentation accessible by other end users accessing the portion of the workflow. Optionally, an interval (whether fixed or random) of a number of end users requesting access to the portion of the workflow in the business process instance can be determined, and the end user can be programmatically prompted to provide community input only if the request from the end user is received on the determined interval.", "num_citations": "4\n", "authors": ["1925"]}
{"title": "Position summary: Energy management for server clusters\n", "abstract": " The Internet service infrastructure is a major energy consumer, and its energy demands are growing rapidly. For example, analysts project that 50 million square feet of data center capacity will come on line for third-party hosting services in the US by 2005. These facilities have typical power densities of 100 watts per square foot for servers, storage, switches, and cooling. These new centers could require 40 TWh per year to run 24x7, costing $4 B per year at $100 per MWh; price peaks of $500 per MWh are now common on the California spot market. Generating this electricity would release about 25M tons of new CO2 annually. The central point of this position paper is that energy should be viewed as an important element of resource management for Web sites, hosting centers, and other Internet server clusters. In particular, we are developing a system to manage server resources so that cluster power demand …", "num_citations": "4\n", "authors": ["1925"]}
{"title": "Network-aware structured content downloads\n", "abstract": " A request for content is received at a content server via a first network connection from a client device. The content includes a set of individual portions represented within a root document that are each configurable within the root document with syntactically assigned download constraints that specify network characteristics under which the portions of the content are downloadable. A determination to defer at least one portion of the content for download is made based upon a network characteristic of the first network connection not satisfying a configured download constraint syntactically assigned within the root document to the at least one portion of the content. The root document is sent with each deferred portion replaced with a content stub that each syntactically identifies the respective deferred portion of the content as a deferred content portion and includes a deferred content portion identifier of the respective …", "num_citations": "3\n", "authors": ["1925"]}
{"title": "Holistic task scheduling for distributed computing\n", "abstract": " Embodiments of the present invention provide a method, system and computer program product for holistic task scheduling in a distributed computing environment. In an embodiment of the invention, a method for holistic task scheduling in a distributed computing environment is provided. The method includes selecting a first task for a first job and a second task for a different, second job, both jobs being scheduled for processing within a node a distributed computing environment by a task scheduler executing in memory by at least one processor of a computer. The method also can include comparing an estimated time to complete the first and second jobs. Finally, the first task can be scheduled for processing in the node when the estimated time to complete the second job exceeds the estimated time to complete the first job. Otherwise the second task can be scheduled for processing in the node when the estimated …", "num_citations": "3\n", "authors": ["1925"]}
{"title": "Method and system to detect application non-conformance\n", "abstract": " A method to anticipate and prevent application non-conformance is disclosed. The method includes making available a configuration management database (CMDB) having configuration information of a plurality of system resources and dependency information of a plurality of applications related to the plurality of system resources. The method also includes making available a plurality of rules to establish a plurality of operating conditions that are statistically probable to cause a non-conformance of each system resource of the plurality of system resources, and combining each rule with the CMDB to determine the dependency of each application upon each operating condition. The method proceeds with performing a response action in response to determining that any of the operating conditions are such to cause a statistically probable non-conformance of any of the plurality of applications.", "num_citations": "3\n", "authors": ["1925"]}
{"title": "Confidence based web service application assembly\n", "abstract": " A composite application may be assembled from one or more component services, and at least one component service of the composite application is monitored. A determination is made of a probability of breach for each monitored component service of the composite application and an economic metric of the composite application is computed based upon each determined probability of breach. The economic metric may also consider and expected warranty cost provided to a requestor of the composite application. At least one parameter associated with the composite application or monitored services is then adjusted to maximize overall composite application performance based upon the economic metric.", "num_citations": "3\n", "authors": ["1925"]}
{"title": "Collaborative problem determination based on graph visualization\n", "abstract": " Mapping an application configuration, a network configuration, or both, into a problem/symptom space defining a graphical user interface so as to facilitate problem determination and resolution. Information retrieved from a knowledge base is incorporated into a graphical user interface. The knowledge base stores data pertaining to one or more symptoms of a problem, relationships of symptoms, and actions to be taken for solving the problem. The graphical user interface includes a symptom layer, a collecting layer, and a correcting layer. One or more symptoms are displayed in the symptom layer. One or more symptoms are selected from the graphical user interface. Data are gathered, analyzed, and displayed in the collecting layer in response to the selected one or more symptoms. One or more possible causes are determined for the symptoms. One or more recommended actions to be performed are determined …", "num_citations": "3\n", "authors": ["1925"]}
{"title": "Microcomputer and method for controlling a microcomputer\n", "abstract": " A method for processing a microcomputer having a central processing unit detects an interrupt process. The method disrupts a first task under an execution. Then, the method determines the interrupt process and assigns a second task for the interrupt process. The method sets up a second bank for the second task and executes the second task at the second bank. Further more, the method resumes the first task after executing the second task.", "num_citations": "3\n", "authors": ["1925"]}
{"title": "Model-based adaptive resource provisioning in a web service utility\n", "abstract": " Internet service utilities host multiple server applications on a shared server cluster. A key challenge for these systems is to provision shared resources on demand to meet service quality targets at least cost. This dissertation presents a new approach to utility resource management focusing on coordinated provisioning of cluster resources, including CPU, memory and storage bandwidth. Our approach is model-based: it incorporates internal models of service behavior to predict the value of candidate resource allotments under changing load. The model-based approach enables the system to achieve important resource management goals, including differentiated service quality, performance isolation, improved content caching, and proactive allocation of surplus resources to meet performance goals. This dissertation makes significant steps in adaptive resource provisioning for web service utilities.(1) It presents a …", "num_citations": "3\n", "authors": ["1925"]}
{"title": "Energy management for server clusters\n", "abstract": " Energy Management for Server Clusters | Proceedings of the Eighth Workshop on Hot Topics in Operating Systems ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleProceedingsHOTOS '01Energy Management for Server Clusters ARTICLE Energy Management for Server Clusters Share on Author: Ronald P Doyle profile image R. Doyle View Profile Authors Info & Affiliations Publication: HOTOS '01: Proceedings of the Eighth Workshop on Hot Topics in Operating SystemsMay 2001 35citation 0 Downloads Metrics Total Citations35 Total Downloads0 Last 12 Months0 Last 6 weeks0 Get Citation Alerts New Citation Alert added! This alert …", "num_citations": "3\n", "authors": ["1925"]}
{"title": "Emerging Solutions in Big Data and Cloud Technologies for Mobile Networks\n", "abstract": " With the emergence of the recent internet and mobile technologies, the massive user-generated data has started driving our daily lives. The popularity and wider utilization of Cloud Technologies and Big data have attracted global researchers in solving the complex and heterogeneous real-world problems. The deployment of cloud technologies for big data problems is much helpful in addressing the scalability and security issues. The fusion of the big data and cloud technologies has created new opportunities for the development of effective solutions to the key research domains such as the Internet of Things, health care, travel, smart city, energy, and agriculture. Data analytics, trust management, massive data management are few of the well-established research areas which have gained increased importance over the past years. The technological advancements enrich the creativity of researchers which helps in …", "num_citations": "2\n", "authors": ["1925"]}
{"title": "Computer data processing capacity planning using dependency relationships from a configuration management database\n", "abstract": " The invention discloses a computer data processing capacity planning system that utilizes known workload planning information along with hardware and/or software configuration information from the actual operating environment to accurately estimate the production system capacity available for use in carrying out one or more processing task (s).", "num_citations": "2\n", "authors": ["1925"]}
{"title": "Network aware provisioning in a mobility supporting cloud computing environment\n", "abstract": " Embodiments of the present invention provide a method, system and computer program product for network aware provisioning in a mobility supporting cloud computing environment. In an embodiment of the invention, a method for network aware provisioning in a mobility supporting cloud computing environment is provided. In the method, a request is received from a mobile computing device for access to a service in a cloud computing environment and both an expected path of travel for the mobile computing device and also a network access speed along the expected path of travel is determined. Thereafter, a particular instance of the service executing in a host in the cloud computing environment able to accommodate a degree of interaction between the mobile computing device resulting from the network access speed determined for the expected path of travel is selected. Finally, the particular instance of the …", "num_citations": "2\n", "authors": ["1925"]}
{"title": "Autonomic service routing using observed resource requirement for self-optimization\n", "abstract": " A service request routing system and method includes a model table configured to store resource models. A monitor is coupled to the model table and programmed both to model resource consumption in a service providing infrastructure, and also to store the modeled resource consumption in the model table. A router is coupled to the model table, and the router is programmed to route each service request to a corresponding service instance disposed in an associated service host having a service providing infrastructure. The associated service host includes a grid host in a grid computing system.", "num_citations": "2\n", "authors": ["1925"]}
{"title": "Optimizing greenness\n", "abstract": " A greenness metric is obtained for a plurality of services. The greenness metric of each of the plurality of services are compared. One or more services are determined from the plurality of services based at least in part upon the greenness metric for each of the plurality of services.", "num_citations": "2\n", "authors": ["1925"]}
{"title": "Enforcement of service terms through adaptive edge processing of application data\n", "abstract": " An adaptive data replication and caching system configured to enforce service terms at the network edge. Service terms can include, but are not limited to established quality of service (QoS) terms, as well as the terms of a service level agreement (SLA). This system can include a data caching system configured to cache application data in a data store and to satisfy queries for application data from the cache. The system also can include a data replication system configured to replicate application data in the data store and to satisfy queries for application data against the replicated application data. Finally, the adaptive data replication and caching system can include a configurator for configuring portions of the data store for exclusive use by the data caching system and the data replication system based upon the service terms.", "num_citations": "1\n", "authors": ["1925"]}
{"title": "Hierarchical load balancing\n", "abstract": " Popular object requests are handled using a front-end cache, and hashing is applied only to the requests in the stream that were not handled by the front-end cache. A cache (eg, a web proxy cache) is placed in front of a Level 7 switch and services the popular requests from the cache based on the content of the request (eg, based on the portion of an HTTP request following the domain name). The remaining requests are hashed and then routed to the back-end server. Requests that make it past the cache are still routed to the back-end server. A Level 4 switch is placed in front of a plurality of web proxy caches, each of which are in turn placed in front of a respective Level 7 switch, each of which are connected to a respective server farm, so that incoming web requests are handled on a round robin basis (or other SLB technique) before being sent to the cache.", "num_citations": "1\n", "authors": ["1925"]}
{"title": "Transition between manual management and autonomic management of autonomic systems\n", "abstract": " A method for the autonomic management of autonomic systems can include monitoring a managed system and recommending a course of action to be performed in the managed system. It can be determined whether the recommended course of action has been performed by an administrator. Responsive to the determination, it further can be determined whether an outcome from the course of action comports with a predicted outcome. If so, a point count can be changed responsive to a further determination that the outcome from the course of action comports with the predicted outcome. Conversely, the point count can be oppositely changed responsive to a further determination that the outcome from the course of action does not comports with the predicted outcome. In any case, when the point count crosses a threshold value, the management of the managed system can be transitioned to an adaptive component.", "num_citations": "1\n", "authors": ["1925"]}