{"title": "The situational factors that affect the software development process: towards a comprehensive reference framework.\n", "abstract": " ContextAn optimal software development process is regarded as being dependent on the situational characteristics of individual software development settings. Such characteristics include the nature of the application(s) under development, team size, requirements volatility and personnel experience. However, no comprehensive reference framework of the situational factors affecting the software development process is presently available.ObjectiveThe absence of such a comprehensive reference framework of the situational factors affecting the software development process is problematic not just because it inhibits our ability to optimise the software development process, but perhaps more importantly, because it potentially undermines our capacity to ascertain the key constraints and characteristics of a software development setting.MethodTo address this deficiency, we have consolidated a substantial body of …", "num_citations": "385\n", "authors": ["367"]}
{"title": "Acquiring and Sharing Tacit Knowledge in Software Development Teams: An Empirical Study\n", "abstract": " ContextSharing expert knowledge is a key process in developing software products. Since expert knowledge is mostly tacit, the acquisition and sharing of tacit knowledge along with the development of a transactive memory system (TMS) are significant factors in effective software teams.ObjectiveWe seek to enhance our understanding human factors in the software development process and provide support for the agile approach, particularly in its advocacy of social interaction, by answering two questions: How do software development teams acquire and share tacit knowledge? What roles do tacit knowledge and transactive memory play in successful team performance?MethodA theoretical model describing the process for acquiring and sharing tacit knowledge and development of a TMS through social interaction is presented and a second predictive model addresses the two research questions above. The …", "num_citations": "197\n", "authors": ["367"]}
{"title": "Development of a team measure for tacit knowledge in software development teams\n", "abstract": " In this paper we operationally define and measure tacit knowledge at the team-level in the software development domain. Through a series of three empirical studies we developed and validated the team tacit knowledge measure (TTKM) for software developers. In the first study, initial scale items were developed using the repertory grid technique and content analysis. In Study 2, supplied repertory grids were administered to novices and experts to establish differential items, and Study 3 validated the TTKM on a sample of 48 industrial software development teams. In developing the TTKM we explored the relationships between tacit knowledge, explicit job knowledge and social interaction and their effect on team performance as measured by efficiency and effectiveness. In addition we assess the implications for managing software development teams and increasing team performance through social interaction.", "num_citations": "135\n", "authors": ["367"]}
{"title": "Systems and software engineering standards for very small entities: implementation and initial results\n", "abstract": " Very small entities, organizations with up to 25 people, are very important to the worldwide economy. However it has been established that such companies often do not utilize existing best practice standards and frameworks. To address the needs of Very Small Entities (VSEs), a set of international standards and guides known as ISO/IEC 29110 has been developed. In this paper we present the results of early trials of this standard in an IT start-up and in an engineering enterprise and assess the lessons learnt for future research and industrial usage of this standard.", "num_citations": "75\n", "authors": ["367"]}
{"title": "Ignoring \"Best Practice\": Why Irish Software SMEs are Rejecting CMMI and ISO 9000\n", "abstract": " Software Process Improvement (SPI) \"best practice\" models such as ISO 9000 and the Capability Maturity Model Integrated (CMMI) have been developed to assist software development organisations by harnessing their experience and providing them with support so that they can produce software products on time, within budget and to a high level of quality. However there is increasing evidence that these models are not being adopted by Small and Medium sized Enterprises (SMEs) and primarily remain the remit of large organisations. This paper presents the results of a Grounded Theory study into why Irish SME software product companies are not using these SPI models. The key inhibiting factor found was the issue of cost. We discuss the findings in relation to cost of process and the factors affecting it, including bureaucracy, documentation, communication, tacit knowledge and organisational creativity and flexibility, and the associated impact on the adoption of SPI best practice models.", "num_citations": "64\n", "authors": ["367"]}
{"title": "Time based packet scheduling and sorting system\n", "abstract": " Methods and systems for controlling scheduling in a packet switching node in a network are provided which enable the scheduling of packets from different sources in an earliest deadline first order. The packets are assigned timestamp deadlines and placed in input queues. The timestamps are determined according to maximum delay or minimum throughput quality of service requirements specified for the packets. The packets are scheduled in the earliest deadline first order in an output packet store. The packet closest to its timestamp deadline is selected from the output packet store by using an index.", "num_citations": "48\n", "authors": ["367"]}
{"title": "Evaluating management sentiment towards ISO/IEC 29110 in very small software development companies\n", "abstract": " This paper presents the results of a set of interviews with senior management in a series of very small software development companies, which were conducted to gauge their opinion, attitude and sentiment towards the of new standard, ISO/IEC 29110 Life Cycle Profiles for Very Small Entities (VSEs). This paper serves as a roadmap for both researchers wishing to understand the issues of process standards adoption by very small companies and also for the software process standards community.", "num_citations": "45\n", "authors": ["367"]}
{"title": "Toward an Integrated Conceptualization of the Service and Service System Concepts: A Systemic Approach\n", "abstract": " Service and service systems concepts are fundamental constructs for the development of the emergent SSME, ITSM, and Service Oriented Software (SOS) knowledge streams. A diversified literature has provided a richness of findings, but at the same time, the lack of standardized conceptualizations is a source of confusion to IT practitioners and academics. Given this problematic situation, we pose that a systems approach is useful to address it. In this article, we review and synthesize key studies in these knowledge streams to design:(i) a framework to characterize both concepts under a system view and,(ii) harmonized definitions (eg identification of shared and essential properties) for such fundamental concepts. Our main contribution is scholastic, but we are confident that the posed conceptual artifacts can be further used to elaborate standardized definition for the IT service and IT service system constructs, as …", "num_citations": "40\n", "authors": ["367"]}
{"title": "A compliance analysis of agile methodologies with the ISO/IEC 29110 project management process\n", "abstract": " Software process standards (e.g. ISO/IEC 12207, ISO/IEC 15504) and models (e.g. CMMI) provide a set of best practices and guidelines for improving the quality of the software process and products resulting from that process. However, they do not prescribe a particular software development methodology (i.e. RUP, MSF), and thus software development teams face a compliance problem between the selected development methodology and a pursued particular standard or model. In this research, the particular issue of compliance of Agile Software Development Methodologies (SCRUM, XP, and UPEDU) and the new ISO/IEC 29110 standard is studied. Because the new standard is focused on the software process in very small software development companies or small software project teams in the range from 1 to 25 people, and the Agile Software Development Methodologies (ASDMs) are primarily for same …", "num_citations": "39\n", "authors": ["367"]}
{"title": "Using grounded theory coding mechanisms to analyze case study and focus group data in the context of software process research\n", "abstract": " The primary aim of this chapter is to outline a potentially powerful framework for the combination of research approaches utilizing the Grounded Theory coding mechanism for Case Study, and Focus Groups data analysis. A secondary aim of this chapter is to provide a roadmap for such a usage by way of an example research project. The context for this project is the need to study and evaluate the actual practice of software development processes in real world commercial settings of software companies, which utilized both case study and focus group techniques. This research found that grounded theory coding strategies are a suitable and powerful data analysis mechanism to explore case study and focus group data.", "num_citations": "39\n", "authors": ["367"]}
{"title": "An extensive review of IT service design in seven international ITSM processes frameworks: Part I\n", "abstract": " An IT service design process is considered to be a fundamental piece of the seven key international IT Service Management (ITSM) processes frameworks (ITIL v2, ITIL v3 (and ITIL v2011), ISO 20000-4, CobIT 4.0, CMMI-SVC, MOF 4.0, and ITUP). Nevertheless the availability of IT service design processes, few–if any-descriptive-comparative studies among them have been reported. Thus, in this paper (Part I), we address this knowledge gap. An extensive descriptive-comparative review of seven IT service design processes in aforementioned frameworks is reported. Fundamental concepts (viz., design as noun, design as verb, service, service system, IT service, IT service system, and IT service architecture design) are analyzed by using a Systems Approach. Our findings indicate that the frameworks ITIL v2, ISO/IEC 20000 and Cobit 4.0 are using weak systemic concepts, while the frameworks ITIL v3, CMMI-SVC …", "num_citations": "38\n", "authors": ["367"]}
{"title": "Exploring the impact of situational context—a case study of a software development process for a microservices architecture\n", "abstract": " Over the decades, a variety of software development processes have been proposed, each with their own advantages and disadvantages. It is however widely accepted that there is no single process that is perfectly suited to all settings, thus a software process should be molded to the needs of its situational context. In previous work, we have consolidated a substantial body of related research into an initial reference framework of the situational factors affecting the software development process. Practitioners can consult this framework in order to profile their context, a step necessary for effective software process decision making. In this paper, we report on the findings from a case study involving process discovery in a small but successful and growing software development firm. In this organization, which has a focus on continuous software evolution and delivery, we also applied the situational factors reference …", "num_citations": "33\n", "authors": ["367"]}
{"title": "Access to health care for disabled people: a systematic review\n", "abstract": " The objective of this paper was to systematically review published studies to determine if disability limits access to health care and to attempt to identify what body functions, structures and activities and participation, as well as contextual factors (environmental and personal factors), interact with the health condition to limit this access. The AMED, CINAHL, EMBASE, Medline and psychINFO databases were searched for original study articles in English, dating from 1974 to 2008. Review articles and expert opinion were excluded. Each study had two independent reviews by either a general practitioner or specialist in rehabilitation medicine. Each study was critically appraised according to the National Service Framework for Long‐term Conditions (Department of Health, 2005a) methodology and recorded on standardised data extraction sheets. Studies of poor quality were excluded. Sixty studies were included. No …", "num_citations": "33\n", "authors": ["367"]}
{"title": "Mobile user identification and tracking for load balancing in packet processing systems\n", "abstract": " Systems and methods are disclosed for mobile user identification and tracking for load balancing in packet processing systems. Packet processing systems, such as network tool optimizer (NTO) systems, are configured to receive packets associated with multiple mobile users, to extract user identification information from the packets, to store identity binding information for the mobile users, to track changes in identification information for mobile users within a communication system by analyzing control information within packets for the communication system, and to forward packets to one or more tool ports associated with the packet processing system. The packet processing systems disclosed thereby allow for user packets to be identified and sent to the same load-balanced network tool, even though the user identification information changes over time within the communication system. The disclosed …", "num_citations": "32\n", "authors": ["367"]}
{"title": "An IT service engineering and management framework (ITS-EMF)\n", "abstract": " There is a rich amount of literature on services from Information Technology (IT)(Management view) and IT System Engineering (ITSE)(Engineering view) domains. However, such a variety has produced disparate views. Furthermore, given that IT and ITSE service-based systems must be linked to business services (the User view), conceptual interrelationships are increased, causing yet more diversity. This paper identifies that this generates a lack of theoretical conceptual cohesion and leads to multiple practical confusions. To address these issues and to reduce such conceptual gaps, an IT Service Engineering and Management Framework (ITS-EMF) is proposed. ITS-EMF is generated by careful review and examination of the main conceptualizations on IT, ITSE and business services. The paper claims that ITS-EMF is useful for:(1) mapping services concepts from disparate IT literature,(2) reducing service …", "num_citations": "31\n", "authors": ["367"]}
{"title": "Design and testing of a national pollinator and pollination monitoring framework\n", "abstract": " Final summary report to the Department for Environment, Food and Rural Affairs (Defra), Scottish Government and Welsh Government: Project WC1101.", "num_citations": "30\n", "authors": ["367"]}
{"title": "Lessons from a pilot implementation of ISO/IEC 29110 in a group of very small Irish companies\n", "abstract": " This paper presents an overview of a pilot implementation of the ISO/IEC 29110 standard, with a group of very small software development companies based in Ireland. This paper may serve as guidance for both researchers and practitioners wishing to understand the issues of process standards adoption by very small companies and ISO/IEC 29110 in particular.", "num_citations": "28\n", "authors": ["367"]}
{"title": "Pre-sorter systems and methods for distributing GTP packets\n", "abstract": " Pre-sorter systems and methods are disclosed for distributing GTP packets. The pre-sorter forwards GTP packets based upon entries within one or more pre-sort tables, and the entries associate F-TEIDs with output ports that can be coupled to GTP sessions controllers and/or other external systems. The F-TEIDs represent a combination of a destination IP address and a tunnel endpoint identifier (TEID) for each GTP packet. For some embodiments, GTP session controllers analyze the GTP packets and determine F-TEIDs that are created, modified, and/or dropped for user sessions, and the GTP session controllers send control messages to the pre-sorter to determine the entries stored within the pre-sort table (s). For other embodiments, other external systems such as network monitoring tools are coupled to the GTP packet pre-sorter rather than GTP session controllers. Pre-sorters having multiple pre-sort modules …", "num_citations": "27\n", "authors": ["367"]}
{"title": "The strengths and weaknesses of software architecture design in the RUP, MSF, MBASE and RUP-SOA methodologies: A conceptual review\n", "abstract": " The importance of Software Architecture (SA) design has been acknowledged as a very important factor for a high-quality software development. Different efforts in both industry and academia have produced multiple system development methodologies (SDMs) that include SA design activities. In addition, standardization bodies have defined different recommendations regarding Software Architecture design. However, in industry Software Architecture best practices are currently poorly employed. This fact constrains the benefits that industry can potentially obtain from Software Architecture design in software development. In this paper, we analyze the degree to which the four main recognized SDMs — RUP (Rational Unified Process), MSF (Microsoft Solutions Framework), MBASE (Model-Based System Architecting and Software Engineering), and RUP-SOA (Rational Unified Process for Service-oriented …", "num_citations": "26\n", "authors": ["367"]}
{"title": "An Extensive Review of IT Service Design in Seven International ITSM Processes Frameworks: Part II\n", "abstract": " The main international IT Service Management processes frameworks (ITIL v2, ISO/IEC 20000, COBIT 4.0, CMMI-SVC, MOF 4.0, and ITUP) include the design of IT services as part of their main best practices. However, despite having a common purpose and conceptual structure, they are organized differently. Hence, ITSM academic researchers and practitioners need to integrate a broad and diverse literature in relation to these frameworks. In Part I of this research, the authors pursued the goal of a descriptive-comparative analysis of fundamental concepts and IT service architecture design models used in the seven ITSM frameworks. In this paper (Part II) we complete this systemic analysis by using the ISO/IEC 15288 systems engineering standard and focusing on the IT design processes and practices reported in the aforementioned ITSM frameworks. Specifically, CMMI-SVC and ITUP are assessed in overall as …", "num_citations": "24\n", "authors": ["367"]}
{"title": "Using agents for distributed software project management\n", "abstract": " The paper explores the role of artificial intelligence techniques in the development of an enhanced software project management tool, which takes account of the emerging requirement for support systems to address the increasing trend towards distributed multi-platform software development projects. In addressing these aims this research devised a novel architecture and framework for use as the basis of an intelligent assistance system for use by software project managers, in the planning and managing of a software project. This paper also describes the construction of a prototype system to implement this architecture and the results of a series of user trials on this prototype system.", "num_citations": "21\n", "authors": ["367"]}
{"title": "Software Engineering Standards and Guides for Very Small Entities: Implementation in two start-ups\n", "abstract": " Very small entities, enterprises, organizations, projects or departments with up to 25 people, are very important to the worldwide economy. However it has ben established that such entities often do not utilize existing standards and frameworks. To address the needs of Very Small Entities (VSEs), a set of international standards and guides known as ISO/IEC 29110 has been developed. In this paper we present the results of early trials of this standard in two IT start-ups VSEs. A Peruvian VSE was recently audited and issued an ISO/IEC 29110 certificate of conformity.", "num_citations": "20\n", "authors": ["367"]}
{"title": "Assessing the value of an agile coach in agile method adoption\n", "abstract": " This paper explores the value of Agile Coaching for companies adopting agile methods.in order to assist those who are adopting agile methods to decide on using or not using an Agile Coach by examining the value they can bring to companies adopting agile methods. In our research we surveyed three distinct groups: companies that used an Agile Coach for agile adoption, companies that adopted agile on their own and Agile Coaches themselves without the help of an Agile Coach. The data collected indicates that Agile Coaches can bring numerous benefits to companies, which in fact exceed the financial costs of using an Agile Coach. Therefore we suggest that there is financial value in using an Agile Coach for agile adoption, which is represented by faster return on investment (ROI) on the change.", "num_citations": "19\n", "authors": ["367"]}
{"title": "Software Process Improvement: 16th European Conference, EuroSPI 2009, Alcaba (Madrid), Spain, September 2-4, 2009, Proceedings\n", "abstract": " This textbook is intended for SPI (software process improvement) managers and-searchers, quality managers, and experienced project and research managers. The papers constitute the research proceedings of the 16th EuroSPI (European Software Process Improvement, www. eurospi. net) conference held in Alcala (Madrid region), September 2–4, 2009, Spain. Conferences have been held since 1994 in Dublin, 1995 in Vienna (Austria), 1997 in Budapest (Hungary), 1998 in Gothenburg (Sweden), 1999 in Pori (Finland), 2000 in Copenhagen (Denmark), 2001 in Limerick (Ireland), 2002 in Nuremberg (G-many), 2003 in Graz (Austria), 2004 in Trondheim (Norway), 2005 in Budapest (Hungary), 2006 in Joensuu (Finland), 2007 in Potsdam (Germany), 2008 in Dublin (Ireland), and 2009 in Alcala (Spain). EuroSPI established an experience library (library. eurospi. net) which will be conti-ously extended over the next few years and will be made available to all attendees. EuroSPI also created an umbrella initiative for establishing a European Qualification Network in which different SPINs and national initiatives join mutually beneficial collaborations (ECQA–European Certification and Qualification Association, www. ecqa. org). With a general assembly during October 15–16, 2007 through Euro-SPI partners and networks, in collaboration with the European Union (supported by the EU L-nardo da Vinci Programme) a European certification association has been created (www. eu-certificates. org, www. ecqa. org) for the IT and services sector to offer SPI knowledge and certificates to industry, establishing close knowledge transfer links between …", "num_citations": "19\n", "authors": ["367"]}
{"title": "Egress port overload protection for network packet forwarding systems\n", "abstract": " Systems and methods are disclosed to provide egress port overload protection for network packet forwarding systems. Input packets are received at one or more ingress ports and load balanced among a plurality of egress ports for the packet forwarding system. Load balanced packets associated with each egress port are then sampled to generate sampled load balanced packets that are output from the egress port. For certain embodiments, a sampling percentage is used for the packet sampling, and the sampling percentage for each egress port is set based upon a comparison of a current traffic rate for the egress port to a threshold rate for the egress port. The threshold rates for the egress ports are allowed to be configured through a user interface. Further, session and non-session traffic can be identified, and session aware load balancing and/or per-port packet sampling can be applied.", "num_citations": "18\n", "authors": ["367"]}
{"title": "Exploring the use of the cynefin framework to inform software development approach decisions\n", "abstract": " Choosing an appropriate software development process is a complex and challenging task, exacerbated by the fact that all process models require a certain amount of tailoring to fit to the business environment of any specific organization in which the model is to be deployed. This position paper proposes that one of the potentially most significant factors impacting how a team should structure their software development process is domain (contexts defined by the nature of the relationship between cause and effect) the team is in, an approach pioneered by Snowden with The Cynefin Framework. Cynefin (pronounced Ku-nev-in) is a decision framework that recognizes the causal differences that exist between different types of systems and proposes new approaches to decision making in complex social environments and new mechanisms of understanding levels of complexity as decisions are made. It is argued that …", "num_citations": "18\n", "authors": ["367"]}
{"title": "Towards an understanding of game software development processes: A case study\n", "abstract": " This paper aims to fill the gap that exists about software development processes in game development in the research literature, and address the gap in the research literature by investigating and reporting information about the software development processes used in game development. To investigate the role of the software development process in relation to the game development process, and to better understand the processes and practices used in game software development, a single industrial based case study was undertaken and reported to investigate in a real world context the software development processes and practices used in game development. This research contributes to our knowledge of the field of game development and potentially forms the foundation for further research in the area.", "num_citations": "17\n", "authors": ["367"]}
{"title": "Early stage adoption of ISO/IEC 29110 software project management practices: A case study\n", "abstract": " The ISO/IEC 29110 standard has at its core a Management and Engineering Guide [1] which are targeted at very small entities (enterprises, organizations, departments or projects) having up to 25 people [2], to assist them unlock the potential benefits of using standards which are specifically designed to address their needs. This paper discusses the role and structure of Project Management in the ISO/IEC 29110 standard and the design and development of project management support documentation. In particular this paper describes a case study of an early adopter of ISO/IEC 29110 project management practices and their experiences with implementing these in an industrial context.", "num_citations": "17\n", "authors": ["367"]}
{"title": "Systems, Software and Services Process Improvement: 21st European Conference, EuroSPI 2014, Luxembourg, June 25-27, 2014. Proceedings\n", "abstract": " This volume constitutes the refereed proceedings of the 21st EuroSPI conference, held in Luxembourg, in June 2014. The 18 revised papers presented together with 11 invited papers in this volume were carefully reviewed and selected. They are organized in topical sections on SPI and very small entities; process improvement frameworks; testing and improvement issues; SPI and people issues; SPI and quality issues; software processes in various contexts. The volume also contains selected keynote papers from EuroSPI workshops and invited papers covering the topic of creating environments supporting innovation and improvement.", "num_citations": "16\n", "authors": ["367"]}
{"title": "An overview of models and standards of processes in the SE, SwE and IS disciplines\n", "abstract": " This chapter develops a descriptive-conceptual overview of the main models and standards of processes formulated in the systems engineering (SE), software engineering (SwE) and information systems (IS) disciplines. Given the myriad of models and standards reported, the convergence suggested for the SE and SwE models and standards and the increasing complexity of the modern information systems, we argue that these ones become relevant in the information systems discipline. Firstly, we report the rationale for having models and standards of processes in SE, SwE and IS. Secondly, we review their main characteristics. Thirdly, based on the identified aims and principles, we report and posit the concepts of process, system and service as conceptual building blocks for describing such models and standards. Finally, initial theoretical and practical implications for the information systems discipline of such …", "num_citations": "16\n", "authors": ["367"]}
{"title": "Quality assurance in vocational education: Meeting the needs of the nineties\n", "abstract": " The skills base of the workforce in Australia is critical in setting the foundations for micro‐ and macro‐economic resurgence and, consequently, in making the nation internationally competitive. The significance of the quality movement is therefore gaining recognition in vocational education. As with industry, quality is seen as critical and quality assurance is being demanded in skilling the workforce. This paper describes vocational training as a process and depicts how quality can be assured in every aspect of the process. It presents a practical approach to quality assurance in vocational education. In addition, it emphasises the need for a continuous management commitment for the successful implementation of quality assurance in vocational education. The paper describes how the concept of quality assurance can be used to improve the standards of vocational training. It also emphasises that now is the …", "num_citations": "16\n", "authors": ["367"]}
{"title": "Vegetation recovery and fuel reduction after seasonal burning of western juniper\n", "abstract": " The decrease in fire activity has been recognized as a main cause of expansion of North American woodlands. Piñon-juniper habitat in the western United States has expanded in area nearly 10-fold since the late 1800s. Woodland control measures using chainsaws, heavy equipment, and prescribed fire are used to restore sagebrush steppe plant communities. We compared vegetation recovery following cutting and prescribed fire on three sites in late Phase 2 (mid succession) and Phase 3 (late succession) western juniper (Juniperus occidentalis Hook.) woodlands in southeast Oregon. Treatments were partial cutting followed by fall broadcast burning (SEP); clear-cut and leave (CUT); and clear-cut and burn in early winter (JAN), late winter (MAR), and spring (APR); and untreated controls. Cover and density of herbaceous, shrub, and tree layers were measured. Five years after treatment, perennial bunchgrasses dominated two sites and co-dominated, with invasive annual grasses, at one site. Except for Sandberg blue-grass (Poa secunda J. Presl), cover and density of bunchgrasses, perennial and annual forbs, and annual grasses increased following treatments at all three sites and were greater than in controls. At each site, shrub, herbaceous, and ground cover response variables equalized or had begun to converge among treatments during the fourth or fifth year following application. SEP and APR treatments were mostly effective at reducing fuel sizes up to and including 1000-hr fuels while JAN and MAR treatments only consumed 1-hr and 10-hr fuels. Winter burning treatments (JAN, MAR) and the CUT treatments did not kill small …", "num_citations": "14\n", "authors": ["367"]}
{"title": "Exploring the role of usability in the software process: A study of Irish software SMEs\n", "abstract": " This paper explores the software processes and usability techniques used by Small and Medium Enterprises (SMEs) that develop web applications. The significance of this research is that it looks at development processes used by SMEs in order to assess to what degree usability is integrated into the process. This study seeks to gain an understanding into the level of awareness of usability within SMEs today and their commitment to usability in practice. The motivation for this research is to explore the current development processes used by SMEs in developing web applications and to understand how usability is represented in those processes. The background for this research is provided by the growth of the web application industry beyond informational web sites to more sophisticated applications delivering a broad range of functionality. This paper presents an analysis of the practices of several Irish …", "num_citations": "13\n", "authors": ["367"]}
{"title": "Process models of SDLCs: comparison and evolution\n", "abstract": " The software engineering discipline has developed the concept of software process to guide development teams towards a high-quality end product to be delivered on-time and within the planned budget. Consequently, several software-systems development life-cycles (PM-SDLCs) have been theoretically formulated and empirically tested over the years. In this chapter, a conceptual research methodology is used to review the state of the art on the main PM-SDLCs formulated for software-intensive systems, with the aim to answer the following research questions:(a) What are the main characteristics that describe the PM-SDLCs?,(b) What are the common and unique characteristics of such PM-SDLCs?, and (c) What are the main benefits and limitations of PM-SDLCs from a viewpoint of a conceptual analysis? This research is motivated by a gap in the literature on comprehensive studies that describe and compare …", "num_citations": "13\n", "authors": ["367"]}
{"title": "Design methods for software architectures in the service‐oriented computing and cloud paradigms\n", "abstract": " The design of the system architecture has been a critical and relevant activity in the systems engineering discipline from several decades for the design of physical man-made systems [1]. However, a reduced set of design methods and complementary decision-making techniques have been consistently used with successful results [2–4].", "num_citations": "9\n", "authors": ["367"]}
{"title": "Technology enabled continuous software development\n", "abstract": " Given that organizations need to innovate and release software in faster parallel cycles of days or even hours, there are good reasons why new practices are being adopted in industry. In this paper, we present the case of a highly responsive process that is driven by tooling technology and which facilitates continual delivery of software at up to hourly intervals. Understanding and analyzing such industry practices can inform academic and practitioner dialogue on current challenges and potential solutions, and on the evolution of new'better'practices.", "num_citations": "9\n", "authors": ["367"]}
{"title": "Social interaction, team tacit knowledge and transactive memory: empirical support for the agile approach\n", "abstract": " The agile principles of social interaction and tacit knowledge were examined in this survey study of 48 software development teams. It was proposed that that team tacit knowledge is created through frequency and quality of social interactions and through the development of a transactive memory system. Results supported the hypothesis with quality of social interaction playing a greater role than transactive memory in the creation of team tacit knowledge, although transactive memory did not mediate the relationship. This study provides empirical support for the cognitive processes involved in tacit knowledge creation, which underlies the agile approach to software development.", "num_citations": "9\n", "authors": ["367"]}
{"title": "Systems, Software and Services Process Improvement: 18th European Conference, EuroSPI 2011, Roskilde, Denmark, June 27-29, 2011, Proceedings\n", "abstract": " This volume constitutes the refereed proceedings of the 18th EuroSPI conference, held in Roskilde, Denmark, in June 2011. The 18 revised full papers presented together with 9 key notes were carefully reviewed and selected. They are organized in topical sections on SPI and assessments; SPI and implentation; SPI and improvement methods; SPI organization; SPI people/teams; SPI and reuse; selected key notes for SPI implementation.", "num_citations": "9\n", "authors": ["367"]}
{"title": "Impacts of electronic process guides by types of user: An experimental study\n", "abstract": " The design and utilization of Electronic Process Guides (EPGs) have been studied in Software Engineering (SwE) since the 1990s. However, the empirical findings from surveys, case studies, and experiments on the beneficial effects of their utilization are still lacking. Thus, we suggest that further research on the utilization of EPGs is required. In this study, we are interested in gaining insights on the effects of using EPGs on objective metrics (learning score, time effort) and subjective metrics (perceived usefulness, ease of use, and value), by comparing three EPG designs (a simple PDF-based EPG, a normal HTML-based EPG, and a sophisticated Java-based EPG) with different blocks of experimental subjects (practitioners, academicians, novices, and experts). To this end, we have conducted a controlled experiment with a sample of international participants in the domain of IT Service Management. We found that …", "num_citations": "8\n", "authors": ["367"]}
{"title": "Process assessment issues in a bachelor capstone project\n", "abstract": " Based on a small subset of ISO/IEC 15504:2006, a Process Assessment was performed in the capstone project of a Bachelor in Computer Science. Parallel to this assessment, students performed a continuous self-assessment using an ability model based on 15504 Base Practices and Work Products. This paper highlights how students' self-assessment and teacher's assessment are correlated. The capstone project itself implements major constructivism principles. This paper presents also the students' point of view through different questionnaires and students' participation to the paper.", "num_citations": "8\n", "authors": ["367"]}
{"title": "On project management process in agile systems development methodologies and the ISO/IEC 29110 standard (entry profile)\n", "abstract": " The use of ISO/IEC systems and software engineering standards is recommended for software development organizations. In particular, in 2011, a new software process standard was released for Very Small Entities (VSEs): ISO/IEC 29110. Furthermore, the Agile-based System Development Methodologies (SCRUM, XP, Crystal, among others) have also gained interest by organizations. In this - in progress- research, we present an overview of the ISO/IEC 29110 standard, as well as of the Agile-based SDMs, and propose that such SDMs can be enhanced with recommendations from the ISO/IEC standard. In particular, we focus on the Project Management process – one of the two essential processes in the ISO/IEC 29110 standard – and its potential support through a Deployment Package (DP). A DP can be considered an electronic process guideline, and it is attempted to facilitate the implementation of the standard in a VSE.", "num_citations": "8\n", "authors": ["367"]}
{"title": "An analysis of the software development processes of open source e-learning systems\n", "abstract": " In recent years there has been a rapid increase in demand for e-learning systems. The software development process plays a crucial role in the design and development of a high-quality e-learning system. However, to date, there is no comprehensive comparative study of open source software (OSS) development process for different OS e-learning systems. This hinders the development of a generalized OSS development process, a key requisite for rapidly developing high-quality OS e-learning systems. This paper provides a full analysis of different existing and successful OS e-learning software systems and the best practices followed in the e-learning development. In particular, this paper investigates the software development activities of Moodle, Dokeos and ILIAS. An activity flow representation that describes their current development practices is constructed individually for all three OS e-learning …", "num_citations": "8\n", "authors": ["367"]}
{"title": "Systems, Software and Services Process Improvement: 17th European Conference, EuroSPI 2010, Grenoble, France, September 1-3, 2010. Proceedings\n", "abstract": " A typical characterization of EuroSPI is reflected in a statement made by a c-pany:“... the biggest value of EuroSPI lies in its function as a European knowledge and experience exchange mechanism for SPI and innovation.” Since its beginning in 1994 in Dublin, the EuroSPI initiative has outlined that there is not a single silver bullet to solve SPI issues, but that you need to understand a c-bination of different SPI methods and approaches to achieve concrete benefits. The-fore each proceedings volume covers a variety of different topics, and at the conf-ence we discuss potential synergies and the combined use of such methods and-proaches. These proceedings contain selected research papers for five topics: Section I: SPI Tools Section II: SPI Methods Section III: SPI in SMEs Section IV: Economic Aspects of SPI Section V: The Future of SPI Section I presents studies on SPI tools. The authors provide an insight into new tools which can be used for SPI. Willem Bekkers et al. present a new assessment method and tool for software product management. Ismael Edrei-Espinosa-Curiel et al. illustrate a graphical approach to support the teaching of SPI. Paul Clarke and coworkers deal with an analysis and a tool to help real adoption of standards like ISO 12207 and they focus on SPI implementation and practices. Esparanca Amengual et al. present a new team-based assessment method and tool.", "num_citations": "8\n", "authors": ["367"]}
{"title": "A comparison of intrapartum care in four maternity units\n", "abstract": " This study presents a comparison of the intrapartum care of women suitable for midwifery-led care in four neighbouring maternity units. The computerized maternity data were systematically reduced to exclude: previous medical history; multiple pregnancies; present pregnancy abnormalities; previous operative or instrumental deliveries; inductions and elective caesarean sections; as well as home births. The differences in ethnic distribution led to the exclusion of non-Caucasian women. This meant that out of an initial 12856 women 4203 cases remained. The rates of normal, instrumental deliveries and caesarean sections were compared in association with the use of augmentation of labour, electronic fetal monitoring and epidural analgesia. There were major differences between the four units in the rates of these three interventions. A higher rate of intervention was associated with higher rates of instrumental …", "num_citations": "8\n", "authors": ["367"]}
{"title": "A general class of the three-variable unified Apostol-type q-polynomials and multiple power q-sums\n", "abstract": " The main purpose of this article is to introduce a general class of the three-variable unified Apostol-type q-polynomials and to investigate their properties and characteristics. In particular, the generating function, series expression, and several explicit and recurrence relations for these polynomials are established. The three-variable general Apostol–Bernoulli, Apostol–Euler, and Apostol–Genocchi q-polynomials are studied as special members of this class and the corresponding results for these q-polynomials are also obtained. Some symmetry identities involving multiple power q-sums are established. The particular cases of these identities are also deduced. This article presents the first attempt in the direction of establishing symmetry identities for the generalized class of q-polynomials.", "num_citations": "7\n", "authors": ["367"]}
{"title": "A comparative analysis of prophylactic antimicrobial use in long-term care facilities in Ireland, 2013 and 2016\n", "abstract": " Background Long-term care facilities (LTCFs) are important locations of antimicrobial consumption. Of particular concern is inappropriate prescribing of prophylactic antimicrobials. Aim We aimed to explore factors related to antimicrobial prophylaxis in LTCFs in Ireland. Methods The point prevalence surveys of Healthcare-Associated Infections in Long-Term Care Facilities (HALT) were performed in Ireland in May 2013 and 2016. Data were collected on facility (type and stewardship initiatives) and resident characteristics (age, sex, antimicrobial and indication) for those meeting the surveillance definition for a HAI and/or prescribed an antimicrobial. Results In 2013, 9,318 residents (in 190 LTCFs) and in 2016, 10,044 residents (in 224 LTCFs) were included. Of the 10% of residents prescribed antimicrobials, 40% were on prophylaxis, most of which was to prevent urinary tract infection. The main prophylactic agents …", "num_citations": "7\n", "authors": ["367"]}
{"title": "A Means-Ends Design of SCRUM+: an agile-disciplined balanced SCRUM enhanced with the ISO/IEC 29110 Standard\n", "abstract": " Agile systems development methodologies (ASDMs) have gained high acceptance in very small entities (VSEs) of software development seeking quality at minimal effort. SCRUM and XP in industrial settings and UPEDU in academic ones are main of them. Similarly, Software Process Improvement (SPI) initiatives promote the utilization of process frameworks and standards. However, despite both worlds (i.e. ASDMs and SPI) pursue a shared end of high-quality software, both are separated by different underlying approaches. We consider that ASDMs can get benefits from SPI through controlled enhancements (i.e. an agile-discipline balance) without elimination of agility. Thus, in this research, we report the design of SCRUM+, an enhanced SCRUM with recommendations on roles, activities-tasks and artifacts from the SPI standard ISO/IEC 29110. SCRUM+ was designed by using a Means-Ends analysis …", "num_citations": "7\n", "authors": ["367"]}
{"title": "An objective compliance analysis of project management process in main agile methodologies with the ISO/IEC 29110 entry profile\n", "abstract": " Software Process Improvement efforts (SPI) are pursued by organizations for improving the overall quality of their software development processes. However, very small entities (VSEs) avoid them by the lack of required financial and other organizational resources. In contrast, VSEs use agile software development methodologies (ASDMs), but these ASDMs do not foster adherence to best scholastic practices promoted by SPI. Furthermore, while a new ISO/IEC standard (29110) has been recently released for VSEs, it was not designed taking account the ASDM approaches. Thus, we investigate the extent of adherence of main ASDMs (two industrial and one academic type) with this new standard. Initial results provide evidence on the strong need to enhance the two industrial ASDMs (XP and SCRUM). In contrast, the academic ASDM (UPEDU) fits the standard very well but it is scarcely used by VSEs. Hence, it is …", "num_citations": "7\n", "authors": ["367"]}
{"title": "Software Process Improvement and Capability Determination: 11th International Conference, SPICE 2011, Dublin, Ireland, May 30 - June 1, 2011. Proceedings\n", "abstract": " This book constitutes the refereed proceedings of the 11th International Conference on Software Process Improvement and Capability Determination, SPICE 2011, held in Dublin, Ireland, in May/June 2011. The 15 revised full papers presented and 15 short papers were carefully reviewed and selected from numerous submissions. The papers are organized in topical sections on process modelling and assessment, safety and security, medi SPICE, high maturity, implementation and improvement.", "num_citations": "7\n", "authors": ["367"]}
{"title": "Systems, software and services process improvement\n", "abstract": " This volume constitutes the refereed proceedings of the 17th EuroSPI conference in Grenoble, France, during September 1-3. The 18 revised full papers presented together with 8 key notes were carefully reviewed and selected. They are organized in topical sections on SPI Tools, SPI Methods, SPI in SMEs, SPI and Economic Aspects as well as Future of SPI. This textbook is intended for the use by SPI (Software Process Improvement) managers and researchers, quality managers, and experienced project and research managers.", "num_citations": "7\n", "authors": ["367"]}
{"title": "Towards an Understanding of Team Dynamics in Very Small Enterprises: An Exploratory Study in Software\n", "abstract": " Given that it is relatively noncontroversial to claim that human capital, both in terms of education and experience, is associated with superior firm performance, this can be extended to say that having the requisite human capital in terms of software development staff is highly important for software development project success. However, translating into actual corporate benefits implies an understanding of the range of human capital issues in organizations. The present study examines one such range of issues with a focus on the dynamics of teams, where team dynamics is taken as a general term to denote the nature, quality and quantity of interactions among a firms human capital at the team level. Specifically we refer to collaborative dynamics among human capital team resources to indicate the extent to which valuable information is shared, levels of engagement, the existence of a collective sense of awareness …", "num_citations": "6\n", "authors": ["367"]}
{"title": "Using ISO/IEC 12207 to analyze open source software development processes: an E-learning case study\n", "abstract": " To date, there is no comprehensive study of open source software development process (OSSDP) carried out for open source (OS) e-learning systems. This paper presents the work which objectively analyzes the open source software development (OSSD) practices carried out by e-learning systems development communities and their results are represented using DEMO models. These results are compared using ISO/IEC 12207:2008. The comparison of DEMO models with ISO/IEC 12207 is a useful contribution; as it provides deeper understanding to-wards the OS e-learning system development.", "num_citations": "6\n", "authors": ["367"]}
{"title": "Innovation and learning facilitated by play\n", "abstract": " This paper describes an approach to facilitate interaction between students and industrial companies in a problem based learning environment. The approach is adapted from a methodology developed at the LEGO Company and relies on an improved ability to communicate complex problems when using physical representations.", "num_citations": "6\n", "authors": ["367"]}
{"title": "A model driven architecture approach to web development\n", "abstract": " The rise of the number and complexity of web applications is ever increasing. Web engineers need advanced development methods to build better systems and to maintain them in an easy way. Model-Driven Architecture (MDA) is an important trend in the software engineering field based on both models and its transformations to automatically generate code. This paper describes a a methodology for web application development, providing a process based on MDA which provides an effective engineering approach to reduce effort. It consists of defining models from metamodels at platform- independent and platform-specific levels, from which source code is automatically generated.", "num_citations": "6\n", "authors": ["367"]}
{"title": "Systems, Software and Services Process Improvement: 20th European Conference, EuroSPI 2013, Dundalk, Ireland, June 25-27, 2013. Proceedings\n", "abstract": " This volume constitutes the refereed proceedings of the 20th EuroSPI conference, held in Dundalk, Ireland, in June 2013. The 31 revised papers presented in this volume were carefully reviewed and selected. They are organized in topical sections on SPI Safety and Regulation Issues; SPI Lifecycle and Models; SPI Quality and Testing Issues; SPI Networks and Teams; SPI and Reference Models; SPI Implementation; Agile organisations and an agile management process group; Managing Diversity and Innovation; SPI and Measurement; Risk Management and Functional Safety Standards.", "num_citations": "5\n", "authors": ["367"]}
{"title": "A Conceptual Descriptive-Comparative Study of Models and Standards of Processes in SE, SwE, and IT Disciplines Using the Theory of Systems\n", "abstract": " The increasing design, manufacturing, and provision complexity of high-quality, cost-efficient and trustworthy products and services has demanded the exchange of best organizational practices in worldwide organizations. While that such a realization has been available to organizations via models and standards of processes, the myriad of them and their heavy conceptual density has obscured their comprehension and practitioners are confused in their correct organizational selection, evaluation, and deployment tasks. Thus, with the ultimate aim to improve the task understanding of such schemes by reducing its business process understanding complexity, in this article we use a conceptual systemic model of a generic business organization derived from the theory of systems to describe and compare two main models (CMMI/SE/SwE, 2002; ITIL V. 3, 2007) and four main standards (ISO/IEC 15288, 2002; ISO/IEC …", "num_citations": "5\n", "authors": ["367"]}
{"title": "On models and standards of processes in SE, SwE and IT&S disciplines: toward a comparative framework using the systems approach\n", "abstract": " The general aim of Systems Engineering (SE) and Software Engineering (SwE) is the definition, development and deployment of large-scale cost-effective and trustworthy integrated systems and software-intensive systems respectively. In pursuit of this aim, both disciplines have generated models and standards of processes to guide and control the engineering and managerial activities involved in the creation of such systems. Furthermore, the increasing complexity of software-intensive systems has fostered the interdisciplinary research between SwE and SE disciplines toward a joint Systems Software Engineering (SSwE). In turn, the Information Technology and Systems (IT&S) field, focused mainly in the management and evaluation of IT-intensive systems, is highly dependent on the engineering activities conducted in SwE and SE fields. Despite this linkage, IT&S has generated its own set of models and standards of processes and not explored the conceptual relationship with the SwE and SE models and standards. This paper is concerned with the integration of SE and SwE to cope with complex softwareintensive systems and explores the premise of that the incorporation of a SE-based philosophy and principles in the engineering and management of large-scale and complex IT-systems can enhance these processes. This paper first establishes the relationship between the concepts of process, system and service from a Systems Approach perspective and then develops a conceptual framework -also founded in the Systems Approach- to compare the main models and standards of processes internationally  reported for the SE, SwE and IS …", "num_citations": "5\n", "authors": ["367"]}
{"title": "The Complete Idiot's Guide to American Government\n", "abstract": " Read this book--and see how a true democracy works!--Mary Shaffrey and Melanie Fonder are both veterans of the Beltway--and reveal here for the first time secrets and mysteries that surround American government.--The inner workings of virtually every branch of the American government can be found in this book--the very first of its kind on the market today.--The tragic events of 9/11 have thrust the workings of the American government into the spotlight--read here how decisions on American policy (military, foreign, and domestic) are made--decisions that can and will effect your life every day. Congress. The Senate. The House of Representatives. The President. The Supreme Court. The Federal Reserve. It takes a lot of offices and bureaucrats to run a country the size of America. Still, how many people actually Know what each branch of the American government does, why they do it, and why they were created? The Complete Idiot's Guide\" RM\" to the American Government explains, in a readable and concise matter, how the government works and explains the functions of the different branches of government.", "num_citations": "5\n", "authors": ["367"]}
{"title": "Sustainable Aviation\n", "abstract": " This book highlights the latest research in the field of sustainable aviation. In recent decades, there have been considerable improvements in aircraft efficiency and noise reduction. However, with the demand for both passenger and freight transportation expected to increase significantly in future years, the aviation sector is becoming a growing source of environmental problems and a major contributor to global warming. Focusing on the need to address this mounting problem, this book discusses important new trends and outlines likely future developments in carbon emission reduction, carbon trading, and the impact of emerging technologies, as well as social, legal, and regulatory changes as they pertain to the aviation sector.The book offers an invaluable reference guide for practitioners, regulators, academics, and students alike, in fields ranging from business and engineering to the social sciences. It can be …", "num_citations": "4\n", "authors": ["367"]}
{"title": "Software development process standards for very small companies\n", "abstract": " For very small software development companies, the quality of their software products is a key to competitive advantage. However, the usage of software engineering standards is extremely low amongst such very small software companies. A primary reason cited by many such companies for this lack of quality standards adoption is the perception that they have been developed for large multi-national software companies and not with small and very small organizations in mind and are therefore not suitable for their specific needs. This chapter describes the design and development of the software process lifecycle standard for very small entities. This chapter presents a unique insight from the perspective of some of the standards authors on the development of the ISO/IEC 29110 standard, including the rationale behind its development and the innovative design of implementation guides to assist very small …", "num_citations": "4\n", "authors": ["367"]}
{"title": "Systems, Software and Services Process Improvement: 25th European Conference, EuroSPI 2018, Bilbao, Spain, September 5-7, 2018, Proceedings\n", "abstract": " This volume constitutes the refereed proceedings of the 25th European Conference on Systems, Software and Services Process Improvement, EuroSPI conference, held in Bilbao, Spain, in September 2018. The 56 revised full papers presented were carefully reviewed and selected from 95 submissions. They are organized in topical sections on SPI context and agility, SPI and safety testing, SPI and management issues, SPI and assessment, SPI and safety critical, gamifySPI, SPI in industry 4.0, best practices in implementing traceability, good and bad practices in improvement, safety and security, experiences with agile and lean, standards and assessment models, team skills and diversity strategies, SPI in medical device industry, empowering the future infrastructure.", "num_citations": "4\n", "authors": ["367"]}
{"title": "Systems, Software and Services Process Improvement: 24th European Conference, EuroSPI 2017, Ostrava, Czech Republic, September 6–8, 2017, Proceedings\n", "abstract": " This volume constitutes the refereed proceedings of the 24th EuroSPI conference, held in Ostrava, Czech Republic, in September 2017. The 56 revised full papers presented were carefully reviewed and selected from 97 submissions. They are organized in topical sections on SPI and VSEs, SPI and process models, SPI and safety, SPI and project management, SPI and implementation, SPI issues, SPI and automotive, selected key notes and workshop papers, GamifySPI, SPI in Industry 4.0, best practices in implementing traceability, good and bad practices in improvement, safety and security, experiences with agile and lean, standards and assessment models, team skills and diversity strategies.", "num_citations": "4\n", "authors": ["367"]}
{"title": "Team Tacit Knowledge as a Predictor of Performance in Software Development Teams\n", "abstract": " Tacit knowledge has been hailed as an important factor in team performance. In this paper we examine tacit knowledge as a significant predictor of team performance. This paper presents the results of a study of 48 software development teams where the influence of team tacit knowledge on team performance was examined. We also propose that team tacit knowledge is acquired through informal social interaction. In addition, reliability and validity for the team tacit knowledge measure in software development teams are established with respect to gut instinct, explicit job knowledge and experience.", "num_citations": "3\n", "authors": ["367"]}
{"title": "Effect of Research Engagement on EFL Teachers' Motivation for and Efficacy in Teacher-Research.\n", "abstract": " In language teaching, the roots of teacher-research date back to 1980s. The concept of teacher as researcher started to be recognized as a result of the limitations of the large scale and longitudinal studies conducted with the aim of identifying the best methods and approaches in language teaching/learning which were open to doubt (Allwright & Bailey, 1991). This was probably because of their being essentially quantitative and having involved large groups of participants. In addition, they were conducted by academicians who had no or little concern about the practitioner due to the lack of collaboration between the researcher and the practitioner.Since these classroom-based studies were not conducted by the teachers themselves or at least in cooperation with them, they also failed to meet the needs and to solve the problems of the language teachers (Borg, 2010). Thus, the approach that defines the teacher as the technician who is expected to practice the findings of academic research has become the focus of the criticism. Allwright (2005) verbalizes the situation as ‘disillusionment with technicist research’.", "num_citations": "3\n", "authors": ["367"]}
{"title": "The Impact of cultural issues on the software process of very small entities\n", "abstract": " [...] the article recaps how cultural suggestions can benefit ISO/IEC developers and researchers, and then briefly discusses future directions of this article. Traditional culture is difficult to change, especially when VSEs from developing regions have diverse financial concerns (Norburv 2003:[...] it is important to ensure the VSE's software process adaptation is beneficial and improves its software capability level. According to Norbury (2003), Roldan (2015), Saith (2008), and Sordo (2015), the organizational cultures in Hong Kong and Taiwan are categorized as individualist cultures, whereas in China, a collectivist culture is dominant in both national culture and organizational culture.[...] addressing these challenges should help align the current ISO/IEC 29110 standard to be more practical and relevant for VSEs with compatibly concerns and other cultural issues.", "num_citations": "3\n", "authors": ["367"]}
{"title": "Engineering and Management of Data Centers\n", "abstract": " © Springer International Publishing AG 2017", "num_citations": "3\n", "authors": ["367"]}
{"title": "Understanding personality differences in software organisations using Keirsey temperament sorter\n", "abstract": " In recent years, there has been an increasing interest in exploring personality differences to improve work experience in software organisations. This study presents a personality assessment process conducted on 382 software practitioners using the Keirsey temperament sorter II. The primary goal of this assessment is to explore the personality temperaments of software practitioners working in different types of software development organisations. In addition, a novel visualisation approach is proposed for arranging temperaments using a periodic table-like structure. The results suggest that the authors approach provides an effective means to investigate an organisation's personality profile while assessing personality types.", "num_citations": "3\n", "authors": ["367"]}
{"title": "Developing software and systems engineering standards\n", "abstract": " There are a great many Software and Systems Engineering standards such as those supported by organizations like the ISO (International Organization for Standardization). It is often said that many of these have a poor reputation with many sections of academia and industry. Whilst there may be many publicized business advantages of using standards, standardization is an often-neglected route for exploiting academic and commercial research. Often researchers have little experience of standardization to plan, implement and exploit their research utilizing standards. Involvement with standards development organizations in your research can positively increase international recognition and highlight in a world stage your research and enhance your international reputation. This keynote address examined the benefits of being directly involved in the standards community for both industry and academia and …", "num_citations": "3\n", "authors": ["367"]}
{"title": "Software Process Improvement and Capability Determination\n", "abstract": " On behalf of the SPICE Organizing Committee we are proud to present the proceedings of the 14th International Conference on Software Process Improvement and Capability dEtermination (SPICE 2014), held in Vilnius, Lithuania, during November 4–6, 2014.The SPICE Project was formed in 1993 to support the development of an international standard for software process assessment. The work of the project has led to the finalization of the ISO/IEC 15504–Process Assessment, and its complete publication represented a climax for the work of the project. The standardization effort continues, with the publication this year of the first documents in the new ISO/IEC 330xx family of standards on process assessment. As part of its charter to provide ongoing publicity and transition support for the emerging standard, the project organized a number of SPICE Workshops and Seminars, with invited speakers drawn from …", "num_citations": "3\n", "authors": ["367"]}
{"title": "Yazilim gelistiren organizasyonlar için düsünülmüs bir kisilik tipi ölçüm oyunu\n", "abstract": " Yazilim gelistiren organizasyonlar için düsünülmüs bir kisilik tipi ölçüm oyunu | AVESİS Gazi Üniversitesi Akademik Veri Yönetim Sistemi Araştırmacı Girişi English Detaylı Arama Ana Sayfa Son Eklenen Yayınlar Yazilim gelistiren organizasyonlar için ... Yazilim gelistiren organizasyonlar için düsünülmüs bir kisilik tipi ölçüm oyunu Yilmaz M. , O'Connor RV 7th Turkish National Software Engineering Symposium, UYMS 2013, İzmir, Türkiye, 26 Eylül 2013, cilt.1072 identifier Yayın Türü: Bildiri / Tam Metin Bildiri Cilt numarası: 1072 Basıldığı Şehir: İzmir Basıldığı Ülke: Türkiye Ana Sayfa | AVESİS Hakkında | İletişim İletişim Bilgileri Gazi Üniversitesi Araştırma Geliştirme Kurum Koordinatörlüğü Emniyet Mahallesi Bandırma Caddesi No:6/1 Rektörlük Binası Zemin Kat 06560 Teknikokullar Yenimahalle / Ankara avesis@gazi.edu.tr 0 (312) 202 26 80 Ana Sayfa | AVESİS Hakkında | İletişim Akademik Veri Yönetim Sistemi Abis © …", "num_citations": "3\n", "authors": ["367"]}
{"title": "An architecture for an intelligent assistant system for use in software project planning.\n", "abstract": " British Library EThOS: An architecture for an intelligent assistant system for use in software project planning. New search | Advanced search | Search results Login / Register | About | Help | FAQ | Follow dividing line Use this URL to cite or link to this record in EThOS: https://ethos.bl.uk/OrderDetails.do?uin=uk.bl.ethos.340375 Title: An architecture for an intelligent assistant system for use in software project planning. Author: O'Connor, Rory V. ISNI: 0000 0001 3452 2817 Awarding Body: City University Current Institution: City, University of London Date of Award: 2000 Availability of Full Text: Full text unavailable from EThOS. Please contact the current institution’s library for further details. Abstract: No abstract available Supervisor: Not available Sponsor: Not available Qualification Name: Thesis (Ph.D.) Qualification Level: Doctoral EThOS ID: uk.bl.ethos.340375 DOI: Not available Keywords: Decision support system; ; : | | …", "num_citations": "3\n", "authors": ["367"]}
{"title": "Correlating tapped general packet radio service (GPRS) tunneling protocol (GTP) and non-GTP packets for a subscriber's session for load balancing and filtering monitored …\n", "abstract": " The subject matter described herein includes methods, systems, and computer readable media for correlating, load balancing and filtering tapped GTP and non-GTP packets. One method for correlating, load balancing and filtering tapped GTP and non-GTP packets includes receiving GTP packets tapped from a plurality of GTP network tap points. The method further includes receiving non-GTP packets tapped from at least one non-GTP network tap point. The method further includes correlating GTP packets with non-GTP packets for a particular subscriber. The method further includes forwarding the GTP packets and non-GTP packets correlated for the particular subscriber to a network monitoring tool.", "num_citations": "2\n", "authors": ["367"]}
{"title": "Applications of Fourier series and zeta functions to Genocchi polynomials\n", "abstract": " In this paper, we firstly consider the properties of Genocchi polynomials, Fourier series and Zeta functions. In the special cases, we see that the Fourier series yield Zeta functions. From here, we show that zeta functions for some special values can be computed by Genocchi polynomials. Secondly, we consider the Fourier series of periodic Genocchi functions. For odd indexes of Genocchi functions, we construct good links between Genocchi functions and Zeta function. Finally, since Genocchi functions reduce to Genocchi polynomials over the interval [0,1), we see that Zeta functions have integral representations in terms of Genocchi polynomials.", "num_citations": "2\n", "authors": ["367"]}
{"title": "How One of The World’s Oldest Food Safety Standards Approaches Expiration\n", "abstract": " The paper at hand contemplates the effect of a centuries-old national food safety standard on innovation in a globalizing market. To that end, the case of the German Beer Industry is analysed to explicate the relationship between a longstanding beer purity decree and brewing innovation. Over 500 years of existence the so-called “Reinheitsgebot”, now laid down in federal German law, has served to restrict variety and safeguard the quality of locally-produced beers. In turn, the standard prominently shaped the national image as well as consumer preferences across all regions in Germany. This research however demonstrates how this has overwhelmingly brought about adverse consequences for the international relevance of German beer in an increasingly globalised economy, which favours diversity in tastes. Due to changing consumption trends and the constricted innovative ability of German brewers, the findings inform government’s responsibility in standardisation for traditional consumer goods industries at a time of urgent need for action.", "num_citations": "2\n", "authors": ["367"]}
{"title": "A standard based adaptive path to teach systems engineering: 15288 and 29110 standards use cases\n", "abstract": " This paper discusses the use of two different standards for teaching Systems Engineering (SE): ISO/IEC/IEEE 15288 and ISO/IEC 29110. The first one is a general and widely-used standard describing the lifecycle processes of the entire system, whereas the second one is a relatively new standard based on a reduced set of standards elements focused on lifecycle profiles for Very Small Entities (VSEs). We are especially interested in the impact that SE standards can have on teaching this discipline to engineering students. We consider the teaching of fundamental principles of systems engineering. In this paper we illustrate how our, previously developed, standard based solution for systems engineering education can be used as a framework to support these standard-based teaching paths. We mainly focus on illustrating how adapting standard processes can be done, considering not only the learning goals, but …", "num_citations": "2\n", "authors": ["367"]}
{"title": "An MADM risk-based evaluation-selection model of free-libre open source software tools\n", "abstract": " Free-libre Open-source software (FLOSS) tools are free-cost licence highly attractive to be implemented by organisations. However, not of all the FLOSS tools are mature, and failed implementations can occur. Thus, FLOSS evaluation-selection frameworks and FLOSS success-failure implementation factors studies have been conducted. In this research, we advance on such studies through an integrated FLOSS evaluation-selection model with a risk-based decision-making approach. Our model was built upon the other two literatures, and it was structured as a multi-attribute decision-making (MADM) model which contains 12 variables grouped in four risk categories: financial, organisational, end user, and technical ones. We illustrated its utilisation in the domain of information technology service management (ITSM) FLOSS tools. Hence, our model contributes to the FLOSS literature with the inclusion of the risk …", "num_citations": "2\n", "authors": ["367"]}
{"title": "Blending process assessment and employees competencies assessment in very small entities\n", "abstract": " The ISO/IEC 29110 series aims to provide Very Small Entities (VSEs) with a set of standards based on subsets of existing standards. Process capability determination does not seem suitable for a VSE in terms of return on investment. Our approach moves the viewpoint away from process and to the human resources. We propose a blended assessment model using the ISO/IEC 15504 for the level 1, but based on competency assessment for higher levels.", "num_citations": "2\n", "authors": ["367"]}
{"title": "Software Process Improvement and Capability Determination: 15th International Conference, SPICE 2015, Gothenburg, Sweden, June 16-17, 2015. Proceedings\n", "abstract": " This book constitutes the refereed proceedings of the 15th International Conference on Software Process Improvement and Capability Determination, SPICE 2015, held in Gothenburg, Sweden, in June 2015. The 17 revised full papers presented together with three short papers were carefully reviewed and selected from 48 submissions. The papers are organized in topical sections on industrial frameworks; implementation and assessment; process improvement; agile processes; assessment and maturity models; process and education.", "num_citations": "2\n", "authors": ["367"]}
{"title": "Software Process Improvement and Capability Determination\n", "abstract": " On behalf of the SPICE Organizing Committee we are proud to present the proceedings of the 11th International Conference on Software Process Improvement and Capability dEtermination (SPICE 2011), held in Dublin, Ireland, from May 30 to June 1, 2011.The SPICE Project was formed in 1993 to support the development of an international standard for software process assessment. The work of the project has eventually led to the finalization of ISO/IEC 15504–Process Assessment, and its complete publication represented a climax for the work of the project. As part of its charter to provide ongoing publicity and transition support for the emerging standard, the project organized a number of SPICE Workshops and Seminars, with invited speakers drawn from project participants. These have now evolved to a sustaining set of international conferences with broad participation from academics and industry with a …", "num_citations": "2\n", "authors": ["367"]}
{"title": "Design, build and evaluation of an ontology-based KMS for supporting CMMI-DEV understanding: Benefits and limitations\n", "abstract": " The design, build and evaluation of an ontology-based knowledge management system prototype tool — entitled CMMIoKMS — for supporting the consultation and understanding of CMMI for Development (CMMI-DEV) is reported. Ontology-based tools have been proposed for improving such complex cognitive tasks realized by Software Engineering practitioners involved in CMMI implementations. The design of the CMMI-oKMS prototype tool is based on four proprietary ontologies (of things, of systems, of business, and of CMMI models) and built with Protégé tool. The result from a pilot empirical test, is reported as being satisfactory — compared with the extant reported systems — on the metric of perceived value (with statistical significance) and over usefulness, compatibility, and test score constructs (with practical significance), while that no gain was found in ease of use. Hence, given the limited number of …", "num_citations": "2\n", "authors": ["367"]}
{"title": "Usability in Software Development Process for Open Source e/m-Learning Systems\n", "abstract": " This poster presents the issues surrounding software development processes used for the development of e/m-learning systems. One of the quality attribute namely ‘Usability’is considered highly important since e-learning systems are used by people with varied skill sets (Admin, Students, and Teachers). Also, this poster discusses the need for quality of the e/m-learning systems for today’s digital generation.", "num_citations": "2\n", "authors": ["367"]}
{"title": "Analysis of CMMI Specific Practice Dependencies\n", "abstract": " CMMI contains a collection of Process Areas (PAs), and each PA contains many Specific Practices (SPs). However, the CMMI specification does not provide any explicit recommendation about which individual SPs can or should be implemented before other SPs. In this paper we identify dependencies between CMMI SPs in PAs in maturity level 2, and also between those PAs. We analyzed the text of the CMMI specification to identify every Work Product (WP) produced and used by every SP in maturity level 2. Our analysis was validated by independent researchers and comparison with an existing dependency analysis shown in CMMI training materials. Our results have significance as a reference model of SP and PA dependencies for both SPI researchers and practitioners. For researchers we have provided an explicit representation of SP and PA dependencies that were previously only implicit in the CMMI specification. For practitioners, our results may provide guidance on the order of implementation of SPs and PAs.", "num_citations": "2\n", "authors": ["367"]}
{"title": "Developing a configuration management model for use in the medical device industry\n", "abstract": " This paper outlines the development of a Configuration Management model for the MEDical device software industry (CMMED). The paper details how medical device regulations associated with Configuration Management (CM) may be satisfied by adopting less than half of the practices from the CM process area of the Capability Maturity Model Integration (CMMI). It also investigates how the CMMI CM process area may be extended with additional practices that are outside the remit of the CMMI, but are required in order to satisfy medical device regulatory guidelines.", "num_citations": "2\n", "authors": ["367"]}
{"title": "Software selection: towards an understanding of forensic software tool selection in industrial practice\n", "abstract": " As a result of the increasing importance of the forensic examination of computer systems, numerous forensic software tools have appeared in the market. The selection of such tools is an important technical and strategic business decision that may have serious legal implications. This paper examines the main issues surrounding the selection of forensic software tools for use by computer forensic investigators pursuing digital evidence as part of an organisational, civil or criminal investigation. The primary objective of this research was to develop a set of characteristics which highlight the main technical and non-technical selection issues and their relative significance in explaining the selection of a particular forensic software tool in industrial practice. This paper presents the results of interviews with commercial forensic investigators in order to assess their attitudes, opinions and experience in making tool selection …", "num_citations": "2\n", "authors": ["367"]}
{"title": "Prompter—a project planning assistant\n", "abstract": " The aim of the Prompter project was to develop the Prompter tool, a “decision-support tool to assist in the planning and managing of a software project”. Prompter has the ability to help software project planners assimilate best practice and'know how'in the field of software project planning and incorporate expert critiquing which will assist project planners in solving the complex problems associated with the planning of a software project.", "num_citations": "2\n", "authors": ["367"]}
{"title": "A Distributed Framework for Implementing a Multi-agent Assistant System\n", "abstract": " This paper describes work undertaken within the context of the P3 (Project and Process Prompter) Project which aims to develop the Prompter tool, a ‘decision-support tool to assist in the planning and managing of a software development project’. Prompter will have the ability to help software project managers to assimilate best practice and ‘know how’in the field of software project management and incorporate expert critiquing to assist with solving the complex problems associated with software project management. This paper focuses on Prompters agent-based approach to tackling the problems of distributed, platform independent support.", "num_citations": "2\n", "authors": ["367"]}
{"title": "Long-term evaluation of restoring understories in Wyoming big sagebrush communities with mowing and seeding native bunchgrasses\n", "abstract": " Restoring degraded plant communities is a global challenge and a major priority for land managers and conservationists. Degraded Wyoming big sagebrush communities (Artemisia tridentata ssp. wyomingensis [Beetle & A. Young] S.L. Welsh) have high sagebrush cover with a depleted perennial herbaceous understory. They are widespread in western North America and are a priority for restoration because they provide habitat for sagebrush-associated species and an important forage base for livestock production. Mechanically reducing sagebrush with mowing has been attempted to restore the understory in these communities but often fails because large native perennial bunchgrasses do not increase and exotic annual grasses proliferate. Seeding large native perennial bunchgrasses after mowing sagebrush may increase their density or cover and thereby limit exotic annual grasses. Native perennial …", "num_citations": "1\n", "authors": ["367"]}
{"title": "An effective estimate for the measure of the set of p-adic numbers with a given order of approximation\n", "abstract": " In this paper, we establish a rate of convergence to zero of the measure of the set  for which the inequality  for  has a solution in the integer polynomials  of degree  and height bounded by .", "num_citations": "1\n", "authors": ["367"]}
{"title": "Systems, Software and Services Process Improvement: 23rd European Conference, EuroSPI 2016, Graz, Austria, September 14-16, 2016, Proceedings\n", "abstract": " This volume constitutes the refereed proceedings of the 23rd EuroSPI conference, held in Graz, Austria, in September 2016. The 15 revised full papers presented together with 14 selected key notes and workshop papers were carefully reviewed and selected from 51 submissions. They are organized in topical sections on SPI and the ISO/IEC 29110 standard; communication and team issues in SPI; SPI and assessment; SPI in secure and safety critical environments; SPI initiatives; GamifySPI; functional safety; supporting innovation and improvement.", "num_citations": "1\n", "authors": ["367"]}
{"title": "A risk-based MADM model for selecting free-libre open source software tools in the domain of IT service management\n", "abstract": " The availability of free-libre open source software (FLOSS) has stimulated their organizational implementation in many countries. The main attractiveness for it is the free-cost license of usage regarding with acquisition of COTS (components of the shelf) commercial software, among other factors such as: maturity status, available technical community support, popularity, and compliance to international standards. However, not of the all FLOSS tools released from such FLOSS development projects achieve the expected qualities, and thus organizations interested in using them must conduct a careful evaluation-selection process. With this in mind, several evaluation-selection frameworks for FLOSS have been reported in the literature and some studies have identified a set of organizational factors associated to successful and failed utilizations of FLOSS tools in organizations. In this research, we elaborate a FLOSS Evaluation-Selection model by combining both sets of literature on FLOSS evaluation models and FLOSS implementation models. This model is implemented with a MADM (Multi-Attribute Decision-Making) risk-based mechanism. We illustrate this model with the evaluation-selection of a FLOSS tool in the domain of Information Technology Service Management (ITSM). Hence, this paper contributes to our body of knowledge with the provision of a simplified evaluation-selection model for FLOSS tools derived from two core sets of FLOSS literatures, under an innovative risk-based approach.", "num_citations": "1\n", "authors": ["367"]}
{"title": "Deploying a Software Process Lifecycle Standard in Very Small Companies\n", "abstract": " BackgroundThis section will introduce the problem with standards and explain the specific case of very small entities, before presenting the ISO/IEC standard as a solution specifically designed to address these problems for very small companies.", "num_citations": "1\n", "authors": ["367"]}
{"title": "Large scale agile\n", "abstract": " The Agile Manifesto was created more than 10 years ago, in February 2001, by a group of 17 interested individuals. I was fortunate to be one of those 17; witnessing and participating in the articulation and advancement of an idea that would, we hoped, change the face of software development for the better. But 10 years is a long time in the real world, and it is an eternity in the tech world.As a result, things did not quite turn out the way we expected. In 2001, when we created the manifesto and launched the agile software development movement, we fully expected to see a crowded rush of new methods, new practices, and new ways of being agile. These new ideas would follow the guidelines of the manifesto but introduce new ideas and approaches and help advance the art. That did not happen. Instead, we have seen wider-scale adoption of individual practices that agile software development favors, including formerly controversial practices such as pair-programming, and even basic hygienic practices such as version control that previously were not always followed. Overall, this seems to have had a very positive effect on many development organizations, but it is surely less than many of us had hoped for. It seems that the initial focus of the agile software development has been forgotten over time, and the goal has shifted from becoming adaptive, flexible, agile practitioners to merely following a subset of canonical, prescribed agile practices. It appears that people have forgotten why we do what we do.", "num_citations": "1\n", "authors": ["367"]}
{"title": "Yazılım geliştiren küçük ölçekli bir organizasyon için scrumban yaklaşımı ve oyunlaştırma uygulaması\n", "abstract": " Özet Çevik metotların yazılım projelerindeki genel dinamik ve sağlanması hedeflenen amaçlar doğrultusunda melezlenmesi son yıllarda yazılım sektöründe sıkça uygulanmaya başlayan rutin bir pratik halini almaktadır. Böyle yaklaşım yardımı ile çevik süreçler arasında sistematik bir özelleştirme sağlanarak, takım ve süreç üretkenliklerini açısından oluşabilecek problemlerin kontrol altına alınması hedeflenmektedir. Bu makalede, küçük ölçekli bir yazılım geliştiren organizasyon için Scrum yönteminden, Scrumban yöntemine geçiş süreci ve oyunlaştırma teknikleri kullanılarak sağlanan süreç iyileştirme uygulaması anlatılmıştır. Uygulama sırasında duruma özel olarak kurgulanan odak grup çalışması, anket çalışması ve yarı yapılandırılmış görüşmeler doğrultusunda kurgulanan araştırma yöntemi açıklanmıştır. Sonuç olarak, bu çalışmadan elde edilen gözlemler göstermektedir ki böyle yaklaşım sayesinde gerek örgütsel, ve gerekse yöntemsel bağlamda bazı iyileştirmeler sağlanabilmektedir.", "num_citations": "1\n", "authors": ["367"]}
{"title": "Towards a personality type measurement game considered for software development organizations [in Turkish]\n", "abstract": " Myers-BriggsKişilikGöstergesi(MBKG)yazılımendüstrisindesık kullanılan ölçüm araçlarından birisidir. Yazılım mühendisliği alanında MBKG kullanılarak bir çok kişilik tipi araştırması ve alan çalışması ya- pılmıştır. Ancak bu yöntem bir grup araştırmacı tarafından bireylerin arzu edilen cevapları gerçek düşüncelerine tercih ettikleri yönünde eleş- tirilmiştir. Bütün bu eleştirel görüşlere rağmen, yazılım geliştiren orga- nizasyonlar için özel olarak geliştirilmiş, kullanıcı etkileşimini ön plana çıkartarak bireyleri gerçek kişilik tiplerini ortaya çıkartmak için kullanı- labilecek bir kişilik tipi testi tasarlanmıştır. Bu makalede yazılım geliştiren organizasyonda çalışan bireylerin kişi- lik tiplerini ortaya çıkartmak için üretilmiş bir kişilik ölçüm enstrümanı sunulmaktadır. Bu araç, uygulamalı bir durum çalışması sonucunda, ya- zılım geliştiricilerine özel olarak kurgulanmış, geliştirilen kartlarının yar- dımı ile bireylere ve gruplara interaktif olarak uygulanmıştır. Güvenilirlik ölçümü yapmak için seçilen bir grup katılımcı üzerinde iki ölçüm yapılmış ve elde edilen bulgular sunulmuştur. Sonuçlar göstermektedir ki etkile- şimli bir uygulama klasik MBKG yaklaşımlarına göre önemli avantajlar içerebilmektedir.", "num_citations": "1\n", "authors": ["367"]}
{"title": "Open source software development process for the development of open source e-learning systems\n", "abstract": " Over the last decade, numerous educational institutions and corporate world have employed various kinds of e-learning software solutions. One of the major components of end-to-end e-learning solution is the learning management system (LMS). These LMS are either developed as open source software (OSS) or close source software (CSS) product. In this regard, CSS for e-learning systems has a major drawback of being expensive and this hinders its widespread use. On the other hand, OSS is virtually free and not restricted by the licensing costs. The benefits of OSS can be completely realized only if there is an effective contribution from OSS community towards its development.  It is clear from the literature that the OSS development community does not follow an explicitly defined and documented software development process. This in turn results in lack of detailed information in the literature about the problems arising due to the absence of a defined process. Nevertheless, some of the major issues with regard to OSS development for LMS that have been identified include software design issues, week user Interface, lack of complete and accessible documentation, lack of co-ordination between unknown developers, etc.  This research develops a generalized OSSD process that could be used for the development of an open source (OS) e-learning system. To begin, in order to understand the current development practises of the existing OS e-learning systems, a detailed analysis was carried out for three different and popular OS e-learning systems (Moodle, ILIAS and Dokeos). The result of this analysis was represented as an Activity Flow …", "num_citations": "1\n", "authors": ["367"]}
{"title": "On electronic process guides for IT service management\n", "abstract": " IT practitioners interested in implementing IT Service Management processes (like ISO/IEC 20000; CMMI-SVC, ITIL v2, or ITIL v3, or proprietary process models as ITUP (IBM), MOF 3.0/4.0 (Microsoft) are faced with the challenge to consult complex documents for learning and training purposes.. Such documents contain an inherent complexity by the number of schemes, categories, activities, roles, forms, techniques, concepts, attributes, and their interrelationships. Given this problem, a research stream (in Software Engineering discipline) has been focused on the design, implementation and evaluation of electronic process guides (EPGs). EPGs are digital documents which describe organizational processes for training and guiding real execution purposes, and which contains all required documents as well as sample of them. EPGs are not intended for enacting an organizational process (like a business process manager system) but for supporting their correct execution for human participants. We believe that EPGs can be useful for ITSM management. Thus, in this research in progress, we report: (i) a review of characteristics of EPGs, (ii) an EPG evaluation framework, and (iii) a conceptual evaluation of three open access EPGs. Two for IT Service Management (ITUP, MOF 4.0) and one for Software Engineering process (OpenUP). Our final research aim, is identifying enhancement opportunities for the design of EPGs by using ontology technology. Implications for ITSM are finally discussed.", "num_citations": "1\n", "authors": ["367"]}
{"title": "A study of computer programming language adoption for information systems development projects\n", "abstract": " This research examines the main issues surrounding the adoption of a computer programming language for information systems development projects. The adoption of a particular language for any given project is an important strategic business and technical decision. Committing to a particular programming language is a major decision which may have long term implications. As most software systems evolve over time, the programming language used for implementation may have an impact long after the initial systems development phase is over. The purpose of this study was to provide a more comprehensive understanding of the factors that are significant to the adoption of computer programming languages for information systems' development projects in industrial practice. The primary objective of this research was to develop and test a generalised set of language characteristics which highlights the main …", "num_citations": "1\n", "authors": ["367"]}
{"title": "Improving Professional Software Skills in Industry\n", "abstract": " With over a decade of Software Process Improvement in large organisations, the awareness of its importance has propagated to Small to Medium Enterprises (SMEs). The most well known models for SPI are primarily suited for large-or medium-sized organisations, but with some tailoring they can provide substantial support for SPI in small organisations. The IPSSI (Improving Professional Software Skills in Europe) project aims to address these issues and provide a process improvement framework for use by individual software engineers working in European SMEs. This paper describes the background and motivation behind the IPSSI framework and describes the IPSSI approach to supporting the individual software engineer and reports on a series of case studies using the IPSSI method.", "num_citations": "1\n", "authors": ["367"]}
{"title": "The Application of Multiple Choice Questions in a Computer Environment as a Method of Learning rather than of Assessment\n", "abstract": " Abstract hereMultiple Choice Questions, have been used for many years as a tool of assessment. While they were being used for this purpose, it appeared that they also had potential as a learning aid. This paper investigates the effectiveness of Multiple Choice Questions in a computer environment as a means of absorbing information. It compares two computerised methods having different degrees of interactivity to a more traditional paper-based method. The increase in learning is quantified using pre-tests and post-tests. The study involved pupils in two second level schools in the Dublin area and also investigated their attitudes towards such use of computers for this purpose", "num_citations": "1\n", "authors": ["367"]}
{"title": "Integrating Total Quality Management into Review of Educational Institutions\n", "abstract": " In order to achieve an incremental improvement through institutional review, educational organisations must consider supporting management strategies to assist in the review process. Integrating TQM into the institutional review process can lead to success in linking the vision and mission of an educational agency to its management and operational strategies. This paper describes the theoretical perspective of integrating institutional review and TQM processes for achieving continuous improvement, and how the concept of TQM can be used as a planning tool to improve the processes and outcomes of the institutional review. It characterises the management goals necessary for making continuous improvement in the quality of performance of all the processes, products, and services of the educational institution. This paper also advocates that the institutional review process is, was, and always will be, a way of …", "num_citations": "1\n", "authors": ["367"]}