{"title": "A pattern language for business resource management\n", "abstract": " A pattern language to deal with Business Resource Management is presented. It covers a great number of applications in business systems, including patterns for resource rental, trading and maintenance, and was designed based on practical experience in information systems development. Existing recurring patterns were applied to form patterns in our language, which were instantiated to this specific domain. The idea has been to make the language as complete as possible in order to be useful for the analysis of a wide variety of applications in this domain. Fifteen patterns are presented together with a diagram showing the precedence for checking the convenience of their utilization. Object models using UML notation are used both to present each pattern structure and a sample instantiation. The pattern language application to practical cases has shown that analysis is easily conducted, as it is a guideline for the work to be done.", "num_citations": "87\n", "authors": ["2191"]}
{"title": "Um processo para construção e instanciação de frameworks baseados em uma linguagem de padrões para um domínio específico.\n", "abstract": " Padrões, linguagens de padrões e frameworks são formas de reuso de software. A complexidade de frameworks, causada pela dificuldade tanto em construí-los quanto em utilizá-los, é um dos inibidores do uso dessa tecnologia. Um processo para facilitar a construção e instanciação de frameworks é apresentado. Uma linguagem de padrões é utilizada para apoiar todo o processo, desde a identificação da funcionalidade do framework, seu projeto, implementação, validação, até sua instanciação para sistemas específicos do domínio. O framework obtido é do tipo caixa-branca e sua instanciação é feita especializando-se suas classes para sistemas específicos. O processo inclui, também, a construção de uma ferramenta para automatizar a instanciação do framework, por meio da qual é possível obter um sistema específico fornecendo apenas informações sobre os padrões da linguagem utilizados na sua modelagem. O processo é ilustrado com a Linguagem de Padrões para Gestão de Recursos de Negócios (GRN), que serviu de base para construção do framework GREN. Apresenta-se também o GREN-Wizard, uma ferramenta para instanciação automática do GREN para sistemas no domínio da GRN. A avaliação do processo é feita por meio de alguns experimentos e vários relatos de uso dos diversos sub-processos que compõem o processo geral, usando o GREN, a GRN e o GREN-Wizard.", "num_citations": "45\n", "authors": ["2191"]}
{"title": "A process for framework construction based on a pattern language\n", "abstract": " A process for building an object-oriented framework based on a pattern language, both for the same domain, is proposed. This process includes several activities, as the identification of the framework hot-spots, the framework design, implementation, and validation. All these activities are supported by the pattern language. Besides that, by using the process here proposed, the resulting framework is implicitly documented by the pattern language. This makes it easier for the developer to instantiate applications, as the knowledge about the pattern language is used during the instantiation process.", "num_citations": "39\n", "authors": ["2191"]}
{"title": "Building a wizard for framework instantiation based on a pattern language\n", "abstract": " Pattern languages can be used to guide the construction and instantiation of object-oriented frameworks. A process for building a                    wizard                  to automatically instantiate applications from a framework built based on a pattern language is described in this paper. The main goal of this wizard is to generate all the code needed to instantiate the framework to a particular system, based on information about the patterns of the pattern language applied to model a particular system, together with additional attributes included in the classes that compose each pattern. The proposed process is illustrated with the GREN-Wizard, a tool to instantiate the GREN framework to particular systems in the business resource management domain. GREN was built based on a pattern language for the same domain, called GRN, which is used during the instantiation process.", "num_citations": "26\n", "authors": ["2191"]}
{"title": "A pattern language for online auctions management\n", "abstract": " Online auctions are gaining popularity as they provide an excellent means of selling goods. Their advantages include: reducing transaction costs, selling goods that are difficult to sell through the ordinary market channels, and increasing the circle of potential customers. This paper presents a pattern language for the Web auction application domain. The pattern language has ten analysis patterns that offer solutions to support all the basic functionalities of this domain. Its development was based on several existing Internet auction systems and its application can guide the developer during analysis of such systems.", "num_citations": "24\n", "authors": ["2191"]}
{"title": "Approaches for integration in system of systems: a systematic review\n", "abstract": " Software systems have become increasingly complex, and they are often formed by integrating independent systems, resulting in a new class of systems referenced as System of Systems (SoS). The System of Systems Integration (SoSI) emerges as a new challenge and aims to create a new feature by integrating constituent systems that contribute to the overall goal of the SoS. Often the constituent systems tend to be from different sources and behaviors and, as such, tend to employ different terminology and concepts. Also, when SoSI involves the integration of legacy systems, cases where the documentation and the necessary skills for the harmonious integration are readily available are very rare. However, it is observed that there is a lack of studies that are comprehensive and, at the same time, contain a detailed view of how the constituent systems are integrated in order to collectively achieve a common goal …", "num_citations": "23\n", "authors": ["2191"]}
{"title": "Reengineering using design patterns\n", "abstract": " Starting from a legacy system, originally developed in C and using text files, we first conducted a reverse engineering of this system to obtain its object-oriented analysis model. Then, in a process that is called segmentation, we restructured the code, changing all data structures to abstract data types and procedures to methods, eliminating all data access anomalies. This paper presents an experiment in which part of the segmented code was reengineered to an object-oriented language (Java) and the text files were replaced by a relational database. We show how design patterns have been used to link the database with the object-oriented concepts of Java. We also report a maintenance experiment that compares maintainability of the legacy system, the segmented system, and the object-oriented version.", "num_citations": "23\n", "authors": ["2191"]}
{"title": "Reengineering of legacy systems based on transformation using the object oriented paradigm\n", "abstract": " Legacy systems that were originally developed using the procedure-oriented approach can be reengineered according to the object-oriented paradigm by the process proposed in this paper. Three phases are included in such a process: an object oriented reverse engineering phase, in which an object oriented analysis model of the legacy system is produced by Fusion/RE; a segmentation phase, in which the original code is segmented into object oriented methods, keeping the procedural language; and finally a transformation phase, in which the segmented code is transformed to an object oriented language by the Draco-Puc machine. The application of this process to a real mechanic and electric car repair shop system, with 20000 lines of source code, is described. Samples of the Java code obtained by transforming the original Clipper code are supplied.", "num_citations": "23\n", "authors": ["2191"]}
{"title": "Development of critical embedded systems using model-driven and product lines techniques: A systematic review\n", "abstract": " Several methodologies have been proposed in the last decades to improve the quality of Safety-Critical Embedded Systems (SCES) and, at the same time, keep costs and schedule compatible with project plans. In particular, approaches such as Product Line Engineering (PLE) and Model-Driven Engineering (MDE) offer an interesting solution to reduce development complexity and time to market due to their synergy and common goals. However, the current state of how MDE and PLE can be combined to enhance productivity in the domain of SCES is not clear yet. This paper presents a systematic literature review, with the purpose of obtaining the state of the art of the aproaches, methods and methodologies whose goal is the combination of PLE and MDE for the development of SCES, and to verify the existence of empirical studies that demonstrate the application of these techniques in this type of development …", "num_citations": "22\n", "authors": ["2191"]}
{"title": "Padrões e frameworks de software\n", "abstract": " Após a popularização da linguagem Smalltalk, no início da década de 80, paralelamente às bibliotecas de classes, começaram a ser construídos frameworks de aplicação, que acrescentam às bibliotecas de classes os relacionamentos e interação entre as diversas classes que compõem o framework. Com os frameworks, reutilizam-se não somente as linhas de código, como também o projeto abstrato envolvendo o domínio de aplicação.Framework é definido por Coad como um esqueleto de classes, objetos e relacionamentos agrupados para construir aplicações específicas [Coad 92] e por Johnson como um conjunto de classes abstratas e concretas que provê uma infra-estrutura genérica de soluções para um conjunto de problemas [Johnson 88]. Essas classes podem fazer parte de uma biblioteca de classes ou podem ser específicas da aplicação. Frameworks possibilitam reutilizar não só componentes isolados, como também toda a arquitetura de um domínio específico. O Capítulo 2 explica em detalhes os conceitos associados a frameworks, exemplificando diversos deles. Diversos frameworks têm sido desenvolvidos nas duas últimas décadas, visando o reuso de software e conseqüentemente a melhoria da produtividade, qualidade e manutenibilidade. Neste capítulo são definidos os frameworks de software, bem como diversos conceitos básicos necessários para entender sua finalidade. A seguir são dados exemplos de alguns frameworks existentes e o framework Model-View-Controller é visto em maiores detalhes.", "num_citations": "21\n", "authors": ["2191"]}
{"title": "The prolices approach to develop product lines for safety-critical embedded systems and its application to the unmanned aerial vehicles domain\n", "abstract": " VACCARE BRAGA, Rosana T et al. The ProLiCES Approach to Develop Product Lines for Safety-Critical Embedded Systems and its Application to the Unmanned Aerial Vehicles Domain. CLEIej [online]. 2012, vol. 15, n. 2, pp. 2-2. ISSN 0717-5000.Abstract This paper presents ProLiCES, an approach for the development of safety-critical embedded applications and its usage to develop a product line for unmanned aerial vehicles (UAV). The motivation of ProLiCES emerged after the development of Tiriba, a family of small, electric-powered unmanned aircraft. Most software artifacts produced for Tiriba required modifications to be reused in a more complex project, the SARVANT, which has to accommodate several new features that increase the variability of the end products. In the Tiriba project, a methodological approach, named SAFE-CRITES, was defined and used. Special care was taken about software reuse, based on Model Driven Development and automatic code generation. The certification process, based on the DO-178B standard, was also taken into account. ProLiCEs extends SAFE-CRITES to integrate Product Line Engineering into the development process, aiming better software reuse. This extension was done by creating a second parallel path to the process, dealing with the Product Line Domain Engineering. ProLiCES is being currently used in the SARVANT project, which will deliver a much more complex UAV and is estimated to be deployed in two years.", "num_citations": "18\n", "authors": ["2191"]}
{"title": "Does a CBIR system really impact decisions of physicians in a clinical environment?\n", "abstract": " Content-based image retrieval systems are employed in several areas. One of the most prominent area is the medical field, due to the huge volume of digital images daily generated in healthcare institutions employed for decision making. There are several works applying CBIR techniques over medical images. However, the great majority of them do not verify whether the systems are actually considered by the specialists as a pontential aid in a real environment. In order to fill this research void in the literature, this work explores user experiments in a CBIR system involving resident physicians and radiologists. To do so, we developed a CBIR system according to requirements provided by the specialists and employed a methodology to analyze the effectiveness of the system for supporting them in clinical routine. The methodology aims at evaluating the system's impact in the user's decision, inquiring the specialists …", "num_citations": "17\n", "authors": ["2191"]}
{"title": "Legacy systems reengineering using software patterns\n", "abstract": " We present a case study for legacy systems reengineering using software patterns, aiming at both easing the reengineering process and improving future maintenance. The approach used consists basically of three steps: apply reverse engineering if necessary, to obtain an object model of the system; recognize software patterns present in the object model obtained; and re-implement the system in a more productive way, using toolkits or specific frameworks that implement the patterns found. Results of some experiments show that reengineering has been facilitated as well as system maintenance, because components became clearly delimited and larger chunks of design may now be understood as a whole and reused.", "num_citations": "17\n", "authors": ["2191"]}
{"title": "A family of patterns for business resource management\n", "abstract": " A family of patterns that covers a great number of applications in business systems is presented. Business Resource Management is the term used to d efine these a pplications. It i ncludes patterns for Resource Rental, Resource Trade and Resource Maintenance. They are applied to examples as medical attendance, video rental, real estate rental, library service, show box office, fertilizer retail store, car repair shop and electronic appliance repair shop. The work is based on professional practice, and results from the combination of recurring patterns, already covered in other PLoPs. The practice used mostly procedural languages, but through object oriented reverse engineering of real systems it was possible to explicit the presented object oriented patterns.", "num_citations": "15\n", "authors": ["2191"]}
{"title": "Finding frameworks hot spots in pattern languages\n", "abstract": " An important issue that contributes to the complexity of object-oriented framework development is the identification of its hot spots, ie, the framework parts that must be kept flexible, as they are specific of individual systems. A process for identification of hot spots in an analysis pattern language is proposed. Several types of hot spots are identifiable from information presented in the elements of each pattern of the pattern language, making possible to define a process to sistematize this task. An example illustrates the hot spots identification based on a pattern language for business resource management.", "num_citations": "13\n", "authors": ["2191"]}
{"title": "Padrões e Métodos Ágeis: agilidade no processo de desenvolvimento de software\n", "abstract": " Este artigo apresenta alguns padrões organizacionais e de processo que podem ser integrados aos métodos ágeis para melhorar e agilizar o processo de desenvolvimento de software. Características comuns podem ser encontradas em alguns padrões organizacionais e de processo existentes e em algumas práticas utilizadas em métodos ágeis como o Extreme Programming (XP) e o Scrum. A partir dessas características, foram destacados alguns padrões que são usados como prática nesses métodos e outros que podem ser integrados a eles. Existe ainda o desafio de integrar esses padrões a um método ágil.", "num_citations": "12\n", "authors": ["2191"]}
{"title": "Extending patterns with testing implementation\n", "abstract": " VV&T activities are a present concern in the context of patterns, as patterns are used for software development, maintenance, and reengineering, and this type of activity is necessary to assure the quality both of the solutions and of the delivered products. Although VV&T activities are important, they are not always performed as they should be, due to the associated time and cost. In this context, this paper proposes a strategy that aggregates test resources to software patterns. This allows reusing not only solutions in a certain context, but also the corresponding test resources needed to validate applications. Reengineering case studies were conducted with the support of a pattern language, through which it has been possible to observe, although without statistical significance, a meaningful reduction of the time spent with VV&T activities when test resources aggregated to patterns are used.", "num_citations": "12\n", "authors": ["2191"]}
{"title": "A Process to Create Analysis Pattern Languages for Specific Domains\n", "abstract": " Pattern languages are a powerful instrument through which knowledge about a specific domain can be documented. When composed of analysis patterns, they can help novice developers to model systems belonging to a wide variety of applications in a particular domain. We show a process to systematically produce a pattern language for a specific domain. The process starts with the identification of the domain functionality, then patterns are created to solve individual problems found in the domain, and finally relationships among patterns are established. Two analysis pattern languages created by the authors are used to illustrate the proposed process.", "num_citations": "10\n", "authors": ["2191"]}
{"title": "The role of pattern languages in the instantiation of object-oriented frameworks\n", "abstract": " In this paper we propose the use of pattern languages to guide an object-oriented framework instantiation. Both the framework and the pattern language refer to the same domain, and the framework must have been constructed based on the pattern language. The framework instantiation here proposed is done in several steps, all of them supported by the pattern language. This makes it easier for the developer to instantiate applications, as the knowledge about the pattern language is used during the instantiation process. The proposed approach is illustrated with the example of a framework we have built based on a pattern language for an information systems’ domain.", "num_citations": "10\n", "authors": ["2191"]}
{"title": "Introdução aos padrões de software\n", "abstract": " O reuso de software é um tema da engenharia de software que tem recebido destaque especial nas últimas décadas. O objetivo é reaproveitar grande parte do software produzido e informações associadas em projetos futuros, diminuindo o custo e aumentando a produtividade no desenvolvimento e na própria evolução do produto. A idéia básica é de que componentes de software sejam projetados e implementados de forma que possam ser reusados em muitos sistemas diferentes. Na década de 60, construíam-se bibliotecas de sub-rotinas científicas que eram reusáveis em aplicações científicas e de reengenharia, sendo portanto de um domínio de aplicação limitado. Geradores de aplicação ou geradores de programa surgiram logo depois para facilitar a criação de aplicações a partir de sua especificação em uma linguagem de alto nível. Apesar dos geradores de aplicação limitarem-se a poucos domínios …", "num_citations": "10\n", "authors": ["2191"]}
{"title": "Aplicando internet das coisas na educação: Tecnologia, cenários e projeções\n", "abstract": " Nos últimos anos, a indústria, governo e as instituições de pesquisa têm unido esforços para desenvolver uma tecnologia que conecta objetos físicos capazes de trocar informações e perceber nuances do seu próprio ambiente, propiciando dados estratégicos para uma melhor tomada de decisão. Tal tecnologia é cunhada como Internet das Coisas, uma distinta rede estabelecida entre objetos heterogêneos para fornecer serviços e aplicações para inúmeras áreas de atuação. Esta rede possui características e funcionamento diferenciado das redes tradicionais, sendo uma potencial tecnologia para uso no processo de ensino-aprendizagem nas salas de aula do futuro. Este artigo destaca o uso desta rede no contexto educacional, identificando as potenciais aplicações que melhorem a eficiência do ensino e propiciem um maior engajamento e interesse dos alunos e professores.", "num_citations": "9\n", "authors": ["2191"]}
{"title": "Reengineering legacy systems towards system of systems development\n", "abstract": " Despite the evolution of the hardware that enabled even small components to interconnect and the modern software engineering paradigms that eased information exchange, several systems still operate standalone and do not share resources naturally with each other. In this paper, we show that if these systems are reengineered appropriately using existing techniques, they can share useful resources, work cooperatively, and compose more complex systems like System of Systems (SoS). Our case study illustrates how distinct Electronic Funds Transfer (EFT) legacy systems were reengineered to compose a SoS intended to deliver an increasing number of financial operations.", "num_citations": "9\n", "authors": ["2191"]}
{"title": "Componentes de software no planejamento da operação energética de sistemas hidrotérmicos\n", "abstract": " O planejamento da operação de sistemas hidrotérmicos pode ser classificado como um problema de um sistema acoplado no tempo e no espaço, não linear, não convexo, estocástico e de grande porte. A complexidade do problema justifica a necessidade de utilização de diversas ferramentas computacionais com abordagens variadas. Este trabalho tem como objetivo a realização de estudos relacionados ao planejamento da operação energética de sistemas hidrotérmicos de geração, pela aplicação de componentes de software e de sistemas de inferência fuzzy. Pretende-se apresentar e aplicar um processo de desenvolvimento (UML Components), baseado em componentes de software, para a construção de modelos computacionais de simulação e otimização para servir de apoio ao planejamento da operação energética do sistema hidrotérmico brasileiro. O processo de desenvolvimento UML …", "num_citations": "9\n", "authors": ["2191"]}
{"title": "Reutilização de Modelagem de Negócios baseada em Visões: um Estudo de Caso\n", "abstract": " A modelagem de negócios é uma documentação imprescindível para as empresas, uma vez que registra principalmente os processos de negócios, os responsáveis pela sua execução e as regras de negócios envolvidas. Tais regras representam as peculiaridades de cada empresa, garantindo sua competitividade no ramo de negócios em que atua. Como outros artefatos de software, a modelagem de negócios pode ser reutilizada tanto no desenvolvimento quanto na reengenharia de sistemas, proporcionando redução de custo e maior produtividade durante as atividades de evolução de sistemas de informação. Neste artigo é apresentado um estudo de caso para avaliar a eficiência da reutilização de modelagem de negócios baseada em visões. A modelagem de negócios para sistemas existentes no domínio industrial é disponibilizada para reúso em domínios similares e com níveis de complexidade diferenciados, e os resultados deste reúso são apresentados.Abstract. Business modeling provides fundamental documentation to organizations, as it registers basically the business processes, people responsible for executing them and business rules involved. These rules represent peculiarities of each organization, helping to ensure it is competitive in the business branch where it is inserted. As other software artifacts, business modeling can be reused both during systems development and reengineering, providing costs reduction and more productivity in the information systems evolution. In this paper it is presented a case study to evaluate the efficiency of reusing business modeling based on visions. The business modeling for existing …", "num_citations": "9\n", "authors": ["2191"]}
{"title": "Guidelines for using aspects to evolve product lines\n", "abstract": " Aspects have been used successfully to implement non-functional requirements in software product lines. On the other hand, functional requirements are harder to isolate using aspects, as they are often more intertwined in the application classes. In this paper, we propose guidelines to use aspect oriented programming to implement the functional features of a product line, in an incremental way. A case study for a psychology clinics control system is used to illustrate how to apply the guidelines.", "num_citations": "9\n", "authors": ["2191"]}
{"title": "Fauna parasitária intestinal de Chrysocyon brachyurus (lobo-guará) no Parque Nacional das Emas\n", "abstract": " O lobo-guará (Chrysocyon brachyurus) é uma espécie ameaçada de extinção. A perda de habitat tem aumentado o contato de populações de lobo-guará com animais domésticos, aumentando a probabilidade de transmissão de patógenos entre eles. Utilizar informações sobre níveis de infecções helmintológicas como indicadores da prevalência de endoparasitoses é crucial em estudos de populações de espécies ameaçadas de extinção. O objetivo, portanto, foi identificar e fornecer informações sobre a diversidade de parasitas intestinais encontrada na população de C. brachyurus que ocorre no Parque Nacional das Emas, Goiás/Mato Grosso do Sul. Para isso, foram realizadas campanhas para coleta de fezes entre os meses de julho de 2008 e janeiro de 2009. Foram utilizados os métodos de sedimentação espontânea e método de Baermann, para pesquisa de ovos, larvas, vermes adultos e cistos de parasitas intestinais. Foram registrados seis tipos de parasitas intestinais em diferentes frequências durante as análises: Ancylostoma caninum, Trichuris vulpis, Ascaris sp., Strongyloides sp., e cistos de Ameba sp.. Esses agentes foram anteriormente descritos como parasitas de humanos, animais domésticos e/ou animais selvagens. Foi registrado ainda a ocorrência de Trichuris cf. trichiura, sendo este o primeiro relato desse parasita em carnívoros silvestres, anteriormente apenas descrito em humanos, primatas não-humanos e suínos domésticos. O ciclo de transmissão de parasitoses entre humanos, animais domésticos e animais selvagens é favorecido pela fragmentação dos habitats naturais e pela presença de alto índice de …", "num_citations": "8\n", "authors": ["2191"]}
{"title": "Component-based development applied to energetic operation planning of hydrothermal power systems\n", "abstract": " The energetic operation planning of a hydrothermal power system aims to provide an economic and reliable operational policy that embraces time frames ranging from the long term energy control of hydroelectric resources to the electric and hydraulic aspects of daily generation dispatch. Due to the planning complexity and different aspects that this problem has to address, it may require a chain of computational tools to be solved. Those computational tools should permit to evaluate the current and future system performance, reliability, safety, and ability to grow with production or operating requirements. This work applies component-based development (CBD) towards the energetic operational planning of the Brazilian hydrothermal system. CBD is different from previous approaches, such as procedural programming or object-oriented programming, in its separation of component specification from implementation …", "num_citations": "8\n", "authors": ["2191"]}
{"title": "AIPLE-IS: An Approach to Develop Product Lines for Information Systems Using Aspects.\n", "abstract": " 7–The system should allow the inclusion, search, modification, and removal of information about the service that the patient is receiving at the clinic, with the following data: therapist name, type of service, patient name, available dates/times, diagnosis,… 24–The system should allow the inclusion, search, modification, and removal of appointments, containing the following data: patient name, therapist name, room, day/time scheduled, and service to be performed.", "num_citations": "8\n", "authors": ["2191"]}
{"title": "GREN-Wizard: a tool to instantiate the GREN framework\n", "abstract": " The GREN-Wizard, a tool to instantiate the GREN framework to particular systems in the business resource management domain, is presented in this paper. It was built based on a pattern language for the same domain, called GRN, which is used during the instantiation process. The GREN-Wizard automatically generates all the code needed to adapt the framework to the particular system, according to the input data supplied by the user. This data consists basically of information about the patterns of GRN applied to model the particular system, together with additional attributes included in the classes that compose each pattern.", "num_citations": "8\n", "authors": ["2191"]}
{"title": "Um mapeamento sistemático em progresso sobre internet das coisas e educação à distância\n", "abstract": " The Internet of Things emerged with the high availability of sensors, being the basis of the creation of smart cities. In the e-learnign domain, it is still being studied new ways of using IoT, to improve education towards ubiquitous learning, allowing learning to take place anywhere and at any time. This work presents an ongoing Systematic mapping about the relationship between IoT and e-learning. A protocol was defined, according to the concepts by Kitchenham et. al. and Petersen et. al. Results show that IoT usage is not recognized in most cases, although being widely used and allowing several attempts of creating ubiquitous learning environments.", "num_citations": "7\n", "authors": ["2191"]}
{"title": "Engenharia reversa e reengenharia\n", "abstract": " • Definição de Abstração: habilidade de se ignorar os aspectos de assuntos não relevantes para o propósito em questão", "num_citations": "7\n", "authors": ["2191"]}
{"title": "Uma abordagem de desenvolvimento de linha de produtos com uma arquitetura orientada a serviços\n", "abstract": " Linha de produtos de software (LPS) corresponde a uma das mais bem sucedidas formas de reúso, pois permite a reutilização de requisitos e arquitetura. Embora o desenvolvimento, manutenção e evolução de uma LPS ainda possua um custo alto quando comparado ao desenvolvimento de sistemas únicos (single systems), um lucro significativo pode ser obtido com a venda de diversos produtos derivados da LPS. No projeto de uma LPS analisa-se os sistemas coletivamente, ou seja, o domínio. Geradores de aplicações são ferramentas capazes de gerar artefatos a partir de uma especificação, e no caso de se ter a especificação de um domínio, é possível gerar aplicações para esse domínio. Web services representam uma tecnologia promissora para disponibilização de serviços na Web e desenvolvimento de software com arquitetura flexível e de fácil manutenção. Neste trabalho é proposta uma abordagem de desenvolvimento de linha de produtos com arquitetura orientada a serviços, na qual a geração de produtos é apoiada por um gerador de aplicações. A abordagem chama-se SoProL-WS e possui o objetivo de reduzir os custos e prazos de desenvolvimento da LPS e facilitar a sua manutenção, evolução e derivação de seus membros. SoProLWS apresenta as atividades e artefatos necessários para partir dos requisitos da LPS, projetar, implementar, configurar um gerador de aplicações e gerar seus membros a partir do gerador ou por meio de uma configuração manual. Além disso, é apresentado um estudo de caso com o desenvolvimento de uma linha de produtos de leilões Web seguindo os passos da abordagem, bem …", "num_citations": "7\n", "authors": ["2191"]}
{"title": "Identification of framework hot spots using pattern languages\n", "abstract": " One of the major factors that brings complexity to framework development is the identification of its hot spots, ie, the framework parts that must be kept flexible as they are specific of individual systems. In this paper we show that pattern languages can be important sources for framework hot spots identification and, consequently, can be used for framework construction. We define the types of hot spots that are identifiable from information presented in the elements of each pattern of the pattern language. We propose also a process for hot spots identification and present a case study for identifying the hot spots of a framework built based on a pattern language for business resource management.", "num_citations": "7\n", "authors": ["2191"]}
{"title": "A confederation of patterns for resource management\n", "abstract": " A confederation of patterns that covers a great number of applications in business systems is proposed. Resource Management is the term used to define these applications. It includes patterns for Resource Location, Resource Trading and Resource Maintenance. They are applied to examples as medical attendance, video rental, real estate rental, library service, show box office, fertilizer retail store and car repair shop. The proposal is based on professional practice, and results from the combination of recurring patterns, already covered in other PLoPs. The practice used mostly procedural languages, but through object oriented reverse engineering of real systems it was possible to explicit the proposed object oriented patterns.", "num_citations": "7\n", "authors": ["2191"]}
{"title": "Extending statecharts to model system interactions\n", "abstract": " Statecharts are diagrams comprised of visual elements that can improve the modeling of reactive system behaviors. They extend conventional state diagrams with the notions of hierarchy, concurrency and communication. However, when statecharts are considered to support the modeling of system interactions, e.g., in Systems of Systems (SoS), they lack the notions of multiplicity (of systems), and interactions and parallelism (among systems). To solve these problems, this paper proposes extensions to statecharts. First, a notation to represent a set of orthogonal states, similar in their structures but belonging to different systems, like a pool of telephone systems, is proposed. Second, the concept of communication among parallel states is extended to also represent system interactions, i.e., the relationships among orthogonal systems by means of proper interaction mechanisms like event broadcast. The proposed …", "num_citations": "6\n", "authors": ["2191"]}
{"title": "Patterns for enterprise application integration\n", "abstract": " The development of Information Technology (IT) demands the integration of systems (legacy or new), so that they can operate in a distributed way and promoting the reuse of design, code and information in a high granularity level. Enterprise Application Integration (EAI) plays a fundamental role in this scenario. It can be conducted by different means, for example, by sharing the access to databases or using Web Services (WS). Both solutions are being adopted by organizations, although they present advantages and disadvantages that should be analysed. Several restrictions can be present in the particular integration scenario, causing problems to be solved before deciding if the integration should be done by data access or WS. So, this work has the objective of documenting these problems and solutions in the pattern format, in order to make available to other developers the knowledge acquired when doing EAI …", "num_citations": "6\n", "authors": ["2191"]}
{"title": "GREN-WizardVersionControl: Uma Ferramenta de Apoio ao Controle de Versão das Aplicações Criadas pelo Framework GREN\n", "abstract": " Controle de versao é uma das atividades importantes do desenvolvimento e da reengenharia de software e ajuda a garantir a qualidade do produto. Controle de versao no desenvolvimento de aplicaç oes baseado em frameworks tem alguns problemas, pois é necessário controlar tanto as versoes do framework quanto as das aplicaç oes por ele criadas. Para aumentar a produtividade dessa atividade é primordial o uso de ferramentas de apoio. Este artigo apresenta uma ferramenta, denominada GREN-WizardVersionControl, que apóia o controle de versao das aplicaç oes criadas por um framework.", "num_citations": "6\n", "authors": ["2191"]}
{"title": "An Evolution Process for Application Frameworks\n", "abstract": " Application frameworks, as occurs with any software, evolve as they are used. The initial versions often do not satisfy all the domain requirements for which the framework has been built, thus, soon after the framework is released for use, the evolution process starts. As it is a generic architecture of a domain, framework maintenance activities differ from maintenance activities of conventional applications. An evolution process for application frameworks, comprising eight steps, is proposed. This process is based on the evolution of a framework for the information systems domain.", "num_citations": "6\n", "authors": ["2191"]}
{"title": "Padrões de Software a partir da Engenharia Reversa de Sistemas Legados\n", "abstract": " A execução da engenharia reversa orientada a objetos de um sistema legado desenvolvido com orientação procedimental é usada como base para sua reengenharia, seguindo duas abordagens diferentes. Na primeira, o sistema passa por reengenharia com mudança de orientação, por meio de segmentação e, posteriormente, é transformado para uma linguagem orientada a objetos de forma semi-automática. Na segunda, é feito o reconhecimento de padrões recorrentes de software no modelo de objetos produzido pela engenharia reversa, para depois efetuar a reengenharia utilizando esses padrões. Os resultados obtidos por intermédio dessas duas abordagens podem ser comparados quanto à manutenibilidade, legibilidade e reuso. A versão original do sistema legado escolhido para a realização da experiência está implementado na linguagem Clipper e possui cerca de vinte mil linhas de código. Trata …", "num_citations": "6\n", "authors": ["2191"]}
{"title": "An acknowledged system of systems for educational internet of everything ecosystems\n", "abstract": " Internet of Everything (IoE) is the next evolutionary step of Internet of Things (IoT). This paradigm evolves IoT by transforming it into an accessed, monitored and controlled global pervasive network for all the Internet. The IoE network must integrate embedded devices, people, processes and data in order to provide relevant information for various application areas such as medical, industry, aerospace, agrobusiness, automation, education, among others. In this paper, we propose an acknowledged System of Systems (SoS) to integrate IoE ecosystems that operate into educational environments. This SoS implements a service-oriented architecture to provide services as interfaces between constituent systems (CS). A CS is mediated by a negotiator agent that can be requested by the SoS coordinator agent to identify the availability of specific resources demanded by other CS. This coordinator agent is responsible for …", "num_citations": "5\n", "authors": ["2191"]}
{"title": "An experience on applying software testing for teaching introductory programming courses\n", "abstract": " Previous work has demonstrated that the use of software testing concepts for teaching introductory programming courses may be a good practice for the students. Indeed, these courses provide limited opportunities for the teacher regarding dynamic activities that could help students in the learning process. This paper describes an approach in which test sets are reused in the context of teaching introductory programming courses, as an alternative to increase the quality of the programs generated by students. An experimental study was carried out to investigate the impact of reusing test cases during the programming learning. The objective is to evaluate if the use of test cases might improve the quality of programs implemented by the students. Sixty undergraduate students participated in the experiment, implementing programs in the domain of vectors. A set of reference programs was used to generate test cases, based on functional testing, to be reused by the students to test their programs. Considering a range of 1 - 10 , the programs’ quality increased from 5.3 to 7.4 using this approach. The results provide evidences that the reuse of test cases during introductory programming courses may help to increase the quality of the programs generated by students, motivating them to apply software testing during the development of the programs", "num_citations": "5\n", "authors": ["2191"]}
{"title": "Uma abordagem baseada em sistemas de inferência Fuzzy Takagi-Sugeno aplicada ao planejamento da operação de sistemas hidrotérmicos de geração\n", "abstract": " O planejamento da operação de sistemas hidrotérmicos de geração, em sistemas com grande participação hidráulica, como é o caso do sistema brasileiro, visa determinar uma política de operação que especifique como as usinas hidroelétricas devem ser operadas, de forma que os recursos hidroelétricos sejam utilizados com economia e confiabilidade. Este trabalho apresenta uma aplicação de sistemas de inferência fuzzy do tipo Takagi-Sugeno, responsável por obter uma política de operação (PBSIF - Política Baseada em Sistema de Inferência Fuzzy) que represente a operação otimizada de reservatórios para geração de energia elétrica, bem como da análise desta política e sua aplicação na simulação da operação de sistemas hidroelétricos. A política proposta é obtida pela otimização da operação energética das usinas hidroelétricas. Desta otimização extraem-se as relações entre a energia armazenada do sistema e o volume do reservatório de cada usina. Estas relações estão representadas nos parâmetros dos consequentes das regras linguísticas fuzzy do modelo de inferência de Takagi-Sugeno. De forma a ilustrar a eficácia da PBSIF, ela foi avaliada por meio da comparação do seu desempenho com a política de operação em paralelo; com a política de operação baseada em aproximações funcionais, que utiliza funções polinomiais e exponenciais, obtidas através do método dos mínimos quadrados; e também com o resultado obtido através da operação otimizada a usinas individualizadas. Com a metodologia proposta, procura-se demonstrar a viabilidade da obtenção e aplicação da PBSIF, e com os resultados obtidos …", "num_citations": "5\n", "authors": ["2191"]}
{"title": "A domain specific language for lessening the effort needed to instantiate applications using grenj framework\n", "abstract": " GRENJ is a white-box framework implemented in Java. White-box frameworks are reusable designs composed of a set of concrete and abstract classes so that the collaboration among these classes provides support for large-scale reuse of design and source code. However, instantiating applications by using this sort of framework is quite complex and demands detailed architectural knowledge. In order to lessen the amount of source code, effort, and expertise required to instantiate applications by using GRENJ framework, we have developed a domain specific language that manages all application instantiation issues systematically. This domain specific language facilitates the application instantiation process by acting as a facade over GRENJ framework as well as providing the user with a more concise, human-readable syntax than Java. In this paper, we contrast the major differences and benefits resulting from instantiating applications solely using GRENJ framework and indirectly reusing its source code by applying our domain specific language.", "num_citations": "5\n", "authors": ["2191"]}
{"title": "Padrões de Reengenharia auxiliados por Diretrizes de Qualidade de Software\n", "abstract": " Atualmente, a definição de padrões de reengenharia tem sido abordada por diversos autores pela necessidade da existência de diretrizes mais consistentes para guiar na realização desse processo. Aliada a isso, a preocupação com o resultado do processo, ou seja, a qualidade do produto gerado, contribui para a descrição da reengenharia sob a forma de padrões com o objetivo de torná-la mais clara para o engenheiro de software. Este artigo tem por objetivo descrever, na forma de sete grupos de padrões, o Processo de Reengenharia Orientada a Objetos (PRE/OO), que detalha a reengenharia de sistemas legados procedimentais para sistema orientados a objetos. Os grupos relacionados à qualidade do processo de reengenharia utilizam as áreas-chave para alcance do nível 2 de maturidade do SW-CMM como base para composição dos padrões.", "num_citations": "5\n", "authors": ["2191"]}
{"title": "Genetic population structure and allele surfing during range expansion in dynamic habitats\n", "abstract": " Expanding populations may loss genetic diversity because sequential founder events throughout a wave of demographic expansion may cause “allele surfing”, as the alleles of founder individuals may propagate rapidly through space. The spatial components of allele surfing have been studied by geneticists, but have never been investigate on dynamic and shifting habitats. Here we used an individual-based-model (IBM) to study how interactions between different habitat restoration scenarios and biological characteristics (dispersal capacity) affect the spatial patterns of the genetic structure of a population during demographic expansion. We found that both habitat dynamics and dispersal capacity, as well as their interaction, were the drivers of emergent pattern of genetic diversity and allele surfing. Specifically, allele surfing is more common when a species with low dispersal capacity colonizes a large geographic area with slow restoration (low carrying capacity). Despite this, we showed that allele surfing can be reduced, or even avoided, by dispersal management through suitable habitat restoration. Thus, investigating how colonization generates a spatial variation in genetic diversity, and which parameters control the emergent genetic pattern, are essential steps to planning assisted gene flow, which is fundamental for an effective planning of habitat restoration.", "num_citations": "4\n", "authors": ["2191"]}
{"title": "Combining MARTE-UML, SysML and CVL to build unmanned aerial vehicles\n", "abstract": " Several methodologies have been proposed in the last decades to improve the quality of critical embedded systems and, at the same time, keep costs and schedule compatible with project plans. In particular for Unmanned Aerial Vehicles (UAV), approaches such as Product Line Engineering (PLE) and Model-Driven Engineering (MDE) offer an interesting solution to reduce development complexity and are being widely used in various academic research and industrial projects. This paper presents an approach combining PLE and MDE to develop families of Unmanned Aerial Vehicles. In this approach, we propose the use of SysML and MARTE UML profile to support requirements specification, design, validation, simulation and eventual code generation. Additionally, we propose the use of the Common Variability Language (CVL) to support the transformations of the generic product line models into specific product models, aiming at achieving a high degree of reuse. Additionally, this paper proposes a process to use the above mentioned modeling techniques to produce family models and a method to use these artifacts to generate product members. Finally, we illustrate the various concepts presented in the proposed methodology by means of a UAV case study.", "num_citations": "4\n", "authors": ["2191"]}
{"title": "A Critical Embedded System Product Line Model-based Approach.\n", "abstract": " The development of Critical Embedded Systems (CES) like Unmanned Aerial Vehicles (UAV) is complex because it needs to ensure a high degree of quality, with affordable cost and delivery time. It is also necessary to ensure security since failures in this type of system can lead to catastrophic results. In this sense, a Model-Driven Development (MDD) approach presents itself as a good alternative to the traditional development because coding complexity will be reduced by the use of high level models. In addition, it avoids the introduction of coding errors by human programmers, since the critical code will be built automatically through models transformation. From another perspective, Embedded Systems Development can benefit from Software Engineering techniques like Product Lines to reduce costs and time-to-market. While other works propose the use of Product Line techniques to improve Embedded Software development, we propose a Product Line approach to the whole Critical Embedded System development life cycle, including hardware variability management. Therefore, this paper proposes a Critical Embedded System Product Line Model Based approach, which aims to reduce the above mentioned challenges. The development approach proposes a Domain Engineering and Application Engineering focused on the system, with both software and hardware. To illustrate the proposed approach we include some artifacts from a case study in the UAV domain.", "num_citations": "4\n", "authors": ["2191"]}
{"title": "Safe-crites: Developing safety-critical embedded systems supported by reuse techniques\n", "abstract": " The development of safety-critical embedded systems presents some demands, such as low-level communication with hardware devices, uninterrupted operation in hostile environments and some restrictions such as memory size, processing power and, particularly, low power consumption. These systems require specific development methodologies, targeting the development of products with certified quality. This paper presents an approach named SAFE-CRITES, created to ease the certification of future products, also improving reuse in all developments steps (from the architecture to design and coding). A case study of a complex embedded system for guidance and control of an unmanned aircraft is presented, contributing to the evaluation of the proposed approach for real world applications.", "num_citations": "4\n", "authors": ["2191"]}
{"title": "A Version Control Tool for Framework-based Applications\n", "abstract": " Framework based application development is increasingly being adopted by software organizations. Frameworks provide reuse of both software design and code, and supply more trustable applications, as the components used to implement them have been previously tested. However, version control is more problematic than in conventional software development, as it is necessary to control both the framework versions and the versions of the applications created with it. Furthermore, aiming to minimize the impact of system requirement changes, framework based software development and reengineering processes adopt the incremental approach, which is a “must” in agile methodologies. This approach makes easier to fulfill requests for system requirements change at any time during the process application. In that context, there is a lack of tools that support version control of applications created with frameworks. This paper presents a tool that aims to aid in the fulfillment of that need, contributing to quality assurance of the products that result from software development or reengineering.", "num_citations": "4\n", "authors": ["2191"]}
{"title": "Evolução Orientada a Aspectos de um Framework OO\n", "abstract": " Os frameworks orientados a aspectos surgiram recentemente como resultado da combinaçao das tecnologias de frameworks e programaçao orientada a aspectos. Eles constituem uma abordagem bastante promissora para aumentar a reusabilidade dos frameworks e facilitar sua evoluçao. De um lado a progamaçao orientada a aspectos torna possıvel a separaçao e implementaçao de interesses, o quee importante para melhorar a manutenibilidade no desenvolvimento de software. Os frameworks, por outro lado, possibilitam o reuso e personalizaçao de uma implementaçao particular em aplicaçoes diferentes. Este artigo apresenta a evoluçao de um framework OO usando a abordagem de programaçao orientada a aspectos e faz uma avaliaçao dos resultados obtidos.", "num_citations": "4\n", "authors": ["2191"]}
{"title": "Enhancing Future Classroom Environments Based on Systems of Systems and the Internet of Anything\n", "abstract": " Currently, research centers, government, and industry have been developing technologies to enable novel capabilities for future classrooms. The Internet of Things (IoT), the Internet of Everything (IoE), and the Internet of Anything (IoA) are examples of technological paradigms that could transform current classrooms into collaborative classrooms. In this article, we investigate the design and simulation of a systems architecture that employs concepts related to System of Systems (SoS) and IoA to extend the capabilities of future classrooms. We design such architecture to be service oriented and to provide interactions between each established constituent system (CS), which is composed by the following elements: 1) local IoE modules; 2) CS negotiator agent; and 3) IoE/IoA agent. We consider a case study about interschool collaborations to improve learning in biology classes. Our results indicate that the usage of …", "num_citations": "3\n", "authors": ["2191"]}
{"title": "Context-aware ubiquitous learning: Literature systematic mapping on ubiquitous learning environments\n", "abstract": " Context-aware ubiquitous learning (u-learning) environments are systems applied in the field of education, characterized by the ability to collect information from the student's context and modify your behavior, adapting to the characteristics and student's learning needs. In addition, another important feature of u-learning is to provide access to computing learning resources anywhere, anytime, regardless of the user's device type. Faced with this new scenario, still unknown to most of the academic community, this paper proposes to investigate the context-aware u-learning environments, proposed in the literature of the area, to know the educational services and the types of context used in these environments, through a systematic mapping of the literature.", "num_citations": "3\n", "authors": ["2191"]}
{"title": "Model-oriented web services\n", "abstract": " Model-Driven Software Engineering (MDSE) has been successfully applied in order to accelerate the development of Web Services (WS). Despite the reported successes identified by a systematic mapping in this context, there was no reported method that takes advantage of modelling facilities outside the development phases by exposing the models as a feature to the end-users. Therefore, in this paper, we study how would be possible to push MDSE to be more than a method to accelerate development. In our envision, MDSE could be evolved into a paradigm suitable to create WS systems that present modelling principles from MDSE as features visible to the end-users while functioning employing tools originally meant for MDSE development for several other uses. We refer to these MDSE-evolved WS systems as Model Oriented Web Services (MOWS). We also provide a pattern and a development process to …", "num_citations": "3\n", "authors": ["2191"]}
{"title": "A service-based architecture for virtual and collaborative system of systems\n", "abstract": " System of Systems (SoS) provide means of integrating independent systems aiming at achieving goals that could not be accomplished if these systems were executed isolated. Among the several types of SoS identified in the literature, virtual SoS still pose several challenges to be built. By not depending on a central coordinator, virtual SoS are the most robust type of SoS. On the other hand, collaborative SoS presents the advantage of having a well established emergent behavior design, which we intend to combine with the robustness of virtual SoS. Therefore, in this paper we propose a reference architecture to build SoS of a mixed type between virtual and collaborative. We present a prototype we built as a proof of concept of the proposed architecture that employs services for communication among constituents. We also describe how the architecture has been applied for a SoS in the software engineering tool domain. As conclusions, the architecture was successfully applied to implement a mixed-type SoS since its inception. In addition, the developed prototype can be reused for other SoS instances in different domains.", "num_citations": "3\n", "authors": ["2191"]}
{"title": "Methodologies for Evaluation and Improvement of Software Processes in the Context of Quality and Maturity Models: a Systematic Mapping.\n", "abstract": " A widely recognized fact is that the quality of software products is largely determined by the quality of the process used to develop them. Regardless of the number of tools/frameworks developed to aid companies to perform software process assessment (SPA) and improvement (SPI) activities, the industry often suffers with quality issues in their products. In order to evaluate the SPA and SPI research areas, a systematic mapping was performed to identify the available tools/frameworks and methodologies used in research, as well as the existing gaps in the area. As a result it was possible to identify the current trends in the SPA and SPI research areas that can be used as a guideline to future work and can contribute to the software engineering and quality community.", "num_citations": "3\n", "authors": ["2191"]}
{"title": "ONTO-ResAsset Development: An Ontology for Reusable Assets Specification and Management.\n", "abstract": " Reuse is an important mechanism to increase productivity and to reduce time and costs during software development. Although source code is the most commonly reusable asset, other types of assets can also be reused, such as requirements, business processes, analysis and design models, etc. In this context, it is important that the knowledge about reusable assets and its management are available to potential stakeholders. This work presents the development of an ontology of reusable assets specification and management, named ONTO-ResAsset. This ontology is evaluated under two points-of-view: domain experts and non-experts.", "num_citations": "3\n", "authors": ["2191"]}
{"title": "An approach based on takagi-sugeno fuzzy inference system applied to the operation planning of hydrothermal systems\n", "abstract": " The operation planning in hydrothermal systems with great hydraulic participation, as it is the case of Brazilian system, seeks to determine an operation policy to specify how hydroelectric plants should be operated, in order to use the hydroelectric resources economically and reliably. This paper presents an application of Takagi-Sugeno Fuzzy Inference Systems to obtain an operation policy (PBFIS Policy Based on Fuzzy Inference Systems) that follows the principles of the optimized operation of reservoirs for electric power generation. PBFIS is obtained through the application of an optimization algorithm for the operation of hydroelectric plants. From this optimization the relationships between the stored energy of the system and the volume of the reservoir of each plant are extracted. These relationships are represented in the consequent parameters of the fuzzy linguistic rules. Thus, PBFIS is used to estimate the …", "num_citations": "3\n", "authors": ["2191"]}
{"title": "Using aspect-oriented programming to promote reuse across domains in software product lines\n", "abstract": " Using aspect-oriented programming to promote reuse across domains in software product lines Page 1 1 Using aspect-oriented programming to promote reuse across domains in software product lines Rosana Teresinha Vaccare Braga Paulo Cesar Masiero Carlos AF Pereira Jr. Universidade de São Paulo Instituto de Ciências Matemáticas e Computação – ICMC – São Carlos Page 2 2 Introduction ○ Objective: ● Combined use of AOP and SPL to improve reuse across different domains ○ Crosscutting domains and crosscutting features ● Benefits: avoid tangling and scattering of features, incresase reuse in other SPLs, higher cohesion, better system maintenance and evolution ○ Context: Code Generator Captor Page 3 3 SPL development considering aspects ○ What happens when we have several SPLs (for several domains)? ● Features (functional or non-functional) begin to appear in more than one …", "num_citations": "3\n", "authors": ["2191"]}
{"title": "An energetic operation policy using Fuzzy Controllers for maximization of benefits in the brazilian hydrothermal power system\n", "abstract": " This paper aims to determine an energetic operation policy (EOP) for hydrothermal power systems. In order to determine the EOP, the optimal solution of a deterministic hydrothermal scheduling model was utilized. The EOP was calculated to follow the trajectories obtained by the optimization model. The resulting trajectories were parameterized in terms of the system total energy storage. Using the system energy storage, it is possible to obtain, for each reservoir, the set of points from which a curve can be adjusted using the Takagi-Sugeno Fuzzy Controller. The EOP proposed through the Takagi-Sugeno Fuzzy Controller is used in simulation models to allow comparisons with the adopted EOP in practice in Brazil (parallel policy). As it will be shown in this paper, the proposed EOP using fuzzy controllers maximizes the hydroelectric generation and, as consequence, minimizes the thermoelectric generation cost in the …", "num_citations": "3\n", "authors": ["2191"]}
{"title": "Peônia: um ambiente web para apoiar processos de desenvolvimento com utilizaçao de padroes de software e requisitos de teste no projeto de aplicaçoes\n", "abstract": " A expansão e a popularização da World Wide Web têm incentivado o desenvolvimento de aplicações Web. É crescente a exigência por aplicações Web cada vez mais complexas, cujo desenvolvimento deve ser feito com qualidade e rapidez. Para orientar o ciclo de vida dessas aplicações, diversos métodos de desenvolvimento Web têm sido criados, além de ferramentas de apoio a sua utilização. O emprego de padrões de software no desenvolvimento de aplicações pode aumentar a produtividade e a qualidade. Com o objetivo de minimizar erros e facilitar a utilização, ferramentas de apoio à utilização de padrões têm sido desenvolvidas. No entanto, há uma carência por ambientes e ferramentas que apóiem o emprego de padrões durante as etapas do desenvolvimento de aplicações. Algumas das principais atividades para a garantia da qualidade de software são as de VV&T (Verificação, Validação e Teste). Algumas iniciativas de associação de teste a padrões têm sido estudadas com o intuito de minimizar o tempo despendido em VV&T. Neste trabalho é apresentado o ambiente Peônia com o intuito de apoiar o emprego de padrões de software durante as etapas de um processo de desenvolvimento. Para isso, os padrões de software podem ser previamente associados a essas etapas para que possam ser sugeridos durante a execução de um projeto. Além disso, o ambiente Peônia oferece a possibilidade de associar requisitos de teste a padrôes de software, para auxiliar nas atividades de VV&T. Também é proposto um Método Para Desenvolvimento Utilizando Padrões de Software, formalizando a técnica empregada no …", "num_citations": "3\n", "authors": ["2191"]}
{"title": "Análise, projeto e implementação orientado a objetos aplicados ao planejamento da operação energética de sistemas hidrotérmicos de potência\n", "abstract": " O artigo trata do planejamento da operação energética de sistemas hidrotérmicos de potência, apresentando uma modelagem (análise e projeto) e implementação de uma ferramenta computacional, utilizando o paradigma da orientação a objetos, aplicada ao sistema hidrotérmico brasileiro de geração de energia elétrica, considerando a representação individualizada das usinas. São modelados e implementados sob este paradigma, as partes físicas do sistema e o algoritmo de otimização, mostrando-se as vantagens dessa abordagem. A fim de validar a eficácia da ferramenta computacional, algumas características importantes da operação otimizada são apresentadas através de testes realizados sobre um sistema real.", "num_citations": "3\n", "authors": ["2191"]}
{"title": "System Development Using a Pattern Language-Based Tool.\n", "abstract": " Domain-specific pattern languages can be used to model applications, so that following particular paths in the pattern language lead to the complete design of particular systems. This paper shows how to use a pattern language-based analysis method and tool to help in the development of domain-specific systems, where the development is basically done at the analysis level. The requirements of the target system are matched against analysis patterns, so that the system is specified in terms of the patterns used to model it. The tool is fed with this information and uses it to instantiate a framework that was built based on the same pattern language. The result is the source-code for the target system, which can be used as a prototype, extended or improved to become the real system.", "num_citations": "3\n", "authors": ["2191"]}
{"title": "GRN: Uma Linguagem de Padrões para Gestão de Recursos de Negócios\n", "abstract": " ∎ Desenvolvida com base em experiência prática no desenvolvimento de sistemas de Gestão de Recursos de Negócio∎ Recursos de Negócios: bens ou serviços, por exemplo, produtos ou tempo de um especialista∎ Gestão: Locação, Comércio ou Manutenção∎ Utilização de alguns padrões existentes∎ Precedida por uma família de padrões (PLoP’98)∎ Apresentada no PLoP’99", "num_citations": "3\n", "authors": ["2191"]}
{"title": "Simulating systems-of-systems with agent-based modeling: A systematic literature review\n", "abstract": " In this article, we conduct a systematic review to investigate how agent-based modeling (ABM) techniques have been applied for simulating systems-of-systems (SoS) domains. We understand that modeling and simulating SoS is a hard task and must be conducted by techniques (e.g., ABM) that represent the behavior of agents and the operation of an SoS to overpass this complexity. We evaluate the most utilized models, approaches, and tools. We also investigate how accurate are the SoS simulations performed by this technique and which are the most investigated problems. As a result, we identify which tools and approaches have been utilized to investigate the behavior of SoS.", "num_citations": "2\n", "authors": ["2191"]}
{"title": "IoT applications to combat Aedes aegypti: a Systematic Literature Mapping\n", "abstract": " Dengue, zika and chikungunya are examples of serious diseases affecting mainly developing countries, such as Brazil. Data from the World Health Organization (WHO) about these diseases transmitted by Aedes aegypti mosquito are worrisome, especially in relation to their possible effects. Considering this scenario severity, Internet of Things based applications (IoT applications) are being used to support it. So, this paper aims to select and organize, through information collection, difficulties that can be found in the medical use of IoT applications to combat this mosquito. The objective was to find possible gaps for future research. A Systematic Literature Mapping was performed to find possible deficiencies in the methodologies addressed by the authors of the returned studies. This systematic mapping intends to list these difficulties, as well methods proposed to improve the use of IoT in Health (especially combat to …", "num_citations": "2\n", "authors": ["2191"]}
{"title": "An approach to integrate systems towards a directed system-of-systems\n", "abstract": " According to a previously conducted systematic literature review, there are several remaining challenges related to integrating software systems. These systems have become increasingly complex, and they are often formed by integrating independent systems, resulting in a new class of systems referenced as System-of-Systems (SoS). However, there is a lack of studies that are comprehensive and, at the same time, contain a detailed view of how the constituent systems are integrated in order to collectively achieve a common goal. In systematic literature review conducted in this context, it was identified that several of remaining challenges is due to the lack of documentation about integration in SoS, its constituents and their relationships. Based on this scenario, the main contribution of this work is to investigate and propose an approach to assist the Software Engineering community during the integration among …", "num_citations": "2\n", "authors": ["2191"]}
{"title": "Model-Oriented Web Service Implementations Compared to Traditional Web Services\n", "abstract": " Model-Oriented Web Services (MOWS) are a specific kind of Web Services (WS) that employ models for artifacts, including data transmission. They foster reuse due to its higher abstraction levels, and allow to visualize the data as models that represent a common language. However, it is important to study possible disadvantages when compared to traditional WS systems. Therefore, in this paper, we present a study on the impact of MOWS, including technological aspects, and providing comparisons of length of data transmission in a mathematical analysis for attesting its exact difference when comparing MOWS to similarly structured traditional WS. Results include a technical discussion and proof that the length difference has a constant increase when compared to a similarly structured traditional WS. We conclude that MOWS is not recommended to all applications. Still, the differences would be dimmed by …", "num_citations": "2\n", "authors": ["2191"]}
{"title": "An approach for reusing software process elements based on reusable asset specification: a software product line case study\n", "abstract": " Software reuse is becoming an important focus of both academic and industrial research since the rising demand for new software products and technologies is constantly growing. The short time to market, limited resources and lack of specialists are the main reasons for this investment on software reuse. As long as customers demand speed to deliver, there is a increasing special concern about software quality. In this context, we propose an approach to support both better time to market and software quality from reusing software process elements using the Reusable Asset Specification (RAS). This approach presents a mapping structure to represent process elements as reusable assets. The sharing of process elements among several projects aims to decrease time spent on defining the process model, as well as reducing the space used to store processes and their elements. Documenting these processes will also be facilitated, since it is possible to reuse a whole process or process’s sub-trees that have already been documented or even certified. To illustrate our approach, we present a case study where a Software Product Line (SPL) process is mapped to RAS, highlighting the issues raised during the mapping and how we proposed to solve them.", "num_citations": "2\n", "authors": ["2191"]}
{"title": "From software product lines to system of systems: Analysis of an evolution path\n", "abstract": " Software Product Line (SPL) refers to engineering methods and techniques able to deliver families of related products designed to meet domain-specific requirements and increase software reuse. System of Systems (SoS) is a composition of independent and interoperable systems intended to achieve unique goals collectively. In this paper, we discuss about conventional SPL approaches and the reasons why they commonly are not a natural choice for delivering SoS members. Then, we propose an evolution path for SPL Engineering (SPLE) to narrow the gap between SPL and SoS. Finally, we present a case study in which we designed a sample SoS by composing systems instantiated from SPL.", "num_citations": "2\n", "authors": ["2191"]}
{"title": "An Application of Genetic Fuzzy Systems to the Operation Planning of Hydrothermal Systems\n", "abstract": " The operation planning of hydrothermal systems aims to specify how the set of power plants should be operated so that the resources available for power generation are used efficiently. In hydrothermal systems with great participation of hydroelectric generation, as is the case of the Brazilian system, the operation planning intends to establish Reservoir Operation Rules (RORs) to replace, whenever possible, the thermoelectric generation by the hydroelectric generation (Christoforidis et al., 1996). Due to their peculiar characteristics, the operation planning of the Brazilian hydrothermal system can be classified as a problem coupled in time (dynamic) and space (not separable), nonlinear, nonconvex, stochastic and large scale (Leite et al., 2002; Oliveira & Soares, 1995; Silva & Finardi, 2001). It is worth mentioning that the RORs are present in some stages of the operation planning of hydrothermal systems, such as:", "num_citations": "2\n", "authors": ["2191"]}
{"title": "New record of Dyoctophyma renale in the maned wolf (Chrysocyon brachyrus) in the State of Goiás, Brazil\n", "abstract": " The maned wolf (Chrysocyon brachyurus) is the largest canid of South America and is classified as Near Threatened by International Union for Conservation of Nature. This species has a large home range and often occurs in areas where human-wildlife conflicts are likely to take place. The maned wolf has been previously shown to be infected by a diversity of parasite species. Here we present a new record of the giant kidney worm (Dyoctophyma renale Goeze 1972) in the maned wolf found in the State of Goiás, central Brazil. This parasite has been also found in other Brazilian states and has been shown to be linked to C. brachyurus mortality rates. The occurrence of this parasite in the State of Goiás is a crucial piece of information for evaluating the distribution as well as the potential influence of this parasite on the plight of the maned wolf in Brazil.", "num_citations": "2\n", "authors": ["2191"]}
{"title": "Implementing relationships among classes of analysis pattern languages using aspects\n", "abstract": " Patterns within an analysis pattern language are related to each other in several ways: the application of a pattern can result in the application of another, a pattern can be applied only if another pattern was applied (or was not applied), etc. Also, several variants of a pattern may co-exist, and the application of a particular variant can lead to the inclusion or removal of associations between classes that form the pattern. In this paper, we show how we have used aspect-oriented programming to implement relationships between classes of an analysis pattern or between classes shared by more than one pattern. This allows the incremental development of a framework to support the pattern language, and also eases the instantiation of patterns and pattern variants.", "num_citations": "2\n", "authors": ["2191"]}
{"title": "Uma Ferramenta de Apoio ao Controle de Versão das Aplicações Criadas por um Framewok\n", "abstract": " O desenvolvimento de aplicaçoes baseado em frameworks vem sendo praticado cada vez mais pelas empresas de software. Frameworks proporcionam reuso de projeto e de código, e fornecem aplicaçoes mais confiáveis, uma vez que seus componentes, utilizados para construı-las, foram testados anteriormente. No entanto, a problemática do controle de versao é mais grave do que no desenvolvimento de software convencional, pois é necessário controlar tanto as versoes do framework quanto as das aplicaçoes por ele criadas. Além disso, visando minimizar o impacto das mudanças que ocorrem nos requisitos do sistema, processos de desenvolvimento e de reengenharia de software baseados em frameworks adotam a abordagem incremental, que é indispensável a metodologias ágeis. Essa abordagem facilita o atendimento das solicitaç oes de mudanças nos requisitos do sistema, em qualquer momento …", "num_citations": "2\n", "authors": ["2191"]}
{"title": "Empirical studies on framework-based (re)-engineering\n", "abstract": " This paper presents our experience with experimentation using frameworks, as well as the perspectives we have to apply it in the near future. We also discuss insights and lessons learned from our experience in this field.", "num_citations": "2\n", "authors": ["2191"]}
{"title": "Padrões para o Processo de Engenharia Avante na Reengenharia Orientada a Objetos de Sistemas Legados Procedimentais\n", "abstract": " Padrões de reengenharia, incluindo engenharia reversa e engenharia avante são desenvolvidos por profissionais experientes, registrando como esses profissionais conduzem esses processos. Esses padrões têm como objetivo auxiliar engenheiros de software a conduzir esses processos em seus sistemas legados. A Família de Padrões de Reengenharia-FaPRE/OO-para a Reengenharia Orientada a Objetos de Sistemas Legados Procedimentais foi criada para conduzir esses processos a partir de sistemas legados procedimentais, tendo sistemas orientados a objetos como alvo. Foram apresentados no SugarLoafPLoP'2002 os padrões da FaPRE/OO para o processo de engenharia reversa. Neste trabalho, são apresentados os padrões para o processo de engenharia avante, ilustrando-se, passo a passo, o seu uso.", "num_citations": "2\n", "authors": ["2191"]}
{"title": "Understanding System of Systems Management: A Systematic Review and Key Concepts\n", "abstract": " The growth of knowledge required for the management of software projects is directly related to the growth of systems’ complexity and integration efforts. In this sense, Systems Engineering and Project Management teams must strengthen their relationships toward being involved in large-scale projects. This relationship is even more challenging in System of Systems Engineering, in which different constituent systems for achieving a common goal. The management of system of systems is an open research area with several gaps, especially those related to authority, responsibility, and scale. This article investigates approaches for an improved management of system of systems and constituent systems. A systematic review was conducted for the understanding of the current gaps related to managerial concepts in the system of systems context, as well as problems, challenges, and benefits. Open research issues …", "num_citations": "1\n", "authors": ["2191"]}
{"title": "Risk management for system of systems: A systematic mapping study\n", "abstract": " Context: System of Systems (SoS) is a set of independent systems that cooperate to achieve an emergent behavior. SoSs have been used in different domains such as defense, transportation, energy, and health care, which directly impact on the society. The critical nature of SoS, in which a failure in one of its Constituent Systems (CSs) may lead to catastrophic damages to the property, environment, injuries or loss of human's life, demands risk management activities. Existing risk management practices applied to SoS are extensions of risk management techniques at the CS level. Objective: in this paper, we present an overview of risk management approaches and tools for SoS. Method: we performed a Systematic Mapping (SM) study by searching into five databases to identify primary studies. We identified 22 primary studies related to risk management practices for SoS. Results: from the analysis of these primary …", "num_citations": "1\n", "authors": ["2191"]}
{"title": "Um Jogo Educacional U-Learning no Processo de Ensino e Aprendizagem da Geometria Analítica\n", "abstract": " A aprendizagem da Geometria Analítica pode tornar-se um desafio para o aluno diante de modelos de ensino que se baseiam em aulas expositivas de conteúdo, apenas. A u-learning sensível ao contexto pode ser uma ferramenta capaz de auxiliar neste processo de ensino, pois adapta-se ao meio e necessidades individuais do aluno. Outra ferramenta de auxílio é o uso de jogos educacionais, visando despertar o interesse e motivação. Este artigo propõe um jogo educacional móvel, em desenvolvimento, u-learning sensível ao contexto de localização do usuário, baseado no jogo “batalha Naval”. O jogo objetiva tornar mais lúdico a aprendizagem da Geometria Analítica facilitando ao aluno criar um elo entre a teoria e a prática.", "num_citations": "1\n", "authors": ["2191"]}
{"title": "Understanding the successes and challenges of model-driven software engineering-a comprehensive systematic mapping\n", "abstract": " Model-Driven Software Engineering (MDSE) is a development method in which models are used to generate software. Despite documented advantages, projects employing MDSE may fail due to development challenges. In this paper, we study and document these challenges by conducting an up-to-date systematic mapping that goes beyond reviewing MDSE studies: we also include two derived paradigms (Model-Oriented Programming and Models at Run-time). Therefore, we present a systematic mapping with two objectives: The first objective was to identify specific domains in which MDSE is successful, while the second objective was to identify what are the challenges to apply this methodology to general purpose development processes. Following the review of 4859 studies (3727 are unique), we have identified the application and technological domains in which MDSE projects are more likely to succeed …", "num_citations": "1\n", "authors": ["2191"]}
{"title": "Museus Virtuais e Ecomuseus-Uma experiência fazendo uso de IoT\n", "abstract": " Uma diversidade de acervos de inestimável valor histórico e cultural, contendo objetos de diversas naturezas, pode ser encontrado espalhado. Nesse sentido, ferramentas de Tecnologias de Informação e Comunicação (TICs), mais especificamente a Internet das Coisas (do Inglês Internet of Things-IoT), podem permitir melhoria de atividades de educação e sensibilização de patrimônios culturais e ambientais. A implementação deste trabalho se deu por meio da instanciação do Museu da Fauna e Flora do ICMC-USP (MFF-ICMC), e foi feita utilizando um Progressive Web App (PWA) em conjunto com a Web física e bluetooth low energy beacons. Neste artigo explora-se uma nova forma de interação com o museu, por meio de uma aplicação que busca mostrar, de forma passiva para o usuário, um link com uma referência para maiores informações sobre o elemento do museu próximo ao usuário.", "num_citations": "1\n", "authors": ["2191"]}
{"title": "Proposta de Uma Linha de Produtos de Software para Sistemas de Aprendizagem Ubíquos com Internet das Coisas\n", "abstract": " Os sistemas de aprendizagem podem incorporar dispositivos da Internet das Coisas, os quais adquirem a ciência de contexto por meio de sensores e permitem que os sistemas de aprendizagem evoluam rumo ao aprendizado ubíquo. No entanto, conforme identificado por um Mapeamento Sistemático realizado anteriormente, desenvolver sistemas para este domínio de aplicação envolve um alto grau de retrabalho, já que técnicas de reúso de software são pouco exploradas. Com base nisto, este trabalho apresenta a UL-SOPL (Ubiquitous Learning Service-Oriented Product Line), uma Linha de Produtos Orientada a Serviços projetada a partir de sistemas de aprendizagem existentes. São apresentados cenários de uso em que a UL-SOPL é instanciada derivando sistemas de aprendizagem específicos.", "num_citations": "1\n", "authors": ["2191"]}
{"title": "Aprendizagem ubíqua sensível ao contexto: mapeamento sistemático da literatura sobre ambientes de aprendizagem ubíqua\n", "abstract": " Ambientes de aprendizagem ubíqua (u-learning) sensíveis ao contexto são sistemas aplicados no domínio da educação, caracterizados pela capacidade de coletar informações do contexto do aluno e modificar seu comportamento, adaptando-se às característica e necessidades de aprendizagem do aluno. Além disso, outra característica importante da u-learning é prover acesso aos recursos computacionais de aprendizagem em qualquer lugar e a qualquer hora, independente de tipo de dispositivo do usuário. Diante deste novo cenário, ainda desconhecido para a maioria da comunidade acadêmica, este artigo se propõe a investigar os ambientes u-learning sensíveis ao contexto propostos na literatura da área e conhecer os serviços educacionais e os tipos de contexto utilizados nesses ambientes, por meio de um mapeamento sistemático da literatura.", "num_citations": "1\n", "authors": ["2191"]}
{"title": "Aires: An architecture to improve software reuse\n", "abstract": " Among the several challenges still faced by Software Engineering, software reuse can be listed as a potential solution towards improving productivity and quality, through the utilization of previously produced artifacts that can leverage development activities. Among these artifacts we can mention not only code, but also requirements’ documents, analysis and design models, test cases, documentation, and even development processes that achieved success in the past and could be reused again and again. However, the diversity of methods, processes and tools for software engineering make it difficult to turn reuse into a systematic activity. Considering this context, the present paper aims at presenting an architectural model that encompasses the main elements needed to support software reuse in a large scale. This model, named AIRES, allows reuse to be realized intrinsically to the development process …", "num_citations": "1\n", "authors": ["2191"]}
{"title": "Application engineering of service-based software product lines\n", "abstract": " Software product lines (SPL) correspond to one of the most successful forms of reuse, since they allow the reuse of both requirements and architecture. The investment done in the SPL development can get repaid after several various products are derived from the SPL, in particular, when an application generator is used to automate the derivation of products. SPL can benefit from web service Technology, as several features can be implemented by services available on a network. This paper presents an approach in which an application generator is used for deriving members of an SPL based on services. The objective is to reduce development cost and time, increasing productivity for SPL members derivation and taking advantage of the flexibility afforded by the use of services in the SPL architecture. Additionally, this paper presents a case study where this approach was applied to a Web auction SPL.", "num_citations": "1\n", "authors": ["2191"]}
{"title": "Priorização espacial para conservação de Carnívoros (Mammalia) no Brasil\n", "abstract": " LISTA DE FIGURAS viii LISTA DE TABELAS xi APRESENTAÇÃO xii RESUMO xv ABSTRACT xvii", "num_citations": "1\n", "authors": ["2191"]}
{"title": "A catalogue of stub and driver patterns to support integration testing of aspect-oriented programs\n", "abstract": " This work presents a pattern collection aiming at supporting the integration testing design of aspect-oriented software. Such patterns provide a reduction in the effort of implementing stubs and drivers required for the integration testing. Furthermore, guidelines to implement these software artifacts are proposed to support the testing of aspect-oriented programs.", "num_citations": "1\n", "authors": ["2191"]}
{"title": "Peony: A web environment to support pattern-based development\n", "abstract": " The development of Web applications using software patterns, test requirements, and established processes helps to increase teams productivity and the final product quality. However, there is a lack of tools for supporting developers on the use of software patterns in the several stages of a development process, beyond assisting the validation of the reused solutions. Thus, this article presents a Web environment, named Peony, that aims at facilitating the reuse of software patterns and test requirements during software development. Peony allows the software engineer to include the development processes followed by the organization, and to associate patterns to their phases and/or activities, so that during the development of a particular project the developer can more easily reuse these patterns. Also, for each pattern, Peony suggests test requirements for assisting the validation of applications under development.", "num_citations": "1\n", "authors": ["2191"]}
{"title": "Uso de padrões em linhas de produtos de software: Uma revisão sistemática\n", "abstract": " Muitas organizações estão adotando Linhas de Produtos de Software(LPS) com o objetivo de aumentar sua produtividade, melhorar a qualidade de seus produtos e reduzir os custos de produção de software. Os benefícios dessa tecnologia são consideráveis e estão bem documentados na literatura. Entretanto, diversos problemas podem surgir na implantação e manutenção de uma LPS. Uma das formas para se resolver esses problemas de maneira rápida e com soluções testadas e comprovadas é a utilização de padrões. Este artigo apresenta os resultados de uma revisão sistemática que investigou o uso de padrões em LPS. A compilação desses resultados visa facilitar o uso desses padrões por desenvolvedores de LPS.Abstract. Many organizations are adopting Software Product Lines (SPL) with the aim of increasing their productivity, improve the quality of their products and reduce production costs. The …", "num_citations": "1\n", "authors": ["2191"]}
{"title": "The Role of Pattern Languages in the Instantiation of White-Box Object-oriented Frameworks\n", "abstract": " In this paper we propose the use of pattern languages to guide a framework instantiation. Both the framework and the pattern language refer to the same domain, and the framework must have been constructed based on the pattern language. The framework instantiation here proposed is done in several steps: analysis of the specific application, mapping between the application and the framework, implementation of the application classes, and test of the final application. All these activities are supported by the pattern language. This makes it easier for the developer to instantiate applications, as the knowledge about the pattern language is used during the instantiation process. The proposed approach is illustrated with the example of a framework we have built based on a pattern language.", "num_citations": "1\n", "authors": ["2191"]}
{"title": "A Framework based on a Pattern Language for Business Resource Management\n", "abstract": " A framework based on a pattern language for Business Resource Management is under construction to be used for developing systems in the information systems domain. Business resources include assets and services, as products and repairs. By management we mean their trade, rental and maintenance. A pattern language has been developed for aiding in the analysis of systems for business resource management. It includes fourteen patterns for identifying the resource, quantifying it, renting, trading and maintaining it, reserve it, quote the trade, quote the maintenance, check its delivery, allowing several items to be dealt with in the same transaction, paying for the transaction, identifying the transaction executor, and identifying maintenance tasks and parts. One of the patterns is included, corresponding to trading the resource. A class model shows its structure (classes and relationships), and an application example shows the roles played by each participant class. An example of the pattern language usage for a car repair shop system is presented, together with an object model that shows the patterns used and the roles played by their participant classes. The present development stage of the framework is mentioned.", "num_citations": "1\n", "authors": ["2191"]}
{"title": "Legacy Systems Reengineering Using Software Patterns\n", "abstract": " In this work we present a case study for legacy systems reengineering using software patterns aiming at both easing the reengineering process and improving future maintenance. The approach used consists basically of three steps: apply reverse engineering, if necessary, to obtain an object model of the system; recognize software patterns present in the object model obtained; and reimplement the system in a more productive way, using toolkits or specific frameworks that implement the patterns found. Results of some experiments show that reengineering has been facilitated as well as system maintenance, because components became clearly delimited and larger chunks of design may now be understood as a whole and reused.", "num_citations": "1\n", "authors": ["2191"]}
{"title": "A pattern language-based approach for framework construction and instantiation\n", "abstract": " Software patterns and pattern languages emerged aiming at reuse, but in higher abstraction levels than object-oriented software frameworks. Software patterns try to capture the experience acquired during software development and synthesize it in a problem/solution form [1, 4]. A pattern language is a structured collection of patterns that build on each other to transform needs and constraints into an architecture. It represents the temporal sequence of decisions that lead to the complete design of an application, so it becomes a method to guide the development process [3]. There are a few methods for framework development, of which we can mention the hot-spot driven framework development [5] and the framework design by systematic generalization [6, 7]. Framework hot spots are the parts that have to be kept flexible, as they are specific of individual systems. They are designed to be generic and need to be adapted according to the requirements of each application that can be instantiated using the framework. Generally they are discovered first by domain analysis and then by successive framework refinements. However, each new discovery may imply in the need to redesign part of the framework, which makes development more complex. The best approach is to know beforehand which are the framework hot spots, in order to minimize the number of iterations needed for its construction.Pattern languages reflect experience in specific domains, covering all their main aspects. Consequently, they have built-in information about the points that differ from one application to another. According to Brugali and Menga there is an intriguing …", "num_citations": "1\n", "authors": ["2191"]}