{"title": "Smart cane: Assistive cane for visually-impaired people\n", "abstract": " This paper reports on a study that helps visually-impaired people to walk more confidently. The study hypothesizes that a smart cane that alerts visually-impaired people over obstacles in front could help them in walking with less accident. The aim of the paper is to address the development work of a cane that could communicate with the users through voice alert and vibration, which is named Smart Cane. T he development work involves coding and physical installation. A series of tests have been carried out on the smart cane and the results are discussed. This study found that the Smart Cane functions well as intended, in alerting users about the obstacles in front", "num_citations": "120\n", "authors": ["1256"]}
{"title": "Conceptual modeling for simulation: Steaming frozen food processing in vending machine\n", "abstract": " Nowadays, frozen foods are well-known among Malaysia society. This is due to the modern lifestyles which require short food preparing times without neglecting the food nutritious. In supporting this requirement, the manipulation of vending machine is identified as a tool to promote modern and healthy living style, besides to simplify the cooking process. This paper describes the effort on designing conceptual model for a proposed steaming food vending machine simulator. Conceptual modelling is the most crucial part in developing simulation model; since in this part, the developer need to identify the variables; recognize the desired simulation flows and transform the deliverables into visualized form which can be understood by all parties related to the project. In this study, the process of three main states (user selection state, freezer state and steaming state) has been modelled using process approach, which …", "num_citations": "22\n", "authors": ["1256"]}
{"title": "Lowest data replication storage of binary vote assignment data grid\n", "abstract": " Data replication is one of the mechanisms in data grid architecture since it improves data access and reliability. There are many replication techniques exist in distributed systems environment include Read-One-Write-All (ROWA), Branch Replication Scheme (BRS), Hierarchical Replication Scheme (HRS) and our previous Binary Vote Assignment Data Grid (BVADG) techniques. All these techniques deploy different approaches of data placement in distributed environment. This paper presents the comparison of the replication storage between all these techniques. The result shows that BVADG has the lowest data replication storage between ROWA, BRS and HRS due to the small quorum approach of data placement.", "num_citations": "20\n", "authors": ["1256"]}
{"title": "A tree based strategy for test data generation and cost calculation for uniform and non-uniform parametric values\n", "abstract": " Software testing is a very important phase of software development to ensure that the developed system is reliable. Due to huge number of possible combinations involved in testing and the limitation in the time and resources, it is usually too expensive and sometimes impossible to test systems exhaustively. To reduce the number of test cases to an acceptable level, combinatorial software interaction testing has been suggested and used by many researchers in the software testing field. It is also reported in literature that pairwise (2-way) combinatorial interaction testing can detect most of the software faults. In this paper we propose a new strategy for test data generation, a Tree Based Test Case Generation and Cost Calculation strategy (TBGCC) that supports uniform and non-uniform values, for input parameters (i.e. parameters with same and different number of values). Our strategy is distinct from others work …", "num_citations": "13\n", "authors": ["1256"]}
{"title": "Data Replication Using Read-One-Write-All Monitoring Synchronization Transaction System in Distributed Environment 1\n", "abstract": " Nowadays, the demand of transmitted information over networks increase rapidly and the demand for steady bandwidth seems to be out of control. Particularly organizations need to provide updated data to users that might be geographically remote and handling a vast amount of requested data distributed in multiple sites. Problem statement: Replication in distributed environment has become increasingly popular due to its high degree of availability, fault tolerance and enhance the performance of a system. These advantages of replication are important because it enables organizations to provide users with access to current data anytime or anywhere even if the users are geographically remote. However, this way of data organization also introduces low data consistency among replicas when changes are made during transactions. The need to have a system to monitor this data replication arises. Approach: Read-One-Write-All Monitoring Synchronization Transaction System (ROWA-MSTS) has been developed to solve this problem by using Rapid Application Development (RAD). Results: ROWA-MSTS helped to monitor the replicated data distribution over multiple sites while maintaining the data consistency. Conclusion: Results showed that ROWA-MSTS solved the distributed concurrency transactions and guarantees the data consistency in distributed systems.", "num_citations": "12\n", "authors": ["1256"]}
{"title": "Tree based test case generation and cost calculation strategy for uniform parametric pairwise testing\n", "abstract": " Problem statement: Although it is very important to test any system extensively it is usually too expensive to do so owing to the cost and the resources that are involved in it. Software testing is a very important phase of software development to ensure that the developed system is reliable. Some systematic approach for testing is essential to test any system and make it acceptable. Combinatorial software interaction testing is one which tests all possible software interactions. This interaction could be at various levels such as two way interaction (pairwise) or three or four or five or six way interactions. Combinatorial interaction testing has been used in several fields. It is reported in literature that pairwise combinatorial interaction testing have identified most of the software faults. Approach: In this study we proposed a new strategy for test suite generation, a tree generation strategy for pairwise combinatorial software testing, with parameters of equal values. The algorithm considers one parameter at a time systematically to generate the tree until all the parameters are considered. This strategy uses a cost calculation technique iteratively for each of the leaf nodes to generate the test suite until all the combinations are covered. Results: The experimental data showed that we achieved about 88%(or more in some cases) of reduction in the number of test cases needed for a complete pairwise combinatorial software interaction testing. Conclusion: Thus, the strategy proposed has achieved a significant reduction in minimizing the number of test cases that is generated.", "num_citations": "10\n", "authors": ["1256"]}
{"title": "E-Appointment Scheduling (EAS)\n", "abstract": " E-Appointment Scheduling (EAS) has been developed to handle appointment for UMP students, lecturers in Faculty of Computer Systems & Software Engineering (FCSSE) and Student Medical Center. The schedules are based on the timetable and university activities. Constraints Logic Programming (CLP) has been implemented to solve the scheduling problems by giving recommendation to the users in part of determining any available slots from the lecturers and doctors’ timetable. By using this system, we can avoid wasting time and cost because this application will set an appointment by auto-generated. In addition, this system can be an alternative to the lecturers and doctors to make decisions whether to approve or reject the appointments.", "num_citations": "8\n", "authors": ["1256"]}
{"title": "Types of anti-phishing solutions for phishing attack\n", "abstract": " Nowadays, many people use Internet to do online activity. This scenario exposed them to danger in Internet which is phishing attack. In order to solve phishing attack, the anti-phishing solutions are needed. Based on our review, there are still lacks of articles that review on the types of anti-phishing solutions in detail. In this paper, a general idea of phishing attack and anti-phishing solutions is presented. The phishing attack can be classified into two categories which are social engineering and malware-based phishing attack. The anti-phishing solutions can be differentiating into two types which are phishing prevention and phishing detection. Compared to phishing prevention, the phishing detection is more important to solve the phishing attack. In phishing detection, there are two categories which are user awareness and software detection. The software detection has two methods which are traditional …", "num_citations": "7\n", "authors": ["1256"]}
{"title": "Empirical study on medicinal herbs information system (MHIS) in Malaysia\n", "abstract": " Nowadays, people are highly concerned about their health and start to recognize that herbs are one of the beneficial ingredients to spice up their life. But most of them do not know which herb can exactly benefit them or how it looks like. This paper presents the medicinal herbs information system (MHIS) design, which is a web-based application system. With this system, herb identification, herbal vocabulary and medicinal usages can provide a professional information station for people to collect herb knowledge and an interactive platform for people to exchange scientific ideas by using local/common language. Finally, in order to ensure the conceptual model is well defined, a set of rules for keyword searching is created to verify preciseness of output produced. The system is being planned to be applied in Taman Pertanian Jubli Perak Kuantan, Malaysia.       Key words: Medicinal herb, information system, Malaysia.", "num_citations": "6\n", "authors": ["1256"]}
{"title": "WAS-GN: Web-based appointment system with GSM network\n", "abstract": " This paper presents a new way of online communications through mobile to web that helps students and lecturers to be always aware of appointments no matter where they are. It contributes to the teaching and learning process, in which communication is made easy using short messaging system (SMS) technology which is called Web-based Student Appointment System with GSM Network (WASGN). It starts with examples of previous success stories of the implementation of SMS in many areas. The objectives of the paper are to discuss about the hardware and software requirement, and integrate them to be measured in terms of functionality. The research method is outlined next, and some discussions over current outcomes of the research are addressed. The prototype of WAS-GN is successfully implemented using SMS technology. Briefly, results show that WAS-GN is able to solve the appointment-making problem.", "num_citations": "6\n", "authors": ["1256"]}
{"title": "The Preferable Test Documentation Using IEEE 829\n", "abstract": " During software development, testing is one of the processes to find errors and aimed at evaluating a program meets its required results. In testing phase there are several testing activity involve user acceptance test, test procedure and others. If there is no documentation involve in testing the phase the difficulty happen during test with no solution. It because no reference they can refer to overcome the same problem. IEEE 829 is one of the standard to conformance the address requirements. In this standard has several documentation provided during testing including during preparing test, running the test and completion test. In this paper we used this standard as guideline to analyze which documentation our companies prefer the most. From our analytical study, most company in Malaysia they prepare document for Test Plan and Test Summary.", "num_citations": "4\n", "authors": ["1256"]}
{"title": "A novel algorithm of managing replication and transaction through Read-One-Write-All Monitoring Synchronization Transaction System (ROWA-MSTS)\n", "abstract": " The birth of remarkable advance in the development of computer and hardware in computer world has enables us to access information anytime and anywhere regardless of the geography factor. Therefore, replication in distributed system environment has become increasingly popular due to its high degree of availability, fault tolerance and enhance the performance of a system. Read-One-Write-All Monitoring Synchronization Transaction System (ROWA-MSTS) has been developed to monitor data replication and transaction perform in distributed system environment. This paper presents a new algorithm to manage replication and transaction using ROWA-MSTS. The propose algorithm through ROWA-MSTS by deploying real time application in distributed systems environment. The propose algorithm implementation shows that ROWA-MSTS able to monitor the replicated data distribution while maintaining the …", "num_citations": "4\n", "authors": ["1256"]}
{"title": "A preliminary study of adaptive random testing techniques\n", "abstract": " Software testing has many types of technique to increase the bug finding. One of the main testing techniques to be considered is including Random Testing (RT). The RT is the method of test in a random manner. The random approach can be a better method if we consider the information about the software under test. Due to this matter, a technique in selection of the test cases which is the reason the Adaptive Random Testing (ART) is proposed. So, we do a preliminary study about the ART to know about ART and to know the elements involves in ART. We found the ART technique are very actively focus area in year 2004 with main three notions: distance; restriction; and partition. This preliminary study helps in our guidance for our future research which is testing a new paradigm (Aspect-Oriented Program).", "num_citations": "3\n", "authors": ["1256"]}
{"title": "Managing Registration of New Student Intake using ORNSIS-Integrated Barcode Technology\n", "abstract": " The rapid progress in education impacts the significant requirement to manage the educational globalization resources through the use of modern technology. In addition, an online system is the electronic interactive medium that delivers information to users via telephone lines to personal computers (PCs) or via cables to terminals. This paper presents on how to manage the registration of new student intake by using Online Registration New Student Intake System (ORNSIS). Integrated barcode technology with ORNSIS has been developed in order to overcome the manual system weakness, which involves the registration through the traditional methods and time consuming. Understanding the importance and limitations the register process, ORNSIS is a collaborative of web application concept that provides a platform for University Malaysia Pahang administrator to monitor the progress of each new student who …", "num_citations": "3\n", "authors": ["1256"]}
{"title": "Neighbour replica transaction failure framework in data grid\n", "abstract": " Significant and urgent requirement to obtain solutions to manage, distribute and access large sets of raw and processed data efficiently and effectively in the emerging distributed systems such as the data grid. Data grid deals with the efficient management, placement and replication of large amounts of data. Nowadays, replication in distributed environment receives particular attention for providing efficient access to data, fault tolerance and enhance the performance of the system. This paper presents the new Neighbour Replica Transaction Failure Framework (NRTFF) in data grid. We address how to build reliable system for managing transaction on Neighbour Replication Data Grid (NRDG) to maintain data availability, fault tolerance and at the same time avoid the deadlock. The result shows that managing transactions on NRDG through the proposed NRTFF provides fault tolerance capabilities that allow …", "num_citations": "3\n", "authors": ["1256"]}
{"title": "A Parallel Tree Based Strategy for Test Data Generation and Cost Calculation for Pairwise Combinatorial Interaction Testing\n", "abstract": " Software testing is a very important phase of the software development cycle which ensures that the system developed is reliable and acceptable. Optimizing the test suite size of software eliminates the unnecessary cost and resources that are involved in testing. Sometimes it is not possible to exhaustively test any system due to huge number of test cases. In order to test any system and make it acceptable, combinatorial software interaction testing has been used in several fields. Investigations have concluded that most of the software faults could be identified by pairwise combinatorial interaction testing. Researchers have applied parallel algorithms to various combinatorial optimisation problems and have succeeded in significant time reduction in solving the problems. Large and/or computationally expensive optimization problems sometimes require parallel or high-performance computing systems to …", "num_citations": "3\n", "authors": ["1256"]}
{"title": "Failure Semantic of Neighbour Replication Grid Transaction Model\n", "abstract": " Real time application with replicated data in grid environment has received particular attention for providing efficient access, fault tolerance and enhance the performance of the system. This paper presents the new failure semantic to manage neighbour replication data in distributed environment. The failure semantic classes include the transaction abort and system failures. We address how to build reliable system for managing replication and transaction based on Neighbour Replication Grid (NRG) Transaction Model in terms to preserve the data consistency and support fault tolerance when exists the neighbour replica failure in quorum. In addition, we present an implementation of the propose failure semantic through NRG daemon by deploying real time application in distributed systems. The implementation shows that managing transactions on NRG through the failure semantic provides fault tolerance …", "num_citations": "3\n", "authors": ["1256"]}
{"title": "Deriving Formal Specification Using Z Notation\n", "abstract": " Formal Methods are very tough subject to Software Engineering student. It happens because of the mathematics involvement during software development. Students normally feel very difficult to derive formal specification from informal requirement. The problem always happen is to derive the Z notation in the formal specification. The formal specification is all about the operation inside the requirement needed from the customer using mathematical statement. If there do not know the logic of the operation the notation might goes wrong. In this paper, we propose an approach to deriving formal specifications from informal requirement using Venn diagram for creating formal specification in term of training environment to make our student understand. The Venn diagram that we use is purposely for the basic level. It is used to visualize in the branch of mathematics known as set theory. It shows all of the possible …", "num_citations": "3\n", "authors": ["1256"]}
{"title": "Learning management system through assignment box alert\n", "abstract": " Learning Management System (LMS) is software that has been developed for the administration, documentation, tracking, and reporting the educational resources. Assignment Box Alert (ABA) is a type of LMS which has been developed to manage the student in assignment submission. Before the development of ABA, the submission assignments from the students to lecturer have been done manually either through the hardcopy by printing material or softcopy by using the compact disc. The manual system consumes lot of time, besides quite easily being damaged or misplace. In this project, the development of ABA using the Remote Method Invocation has able to manage the assignment submission efficient and effectively. This is due the transferred file by student can be view more systematically by the lecturer, while at the same time the notification from the system remind the student to upload assignment on time", "num_citations": "2\n", "authors": ["1256"]}
{"title": "Modeling Pilgrims Movement using GPS and GSM Notification\n", "abstract": " This paper report the development of a prototype model to locate missing people in a location with big crowds such as in Mecca during Hajj time. The prototype integrates the Global Positioning System(GPS) for data transmission and the Global System for Mobile(GSM) network to track missing Malaysian Hajj pilgrims. The prototype is developed using Microsoft Visual Basic and Microsoft Access as the database. In addition, the development involves also GSM modem and circuit configuration. The prototype has been initially functionally tested. Accordingly, results indicate that the prototype can be used in locating the missing Hajj successfully.", "num_citations": "2\n", "authors": ["1256"]}
{"title": "Expediency heuristic in university conference webpage\n", "abstract": " In this paper, we present a webpage that has been developed based on heuristic elements which refer to the International Conference Software Engineering and Computer Systems for requirement. Heuristic and web base method have been applied in this system with combination of PHP language and MySQL as database system. The objective of this paper is the development of a webpage that has been developed based on heuristic elements which refer to university conference is to simplify and get quality webpage in using conference webpage for the Faculty of Computer Systems and Software Engineering, University Malaysia Pahang in Malaysia. Besides minimize human contacts thus provide fast, efficient, transparent and effective service to author, admin and reviewer. Therefore this system can facilitate user by computerized all the form accordance to paper submission, review papers, download …", "num_citations": "2\n", "authors": ["1256"]}
{"title": "Notice of Retraction: Venn requirement language for user requirement\n", "abstract": " Formal Methods are very hard subject to student. It offered to second semester for third year Software Engineering student. Students normally feel very difficult to derive formal specification from informal requirement. In this paper, we propose an approach to derive formal specifications from informal requirement using Venn diagram for creating formal specification. We show how to convert the Venn diagram to formal specification which is important part during development of Z schema. Then we do analysis of student result of a group of student. With this approach student will easier to understand the operation of the system during Z schema development.", "num_citations": "2\n", "authors": ["1256"]}
{"title": "Development of ROWA-MSTS in Distributed Systems Environment\n", "abstract": " Replication in distributed environment has become increasingly popular due to its high degree of availability, fault tolerance and enhance the performance of a system. These advantages of replication are important because it enables organizations to provide users with access to current data where and when user needed at anytime or anywhere, even if the users are geographically remote. However, this way of data organization introduces low data consistency among replicas when changes are made during transactions. Therefore, a system to monitor data replication in distributed system environment arises. Read-One-Write-All Monitoring Synchronization Transaction System (ROWA-MSTS) has been developed to solve this problem. By using this system, it helps to monitor the replicated data distribution over multiple sites while maintaining the data consistency.", "num_citations": "2\n", "authors": ["1256"]}
{"title": "Managing Database Replication Using Binary Vote Assignment on Grid Quorum with Association Rule\n", "abstract": " Nowadays, many organizations deploy the database application systems in order to manage their business operation. Administrations is required to deliver up to date data to users who live distantly, thus replicated databases can be one solution to increase the business operations performance in the distributed environment. Even though data availability is increased, common existing replication strategies neglect the correlation among the different data files in a Distributed Database Systems. In this paper, Binary Vote Assignment on Grid Quorum with Association Rules (BVAGQ-AR) has been proposed to manage the database replication. This technique combines data replication and data mining approaches in order to decrease the job processing time. The result shows that BVAGQ-AR has the lowest job processing time compared to other techniques. BVAGQ-AR performs 66.548 ms to complete a transaction …", "num_citations": "1\n", "authors": ["1256"]}
{"title": "A Code Profiling Using Statistical Testing in StART\n", "abstract": " An exhausted testing is one of the testing strategy that need more time taken due to test the whole test cases in the Software Under Test. Many techniques have been proposed to avoid this situation because the size of the Software Under Test is vary and need to have good testing strategy performance. One of the techniques is Adaptive Random Testing (ART). The ART is one of the enhanced random testing. Due to ART performance is better than pure random testing, it becomes motivation to implement the ART in Aspect Oriented Program (AOP). The ART and random testing are similar in which is selection the first test case with random manner. But, ART add another one characteristic which is the evenness test in domain area. Due to similar for first test case, we proposed a new strategy called StART. In StART, we use statistical testing technique to get the information before we test. This process we named it as …", "num_citations": "1\n", "authors": ["1256"]}
{"title": "Preserving Data Replication Consistency through ROWA-MSTS\n", "abstract": " In modern distributed systems, replication receives particular awareness to provide high data availability, reliability and enhance the performance of the system. Replication becomes as significant mechanism since it enables organizations to provide users with admission to current data where and when they need it. Integrated VSFTPD with Read-One-Write-All Monitoring Synchronization Transaction System (ROWA-MSTS) has been developed to monitor data replication and transaction performs in distributed system environment. This paper presents the ROWA-MSTS framework and process flow in order to preserve the data replication consistency. The implementation shows that ROWA-MSTS able to monitor the replicated data distribution while maintaining the data consistency over multiple sites.", "num_citations": "1\n", "authors": ["1256"]}
{"title": "GSM-Based Notification System for Electronic Pigeon Hole\n", "abstract": " This paper presents the design and development of Electronic pigeon hole integrated with GSM network to send a notification of any upcoming loaded. The electronic pigeon hole is able to send notification message via short message service (SMS) to the designated user if any new letter is placed in it. The innovation of the electronic pigeon hole could give immediate response for any urgent request for busy people. The system was developed by integrating a detection circuit to acknowledge the existing of new post items with the GSM modem to transmit SMS to specific user. It is found that the developed system is able to provide immediate notifications to intended users for further action.", "num_citations": "1\n", "authors": ["1256"]}
{"title": "Web-Based appointment system using short message service technology: Usability aspect\n", "abstract": " This paper presents an ongoing research that helps students and lecturers to be always aware of the appointment no matter where they are.It contributes to the teaching and learning process, in which communication is made easy using short messaging system (SMS) technology.It starts with examples of previous success stories of the implementation of SMS in many areas.The objectives of the paper are to discuss about the hardware and software requirement, and integrate them to be measured in terms functional. The research method is outlined next, and some discussions on current outcome of the research are addressed.The research is planned to be continued with full implementation of the proposed system that is called Student Appointment System using SMS technology.", "num_citations": "1\n", "authors": ["1256"]}
{"title": "Enhancing Student Evaluation Through Student Idol\n", "abstract": " Independence Day on the year of 1957, the government had been trying hard in order to find the most efficient methods in learning. However, it is hard to actually access and evaluate students whom will then be called an excellent student. It because in our realtime student who excellent is only excel in academic. This evaluation become a problem because it not balance in our real life interm of to get an excellent student in whole area in their involvement of curiculum and co-curiculum. To overcome this scenario, we proposed a method called Student Idol to evaluate student through three categories which are academic, co-curiculum and leadership. All the categories have their own merit point. Using this method, student will be evaluated more accurate compared to the previously. So, teacher can easily evaluate their student without having any emotion factor, relation factor and others. As conclustion this method will helps student evaluation more accurate and valid.", "num_citations": "1\n", "authors": ["1256"]}