{"title": "Virtual and remote labs in education: A bibliometric analysis\n", "abstract": " Laboratory experimentation plays an essential role in engineering and scientific education. Virtual and remote labs reduce the costs associated with conventional hands-on labs due to their required equipment, space, and maintenance staff. Furthermore, they provide additional benefits such as supporting distance learning, improving lab accessibility to handicapped people, and increasing safety for dangerous experimentation. This paper analyzes the literature on virtual and remote labs from its beginnings to 2015, identifying the most influential publications, the most researched topics, and how the interest in those topics has evolved along the way. To do so, bibliographical data gathered from ISI Web of Science, Scopus and GRC2014 have been examined using two prominent bibliometric approaches: science mapping and performance analysis.", "num_citations": "380\n", "authors": ["1530"]}
{"title": "Virtual and remote labs in control education: A survey\n", "abstract": " Virtual and remote labs have been around for almost twenty years and while they have been constantly gaining popularity since their appearance, there are still many people in the control education community who either do not know many details about them or do not know them at all. What are their benefits? Which examples of virtual and remote labs for control education can be found in the Internet and how spread and popular are they? What are the current trends and issues in the implementation and deployment of these tools? And the future ones? These and others are some of the questions we answer in this paper, trying to bring the attention of the control education community to these tools which, we believe, are meant to have an increasing importance and relevance for the 21st century students.", "num_citations": "155\n", "authors": ["1530"]}
{"title": "Using remote labs in education: Two little ducks in remote experimentation\n", "abstract": " «Second Best to Being There» is the title of the first chapter of this book. It is written by pioneers (Shor Bohus, Aktan) in remote experimentation in 1993 and it describes that a student/teacher can access a real experiment through Internet as being in the real lab. Chemistry, materials, electronics, physics and control engineering integrated in different remote labs are presented: iLAB (MIT, USA), VISIR (BTH, Sweden), labShare (UTS, Australia), and LiLA (Cambridge, UK).", "num_citations": "120\n", "authors": ["1530"]}
{"title": "The ball and beam system: A case study of virtual and remote lab enhancement with moodle\n", "abstract": " Web-based labs are key tools for distance education that help to illustrate scientific phenomena, which require costly or difficult-to-assemble equipment. Easy Java Simulations (EJS) is an authoring tool that speeds up the creation of these kind of labs. An excellent proof of the EJS potential is the open source physics (OSP) repository, which hosts hundreds of free EJS labs. Learning management systems, such as Moodle, provide social contexts where students interact with each other. The work described in this paper looks for the synergy of both tools, EJS and Moodle, by supporting the deployment of EJS labs into Moodle and thus enriching them with social features (e.g., chat, forums, and videoconference). To test this approach, the authors have created the ball and beam lab, which helps students of automatic control engineering to train different advanced techniques (robust, fuzzy, and reset control), and …", "num_citations": "100\n", "authors": ["1530"]}
{"title": "Providing collaborative support to virtual and remote laboratories\n", "abstract": " Virtual and remote laboratories (VRLs) are e-learning resources that enhance the accessibility of experimental setups providing a distance teaching framework which meets the student's hands-on learning needs. In addition, online collaborative communication represents a practical and a constructivist method to transmit the knowledge and experience from the teacher to students, overcoming physical distance and isolation. This paper describes the extension of two open source tools: (1) the learning management system Moodle, and (2) the tool to create VRLs Easy Java Simulations (EJS). Our extension provides: (1) synchronous collaborative support to any VRL developed with EJS (i.e., any existing VRL written in EJS can be automatically converted into a collaborative lab with no cost), and (2) support to deploy synchronous collaborative VRLs into Moodle. Using our approach students and/or teachers can invite …", "num_citations": "82\n", "authors": ["1530"]}
{"title": "A selection process based on additive consistency to deal with incomplete fuzzy linguistic information\n", "abstract": " In group decision making situations, there may be cases in which experts do not have an in-depth knowledge of the problem to be solved and, as a result, they may present incomplete information. In this paper, we present a new selection process to deal with incomplete fuzzy linguistic information. As part of it, we use an iterative procedure to estimate the missing information. This procedure is guided by the additive consistency property and only uses the preference values provided by the experts. In addition, the additive consistency property is also used to measure the level of consistency of the information provided by the experts. The main novelties of this selection process are both the possibility to manage decision situations under incomplete fuzzy linguistic information and the importance of the experts’ preferences in the aggregation processes is modeled by means of the experts’ consistency.", "num_citations": "82\n", "authors": ["1530"]}
{"title": "A bibliometric analysis of 20 years of research on software product lines\n", "abstract": " Context: Software product line engineering has proven to be an efficient paradigm to developing families of similar software systems at lower costs, in shorter time, and with higher quality.Objective: This paper analyzes the literature on product lines from 1995 to 2014, identifying the most influential publications, the most researched topics, and how the interest in those topics has evolved along the way.Method: Bibliographic data have been gathered from ISI Web of Science and Scopus. The data have been examined using two prominent bibliometric approaches: science mapping and performance analysis.Results: According to the study carried out, (i) software architecture was the initial motor of research in SPL; (ii) work on systematic software reuse has been essential for the development of the area; and (iii) feature modeling has been the most important topic for the last fifteen years, having the best evolution …", "num_citations": "77\n", "authors": ["1530"]}
{"title": "A review of quality evaluation of digital libraries based on users’ perceptions\n", "abstract": " In the past two decades, the use of digital libraries (DLs) has grown significantly. Accordingly, questions about the utility, usability and cost of DLs have started to arise, and greater attention is being paid to the quality evaluation of this type of information system. Since DLs are destined to serve user communities, one of the main aspects to be considered in DL evaluation is the user’s opinion. The literature on this topic has produced a set of varied criteria to judge DLs from the user’s perspective, measuring instruments to elicit users’ opinions, and approaches to analyse the elicited data to conclude an evaluation. This paper provides a literature review of the quality evaluation of DLs based on users’ perceptions. Its main contribution is to bring together previously disparate streams of work to help shed light on this thriving area. In addition, the various studies are discussed, and some challenges to be faced in the …", "num_citations": "77\n", "authors": ["1530"]}
{"title": "Inferring information from feature diagrams to product line economic models\n", "abstract": " Existing economic models support the estimation of the costs and benefits of developing and evolving a Software Product Line (SPL) as compared to undertaking traditional software development approaches. In addition, Feature Diagrams (FDs) are a valuable tool to scope the domain of a SPL. This paper proposes an algorithm to calculate, from a FD, the following information for economic models: the total number of products of a SPL, the SPL homogeneity and the commonality of the SPL requirements. The algorithm running time belongs to the complexity class . In contrast to related work, the algorithm is free of dependencies on off-the-self tools and is generally specified for an abstract FD notation, that works as a pivot language for most of the available notations for feature modeling.", "num_citations": "42\n", "authors": ["1530"]}
{"title": "A fuzzy linguistic model to evaluate the quality of library 2.0 functionalities\n", "abstract": " Libraries incessantly undergo change determined by evolving user needs. These are often induced by the emergence of previously unavailable tools. Web 2.0 represents an example of such a need-shifting technology, which has led to an embrace of new user interactivity services for many library websites, thus coined Library 2.0. This paradigm shift calls for new evaluation models to include the implementation of Web 2.0 technologies. The aim of this paper is to present such a model, and to evaluate the quality of Library 2.0 functionalities, measuring the quality of the 2.0 services offered through the websites based on user perception. We adopt fuzzy linguistic modeling to represent user perception, and apply aggregation operations to linguistic labels in order to evaluate the quality of the new services. Furthermore, our model subsumes the LibQUAL+ methodology, allowing for the identification of specific 2.0 …", "num_citations": "35\n", "authors": ["1530"]}
{"title": "Open-source hardware in education: A systematic mapping study\n", "abstract": " The open-source hardware movement is becoming increasingly popular due to the emergence of successful low-cost technologies, such as Arduino and Raspberry Pi, and thanks to the community of  makers  that actively share their creations to be freely studied, modified, and re-distributed. Numerous authors have proposed distinct ways to seize this approach for accomplishing a variety of learning goals: enabling scholars to explore scientific concepts, promoting students’ creativity, helping them to be more fluent and expressive with new technologies, and so on. This paper reports a systematic mapping study that overviews the literature on open-source hardware in education by analyzing and classifying 676 publications. The results of our work provide: 1) guidance on the published material (identifying the most relevant papers, publication sources, institutions, and countries); 2) information about the pedagogical …", "num_citations": "26\n", "authors": ["1530"]}
{"title": "Managing RFID sensors networks with a general purpose RFID middleware\n", "abstract": " RFID middleware is anticipated to one of the main research areas in the field of RFID applications in the near future. The Data EPC Acquisition System (DEPCAS) is an original proposal designed by our group to transfer and apply fundamental ideas from System and Data Acquisition (SCADA) systems into the areas of RFID acquisition, processing and distribution systems. In this paper we focus on how to organize and manage generic RFID sensors (edge readers, readers, PLCs, etc…) inside the DEPCAS middleware. We denote by RFID Sensors Networks Management (RSNM) this part of DEPCAS, which is built on top of two new concepts introduced and developed in this work: MARC (Minimum Access Reader Command) and RRTL (RFID Reader Topology Language). MARC is an abstraction layer used to hide heterogeneous devices inside a homogeneous acquisition network. RRTL is a language to define RFID Reader networks and to describe the relationship between them (concentrator, peer to peer, master/submaster). View Full-Text", "num_citations": "24\n", "authors": ["1530"]}
{"title": "The experiment editor: supporting inquiry-based learning with virtual labs\n", "abstract": " Inquiry-based learning is a pedagogical approach where students are motivated to pose their own questions when facing problems or scenarios. In physics learning, students are turned into scientists who carry out experiments, collect and analyze data, formulate and evaluate hypotheses, and so on. Lab experimentation is essential for inquiry-based learning, yet there is a drawback with traditional hands-on labs in the high costs associated with equipment, space, and maintenance staff. Virtual laboratories are helpful to reduce these costs. This paper enriches the virtual lab ecosystem by providing an integrated environment to automate experimentation tasks. In particular, our environment supports:(i) scripting and running experiments on virtual labs, and (ii) collecting and analyzing data from the experiments. The current implementation of our environment supports virtual labs created with the authoring tool Easy …", "num_citations": "21\n", "authors": ["1530"]}
{"title": "A scalable approach to exact model and commonality counting for extended feature models\n", "abstract": " A software product line is an engineering approach to efficient development of software product portfolios. Key to the success of the approach is to identify the common and variable features of the products and the interdependencies between them, which are usually modeled using feature models. Implicitly, such models also include valuable information that can be used by economic models to estimate the payoffs of a product line. Unfortunately, as product lines grow, analyzing large feature models manually becomes impracticable. This paper proposes an algorithm to compute the total number of products that a feature model represents and, for each feature, the number of products that implement it. The inference of both parameters is helpful to describe the standardization/parameterization balance of a product line, detect scope flaws, assess the product line incremental development, and improve the accuracy of …", "num_citations": "21\n", "authors": ["1530"]}
{"title": "Understanding the role of conceptual relations in Word Sense Disambiguation\n", "abstract": " In this article, we concentrate in conceptual relations as a source of information for Word Sense Disambiguation (WSD) systems. We start with a review the most relevant research in the field, then we implement our own algorithm. As a starting point we have chosen the conceptual density algorithm of Agirre and Rigau. We generalize the original algorithm, parameterizing many aspects. This new algorithm obtains a relative improvement of 24% in terms of precision and recall. We also offer comparative evaluation of our system with respect to the participants in the SENSEVAL-2 disambiguation competition.We conclude that conceptual relations provide a source of information that is insufficient by itself to achieve good disambiguation results, but can, however, be a very accurate heuristic in a combined system.", "num_citations": "21\n", "authors": ["1530"]}
{"title": "Supporting commonality-based analysis of software product lines\n", "abstract": " Software product line (SPL) engineering is a cost-effective approach to developing families of similar products. Key to the success of this approach is to correctly scope the domain of the SPL, identifying the common and variable features of the products and the interdependencies between features. In this study, the authors show how the commonality of a feature (i.e. the reuse ratio of the feature among the products) can be used to detect scope flaws in the early stages of development. SPL domains are usually modelled by means of feature diagrams following the feature-oriented domain analysis (FODA) notation. The authors extend classical FODA trees with unrestricted cardinalities, and present an algorithm to compute the number of products modelled by a feature diagram and the commonality of the features. Finally, the authors compare the performance of their algorithm with two other approaches built on top of …", "num_citations": "19\n", "authors": ["1530"]}
{"title": "Event-based control: A bibliometric analysis of twenty years of research\n", "abstract": " The potential benefits of networked control systems are tremendous, as they can be easily upgraded by just including new components (i.e., sensors, actuators, or controllers), avoiding any further modifications to their structure. A critical approach to unleash such potential benefits is event-based control, where the system output turns to be sampled on demand, instead of being sampled constantly at rigid periods of time. This paper analyzes from a bibliometric point of view the literature published for the last twenty years on event-based control, identifying the most relevant articles, authors, institutions, and journals. Moreover, the principal topics, motivations, and problems faced by the researchers are discussed, identifying distinct challenges and opportunities for future research.", "num_citations": "18\n", "authors": ["1530"]}
{"title": "Automated assessment and monitoring support for competency-based courses\n", "abstract": " Competency-based education is becoming increasingly adopted by higher education institutions all over the world. This paper presents a framework that assists instructors in this pedagogical paradigm and its corresponding open-source implementation. The framework supports the formal definition of competency assessment models and the students' evaluation under these models. It also provides distinct learning analytics for identifying course shortcomings and validating corrective actions instructors have introduced in a course. Finally, this paper reports the benefits of applying our framework to an engineering course at the Pontifical Catholic University, Valparaíso, Chile for three years.", "num_citations": "18\n", "authors": ["1530"]}
{"title": "Augmenting measure sensitivity to detect essential, dispensable and highly incompatible features in mass customization\n", "abstract": " Mass customization is the new frontier in business competition for both manufacturing and service industries. To improve customer satisfaction, reduce lead-times and shorten costs, families of similar products are built jointly by combining reusable parts that implement the features demanded by the customers. To guarantee the validity of the products derived from mass customization processes, feature dependencies and incompatibilities are usually specified with a variability model. As market demand grows and evolves, variability models become increasingly complex. In such entangled models it is hard to identify which features are essential, dispensable, highly required by other features, or highly incompatible with the remaining features. This paper exposes the limitations of existing approaches to gather such knowledge and provides efficient algorithms to retrieve that information from variability models.", "num_citations": "18\n", "authors": ["1530"]}
{"title": "A virtual and remote control laboratory in moodle: The ball and beam system\n", "abstract": " This paper presents a web-based control laboratory for a ball and beam system that was adapted to be used within an online course of a Learning Management System platform. The experimentation web environment is presented in the context of the UNEDLabs project, a Spanish network of web-based laboratories for science and engineering education. LabView and data acquisition boards are used in the server-side for the remote laboratory application, Easy Java Simulations for the client-side interface of both the virtual and the remote laboratory, and Moodle for the web environment. The integration between the virtual and remote labs and Moodle is achieved thanks to the use of the EJSApp plugins. Recipients of the resulting application are graduate students who can use the advanced control techniques implemented in this web-lab: robust, fuzzy, and reset control.", "num_citations": "18\n", "authors": ["1530"]}
{"title": "Improving the accuracy of COPLIMO to estimate the payoff of a software product line\n", "abstract": " Software product line engineering pursues the efficient development of families of similar products. COPLIMO is an economic model that relies on COCOMO II to estimate the benefits of adopting a product line approach compared to developing the products one by one. Although COPLIMO is an ideal economic model to support decision making on the incremental development of a product line, it makes some simplifying assumptions that may produce high distortions in the estimates (e.g., COPLIMO takes for granted that all the products have the same size). This paper proposes a COPLIMO reformulation that avoids such assumptions and, consequently, improves the accuracy of the estimates. To support our proposal, we present an algorithm that infers the additional information that our COPLIMO reformulation requires from feature diagrams, which is a widespread notation to model the domain of a product line.", "num_citations": "18\n", "authors": ["1530"]}
{"title": "A Literature Review on Feature Diagram Product Counting and Its Usage in Software Product Line Economic Models\n", "abstract": " In software product line engineering, feature diagrams are a popular means to represent the similarities and differences within a family of related systems. In addition, feature diagrams implicitly model valuable information that can be used in economic models to estimate the cost savings of a product line. In particular, this paper reviews existing proposals on computing the total number of products modeled with a feature diagram and, given a feature, the number of products that implement it. This paper also reviews the economic information that can be estimated when such numbers are known. Thus, this paper contributes by bringing together previously-disparate streams of work: the automated analysis of feature diagrams and economic models for product lines.", "num_citations": "17\n", "authors": ["1530"]}
{"title": "UNED labs: A network of virtual and remote laboratories\n", "abstract": " In terms of number of students, the Spanish Open University (UNED1), with more than 160,000 students, is the biggest university of Spain and the second one of Europe, next to the Open University of Great Britain. To support their students, UNED is composed of a network of associated learning centers scattered around the world (more than 60 centers distributed across Spain, Europe, America and Africa). Unfortunately, the geographical dispersion of the students makes impossible to provide the scientific courses of UNED with traditional laboratories at a reasonable cost. Since the nineties, the Department of Computer Sciences and Automatic Control of UNED has been much concerned about this problem and has been looking for new ways to illustrate scientific phenomena that require costly or difficult-toassemble equipments. In particular, two complementary approaches have been followed:", "num_citations": "16\n", "authors": ["1530"]}
{"title": "Automated assessment of computer programming practices: The 8-years UNED experience\n", "abstract": " The increasing popularity of distance education poses exciting new challenges. In particular, current pedagogical paradigms, such as competency-based education, require students' continuous evaluation. That is, to master skills, students need to receive constant feedback to guide their experimentation processes. However, teaching teams are usually under-dimensioned to support the large number of students that online courses usually have. This paper presents the approach we have adopted at the National University of Distance Education to overcome this problem for the case of computer programming practices, which complements human evaluation with an automatic assessment system. The paper describes our system and reports its benefits with an empirical study from 2011 to 2018 that involved 14,944 students.", "num_citations": "14\n", "authors": ["1530"]}
{"title": "UNEDLABS - An Example of EJS Labs Integration Into Moodle\n", "abstract": " UNEDLabs is a web portal of virtual and remote laboratories for Engineering and Science students. It is based mainly on two well-known, free and open source tools: a learning management system (Moodle) and a program that facilitates the creation of simulations (Easy Java Simulations). This paper proposes a methodology for creating web experimentation portals (such as UNEDLabs) and details the use of the, already mentioned, required software tools and their interrelation. This work also describes one of the experiments which have been made operative recently. Finally, we examine our students’ satisfaction with the whole system: the web portal and the complete set of virtual and remote laboratories.", "num_citations": "13\n", "authors": ["1530"]}
{"title": "Customized online laboratory experiments: A general tool and its application to the furuta inverted pendulum [Focus on Education]\n", "abstract": " Because of online laboratories (labs), students can perform experimental activities from their mobile devices and/or computers. This article proposes an experimentation environment (EE) that extends the capabilities of interactive online labs with scripting language support. Thus, control engineering students can specify complex experiments, avoid routine tasks, and empirically test controllers they made themselves.", "num_citations": "12\n", "authors": ["1530"]}
{"title": "Efficient identification of core and dead features in variability models\n", "abstract": " Mass customization enables the creation of personalized products that fulfill the features desired by specific customers. In this context, variability models are used to specify which configurable features are supported and which constraints among the features must be satisfied to guarantee the validity of the derived products. As the market demand grows and evolves, variability models become increasingly complex. In such entangled models, it is hard to identify which features are absolutely essential or dispensable because they are required to be included or excluded from all the possible products, respectively. This paper exposes the limitations of existing approaches to automatically detect those features and provides an algorithm that efficiently performs such detection.", "num_citations": "12\n", "authors": ["1530"]}
{"title": "Making EJS applications at the OSP digital library available from Moodle\n", "abstract": " Easy Java Simulations (EJS) is a free and open source software that allows to easily create simulations or virtual labs of very different topics such as control engineering, physics and so on. The Open Source Physics (OSP) project holds the ComPADRE library, a digital repository that offers more than 500 EJS applications, created by the community, that are accessible for free. Moodle is a free and open source software, well-known for being the most used and spread Learning Management System (LMS) all over the world. This work presents a new plugin for Moodle that allows searching, downloading, and adding to a Moodle course, EJS applications from the OSP ComPADRE library.", "num_citations": "12\n", "authors": ["1530"]}
{"title": "An architecture for virtual and remote laboratories to support distance learning\n", "abstract": " This work describes the experience of the authors regarding the design, development, analysis, and exploitation of Web-based technologies for creating an online experimentation framework with distance education purposes. This framework is specially design for scientific and technical courses that require a quite important presence of experimentation. Every component belonging to the proposed structure for these kind of portals is integrated into a free modern Learning Management System (LMS) that enhances collaborative work. The features, use, and integration of this LMS (Moodle) along with the other required tools are detailed. The proposed framework was used to implement a network of remote and virtual laboratories for control engineering education (AutomatLabs) that is presented here too as an example of its application.", "num_citations": "12\n", "authors": ["1530"]}
{"title": "Physics experiments at the UNEDLabs portal\n", "abstract": " UNEDLabs is a web portal based on a free, modern, open source, and well-known learning management system: Moodle. This portal joins two theme networks of virtual and remote laboratories (one for Control Engineering and another one for Physics, named AutomatL@ bs and FisL@ bs, respectively) together. AutomatL@ bs has been operative for five years now. Following AutomatL@ bs’ scheme, FisL@ bs was created as a network of remote and virtual laboratories for physics university education via the Internet to offer students the possibility of performing hands-on experiences in different fields of physics in two ways: simulation and real remote operation. Now, both FisL@ bs and AutomatL@ bs join together (while maintaining their independency) into an unique new web portal called UNEDLabs. This work focuses on this new web environment and gives a detailed account of a novel way in Physics to let distance learning students gain practical experience autonomously. This paper explains how the new portal works and the software tools used for creating it. In addition, it also describes the physics experiments which are already operative.", "num_citations": "11\n", "authors": ["1530"]}
{"title": "Automatic word sense disambiguation using cooccurrence and hierarchical information\n", "abstract": " We review in detail here a polished version of the systems with which we participated in the Senseval-2 competition English tasks (all words and lexical sample). It is based on a combination of selectional preference measured over a large corpus and hierarchical information taken from WordNet, as well as some additional heuristics. We use that information to expand sense glosses of the senses in WordNet and compare the similarity between the contexts vectors and the word sense vectors in a way similar to that used by Yarowsky and Schuetze. A supervised extension of the system is also discussed. We provide new and previously unpublished evaluation over the SemCor collection, which is two orders of magnitude larger than SENSEVAL-2 collections as well as comparison with baselines. Our systems scored first among unsupervised systems in both tasks. We note that the method is very sensitive to …", "num_citations": "11\n", "authors": ["1530"]}
{"title": "Supporting the statistical analysis of variability models\n", "abstract": " Variability models are broadly used to specify the configurable features of highly customizable software. In practice, they can be large, defining thousands of features with their dependencies and conflicts. In such cases, visualization techniques and automated analysis support are crucial for understanding the models. This paper contributes to this line of research by presenting a novel, probabilistic foundation for statistical reasoning about variability models. Our approach not only provides a new way to visualize, describe and interpret variability models, but it also supports the improvement of additional state-of-the-art methods for software product lines; for instance, providing exact computations where only approximations were available before, and increasing the sensitivity of existing analysis operations for variability models. We demonstrate the benefits of our approach using real case studies with up to 17,365 …", "num_citations": "10\n", "authors": ["1530"]}
{"title": "Metodología de desarrollo de software basada en el paradigma generativo: realización mediante la transformación de ejemplares\n", "abstract": " Muchos autores consideran que el desarrollo de familias de productos, frente al construcción individual de productos aislados, es un paso decisivo hacia la realización sistemática de software y la obtención de economía de alcance. Esta tesis se adscribe a esta corriente y propone un nuevo proceso de desarrollo de familias de productos, denominados EDD (Exemplar Driven Development), que aprovecha la similitud entre los productos de una familia para construirlos por analogía. La primera actividad de EDD es la realización de un producto concreto de una familia. A continuación, se busca cómo flexibilizar este ejemplar para que satisfaga los requisitos del resto de los productos. Es decir, se trata de definir formalmente una relación de analogía que permita derivar del ejemplar los demás productos de forma automática. Por último, se obtienen los productos de la familia parametrizando la flexibilización del ejemplar. Entre las aportaciones de EDD, cabe destacar: * Abordar el desarrollo y el mantenimiento de una familia de productos mediante una estrategia sistemática e interactiva. Lo primero que se construye es un ejemplar que satisface los requisitos fijos de la familia. Después, se incorporan progresivamente cepas de flexibilización que implementa los requisitos variables. * Los requisitos fijos de una familia de productos suelen ser más estables que los requisitos variables. EDD separa la implementación de los requisitos fijos (el ejemplar) de la implementación de los requisitos variables (los módulos que flexibilizan el ejemplar). * La decisión de elaborar una familia a menudo se toma al detectar trabajo repetitivo en el desarrollo …", "num_citations": "10\n", "authors": ["1530"]}
{"title": "Speeding up derivative configuration from product platforms\n", "abstract": " To compete in the global marketplace, manufacturers try to differentiate their products by focusing on individual customer needs. Fulfilling this goal requires that companies shift from mass production to mass customization. Under this approach, a generic architecture, named product platform, is designed to support the derivation of customized products through a configuration process that determines which components the product comprises. When a customer configures a derivative, typically not every combination of available components is valid. To guarantee that all dependencies and incompatibilities among the derivative constituent components are satisfied, automated configurators are used. Flexible product platforms provide a big number of interrelated components, and so, the configuration of all, but trivial, derivatives involves considerable effort to select which components the derivative should include. Our approach alleviates that effort by speeding up the derivative configuration using a heuristic based on the information theory concept of entropy. View Full-Text", "num_citations": "9\n", "authors": ["1530"]}
{"title": "Exemplar driven development of software product lines\n", "abstract": " The benefits of following a product line approach to develop similar software systems are well documented. Nevertheless, some case studies have revealed significant barriers to adopt such approach. In order to minimize the paradigm shift between conventional software engineering and software product line engineering, this paper presents a new development process where the products of a domain are made by analogy to an existing product. Furthermore, this paper discusses the capabilities and limitations of different techniques to implement the analogy relation and proposes a new language to overcome such limitations.", "num_citations": "9\n", "authors": ["1530"]}
{"title": "A kconfig translation to logic with one-way validation system\n", "abstract": " Automated analysis of variability models is crucial for managing software system variants, customized for different market segments or contexts of use. As most approaches for automated analysis are built upon logic engines, they require having a Boolean logic translation of the variability models. However, the translation of some significant languages to Boolean logic is remarkably non-trivial. The contribution of this paper is twofold: first, a translation of the Kconfig language is presented; second, an approach to test the translation for any given model is provided. The proposed translation has been empirically tested with the introduced validation procedure on five open-source projects.", "num_citations": "8\n", "authors": ["1530"]}
{"title": "Conducting online lab experiments with Blockly\n", "abstract": " Laboratory experimentation plays an essential role in control education. To reduce the high costs of maintaining apparatus in traditional labs and to support distance and blended learning, online laboratories are used as a possible alternative to conventional hands-on labs. In these labs it is often desirable to allow students to define their own experiments. This paper presents the definition and implementation of a generic experimentation language for conducting automatic experiments on existing online laboratories. The main objective is to use an online lab, created independently, as a component in which users can perform experiments. To achieve it, authors present the Experiment Application. It is composed by Blockly, to define and design the experiments, and Google Chart, review and visualize the experiment results. This tool offers benefits to students, teachers and, even, lab designers. For the moment, it …", "num_citations": "8\n", "authors": ["1530"]}
{"title": "Binary Decision Diagram Algorithms to Perform Hard Analysis Operations on Variability Models.\n", "abstract": " Variability models play a key role in software product line engineering as they are used to represent the common and variable features that products may include, and what constraints among the features must be satisfied to guarantee the validity of the products. Valuable analysis operations on variability models can be performed by black box reusing logic engines, such as SAT-solvers and binary decision diagram libraries. Unfortunately, such kind of reuse implies long computation times for operations that need calling the engines many times. To overcome this problem, we propose new algorithms that directly deal with the data structure of a binary decision diagram encoding a variability model. In particular, our algorithms are specifically designed to detect core & dead features, and the impact & exclusion sets of every feature.", "num_citations": "8\n", "authors": ["1530"]}
{"title": "Automated experiments on EjsS laboratories\n", "abstract": " Experimentation in laboratories is a key pillar in the education of graduate and undergraduate students, who need to understand the fundamental concepts from both perspectives: theoretical and practical. High costs associated with equipment, space, and maintenance staff, impose certain constraints on resources for traditional laboratories. While, Virtual and Remote Laboratories can overcome these limitations, they present important limitations in their use. Some actions are repetitive in nature, cannot be executed trivially or in reasonable time by a user. Some others might be simply impossible without computer help. For example, doing a linear regression of values obtained in an experiment, performing a comparison of results obtained by making a sweep in the values of a particular variable or taking a system to an initial state. Hence, it arises the need of encoding some experimental tasks to automatize their …", "num_citations": "8\n", "authors": ["1530"]}
{"title": "Virtual control labs experimentation: the water tank system\n", "abstract": " This paper describes a new way to perform automated experiments using virtual laboratories. Experiments are developed and executed using a new software tool: the Experiment Editor. This tool uses virtual laboratories applications designed with educational purposes. The main features/advantages of the Experiment Editor are: 1) the possibility of modifying the initial functionality of the laboratories (i.e. adding new controllers to the plant), 2) analyzing the obtained results during the experiment and performing complex or repetitive tasks in a simple way, 3) and any others explained in the paper. To illustrate the utility of the Experiment Editor a very well-known system is used: the water tank system.", "num_citations": "8\n", "authors": ["1530"]}
{"title": "Uniform and scalable SAT-sampling for configurable systems\n", "abstract": " Several relevant analyses on configurable software systems remain intractable because they require examining vast and highly-constrained configuration spaces. Those analyses could be addressed through statistical inference, ie, working with a much more tractable sample that later supports generalizing the results obtained to the entire configuration space. To make this possible, the laws of statistical inference impose an indispensable requirement: each member of the population must be equally likely to be included in the sample, ie, the sampling process needs to be\" uniform\". Various SAT-samplers have been developed for generating uniform random samples at a reasonable computational cost. Unfortunately, there is a lack of experimental validation over large configuration models to show whether the samplers indeed produce genuine uniform samples or not. This paper (i) presents a new statistical test to …", "num_citations": "6\n", "authors": ["1530"]}
{"title": "A Generative Approach to Improve the Abstraction Level to Build Applications Based on the Notification of Changes in Databases.\n", "abstract": " This paper highlights the benefits, in terms of quality, productivity and time-to-market, of applying a generative approach to increase the abstraction level to build applications based on the notification of changes in databases. Most of the databases maintain meta-tables with information about all stored tables; this information is used in an automatic process to define the software product line (SPL) variability. The remaining variability can be specified by means of domain specific languages. Code generators can automatically query the meta-tables, analyze the input specifications and configure the current product. The paper also introduces the Exemplar Driven Development process to incrementally develop code generators and the Exemplar Flexibilization Language that supports the process implementation.", "num_citations": "6\n", "authors": ["1530"]}
{"title": "Towards taming variability models in the wild\n", "abstract": " Software Product Lines (SPLs) are families of related software systems that provide different combinations of features. Extensive research and application attest to the significant economical and technological benefits of employing SPL practices. Variability models represent the feature combinations and the properties of the software products of SPLs. Kconfig configuration files from open source projects have been proposed as large and realistic case studies for research on analysis of variability models. However, despite the extensive work on this subject, the seemingly direct approach of translating Kconfig to Binary Decision Diagrams (BDDs)—a representation that has shown significant advantages for complex analysis of variability models—has not been explored. To address this gap, we propose a simple translation scheme which we evaluate with five case studies. Our encouraging results indicate the …", "num_citations": "5\n", "authors": ["1530"]}
{"title": "A science mapping analysis of the literature on software product lines\n", "abstract": " To compete in the global marketplace, manufacturers try to differentiate their products by focusing on individual customer needs. Fulfilling this goal requires companies to shift from mass production to mass customization. In the context of software development, software product line engineering has emerged as a cost effective approach to developing families of similar products by support high levels of mass customization. This paper analyzes the literature on software product lines from its beginnings to 2014. A science mapping approach is applied to identify the most researched topics, and how the interest in those topics has evolved along the way.", "num_citations": "5\n", "authors": ["1530"]}
{"title": "Code generation with the exemplar flexibilization language\n", "abstract": " Code Generation is an increasing popular technique for implementing Software Product Lines that produces code from abstract specifications written in Domain Specific Languages (DSLs). This paper proposes to take advantage of the similitude among the products in a domain to generate them by analogy. That is, instead of synthesizing the final code from scratch or transforming the DSL specifications, the final products are obtained by adapting a previously developed domain product. The paper also discusses the capabilities and limitations of several currently available tools and languages to implement this kind of generators and introduce a new language to overcome the limitations.", "num_citations": "5\n", "authors": ["1530"]}
{"title": "Evidence-based control engineering education: Evaluating the LCSD simulation tool\n", "abstract": " The advance in control engineering education needs well-designed studies that validate what methods and tools work best. This paper addresses the lack of empirical evidence supporting innovations in control engineering education by proposing a methodology that works at different abstraction levels. Hence, innovations’ impact on students’ performance can be statistically analyzed either globally or locally by examining competencies or fine-grained indicators, respectively. The article reports the application of the methodology for evaluating an interactive simulation tool, named LCSD, on 101 students at the Pontifical Catholic University of Valparaiso in Chile. According to the experimental results, LCSD is an effective free alternative to enhance the student’s skills on control system analysis for our automatic control course. Also, some improvements have been identified for future LCSD versions.", "num_citations": "4\n", "authors": ["1530"]}
{"title": "Using Extended Logical Primitives for Efficient BDD Building\n", "abstract": " Binary Decision Diagrams (BDDs) have been used to represent logic models in a variety of research contexts, such as software product lines, circuit testing, and plasma confinement, among others. Although BDDs have proven to be very useful, the main problem with this technique is that synthesizing BDDs can be a frustratingly slow or even unsuccessful process, due to its heuristic nature. We present an extension of propositional logic to tackle one recurring phenomenon in logic modeling, namely groups of variables related by an exclusive-or relationship, and also consider two other extensions: one in which at least n variables in a group are true and another one for in which at most n variables are true. We add XOR, atLeast-n and atMost-n primitives to logic formulas in order to reduce the size of the input and also present algorithms to efficiently incorporate these constructions into the building of BDDs. We prove, among other results, that the number of nodes created during the process for XOR groups is reduced from quadratic to linear for the affected clauses. the XOR primitive is tested against eight logical models, two from industry and six from Kconfig-based open-source projects. Results range from no negative effects in models without XOR relations to performance gains well into two orders of magnitude on models with an abundance of this kind of relationship. View Full-Text", "num_citations": "4\n", "authors": ["1530"]}
{"title": "Blockly experiments for EjsS laboratories\n", "abstract": " This paper presents an experimentation environment to perform automated experiments defined by the users on existing online laboratories. This environment is composed by Blockly, to define the experiments, and Google Charts, to analyze the outputs. The benefits that this tool offers to students, designers and teachers are explained through the paper. It can be used with any existing lab or simulation created with Easy Java(script) Simulations, there are repositories with hundreds of labs created with this tool, so the potential applicability of the tool is considerable.", "num_citations": "4\n", "authors": ["1530"]}
{"title": "A Domain Engineering Approach to Increase Productivity in the Development  of a Service for Changes Notification of the Configuration Management  Database\n", "abstract": " This paper presents a domain engineering approach to build a software product line that supports the change notification service in a Configuration Management Database (CMDB) according to the Information Technology Infrastructure Library (ITIL) best practices. For the development of this product line, the proposed approach makes use of a construction of products methodology by analogy: this is a new notation which reports the variability of the products, obtaining metrics as important as the number of products and uses a language that enables, by means of the flexibilization of a product and the development of some generators, to build the rest of the product line. In addition the paper offers a standard for the analysis and design of the CMDB as well. Finally, the paper presents an economic model for the product line, where the profitability and productivity of the proposed solution are analyzed.", "num_citations": "4\n", "authors": ["1530"]}
{"title": "Web experimentation on virtual and remote laboratories\n", "abstract": " Laboratory experimentation is essential in any educational field. Existing software allows two options for performing experiments: (1) Interacting with the graphic user interface (it is intuitive and close to reality, but it has certain constraints that cannot be easily solved), or (2) scripting algorithms (it allows more complex instructions, however, users have to handle a programming language). This paper presents the definition and implementation of a generic experimentation language for conducting automatic experiments on existing online laboratories. The main objective is to use an existing online lab, created independently, as a tool in which users can perform tailored experiments. To achieve it, authors present the Experiment Application. Not only unifies the two conceptions of performing experiments; it also allows the user to define algorithms for interactive laboratories in a simple way without the …", "num_citations": "3\n", "authors": ["1530"]}
{"title": "Synchronous collaboration with virtual and remote labs in Moodle\n", "abstract": " This work presents the tools and procedure developed by the authors to create synchronous collaborative virtual and remote laboratories within a web course produced with a learning management system. Thanks to them, an instructor can prepare virtual and/or remote laboratories and easily add them to its online web course, automatically obtaining collaborative features. Also, any member (either a student or a teacher), as long as s/he is enrolled in the course, can use the system to invite other enrolled users to a real-time collaborative experimental session with any of the laboratories that belong to that course. The extension tools presented in this work are based in two different free and open source software programs: Moodle as the learning management system that offers the web environment and Easy Java Simulations for creating the virtual and remote laboratories with collaborative support.", "num_citations": "3\n", "authors": ["1530"]}
{"title": "A first-generation software product line for data acquisition systems in astronomy\n", "abstract": " This article presents a case study on developing a software product line for data acquisition systems in astronomy based on the Exemplar Driven Development methodology and the Exemplar Flexibilization Language tool. The main strategies to build the software product line are based on the domain commonality and variability, the incremental scope and the use of existing artifacts. It consists on a lean methodology with little impact on the organization, suitable for small projects, which reduces product line start-up time. Software Product Lines focuses on creating a family of products instead of individual products. This approach has spectacular benefits on reducing the time to market, maintaining the know-how, reducing the development costs and increasing the quality of new products. The maintenance of the products is also enhanced since all the data acquisition systems share the same product line architecture.", "num_citations": "3\n", "authors": ["1530"]}
{"title": "Inconsistency-tolerating guidance for software engineering processes\n", "abstract": " Software processes, together with software quality assurance, focus on ensuring and attesting that the engineering processes result in the appropriate software quality. Complex processes and regulations (e.g., in safety-critical systems), time pressure, or coordination needs, often cause engineers to deviate from prescribed processes, producing a cascade of inconsistencies whose repair is typically troublesome. Accordingly, guidance is needed to help engineers to fix the inconsistencies and understand the implications of postponing inconsistency resolution until engineers reach a consensual agreement of the most convenient repair. To this end, we bring together techniques and methods from process engineering, model inconsistency checking, and formal methods. Preliminary evaluations with real industry data have demonstrated the ability of our early prototype to track process inconsistencies across time and …", "num_citations": "2\n", "authors": ["1530"]}
{"title": "Rough Sets: A Bibliometric Analysis from 2014 to 2018.\n", "abstract": " Rough Sets: a Bibliometric Analysis from 2014 to 2018 Page 1 Rough Sets: a Bibliometric Analysis from 2014 to 2018 Ruben Heradio, David Fernandez-Amoros, Jose A. Moral-Muñoz, and Manuel J. Cobo Universidad Nacional de Educacion a Distancia (Spain) University of Cadiz (Spain) rheradio@issi.uned.es https://www.researchgate.net/profile/Ruben_Heradio Page 2 Motivation A brief introduction to rough sets Materials and methods Results Conclusions 1: Motivation R. Heradio et al. Rough Sets: a Bibliometric Analysis Page 3 Motivation A brief introduction to rough sets Materials and methods Results Conclusions Motivation Rough Sets: a Bibliometric Analysis from 2014 to 2018 0 200 400 600 800 1000 1982 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 Year …", "num_citations": "2\n", "authors": ["1530"]}
{"title": "Enhancing web-based labs in Moodle by providing automatic support for different types of files\n", "abstract": " While many works focus on embedding web-based labs within a Learning Management System without really taking much benefit from this integration, this one tries to take the most from the file system of Moodle in order to enhance and extend the functionalities of the online labs that are deployed into this Learning Management System.", "num_citations": "2\n", "authors": ["1530"]}
{"title": "Performing Automated Experiments with EJsS Laboratories\n", "abstract": " Existing software allows the development of high quality interactive applications that permit their implementation in laboratories, both virtual and remote. To perform an experiment, the user needs to know how these applications are implemented. In addition, when coding an experiment, the user has to manage the language in which the simulation was created and needs to handle fluently a simulation language just to perform experiments. In the academic field these simulations are used to create virtual and remote laboratories. The authors propose a tool to develop automated experiments for these laboratories. It is intended that the experiments use a powerful and simple language to improve students interaction with the laboratories. That is, avoid repetitive tasks using simple algorithms, data collection and analysis of results, among other features. A new environment for the development of experiments in the …", "num_citations": "2\n", "authors": ["1530"]}
{"title": "Creating web experimentation portals\n", "abstract": " There are two main obstacles for supporting lab experimentation in distance learning institutions, such as the Turkish Anadolu University, the UK Open University and the Spanish Open University (UNED):(i) their high number of students, and (ii) the fact that students are usually scattered around the world. Both problems make impossible to provide the scientific and technical courses with traditional labs at a reasonable cost. To overcome those problems, we propose an approach to developing webbased, deploying them into a learning management system and reducing their cost by reusing software intensively.", "num_citations": "2\n", "authors": ["1530"]}
{"title": "Laboratorios remotos de Fisica\n", "abstract": " Un marco de trabajo moderno, apoyado en tecnologías educativas punteras, debe ofrecer a los estudiantes dos aspectos bien diferenciados del aprendizaje: una manera de realizar el trabajo individual (por medio de la experimentación con un sistema o mediante el estudio de cierta documentación teórica, por ejemplo) y una manera de realizar el trabajo colaborativo (como consultar dudas a un profesor oa un compañero).Un portal web de laboratorios (como el que aquí se presenta para asignaturas de Física) consiste, a grandes rasgos, en un sistema de gestión del aprendizaje (LMS, por sus siglas en inglés) y en los recursos educativos que deseen usarse (en este caso, unos laboratorios de experimentación on-line). Estos portales pueden cubrir todas las necesidades descritas anteriormente y, aún más, ofrecer otras características adicionales.", "num_citations": "2\n", "authors": ["1530"]}
{"title": "Monte Carlo tree search for feature model analyses: a general framework for decision-making\n", "abstract": " The colossal solution spaces of most configurable systems make intractable their exhaustive exploration. Accordingly, relevant analyses remain open research problems. There exist analyses alternatives such as SAT solving or constraint programming. However, none of them have explored simulation-based methods. Monte Carlo-based decision making is a simulation-based method for dealing with colossal solution spaces using randomness. This paper proposes a conceptual framework that tackles various of those analyses using Monte Carlo methods, which have proven to succeed in vast search spaces (eg, game theory). Our general framework is described formally, and its flexibility to cope with a diversity of analysis problems is discussed (eg, finding defective configurations, feature model reverse engineering or getting optimal performance configurations). Additionally, we present a Python implementation of …", "num_citations": "1\n", "authors": ["1530"]}
{"title": "Group Decision-Making Based on Artificial Intelligence: A Bibliometric Analysis\n", "abstract": " Decisions concerning crucial and complicated problems are seldom made by a single person. Instead, they require the cooperation of a group of experts in which each participant has their own individual opinions, motivations, background, and interests regarding the existing alternatives. In the last 30 years, much research has been undertaken to provide automated assistance to reach a consensual solution supported by most of the group members. Artificial intelligence techniques are commonly applied to tackle critical group decision-making difficulties. For instance, experts’ preferences are often vague and imprecise; hence, their opinions are combined using fuzzy linguistic approaches. This paper reports a bibliometric analysis of the ample literature published in this regard. In particular, our analysis:(i) shows the impact and upswing publication trend on this topic;(ii) identifies the most productive authors, institutions, and countries;(iii) discusses authors’ and journals’ productivity patterns; and (iv) recognizes the most relevant research topics and how the interest on them has evolved over the years. View Full-Text", "num_citations": "1\n", "authors": ["1530"]}
{"title": "Integration of Economic Models for Software Product Lines by Means of a Common Lexicon\n", "abstract": " The Software Product Line approach undertakes the development of complete portfolios of software products as a single, coherent development task. Although there are well-documented examples of cost reduction, shorter development times, and quality improvement achieved by introducing the product line paradigm in industry, the approach is not always the best economic choice for building a family of related systems. To support decision makers, a number of economic models have been proposed. Apparently, existing proposals are rather heterogeneous in terms of their main characteristics and goals. Nevertheless, this paper shows how most models may be defined using a small common lexicon. Translating models to such common lexicon, we compare them in detail, identifying their strengths and weaknesses. As a result, the paper proposes an integrated model that improves the cost estimation accuracy of existing models.", "num_citations": "1\n", "authors": ["1530"]}
{"title": "Direction Kernels: using a simplified 3D model representation for grasping\n", "abstract": " Humans decide how to carry out a spontaneous interaction with an object by using the whole geometric information obtained from their eyes. The aim of this paper is to present how our object representation model MWS (Adán in Comput Vis Image Underst 79:281–307, 2000) can help a robot manipulator to make a single and reliable interaction. The contribution of this paper is particularly focused on the grasp synthesis stage. The main idea is that the grasping system, through MWS, can use non-strict-local features of the contact points to find a consistent grasping configuration. The Direction Kernels (DK) concept, which is integrated into the MWS model, is used to define a set of candidate contact-points and interaction regions. The set of DK is a global feature which represents the principal normal vectors of the object and their relative weight in a three-connectivity mesh model. Our method calculates the …", "num_citations": "1\n", "authors": ["1530"]}
{"title": "DEPCAS: an industrial approach to RFID middleware\n", "abstract": " RFID (Radio Frequency Identification) middleware refers to software that connects RFID devices to enterprise information systems. In a generic definition, RFID middleware makes sense to RFID reads and allows employing auto identification like a main data source inside information, production or management systems. Several trends are proposed to solve RFID middleware: ad-hoc systems, open-source EPCGlobal standards implementation or proprietary RFID middleware. In this paper we present a different and alternative solution to this problem: DEPCAS(Data EPC Acquisition System). DEPCAS approach corresponds with new software architecture to solve RFID middleware and it is based on SCADA (Supervisory, Control and Data Acquisition) modern software architecture. The key ideas in this RFID middleware are to be configurable and customizable in every of the modules that take part of the software …", "num_citations": "1\n", "authors": ["1530"]}
{"title": "Man Machine Interface in RFID Middleware: DEPCAS User Interface.\n", "abstract": " Between the RFID middleware main components the editing and management tools support the way to configure and deploy the RFID solutions. The most important functions of Man Machine Interface for RFID middleware component are to allow access to the monitoring, the management and the control included in the middleware. Among the key features that are necessary for this component we can mention the flexibility, adaptability, and scalability to the system middleware that implements it. We present a study on the interfaces in some of the existing RFID middleware. We also include the prototype of the user interface made for the RFID middleware architecture called DEPCAS (Data EPC Acquisition System). This interface called GUV (Graphical User Viewer) was developed through language EFL (Exemplar Flexibilization Language)", "num_citations": "1\n", "authors": ["1530"]}
{"title": "Implementing EPCIS with DEPCAS RFID Middleware.\n", "abstract": " RFID middleware is a new breed of software acquisition system that allows transfer data between device readers and business applications. RFID middleware has been structured in facto with several layers: infrastructure layer, event processor, tag data translator, rules and composite process, and application integration or EPCIS. EPCIS term is a generalization to refer the upper layer that link RFID middleware with external systems like SCMs, ERPs, WMSs or any user application that use auto identification data. In this paper we want to present the EPCIS DEPCAS layer. DEPCAS (Data EPC Acquisition System) is a RFID middleware proposal based on an extension of control and data acquisition systems (SCADAs). We examine the elements that compound EPCIS in DEPCAS based on SOA (Service-Oriented Architecture) and publish/subscribe message technologies implemented with JMS (Java Message Service). EPCIS in DEPCAS solves the two-way communication: it receives the configuration back-end information to increase the RFID semantic process defined with scenarios and offers the services to exploit the RFID acquisition results.", "num_citations": "1\n", "authors": ["1530"]}
{"title": "Towards a time-efficient algorithm to calculate the total number of products of a Software Product Line\n", "abstract": " Feature Diagrams (FDs) are widely used to scope the domain of Software Product Lines (SPLs). In addition, valuable information can be inferred from FDs; for instance, the total number of possible products of a SPL. A common approach to calculate the number of products is translating FDs into propositional logic formulas, which are processed by off-the-shelf tools, such as SAT solvers. However, this approach only works for small FDs. We think more scalable solutions can be reached avoiding the diagram-to-logic transformation and taking advantage of the tree organization of FDs. Due to the profusion of feature modeling notations, this paper formally defines a pivot language, named Neutral Feature Tree (NFT), where FDs are restricted to be trees. Most popular FD notations can be easily and efficiently translated to NFT. The paper also proposes a general and time-efficient algorithm to calculate the number of products without considering crosstree constraints.", "num_citations": "1\n", "authors": ["1530"]}