{"title": "Tilting-rotor quadcopter for aggressive flight maneuvers using differential flatness based flight controller\n", "abstract": " In this paper, we present a feed-forward control approach for complex trajectory tracking by a tilting-rotor quadcopter during autonomous flight. Tilting-rotor quadcopter is a more agile version of conventional quadcopter as the propeller motors are actuated to tilt about the quadcopter arm. The tilt-rotor quad-copter is capable of following complex trajectories with ease. In this paper, we employ differential flatness based feed-forward position control by utilizing a combination of propeller rotational speeds along with rotor tilts. The rotational motion of propellers work simultaneously in sync with propeller tilts to control the position and orientation of the UAV during autonomous flight. The results for tracking complex trajectories have been presented by performing numerical simulations and a comparison is shown with respect to conventional quadcopter for similar flight conditions. It has been found that the tilt-rotor …", "num_citations": "26\n", "authors": ["1435"]}
{"title": "Stabilizing and control of tilting-rotor quadcopter in case of a propeller failure\n", "abstract": " In this paper, stability and control of tilting-rotor quadcopters is presented upon failure of one propeller during flight. A tilting rotor quadcopter provides advantage in terms of additional stable configurations and maneuverability. Upon failure of one propeller, a traditional quadcopter has a tendency of spinning about the primary axis fixed to the vehicle as an outcome of the asymmetry about the yaw axis. This forces the quadcopter to land abandoning its mission. The tilting-rotor configuration is an over-actuated form of a traditional quadcopter and it is capable of handling a propeller failure, thus making it a fault tolerant system. In this paper, a dynamic model of tilting-rotor quadcopter with one propeller failure is derived and a controller is designed to achieve hovering and navigation capability. The simulation results showing the effectiveness of the proposed controller is presented using the translational and hovering …", "num_citations": "21\n", "authors": ["1435"]}
{"title": "Non-linear sliding mode control of a tilting-rotor quadcopter\n", "abstract": " A non-linear control of a tilt-rotor quadcopter using sliding mode technique is presented in this paper. The tilt-rotor quadcopters are a novel class of quadcopters with a servo motor installed on each arm that enables the quadcopter’s rotors to tilt to a particular angle. Using these additional tilt angles, this type of a quadcopter can be used to achieve desired trajectories with faster maneuvering and can handle external disturbances better than a conventional quadcopter. In this paper, sliding mode control technique is utilized for the pitch, roll and yaw motions for the quadcopter while an independent PD controller provides the tilt angles to the servo motors. The dynamic model of the tilt-rotor quadcopter is presented, based on which sliding surfaces were designed to minimize the tracking errors. Using the control inputs derived from these sliding surfaces, the state variables converge to their desired values in finite-time …", "num_citations": "13\n", "authors": ["1435"]}
{"title": "Differential flatness based hybrid PID/LQR flight controller for complex trajectory tracking in quadcopter UAVs\n", "abstract": " In this paper, we present a differential flatness based hybrid flight controller for the quadcopter UAV. The combination of conventional PID based controller with the full state feedback based LQR controller results in the proposed hybrid controller. The performance of the resulting controller is further enhanced by using differential flatness based feedforward control. The UAV with a hybrid flight controller is considered as the balance between stability and maneuverability, which makes it suitable for complex trajectory following applications. The dynamic model and the flight controller has been verified by means of numerical simulations for flight conditions involving complex maneuvers.", "num_citations": "12\n", "authors": ["1435"]}
{"title": "Reconfigurable fault-tolerant tilt-rotor quadcopter system\n", "abstract": " In this paper, fault-tolerance characteristics of a reconfigurable tilt-rotor quadcopter upon a propeller failure are presented. Traditional quadcopters experience instability and asymmetry about yaw-axis upon a propeller failure but the design and control strategy presented here can handle a complete propeller failure during flight. Fault-tolerance is achieved by means of structural and flight controller reconfiguration. The concept involves conversion of a tilt-rotor UAV into a T-copter. The dynamics and control of the tilt-rotor quadcopter are presented for ideal flight condition and for the reconfigured system in case of propeller failure. Analytical solution for trim flight conditions yielding zero angular rates for the UAV is derived. It has been shown that the structurally reconfigured UAV is controllable and completes the flight mission without much compromise in flight performance. The controllability and observability analysis …", "num_citations": "11\n", "authors": ["1435"]}
{"title": "Stability and control of tilting-rotor quadcopter in case of a propeller failure\n", "abstract": " In this paper, stability and control of tilting-rotor quadcopter is presented upon failure of one propeller during flight. The tilting rotor quadcopter provides advantage in terms of additional stable configurations. On failure of one propeller, the quadcopter has a tendency of spinning about the primary axis fixed to the vehicle as an outcome of the asymmetry about the yaw axis. The tilting-rotor configuration is an over-actuated form of a traditional quadcopter and it is capable of handling a propeller failure, thus making it a fault tolerant system. In this paper, a dynamic model of tilting-rotor quadcopter with one propeller failure is derived and a controller is designed to achieve hovering and navigation capability. The simulation results of transnational and hovering motion are presented.", "num_citations": "10\n", "authors": ["1435"]}
{"title": "Tilt-Rotor Quadcopter Xplored: Hardware based Dynamics, Smart Sliding Mode Controller, Attitude Hold & Wind Disturbance Scenarios\n", "abstract": " This paper provides insights on the tilt-rotor quadcopters being a fully actuated system. The tilt-rotor quadcopters are a novel class of quadcopters with the capability of rotating each arm/rotor of the quadcopter to an angle using a servo motor. With the additional servo control inputs, the tilt-rotor quadcopters are fully actuated systems and hence can even hover at any desired orientation. The dynamics of the tilt-rotor quadcopters are derived based on hardware developed in the laboratory with minimal assumptions. A novel nonlinear sliding mode controller is designed that provides the controller input values to achieve any orientation and position as desired. Computational Fluid Dynamic (CFD) simulations were performed on a CAD model of the tilt-rotor quadcopter to obtain real time drag forces for various wind velocities. The robustness of the sliding mode controller is demonstrated under various wind disturbance …", "num_citations": "9\n", "authors": ["1435"]}
{"title": "Flight control of sliding arm quadcopter with dynamic structural parameters\n", "abstract": " The conceptual design and flight controller of a novel kind of quadcopter are presented. This design is capable of morphing the shape of the UAV during flight to achieve position and attitude control. We consider a dynamic center of gravity (CoG) which causes continuous variation in a moment of inertia (MoI) parameters of the UAV. These dynamic structural parameters play a vital role in the stability and control of the system. The length of quadcopter arms is a variable parameter, and it is actuated using attitude feedback-based control law. The MoI parameters are computed in real-time and incorporated in the equations of motion of the system. The UAV utilizes the angular motion of propellers and variable quadcopter arm lengths for position and navigation control. The movement space of the CoG is a design parameter and it is bounded by actuator limitations and stability requirements of the system. A detailed …", "num_citations": "8\n", "authors": ["1435"]}
{"title": "Fault tolerance of a reconfigurable tilt-rotor quadcopter using sliding mode control\n", "abstract": " Tilt-rotor quadcopters are a novel class of quadcopters with a servo motor attached on each arm that assist the quadcopter’s rotors to tilt to a desired angle thereby enabling thrust vectoring. Using these additional tilt angles, this type of a quadcopter can be used to achieve desired trajectories with faster maneuvering and can handle external disturbances better than a conventional quadcopter. In this paper, a non-linear controller has been designed using sliding mode technique for the pitch, roll, yaw motions and the servo motor tilt angles of the quadcopter. The dynamic model of the tilt-rotor quadcopter is presented, based on which sliding surfaces were designed to minimize the tracking errors. Using the control inputs derived from these sliding surfaces, the state variables converge to their desired values in finite-time. Further, the non-linear sliding surface coefficients are obtained by stability analysis. The …", "num_citations": "8\n", "authors": ["1435"]}
{"title": "Construction site evaluation employing 3d models from uav imagery\n", "abstract": " Continuous monitoring of construction stages using traditional methods such as survey measurement is a laborintensive process. With the advancements in Unmanned Aerial Vehicles (UAV) and image processing techniques, monitoring procedures can be improved.First, various flight parameters, mission planning applications and cameras for capturing aerial images will be compared. Second, the procedure for post-processing aerial images to create 3D models and orthomosaics will be reviewed including the impact of different ground sampling distances on the quality of the 3D models. Optimized 3D models will be analyzed further to achieve accurate measurements (length measurement and volume measurement). Finally, the effects of inclusion of manually surveyed ground control points on the final measurements will be reviewed and the accuracy of the measurements will be compared against manual and …", "num_citations": "8\n", "authors": ["1435"]}
{"title": "Position and attitude control by rotor tilt and rotor speed synchronization for single axis tilting-rotor quadcopter\n", "abstract": " In this paper, the control maneuvering, and performance analysis of a tilting-rotor quadcopter during autonomous flight is presented. Unlike traditional quadcopters, a tilting-rotor quadcopter provides additional actuated controls as the propeller motors are actuated for tilt which can be utilized to improve efficiency of the aerial vehicle during flight. The tilting-rotor quadcopter design is accomplished by using an additional servo motor for each rotor that enables the rotor to tilt about the axis of quadcopter arm. Here, a detailed control strategy has been discussed to use the propeller tilts for position and orientation control during completely autonomous flights of the quadcopter. In conventional quadcopters, the variation in rotational speeds of the four propellers is utilized for maneuvering. This work incorporates use of varying propeller rotational speeds along with tilting of the propellers for maneuvering the quadcopter …", "num_citations": "6\n", "authors": ["1435"]}
{"title": "Developmental reinforcement learning of control policy of a quadcopter UAV with thrust vectoring rotors\n", "abstract": " In this paper, we present a novel developmental reinforcement learning-based controller for a quadcopter with thrust vectoring capabilities. This multirotor UAV design has tilt-enabled rotors. It utilizes the rotor force magnitude and direction to achieve the desired state during flight. The control policy of this robot is learned using the policy transfer from the learned controller of the quadcopter (comparatively simple UAV design without thrust vectoring). This approach allows learning a control policy for systems with multiple inputs and multiple outputs. The performance of the learned policy is evaluated by physics-based simulations for the tasks of hovering and way-point navigation. The flight simulations utilize a flight controller based on reinforcement learning without any additional PID components. The results show faster learning with the presented approach as opposed to learning the control policy from scratch …", "num_citations": "5\n", "authors": ["1435"]}
{"title": "Quaternion Feedback Based Autonomous Control of a Quadcopter UAV with Thrust Vectoring Rotors\n", "abstract": " In this paper, we present an autonomous flight controller for a quadcopter with thrust vectoring capabilities. This UAV falls in the category of multirotors with tilt-motion enabled rotors. Since the vehicle considered is over-actuated in nature, the dynamics and control allocation have to be analysed carefully. Moreover, the possibility of hovering at large attitude maneuvers of this novel vehicle requires singularity-free attitude control. Hence, quaternion state feedback is utilized to compute the control commands for the UAV motors while avoiding the gimbal lock condition experienced by Euler angle based controllers. The quaternion implementation also reduces the overall complexity of state estimation due to absence of trigonometric parameters. The quadcopter dynamic model and state space is utilized to design the attitude controller and control allocation for the UAV. The control allocation, in particular, is derived by …", "num_citations": "5\n", "authors": ["1435"]}
{"title": "Self-organized circle formation around an unknown target by a multi-robot swarm using a local communication strategy\n", "abstract": " Multi-robot systems have an innate advantage of enhancing system robustness in situations where the chances for noise in sensory data or faults in robotic agents are high. The distribution of the task at hand among multiple robots and coordination among these robotic agents can also make these systems more efficient. The formation problem for a multi-robot system is defined as the coordination of multiple robots to form and maintain a specific geometric pattern such as circle, line, or square. This paper focuses on circular pattern formation through self-organization in multi-robot systems. A detailed algorithm for circle formation around an unknown target using exceptionally simple robots is presented along with the results. In this algorithm, we adopt a communication-based multi-agent model where each robotic agent interacts through minimal, though explicit, communication within very limited range and with …", "num_citations": "5\n", "authors": ["1435"]}
{"title": "Application of Fuzzy Logic for Developing Sense and Avoid Techniques for UAV Flight Operations in National Airspace\n", "abstract": " In this work, a Fuzzy Inference System (FIS) is proposed to develop a sense and avoid technique for conflict-free Unmanned Aerial Vehicle (UAV) flight operations in the national airspace. The proposed method is implemented alongside the flight control software guiding the UAV towards a predefined goal. The fuzzy system makes decisions for sense and avoid with respect to the state of other intruder aircraft in the airspace. The fuzzy rules are selected under consideration of the heading and position data of the intruder aircraft obtained using ADS-B sensor relative to the controlled UAV. The avoidance controller is implemented alongside a traditional PID-based flight controller to test the effectiveness of the sense-and-avoid technique. The PID controller drives the controlled UAV towards the goal and the fuzzy controller is for conflict avoidance based on an event trigger logic if the controlled UAV is in the …", "num_citations": "2\n", "authors": ["1435"]}