{"title": "LoRa - A Survey of Recent Research Trends\n", "abstract": " Nowadays the Internet of Things (IoT) is one of the most promising application areas in information technology for future products and services. Therefore, it is not surprising that new technologies arise, which are marketed as “the most useful technology” for applications in IoT devices. In this study, we focus on the new communication technology called LoRaWAN. Our aim is to evaluate the usefulness of LoRaWAN technology in the field of IoT, and especially in sensor network solutions. The research methodology is a literature survey and primary articles were selected by means of a systematic literature review. More than fifty suitable research papers were identified. From these, the following research questions were formulated: “How to categorize LoRa research papers?” and “What are the application trends in LoRa?” This study presents a way to categorize research papers with diverse themes. In addition, this …", "num_citations": "65\n", "authors": ["747"]}
{"title": "Agile methods for embedded systems development-a literature review and a mapping study\n", "abstract": " There is a wide area of applications that use embedded systems, and the number of such systems keeps growing. The required functionality and complexity of embedded systems are also constantly increasing, and development of such products is becoming increasingly harder. This requires new thinking on the product development processes, and one such emerging philosophy is the agile methods. These methods were created by the software engineering community where they are commonly used. Since then, they have been adopted in embedded systems development; however, whether they can improve the embedded systems product development processes remains an open question. This study aims to bring forth what is known about agile methods in embedded systems development and to find out if agile practices are suitable in this domain and what evidence is there to support the findings. We conducted a literature review and a mapping study to answer these questions. The scope of this study is not only limited to embedded software development, but also to embedded hardware and integrated circuits. We have found that agile methods can be used in the embedded domain, but the methods and practices need to be adapted to suit the more constrained field of embedded product development. Furthermore, the field of embedded product development has wide diversity of products with different needs and domain-specific problems so that no single method is applicable, but rather many methods and practices are needed for different situations.", "num_citations": "64\n", "authors": ["747"]}
{"title": "Technical Debt and the Effect of Agile Software Development Practices on It–An Industry Practitioner Survey\n", "abstract": " A major reason for the popularity of agile and lean software methods is their capability to function in resource scarce and requirement erratic environments. Both of these characteristics cause accumulation of technical debt, something that is the end result of either intentional or unintentional decisions. The ability of these methods to function with technical debt indicates that they contain components with inherent technical debt management capabilities. This study conducts a survey on industry practitioners to discover what is their level of technical debt knowledge, how does technical debt manifest in their projects and which of the applied components of agile software development -- both processes and practices -- are sensitive to technical debt. This paper contributes to the technical debt discussion by showing differences in assumed and indicated technical debt knowledge. Furthermore, components closest to …", "num_citations": "59\n", "authors": ["747"]}
{"title": "The Dark Side of Gamification: How we should stop worrying and study also the negative impacts of bringing game design elements to everywhere\n", "abstract": " There are always two sides to every story. This statement is true also for the most recent hype term gamification–ie, bringing game design elements into non-game contexts–that has been used to improve users’ motivation and performance in various domains. Previous studies on gamification have mainly taken a positive approach towards the phenomenon and its implications. To depart from the existing research, this tertiary literature review assesses the negative effects of gamification (such as game addiction and ethical issues). The systematic literature review method is followed in collection of 22 literature studies published on gamification. The analysis of these secondary studies show that while several researchers acknowledge possible problems and consequences, there is a clear research gap in understanding the negative impacts of gamification. We categorize the presented negative implications to limiting and harmful issues. Finally, this study calls for further work assessing and defining the limitations and borders for the ethical use of game design elements in everyday life as well as for growing our understanding for harmful issues.", "num_citations": "50\n", "authors": ["747"]}
{"title": "National Software Industry Survey 2008: The Finnish Software Industry in 2007\n", "abstract": " This report presents the results of the eleventh annual Finnish software industry survey. The software industry is a challenging one for survey research due to the pervasive nature of software; Software is a key component of many modern technology products, and can be also used as an integrated element when producing services. Moreover, it is difficult to separate the software industry from other information product industries [101]. The recent boom in online services has further increased the challenges in defining the boundaries of the industry [72]. The main focus of this report is on the software product business, but non-product or service businesses are covered to some extent as well.Software industry is a subset of professional software development. We classify these activities into four categories as shown in Figure 1.1. Software business is traditionally divided into software products and custom made software [79]. This classification is reflected on the horizontal axis of our classification. Recently the boundaries between software industry and other industries have become increasingly blurred due to two trends. First, hardware producers are relying on software on functionality and differentiation. In some cases firms considered traditionally to be solely device or machinery vendors have expanded their business to include also complementary software products or services that have a significant software component. Second, the emergence of online services and e-business has resulted in firms operating in other industries, such as media, retailing, and various services, to expand into Internet based offerings. This “extension” of software …", "num_citations": "40\n", "authors": ["747"]}
{"title": "An Evaluation Framework for Cross-Platform Mobile App Development Tools: A case analysis of Adobe PhoneGap framework\n", "abstract": " The'App economy'is a highly lucrative and competitive market for independent software vendors as it potentially offers an easy highway to reach millions of users. However, the mobile application landscape is scattered and an application developer has to publish the software for several different platforms to be able to serve a majority of smartphone users. Therefore, a bunch of cross-development tools have been offered to simplify this workload. In this paper, we present an evaluation framework for comparing different cross-development tools. We use this framework to evaluate Adobe PhoneGap tool against native development in Android and Windows Phone platforms. The results of a case study reveal that while the cross-platform technique was easy to use, the appearance and usability of the app was mediocre at its best. The business impacts of these are also discussed.", "num_citations": "28\n", "authors": ["747"]}
{"title": "Letters from the War of Ecosystems–An Analysis of Independent Software Vendors in Mobile Application Marketplaces\n", "abstract": " The recent emergence of a new generation of mobile application marketplaces has changed the business in the mobile ecosystems. The marketplaces have gathered over a million applications by hundreds of thousands of application developers and publishers. Thus, software ecosystems—consisting of developers, consumers and the orchestrator—have emerged as a part of the mobile ecosystem.", "num_citations": "28\n", "authors": ["747"]}
{"title": "Security in the Internet of Things through Obfuscation and Diversification\n", "abstract": " Internet of Things (IoT) is composed of heterogeneous embedded and wearable sensors and devices that collect and share information over the Internet. This may contain private information of the users. Thus, securing the information and preserving the privacy of the users are of paramount importance. In this paper we look into the possibility of applying the two techniques, obfuscation and diversification, in IoT. Diversification and obfuscation techniques are two outstanding security techniques used for proactively protecting the software and code. We propose obfuscating and diversifying the operating systems and APIs on the IoT devices, and also some communication protocols enabling the external use of IoT devices. We believe that the proposed ideas mitigate the risk of unknown zero-day attacks, large-scale attacks, and also the targeted attacks.", "num_citations": "25\n", "authors": ["747"]}
{"title": "Lean software startup – an experience report from an entrepreneurial software business course\n", "abstract": " This paper offers blueprints for and reports upon three years experience from teaching the university course “Lean Software Startup” for information technology and economics students. The course aims to give a learning experience on ideation/innovation and subsequent product and business development using the lean startup method. The course educates the students in software business, entrepreneurship, teamwork and the lean startup method. The paper describes the pedagogical design and practical implementation of the course in sufficient detail to serve as an example of how entrepreneurship and business issues can be integrated into a software engineering curriculum. The course is evaluated through learning diaries and a questionnaire, as well as the primary teacher’s learnings in the three course instances. We also examine the course in the context of CDIO and show its connection points to …", "num_citations": "25\n", "authors": ["747"]}
{"title": "The sigmoidal growth of operating system security vulnerabilities: an empirical revisit\n", "abstract": " Purpose. Motivated by the calls for more replications, this paper evaluates a theoretical model for the sigmoidal growth of operating system security vulnerabilities by replicating and extending the existing empirical evidence. Approach. The paper investigates the growth of software security vulnerabilities by fitting the linear, logistic, and Gompertz growth models with nonlinear least squares to time series data that covers a number of operating system products from Red Hat and Microsoft. Results. Although the fitted models are not free of statistical problems, the empirical results show that a sigmoidal growth function can be used for descriptive purposes. The paper further shows that a sigmoidal trend applies also to the number of software faults that were fixed in the Red Hat products. Conclusion. The paper supports the contested theoretical growth model. The few discussed theoretical problems can be used to …", "num_citations": "24\n", "authors": ["747"]}
{"title": "Busting a Myth: Review of Agile Security Engineering Methods\n", "abstract": " Engineering methods are essential in software development, and form a crucial element in the design and implementation of software security. Security engineering processes and activities have a long and well-standardized history of integration with software development methods. The inception of iterative and incremental software development methods raised suspicions of an inherent incompatibility between the traditional non-agile security processes and the new agile methods. This suspicion still affects the attitude towards agile security. To examine and explore this myth, this study presents a literature review of a selected set of agile secure software development methods. A systematic literature method was used to find the definitive set of secure agile software development methods, of which a core set of 11 papers was selected for analysis, and the security activities documented in the methods were …", "num_citations": "20\n", "authors": ["747"]}
{"title": "Diversification of system calls in Linux binaries\n", "abstract": " This paper studies the idea of using large-scale diversification to protect operating systems and make malware ineffective. The idea is to first diversify the system call interface on a specific computer so that it becomes very challenging for a piece of malware to access resources, and to combine this with the recursive diversification of system library routines indirectly invoking system calls. Because of this unique diversification (i.e. a unique mapping of system call numbers), a large group of computers would have the same functionality but differently diversified software layers and user applications. A malicious program now becomes incompatible with its environment. The basic flaw of operating system monoculture – the vulnerability of all software to the same attacks – would be fixed this way.               Specifically, we analyze the presence of system calls in the ELF binaries. We study the locations of system …", "num_citations": "19\n", "authors": ["747"]}
{"title": "Survey of Prototyping Solutions Utilizing Raspberry Pi\n", "abstract": " Sensor networks are a highly researched application area in the field of Internet of Things (IoT). A key cost and resource question in the development of IoT network sensor solutions is prototype implementation. In this study, the Raspberry Pi-a widely used single board computer-is investigated as it is one of the most commonly used prototyping devices available and is also widely used in scientific research. In this paper, we address which technologies, the usefulness and what kinds of issues arise when the prototyping of a sensor network solution is done with Raspberry Pi. The extant literature is studied by selecting papers with the systematic literature review method. Based on an extensive survey of the selected studies, we found several sensor-based implementations where Raspberry Pi has been used. In addition, this survey revealed subjects, such as e-health and education, which expanded the research …", "num_citations": "18\n", "authors": ["747"]}
{"title": "A Comparison of Security Assurance Support of Agile Software Development Methods\n", "abstract": " Agile methods increase the speed and reduce the cost of software projects; however, they have been criticized for lack of documentation, traditional quality control, and, most importantly, lack of security assurance-mostly due to their informal and self-organizing approach to software development. This paper clarifies the requirements for security assurance by using an evaluation framework to analyze the compatibility of established agile security development methods: XP, Scrum and Kanban, combined with Microsoft SDL security framework, against Finland's established national security regulation (Vahti). We also analyze the selected methods based on their role definitions, and provide some avenues for future research.", "num_citations": "18\n", "authors": ["747"]}
{"title": "Symbol Diversification of Linux Binaries\n", "abstract": " In this paper, we advocate large-scale diversification as a method to protect operating systems and render malicious programs ineffective. The idea is to diversify all the indirect library entry points to the system calls on a specific computer. As a result, it becomes very difficult for a piece of malware to access resources. The diversification of indirect system call entry points in operating system libraries is unique for each computer. Therefore, a piece of malware no longer works on several computers and becomes incompatible with their environment. We also present a concrete diversification tool and results on successful diversification. We conclude that despite some challenges, our tool can successfully diversify symbols in binaries and associated libraries in order to protect the system from attacks.", "num_citations": "17\n", "authors": ["747"]}
{"title": "An outlook on the institutional evolution of the European Union cyber security apparatus\n", "abstract": " This paper observes the evolution of cyber security institutions recently established in the European Union. These institutions are based on older national, regional, and international Internet governance networks for voluntary transnational coordination of cyber security. The entry of the European Union in the cyber security domain caused a visible institutional change in the operational and regulatory status of the European networks, but the change was neither abrupt nor revolutionary. Rather, a new coordination hub was installed in the existing European networks, while later regulations were implemented with small incremental changes to the status of the deployed institutional hub. Building on a theoretical model of gradual institutional change from the field of political economy, the paper not only elaborates the evolution within the European Union, but also provides a political situation analysis of the …", "num_citations": "16\n", "authors": ["747"]}
{"title": "Software Security Considerations for IoT\n", "abstract": " Internet of Things (IoT) is a swiftly growing technology and business domain that is expected to revolutionize the modern trade. Nonetheless, shortcomings in security are common in this new domain and security issues are the Achilles' heel of the new technology. In this study, we analyze different security solutions for IoT devices and propose suitable techniques for further analysis. The aim of this study is to provide guidance on implementing security solutions for both existing and coming devices of Internet of Things, by providing analysis and defining the Complexity of Implementation score for each solution.", "num_citations": "15\n", "authors": ["747"]}
{"title": "Case Study of Security Development in an Agile Environment: Building Identity Management for a Government Agency\n", "abstract": " In contemporary software development projects and computing tasks, security concerns have an increasing effect, and sometimes even guide both the design and the project's processes. In certain environments, the demand for the security becomes the main driver of the development. In these cases, the development of the product requires special security arrangements for development and hosting, and specific security-oriented processes for governance. Compliance with these requirements using agile development methods may not only be a chance to improve the project efficiency, but can in some cases, such as in the case discussed in this paper, be an organizational requirement. This paper describes a case of building a secure identity management system and its management processes, in compliance with the Finnish government's VAHTI security instructions. The building project was to be implemented in …", "num_citations": "15\n", "authors": ["747"]}
{"title": "Security and Privacy in Cloud Computing via Obfuscation and Diversification: a Survey\n", "abstract": " The development of cloud computing has facilitate the organizations with its services. This makes the security and privacy of the cloud even more significant. Diversification and obfuscation approaches are of the most promising proactive techniques that protect computers from harmful malware, by preventing them to take advantage of the security vulnerabilities. There is a large body of research on the use of diversification and obfuscation techniques for improving the security in various domains, including cloud computing. Cloud computing provides an excellent setting for applying diversification/obfuscation, as the computing platforms (virtual machines) are implemented in software. The main objective of this study is to determine in what ways obfuscation and diversification techniques are used to enhance the security and privacy of the cloud computing, and discover the potential avenues for the further research …", "num_citations": "15\n", "authors": ["747"]}
{"title": "How Do Small and Medium-Sized Game Companies Use Analytics? An Attention-Based View of Game Analytics\n", "abstract": " The widespread adoption of the freemium business model together with the introduction of cost-efficient analytics tools have made the use of analytics pervasive in the game industry. While big data and analytics have drawn extensive scholarly attention, the research focusing particularly on game analytics is scant and largely descriptive. Thus, there is a need for research focusing on how game companies employ analytics. In this study, we analyze data collected through a set of in-depth interviews of small and medium-sized freemium game developers. We identify four main roles of game analytics: 1) sense-making device, 2) decision-support system, 3) communication tool, and 4) hygiene factor. We employ the attention-based view of the firm to discuss how these roles diverge and converge in terms of organizational attention. The study advances the research on the roles and business value of analytics in the …", "num_citations": "14\n", "authors": ["747"]}
{"title": "Securing Scrum for VAHTI\n", "abstract": " Software security is a combination of security methods, techniques and tools, aiming to promote data confidentiality, integrity, usability, availability and privacy. In order to achieve concrete and measurable levels of software security, several international, national and industry-level regulations have been established. Finnish governmental security standard collection, VAHTI, is one of the most extensive example of these standards. This paper presents a selection of methods, tools, techniques and modifications to Scrum software development method to achieve the levels of security compliant with VAHTI instructions for software development. These comprise of security-specific modifications and additions to Scrum roles, modifications to sprints, and inclusion of special hardening sprints and spikes to implement the security items in the product backlog. Security requirements are transformed to security stories, abuse cases and other security-related tasks. Definition of done regarding the VAHTI requirements on is established and the steps to achieve it are described.", "num_citations": "14\n", "authors": ["747"]}
{"title": "Trading Exploits Online: A Preliminary Case Study\n", "abstract": " A software defect that exposes a software system to a cyber security attack is known as a software vulnerability. A software security exploit is an engineered software solution that successfully exploits the vulnerability. Exploits are used to break into computer systems, but exploits are currently used also for security testing, security analytics, intrusion detection, consultation, and other legitimate and legal purposes. A well-established market emerged in the 2000s for software vulnerabilities. The current market segments populated by small and medium-sized companies exhibit signals that may eventually lead to a similar industrialization of software exploits. To these ends and against these industry trends, this paper observes the first online market place for trading exploits between buyers and sellers. The paper adopts three different perspectives to study the case. The paper (a) portrays the studied exploit market place …", "num_citations": "12\n", "authors": ["747"]}
{"title": "Evaluating the use of internet search volumes for time series modeling of sales in the video game industry\n", "abstract": " Internet search volumes have been successfully adopted for time series analysis of different phenomena. This empirical paper evaluates the feasibility of search volumes in modeling of weekly video game sales. Building on the theoretical concepts of product life cycle, diffusion, and electronic word-of-mouth advertisement, the empirical analysis concentrates on the hypothesized Granger causality between sales and search volumes. By using a bivariate vector autoregression model with a dataset of nearly a hundred video games, only a few games exhibit such causality to either direction. When correlations are present, these rather occur instantaneously; the current weekly amount of sales tends to mirror the current weekly amount of searches. According to the results, search volumes contribute only a limited additional statistical power for forecasting, however. Besides this statistical limitation, the presented …", "num_citations": "11\n", "authors": ["747"]}
{"title": "What motivates adult age women to make a career change to the software industry?\n", "abstract": " The software industry is facing rapid changes both in the field of new technologies and skills demanded. New kind of people with a multiple background are sought by recruiters and industry is already suffering from a severe labour shortage. One of the solutions have been to get more to the industry and past decades a lot of work has been done for getting more women for the STEM industries. However, the results have not been as efficient that would have hoped for and in addition to this, women who are working already in the industry are not pursuing towards more technical or manager positions. This paper addresses the question what motivates adult age women to make a career change to the software industry in Finland. The background data for the paper was collected with an open internet survey (n=134) from Finnish women who have already made or are planning to make a career change to the software …", "num_citations": "10\n", "authors": ["747"]}
{"title": "Towards Ethical Data Ecosystems: A Literature Study\n", "abstract": " While the importance of data is growing as the fuel of the new data economy, also the role of the data ecosystems is growing. The new data ecosystems enables the use, reuse and enrichment of big data sets by or together with third parties. However, in the context of technology management, the governance of these kinds of data ecosystems raises ethical questions and issues that should be acknowledged by researchers and practitioners. This study reviews the extant literature regarding the given advice about ethical considerations. The method of systematic literature study is used to collect the primary articles (N=20). The selected articles are analyzed and themed according to reoccurring themes: privacy, accountability, ownership, accessibility, and motivation. The results show the discussion is fragmented and concrete ethical guidelines are lacking. Thus, this study requires more work for governing data …", "num_citations": "10\n", "authors": ["747"]}
{"title": "Obfuscation and Diversification for Securing the Internet of Things (IoT)\n", "abstract": " Internet of Things (IoT) is made up of heterogeneous sensors and devices that work together to make the humans’ lives more intelligent. These devices work together by sharing the collected information about the environment. This information may contain private information of the users, which makes it highly significant to protect the information in order to preserve the privacy of the users. In this chapter, we propose using the two proactive techniques, obfuscation and diversification, for securing IoT. The proposed idea includes diversifying and obfuscating the operating systems of the devices participating in IoT, and also communication protocols among the devices. Diversification and obfuscation are two successful techniques used for securing the software and code. We believe that the proposed methods can be used in defeating the unknown zero-day attacks, targeted attacks, and also massive-scale attacks.", "num_citations": "10\n", "authors": ["747"]}
{"title": "Aligning Security Objectives With Agile Software Development\n", "abstract": " Success of software development process is defined by its ability to transform the business objectives into requirements, and further into features and functionality. In addition to business objectives, software development also has security objectives requiring security engineering activities. In contrast to the iterative and incremental software development process, software security engineering is defined by sequential life cycle models: security and business objectives are thus implemented using conflicting approaches. To identify the incompatibilities between the methodologies, in this study the security engineering activities are mapped into common agile software development practises, processes and artifacts. Security engineering activities from Microsoft SDL, the ISO Common Criteria and OWASP SAMM security development lifecycle models are mapped into common agile processes, practises and artifacts. The …", "num_citations": "9\n", "authors": ["747"]}
{"title": "Mining Social Networks of Open Source CVE Coordination\n", "abstract": " Coordination is one central tenet of software engineering practices and processes. In terms of software vulnerabilities, coordination is particularly evident in the processes used for obtaining Common Vulnerabilities and Exposures (CVEs) identifiers for discovered and disclosed vulnerabilities. As the central CVE tracking infrastructure maintained by the non-profit MITRE Corporation has recently been criticized for time delays in CVE assignment, almost an ideal case is available for studying software and security engineering coordination practices with practical relevance. Given this pragmatic motivation, this paper examines open source CVE coordination that occurs on the public oss-security mailing list. By combining social network analysis with a data-driven, exploratory research approach, the paper asks six data mining questions with practical relevance. By contemplating about answers to the questions asked by …", "num_citations": "9\n", "authors": ["747"]}
{"title": "Modeling the delivery of security advisories and CVEs\n", "abstract": " This empirical paper models three structural factors that are hypothesized to affect the turnaround times between the publication of security advisories and Common Vulnerabilities and Exposures (CVEs). The three structural factors are: (i) software product age at the time of advisory release; (ii) severity of vulnerabilities coordinated; and (iii) amounts of CVEs referenced in advisories. Although all three factors are observed to provide only limited information for statistically predicting the turnaround times in a dataset comprised of Microsoft, openSUSE, and Ubuntu operating system products, the paper outlines new research directions for better understanding the current problems related to vulnerability coordination.", "num_citations": "9\n", "authors": ["747"]}
{"title": "GDPR Compliant Blockchains – A Systematic Literature Review\n", "abstract": " Although blockchain-based digital services promise trust, accountability, and transparency, multiple paradoxes between blockchains and GDPR have been highlighted in the recent literature. Some of the recent literature also proposed possible solutions to these paradoxes. This article aims to conduct a systematic literature review on GDPR compliant blockchains and synthesize the findings. In particular, the goal was to identify 1) the GDPR articles that have been explored in prior literature; 2) the relevant research domains that have been explored, and 3) the research gaps. Our findings synthesized that the blockchains relevant GDPR articles can be categorized into six major groups, namely data deletion and modification (Article 16, 17, and 18), protection by design by default (Article 25), responsibilities of controllers and processors (Article 24, 26, and 28), consent management (Article 7), data processing …", "num_citations": "8\n", "authors": ["747"]}
{"title": "Is ecosystem health a useful metaphor? towards a research agenda for ecosystem health research\n", "abstract": " The term ecosystem has been widely adopted outside its original domain in biology, for example in business and engineering studies. Ecosystem health is a derivative metaphor used to describe the success of the ecosystem. In this paper, we describe the key shortcomings of ecosystem health research. We put forward two key postulates of ecosystem health. Based on these postulates we present a research agenda for ecosystem health.", "num_citations": "8\n", "authors": ["747"]}
{"title": "A Case Study on Software Vulnerability Coordination\n", "abstract": " Context: Coordination is a fundamental tenet of software engineering. Coordination is required also for identifying discovered and disclosed software vulnerabilities with Common Vulnerabilities and Exposures (CVEs). Motivated by recent practical challenges, this paper examines the coordination of CVEs for open source projects through a public mailing list.Objective: The paper observes the historical time delays between the assignment of CVEs on a mailing list and the later appearance of these in the National Vulnerability Database (NVD). Drawing from research on software engineering coordination, software vulnerabilities, and bug tracking, the delays are modeled through three dimensions: social networks and communication practices, tracking infrastructures, and the technical characteristics of the CVEs coordinated.Method: Given a period between 2008 and 2016, a sample of over five thousand CVEs is …", "num_citations": "8\n", "authors": ["747"]}
{"title": "The false prometheus: customer choice, smart devices, and trust\n", "abstract": " In the information society of today, privacy is a premium service and user-related information a commodity. This development has gone unnoticed for many, but for some it contradicts with their common sense and perception of right and wrong. If we look into user agreements, and the effect Fair Information Practice Principles (FIPPs) seem to have, this development is particularly evident. One-on-one agreements such as End User License Agreements (EULAs) between the providers and users have become ubiquitous to most users who simply scroll through the agreement and click 'I agree' without actually understanding or caring what they have accepted. There are various reasons for this kind of behavior ranging from complete indifference, to inadequate internet and technology literacy, and even to peer pressure as certain applications have become a 'must have' amongst a group of users. This problem is …", "num_citations": "8\n", "authors": ["747"]}
{"title": "The False Prometheus — Customer Choice, Smart Devices, and Trust\n", "abstract": " In the information society of today, privacy is a premium service and user-related information a commodity. This development has gone unnoticed for many, but for some it contradicts with their common sense and perception of right and wrong. If we look into user agreements, and the effect Fair Information Practice Principles (FIPPs) seem to have, this development is particularly evident. One-on-one agreements such as End User License Agreements (EULAs) between the providers and users have become ubiquitous to most users who simply scroll through the agreement and click 'I agree' without actually understanding or caring what they have accepted. There are various reasons for this kind of behavior ranging from complete indifference, to inadequate internet and technology literacy, and even to peer pressure as certain applications have become a 'must have' amongst a group of users. This problem is …", "num_citations": "8\n", "authors": ["747"]}
{"title": "The False Prometheus: Customer Choice, Smart Devices and Trust\n", "abstract": " In the information society of today, privacy is a premium service and user-related information a commodity. This development has gone unnoticed for many, but for some it contradicts with their common sense and perception of right and wrong. If we look into user agreements, and the effect Fair Information Practice Principles (FIPPs) seem to have, this development is particularly evident. One-on-one agreements such as End User License Agreements (EULAs) between the providers and users have become ubiquitous to most users who simply scroll through the agreement and click ‘I agree’ without actually understanding or caring what they have accepted.There are various reasons for this kind of behavior ranging from complete indifference, to inadequate internet and technology literacy, and even to peer pressure as certain applications have become a ‘must have’ amongst a group of users. This problem is …", "num_citations": "8\n", "authors": ["747"]}
{"title": "Time series trends in software evolution\n", "abstract": " Background The laws of software evolution were formulated to describe time series trends in software over time.   Objective Building on econometrics, the paper relates the laws theoretically to the concept of stationarity. The theoretical argumentation builds on the fact that in a stationary time series, the mean and variance remain constant. The concept is further elaborated with different statistical types of time series trends. These provide the objective for the empirical experiment that evaluates whether software size measures in a typical software evolution dataset are stationary.   Method The time series analysis is based on conventional statistical tests for the evaluation of stationarity.   Results The empirical dataset contains time series extracted from the version control systems used in Vaadin and Tomcat between circa 2006 and 2013. The results establish that the observed time series are neither stationary nor …", "num_citations": "8\n", "authors": ["747"]}
{"title": "Ecosystem: A Zombie Category?\n", "abstract": " What do you imagine in your mind when hearing the term `business ecosystem'? Is the image the same as your colleague's vision or how it was used in the latest ecosystem paper you have read? In this paper, Ulrich Beck's theory of a zombie category is used as an instrument to raise the question whether the general concept of an `ecosystem' is already a zombie category term-a term which has already dead and empty in content, while still being alive and used. `Business ecosystem' and its derivatives such as the `software ecosystem' are terms which do have a proper description; however, due to the widely use in different context, the terms might already be losing their original meaning.This paper reviews 20 highly-cited non-ecological ecosystem papers published after 2010. The papers represent the disciplines of engineering, social science and computer science. Five different usage cases are observed: (i …", "num_citations": "7\n", "authors": ["747"]}
{"title": "Healthy until otherwise proven: Some proposals for renewing research of software ecosystem health\n", "abstract": " The software ecosystem has become a central conceptualisation for characterising the contemporary software business world. To understand and evaluate ecosystems, the concept of 'ecosystem health' was borrowed from the field of biology. In a 'healthy' ecosystem, the participants will flourish and, vice versa, suffer in an unhealthy one. Yet, there is a lack of empirical validations for the current approach as well as certain limitations regarding the concept. This paper will present a critique on current ecosystem health measurement and evaluation approaches. In addition, there is discussion on three proposals that could help to refocus the academic research on software ecosystem health.", "num_citations": "7\n", "authors": ["747"]}
{"title": "To Redefine Ecosystem Health, or not to Redefine? A view of scientific knowledge on the ‘software ecosystem health’ concept\n", "abstract": " The classic argument of the business ecosystems is that the survival of a single actor depends on the whole network and its performance instead of solely on the actor’s own choices and actions. The ‘ecosystem health’is a crucial concept in the domain of ecosystem research:“if the ecosystem is healthy, individual participants will thrive; if the ecosystem is unhealthy, individual participants will suffer”. Three health measures have been defined for business ecosystems: productivity, robustness to external shocks, and niche creation that helps the ecosystem to renew. Similarly, the ecosystem health is seen as the indicator of well-being of a software ecosystem. This presentation discusses the current knowledge of software ecosystem health. In summary, we show that the view on what constitutes ecosystem health is scattered and the field needs redefinition–it is argued that the new direction of software ecosystem health should be sought in collaboration with industrial experts.", "num_citations": "7\n", "authors": ["747"]}
{"title": "Accounting Testing in Software Cost Estimation: A Case Study of the Current Practice and Impacts\n", "abstract": " Testing has become an integral part of most software projects. It accounts for even as high a share as 40% of the overall work effort. At the same time software projects are systematically exceeding their effort and schedule forecasts. Regardless of the overruns and big share of testing, there is very little advice for estimating testing activities. This case study research assesses the current practice of estimating testing activities, and the impact of these practices on estimation and project success. Based on the interviews with 11 stakeholders involved in two case projects and examination of project documentation, this study shows that companies easily deviate from their standard procedures, when estimating testing. This may even lead to severe estimation errors. The deviations can be explained by negative attitudes towards testing. Furthermore, this study shows that the extant literature has sparsely addressed estimation of software testing.", "num_citations": "7\n", "authors": ["747"]}
{"title": "Game Development Accelerator — Initial Design and Research Approach\n", "abstract": " Start-ups and game development are trending topics. There are established methods for both, but these are not suitable as such for starting game companies developing their first commercial game product. In this paper, a design for a series of accelerator programs, targeted for the first-time game developers, and an accompanying research approach are discussed. The goal of the approach is to combine quality research with relevant, imminent results, which help game start-ups to raise the success probability and lower the investors’ risks. Initial ideas of the accelerator design are presented to activate discussion with other researchers and practitioners planning or doing similar experiments.", "num_citations": "7\n", "authors": ["747"]}
{"title": "E-Government Ecosystem: A new view to explain complex phenomenon\n", "abstract": " Different kinds of e-governmental services have taken into use in several countries all over the world. The transition is often driven by the seen benefits in, e.g., efficiency, money savings as well as empowerment of citizens. Different e-governmental systems have been studied and analysed by using different theories and models; however, the current models often do not succeed to take a citizen - the customer - into account enough. This study propose of using an ecosystem viewpoint to define and explain this phenomenon and presents the concept of `e-government ecosystem'. The concept is based on philosophical foundation on citizenship. In addition, an existing maturity model is extended and future research areas proposed.", "num_citations": "6\n", "authors": ["747"]}
{"title": "The Role of Organisational Phenomena in Software Cost Estimation: A Case Study of Supporting and Hindering Factors\n", "abstract": " EN Despite the fact that many researchers and practitioners agree that organisational issues are equally important as technical issues from the software cost estimation (SCE) success point of view, most of the research focus has been put on the development of methods, whereas organisational factors have received surprisingly little academic scrutiny. This study aims to identify organisational factors that either support or hinder meaningful SCE, identifying their impact on estimation success. Top management’s role is specifically addressed. The study takes a qualitative and explorative case study based approach. In total, 18 semi-structured interviews aided the study of three projects in three organisations. Hence, the transferability of the results is limited. The results suggest that the role of the top management is important in creating prerequisites for meaningful estimation, but their day-to-day participation is not required for successful estimation. Top management may also induce undesired distortion in estimation. Estimation maturity and estimation success seem to have an interrelationship with software process maturity, but there seem to be no significant individual organisational factors, which alone would make estimation successful. Our results validate several distortions and biases reported in the previous studies, and show the SCE research focus has remained on methodologies and technical issues.", "num_citations": "6\n", "authors": ["747"]}
{"title": "Proceedings of the 9th International Workshop on Software Ecosystems (IWSECO 2017)\n", "abstract": " Network analysis is a valuable method for investigating and mapping the phenomena driving the social structure and sharing the findings with others. This article contributes to an emerging field of ‘smart data’research...", "num_citations": "6\n", "authors": ["747"]}
{"title": "The Role of Applications and their Vendors in Evolution of Software Ecosystems\n", "abstract": " The most recent trends in the electronic commerce research have suggested that forming an ecosystem around a platform would create a winning solution. The ecosystem, consisting of vendors and external actors, would create competitive advantage for the platform owner. Furthermore, the sheer number of the actors has been used as the measure of the ecosystem's well-being against competing ecosystems. Whereas a number of studies has been devoted to analyse the well-being indicators or structures of software ecosystems and the importance of complementors and complements are acknowledged, there is lack of studies addressing how the complementors affect into the evolution of ecosystems. This conceptual analysis aims to open discussion on this topic by using the mobile application ecosystems-such as Google Play or Apple's iOS-as the case subject. While the results suggest some implications for …", "num_citations": "6\n", "authors": ["747"]}
{"title": "A proxy-based security solution for web-based online eHealth services\n", "abstract": " This paper presents an idea of using a proxy-based security solution to protect web-based eHealth applications from client-side attacks. In today’s Internet, eHealth services face many challenges related to information security as the users display and input sensitive information using web applications. This information may be spied on or modified by a malicious adversary. By obfuscating the executable code of a web application and by continuously dynamically changing obfuscation, our solution makes it more difficult for a piece of malware to attack its target. We believe it would effectively mitigate automated client-side attacks.", "num_citations": "6\n", "authors": ["747"]}
{"title": "A Validation of Martin's Metric\n", "abstract": " Robert C. Martin presented a software metric for a set of classes ie a package. The objective of the package level metric is to identify poorly designed packages. The Martin’s metric actually consists of eight metrics which measure a few different characteristics of packages. The metric is widely known, but there is lack of theoretical and empirical evaluation of the Martin’s metric. This paper evaluates the theoretical background of the metric against an evaluation framework and presents an experimental evaluation of five open-source software applications. The theoretical validation reveals a weakness in Martin’s definition for cohesion. We propose a modification which is valid according to the evaluation framework.", "num_citations": "6\n", "authors": ["747"]}
{"title": "A mixed methods probe into the direct disclosure of software vulnerabilities\n", "abstract": " Software vulnerabilities are security-related software bugs. Direct disclosure refers to a practice that is widely used for communicating the confidential information about vulnerabilities between two parties, vulnerability discoverers and software producers. Building on software vulnerability life cycle analysis, this empirical paper observes the qualitative and quantitative characteristics of direct disclosure practices, focusing particularly on the historical problem related to producers’ reluctance to participate in the practices. According to the results, the problem was still present in the 2000s and early 2010s—and likely is still present today. By presenting this empirical result about the under researched phenomenon of direct disclosure of software vulnerabilities, the paper contributes to the research domain of vulnerability life cycle modeling in general and the subdomain of empirical vulnerability disclosure research in …", "num_citations": "5\n", "authors": ["747"]}
{"title": "Surveying secure software development practices in finland\n", "abstract": " Combining security engineering and software engineering is shaping the software development processes and shifting the emphasis of information security from the operation environment into the main information asset: the software itself. To protect software and data assets, software development is subjected to an increasing amount of external regulation and organizational security requirements. To fulfill these requirements, the practitioners producing secure software have plenty of models, guidelines, standards and security instructions to follow, but very little scientific knowledge about effectiveness of the security they take.", "num_citations": "5\n", "authors": ["747"]}
{"title": "Security, privacy'); drop table users; -- and forced trust in the information age?: when trusting an information system is not optional and why it matters\n", "abstract": " In this study, we discuss forced trust in the context of information systems, information society and surveillance. Trust definitions and concepts pertinent to the discussion are examined and portrayed with case examples of forced trust in different situations that are central to the information society. As forced trust appears mostly in governmental information systems, we reflect the concept from security and privacy point-of-view, concepts that are important for users of such systems in the current age of information. We portray the trust landscape of critical governmental information systems and discuss forced trust also in the context of Internet infrastructure and mass surveillance. We provide a glimpse of an information society that combines security, trust, and privacy, while also providing discussion on what kind of trust dynamics such a utopia would require.", "num_citations": "5\n", "authors": ["747"]}
{"title": "Tightroping Between APT and BCI in Small Enterprises\n", "abstract": " PurposeThe contemporary internet provisions increasingly sophisticated security attacks. Besides underlining the advanced nature of these attacks, the concept of an advanced persistent threat (APT) catalyzes the important perspective of longitudinal persistence; attacks are not only carefully planned and targeted but the subsequent exploitation period covers long periods of time. If an APT successfully realizes into such exploitation, information assets may be continuously monitored for harvesting business-critical information (BCI). These threats are relevant for the security of small enterprises, and this study aims to examine the qualitative factors that shape the security mindsets among these.Design/methodology/approachThe data are collected with semi-structured interviews of six enterprises in a small regional market segment. The analysis is based on a fourfold taxonomy that delivers three mindset profiles …", "num_citations": "5\n", "authors": ["747"]}
{"title": "Case Study of Agile Security Engineering: Building Identity Management for a Government Agency\n", "abstract": " Security concerns are increasingly guiding both the design and processes of software-intensive product development. In certain environments, the development of the product requires special security arrangements for development processes, product release, maintenance and hosting, and specific security-oriented processes and governance. Integrating the security engineering processes into agile development methods can have the effect of mitigating the agile methods' intended benefits. This article describes a case of a large ICT service provider building a secure identity management system for a sizable government agency. The project was a subject to strict security regulations due to the end product's critical role. The project was a multi-team, multi-site, standard-regulated security engineering and development work executed following the Scrum framework. The study reports the difficulties in combining …", "num_citations": "5\n", "authors": ["747"]}
{"title": "A Survey on Internal Interfaces Used by Exploits and Implications on Interface Diversification\n", "abstract": " The idea of interface diversification is that internal interfaces in the system are transformed into unique secret instances. On one hand, the trusted programs in the system are accordingly modified so that they can use the diversified interfaces. On the other hand, the malicious code injected into a system does not know the diversification secret, that is the language of the diversified system, and thus it is rendered useless. Based on our study of 500 exploits, this paper surveys the different interfaces that are targeted in malware attacks and can potentially be diversified in order to prevent the malware from reaching its goals. In this study, we also explore which of the identified interfaces have already been covered in existing diversification research and which interfaces should be considered in future research. Moreover, we discuss the benefits and drawbacks of diversifying these interfaces. We conclude that …", "num_citations": "5\n", "authors": ["747"]}
{"title": "The connection of the stakeholder cooperation intensity and team agility in software development\n", "abstract": " Today agile software development methods are used to create new systems, applications, and services in a wide range of industries. This paper analyzes the differences in stakeholder cooperation intensity for different levels of agile development. Two teams used a stakeholder identification framework to identify stakeholders' involvement for the new software system development. The teams are also measured by two industry agile measurement tests. The results show a connection between the level of agility and stakeholder cooperation intensity; and interestingly, the increase in intensity is with technical stakeholders, rather than with business people and customers as literature has suggested.", "num_citations": "5\n", "authors": ["747"]}
{"title": "Do Primal Instincts Explain Engagement in Location-Based Games? A hypothesis-forming focus group study on territorial behavior\n", "abstract": " Location-based games (LBGs), where the user’s physical location is a central part of gameplay, have become popular since the commercial success of Pokémon Go. The extant literature has focused to explain the success of LBGs by focusing on aspects of gratification and reasons to start, continue and quit playing. This study departs from the previous work by using a focus group method and hypothesizing that primal instincts developed during the evolutionary period of hunter-gatherer living—such as territorial behavior—can play a role in players’ actions, potentially enhancing engagement and motivation. The manifestation of territorial behavior in LBGs can occur via persistent need to control specific virtual locations in the game world. Initial results indicate that territorial behaviour could impact player engagement in the games. This study presents a conceptualization on how territorial instincts influence player engagement in LBGs and provides a theoretical background for future studies.", "num_citations": "4\n", "authors": ["747"]}
{"title": "The Shades of Grey: Datenherrschaft in Data-Driven Gamification\n", "abstract": " Data-driven gamification refers to the use of data collection and data science methods together with gamification practices in order to improve the selected aspects of a service or a product. As new innovations cause new ethical questions, this study surveys possible ethical problems of data-driven gamification. Precisely, we focus on the ethical question of using data collected from a user to modify behaviour of the user. Instead of a clearly bright or dark side of the force, we focus on the ethically grey area where intentions might be ethically justified while the results are not. To discuss this dilemma, we borrow the concept of ‘Datenherrschaft’—mastery over information—and present a philosophical inquiry of five cases: Leisure, Governmental, Healthcare, Educational and Workplace solutions. As a result, this study shows that there are clearly ethical issues, different shades of grey, related to the data-driven gamification and future work is needed in order assess, analyze and answer the presented problems.", "num_citations": "4\n", "authors": ["747"]}
{"title": "Security, Privacy'); DROP TABLE users; -- and Forced Trust in the Information Age? When trusting an information system is not optional and why it matters\n", "abstract": " In this study, we discuss forced trust in the context of information systems, information society and surveillance. Trust definitions and concepts pertinent to the discussion are examined and portrayed with case examples of forced trust in different situations that are central to the information society. As forced trust appears mostly in governmental information systems, we reflect the concept from security and privacy point-of-view, concepts that are important for users of such systems in the current age of information. We portray the trust landscape of critical governmental information systems and discuss forced trust also in the context of Internet infrastructure and mass surveillance. We provide a glimpse of an information society that combines security, trust, and privacy, while also providing discussion on what kind of trust dynamics such a utopia would require.", "num_citations": "4\n", "authors": ["747"]}
{"title": "Obfuscation and Diversification for Securing Cloud Computing\n", "abstract": " The evolution of cloud computing and advancement of its services has motivated the organizations and enterprises to move towards the cloud, in order to provide their services to their customers, with greater ease and higher efficiency. Utilizing the cloud-based services, on one hand has brought along numerous compelling benefits and, on the other hand, has raised concerns regarding the security and privacy of the data on the cloud, which is still an ongoing challenge. In this regard, there has been a large body of research on improving the security and privacy in cloud computing. In this chapter, we first study the status of security and privacy in cloud computing. Then among all the existing security techniques, we narrow our focus on obfuscation and diversification techniques. We present the state-of-the-art review in this field of study, how these two techniques have been used in cloud computing to …", "num_citations": "4\n", "authors": ["747"]}
{"title": "The Black Mark Beside My Name Server: Exploring the Importance of Name Server IP Addresses in Malware DNS Graphs\n", "abstract": " This short exploratory empirical paper examines a question of how important the Internet protocol (IP) addresses of name servers are in linking together Internet domains that have distributed malware or otherwise having been associated with malicious computer networks. By using the domain name system (DNS) for building a relational representation, the found importance is elaborated with a dataset comprised of nearly sixty thousand domains. Besides the empirical exploration related to these domains, the paper provides a stylized discussion on the construction of empirical DNS graphs, including the concrete reduction and learning of the observed malware graph. With these two deliverables, the paper contributes to the active research field of DNS mining, further pinpointing a number of relevant research challenges for applications of complex network analysis for studying computer networking and cyber security.", "num_citations": "4\n", "authors": ["747"]}
{"title": "Software Vulnerability Life Cycles and the Age of Software Products: An Empirical Assertion with Operating System Products\n", "abstract": " This empirical paper examines whether the age of software products can explain the turnaround between the release of security advisories and the publication vulnerability information. Building on the theoretical rationale of vulnerability life cycle modeling, this assertion is examined with an empirical sample that covers operating system releases from Microsoft and two Linux vendors. Estimation is carried out with a linear regression model. The results indicate that the age of the observed Microsoft products does not affect the turnaround times, and only feeble statistical relationships are present for the examined Linux releases. With this negative result, the paper contributes to the vulnerability life cycle modeling research by presenting and rejecting one theoretically motivated and previously unexplored question. The rejection is also a positive result; there is no reason for users to fear that the turnaround …", "num_citations": "4\n", "authors": ["747"]}
{"title": "Agile Software Development and Innovation: A systematic Literature Review\n", "abstract": " Agile software development methods have been argued to enable innovation in software development. However, the existing research is scattered and further work would benefit from a common baseline. This study presents a systematic literature review on the broad theme of agile methods and innovations. By using an automatic search strategy for ten databases and complementing this search by a manual search strategy for the publication lists of the most active researcher in the field, 43 relevant articles were identified and included in this study. With a thematic synthesis, seven recurrent themes were identified. The results show that while the adoption of agile methods as innovations is well-understood, the agile methods effect on the innovation capabilities of a development team needs further work. Furthermore, the article shows that manual search strategy focused on the publication lists of the active authors is useful in literature studies on dispersed and little researched topics.", "num_citations": "4\n", "authors": ["747"]}
{"title": "Challenges in Agile Security Engineering: A Case Study\n", "abstract": " This chapter describes a case of a large ICT service provider building a secure identity management system for a government customer. Security concerns are a guiding factor in the design of software-intensive products and services. They also affect the processes of their development. In regulated environments, development of products requires special security for the development processes, product release, maintenance and hosting, and also require security-oriented management and governance. Integrating the security engineering processes into an agile development model is argued to have the effect of mitigating the agile methods' intended benefits. The project case was an effort of multi-team, multi-site, security engineering, and development work, executed using the Scrum framework and regulated by governmental security standards and guidelines. In this case research, the experiences in combining …", "num_citations": "3\n", "authors": ["747"]}
{"title": "Fitting Security into Agile Software Development\n", "abstract": " Security objectives in software development are increasingly convergent with the business objectives, as requirements for privacy and the cost of security incidents call for more dependable software products. The development of secure software is accomplished by augmenting the software development process with specific security engineering activities. Security engineering, in contrast to the iterative and incremental software development processes, is characterized by sequential life cycle models: the security objectives are thus to be achieved by conflicting approaches. In this study, to identify the incompatibilities between the approaches, the security engineering activities from Microsoft SDL, the ISO Common Criteria and OWASP SAMM security engineering models are mapped into common agile software development processes, practices and artifacts.", "num_citations": "3\n", "authors": ["747"]}
{"title": "Gamification Ethics\n", "abstract": " Gamiﬁcation ethics refers to the study and understanding of right and wrong conducts by or with gamiﬁed solutions. As gamiﬁcation taps into the natural playfulness of human beings, ethical issues are prevalent and must be considered by the developers.", "num_citations": "3\n", "authors": ["747"]}
{"title": "Correlating File-Based Malware Graphs Against the Empirical Ground Truth of DNS Graphs\n", "abstract": " This exploratory empirical paper investigates whether the sharing of unique malware files between domains is empirically associated with the sharing of Internet Protocol (IP) addresses and the sharing of normal, non-malware files. By utilizing a graph theoretical approach with a web crawling dataset from F-Secure, the paper finds no robust statistical associations, however. Unlike what might be expected from the still continuing popularity of shared hosting services, the sharing of IP addresses through the domain name system (DNS) seems to neither increase nor decrease the sharing of malware files. In addition to these exploratory empirical results, the paper contributes to the field of DNS mining by elaborating graph theoretical representations that are applicable for analyzing different network forensics problems.", "num_citations": "3\n", "authors": ["747"]}
{"title": "A Post-Mortem Empirical Investigation of the Popularity and Distribution of Malware Files in the Contemporary Web-Facing Internet\n", "abstract": " This short empirical paper investigates a snapshot of about two million files from a continuously updated big data collection maintained by F-Secure for security intelligence purposes. By further augmenting the snapshot with open data covering about a half of a million files, the paper examines two questions: (a) what is the shape of a probability distribution characterizing the relative share of malware files to all files distributed from web-facing Internet domains, and (b) what is the distribution shaping the popularity of malware files? A bimodal distribution is proposed as an answer to the former question, while a graph theoretical definition for the popularity concept indicates a long-tailed, extreme value distribution. With these two questions - and the answers thereto, the paper contributes to the attempts to understand large-scale characteristics of malware at the grand population level - at the level of the whole Internet.", "num_citations": "3\n", "authors": ["747"]}
{"title": "Reducing the number of unit tests with design by contract\n", "abstract": " Design by Contract (DbC) and unit testing (UT) are complementary approaches to improve the belief of correctness and the quality of the software. The interplay between the two techniques has been studied previously, eg, in the use of test oracles and test automation. However, we propose that DbC should drive the UT to become more cost-effective. The paper demonstrates some means for this approach by showing how to test a mapping data structure entirely with just one unit test script.", "num_citations": "3\n", "authors": ["747"]}
{"title": "Towards a GDPR-Compliant Blockchain-Based COVID Vaccination Passport\n", "abstract": " The COVID-19 pandemic has shaken the world and limited work/personal life activities. Besides the loss of human lives and agony faced by humankind, the pandemic has badly hit different sectors economically, including the travel industry. Special arrangements, including COVID test before departure and on arrival, and voluntary quarantine, were enforced to limit the risk of transmission. However, the hope for returning to a normal (pre-COVID) routine relies on the success of the current COVID vaccination drives administered by different countries. To open for tourism and other necessary travel, a need is realized for a universally accessible proof of COVID vaccination, allowing travelers to cross the borders without any hindrance. This paper presents an architectural framework for a GDPR-compliant blockchain-based COVID vaccination passport (VacciFi), whilst considering the relevant developments, especially in the European Union region.", "num_citations": "2\n", "authors": ["747"]}
{"title": "The War for Talent in Software Business — How are Finnish software companies perceiving and coping with the labor shortage?\n", "abstract": " The crosscutting need for high-skilled specialists is descriptive for the newest industrial revolution. The software industry is one of the most knowledge-intensive fields and the lack of competent labor can be harmful for the growth of the industry. Furthermore, the lack of competent workforce in the software industry will harm other industries as new digitalization projects are postponed. Currently, there are signs of severe labor shortage in Europe and one of the countries struggling with the lack of competent labor in the field of software is Finland. This paper investigates how Finnish software firms perceive the ‘War for Talent’ in the software industry and how it is perceived to affect into the companies. Based on the thematic analysis of 160 companies' responses consisting over 3,000 words, frequent themes related to reasons, consequences and proposed solutions of the labor shortage are identified. This study …", "num_citations": "2\n", "authors": ["747"]}
{"title": "Blockchain ethics: A systematic literature review of blockchain research\n", "abstract": " Blockchain is a recent development in technology which allows a cryptographically secured, decentralised and distributed storage of data. The technology innovation was done as a part of and became familiar through Bitcoin cryptocurrency, where it is used to openly store currency transactions among its users. Whereas a majority of recent research and development work of blockchain has been in a number of different cryptocurrency applications, the technology itself has been proposed and used in various domains ranging from open contracts to electronic voting. As the technology has potentially a remarkable power to shape the modern digital societies, its usage possesses several ethical questions. To study the state of the art in blockchain ethics research, this study present a systematic literature study (n = 26) on the phenomenon. The results show that the area is swiftly maturing, yet there is a call for concrete …", "num_citations": "2\n", "authors": ["747"]}
{"title": "The Ethics of Game Experience\n", "abstract": " Modern gaming—especially in mobile platforms—has turned into a quagmire of questionable practices. This chapter takes a look into the ethical problems brought about by the increasing importance of monetisation in game design. We recognise five factors that are threatening the player’s game experience and argue how they constitute unethical behaviour on the part of game designers.", "num_citations": "2\n", "authors": ["747"]}
{"title": "Software Business: 10th International Conference, ICSOB 2019, Jyväskylä, Finland, November 18-20, 2019, Proceedings\n", "abstract": " This book constitutes the refereed proceedings of the 10th International Conference on Software Business, ICSOB 2019, held in Jyväskylä, Finland, in November 2019. On the occasion of its tenth anniversary the conference theme this year was “The First Decade and Beyond” and focused on the development during the past decade, addressing the future of software-intensive business as well as studies on new and emerging ideas. The 18 full papers and 10 short papers presented together with 3 invited talks, 6 emerging research papers and a tutorial were carefully reviewed and selected from 52 submissions. They are organized in the following topical sections: software ecosystems; management of software products; continual improvement and product development; impacts of digitalization; software business education; software startups and digital business.", "num_citations": "2\n", "authors": ["747"]}
{"title": "Bridging the Gap between Software Architecture and Business Model Development: A Literature Study\n", "abstract": " The software architecture plan describes the high-level structure and logic of a software system. The architectural plan acts as a constitution and dictates the fundamental principles of the system; therefore, the plan also eventually determines which kinds of business models the software system can support. In the modern mercury business, there is need for experimentation in business model and flexibility in architecture. This paper uses a systematic literature review method to collect primary studies from the extant literature addressing business models and software architectures. The aim is to summarize the current knowledge. The selected primary studies (n=10) are qualitatively analyses and synthesized. The results show that the area remain mostly unaddressed and there is need to develop new methods to support flexible architecture design, tools and development methods.", "num_citations": "2\n", "authors": ["747"]}
{"title": "Crude and rude?\n", "abstract": " Old ways in the new oil business.", "num_citations": "2\n", "authors": ["747"]}
{"title": "Exploring the Use of Deprecated PHP Releases in the Wild Internet: Still a LAMP Issue?\n", "abstract": " Many web sites utilize deprecated software products that are no longer maintained by the associated software producers. This paper explores the question of whether an existing big data collection can be used to predict the likelihood of deprecated PHP releases based on different abstract components in modern web deployment stacks. Building on web intelligence, software security, and data-based industry rationales, the question is examined by focusing on the most popular domains in the contemporary web-facing Internet. Logistic regression is used for classification. Although statistical classification performance is modest, the results indicate that deprecated PHP releases are associated with Linux and other open source software components. Geographical variation is small. Besides these results, the paper contributes to the web intelligence research by evaluating the feasibility of existing big data collections …", "num_citations": "2\n", "authors": ["747"]}
{"title": "Proceedings of From Start-ups to SaaS Conglomerate: Life Cycles of Software Products Workshop (IW-LCSP 2013)\n", "abstract": " Proceedings of From Start-ups to SaaS Conglomerate: Life Cycles of Software Products Workshop (IW-LCSP 2013) — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Proceedings of From Start-ups to SaaS Conglomerate: Life Cycles of Software Products Workshop (IW-LCSP 2013) Sami Hyrynsalmi, Krzysztof Wnuk, Maya Daneva, Tuomas Mäkilä, Andrea Herrmann Research output: Book/Report › Anthology › Scientific › peer-review Overview Original language English Publisher CEUR-WS Publication status Published - 2013 Externally published Yes Publication type C2 Edited books Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Hyrynsalmi, S., …", "num_citations": "2\n", "authors": ["747"]}
{"title": "Towards Ethical Guidelines of Location-Based Games: Challenges in the Urban Gaming World\n", "abstract": " Location-based games—urban games which are played in real life locations—are growing their share in the mobile gaming markets. While these kinds of games have been present since the growing popularity of so-called feature phones, they gained remarkable momentum through the popularity of Niantic Inc.’s Pokémon Go, Ingress and later Harry Potter: Wizards Unite. As modern location-based games are gathering hundred of millions dollars monthly revenue, also related social, economical, and even juridical questions have raised; however, the ethical questions embodied into the location-based games or augmented reality games have not been completely unveiled. As the mobile game industry is growing its importance in the software industry, also business ethics questions should be taken into account during the design and development of game products and services. This paper seeks to …", "num_citations": "1\n", "authors": ["747"]}
{"title": "Software hardware combination for data gathering\n", "abstract": " The Internet of things (IoT) is a growing area in everyday life. New applications under the umbrella term IoT are being developed continually. This development has raised the need for framework definitions for different purposes. This research introduces a special software/hardware (SW/HW) framework for data gathering systems to be used in IoT related systems. The purpose of the research is to show the usability of a certain software hardware combination in prototype development. The SW/HW framework has been developed during several research projects. These projects have contained multiple iteration rounds. The main contribution of this research is the framework itself. The framework consists of a model of the system, sensor network, and cloud service. This research introduces the framework, its main components, and the usability of the framework in selected use cases.", "num_citations": "1\n", "authors": ["747"]}
{"title": "A Review of Ethical Discussions on Platforms and Ecosystems\n", "abstract": " Since the breakthrough of Apple’s iOS platform and AppStore marketplace a decade ago, different kinds of ecosystems and platforms have conquered the world. In the ecosystem-based business model, a platform owner offers a technological solution (e.g., Apple, Google) for end-users (e.g., smart phone users) and producers (e.g., application and content developers). The platform owner benefits, either directly or indirectly, from the transactions between end-users and producers taking place in the platform. As the ecosystem-based model has gained popularity and de facto status in the industry, also critical voices in ethical problems and questions for the new model has raised. This paper reviews recent literature (n=20) on ethical discussion on platforms and ecosystems in order to summarise the current development and suggest some future avenues. The review show that several disciplines, from law to technology ethics and sociology, are addressing the same phenomena from different view- points. However, furtherstudies are requested to support the building of a comprehensive view on com plex concerns.", "num_citations": "1\n", "authors": ["747"]}
{"title": "Software engineering studies attractiveness for the highly educated women planning to change career in Finland\n", "abstract": " The software industry is suffering from a widespread labour shortage and, at the same time, universities have not been able to react and provide enough skilled talents for the field. A wide selection of actions has been focused into getting more women for the STEM industries. However, the results have not been as efficient that would have hoped for. This study addresses the question how high-educated women perceive the attractiveness of software engineering studies. The data for the paper is collected with an open internet survey (n=134) from Finnish women who have already done or are planning to make a career change to the software industry. The attitudes towards new and old modes of learning and education are surveyed. This study shows that women perceive industry as attractive and value university education, yet there are overabundance of offering in entry-level training courses and lack of advanced …", "num_citations": "1\n", "authors": ["747"]}
{"title": "The Return of Evil Companies: Is it okay to profit with the poor at software platforms?\n", "abstract": " In the platform economy, a company (the orchestrator) opens its technological platform for others—ie organisations and individuals (complementors)—to work with and oﬀer their own products. This kind of an approach can be seen as a useful tool also in development aid. Here, a company, from a western industrialised country builds and oﬀers a technological plat form for complementors from developing countries to work with. On the one hand, the spill-over eﬀects from successful complementors would create economical well-being in their respective areas. On the other hand, this approach can be argued to be just modernised version of imperialism where rich western corporations are beneﬁting from cheap labour. In this article, we describe the aforementioned problem and present ethical discussion on the dilemma. Finally, this study calls for further work on understanding ethical issues of ecosystem and platform management.", "num_citations": "1\n", "authors": ["747"]}
{"title": "Individual people as champions in building an emerging software ecosystem\n", "abstract": " An increasing amount of software service providers tend to evolve their platforms into business ecosystems. In the mainstream of extant literature, the ecosystems have been seen as an interconnected system of organizations, mainly ignoring the individual level. However, some previous studies have suggested that collaboration—such as building a new ecosystem—may be depending on individual key persons who are development-oriented and capable of seeing the ecosystem’s value potential already in its early phases. Based on the results of a single-case study, this short paper proposes a new conversation on an unexplored area of key persons as enablers—‘champions’—for a new ecosystem creation. The empirical analysis was based on a single case study on a recently launched new software business ecosystem. As a result, four different capability areas and six, partly overlapping, roles for a …", "num_citations": "1\n", "authors": ["747"]}
{"title": "Top Management Support for Software Cost Estimation: A Case Study of the Current Practice and Impacts\n", "abstract": " Context: Despite decades of research in software cost estimation (SCE), the task remains difficult and software project overruns are common. Many researchers and practitioners agree that organisational issues and methodologies are equally important for successful SCE. Regardless of this recent development, SCE research is revolving heavily around methodologies. At the same time project management research has undergone a major shift towards managerial issues, and it found that top management support can be the most important success factor for projects.                 Goal: This study sheds light on top management’s role in SCE by identifying real-life practices for top management participation in SCE, as well as related organisational effects. Also, the impact of top management actions on project success is examined.                 Method: The study takes a qualitative and explorative case study …", "num_citations": "1\n", "authors": ["747"]}
{"title": "A Proxy-Based Solution for Asynchronous Telemedical Systems\n", "abstract": " Asynchronous telemedicine systems face many challenges related to information security as the patient's sensitive information and data on medicine dosage is transmitted over a network when monitoring patients and controlling asynchronous telemedical IoT devices. This information may be modified or spied on by a malicious adversary. To make asynchronous telemedicine systems more secure, the authors present a proxy-based solution against data modification and spying attacks in web-based telemedical applications. By obfuscating the executable code of a web application and by continuously dynamically changing obfuscation, the authors' solution makes it more difficult for a piece of malware to attack its target. They use a constructive research approach. They characterize the threat and present an outline of a proposed solution. The benefits and limitations of the proposed solution are discussed. Cyber …", "num_citations": "1\n", "authors": ["747"]}
{"title": "The Impact of a Delayed Software Project on Product Launch Coordination: A Case Study\n", "abstract": " An increasing number of today's products include software as their key component. This means that more and more product launches are depending on software projects, Which are infamous for delays. While the impacts of delays are well studied in the scope of a software project and the company itself, the impacts on the management of launch activities are not very well understood. This study addresses the gap by an in-depth case study of one delayed software project. The results show that the delays may increase the cost of a product launch, as well as decrease the scope and quality of the launch activities. These impacts are influenced by key personnel's motivational factors, which in turn cause lost working time and postponing the work until it is too late to act as planned.", "num_citations": "1\n", "authors": ["747"]}
{"title": "Mobiilipelien menestystekijät\n", "abstract": " Currently, there are hundreds of thousands mobile games for smart devices. However, only a small number of these are successful in economic sense and there have been claims that the most installed games are only copying the same principles. In this study, we examine Google Play’s 61 most installed and 20 randomly selected games. The games are studied through the perspectives of external characteristics, control methods, ludology and narrative elements. The study shows the most popular games use a wide range of different elements. However, we note the lack of a proper plot in the majority of the games. Thus we encourage game developers to think through the position of the plot in mobile games.", "num_citations": "1\n", "authors": ["747"]}
{"title": "The Potential Development Impact of Mobile Application Vendors in Developing Countries\n", "abstract": " This study focuses on the state of application development in developing countries. The first objective is to estimate the existence of application vendors locating in developing countries. The second objective is to identify some reasons for developing country software vendors to enter mobile application markets rather than more traditional software markets. We argue that app stores offer a possibility for developing countries to pass some of the problems that come with industrialisation by partly post-industrialising directly. This study is divided to two phases which study the existence of application vendors in developing countries and their characteristics from different viewpoints. The first phase focuses on the analysis of the most popular applications in Google Play, Apple Store and Windows Phone Store. The second phase starts by analysing the email addresses of application vendors who sell their products in …", "num_citations": "1\n", "authors": ["747"]}
{"title": "The Theoretical Connections Between Agile Software Development and Innovative Climate\n", "abstract": " Agile software development methods are claimed to fully expose the innovation capabilities of a software development team. In the current business world, where the new innovations are seen as keys for survival and growth of the firm, these development methods have been welcomed and widely adapted. There, however, is a lack of understanding how these methods drive innovation. Therefore, in this study we analyse agile principles and practices against established innovation climate dimensions. The mapping used in analysis is done by the authors and provides a starting point for further scientific discussion. The results show that there is a clear link between practices and several classical innovation climate dimensions. However, a few dimensions are only covered by the agile principles. The study concludes by proposing new avenues for further work in agile software development research.", "num_citations": "1\n", "authors": ["747"]}
{"title": "Exploring the Stability of Software with Time-Series Cross-Sectional Data\n", "abstract": " The stability of software is a classical topic in software engineering. This research investigates stability of software architectures in terms of an object-oriented design principle presented by Robert C. Martin. The research approach is statistical: the design principle is evaluated with a time-series cross-sectional (TSCS) regression model. The empirical sample covers a release history from the Java library Vaadin. The empirical results establish that the design principle cannot be used to characterize the library. Besides delivering this negative empirical result, the research provides the necessary methodological background that is required to understand TSCS modeling.", "num_citations": "1\n", "authors": ["747"]}
{"title": "Agile Methodologies as Process Innovation Drivers\n", "abstract": " Software development organizations use agile software development in order to eg increase transparency, reduce waste, and better meet customer expectations. Agile has also been seen as an enabler for relentless product innovation which is critical for growing amount of modern businesses.Innovations and innovation management have been researched using diverse contexts, models and viewpoints. Due to this there are many innovation related studies also in the agile software development context. However, there seems to be little, if any, research on how the agile teams and the related stakeholders innovate. We are especially interested in what kind of process innovations are developed while using agile methodologies and how do these happen. This Academic Research Development Submission describes the planned research that aims to uncover the connection between agile software development and process innovations, as well as bring forward the concrete means to increase the chance of process innovations.", "num_citations": "1\n", "authors": ["747"]}
{"title": "Differentation within Mobile Ecosystems — The Unspecialized Marketplaces\n", "abstract": " Nowadays, the ‘war of ecosystems’ between alliances of giant mobile operating system vendors and mobile phone manufacturers is a popular topic in the news. In the public discussion, the application ecosystem emerged inside the mobile ecosystem is argued to be a key in the differentiation. This has striven the ecosystem orchestrators for recruiting an increasing number of software developers and applications to join in their ecosystem. In this paper, we study how different mobile ecosystems differentiate both in application offering and in the mobile phone users. We use the information gathered from over 800 000 applications and the questionnaire answered by approximately 2 000 university students to study the research questions. The results show that the ecosystems are rather similar in their offering although it is possible to make distinction between the users of different ecosystems.", "num_citations": "1\n", "authors": ["747"]}
{"title": "Puheentunnistusteknologian nykytilanne ja mahdollisuudet elektronisissa peleissä\n", "abstract": " Puheentunnistusteknologian nykytilanne ja mahdollisuudet elektronisissa peleissä — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Puheentunnistusteknologian nykytilanne ja mahdollisuudet elektronisissa peleissä Aki Halonen, Sami Hyrynsalmi, Jouni Smed Research output: Chapter in Book/Report/Conference proceeding › Chapter › Scientific › peer-review Overview Original language Finnish Title of host publication Pelitutkimuksen vuosikirja 2012 Publisher University of Tampere Pages 92-98 Number of pages 7 Publication status Published - 2012 Externally published Yes Publication type A3 Part of a book or another research book Cite this APA Author …", "num_citations": "1\n", "authors": ["747"]}