{"title": "Software product management\n", "abstract": " Software organizations evolve and maintain software solutions with more than a single development project. The delta specifications and artifacts that result from each project make reuse difficult and challenge a company’s ability to innovate. Software product management is a growing discipline for understanding how to productize and align software with company strategy, how to evolve software, and how to coordinate product stakeholders. With product focus, in addition to project focus, planning accuracy can be improved, time-to-market reduced, product quality enhanced, and economic success sustained. This chapter provides an overview on software product management and discusses what today is known about this discipline.", "num_citations": "62\n", "authors": ["1537"]}
{"title": "The impacts of agile and lean practices on project constraints: A tertiary study\n", "abstract": " The growing interest in Agile and Lean software development is reflected in the increasing number of secondary studies on the benefits and limitations of Agile and Lean processes and practices. The aim of this tertiary study is to consolidate empirical evidence regarding Agile and Lean practices and their respective impacts on project constraints as defined in the Project Management Body of Knowledge (PMBOK): scope, quality, schedule, budget, resources, communication, and risk. In this tertiary study, 13 secondary studies were included for detailed analysis. Given the heterogeneity of the data, we were unable to perform a rigorous synthesis. Instead, we mapped the identified Agile and Lean practices, and their impacts on the project constraints described in PMBOK. From 13 secondary studies, we identified 13 Agile and Lean practices. Test-Driven Development (TDD) is studied in ten secondary studies …", "num_citations": "58\n", "authors": ["1537"]}
{"title": "Requirements value chains: Stakeholder management and requirements engineering in software ecosystems\n", "abstract": " [Context & motivation] Market-oriented development involves the collaboration of many stakeholders that do not necessarily directly interact with a given development project but still influence its results. These stakeholders are part of the requirements value chain for the concerned software product. [Question/problem] Understanding the structure and functioning of requirements value chains is essential for effective stakeholder management and requirements engineering within the software product’s ecosystem. [Principal ideas/results] The paper explores and exemplifies fundamental concepts that are needed to characterize and reason about requirements value chains. [Contribution] This characterization is used to describe the relevant knowledge landscape and to suggest research avenues for understanding the principles needed for managing requirements-based stakeholder collaboration.", "num_citations": "56\n", "authors": ["1537"]}
{"title": "Requirements engineering: best practice\n", "abstract": " Many software solutions have failed because they did not meet stakeholder needs. In response to this problem a massive amount of techniques were developed to elicit stakeholder needs, to analyze the implications of these needs on the software, to specify proposed software products, and to check acceptance of these proposals. However, many of these techniques did not become industrial practice because they were not practicable or ineffective when used in real-world projects. To obtain an overview of what common practice is and to understand which techniques reflect best practice because they are particularly effective, we have surveyed a large number of industry projects. Based on 419 valid answers, this chapter gives an overview of commonly used requirements engineering techniques. It also shows which of the techniques, when used in a software project, correlate with requirements engineering …", "num_citations": "49\n", "authors": ["1537"]}
{"title": "Kpis for software ecosystems: A systematic mapping study\n", "abstract": " To create value with a software ecosystem (SECO), a platform owner has to ensure that the SECO is healthy and sustainable. Key Performance Indicators (KPI) are used to assess whether and how well such objectives are met and what the platform owner can do to improve. This paper gives an overview of existing research on KPI-based SECO assessment using a systematic mapping of research publications. The study identified 34 relevant publications for which KPI research and KPI practice were extracted and mapped. It describes the strengths and gaps of the research published so far, and describes what KPI are measured, analyzed, and used for decision-making from the researcher’s point of view. For the researcher, the maps thus capture state-of-knowledge and can be used to plan further research. For practitioners, the generated map points to studies that describe how to use KPI for managing of a …", "num_citations": "46\n", "authors": ["1537"]}
{"title": "Software product management\n", "abstract": " The authors are very grateful to all our contributors without whom we would not have been able to write a book as comprehensive as this. Here is some information on authors and contributors:", "num_citations": "45\n", "authors": ["1537"]}
{"title": "Requirements engineering for digital health\n", "abstract": " © Springer International Publishing Switzerland 2015", "num_citations": "42\n", "authors": ["1537"]}
{"title": "Specification and analysis of requirements negotiation strategy in software ecosystems\n", "abstract": " The development of software products and systems generally requires collaboration of many individuals, groups, and organizations that form an ecosystem of interdependent stakeholders. The way the interests and expectations of such stakeholders are communicated is critical for whether they are heard, hence whether the stakeholders are successful in influencing future solutions to meet their needs. This paper proposes a model based on negotiation and network theory for analyzing and designing flow of requirements through a software ecosystem. The approach supports requirements engineering process engineers and managers in taking strategic decisions for resolving communication bottlenecks, increasing overall requirements engineering productivity, and consciously assigning power to stakeholders.", "num_citations": "34\n", "authors": ["1537"]}
{"title": "Pricing of data products in data marketplaces\n", "abstract": " Mobile computing and the Internet of Things promises massive amounts of data for big data analytic and machine learning. A data sharing economy is needed to make that data available for companies that wish to develop smart systems and services. While digital markets for trading data are emerging, there is no consolidated understanding of how to price data products and thus offer data vendors incentives for sharing data. This paper uses a combined keyword search and snowballing approach to systematically review the literature on the pricing of data products that are to be offered on marketplaces. The results give insights into the maturity and character of data pricing. They enable practitioners to select a pricing approach suitable for their situation and researchers to extend and mature data pricing as a topic.", "num_citations": "30\n", "authors": ["1537"]}
{"title": "BONSEYES: platform for open development of systems of artificial intelligence\n", "abstract": " The Bonseyes EU H2020 collaborative project aims to develop a platform consisting of a Data Marketplace, a Deep Learning Toolbox, and Developer Reference Platforms for organizations wanting to adopt Artificial Intelligence. The project will be focused on using artificial intelligence in low power Internet of Things (IoT) devices (\" edge computing\"), embedded computing systems, and data center servers (\" cloud computing\"). It will bring about orders of magnitude improvements in efficiency, performance, reliability, security, and productivity in the design and programming of systems of artificial intelligence that incorporate Smart Cyber-Physical Systems (CPS). In addition, it will solve a causality problem for organizations who lack access to Data and Models. Its open software architecture will facilitate adoption of the whole concept on a wider scale. To evaluate the effectiveness, technical feasibility, and to quantify the …", "num_citations": "30\n", "authors": ["1537"]}
{"title": "Release planning with feature trees: Industrial case\n", "abstract": " [Context and motivation] Requirements catalogues for software release planning are often not complete and homogeneous. Current release planning approaches, however, assume such commitment to detail – at least implicitly. [Question/problem] We evaluate how to relax these expectations, while at the same time reducing release planning effort and increasing decision-making flexibility. [Principal ideas/results] Feature trees capture AND, OR, and REQUIRES relationships between requirements. Such requirements structuring can be used to hide incompleteness and to support abstraction. [Contribution] The paper describes how to utilize feature trees for planning the releases of an evolving software solution and evaluates the effects of the approach on effort, decision-making, and trust with an industrial case.", "num_citations": "29\n", "authors": ["1537"]}
{"title": "Quality requirements elicitation based on inquiry of quality-impact relationships\n", "abstract": " Quality requirements, an important class of non-functional requirements, are inherently difficult to elicit. Particularly challenging is the definition of good-enough quality. The problem cannot be avoided though, because hitting the right quality level is critical. Too little quality leads to churn for the software product. Excessive quality generates unnecessary cost and drains the resources of the operating platform. To address this problem, we propose to elicit the specific relationships between software quality levels and their impacts for given quality attributes and stakeholders. An understanding of each such relationship can then be used to specify the right level of quality by deciding about acceptable impacts. The quality-impact relationships can be used to design and dimension a software system appropriately and, in a second step, to develop service level agreements that allow re-use of the obtained knowledge of …", "num_citations": "24\n", "authors": ["1537"]}
{"title": "Workshop videos for requirements communication\n", "abstract": " Shared understanding of requirements between stakeholders and the development team is a critical success factor for requirements engineering. Workshops are an effective means for achieving such shared understanding. Stakeholders and team representatives can meet and discuss what a planned software system should be and how it should support achieving stakeholder goals. However, some important intended recipients of the requirements are often not present in such workshops: the developers. Thus, they cannot benefit from the in-depth understanding of the requirements and of the rationales for these requirements that develops during the workshops. The simple handover of a requirements specification hardly compensates the rich requirements understanding that is needed for the development of an acceptable system. To compensate the lack of presence in a requirements workshop, we …", "num_citations": "21\n", "authors": ["1537"]}
{"title": "Norms and standards in modular medical architectures\n", "abstract": " Recent Internet of Things (IoT) research has been aiming at interoperability of devices and the integration of sensor networks. The Future Internet - Private Public Partnership (FI-PPP) has created a whole array of different purpose-oriented modules with defined specifications, better known as Generic Enablers. This article gives an overview of legal, ethical and technical norms and standards to be considered when planning, developing and implementing modular medical architectures, integrating the Internet of Things (IoT) and Generic Enablers (GEs) in cutting edge, latest generation medical data networks.", "num_citations": "17\n", "authors": ["1537"]}
{"title": "Representing software project vision by means of video: A quality model for vision videos\n", "abstract": " Establishing a shared software project vision is a key challenge in Requirements Engineering (RE). Several approaches use videos to represent visions. However, these approaches omit how to produce a good video. This missing guidance is one crucial reason why videos are not established in RE. We propose a quality model for videos representing a vision, so-called vision videos. Based on two literature reviews, we elaborate ten quality characteristics of videos and five quality characteristics of visions which together form a quality model for vision videos that includes all 15 quality characteristics. We provide two representations of the quality model: (a) a hierarchical decomposition of vision video quality into the quality characteristics and (b) a mapping of these characteristics to the video production and use process. While the hierarchical decomposition supports the evaluation of vision videos, the mapping …", "num_citations": "16\n", "authors": ["1537"]}
{"title": "Combining monitoring and autonomous feedback requests to elicit actionable knowledge of system use\n", "abstract": " [Context and motivation] To validate developers’ ideas of what users might want and to understand user needs, it has been proposed to collect and combine system monitoring with user feedback. [Question/problem] So far, the monitoring data and feedback have been collected passively, hoping for the users to get active when problems emerge. This approach leaves unexplored opportunities for system improvement when users are also passive or do not know that they are invited to offer feedback. [Principal ideas/results] In this paper, we show how we have used goal monitors to identify interesting situations of system use and let a system autonomously elicit user feedback in these situations. We have used a monitor to detect interesting situations in the use of a system and issued automated requests for user feedback to interpret the monitoring observations from the users’ perspectives. [Contribution] The …", "num_citations": "15\n", "authors": ["1537"]}
{"title": "Online social networks as a catalyst for software and IT innovation\n", "abstract": " People have many creative ideas, but only a few of these ideas are realized and lead to innovation. Good ideas often fail because they are not shared between innovators and stakeholders, hence are unlikely to be realized. Consequently, many opportunities are missed to excite customers and to gain a competitive advantage. This paper proposes an innovation process that uses online social networks to lower the hurdle to sharing ideas. The process leverages diffusion effects of social networks while supporting the generation, evaluation, consolidation, and implementation of innovative ideas with lightweight activities. The process is illustrated and discussed using an application example. Although we are focusing on innovation regarding software-intensive systems, we foresee that the discussed process has the potential to be applied to other domains as well.", "num_citations": "15\n", "authors": ["1537"]}
{"title": "Feature unweaving: Refactoring software requirements specifications into software product lines\n", "abstract": " The design of the variability of a software product line is crucial to its success and evolution. Meaningful variable features need to be elicited, analyzed, documented and validated when an existing software or reference system evolves into a software product line. These variable features are the main discriminators between individual products and they need to reflect the needs of a large variety of stakeholders adequately. In this paper we present a novel approach, called feature unweaving, that supports the identification and extraction of variable features from a given graphical software requirements model. We have extended our aspect-oriented software product line modeling tool such that it supports feature unweaving: it takes a set of model elements that a domain requirements engineer considers to constitute a variable feature and automatically refactors the model into a semantically equivalent one in which …", "num_citations": "13\n", "authors": ["1537"]}
{"title": "The effect of requests for user feedback on Quality of Experience\n", "abstract": " Companies are interested in knowing how users experience and perceive their products. Quality of Experience (QoE) is a measurement that is used to assess the degree of delight or annoyance in experiencing a software product. To assess QoE, we have used a feedback tool integrated into a software product to ask users about their QoE ratings and to obtain information about their rationales for good or bad QoEs. It is known that requests for feedback may disturb users; however, little is known about the subjective reasoning behind this disturbance or about whether this disturbance negatively affects the QoE of the software product for which the feedback is sought. In this paper, we present a mixed qualitative-quantitative study with 35 subjects that explore the relationship between feedback requests and QoE. The subjects experienced a requirement-modeling mobile product, which was integrated with a …", "num_citations": "12\n", "authors": ["1537"]}
{"title": "Relating product line context to requirements engineering processes using design rationale\n", "abstract": " The design of engineering processes is dependent on the context they are designed for. This paper presents the results of an action research study that used design rationale to discover a number of contextual factors that provide criteria for designing a requirements engineering process in a given product line environment. The presented context dimensions and process design argumentation provide a starting point for understanding product line context and how supporting engineering processes are designed, communicated, and evaluated.", "num_citations": "12\n", "authors": ["1537"]}
{"title": "Evaluating health information systems using ontologies\n", "abstract": " Background: There are several frameworks that attempt to address the challenges of evaluation of health information systems by offering models, methods, and guidelines about what to evaluate, how to evaluate, and how to report the evaluation results. Model-based evaluation frameworks usually suggest universally applicable evaluation aspects but do not consider case-specific aspects. On the other hand, evaluation frameworks that are case specific, by eliciting user requirements, limit their output to the evaluation aspects suggested by the users in the early phases of system development. In addition, these case-specific approaches extract different sets of evaluation aspects from each case, making it challenging to collectively compare, unify, or aggregate the evaluation of a set of heterogeneous health information systems.Objectives: The aim of this paper is to find a method capable of suggesting evaluation aspects for a set of one or more health information systems—whether similar or heterogeneous—by organizing, unifying, and aggregating the quality attributes extracted from those systems and from an external evaluation framework.Methods: On the basis of the available literature in semantic networks and ontologies, a method (called Unified eValuation using Ontology; UVON) was developed that can organize, unify, and aggregate the quality attributes of several health information systems into a tree-style ontology structure. The method was extended to integrate its generated ontology with the evaluation aspects suggested by model-based evaluation frameworks. An approach was developed to extract evaluation aspects from the …", "num_citations": "10\n", "authors": ["1537"]}
{"title": "Pragmatic requirements communication: the handshaking approach\n", "abstract": " Pragmatic Requirements Communication: The Handshaking Approach Page 1 Pragmatic Requirements Communication: The Handshaking Approach June 4, 2010 Dr. Inform. Samuel Fricker (http://www.ifi.uzh.ch/rerg/people/fricker/, fricker@ifi.uzh.ch) Page 2 Simplified and Stylized Structure of Product Development Company Steering Committee Development Team Market Segment Market Segment Developer Developer Developer Customer Customer Line Manager R&D Manager M&S Manager Supplier Project Leader and Architect Supplier Product Manager Customer Customer S. Fricker, P. Grünbacher (2008). \"Negotiation Constellations - Method Selection Framework for Requirements Negotiation”, RefsQ’08. Page 3 Simplified and Stylized Structure of Product Development Company Steering Committee Development Team Market Segment Market Segment Developer Developer Developer Customer …", "num_citations": "9\n", "authors": ["1537"]}
{"title": "Elicitation of SME requirements for cybersecurity solutions by studying adherence to recommendations\n", "abstract": " Small and medium-sized enterprises (SME) have become the weak spot of our economy for cyber attacks. These companies are large in number and often do not have the controls in place to prevent successful attacks, respectively are not prepared to systematically manage their cybersecurity capabilities. One of the reasons for why many SME do not adopt cybersecurity is that developers of cybersecurity solutions understand little the SME context and the requirements for successful use of these solutions. We elicit requirements by studying how cybersecurity experts provide advice to SME. The experts recommendations offer insights into what important capabilities of the solution are and how these capabilities ought to be used for mitigating cybersecurity threats. The adoption of a recommendation hints at a correct match of the solution, hence successful consideration of requirements. Abandoned recommendations point to a misalignment that can be used as a source to inquire missed requirements. Re-occurrence of adoption or abandonment decisions corroborate the presence of requirements. This poster describes the challenges of SME regarding cybersecurity and introduces our proposed approach to elicit requirements for cybersecurity solutions. The poster describes CYSEC, our tool used to capture cybersecurity advice and help to scale cybersecurity requirements elicitation to a large number of participating SME. We conclude by outlining the planned research to develop and validate CYSEC.", "num_citations": "8\n", "authors": ["1537"]}
{"title": "QoE probe: A Requirement-monitoring Tool.\n", "abstract": " Runtime requirement monitoring is used for verification and validation of implemented requirements. To monitor the requirements in runtime; we propose a “QoE probe” tool, a mobile application integrated through an API, to collect usage logs as well as users’ Quality of Experience (QoE) in the form of user feedback. The analysis of the collected data guides requirement monitoring of functional and non-functional requirements as well as capturing new requirements.", "num_citations": "7\n", "authors": ["1537"]}
{"title": "Analytics for Product Planning: In-Depth Interview Study with SaaS Product Managers\n", "abstract": " SaaS cloud computing, in contrast to packaged products, enables permanent contact between users of a software product and the product-owning company. When planning the development and evolution of a software product, a product manager depends on reliable information about feature attractiveness. So far, planning decisions were based on stakeholder opinion and the customer's willingness to buy. Whether or not a feature actually is used was out of consideration. Analytics that measure the interaction between users and the SaaS gives product managers unprecedented access to information about product usage. To understand whether and how SaaS analytics can be used for product planning decision, we performed 17 in-depth interviews with experienced managers of SaaS products and analyzed the results analyzed with a mixed-method strategy. The empirical results characterize the relevance of a …", "num_citations": "7\n", "authors": ["1537"]}
{"title": "Towards integrating data-driven requirements engineering into the software development process: a vision paper\n", "abstract": " [Context and motivation] Modern software engineering processes have shifted from traditional upfront requirements engineering (RE) to a more continuous way of conducting RE, particularly including data-driven approaches. [Question/problem] However, current research on data-driven RE focuses more on leveraging certain techniques such as natural language processing or machine learning than on making the concept fit for facilitating its use in the entire software development process. [Principal ideas/results] In this paper, we propose a research agenda composed of six distinct research directions. These include a data-driven RE infrastructure, embracing data heterogeneity, context-aware adaptation, data analysis and decision support, privacy and confidentiality, and finally process integration. Each of these directions addresses challenges that impede the broader use of data-driven RE. [Contribution] For …", "num_citations": "6\n", "authors": ["1537"]}
{"title": "Software analytics for planning product evolution\n", "abstract": " Evolution of a software product is inevitable as product context changes and the product gradually becomes less useful if it is not adapted. Planning is a basis to evolve a software product. The product manager, who carries responsibilities of planning, requires but does not always have access to high-quality information for making the best possible planning decisions. The current study aims to understand whether and when analytics are valuable for product planning and how they can be interpreted to a software product plan. The study was designed with an interview-based survey methodology approach through 17 in-depth semi-structured interviews with product managers. Based on results from qualitative analysis of the interviews, we defined an analytics-based model. The model shows that analytics have potentials to support the interpretation of product goals while is constrained by both product …", "num_citations": "6\n", "authors": ["1537"]}
{"title": "Literature review of flexibility attributes: A flexibility framework for software developing organization\n", "abstract": " Software developing organizations strive to achieve flexibility to maintain a competitive advantage. There is no common understanding of what characterize flexibility for a software organization beyond the scope of the software product. Without a common understanding, it is difficult to evaluate the degrees of flexibility of software development approaches. The aim of this literature review is to collect attributes that characterize flexibility. The collected attributes are consolidated into a flexibility framework with 3 main attributes: properties of change, flexibility perspectives, and flexibility enablers. The resulting flexibility framework is then used to evaluate Agile and Lean practices. The evaluation shows that Agile and Lean practices address many flexibility attributes. However, some attributes are not addressed, such as infrastructure flexibility and strategic flexibility. On the basis of our evaluation, the classifications of …", "num_citations": "5\n", "authors": ["1537"]}
{"title": "Variability-based release planning\n", "abstract": " A release plan defines the short-term evolution of a software product in terms of development project scope. In practice, release planning is often based on just fragmentarily defined requirements. Current release planning approaches, however, assume that a requirements catalogue is available in the form of a complete flat list of requirements. This very early commitment to detail reduces the flexibility of a product manager when planning product development. This paper explores how variability modeling, a software product line technique, can be used to plan, communicate, and track the evolution of a single software. Variability modeling can reduce the number of decisions required for release planning and reduce the information needed for communicating with stakeholders. An industrial case motivates and exemplifies the approach.", "num_citations": "5\n", "authors": ["1537"]}
{"title": "Automating the Communication of Cybersecurity Knowledge: Multi-case Study\n", "abstract": " Cybersecurity is essential for the protection of companies against cyber threats. Traditionally, cybersecurity experts assess and improve a company’s capabilities. However, many small and medium-sized businesses (SMBs) consider such services not to be affordable. We explore an alternative do-it-yourself (DIY) approach to bringing cybersecurity to SMBs. Our method and tool, CYSEC, implements the Self-Determination Theory (SDT) to guide and motivate SMBs to adopt good cybersecurity practices. CYSEC uses assessment questions and recommendations to communicate cybersecurity knowledge to the end-user SMBs and encourage self-motivated change. In this paper, the operationalisation of SDT in CYSEC is presented and the results of a multi-case study shown that offer insight into how SMBs adopted cybersecurity practices with CYSEC. Effective automated cybersecurity communication depended on …", "num_citations": "4\n", "authors": ["1537"]}
{"title": "A methodology to assess social technological alignment in the health domain\n", "abstract": " There have been longstanding discussions whether social or technological factors eventually determine the speed of innovation, in particular when it comes to implementation. In order to identify and quantify potential resistance and implementation risks in the health domain we propose a set of key parameters, which are measurable in both – the social and the technological dimensions. Following a meta-analysis we identified the following parameters to be of relevance: readiness, shared values, motivation, elasticity, control and time. All these parameters are scalable and measurable in both dimensions with existing tools. Mapping and comparison of the social and technological dimensions of these parameters might allow conclusions on how far the social and technological dimensions of these parameters are aligned and where potential difficulties during the implementation have to be expected. (This paper …", "num_citations": "4\n", "authors": ["1537"]}
{"title": "Requirements Engineering: Foundation for Software Quality: 21st International Working Conference, REFSQ 2015, Essen, Germany, March 23-26, 2015. Proceedings\n", "abstract": " This book constitutes the refereed proceedings of the 20th International Working Conference on Requirements Engineering: Foundation for Software Quality, REFSQ 2014, held in Essen, Germany, in April 2013. The 23 papers presented together with 1 keynote were carefully reviewed and selected from 62 submissions. The REFSQ'15 conference is organized as a three-day symposium. The REFSQ'15 has chosen a special conference theme “I heard it first at RefsQ”. Two conference days were devoted to presentation and discussion of scientific papers. The two days connect to the conference theme with a keynote, an invited talk and poster presentations. There were two parallel tracks on the third day: the Industry Track and the new Research Methodology Track. REFSQ 2015 seeks reports of novel ideas and techniques that enhance the quality of RE’s products and processes, as well as reflections on current research and industrial RE practices.", "num_citations": "4\n", "authors": ["1537"]}
{"title": "An analysis of change scenarios of an IT organization for flexibility building\n", "abstract": " Flexibility is important for software organizations to cope with changes demanded in the business environment. So far, flexibility has been extensively studied from a software product and software development process point of view. However, there is little work on how to build flexibility at the level of the whole software organization. Thus, there is no clear understanding of how to effectively improve the ability of an organization to respond to changes in a timely fashion and with little effort. This paper presents the results of a grounded theory study on how flexibility is built and improved in an IT organization and provides a holistic and explanatory view of how this is achieved. Implications for research and practices are also provided.", "num_citations": "4\n", "authors": ["1537"]}
{"title": "A social-technological alignment matrix\n", "abstract": " This paper refers to the term “implementation” as the process of integrating a new technology into established workfows. Especially in health care this has proven to be a very critical phase and many large-scale projects have failed on this very last mile. Although strategies such as requirements engineering, co-designing and user interaction design have been proposed to reduce the risk of end-user rejection and subsequently project failur. There is still no tool to analyze, predict and quantify user acceptance and identify critical areas which might be addressed before the start of the implementation phase in order to reduce resistance and increase the effectiveness and effciency.", "num_citations": "4\n", "authors": ["1537"]}
{"title": "IoTRec: The IoT Recommender for Smart Parking System\n", "abstract": " This paper proposes a General Data Protection Regulation (GDPR)-compliant Internet of Things (IoT) Recommender (IoTRec) system, developed in the framework of H2020 EU-KR WISE-IoT (Worldwide Interoperability for Semantic IoT) project, which provides the recommendations of parking spots and routes while protecting users' privacy. It provides recommendations by exploiting the IoT technology (parking and traffic sensors). The IoTRec provides four-fold functions. Firstly, it helps the user to find a free parking spot based on different metrics (such as the nearest or nearest trusted parking spot). Secondly, it recommends a route (the least crowded or the shortest route) leading to the recommended parking spot from the user's current location. Thirdly, it provides the real-time provision of expected availability of parking areas (comprised of parking spots organized into groups) in a user-friendly manner. Finally, it …", "num_citations": "3\n", "authors": ["1537"]}
{"title": "Tailoring the software product management framework for use in a healthcare organization: Case study\n", "abstract": " Many reference models were developed for software process improvement. Each model, however, is an idealized prescription that is applicable in a limited set of situation only. This paper has investigated how an existing reference model can be tailored to a domain it has not been designed for initially. The tailoring approach is based on translating the reference model to the new domain and on inductive interviews for evaluating the translated model. The approach has been applied for assessing and improving strategic requirements engineering practice in a healthcare organization with a framework for software product management.", "num_citations": "3\n", "authors": ["1537"]}
{"title": "Explaining stakeholder negotiation using social goal networks\n", "abstract": " Strong stakeholder networks are important for the success of engineering efforts. Such networks reflect the results of negotiation activities among stakeholders in terms of needs, capabilities, backing and knowledge. The larger and more distributed an engineering organization is, the more important it is to understand how such stakeholder networks are built and evolve. Social Goal Networks (SGNs) have been developed to answer an industrial need to understand stakeholder orchestration in a product management context.", "num_citations": "3\n", "authors": ["1537"]}
{"title": "SMEs’ Confidentiality Concerns for Security Information Sharing\n", "abstract": " Small and medium-sized enterprises (SME) are considered an essential part of the EU economy; however, highly vulnerable to cyber-attacks. SMEs have specific characteristics which separate them from large companies and influence their adoption of good cybersecurity practices. To mitigate the SMEs’ cybersecurity adoption issues and raise their awareness of cyber threats, we have designed a self-paced security assessment and capability improvement method, CYSEC. CYSEC is a security awareness and training method that utilises self-reporting questionnaires to collect companies’ information about cybersecurity awareness, practices, and vulnerabilities to generate automated recommendations for counselling. However, confidentiality concerns about cybersecurity information have an impact on companies’ willingness to share their information. Security information sharing decreases the risk of …", "num_citations": "2\n", "authors": ["1537"]}
{"title": "Artifact Compatibility for Enabling Collaboration in the Artificial Intelligence Ecosystem\n", "abstract": " Different types of software components and data have to be combined to solve an artificial intelligence challenge. An emerging marketplace for these components will allow for their exchange and distribution. To facilitate and boost the collaboration on the marketplace a solution for finding compatible artifacts is needed. We propose a concept to define compatibility on such a marketplace and suggest appropriate scenarios on how users can interact with it to support the different types of required compatibility. We also propose an initial architecture that derives from and implements the compatibility principles and makes the scenarios feasible. We matured our concept in focus group workshops and interviews with potential marketplace users from industry and academia. The results demonstrate the applicability of the concept in a real-world scenario.", "num_citations": "2\n", "authors": ["1537"]}
{"title": "Requirements engineering as innovation journalism: a research preview\n", "abstract": " The successful launch of an innovation project depends on an attractive vision and how well the vision is supported by the complementary capabilities of the consortium partners that want to cooperate to realize the vision. Alas, for an innovator the search for the right partners and visions can be lengthy and difficult. Even though the analysis of context and problem, the identification of stakeholders, the analysis of stakeholder goals and techno-logical capabilities, and the definition of requirements belong to the cornerstones of requirements engineering, this requirements engineering problem has hardly been explored so far. In an attempt to avoid re-invention of well-tried solutions, we discovered journalism as a discipline that, as a rich body of methodical knowledge, may act as a source for the guidance of how a requirements engineer may support the launch of innovation projects. In the role of a journalist, the …", "num_citations": "2\n", "authors": ["1537"]}
{"title": "Towards understanding how to build strategic flexibility of an IT organization\n", "abstract": " IT organizations need to react to changes in the business, the domain (eg, regulatory issues), and the technological development. While some of these changes can be handled by adopting agile practices, others might have large, irreversible effects on the organization as a whole. While flexibility and agility have found their way into software project methodologies, IT organizations struggle with their adaptation at organizational level. This paper presents preliminary results of a grounded-theory study aimed at understanding how experienced managers handle flexibility. The results are a rich empirical source for improving flexibility of an IT organization at the strategic level and also a good starting point for further research towards generalizing agile ideas beyond software projects.", "num_citations": "2\n", "authors": ["1537"]}
{"title": "Privacy and Identity Management. Data for Better Living: AI and Privacy: 14th IFIP WG 9.2, 9.6/11.7, 11.6/SIG 9.2. 2 International Summer School, Windisch, Switzerland, August …\n", "abstract": " This book contains selected papers presented at the 14th IFIP WG 9.2, 9.6/11.7, 11.6/SIG 9.2. 2 International Summer School on Privacy and Identity Management, held in Windisch, Switzerland, in August 2019. The 22 full papers included in this volume were carefully reviewed and selected from 31 submissions. Also included are reviewed papers summarizing the results of workshops and tutorials that were held at the Summer School as well as papers contributed by several of the invited speakers. The papers combine interdisciplinary approaches to bring together a host of perspectives, which are reflected in the topical sections: language and privacy; law, ethics and AI; biometrics and privacy; tools supporting data protection compliance; privacy classification and security assessment; privacy enhancing technologies in specific contexts. The chapters\" What Does Your Gaze Reveal About You? On the Privacy Implications of Eye Tracking\" and\" Privacy Implications of Voice and Speech Analysis-Information Disclosure by Inference\" are open access under a CC BY 4.0 license at link. springer. com.", "num_citations": "1\n", "authors": ["1537"]}
{"title": "Framework for Analysis of Multi-Party Collaboration\n", "abstract": " In recent years, platforms have become important for allowing ecosystems to emerge that allow users to collaborate and create unprecedented forms of innovation. For the platform provider, the ecosystem represents a massive business opportunity if the platform succeeds to make the collaborations among the users value-creating and to facilitate trust. While the requirements flow for evolving existing ecosystems is understood, it is unclear how to analyse an ecosystem that is to be. In this paper, we draw on recent work on collaboration modelling in requirements engineering and propose an integrated framework for the analysis of multi-party collaboration that is to be supported by a platform. Drawing on a real-world case, we describe how the framework is applied and the results that have been obtained with it. The results indicate that the framework was useful to understand the ecosystem context for a planned …", "num_citations": "1\n", "authors": ["1537"]}
{"title": "Management of Software as a Business\n", "abstract": " Product management has become an established discipline in many industries since Procter and Gamble introduced it in 1931. During the last decades, most software product companies—such as Microsoft, IBM, and Google—have implemented Software Product Management (SPM). So did a few corporate information technology organizations in essentially all industries, as well as some companies that produce software embedded in software-intensive products and services. The role of software product manager has emerged during this time as being of strategic value since it is crucial to the economic success of a product.", "num_citations": "1\n", "authors": ["1537"]}
{"title": "Systematic mapping of technology-enabled product innovations\n", "abstract": " Many new products, or services offered as a product, are expected to solve customer problems in new ways or exploit available technology in new or better ways. To innovate, a company needs to have a reliable understanding of the state-of-the-art. That need concerns both, an understanding of the problems that may be addressed and the solutions that have been explored and tried so far. This paper proposes systematic mappings as a method for reviewing the state-of-the-art in a technological or application domain. The method complements bespoke and experience-based approaches by guiding the identification of repositories with information about innovation projects and the analysis and interpretation of the data provided by these repositories. The paper describes the method, demonstrates its application with an example initiated by real-world innovation need, and discusses the potential benefits and …", "num_citations": "1\n", "authors": ["1537"]}
{"title": "1st international requirements engineering efficiency workshop: REEW 2011\n", "abstract": " Requirements engineering research has for a long time focused on specification quality, leading to recommendations of how to engineer \"perfect\" requirements specifications. Practitioners, however, do not have the time, resources, and interests for overdoing requirements engineering. Rather, many situations call for shortcuts that allow investing effort in those concerns that are critical for success, while reducing effort in other areas where risk is comparably smaller. The social context, smart collaboration processes, and novel ways of looking at the interface between stakeholders and the supplier can be a basis to increase the yield of requirements engineering, while reducing required effort. The International Requirements Engineering Efficiency Workshop (REEW 2011) aimed at initiating, facilitating, and nurturing the discussion on efficient approaches to engineer just goodenough requirements. Requirements …", "num_citations": "1\n", "authors": ["1537"]}