{"title": "Video key frame extraction through dynamic Delaunay clustering with a structural constraint\n", "abstract": " Key frame based video summarization has emerged as an important area of research for the multimedia community. Video key frames enable an user to access any video in a friendly and meaningful way. In this paper, we propose an automated method of video key frame extraction using dynamic Delaunay graph clustering via an iterative edge pruning strategy. A structural constraint in form of a lower limit on the deviation ratio of the graph vertices further improves the video summary. We also employ an information-theoretic pre-sampling where significant valleys in the mutual information profile of the successive frames in a video are used to capture more informative frames. Various video key frame visualization techniques for efficient video browsing and navigation purposes are incorporated. A comprehensive evaluation on 100 videos from the Open Video and YouTube databases using both objective and …", "num_citations": "100\n", "authors": ["1242"]}
{"title": "Multi-view video summarization using bipartite matching constrained optimum-path forest clustering\n", "abstract": " The task of multi-view video summarization is to efficiently represent the most significant information from a set of videos captured for a certain period of time by multiple cameras. The problem is highly challenging because of the huge size of the data, presence of many unimportant frames with low activity, inter-view dependencies, and significant variations in illumination. In this paper, we propose a graph-theoretic solution to the above problems. Semantic feature in form of visual bag of words and visual features like color, texture, and shape are used to model shot representative frames after temporal segmentation . Gaussian entropy is then applied to filter out frames with low activity. Inter-view dependencies are captured via bipartite graph matching. Finally, the optimum-path forest algorithm is applied for the clustering purpose. Subjective as well as objective evaluations clearly indicate the effectiveness of the …", "num_citations": "52\n", "authors": ["1242"]}
{"title": "Scalable video summarization using skeleton graph and random walk\n", "abstract": " Scalable video summarization has emerged as an important problem in present day multimedia applications. Effective summaries need to be provided to the users for videos of any duration at low computational cost. In this paper, we propose a framework which is scalable during both the analysis and the generation stages of video summarization. The problem of scalable video summarization is modeled as a problem of scalable graph clustering and is solved using skeleton graph and random walks in the analysis stage. A cluster significance factor-based ranking procedure is adopted in the generation stage. Experiments on videos of different genres and durations clearly indicate the supremacy of the proposed method over a recently published work.", "num_citations": "21\n", "authors": ["1242"]}
{"title": "Nyström approximated temporally constrained multisimilarity spectral clustering approach for movie scene detection\n", "abstract": " Movie scene detection has emerged as an important problem in present day multimedia applications. Since a movie typically consists of huge amount of video data with widespread content variations, detecting a movie scene has become extremely challenging. In this paper, we propose a fast yet accurate solution for movie scene detection using Nyström approximated multisimilarity spectral clustering with a temporal integrity constraint. We use multiple similarity matrices to model the wide content variations typically present in any movie dataset. Nyström approximation is employed to reduce the high computational cost of constructing multiple similarity measures. The temporal integrity constraint captures the inherent temporal cohesion of the movie shots. Experiments on five movie datasets from different genres clearly demonstrate the superiority of the proposed solution over the state-of-the-art methods.", "num_citations": "15\n", "authors": ["1242"]}
{"title": "Video storyboard design using Delaunay graphs\n", "abstract": " Design of video storyboards has emerged as a popular research area in the multimedia community. Different pattern clustering techniques are applied to extract the key frames from a video sequence to form a storyboard. In this paper, we propose an automatic method for the selection of key frames of a video sequence using Delaunay graphs. We prune certain edges from the Delaunay graph using an iterative strategy where overall reduction in the global standard deviation of edge lengths is maximized. Resulting connected components in the graph correspond to the separate clusters. The proposed algorithm also utilizes edge information in addition to the color histogram information to achieve semantic dependency between different video frames. Performance of our algorithm is evaluated using Fidelity, Shot Reconstruction Degree and Compression Ratio. Experiments on standard video datasets indicate the …", "num_citations": "10\n", "authors": ["1242"]}
{"title": "An empirical study to investigate different SMOTE data sampling techniques for improving software refactoring prediction\n", "abstract": " The exponential rise in software systems and allied applications has alarmed industries and professionals to ensure high quality with optimal reliability, maintainability etc. On contrary software companies focus on developing software solutions at the reduced cost corresponding to the customer demands. Thus, maintaining optimal software quality at reduced cost has always been the challenge for developers. On the other hand, inappropriate code design often leads aging, smells or bugs which can harm eventual intend of the software systems. However, identifying a smell signifier or structural attribute characterizing refactoring probability in software has been the challenge. To alleviate such problems, in this research code-metrics structural feature identification and Neural Network based refactoring prediction model is developed. Our proposed refactoring prediction system at first extracts a set of software …", "num_citations": "2\n", "authors": ["1242"]}
{"title": "Application of Naïve Bayes classifiers for refactoring Prediction at the method level\n", "abstract": " Software refactoring is a technique of redesigning the existing code without changing its functionality in order to improve on code readability, code adherence, maintainability and portability. Recent years have witnessed the advancement of research in the field of improvement in code quality. The challenges involved in the field has attracted many software practitioners to identify methods or classes that need refactoring. We propose a model to predict refactoring candidates by Naïve Bayes classifiers (Gaussian, Multinomial and Bernoulli (GNB, MNB, BNB)) at method level refactoring in terms of AUC and Accuracy. Method level refactoring is carried out on data set from the Tera-Promise repository and then validated. Min-max normalization and Imbalancing techniques are then applied. Then using the Wilcoxon rank test, 8 sets of significant features are drawn out of 103 sets of input features.The experimental results …", "num_citations": "1\n", "authors": ["1242"]}
{"title": "Video key frame extraction through canonical correlation analysis and graph modularity\n", "abstract": " Key frame based video summarization has emerged as an important area of multimedia research in recent times. In this paper, we propose a novel automated approach for video key frame extraction in compressed domain using canonical correlation analysis (CCA) and graph modularity. We prune certain edges from the Video Similarity Graph (VSG) using an iterative strategy until there is no improvement in graph modularity. Resulting connected components in the final VSG correspond to separate clusters. The proposed algorithm also uses multi-feature fusion using canonical correlation analysis to achieve higher semantic dependency between different video frames. Experimental results on some standard videos of different genre clearly indicate the superiority of the proposed method in terms of the F                         1 measure.", "num_citations": "1\n", "authors": ["1242"]}
{"title": "VISUC: Video summarization with user customization\n", "abstract": " Design of video storyboards, which enables a user to access any video in a friendly and meaningful way, has emerged as an important area of research in the multimedia community. In this paper, we propose a novel semi-automated method for construction of video storyboards based on Delaunay graphs. A robust edge pruning strategy, where the edge weights are assumed to follow a Gaussian distribution, is applied on an appropriately constructed Delaunay graph. The proposed method also takes into account two advanced user needs, namely the waiting time and the number of frames an user wants to see in the story board Experimental results on some standard videos of different genre clearly indicate the superiority of the proposed method in terms of the F 0.5  measure.", "num_citations": "1\n", "authors": ["1242"]}