{"title": "Producing just enough documentation: The next sad version problem\n", "abstract": " Software architecture knowledge is an important asset in today’s projects, as it serves to share the main design decisions among the project stakeholders. Architectural knowledge is commonly captured by the Software Architecture Document (SAD), an artifact that is useful but can also be costly to produce and maintain. In practice, the SAD often fails to fulfill its mission of addressing the stakeholders’ information needs, due to factors such as: detailed or high-level contents that do not consider all stakeholders, outdated documentation, or documentation generated late in the lifecycle, among others. To alleviate this problem, we propose a documentation strategy that seeks to balance the stakeholders’ interests in the SAD against the efforts of producing it. Our strategy is cast as an optimization problem called ”the next SAD version problem” (NSVP) and several search-based techniques for it are discussed. A …", "num_citations": "7\n", "authors": ["818"]}
{"title": "Algoritmos de resolución para el cubo de Rubik\n", "abstract": " El objetivo de este trabajo fue diseñar e implementar un algoritmo que resuelva el problema de armar el cubo de Rubik (o cubo mágico), dada cualquiera de las más de 43 trillones de posibles configuraciones de éste. Para esto se realizó un trabajo de investigación mediante el cual se procedió a delinear los pasos para un algoritmo basado en la técnica de Backtracking. Se analizaron distintas heurísticas para reducir el espacio de búsqueda y así obtener un algoritmo más eficiente.No estando totalmente satisfechos con esta primera solución, se implementó un segundo programa del mismo tipo, aunque mucho más complejo y sofisticado que logró reducir a la mitad la cantidad de movimientos en los cuales se arma el cubo. Se describe en este trabajo las dos soluciones propuestas y una comparación entre ambas. Para darle una funcionalidad real al programa se le provee al usuario la posibilidad de cargar cualquier cubo mediante una interfaz gráfica amigable. Cabe destacar que esta carga va acompañada de un conjunto complejo de comprobaciones que cerciora configuraciones válidas. Este trabajo fue realizado como proyecto final para una materia que introduce en el análisis y el diseño de algoritmos. La misma es dictada en segundo año de una carrera de Informática. El lenguaje utilizado para la implementación fue C++ y el entorno de desarrollo Borland Builder C++.", "num_citations": "5\n", "authors": ["818"]}