{"title": "Social psychological aspects of computer-mediated communication.\n", "abstract": " Describes some of the issues raised by electronic communication, including time and information-processing pressures, absence of regulating feedback, dramaturgical weakness, paucity of status and position cues, social anonymity, and computing norms and immature etiquette. An empirical approach for investigating the social psychological effects of electronic communication is illustrated, and how social psychological research might contribute to a deeper understanding of computers and technological change in society and computer-mediated communication (CMC) is discussed. A series of studies that explored how people participate in CMC and how computerization affects group efforts to reach consensus is described; results indicate differences in participation, decisions, and interaction among groups meeting face to face and in simultaneous computer-linked discourse and communication by electronic mail …", "num_citations": "4809\n", "authors": ["1158"]}
{"title": "Reducing social context cues: Electronic mail in organizational communication\n", "abstract": " This paper examines electronic mail in organizational communication. Based on ideas about how social context cues within a communication setting affect information exchange, it argues that electronic mail does not simply speed up the exchange of information but leads to the exchange of new information as well. In a field study in a Fortune 500 company, we used questionnaire data and actual messages to examine electronic mail communication at all levels of the organization. Based on hypotheses from research on social communication, we explored effects of electronic communication related to self-absorption, status equalization, and uninhibited behavior. Consistent with experimental studies, we found that decreasing social context cues has substantial deregulating effects on communication. And we found that much of the information conveyed through electronic mail was information that would not have …", "num_citations": "4073\n", "authors": ["1158"]}
{"title": "Connections: New ways of working in the networked organization\n", "abstract": " Computer networking is changing the way people work and the way organizationsfunction. Connections is an accessible guide to the promise and the pitfalls of this latest phase ofthe computer revolution. Lee Sproull is Professor of Management at Boston University. Sara Kiesler isProfessor of Social and Decision Sciences at Carnegie Mellon University.", "num_citations": "3962\n", "authors": ["1158"]}
{"title": "The kindness of strangers: The usefulness of electronic weak ties for technical advice\n", "abstract": " People use weak ties—relationships with acquaintances or strangers—to seek help unavailable from friends or colleagues. Yet in the absence of personal relationships or the expectation of direct reciprocity, help from weak ties might not be forthcoming or could be of low quality. We examined the practice of distant employees (strangers) exchanging technical advice through a large organizational computer network. A survey of advice seekers and those who replied was conducted to test hypotheses about the viability and usefulness of such electronic weak tie exchanges. Theories of organizational motivation suggest that positive regard for the larger organization can substitute for direct incentives or personal relationships in motivating people to help others. Theories of weak ties suggest that the usefulness of this help may depend on the number of ties, the diversity of ties, or the resources of help providers. We …", "num_citations": "2247\n", "authors": ["1158"]}
{"title": "Group processes in computer-mediated communication\n", "abstract": " Three experiments explored the effects of computer-mediated communication on communication efficiency, participation, interpersonal behavior, and group choice. Groups of three members were asked to reach consensus on career choice problems; they communicated face-to-face and in simultaneous computer-mediated discussions or through computer mail. When groups were linked by computer, group members made fewer remarks than they did face-to-face and took longer to make their group decisions. Social equalization was higher in computer-mediated groups in that group members participated more equally in discussions. Computer-mediated groups also exhibited more uninhibited behavior—using strong and inflammatory expressions in interpersonal interactions. Decisions of computer-mediated groups shifted further away from the members' initial individual choices than group decisions which …", "num_citations": "2056\n", "authors": ["1158"]}
{"title": "Managerial response to changing environments: Perspectives on problem sensing from social cognition\n", "abstract": " This paper characterizes managerial problem sensing, a necessary precondition for managerial activity directed toward organizational adaptation, as composed of noticing, interpreting, and incorporating stimuli. It then reviews the constituent social cognition processes that make certain kinds of problem-sensing behavior, including errors, relatively likely to occur. Implications for the organizational issues of crisis, chance events, break points, and extreme change are explored.", "num_citations": "1862\n", "authors": ["1158"]}
{"title": "What's mine is ours, or is it? A study of attitudes about information sharing\n", "abstract": " As technology for information access improves, people have more opportunities to share information. A theory of information sharing is advanced and we report the results of three experiments on attitudes about sharing technical work and expertise in organizations. Based on research on sensitive topics difficult to study in the field, we derived vignette-based measures of attitudes. Subjects read a description of an employee's encounter with a previously unhelpful coworker who subsequently requested help—in the form of a computer program or computer advice. The influence of prosocial attitudes and organizational norms is inferred from subjects' support of sharing despite the previous unhelpful behavior of the coworker. Experiments 1 and 3 demonstrated that greater self interest reduces support of sharing, but that a belief in organizational ownership of work encourages and mediates attitudes favoring sharing …", "num_citations": "1788\n", "authors": ["1158"]}
{"title": "The equalization phenomenon: Status effects in computer-mediated and face-to-face decision-making groups\n", "abstract": " New computer-based communications technologies make possible new or expanded forms of group work. Although earlier researchers suggest that scant social information in these technologies might cause status equalization in groups, no experimental test of this phenomenon has been made. In a laboratory experiment, we compared face-to-face communication with electronic mail in decision-making groups whose members differed in social status. We examined status in two ways: by varying the external status of group members, and by varying the decision task to manipulate expertise. When the groups made decisions in face-to-face meetings, the high-status member dominated discussions with the three low-status members. Also, the high-status member more often was a \"first advocate\" in the face-to-face discussions, and first advocates were more influential than later advocates. These status inequalities in …", "num_citations": "1340\n", "authors": ["1158"]}
{"title": "Group decision making and communication technology\n", "abstract": " Advances in computing and telecommunications technology are changing how people can meet and make group decisions. Technological changes help people cross physical, social, and psychological boundaries, and have secondary effects on group behavior and decision making. Experiments show that, compared with a face-to-face meeting, a computer-mediated discussion leads to delays; more explicit and outspoken advocacy; “flaming;” more equal participation among group members; and more extreme, unconventional, or risky decisions. Technological and social psychological variables that cause these effects in laboratory groups do not scale at equal rates. Technological change in organizational group decision making can lead to outcomes not seen in the laboratory, which makes it essential to do field research. Three phenomena observed in field studies are redistributions of work time, relative …", "num_citations": "1287\n", "authors": ["1158"]}
{"title": "Response effects in the electronic survey\n", "abstract": " This report examines the electronic survey as a research tool. In an electronic survey, respondents use a text processing program to self-administer a computer-based questionnaire. As more people have access to computers, electronic surveys may become widespread. The electronic survey can reduce processing costs because it automates the transformation of raw data into computer-readable form. It can combine advantages of interviews (e.g., prompts, complex branching) with those of paper mail surveys (e.g., standardization, anonymity). An important issue is how the electronic survey affects the responses of people who use it. We conducted an experimental sample survey on health attitudes, behaviors, and personal traits using two forms of administration: electronic and paper mail. Closed-end responses in the electronic survey were less socially desirable and tended to be more extreme than were …", "num_citations": "1177\n", "authors": ["1158"]}
{"title": "A meta-analytic study of social desirability distortion in computer-administered questionnaires, traditional questionnaires, and interviews.\n", "abstract": " A meta-analysis of social desirability distortion compared computer questionnaires with traditional paper-and-pencil questionnaires and face-to-face interviews in 61 studies (1967–1997; 673 effect sizes). Controlling for correlated observations, a near-zero overall effect size was obtained for computer versus paper-and-pencil questionnaires. With moderators, there was less distortion on computerized measures of social desirability responding than on the paper-and-pencil measures, especially when respondents were alone and could backtrack. There was more distortion on the computer on other scales, but distortion was small when respondents were alone, anonymous, and could backtrack. There was less distortion on computerized versions of interviews than on face-to-face interviews. Research is needed on nonlinear patterns of distortion, and on the effects of context and interface on privacy perceptions and …", "num_citations": "1080\n", "authors": ["1158"]}
{"title": "Collaborative research across disciplinary and organizational boundaries\n", "abstract": " Scientific and engineering research increasingly involves multidisciplinary                 collaboration, sometimes across multiple organizations. Technological advances have                 made such cross-boundary projects possible, yet they can carry high coordination                 costs. This study investigated scientific collaboration across disciplinary and                 university boundaries to understand the need for coordination in these                 collaborations and how different levels of coordination predicted success. We                 conducted a study of 62 scientific collaborations supported by a program of the US                 National Science Foundation in 1998 and 1999. Projects with principal investigators                 (PIs) in more disciplines reported as many positive outcomes as did projects                 involving fewer disciplines. By contrast, multi-university, rather than                 multidisciplinary, projects were problematic. Projects …", "num_citations": "910\n", "authors": ["1158"]}
{"title": "Matching robot appearance and behavior to tasks to improve human-robot cooperation\n", "abstract": " A robot's appearance and behavior provide cues to the robot's abilities and propensities. We hypothesize that an appropriate match between a robot's social cues and its task improve the people's acceptance of and cooperation with the robot. In an experiment, people systematically preferred robots for jobs when the robot's humanlikeness matched the sociability required in those jobs. In two other experiments, people complied more with a robot whose demeanor matched the seriousness of the task.", "num_citations": "827\n", "authors": ["1158"]}
{"title": "The ideal elf: Identity exploration in World of Warcraft\n", "abstract": " In this study, we examine the identity exploration possibilities presented by online multiplayer games in which players use graphics tools and character-creation software to construct an avatar, or character. We predicted World of Warcraft players would create their main character more similar to their ideal self than the players themselves were. Our results support this idea; a sample of players rated their character as having more favorable attributes that were more favorable than their own self-rated attributes. This trend was stronger among those with lower psychological well-being, who rated themselves comparatively lower than they rated their character. Our results suggest that the game world allows players the freedom to create successful virtual selves regardless of the constraints of their actual situation.", "num_citations": "718\n", "authors": ["1158"]}
{"title": "Evaluation of the performance of women as a function of their sex, achievement, and personal history.\n", "abstract": " Studied the conditions under which women are prejudiced against women. 120 female undergraduates evaluated 8 paintings in a 2* 2* 2 design varying (a) sex of painter,(b) status of the painting, and (c) personal odds faced by the artist. Results indicate that Ss judged the entry paintings by men to be significantly better than identical paintings by women. Winning paintings were not evaluated differently by sex. Obstacles faced by winners or entrants had no effect on judgments. It is concluded that women who are attempting to accomplish are judged less favorably than men, but that women who have successfully accomplished are evaluated as favorably as men.(PsycINFO Database Record (c) 2016 APA, all rights reserved)", "num_citations": "666\n", "authors": ["1158"]}
{"title": "Managing distances and differences in geographically distributed work groups.\n", "abstract": " working with a Fortune 100, US-based computer company,[the authors] served as consultants to product development teams with members located in separate offices, sometimes on different continents/summarizes the lessons we learned from consulting with 2 such distributed groups and from interviewing managers and staff consultants involved in 7 other distrubuted groups/all of these groups were part of the software engineering organization, involved with product development, and consisted of software engineers, marketing specialists, and technical writers", "num_citations": "659\n", "authors": ["1158"]}
{"title": "What do we know about proximity and distance in work groups? A legacy of research\n", "abstract": " Significant increases in the geographic distribution of work have been touted widely. Yet a large body of evidence suggests that close proximity is beneficial to relationships and group interaction. We examine these benefits through the lens of research on the mere presence of others, face-to-face communication, shared social settings, and frequency of spontaneous communication. Technological and organizational remedies for the absence of these factors in distributed work groups are popular but often problematic. We propose that communication technology is more likely to be effective when groups are cohesive than when they are not and that structured management (as well as technology) is likely to be needed in groups lacking cohesion.\" Collaboration is a body contact sport.\" The researcher who said this during an interview believes, as many others do, that physical proximity has a tremendous impact on the ability to work together. There is considerable support for this belief in the academic community as well. Research harking back fifty years has demonstrated that close proximity among people is associated with numerous emotional, cognitive, and behavioral changes that affect the work process for the better. In this chapter, we describe these findings, discuss reasons that proximity has been thought very good for group functioning, and consider how well people adapt to working apart. Our purpose is to stimulate discussion on fundamental problems in the psychology of distributed work and the management of distance.", "num_citations": "649\n", "authors": ["1158"]}
{"title": "Distributed work\n", "abstract": " Multidisciplinary research on dynamics, problems, and potential of distributed work. Technological advances and changes in the global economy are increasing the geographic distribution of work in industries as diverse as banking, wine production, and clothing design. Many workers communicate regularly with distant coworkers; some monitor and manipulate tools and objects at a distance. Work teams are spread across different cities or countries. Joint ventures and multiorganizational projects entail work in many locations. Two famous examples--the Hudson Bay Company's seventeenth-century fur trading empire and the electronic community that created the original Linux computer operating system--suggest that distributed work arrangements can be flexible, innovative, and highly successful. At the same time, distributed work complicates workers' professional and personal lives. Distributed work alters how people communicate and how they organize themselves and their work, and it changes the nature of employee-employer relationships. This book takes a multidisciplinary approach to the study of distributed work groups and organizations, the challenges inherent in distributed work, and ways to make distributed work more effective. Specific topics include division of labor, incentives, managing group members, facilitating interaction among distant workers, and monitoring performance. The final chapters focus on distributed work in one domain, collaborative scientific research. The contributors include psychologists, cognitive scientists, sociologists, anthropologists, historians, economists, and computer scientists.", "num_citations": "639\n", "authors": ["1158"]}
{"title": "All robots are not created equal: the design and perception of humanoid robot heads\n", "abstract": " This paper presents design research conducted as part of a larger project on human-robot interaction. The primary goal of this study was to come to an initial understanding of what features and dimensions of a humanoid robot's face most dramatically contribute to people's perception of its humanness. To answer this question we analyzed 48 robots and conducted surveys to measure people's perception of each robot's humanness. Through our research we found that the presence of certain features, the dimensions of the head, and the total number of facial features heavily influence the perception of humanness in robot heads. This paper presents our findings and initial guidelines for the design of humanoid robot heads.", "num_citations": "606\n", "authors": ["1158"]}
{"title": "Conformity\n", "abstract": " Copyright© 1969 by Addison-Wesley Publishing Company, Inc. Philippines copyright1969 by Addison-Wesley Publishing Company, Inc.", "num_citations": "596\n", "authors": ["1158"]}
{"title": "Storytelling alice motivates middle school girls to learn computer programming\n", "abstract": " We describe Storytelling Alice, a programming environment that introduces middle school girls to computer programming as a means to the end of creating 3D animated stories. Storytelling Alice supports story creation by providing 1) a set of high-level animations, that support the use of social characters who can interact with one another, 2) a collection of 3D characters and scenery designed to spark story ideas, and 3) a tutorial that introduces users to writing Alice programs using story-based examples. In a study comparing girls' experiences learning to program using Storytelling Alice and a version of Alice without storytelling support (Generic Alice), we found that users of Storytelling Alice and Generic Alice were equally successful at learning basic programming constructs. Participants found Storytelling Alice and Generic Alice equally easy to use and entertaining. Users of Storytelling Alice were more motivated …", "num_citations": "550\n", "authors": ["1158"]}
{"title": "Communication across boundaries: Work, structure, and use of communication technologies in a large organization\n", "abstract": " Recent popular and theoretical literature emphasizes the significance of communication technology for collaboration and information sharing across organizational boundaries. We hypothesize that due to the collaborative nature of their work and the way they are organized in work groups, technical employees, as compared with administrative employees, will communicate laterally, and will use the telephone and email for this purpose. We studied technical and administrative employees in seven departments of a large telecommunications firm. From logs of communication over two days, we examined vertical and lateral communication inside and outside the chain of command and department, and the use of telephone, email, and voice mail for this communication. Technical employees did have more lateral communication than administrators did, but all lateral communication (not just that of technical employees …", "num_citations": "544\n", "authors": ["1158"]}
{"title": "Group and computer-mediated discussion effects in risk decision making.\n", "abstract": " In this study, we examine hypotheses, based on theories of group decision making and an extension of prospect theory to a social context, about the influence of group communication and group decision processes on group decisions. Managers individually and in 3-person groups made multiattribute risk choices (two investment alternatives, each with multiple outcomes). Two group decisions were reached during face-to-face discussion, and two were reached during (real-time) computer-mediated discussion. In comparison with prediscussion individual preferences, groups' multiattribute risk choices and attitudes after face-to-face discussion were risk averse for gains and risk seeking for losses, a tendency predicted by prospect theory and consistent with choice shift and other group extremitization research. By contrast, group decisions during computer-mediated discussion did not shift in the direction of prospect …", "num_citations": "536\n", "authors": ["1158"]}
{"title": "When the interface is a face\n", "abstract": " People behave differently in the presence of other people than they do when they are alone. People also may behave differently when designers introduce more human-like qualities into computer interfaces. In an experimental study we demonstrate that people's responses to a talking-face interface differ from their responses to a text-display interface. They attribute some personality traits to it; they are more aroused by it; they present themselves in a more positive light. We use theories of person perception, social facilitation, and self-presentation to predict and interpret these results. We suggest that as computer interfaces become more \"human-like,\" people who use those interfaces may change their own personas in response to them.", "num_citations": "531\n", "authors": ["1158"]}
{"title": "Culture of the Internet\n", "abstract": " As we begin a new century, the astonishing spread of nationally and internationally accessible computer-based communication networks has touched the imagination of people everywhere. Suddenly, the Internet is in everyday parlance, featured in talk shows, in special business\" technology\" sections of major newspapers, and on the covers of national magazines. If the Internet is a new world of social behavior it is also a new world for those who study social behavior. This volume is a compendium of essays and research reports representing how researchers are thinking about the social processes of electronic communication and its effects in society. Taken together, the chapters comprise a first gathering of social psychological research on electronic communication and the Internet. The authors of these chapters work in different disciplines and have different goals, research methods, and styles. For some, the emergence and use of new technologies represent a new perspective on social and behavioral processes of longstanding interest in their disciplines. Others want to draw on social science theories to understand technology. A third group holds to a more activist program, seeking guidance through research to improve social interventions using technology in domains such as education, mental health, and work productivity. Each of these goals has influenced the research questions, methods, and inferences of the authors and the\" look and feel\" of the chapters in this book. Intended primarily for researchers who seek exposure to diverse approaches to studying the human side of electronic communication and the Internet, this volume has …", "num_citations": "523\n", "authors": ["1158"]}
{"title": "Computers, networks and work\n", "abstract": " Electronic interactions differ significantly from face-to-face exchanges. As a result, computer networks will profoundly affect the structure of organizations and the conduct of work  thOUgh the world may be evolv ing into a global village, most people still lead local lives at work. They spend the majority of their time in one physical location and talk predominantly to their immediate co workers, clients and customers. They participate in only a few workplace groups: their primary work group, per haps a committee or task force and possibly an informal social group. Some people, however, already expe rience a far more cosmopolitan future because they work in organizations that have extensive computer networks. Such individuals can communicate with people around the world as easily as they talk with someone in the next office. They can hold involved group discussions about company policy, new product deSign …", "num_citations": "511\n", "authors": ["1158"]}
{"title": "Predicting human interruptibility with sensors\n", "abstract": " A person seeking another person's attention is normally able to quickly assess how interruptible the other person currently is. Such assessments allow behavior that we consider natural, socially appropriate, or simply polite. This is in sharp contrast to current computer and communication systems, which are largely unaware of the social situations surrounding their usage and the impact that their actions have on these situations. If systems could model human interruptibility, they could use this information to negotiate interruptions at appropriate times, thus improving human computer interaction.This article presents a series of studies that quantitatively demonstrate that simple sensors can support the construction of models that estimate human interruptibility as well as people do. These models can be constructed without using complex sensors, such as vision-based techniques, and therefore their use in everyday …", "num_citations": "451\n", "authors": ["1158"]}
{"title": "Those who are number two try harder: The effect of sex on attributions of causality.\n", "abstract": " Conducted 2 experiments to ascertain the causal attributions made by a total of 274 male and female undergraduates for identical performance (including success and failure) of males and females. In both experiments, Ss made attributions along 4 dimensions: ability, motivation, task difficulty, and luck. Whether evaluating undergraduates on an intellectual task (Exp I) or successful physicians (Exp II), Ss attributed greater motivation to females than to males. In addition, males perceived the female physician as being less able and having an easier task than the male physician. However, female Ss perceived the female physician as having a harder task than the male physician. Implications for attribution theory and the perception of professional women in our society are discussed.(17 ref)(PsycINFO Database Record (c) 2016 APA, all rights reserved)", "num_citations": "429\n", "authors": ["1158"]}
{"title": "Coordination costs and project outcomes in multi-university collaborations\n", "abstract": " Multi-university collaborations draw on diverse resources and expertise, but they impose coordination costs for bridging institutional differences and geographic distance. We report a study of the coordination activities and project outcomes of 491 research collaborations funded by the US National Science Foundation. Coordination activities, especially division of responsibility for tasks and knowledge transfer among investigators, predicted project outcomes (e.g., producing new knowledge, creating new tools, and training students). However, more universities involved in a collaboration predicted fewer coordination activities and fewer project outcomes. A statistical mediation analysis showed that insufficient coordination explained the negative relationship between multi-university collaboration and project outcomes.", "num_citations": "424\n", "authors": ["1158"]}
{"title": "Predicting human interruptibility with sensors: a wizard of oz feasibility study\n", "abstract": " A person seeking someone else's attention is normally able to quickly assess how interruptible they are. This assessment allows for behavior we perceive as natural, socially appropriate, or simply polite. On the other hand, today's computer systems are almost entirely oblivious to the human world they operate in, and typically have no way to take into account the interruptibility of the user. This paper presents a Wizard of Oz study exploring whether, and how, robust sensor-based predictions of interruptibility might be constructed, which sensors might be most useful to such predictions, and how simple such sensors might be. The study simulates a range of possible sensors through human coding of audio and video recordings. Experience sampling is used to simultaneously collect randomly distributed self-reports of interruptibility. Based on these simulated sensors, we construct statistical models predicting human …", "num_citations": "382\n", "authors": ["1158"]}
{"title": "Pool halls, chips, and war games: Women in the culture of computing\n", "abstract": " Computers are becoming ubiquitous in our society and they offer superb opportunities for people in jobs and everyday life. But there is a noticeable sex difference in use of computers among children. This article asks why computers are more attractive to boys than to girls and offers a cultural framework for explaining the apparent sex differences. Although the data are fragmentary, the world of computing seems to be more consistent with male adolescent culture than with feminine values and goals. Furthermore, both arcade and educational software is designed with boys in mind. These observations lead us to speculate that computing is neither inherently difficult nor uninteresting to girls, but rather that computer games and other software might have to be designed differently for girls. Programs to help teachers instill computer efficacy in all children also need to be developed.", "num_citations": "354\n", "authors": ["1158"]}
{"title": "Legitimacy, authority, and community in electronic support groups\n", "abstract": " In electronic support groups, people use Internet-based electronic text communication to discuss personal problems or disorders with others who share common circumstances. Although their discussions exist only in the electronic medium, these groups can be viewed usefully as discourse communities. The authors draw on what is known about two other popular sources of help—face-to-face self-help groups and self-help books—to frame the rhetorical challenges faced by members of electronic support groups. The authors then compare the discourse of electronic support groups with that of electronic hobby groups to demonstrate that the two sets differ in terms of the rhetorical behavior of their participants. The authors analyze messages to determine how members establish legitimacy and authority in their texts and how message exchange gives rise to group identity and a sense of community. Our observations …", "num_citations": "353\n", "authors": ["1158"]}
{"title": "Anonymity, privacy, and security online\n", "abstract": " 86% of adult internet users have taken steps from time to time to avoid surveillance by other people or organizations when they were using the internet. Despite their precautions, 21% of online adults have had an email or social media account hijacked and 11% have had vital information like Social Security numbers, bank account data, or credit cards stolen—and growing numbers worry about the amount of personal information about them that is available online.", "num_citations": "328\n", "authors": ["1158"]}
{"title": "Comparing a computer agent with a humanoid robot\n", "abstract": " HRI researchers interested in social robots have made large investments in humanoid robots. There is still sparse evidence that peoples' responses to robots differ from their responses to computer agents, suggesting that agent studies might serve to test HRI hypotheses. To help us understand the difference between people's social interactions with an agent and a robot, we experimentally compared people's responses in a health interview with (a) a computer agent projected either on a computer monitor or life-size on a screen,(b) a remote robot projected life-size on a screen, or (c) a collocated robot in the same room. We found a few behavioral and large attitude differences across these conditions. Participants forgot more and disclosed least with the collocated robot, next with the projected remote robot, and then with the agent. They spent more time with the collocated robot and their attitudes were most positive …", "num_citations": "321\n", "authors": ["1158"]}
{"title": "Beyond hearing: Where the real-world and online support meet.\n", "abstract": " A random sample survey of an online self-help group for people with hearing loss was conducted. Two factors predicted active participation in the group: a lack of real-world social support and being comparatively effective (having less disability, coping more effectively, and using real-world professional services). More active participation in the group was associated with more benefits from the group and stronger reports of community orientation. The authors also found evidence that integration of online and real-world support (if it existed) benefited participants. That is, if supportive family and friends in the real world shared the online group with participants, participants reported above average benefits, whereas if supportive family and friends were uninvolved in the online group, participants reported below average benefits.(PsycINFO Database Record (c) 2016 APA, all rights reserved)", "num_citations": "312\n", "authors": ["1158"]}
{"title": "The advisor robot: tracing people's mental model from a robot's physical attributes\n", "abstract": " Humanoid robots offer many physical design choices such as voice frequency and head dimensions. We used hierarchical statistical mediation analysis to trace differences in people's mental model of robots from these choices. In an experiment, a humanoid robot gave participants online advice about their health. We used mediation analysis to identify the causal path from the robot's voice and head dimensions to the participants' mental model, and to their willingness to follow the robot's advice. The male robot voice predicted impressions of a knowledgeable robot, whose advice participants said they would follow. Increasing the voice's fundamental frequency reduced this effect. The robot's short chin length (but not its forehead dimensions) predicted impressions of a sociable robot, which also predicted intentions to take the robot's advice. We discuss the use of this approach for designing robots for different roles …", "num_citations": "306\n", "authors": ["1158"]}
{"title": "Communication and performance in ad hoc task groups\n", "abstract": " Collaborative work in organizations is frequently accomplished and man aged in small work groups, either formal work groups or ad hoc groups. The formal work group has relatively permanent membership, ongoing tasks, and routinized reporting relationships within the organization. Members typically work in close proximity. Over time they elaborate personal rela tionships, divisions of labor, norms, and routines for communication to support their work. They learn to work together by doing work together.ABSTRACT", "num_citations": "299\n", "authors": ["1158"]}
{"title": "Anthropomorphic interactions with a robot and robot–like agent\n", "abstract": " People's physical embodiment and presence increase their salience and importance. We predicted people would anthropomorphize an embodied humanoid robot more than a robot–like agent, and a collocated more than a remote robot. A robot or robot–like agent interviewed participants about their health. Participants were either present with the robot/agent, or interacted remotely with the robot/agent projected life–size on a screen. Participants were more engaged, disclosed less undesirable behavior, and forgot more with the robot versus the agent. They ate less and anthropomorphized most with the collocated robot. Participants interacted socially and attempted conversational grounding with the robot/agent though aware it was a machine. Basic questions remain about how people resolve the ambiguity of interacting with a humanlike nonhuman.", "num_citations": "295\n", "authors": ["1158"]}
{"title": "Self disclosure on computer forms: Meta-analysis and implications\n", "abstract": " Do people disclose more on a computer form than they do in an interview or on a paper form? We report a statistical meta-analysis of the literature from 1969 to 1994. Across 39 studies using 100 measures, computer administration increased self-disclosure. Effect sizes were larger comparing computer administration with face-to-face interviews, when forms solicited sensitive information, and when medical or psychiatric patients were the subjects. Effect sizes were smaller but had not disappeared in recent studies, which we attribute in part to changes in computer interfaces. We discuss research, ethical, policy, and design implications.", "num_citations": "285\n", "authors": ["1158"]}
{"title": "“my data just goes everywhere:” user mental models of the internet and implications for privacy and security\n", "abstract": " Many people use the Internet every day yet know little about how it really works. Prior literature diverges on how people’s Internet knowledge affects their privacy and security decisions. We undertook a qualitative study to understand what people do and do not know about the Internet and how that knowledge affects their responses to privacy and security risks. Lay people, as compared to those with computer science or related backgrounds, had simpler mental models that omitted Internet levels, organizations, and entities. People with more articulated technical models perceived more privacy threats, possibly driven by their more accurate understanding of where specific risks could occur in the network. Despite these differences, we did not find a direct relationship between people’s technical background and the actions they took to control their privacy or increase their security online. Consistent with other work on user knowledge and experience, our study suggests a greater emphasis on policies and systems that protect privacy and security without relying too much on users’ security practices.", "num_citations": "280\n", "authors": ["1158"]}
{"title": "A prisoner's dilemma experiment on cooperation with people and human-like computers.\n", "abstract": " The authors investigated basic properties of social exchange and interaction with technology in an experiment on cooperation with a human-like computer partner or a real human partner. Talking with a computer partner may trigger social identity feelings or commitment norms. Participants played a prisoner's dilemma game with a confederate or a computer partner. Discussion, inducements to make promises, and partner cooperation varied across trials. On Trial 1, after discussion, most participants proposed cooperation. They kept their promises as much with a text-only computer as with a person, but less with a more human-like computer. Cooperation dropped sharply when any partner avoided discussion. The strong impact of discussion fits a social contract explanation of cooperation following discussion. Participants broke their promises to a computer more than to a person, however, indicating that people …", "num_citations": "271\n", "authors": ["1158"]}
{"title": "Mental models of robotic assistants\n", "abstract": " If robotic assistants are to be successful, people will need appropriate mental models of what these robots can do and how they operate. We are developing techniques for measuring people's mental models of interactive robots and social agents. We aim to measure the content of these models--if they are anthropomorphic or mechanistic--and the richness of these models (how elaborate or sparse they are; how much confidence people have in them). We report progress here.", "num_citations": "265\n", "authors": ["1158"]}
{"title": "Blurring the boundaries: Cell phones, mobility, and the line between work and personal life\n", "abstract": " Up until the beginning of the twentieth century, most people lived in close proximity to the places they worked — on farms, above stores and cafés, in back rooms of schools, and in boarding houses. Co-workers were often members of the family, companions and neighbours. With the rise of modern technology — electrification, motorised transportation, communication systems — and the growing importance of the bureaucratic work organisation, the separation between work and personal life grew more definite. Commuting to work, strictures against “personal calls” at work, socialising during weekends, and having a separate “personal” or social life, are twentieth century concepts. These concepts reflect differentiation of the social meaning of places and locations — working with other employees at the office versus seeing family at home, for instance. They also reflect differentiation of the social meaning of …", "num_citations": "250\n", "authors": ["1158"]}
{"title": "Returns to science: Computer networks in oceanography\n", "abstract": " RETURNS TO SCIENCE:¢ OINIPUTER NETWORKS IN OCEANOGRAPHY ecent developments in network communication and scientific computation have led to calls for a massive increase in computer network support for science [22]. Computer science has benefitted from networking technology since the Arpanet began in the late 1960s [16]. Other scientific disciplines began using networks in a more or less organized Pfashion by the early 1980s: Highenergy physicists use Hepnet, and molecular biologists use Bionet. Yet network support for science has been raainly an ad hoc enterprise. One vision of the future is the Collaboratory: a\" combination of technology, tools, and infrastructure that allows scientists to work with remote facilities (co-laboratory) and one another (collaboratory) as if they were colocated and effectively interfaced\"[17].", "num_citations": "218\n", "authors": ["1158"]}
{"title": "Who collaborates successfully? Prior experience reduces collaboration barriers in distributed interdisciplinary research\n", "abstract": " Two recent studies of over 500 interdisciplinary research projects have documented comparatively poor outcomes of more distributed projects and the failed coordination mechanisms that partly account for these problems. In this paper we report results of an analysis of dyadic data from the most recent of these studies. The question we asked is,\" Does prior experience with a collaborator reduce the barriers of distance or interdisciplinarity?\" Analyses of 3911 pairs of collaborators found an answer:\" In part, yes!\" A prior project with a collaborator predicts greater strength of a current collaborative work tie. Prior experience also reduces the negative impact of distance and disciplinary differences. We discuss the implications of these results for CSCW, given the lack of evidence that today's technology eliminates collaboration barriers in distributed research.", "num_citations": "212\n", "authors": ["1158"]}
{"title": "Introduction to this special issue on human-robot interaction\n", "abstract": " Human–computer interaction (HCI), as a field, has made great strides toward understanding and improving our interactions with computer-based technologies. From the early explorations of direct interaction with computers, we have reached the point where usability, usefulness, and an appreciation of technology’s social impact, including its risks, are widely accepted goals in computing. HCI researchers, designers, and usability engineers work in a variety of settings on many kinds of technologies. Recent proceedings of the CHI conference give evidence of this diversity. Topics include not only the office systems where HCI work began, but also tiny mobile devices, Web and Internet services, games, and large networked systems. This special issue introduces a rapidly emerging technology and new focus for HCI—autonomous robots and the human–robot interactions required by these robots.", "num_citations": "212\n", "authors": ["1158"]}
{"title": "Self-selected and randomly selected respondents in a computer network survey\n", "abstract": " MethodWe drew a stratified random sample of 300 individual subscribers to the Ocean Division of SCIENCEnet (N= 1,100), a computer network managed by Omnet, Inc.(Hesse et al., in press). Based on previous network usage, we drew half the sample from those below the median in usage and half from those above the median. We compared the random sample with 104 subscribers who asked to participate in the study.Together with Omnet, we sent electronic mail to the random sample, saying the survey\" would benefit\" the SCIENCEnet community and announcing a lottery prize of $250. Nonrespondents were reminded 3 weeks and 9 weeks later. At the same times, Omnet posted a message on an electronic bulletin board accessible to all members of the network inviting participation in the survey. The 93-item survey was a separate electronic mail message. Respondents could read it and reply electronically …", "num_citations": "199\n", "authors": ["1158"]}
{"title": "Gracefully mitigating breakdowns in robotic services\n", "abstract": " Robots that operate in the real world will make mistakes. Thus, those who design and build systems will need to understand how best to provide ways for robots to mitigate those mistakes. Building on diverse research literatures, we consider how to mitigate breakdowns in services provided by robots. Expectancy-setting strategies forewarn people of a robot's limitations so people will expect mistakes. Recovery strategies, including apologies, compensation, and options for the user, aim to reduce the negative consequence of breakdowns. We tested these strategies in an online scenario study with 317 participants. A breakdown in robotic service had severe impact on evaluations of the service and the robot, but forewarning and recovery strategies reduced the negative impact of the breakdown. People's orientation toward services influenced which recovery strategy worked best. Those with a relational orientation …", "num_citations": "195\n", "authors": ["1158"]}
{"title": "Video co-summarization: Video summarization by visual co-occurrence\n", "abstract": " We present video co-summarization, a novel perspective to video summarization that exploits visual co-occurrence across multiple videos. Motivated by the observation that important visual concepts tend to appear repeatedly across videos of the same topic, we propose to summarize a video by finding shots that co-occur most frequently across videos collected using a topic keyword. The main technical challenge is dealing with the sparsity of co-occurring patterns, out of hundreds to possibly thousands of irrelevant shots in videos being considered. To deal with this challenge, we developed a Maximal Biclique Finding (MBF) algorithm that is optimized to find sparsely co-occurring patterns, discarding less co-occurring patterns even if they are dominant in one video. Our algorithm is parallelizable with closed-form updates, thus can easily scale up to handle a large number of videos simultaneously. We demonstrate the effectiveness of our approach on motion capture and self-compiled YouTube datasets. Our results suggest that summaries generated by visual co-occurrence tend to match more closely with human generated summaries, when compared to several popular unsupervised techniques.", "num_citations": "193\n", "authors": ["1158"]}
{"title": "Computer communication and organizational commitment: Tracing the relationship in a city government\n", "abstract": " Various theories and management policies suggest that there should be a positive relationship between communication and commitment to the organization. However, support for that relationship remains equivocal. We report the results of a questionnaire on communication and commitment filled out by 376 employees of a mid‐sized city government. They were asked about the mode and frequency of their communications within the organization and about their commitment to the city government. Consistent with our hypotheses about the nature of computer‐mediated communication, use of computer mail and bulletin boards predicted organizational commitment, but use of the telephone and paper modes of communication did not. In addition, those most likely to benefit from the immediacy and memory of computer communication—shift workers—evidenced a stronger relationship between computer mail use and …", "num_citations": "192\n", "authors": ["1158"]}
{"title": "How people anthropomorphize robots\n", "abstract": " We explored anthropomorphism in people's reactions to a robot in social context vs. their more considered judgments of robots in the abstract. Participants saw a photo and read transcripts from a health interview by a robot or human interviewer. For half of the participants, the interviewer was polite and for the other half, the interviewer was impolite. Participants then summarized the interactions in their own words and responded true or false to adjectives describing the interviewer. They later completed a post-task survey about whether a robot interviewer would possess moods, attitudes, and feelings. The results showed substantial anthropomorphism in participants' interview summaries and true-false responses, but minimal anthropomorphism in the abstract robot survey. Those who interacted with the robot interviewer tended to anthropomorphize more in the post-task survey, suggesting that as people interact more …", "num_citations": "189\n", "authors": ["1158"]}
{"title": "Expertise and collaboration in the geographically dispersed organization\n", "abstract": " The knowledge-based view of the firm has led to greater theoretical interest in how organizations integrate knowledge resources embedded in their employees’ expertise. We examine the knowledge-integration problem in geographically dispersed professional organizations in which experts work in project teams. From consideration of coordination costs and local ties, we argue that (1) the organization will develop specialized expertise within local sites, (2) managers avoid crossing geographic boundaries to staff a project unless bringing on a distant expert helps meet customer requirements, (3) cross-site connections help less-needed members participate in dispersed projects, and (4) dispersed projects that have a better match of expertise generate higher net earnings. We tested these hypotheses using archival data and interviews in a geographically dispersed professional service organization. We examined …", "num_citations": "188\n", "authors": ["1158"]}
{"title": "Human mental models of humanoid robots\n", "abstract": " Effective communication between a person and a robot may depend on whether there exists a common ground of understanding between the two. In two experiments modelled after human-human studies we examined how people form a mental model of a robot’s factual knowledge. Participants estimated the robot’s knowledge by extrapolating from their own knowledge and from information about the robot’s origin and language. These results suggest that designers of humanoid robots must attend not only to the social cues that robots emit but also to the information people use to create mental models of a robot.", "num_citations": "180\n", "authors": ["1158"]}
{"title": "Time effects in computer-mediated groups: Past, present, and future\n", "abstract": " Technology affects distributed groups in an interplay with characteristics of time. A review of empirical research on temporal factors in on-line interaction focuses on (1) teams' development over time and their adaptation to media,(2) the way information rates promote impersonal or interpersonal reactions, the timing of electronic communication, and the use of real-time message systems to manage interaction, and (3) members' anticipated group longevity, which shapes members' interactions and the character of their associations.Contemporary distributed work teams rely to an increasing extent on e-mail and computer conferencing to accomplish their work (Weisenfeld, Raghuram, and Garud 1999). Because of their vital role in such groups, the impact of electronic communication media on the ways people work and relate to one another is critically important. Yet these media do not have simple effects. Distributed teams typically work on extended tasks over some period of time, and temporal variations affect the way such relationships work in a variety of potent ways. This chapter focuses on the interactions of temporal factors and media in distributed interaction.", "num_citations": "177\n", "authors": ["1158"]}
{"title": "Multiple group coordination in complex and dynamic task environments: Interruptions, coping mechanisms, and technology recommendations\n", "abstract": " Collaboration in complex and dynamic environments such as hospitals, airlines, and disaster response teams is challenging. High performance requires smooth coordination across multiple groups whose incentives, cultures, and routines can conflict. In this paper, we present an in-depth case study of a hospital's operating room practices to understand challenges associated with multiple group coordination and how information technology may help. We use the concept of trajectory to focus our observations and interviews on workflow across groups and critical events when coordination breaks down. A careful examination of the sources, coping mechanisms, and consequences of coordination breakdowns suggests three factors whose absence may impede effective responses to unexpected interruptions: (1) trajectory awareness of what is going on beyond a person's immediate workspace, (2) information systems …", "num_citations": "171\n", "authors": ["1158"]}
{"title": "Why do people seek anonymity on the internet? Informing policy and design\n", "abstract": " In this research we set out to discover why and how people seek anonymity in their online interactions. Our goal is to inform policy and the design of future Internet architecture and applications. We interviewed 44 people from America, Asia, Europe, and Africa who had sought anonymity and asked them about their experiences. A key finding of our research is the very large variation in interviewees' past experiences and life situations leading them to seek anonymity, and how they tried to achieve it. Our results suggest implications for the design of online communities, challenges for policy, and ways to improve anonymity tools and educate users about the different routes and threats to anonymity on the Internet.", "num_citations": "168\n", "authors": ["1158"]}
{"title": "Cooperation with a robotic assistant\n", "abstract": " Robotic assistants soon will serve many assistive roles in our everyday lives. It is important to understand how these robots can interact with users, not just as tools, but also as social agents. In a controlled laboratory experiment, we examined cooperation in an effortful task with a robot that displayed one of two personalities. We found that a serious, caring robot induced more compliance than a playful, ejoybale robot on this task. We propose possible explanations and further research.", "num_citations": "168\n", "authors": ["1158"]}
{"title": "Ethical issues in conducting sex research on the Internet\n", "abstract": " The Internet offers a “virtual world” in which to carry out innovative sex research, but this new world may entail new ethical dilemmas. Ethical issues in recruitment, informed consent, data collection, and record keeping are examined. Applying common sense and current ethical codes for conducting sex research are sufficient in most cases. Special care and procedures may be required to obtain data from children and to protect the privacy of sensitive data and records. Researchers should be aware of, and should report, threats to data integrity and potential biases in participants' responses when they respond by computer.", "num_citations": "168\n", "authors": ["1158"]}
{"title": "Human preferences for robot-human hand-over configurations\n", "abstract": " Handing over objects to humans is an essential capability for assistive robots. While there are infinite ways to hand an object, robots should be able to choose the one that is best for the human. In this paper we focus on choosing the robot and object configuration at which the transfer of the object occurs, i.e. the hand-over configuration. We advocate the incorporation of user preferences in choosing hand-over configurations. We present a user study in which we collect data on human preferences and a human-robot interaction experiment in which we compare hand-over configurations learned from human examples against configurations planned using a kinematic model of the human. We find that the learned configurations are preferred in terms of several criteria, however planned configurations provide better reachability. Additionally, we find that humans prefer hand-overs with default orientations of objects and …", "num_citations": "165\n", "authors": ["1158"]}
{"title": "The phenomenology of conflict in distributed work teams\n", "abstract": " New organizational forms are arising that allow flexibility and speed. One feature of these new organizations is the distributed work group. Teams whose members are distributed in time or space have tremendous potential, yet they also face great challenges. In this chapter, we focus on conflict as one of the keys to effective group process and performance in distributed teams. We define the special hurdles these teams face in managing conflict, specifically focusing on creating a common social identity and managing compositional diversity. We then examine the antecedents to productive conflict management, including the enactment of swift trust, the development of a shared reality and strong team culture, and the belief in team efficacy derived from a highly developed transactive memory system and a strong sense of psychological safety. We end with a consideration of the role of leadership in distributed team dynamics.Conflict, and its resolution, are fundamental to group functioning. Conflict is an awareness by the parties of differences, discrepancies, incompatible wishes, or irreconcilable desires (Boulding 1963). There has been a debate in organizational research regarding whether agreement or disagreement within groups is advantageous (Eisenhardt and Zbaracki 1992). One key to unlocking this complex relationship lies in the differentiation of conflict as either relationship or task related (Crosier and Rose 1977, Guetzkow and Gyr 1954, Jehn 1995, Pinkley 1990, Wall and Nolan 1986). Relationship conflict is an awareness of interpersonal incompatibilities. Relationship conflict often includes personality clashes, animosity, and …", "num_citations": "163\n", "authors": ["1158"]}
{"title": "Human centered systems in the perspective of organizational and social informatics\n", "abstract": " In 1993, the term\" digital libraries\" was popularized when it became the focus of a $24 million research program jointly sponsored by ARPA, NASA, and NSF. Many computer scientists, in fields such as human-computer interaction, artificial intelligence, information retrieval, and information systems, who had not previously been concerned with the design of libraries became keenly interested in this research opportunity. Imaginative entrepreneurial computer scientists and information scientists soon began organizing research conferences on digital libraries, and a new field was soon born.The example of digital libraries is but one example where a coalition of research agencies (or even a single agency) effectively initiates new fields and even names them. In 1997, there were several sustained discussions within the NSF about organizing research around new field labels--\" human centered systems\" and\" knowledge …", "num_citations": "160\n", "authors": ["1158"]}
{"title": "Cooperating with life-like interface agents\n", "abstract": " As computer interfaces can display more life-like qualities such as speech output and personable characters or agents, it becomes important to understand and assess users’ interaction behavior within a social interaction framework rather than only a narrower machine interaction one. We studied how the appearance of a life-like interface agent influenced people’s interaction with it, using a social interaction framework of making and keeping promises to cooperate. Participants played a social dilemma game with a human confederate via realtime video conferencing or with one of three interface agents: a person-like interface agent, a dog-like interface agent, or a cartoon dog interface agent. Technology improvements from a previous version of the human-like interface led to increased cooperation with it; participants made and kept promises to cooperate with the person-like interface agent as much as with the …", "num_citations": "156\n", "authors": ["1158"]}
{"title": "Computers, networks, and work\n", "abstract": " Although the world may be evolving into a global village, most people still lead local lives at work. They spend the majority of their time in one physical location and talk predominantly to their immediate coworkers, clients, and customers. They participate in only a few workplace groups: their primary work group, perhaps a committee or task force, and possibly an informal social group. Some people, however, already experience a far more cosmopolitan future because they work in organizations that have extensive computer networks. Such individuals can communicate with people around the world as easily as they talk with someone in the next office. They can hold involved group discussions about company policy, new product design, hiring plans, or last night's ball game without ever meeting other group members.The networked organization differs from the conventional workplace with respect to both time and space. Computer-based communication is extremely fast in comparison with telephone or postal services, denigrated as\" snail mail\" by electronic mail converts. People can send a message to the other side of the globe in minutes; each message can be directed to one person or to many people. Networks can also essentially make time stand still. Electronic messages can be held indefinitely in computer memory. People can read or reread their messages at any time, copy them, change them, or forward them. Managers are often attracted to networks by the promise of faster communication and greater efficiency. In our view, the real potential of network communication has less to do with such matters than with influencing the overall work …", "num_citations": "155\n", "authors": ["1158"]}
{"title": "Personalization in HRI: A longitudinal field experiment\n", "abstract": " Creating and sustaining rapport between robots and people is critical for successful robotic services. As a first step towards this goal, we explored a personalization strategy with a snack delivery robot. We designed a social robotic snack delivery service, and, for half of the participants, personalized the service based on participants' service usage and interactions with the robot. The service ran for each participant for two months. We evaluated this strategy during a 4-month field experiment. The results show that, as compared with the social service alone, adding personalized service improved rapport, cooperation, and engagement with the robot during service encounters.", "num_citations": "149\n", "authors": ["1158"]}
{"title": "Eliciting information from people with a gendered humanoid robot\n", "abstract": " A conversational robot can take on different personas that have more or less common ground with users. With more common ground, communication is more efficient. We studied this process experimentally. A \"male\" or \"female\" robot queried users about romantic dating norms. We expected users to assume a female robot knows more about dating norms than a male robot. If so, users should describe dating norms efficiently to a female robot but elaborate on these norms to a male robot. Users, especially women discussing norms for women, used more words explaining dating norms to the male robot than to a female robot. We suggest that through simple changes in a robot's persona, we can elicit different levels of information from users-less if the robot's goal is efficient speech, more, if the robot's goal is redundancy, description, explanation, and elaboration.", "num_citations": "149\n", "authors": ["1158"]}
{"title": "The snackbot: documenting the design of a robot for long-term human-robot interaction\n", "abstract": " We present the design of the Snackbot, a robot that will deliver snacks in our university buildings. The robot is intended to provide a useful, continuing service and to serve as a research platform for long-term Human-Robot Interaction. Our design process, which occurred over 24 months, is documented as a contribution for others in HRI who may be developing social robots that offer services. We describe the phases of the design project, and the design decisions and tradeoffs that led to the current version of the robot.", "num_citations": "148\n", "authors": ["1158"]}
{"title": "Privacy attitudes of mechanical turk workers and the us public\n", "abstract": " Amazon Mechanical Turk (MTurk) is a crowdsourcing platform widely used to conduct behavioral research, including studies of online privacy and security. We studied how well the privacy attitudes of MTurk workers mirror the privacy attitudes of the larger user population. We report results from an MTurk survey of attitudes about managing one’s personal information online and policy preferences about anonymity. We compare these attitudes with those of a representative US adult sample drawn from a separate survey a few months earlier. MTurk respondents were younger and better educated, and more likely to use social media than the representative US adult sample. Although they reported a similar amount of personal information online, US MTurk workers put a higher value on anonymity and hiding information, were more likely to do so, had more privacy concerns than the larger US public. Indian MTurk workers were much less concerned than American workers about their privacy and more tolerant of government monitoring. Our analyses show that these findings hold even when controlling for age, education, gender, and social media use. Our findings suggest that privacy studies using MTurk need to account for differences between MTurk samples and the general population.", "num_citations": "144\n", "authors": ["1158"]}
{"title": "Receptionist or information kiosk: how do people talk with a robot?\n", "abstract": " The mental structures that people apply towards other people have been shown to influence the way people cooperate with others. These mental structures or schemas evoke behavioral scripts. In this paper, we explore two different scripts, receptionist and information kiosk, that we propose channeled visitors' interactions with an interactive robot. We analyzed visitors' typed verbal responses to a receptionist robot in a university building. Half of the visitors greeted the robot (eg,\" hello\") prior to interacting with it. Greeting the robot significantly predicted a more social script: more relational conversational strategies such as sociable interaction and politeness, attention to the robot's narrated stories, self-disclosure, and less negative/rude behaviors. The findings suggest people's first words in interaction can predict their schematic orientation to an agent, making it possible to design agents that adapt to individuals during …", "num_citations": "140\n", "authors": ["1158"]}
{"title": "Fostering common ground in human-robot interaction\n", "abstract": " Effective communication between people and interactive robots would benefit if they have a common ground of understanding. I discuss how the common ground principle of least collective effort can be used to predict and design human robot interactions. Social cues lead people to create a mental model of a robot and estimates of its knowledge. People's mental model and knowledge estimate would, in turn, influence the effort they expend to communicate with the robot. People would explain their message in less detail to a knowledgeable robot with which they have more common ground. This process can be leveraged to design interactions that have an appropriate style of robot direction and that accommodate to differences among people.", "num_citations": "140\n", "authors": ["1158"]}
{"title": "Role of forewarning in persuasive communications.\n", "abstract": " Previous studies have shown that a forewarning will nullify the effect of a persuasive communication. This study investigated whether the same information presented after the persuasive communication will have the same effect. 3 groups of experimental Ss were exposed to a communication advocating an extreme point of view; a control group read a neutral communication on a different topic. 2 of the experimental groups were informed of the propagandistic nature of the comunication; one group was forewarned, the other group was\" warned\" after they had read the communication. The 3rd experimental group was given no information about the intent of the communication. The results indicated conclusively that the temporal placement of this information is crucial in determining the effect of a persuasive communication.(PsycINFO Database Record (c) 2016 APA, all rights reserved)", "num_citations": "134\n", "authors": ["1158"]}
{"title": "Using spatial and temporal contrast for fluent robot-human hand-overs\n", "abstract": " For robots to get integrated in daily tasks assisting humans, robot-human interactions will need to reach a level of fluency close to that of human-human interactions. In this paper we address the fluency of robot-human hand-overs. From an observational study with our robot HERB, we identify the key problems with a baseline hand-over action. We find that the failure to convey the intention of handing over causes delays in the transfer, while the lack of an intuitive signal to indicate timing of the hand-over causes early, unsuccessful attempts to take the object. We propose to address these problems with the use of spatial contrast, in the form of distinct hand-over poses, and temporal contrast, in the form of unambiguous transitions to the hand-over pose. We conduct a survey to identify distinct hand-over poses, and determine variables of the pose that have most communicative potential for the intent of handing over. We …", "num_citations": "128\n", "authors": ["1158"]}
{"title": "Mining behavioral economics to design persuasive technology for healthy choices\n", "abstract": " Influence through information and feedback has been one of the main approaches of persuasive technology. We propose another approach based on behavioral economics research on decision-making. This approach involves designing the presentation and timing of choices to encourage people to make self-beneficial decisions. We applied three behavioral economics persuasion techniques-the default option strategy, the planning strategy, and the asymmetric choice strategy-to promote healthy snacking in the workplace. We tested the strategies in three experimental case studies using a human snack deliverer, a robot, and a snack ordering website. The default and the planning strategies were effective, but they worked differently depending on whether the participants had healthy dietary lifestyles or not. We discuss designs for persuasive technologies that apply behavioral economics.", "num_citations": "124\n", "authors": ["1158"]}
{"title": "Computing and change on campus\n", "abstract": " What do computers mean for organizations and for the people in them? Computing and Change on Campus constitutes a fascinating study of the advantages and costs of massive experimentation with new technology. It chronicles the computerization of Carnegie Mellon University, now perhaps the most computer-intensive university in the world. Drawing on the results of an extensive and systematic research program, Sara Kiesler, Lee Sproull, and their colleagues describe how available resources, behavior, and attitudes to computing evolved campus-wide over the period from 1981 to 1985. They examine the impact of computerization on faculty, staff, administrators, and students, and find that the new technology has social consequences-changes in patterns of attention, social contact, norms, and social structure. The authors' conclusions transcend particular computer systems and will be of interest to all educators, managers, and social scientists who care about the social implications of technological change.", "num_citations": "122\n", "authors": ["1158"]}
{"title": "Group heterogeneity increases the risks of large group size: A longitudinal study of productivity in research groups\n", "abstract": " Heterogeneous groups are valuable, but differences among members can weaken group identification. Weak group identification may be especially problematic in larger groups, which, in contrast with smaller groups, require more attention to motivating members and coordinating their tasks. We hypothesized that as groups increase in size, productivity would decrease with greater heterogeneity. We studied the longitudinal productivity of 549 research groups varying in disciplinary heterogeneity, institutional heterogeneity, and size. We examined their publication and citation productivity before their projects started and 5 to 9 years later. Larger groups were more productive than smaller groups, but their marginal productivity declined as their heterogeneity increased, either because their members belonged to more disciplines or to more institutions. These results provide evidence that group heterogeneity moderates …", "num_citations": "119\n", "authors": ["1158"]}
{"title": "The mystery of RSI.\n", "abstract": " A computer-related health epidemic known as repetitive strain injury (RSI) is rampant in Australia and threatens to overwhelm the workers' compensation system. RSI is a label given to a variety of painful, debilitating conditions believed to be caused by repetitive movements of the hands or arms. In Australia, the latest wave of RSI complaints is centered among female office workers who develop symptoms as a result of extensive typing at computer keyboards. In an analysis of this epidemic, we examine the nature of RSI and its known correlates with individual health and personality, ergonomics of computing, and work context. Based on available evidence, we speculate as to the reasons for the emergence of RSI in Australia. We argue that RSI is an extreme illustration of how the social context of work and technological change defines and influences the nature of health problems.(PsycINFO Database Record (c …", "num_citations": "116\n", "authors": ["1158"]}
{"title": "Actuarial prejudice toward women and its implications\n", "abstract": " A process called “actuarial prejudice” is discussed. Actuarial prejudice is a cognitive bias, based on available information about a group from the past and the present, that causes individuals to expect inferior performance from persons who belong to the group. The process, in part, explains why both women and men expect relatively low achievement from women and why women are less likely to achieve than are men. Hypotheses are proposed for future research to test the implications of this process.", "num_citations": "116\n", "authors": ["1158"]}
{"title": "Social transparency in networked information exchange: a theoretical framework\n", "abstract": " An emerging Internet trend is greater social transparency, such as the use of real names in social networking sites, feeds of friends' activities, traces of others' re-use of content, and visualizations of team interactions. Researchers lack a systematic way to conceptualize and evaluate social transparency. The purpose of this paper is to develop a framework for thinking about social transparency. This framework builds upon multiple streams of research, including prior work in CSCW on social translucence, awareness, and visual analytics, to describe three dimensions of online behavior that can be made transparent. Based on the framework, we consider the social inferences transparency supports and introduce a set of research questions about social transparency's implications for computer-supported collaborative work and information exchange.", "num_citations": "115\n", "authors": ["1158"]}
{"title": "The search for a romantic partner: The effects of self-esteem and physical attractiveness on romantic behavior\n", "abstract": " What do people look for in a romantic partner? Observations of everyday life suggest one “common sense” assumption: that people prefer romantic partners who are attractive and socially desirable. Yet if the person himself were truly objective, he would consider what is most practical. That is, what is the probability of a successful outcome for attempts to win various alternative partners? While attainment of a very attractive partner might be very rewarding, the chances of actually “catching” such a person are likely to be somewhat lower than are the chances of winning a less attractive partner. Hence, if one is only moderately or low attractive himself, his most realistic initial choice would be based on both the wish to maximize attractiveness of a partner and the likelihood of positive outcome. This hypothesis, of course, is not new. For example,“exchange theories”(Homans, 1961; Thibaut and Kelley, 1959) assume that people estimate potential “costs” and “rewards” when choosing others.", "num_citations": "111\n", "authors": ["1158"]}
{"title": "Task structure and user attributes as elements of human-robot interaction design\n", "abstract": " Recent developments in humanoid robotics have made possible technologically advanced robots and a vision for their everyday use as assistants in the home and workplace. Nonetheless, little is known about how we should design interactions with humanoid robots. In this paper, we argue that adaptation for user attributes (in particular gender) and task structure (in particular a competitive vs. a cooperative structure) are key design elements. We experimentally demonstrate how these two elements affect the user's social perceptions of ASIMO after playing an interactive video game with him", "num_citations": "107\n", "authors": ["1158"]}
{"title": "Distraction hypothesis in attitude change: Effects of effectiveness\n", "abstract": " A recent study by Festinger and Maccoby (1964) demonstrated that distraction raises the effectiveness of a communication. This effect may obtain because the distraction interferes with (subvocal) counter-arguing or because the distraction requires more effort to listen and thus arouses dissonance. The present experiment was designed to test these alternative hypotheses, Ss were exposed to 4 counter-attitudinal communications. Interference during the communication and credibility of the communicator were orthogonally manipulated. The distraction hypothesis predicted that high interference would increase communication effectiveness most under high credibility of the communicator. The effort hypothesis predicted that the greatest increase due to high interference would obtain when the communicator was low in credibilty. The results supported the distraction hypothesis. In addition, interference reduced …", "num_citations": "106\n", "authors": ["1158"]}
{"title": "My partner is a real dog: Cooperation with social agents\n", "abstract": " We investigated how cooperation with a computer agent was affected by the agent’s pictorial realism, humanlikeness, and likability. Participants played a social dilemma game with a talking computer agent that resembled a person, a dog, or a cartoon dog, or with a confederate interacting through a video link. Participants cooperated highly with the person computer agent and with the confederate. They loved the dog and dog cartoon agents, but (excepting dog owners), significantly less with the dog agents, questionnaire results suggest likability than respect in prompting cooperation agent.", "num_citations": "104\n", "authors": ["1158"]}
{"title": "How a robot should give advice\n", "abstract": " With advances in robotics, robots can give advice and help using natural language. The field of HRI, however, has not yet developed a communication strategy for giving advice effectively. Drawing on literature in politeness and informal speech, we propose options for a robot's help-giving speech-using hedges or discourse markers, both of which can mitigate the commanding tone implied in direct statements of advice. To test these options, we experimentally compared two help-giving strategies depicted in videos of human and robot helpers. We found that when robot and human helpers used a hedge or discourse markers, they seemed more considerate and likeable, and less controlling. The robot that used discourse markers had even more impact than the human helper. The findings suggest that communication strategies derived from speech used when people help each other in natural settings can be …", "num_citations": "103\n", "authors": ["1158"]}
{"title": "Talking, teaching, and learning in network groups: Lessons from research\n", "abstract": " Using empirical research findings, this chapter describes what we know about electronic groups and how electronic groups may change education. Electronic groups are not just long-distance traditional groups. Electronic groups can transform computer and people resources, both for informal and formal learning. Among these changes are qualitative changes in social contacts and group dynamics. A major structural change would be a shift from traditional classroom organization to more group or team centered collaborative learning in education and training. This transformation may benefit many students and educators but also will create new complications, such as the possibility of further centralization of school institutions, of new ‘free’ markets for education, and of changing roles of teachers and students.", "num_citations": "91\n", "authors": ["1158"]}
{"title": "Effects of adaptive robot dialogue on information exchange and social relations\n", "abstract": " Human-robot interaction could be improved by designing robots that engage in adaptive dialogue with users. An adaptive robot could estimate the information needs of individuals and change its dialogue to suit these needs. We test the value of adaptive robot dialogue by experimentally comparing the effects of adaptation versus no adaptation on information exchange and social relations. In Experiment 1, a robot chef adapted to novices by providing detailed explanations of cooking tools; doing so improved information exchange for novice participants but did not influence experts. Experiment 2 added incentives for speed and accuracy and replicated the results from Experiment 1 with respect to information exchange. When the robot's dialogue was adapted for expert knowledge (names of tools rather than explanations), expert participants found the robot to be more effective, more authoritative, and less …", "num_citations": "88\n", "authors": ["1158"]}
{"title": "Couples who choose to remain childless\n", "abstract": " MethodLawrence, Kansas, the site of this study, is a university city of about 50,000. It is surrounded by farms, but is just an hour's drive to Kansas City. In 1975, approximately 100 couples living in the vicinity responded by telephone to a series of classified advertisements solicit-Linda Silka is a graduate student and National Institute of Mental Health trainee in social psychology at the University of Kansas. Sara Kiesler is currently on leave from the university, where she is Professor of Psychology and of Communication, to work on the staff of the National Academy of Sciences/National Research Council (NAS/NRC). The authors note that this article represents their own research, and is not connected with the work of the NAS/NRC.", "num_citations": "88\n", "authors": ["1158"]}
{"title": "Ripple effects of an embedded social agent: a field study of a social robot in the workplace\n", "abstract": " Prior research has investigated the effect of interactive social agents presented on computer screens or embodied in robots. Much of this research has been pursued in labs and brief field studies. Comparatively little is known about social agents embedded in the workplace, where employees have repeated interactions with the agent, alone and with others. We designed a social robot snack delivery service for a workplace, and evaluated the service over four months allowing each employee to use it for two months. We report on how employees responded to the robot and the service over repeated encounters. Employees attached different social roles to the robot beyond a delivery person as they incorporated the robot's visit into their workplace routines. Beyond one-on-one interaction, the robot created a ripple effect in the workplace, triggering new behaviors among employees, including politeness, protection of …", "num_citations": "87\n", "authors": ["1158"]}
{"title": "My pet rock and me: An experimental exploration of the self extension concept\n", "abstract": " We examine Belk’s (1988) construct of self extension experimentally. Participants were given a small rock and randomly assigned to design the rock for themselves or to sell. The participants who designed the rock for themselves were more likely than sellers to say the rock symbolized themselves. Participants whose rock symbolized themselves rated its personality more similarly to their ratings of themselves than did other participants, and were less agreeable to making their rock into a product line of pet rocks. We explore process explanations for our results.", "num_citations": "87\n", "authors": ["1158"]}
{"title": "The effect of commitment to future interaction on reactions to norm violations1\n", "abstract": " Social norms are important, m part, because they prevent harmful or anarchic social mtercourse, enable persons to agree on a common definition of the social situabon (see Goffman, 1959), and lower the cost of social exchange (Thibaut & Kelley, 1959). It follows, then, that those who violate social norms will be negabvely evaluated (eg, S. Kiesler, 1966) But one's covert evaluabon and overt treatment of an mappropnate other depend on a number of situabonal vanables, including the expectabon of future mteracbon with the other. There is akeady considerable evidence that strong anticipabon of future mteracbon with others profoundly affects social attitudes and behavior (eg., Kiesler, Zanna, & De Salvo, 1966) C. Kiesler (m press) has argued that commitment to future mteracbon makes certam responses to others more difficult, and, therefore, less probable. Certam alternative reacbons to a person who acts …", "num_citations": "81\n", "authors": ["1158"]}
{"title": "Connected giving: Ordinary people coordinating disaster relief on the Internet\n", "abstract": " The Internet is widely valued for distributing control over information to a lateral network of individuals, but it is not clear how these networks can most effectively organize themselves. This paper describes the distributed networks of volunteers that emerged online following Hurricane Katrina. Online communities responded to the disaster by facilitating the distribution of donated goods from ordinary people directly to hurricane survivors. These \"connected giving\" groups faced several challenges: establishing authority within the group, providing relevant information, developing trust in one another, and sustaining the group over time. Two forms of computer-mediated connected giving were observed: small blog communities and large forums. Small blog communities used a centralized authority structure that was more immediately successful in managing information and developing trust, but over time, blog …", "num_citations": "79\n", "authors": ["1158"]}
{"title": "Improving the match between callers and receivers: A study on the effect of contextual information on cell phone interruptions\n", "abstract": " A problem with the location-free nature of cell phones is that callers have difficulty predicting receivers' states, leading to inappropriate calls. One promising solution involves helping callers decide when to interrupt by providing them contextual information about receivers. We tested the effectiveness of different kinds of contextual information by measuring the degree of agreement between receivers' desires and callers' decisions. In a simulation, five groups of participants played the role of ‘Callers’, choosing between making calls or leaving messages, and a sixth group played the role of ‘Receivers’, choosing between receiving calls or receiving messages. Callers were provided different contextual information about Receivers' locations, their cell phones' ringer state, the presence of others, or no information at all. Callers provided with contextual information made significantly more accurate decisions than those …", "num_citations": "76\n", "authors": ["1158"]}
{"title": "A robotically-augmented walker for older adults\n", "abstract": " Many older adults use walkers to improve their stability and safety while walking. We have developed a robotically augmented walker to reduce fall risk and confusion, and to increase walker convenience and enjoyment. Using a modified version of the CARMEN navigation software suite [11], the walker is capable of parking itself and returning to the user when signaled by remote control. The system also supports navigation in large indoor environments by providing simple directions to target locations such as a cafeteria. The walker received positive reviews during informal testing with residents of a Pennsylvania residence facility for older adults.This research is sponsored by the National Science Foundation under the ITR Program, which is gratefully acknowledged. The views and concussions contained in this document are those of the authors and should not be interpreted as necessarily representing official policies of endorsements, either expressed or implied, of the United States Government of the National Science Foundation.", "num_citations": "76\n", "authors": ["1158"]}
{"title": "“Social” human-computer interaction\n", "abstract": " “Social” human-computer interaction | Human values and the design of computer technology ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleBooksHuman values and the design of computer technology“Social” human-computer interaction chapter “Social” human-computer interaction Share on Authors: S Kiesler profile image Sara Kiesler View Profile , Lee S Sproull profile image Lee Sproull View Profile Authors Info & Affiliations Publication: Human values and the design of computer technologyDecember 1997 Pages 191–199 9citation 0 Downloads Metrics Total Citations9 Total Downloads0 Last 12 Months0 Last 6 weeks0 Get …", "num_citations": "74\n", "authors": ["1158"]}
{"title": "Do visualizations improve synchronous remote collaboration?\n", "abstract": " Information visualizations can improve collaborative problem solving, but this improvement may depend on whether visualizations promote communication. In an experiment on the effect of network visualizations, remote pairs worked synchronously to identify a serial killer. They discussed disparate evidence distributed across the pair using IM. Four conditions, respectively, offered (a) spreadsheet only (controls),(b) individual unshared visualizations,(c) view-only shared visualizations, and (d) a full-access shared visualization of all evidence. We examined collaborative performance, use of the visualization tool, and communication as a function of condition. All visualization conditions improved remote collaborators' performance over the control condition. Full access to a shared visualization best facilitated remote collaboration by encouraging tool use and fostering discussion between the partners. Shared …", "num_citations": "66\n", "authors": ["1158"]}
{"title": "Introduction to the special guest-edited issue on scientific collaboration\n", "abstract": " Derek J. de Solla Price was the first to notice that scientific collaboration ‘has been increasing steadily and ever more rapidly since the beginning of the [20th] century’, a process he deemed ‘one of the most violent transitions that can be measured in recent trends of scientific manpower and literature’, surmising that ‘if it continues at the present rate, by 1980 the single-author paper will be extinct’(1963: 77, 79). The consequences he saw were more extensive and enduring than a mere shift in the work habits of scientists:We tend now to communicate person to person instead of paper to paper. In the most active areas we diffuse knowledge through collaboration. Through select groups we seek prestige and the recognition of ourselves by our peers as approved and worthy collaborating colleagues. We publish for the small group, forcing the pace as fast as it will go in a process that will force it harder yet. Only …", "num_citations": "66\n", "authors": ["1158"]}
{"title": "The effect of perceived role requirements on reactions to favor-doing\n", "abstract": " The hypothesis of the present study was that when performing favors is in accord with role requirements attraction will be greater than when it is not, and that when withholding favors is in accord with role requirements, attraction will be greater than when it is not. To test this hypothesis, an experiment examined the effects on attraction to another person of one magnitude of favor (sharing of money), committed or omitted, and in accord, or not, with perceived role requirements (cooperation or competition). Pairs of subjects participated in a word game, under either a cooperative or competitive set. Each subject perceived that his partner won most of the money. Partners then either shared or did not share their winnings with the subject. In general, it was found that appropriate favors and nonfavors resulted in greater attraction than did inappropriate favors and nonfavors. Thus, partners who shared in the cooperation …", "num_citations": "65\n", "authors": ["1158"]}
{"title": "Outsiders on the inside: Sharing know-how across space and time\n", "abstract": " This study examined how employees of a global corporation sought out technical information from employees distant from them. Data were drawn from the contents and access records of two computer-based employee message archives: the peer archive, which contained questions and answers exchanged over a company-wide electronic mailing list by ordinary employees and the expert archive, which contained questions from employees and answers from designated experts. We predicted that archive accesses by employees would increase with their geographic distance from engineering headquarters and that accesses would increase to the extent that the archive contained know-how information. Content analysis demonstrated that the peer exchanges were more informal and more personal, and were more likely to contain specific references to the company's products, tools, and customers, all indicators of know-how information. Analyses of use showed that workers accessed the peer archive more than they did the expert archive; this difference increased with greater geographic distance from engineering headquarters. The results suggest that know-how archives can be useful in connecting distant employees seeking and providing technical information across space and time.Organizations are focused on improving access to and use of organizational knowledge—both\" know-what\" and\" know-how\"(Brown and Duguid 1998). Knowwhat is explicit rules and principles. Know-how is the ability to put know-what into practice. For example, a help line operator may understand general principles of computer operating systems, but this …", "num_citations": "64\n", "authors": ["1158"]}
{"title": "Parent-driven use of wearable cameras for autism support: a field study with families\n", "abstract": " Recorded images of children's activities can be useful to caregivers and clinicians who need behavioral evidence to support children with autism. However, image capture systems for autism are typically complex and provide only a top-down, outsider's view. In this work, we assessed the use of cameras worn by children to record the context of their activities and interactions from their perspective. We used a technology probe to explore how this simple, parent-driven system could be designed for families to adopt in their homes. We present the results of a five-week field study with five families. The system helped parents to (1) see the world from their child's eyes,(2) increase their understanding of their child's needs when their child is uncommunicative, and (3) help them encourage their child's social engagement. We discuss how these systems can be designed and used to their full potential.", "num_citations": "61\n", "authors": ["1158"]}
{"title": "Personalization revisited: a reflective approach helps people better personalize health services and motivates them to increase physical activity\n", "abstract": " Current approaches to personalization either presuppose people's needs and automatically tailor services or provide formulaic options for people to customize. We propose a complementary approach to personalization: a reflective strategy that helps people realize what matters to them and enables them to better personalize services themselves. To design this strategy, we first studied the practices of eight personal health service providers. We then tested the strategy's efficacy by building a Fitbit Plan website that encouraged Fitbit users to customize a plan or accept an automatically tailored plan. For one group of users, the website used the reflective strategy to assist in the plan setup process. A two-week between-subjects field experiment showed that the reflective strategy helped motivate users to carry out their plans, increasing their average daily steps by 2,425 steps. Without the reflective strategy, users either …", "num_citations": "60\n", "authors": ["1158"]}
{"title": "XIA: Architecting a more trustworthy and evolvable Internet\n", "abstract": " Motivated by limitations in today's host-centric IP network, recent studies have proposed clean-slate network architectures centered around alternate first-class principals, such as content, services, or users. However, muchlike the host-centric IP design, elevating one principal type above others hinders communication between other principals and inhibits the network's capability to evolve. This paper presents the eXpressive Internet Architecture (XIA), an architecture with native support for multiple principals and the ability to evolve its functionality to accommodate new, as yet unforeseen, principals over time. We present the results of our ongoing research motivated by and building on the XIA architecture, ranging from topics at the physical level (``how fast can XIA go'') up through to the user level.", "num_citations": "60\n", "authors": ["1158"]}
{"title": "Perceptions of ASIMO: an exploration on co-operation and competition with humans and humanoid robots\n", "abstract": " Recent developments in humanoid robotics have made possible a vision of robots in everyday use in the home and workplace. However, little is known about how we should design social interactions with humanoid robots. We explored how co-operation versus competition in a game shaped people's perceptions of ASIMO. We found that in the co-operative interaction, people found the robot more sociable and more intellectual than in the competitive interaction while people felt more positive and were more involved in the task in the competitive condition than in the co-operative condition. Our poster presents these findings with the supporting theoretical background.", "num_citations": "60\n", "authors": ["1158"]}
{"title": "Competing online viewpoints and models of chronic illness\n", "abstract": " People with chronic health problems use online resources to understand and manage their condition, but many such resources can present competing and confusing viewpoints. We surveyed and interviewed with people experiencing prolonged symptoms after a Lyme disease diagnosis. We explore how competing viewpoints in online content affect participants' understanding of their disease. Our results illustrate how chronically ill people search for information and support, and work to help others over time. Participant identity and beliefs about their illness evolved, and this led many to take on new roles, creating content and advising others who were sick. What we learned about online content creation suggests a need for designs that support this journey and engage with complex issues surrounding online health resources.", "num_citations": "59\n", "authors": ["1158"]}
{"title": "Understanding users! perception of privacy in human-robot interaction\n", "abstract": " Previous research has shown that design features that support privacy are essential for new technologies looking to gain widespread adoption. As such, privacy-sensitive design will be important for the adoption of social robots, as they could introduce new types of privacy risks to users. In this paper, we report findings from our preliminary study on users' perceptions and attitudes toward privacy in human-robot interaction, based on interviews that we conducted about a workplace social robot.", "num_citations": "56\n", "authors": ["1158"]}
{"title": "Effects of instant messaging on the management of multiple project trajectories\n", "abstract": " We present a study of the effects of instant messaging (IM) on individuals' management of work across multiple collaborative projects. Groups of four participants completed four web design tasks. Each participant worked on two tasks, each task with a different partner who was either co-located or remote, connected via IM. In one condition, each participant had one co-located and one remote partner. In a second condition, both partners were remote. We examined communication, division of labor, and task performance as a function of condition. The results indicated that nearly all participants divided their time unequally between projects, but less unequally in the remote/remote condition. In the co-located/remote condition, participants favored the task with the co-located partner. The results show that the effects of IM differ depending on people's multiple tasks are distributed across space. We propose a new IM …", "num_citations": "53\n", "authors": ["1158"]}
{"title": "Project view IM: a tool for juggling multiple projects and teams\n", "abstract": " Previous research suggests working on multiple projects may lead to stress and misallocation of attention. A modest redesign of Instant Messenger (IM) could help team members juggle multiple projects and teams. This paper describes the implementation of this redesign--an IM plug-in called Project View IM (PVIM). PVIM uses automatic project status logging to show active project-related files and team members. In a preliminary evaluation experiment, participants working collaboratively with different partners on two projects found PVIM and IM to be equally usable and informative but PVIM participants reported less workload stress. We discuss future work to iterate the design and measure allocation of attention and task performance.", "num_citations": "49\n", "authors": ["1158"]}
{"title": "Two‐level perspective on electronic mail in organizations\n", "abstract": " Organizational computing tools are often developed and managed with an eye toward increasing efficiency. Yet today's most widespread organizational computing tool, electronic mail, has an impact that goes well beyond efficiency effects. This article summarizes a two‐level perspective on organizational computing and reviews research results demonstrating strong organizational effects of electronic mail. From these results, we draw some lessons for the next generation of organizational computing.", "num_citations": "46\n", "authors": ["1158"]}
{"title": "Supporting coordination in surgical suites: Physical aspects of common information spaces\n", "abstract": " To accommodate frequent emergencies, interruptions, and delays, hospital staff continually make and coordinate changes to the surgery schedule. The technical and social aspects of coordination in surgical suites have been described by prior studies. This paper addresses an understudied aspect of coordination: the physical environment. Based on a field study of four surgical suites in two large academic centers, we show how the physical layout of hallways and rooms, and barriers and spaces around displays and key coordinators, support or fail to support the common information spaces used for coordination. We use the concept\" information hotspots\" to represent how physical places and their characteristics facilitate coordination. We developed design principles based on the concept of information hotspots that should guide architectural considerations for coordination in dynamic environments such as hospitals.", "num_citations": "45\n", "authors": ["1158"]}
{"title": "Organization theory and the changing nature of science\n", "abstract": " Dramatic changes in the practice of scientific research over the past half century, including trends towards working in teams and on large projects, as well as geographically distributed and interdisciplinary collaboration, have created opportunities and challenges for scientists. Some of the newer ways of doing science create opportunities and challenges for organization theory. We describe how applying organization theory to science can enhance our knowledge of research organizations and raise questions for theories of coordination, social identity, the knowledge-based view of the firm, social networks, organizational learning, and absorptive capacity. We argue that an organizational perspective on science is critical to understanding the sources of technological innovation, making national policy on R&D investment, and designing successful 21st-century research organizations.", "num_citations": "43\n", "authors": ["1158"]}
{"title": "Coordination and success in multidisciplinary scientific collaborations\n", "abstract": " The research enterprise increasingly involves multidisciplinary collaboration, sometimes over geographic distance. Technological advances have made these collaborations possible, and the history of past innovations suggests these collaborations are desirable. Yet multidisciplinary projects can carry high coordination costs. This study investigated how collaborations address disciplinary differences and geographic dispersion to coordinate people and tasks to achieve success. We conducted an inductive study of 62 scientific collaborations supported by a program of the US National Science Foundation in 1998 and 1999. Projects with principal investigators in more disciplines did not appear to suffer more coordination losses and reported as many positive outcomes as did projects involving fewer disciplines. By contrast, geographic dispersion, rather than multidisciplinarity, was most problematic. Dispersed …", "num_citations": "42\n", "authors": ["1158"]}
{"title": "Calling while driving: effects of providing remote traffic context\n", "abstract": " Cell phone conversations distract drivers. This research explores the possibility of reducing distracting by providing callers with remote information about the driver's traffic. We asked whether providing such contextual information would change the caller's conversation such that drivers would be less distracted. In Experiment 1 we examined this question in a low-fidelity driving simulator; in Experiment 2 we examined this question in a higher fidelity simulator. In both experiments, remote callers and passengers were distracting. Providing traffic information to the remote caller significantly reduced crashes in the low fidelity tests and significantly reduced passing in the high fidelity tests, compared with the control conditions. We consider the implications for development of remote displays or signals to promote driving safety.", "num_citations": "40\n", "authors": ["1158"]}
{"title": "Why do they still use paper? Understanding data collection and use in Autism education\n", "abstract": " Autism education programs for children collect and use large amounts of behavioral data on each student. Staff use paper almost exclusively to collect these data, despite significant problems they face in tracking student data in situ, filling out data sheets and graphs on a daily basis, and using the sheets in collaborative decision making. We conducted fieldwork to understand data collection and use in the domain of autism education to explain why current technology had not met staff needs. We found that data needs are complex and unstandardized, immediate demands of the job interfere with staff ability to collect in situ data, and existing technology for data collection is inadequate. We also identified opportunities for technology to improve sharing and use of data. We found that data sheets are idiosyncratic and not useful without human mediation; improved communication with parents could benefit children's …", "num_citations": "39\n", "authors": ["1158"]}
{"title": "Life-span extension\n", "abstract": " The subject of life-span extension is usually associated with a specialized field of study on developing means to lengthen the life-span beyond what might be considered normal. This objective contrasts with that of most other fields of the health-related sciences, in which the objective is the development of means so that more people can enjoy a normal life-span in better health. Both objectives, however, involve the maintenance or improvement of human health, the basic difference being that extension of the normal period of health is usually involved in efforts to reduce the more global effects of the aging process. More specifically, life-span extension research is aimed toward a more uniform extension or maintenance of good health and vigor, whereas other approaches not normally regarded as life-span extension research are aimed toward the cure or prevention of specific, more localized types of diseases or dysfunctions.The aim of life-span extension research is not simply to enable persons to live older longer but to learn how general good health can be maintained for a longer-than-normal period of time. An individual may not necessarily have a longer-than-normal life-span as a consequence of having a more uniform and healthy life, but it is generally believed that a longer life-span would frequently be the outcome of a prolonged period", "num_citations": "39\n", "authors": ["1158"]}
{"title": "Perceptual effects of damped and exaggerated facial motion in animated characters\n", "abstract": " Common guidelines followed in the animation community include the idea that cartoon characters should be exaggerated to better convey emotion and intent, whereas more realistic characters should have “matching” realistic motion. We investigated the effects of rendering style and amount of facial motion on perceptions of character likeability, intelligence, and extraversion. We used cartoon and more realistic-looking characters that were animated with tracked actor motion. The motion was exaggerated and damped in 10% increments up to a 40% difference from the original motion. We discovered that motion changes ±20% from original motion affected perceptions of likeability and intelligence differently in the realistic-looking and cartoon characters. The realistic-looking characters benefited from increased motion whereas the cartoon characters benefitted from damped motion. Furthermore, the amount of facial …", "num_citations": "38\n", "authors": ["1158"]}
{"title": "Increasing Personal Connections.\n", "abstract": " Not everyone can be the boss, have a big office, make important decisions, be the center of attention. Many employees are geographically and hierarchically distant from the center of things. Whenever an organization has more than two people in it, someone will be out of the center. The larger the organization, the greater the number and proportion of peripheral employees.\" Peripheral,\" however, does not mean unimportant. Peripheral employees in the commercial and service sectors are the first, and often the only, contact that customers have with an organization. Their behavior can make the difference between keeping customers or clients and losing them. Peripheral employees in manufacturing and construction perform and inspect the actual production work. Their behavior can make the difference between acceptable and unacceptable product quality. Yet peripheral workers pose problems for organizations. They may not know what's going on—an information problem—and they may not care—a motivation problem.Advertisements that encourage us to\" reach out and touch someone\" reflect the belief that we strengthen relationships when we communicate with others. Every relationship is both informational and emotional. All other things being equal, the more you talk with someone, the more you learn from that person (and vice versa). Additionally, the more you talk with someone, the more you like and feel committed to that person (and vice versa). 1 Participation through communication is an old principle of management. It has recently revived in the United States as managers look", "num_citations": "38\n", "authors": ["1158"]}
{"title": "Coordination as linkage: The case of software development teams\n", "abstract": " This chapter examines coordination in software development teams as a practical context for talking about the linkages between individual and group productivity. We do not discuss individual-organizational nor group-organizational linkages, although many of the points we make pertain to those linkages as well.Software development is a kind of technical work found in many organizations: the technical team project. Certain technical tasks transcend the ongoing functions of departments or the capabilities of individuals, and thus organizations create a project group or team to do the work. A software development project group can have two to several hundred members. Membership is typically diverse; the work may require the participation of programmers, software engineers, applications experts, researchers, requirements analysts, software testers, documentation writers, project managers, customer support personnel, and perhaps others. Project members may be drawn from different locations and different departments and may even work on the project in different places. The projects have predictable stages but also experience unpredictable changes in the organizational and technical environment—changes in personnel, modifications in available software and hardware technology, changing client expectations, and new economic constraints (Brooks, 1987).", "num_citations": "36\n", "authors": ["1158"]}
{"title": "A technology probe of wearable in-home computer-assisted physical therapy\n", "abstract": " Physical therapists could make better treatment decisions if they had accurate patient home exercise data but today this information is only available from patient self-report. A more accurate source of data could be gained from wearable computing designed for physical therapy exercise support. Existing systems have been tested in the lab but we have little information about issues they may face in home settings. We designed a technology probe, SenseCap, and deployed it for seven days in ten physical therapy patients' homes. SenseCap is a wearable physical therapy support system that gathers patient exercise compliance and performance data and summarizes the data in charts on an iPad Dashboard for physical therapists to view when patients return to the clinic. In this paper, we present the results of our deployment, show in-home patient exercise data gathered by the probe, and make design …", "num_citations": "35\n", "authors": ["1158"]}
{"title": "Aging--stability and Change in the Family\n", "abstract": " Aging--stability and change in the family FAO_logo home-icon English Español Français العربية 中文 Русский home-icon Translate with Google Access the full text NOT AVAILABLE Lookup at Google Scholar google-logo Bibliographic information Language : English Type : Bibliography In AGRIS since : 2013 Start Page : : ill. ; 24 cm. Publisher : Academic Press ISBN : family \" Save as: AGRIS_AP RIS EndNote(XML) Aging--stability and change in the family Loading... Paper Written Paper Aging--stability and change in the family [1981] Fogel, Robert W. March, James G. Access the full text NOT AVAILABLE Lookup at Google Scholar google-logo Access the full text NOT AVAILABLE Lookup at Google Scholar google-logo Loading... Bibliographic information Language : English Type : Bibliography In AGRIS since : 2013 Start …", "num_citations": "34\n", "authors": ["1158"]}
{"title": "A generalized framework for solving tightly-coupled multirobot planning problems\n", "abstract": " In this paper, we present the generalized version of the Hoplites coordination framework designed to efficiently solve complex, tightly-coupled multirobot planning problems. Our extensions greatly increase the flexibility with which teammates can both plan and coordinate with each other; consequently, we can apply Hoplites to a wider range of domains and plan coordination between robots more efficiently. We apply our framework to the constrained exploration domain and compare Hoplites in simulation to competing distributed and centralized approaches. Our results demonstrate that Hoplites significantly outperforms both approaches in terms of the quality of solutions produced while remaining computationally competitive with much simpler approaches. We further demonstrate features such as scalability and validate our approach with field results from a team of large autonomous vehicles performing …", "num_citations": "33\n", "authors": ["1158"]}
{"title": "Preference for predictability or unpredictability as a mediator of reactions to norm violations.\n", "abstract": " Hypothesized that, if norms function to insure predictable interaction, people who violate norms may be disliked because they appear to be unpredictable. Norm violators would lose esteem to the extent that persons interacting with them prefer predictability in the situation. However, if situational demands induce participants to prefer unpredictability, norm violators should be liked more than those who act appropriately. 2 experiments were conducted with 229 high school students and 126 female undergraduates, respectively. Ss' preference for predictability or unpredictability and the appropriateness of a stimulus person's behavior were independently manipulated. A significant interaction supporting the hypothesis was obtained in both studies; under conditions designed to arouse the need for unpredictability in others, inappropriate stimulus persons were liked better than appropriate ones.(PsycINFO Database …", "num_citations": "33\n", "authors": ["1158"]}
{"title": "Introduction to the special issue: Online communities\n", "abstract": " The Internet has impelled scholars to expand their views of organization. In 2005, Organization Studies called for papers about online communities that would stretch the field of organization studies. The articles in this special issue use empirical research and theory to re-examine fundamental questions of organizational boundaries, community, and member motivation.", "num_citations": "32\n", "authors": ["1158"]}
{"title": "Designing for collaborative reflection\n", "abstract": " A significant problem with electronic health records (EHRs) has been their failure to fit into existing workflows because they do not support informal documentation and communication. We used qualitative fieldwork and participatory design to investigate how EHRs could be designed to meet these needs. The contributions of this work are twofold: we identified and described the informal processes of documentation and communication that we refer to as collaborative reflection, and then developed design recommendations for EHRs to support these existing workflows. We studied treatment teams providing behavioral and mental health services as part of integrated school programs for children with special needs. To make ongoing treatment decisions, team members document progress daily and communicate frequently with one another. Based on our fieldwork findings, we describe this process of collaborative …", "num_citations": "31\n", "authors": ["1158"]}
{"title": "Relationship effects in psychological explanations of nonhuman behavior\n", "abstract": " Research suggests that close relationships with animals encourage psychological explanations of their behavior. To determine the causal effect of ownership on psychological explanations, we conducted experiments in which we manipulated participants' ownership of a target imagined dog (experiment 1), animated object (experiment 2), and real pet fish (experiment 3). Adapting scales used in previous research, we obtained ratings of how intentional the target's behavior was, the target's reasons (rather than causes), and references to complex human-like emotions, motives or characteristics. In experiment 1, 26 volunteers and staff at an animal shelter imagined scenarios involving their dog, a neighbor's dog, their friend, or a visitor. Participants' intentionality ratings and the target's reasons were similar for a friend, a visitor, and their dog. In experiment 2, 36 participants watched a film of three moving objects. Half …", "num_citations": "30\n", "authors": ["1158"]}
{"title": "Aging, social change\n", "abstract": " Scholars from social and behavioral sciences pose researchable questions and testable hypotheses regarding older people from the perspective of data and theory in their own disciplines. They discuss public policy and aging; the impact of business, government and social institutions on the elderly; and the personal resources and living conditions of the old.", "num_citations": "30\n", "authors": ["1158"]}
{"title": "Research team integration: What it is and why it matters\n", "abstract": " Science policy across the world emphasizes the desirability of research teams that can integrate diverse perspectives and expertise into new knowledge, methods, and products. However, integration in research work is not well understood. Based on retrospective interviews with 55 researchers from 52 diverse research projects, we categorized teams as co-acting (50%), coordinated (15%), and integrated (35%). Integration, when it existed, usually began when PIs chose collaborators and pursued integration throughout the project. We describe researchers' experiences and research climates that discouraged or encouraged integration. Implications for policy choices and design include changes in team structuring and technology support.", "num_citations": "29\n", "authors": ["1158"]}
{"title": "In-car cell phone use: mitigating risk by signaling remote callers\n", "abstract": " Research has linked in-car cell phone use with automobile accidents. We explore a signaling method that could mitigate that risk. We show in a first experiment how remote cell phone callers were induced to speak less during critical driving periods, and, in a second experiment, how driving performance in a simulator improved when callers reduced conversation levels during critical driving periods.", "num_citations": "28\n", "authors": ["1158"]}
{"title": "Fishing for sustainability: the effects of indirect and direct persuasion\n", "abstract": " Websites and technologies that promote sustainable behavior often employ direct persuasion by being open about persuasive intent. We examined the use of indirect persuasion, methods that do not make persuasive intent clear. We built two variants of a recipe website designed to induce changes in users: one using direct persuasion and the other using indirect methods. We measured the effects of each site on users' attitudes and actions towards the environment. Preliminary results show that the direct style influenced actions while the indirect style influenced attitudes. We discuss the implications of this dissociation for research and applications.", "num_citations": "26\n", "authors": ["1158"]}
{"title": "Electronic brainstorming: Science meets technology in the group meeting room\n", "abstract": " A student learning a well-developed technology, such as the design of airframes, steam turbines, or buildings, is generally first taught the relevant theory or science (aerodynamics, thermodynamics, theory of structures), and then goes on to the application of this knowledge in practice. Because technologists typically leam little of the history of their professions, stu dents probably assume that the sequence of teaching mirrors the sequence of discovery-that the development of aerodynamics preceded and led to the development of workable planes, or that knowledge of thermodynam ics drove the design of steam engines. Such an assumption is, in fact, quite wrong for these two technologies, and probably for many others. Successful practice and successful theory intertwine and stimulate one another in", "num_citations": "26\n", "authors": ["1158"]}
{"title": "Individual and society: Sociological social psychology\n", "abstract": " Unlike other texts for undergraduate sociological social psychology courses, this text presents the three distinct traditions in sociological social psychology—symbolic interactionism, social structure and personality, and group processes and structures—and emphasizes the different theoretical frameworks within which social psychological analyses are conducted within each research tradition. With this approach, the authors make clear the link between sociological social psychology, theory, and methodology. Students will gain a better understanding of how and why social psychologists trained in sociology ask particular kinds of questions; the types of research they are involved in; and how their findings have been, or can be, applied to contemporary societal patterns and problems.", "num_citations": "25\n", "authors": ["1158"]}
{"title": "How text and audio chat change the online video experience\n", "abstract": " Many online video sites provide a text chat feature so viewers can chat with others while watching videos. How does chatting affect their experience? Would audio chat be more fun or would it be too distracting? The richer medium of audio may more closely approximate the living room or club experience, but human factors research suggests that audio chat could increase distraction and detract from the viewing experience. This paper presents the results of an experiment comparing text with audio chat when the video does or does not have dialogue, and when viewers are watching the videos in the same or a different order. A control group watched videos without chat. Overall, audio chat and text chat were equally distracting, and chat was more distracting when the video contained dialogue. Despite the presence of distraction, viewers found both text and audio chat enjoyable. Those who used audio chat …", "num_citations": "24\n", "authors": ["1158"]}
{"title": "Post hoc justification of family size\n", "abstract": " Currently popular approaches to fertility and family size research stress the effect of attitudes, values and motives on fertility-related decisions and actions. In contrast, the effects of decisions and actions in this aspect of life are accorded little attention. Two natural experiments were performed to show one such effect: the post hoc justification of family size intentions and completion. In the first study, women were shown to favor their own family size over others and their relatively positive attitudes were stronger after their family was complete. Justification was also greater for more than two children, and when the costs of children were greater because one required special care and education. In the second study, women whose families had recently experienced an involuntary misfortune (medical or financial), justified their chosen family size more than did women not having a misfortune. All of these findings were …", "num_citations": "24\n", "authors": ["1158"]}
{"title": "Working Together Apart.\n", "abstract": " Collaboration between professions or disciplines or across distances is discussed. A definition of collaboration is offered, processes and factors making collaboration difficult are identified, and two features of networked communication (access equalization and social equalization) that are important to collaboration are examined.(Author/MSE)", "num_citations": "23\n", "authors": ["1158"]}
{"title": "Making connections: Computers can enhance employee commitment—at a cost\n", "abstract": " Imagine a multinational organization in which employees from twelve different countries talk with each other on a daily basis about their experiences in manuhcturing or selling their company's products. In this same organization, human resources professionals from eight different countries talk daily about work and fimily issues. Employees from six countries trade movie reviews and recipes and jokes. Almost none of these employees would recognize any of the others if they were in the same room, yet they all feel a sense of camaraderie and commitment to one another. New computer-based communication technology is making this imaginary scenario real, and human resources professionals need to understand its implications.When networks connect computers together, either locally or across long distances, people can also be connected. Using computerbased communications software such as electronic mail or computer conferencing on these networked computers, people can send messages to one another and participate in group discussions independent of geography. Some organizations are already making extensive use of this technology so that all or most employees have an electronic mailbox and send and receive messages on a daily basis. It is quite common in well-established electronic mail communities for people to send and receive between 25 and 100 messages a day. Electronic mail uses word-processing and communications software to provide a high-speed message-exchange service. The salient features of this technology are:", "num_citations": "23\n", "authors": ["1158"]}
{"title": "Co-worker transparency in a microtask marketplace\n", "abstract": " Workers in microtask work environments such as Mechanical Turk typically do not know if or how they fit into a workflow. The research question we posed here was whether displaying information about the number of other workers doing the same task would motivate better or poorer work quality. In experiment 1, we varied the information about co-workers presented to the worker and the number of his or her co-workers:\" you\" or\" you alone\" are doing a task, or\" you\" plus 5, 15, or 50 co-workers. We compared these conditions with a no-social information control. In experiment 2, we crossed the number of co-workers (5 vs. 50) with the type of incentive (individual or group). Results show that visual presentations of co-workers changed workers' perceptions of co-workers, and that the more co-workers participants perceived, the lower their work quality. We suggest future work to determine the kinds of co-worker …", "num_citations": "22\n", "authors": ["1158"]}
{"title": "Negotiation and conflict in large scale collaboration: a preliminary field study\n", "abstract": " Coordinating activities in many settings can require people to manage conflict, potential and actual. Conflict arises from resource limitations, high-stakes consequences, uncertainty, goal conflict among stakeholders and hierarchical organizational structures. To understand coordination in such systems, we conducted a field study of management of surgical operating rooms. While coordinating interdependencies, such as progress monitoring, scheduling and rescheduling, and prodding, coordinators managed a set of complicated conflicts. They did so opportunistically, to resolve and to prevent conflict. Additionally, coordinators were concerned with perceived fairness. These findings indicate that, in the design of ICT to support coordination, we should examine not only the mechanical articulation of activities and efficient prioritization of resources, but also means to support companion social processes.", "num_citations": "22\n", "authors": ["1158"]}
{"title": "Exploring adaptive dialogue based on a robot's awareness of human gaze and task progress\n", "abstract": " When a robot provides direction--as a guide, an assistant, or as an instructor--the robot may have to interact with people of different backgrounds and skill sets. Different people require informat on adapted to their level of understanding. In this paper, we explore the use of two simple forms of awareness that a robot might use to infer that a person needs further verbal elaboration during a tool select on task. First, the robot could use an eye tracker for inferring whether the person is looking at the robot and thus in need of further elaboration. Second, the robot could monitor delays in the individual's task progress, indicating that he or she could use further elaboration. We investigated the effects of these two types of awareness on performance time, selection mistakes, and the number of questions people asked the robot. We did not observe any obvious benefits of our gaze awareness manipulation. Awareness of task …", "num_citations": "22\n", "authors": ["1158"]}
{"title": "Using an interactive avatar's facial expressiveness to increase persuasiveness and socialness\n", "abstract": " Research indicates that the facial expressions of animated characters and agents can influence people's perceptions and interactions with these entities. We designed an experiment to examine how an interactive animated avatar's facial expressiveness influences dyadic conversations between adults and the avatar. We animated the avatar in realtime using the tracked facial motion of a confederate. To adjust facial expressiveness, we damped and exaggerated the avatar's facial motion. We found that ratings of the avatar's extroversion were positively related to its expressiveness. However, impressions of the avatar's realism and naturalness worsened with increased expressiveness. We also found that the confederate was more influential when she appeared as the damped or exaggerated avatar. Adjusting the expressiveness of interactive animated avatars may be a simple way to influence people's social …", "num_citations": "20\n", "authors": ["1158"]}
{"title": "Video increases the perception of naturalness during remote interactions with latency\n", "abstract": " Visual telecommunication systems support natural interaction by allowing users to remotely interact with one another using natural speech and movement. Network connections and computation cause delays that may result in interactions that feel unnatural or belabored. In an experiment using an audiovisual telecommunications device, synchronized audio and video delays were added to participants' conversations to determine how delay would affect conversation. To examine the effects of visual information on conversation, we also compared the audiovisual trials to trials in which participants were presented only the audio information. We present self-report data indicating that delay had a weaker impact when both audio and video channels were available, for delays up to 500 ms, than when only the audio channel was available.", "num_citations": "20\n", "authors": ["1158"]}
{"title": "Predictability or adaptivity? Designing robot handoffs modeled from trained dogs and people\n", "abstract": " One goal of assistive robotics is to design interactive robots that can help disabled people with tasks such as fetching objects. When people do this task, they coordinate their movements closely with receivers. We investigated how a robot should fetch and give household objects to a person. To develop a model for the robot, we first studied trained dogs and person-to-person handoffs. Our findings suggest two models of handoff that differ in their predictability and adaptivity.", "num_citations": "20\n", "authors": ["1158"]}
{"title": "Public volunteer work on the Internet\n", "abstract": " There are many examples of public voluntary work that are enabled by the Internet, from improving the abilities of low performing middle school students and the health of sufferers of chronic pain to providing high quality technical support to software users and producing high quality scientific image analysis. Such activities represent socially desirable goals with potentially important economic implications and require organizing the behavior of many people to achieve them. Projects directed toward these endeavors have all been successfully accomplished over the Internet by volunteers who are often strangers to one another. These net-based voluntary communities that produce socially beneficial outcomes represent an IT-enabled organization of important social activity. This chapter examines the still early days of this exciting new potential for\" transforming\" how public voluntary cooperative activity is organized.", "num_citations": "20\n", "authors": ["1158"]}
{"title": "Research methods and global online communities: A case study\n", "abstract": " This book brings into focus the technologically augmented nature of global online communities, advancing research methods that reveal the imprint of emergent social forms and characterise digital frontiers of social engagement. Drawing on insights from across the social sciences, it presents a case study of people with passions for reptiles and amphibians to illustrate for next generation researchers how to conduct community research in the real world. Richly illustrated with ethnographic research, together with extensive survey and interview material drawn from around the world, Research Methods and Global Online Communities explores the changing nature of communities that form around common interests and are embedded in a digital architecture rather than place. In doing so, this book transcends the digital dualism of online/offline models of community and engages with debates on the social impacts of the internet and the adaptive nature of community. As such, it will appeal to social scientists interested in innovative approaches to characterising digital communities through mixed-methods research practice.", "num_citations": "18\n", "authors": ["1158"]}
{"title": "My agent as myself or another: effects on credibility and listening to advice\n", "abstract": " People consider other people who resemble them to be more persuasive. Users may consider embodied conversational agents, or ECAs, to be more persuasive if the agents resemble them. In an experimental study, we found that users rated the persuasiveness of agents that resemble them higher than other agents. However, actual advice-taking diverged from this pattern; when users created the agents, users changed their choices less when interacting with the agents that resembled them. We conducted a follow-up study and found that resemblance and self-esteem affect interactions with agents that resemble users. We discuss the use of self-report and behavioral data in evaluations of agent interfaces and how agents that resemble users might foster particular social interactions with a system. We suggest that agents that resemble users may be more persuasive in advising users about their actions and decisions.", "num_citations": "18\n", "authors": ["1158"]}
{"title": "The science of human-robot interaction\n", "abstract": " Researchers in the field of human-robot interaction (HRI) are celebrating the transition to an official ACM Transactions journal. It is a significant achievement for HRI. This field has faced many challenges, including scarce resources for conducting HRI research, the difficulty of conducting the research itself—integrating hardware and software; building robots that can interact with people; piecing together the intricacies of seeing, thinking, and acting when a person encounters a robot; understanding and shaping ethical norms and standards; and stepping behind the mythologies that have long governed cultural attitudes for and against robots. HRI are presented here. Even as HRI becomes more mature, the core disciplines of the field face many controversies and subtleties that complicate our research questions and activities. Here’s an example: It was long thought that human beings can discriminate only the seven …", "num_citations": "17\n", "authors": ["1158"]}
{"title": "Time to reflect: Supporting health services over time by focusing on collaborative reflection\n", "abstract": " When health services involve long-term treatment over months or years, providers have the ability, not present in acute emergency care, to collaboratively reflect on clients' changing health data and adjust interventions. In this paper, we discuss temporality as a factor in the design of health information technology. We define a temporal spectrum ranging from time-critical services that benefit from standardization to long-term services that require more flexibility. We provide empirical evidence from fieldwork that we performed in organizations providing long-term behavioral and mental health services for children. Our fieldwork in this context complements and provides contrasts to previous CSCW studies performed in time-critical hospital settings. Current literature shows a bias toward standardized records and routines in the implementation of health information technology, a policy that may not be appropriate for long …", "num_citations": "17\n", "authors": ["1158"]}
{"title": "The perverse effects of social transparency on online advice taking\n", "abstract": " Increasingly, the advice people receive on the Internet is socially transparent in the sense that it displays contextual information about the advice-givers or their actions. We hypothesize that activity transparency-seeing an advice giver's process while creating his or her recommendations-will increase advice taking. We report three experiments testing the effect of activity transparency on taking mediocre advice. We found that the presence of a web history increased the likelihood of following a financial advisor's advice and reduced participant earnings (Exp. 1), especially when the web history implied greater task focus (Exp. 2, 3). CSCW research usually emphasizes how to increase information sharing; this work suggests when shared information may be inappropriate. We suggest ways to counter activity transparency's potential downsides.", "num_citations": "17\n", "authors": ["1158"]}
{"title": "iPod-based in-home system for monitoring gaze-stabilization exercise compliance of individuals with vestibular hypofunction\n", "abstract": " In the physical therapy setting, physical therapists (PTs) often prescribe exercises for their clients to perform at home. However, it is difficult for PTs to obtain information about their clients’ compliance with the prescribed exercises, the quality of performance and symptom magnitude. We present an iPod-based system for capturing this information from individuals with vestibular hypofunction while they perform gaze stabilization exercises at home. The system’s accuracy for measurement of rotational velocity against an independent motion tracker was validated. Then a seven day in-home trial was conducted with 10 individuals to assess the feasibility of implementing the system. Compliance was measured by comparing the recorded frequency and duration of the exercises with the exercise prescription. The velocity and range of motion of head movements was recorded in the pitch and yaw planes. The system also recorded dizziness severity before and after each exercise was performed. Each patient was interviewed briefly after the trial to ascertain ease of use. In addition, an interview was performed with PTs in order to assess how the information would be utilized. The correlation of the velocity measurements between the iPod-based system and the motion tracker was 0.99. Half of the subjects were under-compliant with the prescribed exercises. The average head velocity during performance was 140 deg/s in the yaw plane and 101 deg/s in the pitch plane. The iPod-based system was able to be used in-home. Interviews with PTs suggest that the quantitative data from the system will be valuable for assisting PTs in understanding exercise …", "num_citations": "17\n", "authors": ["1158"]}
{"title": "Workflow transparency in a microtask marketplace\n", "abstract": " Interdependent tasks in Mechanical Turk (MTurk) can be managed efficiently with a workflow, a sequence of tasks through which work passes to its completion. We ask if workers should be informed about the workflow, which we call workflow transparency. Transparency could motivate workers or induce social loafing. We describe three experiments to determine the effects of workflow transparency in MTurk. We compared a text description of the workflow, a visualization of the workflow, and the combination of text and visualization with a control condition giving no workflow information. Workflow transparency marginally increased volunteerism on a charity identification task (experiment 1) and significantly increased volunteerism and quality on a business identification task (experiment 2). Results were weaker with a less experienced worker sample (experiment 3). We suggest further research on the design of …", "num_citations": "17\n", "authors": ["1158"]}
{"title": "Using isovist views to study placement of large displays in natural settings\n", "abstract": " In this paper we present the concept of an isovist, derived from the architectural literature, and describe how isovists can help HCI researchers understand visibility in a physical environment. An isovist is defined as the set of all points visible in all directions from a given vantage point in space. The overlap in isovists from two or more locations can be used to assess reciprocal visibility and thereby assist in the placement of large displays for public or shared use. We illustrate the value of isovists for HCI research using field data from two OR suites in two major urban hospitals. First, we show how patterns of interaction between anesthesiologists and nurses in each of two OR suites are associated with quantity of isovist overlap. Then, we show how an isovist analysis can be used to determine a better placement for the shared display in one of the OR suites to enhance coordination between groups.", "num_citations": "17\n", "authors": ["1158"]}
{"title": "Social responses to\" social\" computers\n", "abstract": " エージェントの外見の違いがユーザの態度解釈に与える影響-外見の異なるエージェントからの同一人工音の提示実験", "num_citations": "17\n", "authors": ["1158"]}
{"title": "Aging: Biology and behavior\n", "abstract": " Aging: Biology and Behavior addresses behavioral changes in aging related to biological processes, focusing on the nature of changes in brain plasticity, factors influencing life-span, and environmental and social influences on health in the elderly. This book is divided into four main topics—longevity, aging, and mortality; aging brain and behavior; cognitive and social functioning; and health. In these topics, this publication specifically discusses the longevity in primates, life-span extension, environment and biology in aging, and some economic implications of life-span extension. The neurobiological basis of age-related changes in neuronal connectivity, aging and brain plasticity, and cognitive functioning in the elderly are also elaborated. This text likewise covers the life changes and disease in elderly populations, social stress and mental disorders in the elderly, and perspective of social epidemiology. This volume is a useful source to clinicians and students examining possible social and behavioral science research perspectives on aging.", "num_citations": "16\n", "authors": ["1158"]}
{"title": "Who works with whom? Collaborative tie strength in distributed interdisciplinary projects\n", "abstract": " In this paper, we illustrate why prior experience working together is critical for collaborations that cross geographic and disciplinary boundaries. In the organizational literature, strong ties are characterized by greater frequency of communication and emotional closeness compared with weak ties. For scientists and engineers on research projects, we introduce the concept of'collaborative tie strength'to emphasize the level of joint intellectual effort. In the context of science and engineering, collaborative strong ties work directly together on a research project and publish together, whereas collaborative weak ties are on a research project together, but do not work directly together or publish together. Using data from 3911 pairs of senior personnel working on 475 research projects funded through the National Science Foundation (NSF), our analyses suggest that prior experience matters to subsequent collaboration, not only because it is a strong predictor of collaborative tie strength, but also because it moderates the relationship between geographic and disciplinary boundaries and collaborative tie strength. That is, the negative impact of geographic and disciplinary boundaries on collaborative tie strength is reduced when prior experience is greater. We discuss implications for e-social science, which often relies on researchers from different universities and disciplines working together.", "num_citations": "16\n", "authors": ["1158"]}
{"title": "The impact of basic research in the social sciences: The case of education\n", "abstract": " Recent expert evaluations of the condition and funding of educational research in the USA assume that basic research in the social sciences is a crucial factor in increasing our understanding and ultimately improving the practice of education (see, for example, the 1977 report1 of the National Academy of Sciences' Committee on Fundamental Research Relevant to Education). Past tests of this assumption, however, have generally relied upon argument by example or anecdote. In the present study, we analyze citation patterns in the education literature to test the corollary proposition that basic research in the social sciences has had a substantial impact on the literature in education. Empirical data collected on citation patterns in the education literature are found to be largely consistent with this proposition.", "num_citations": "16\n", "authors": ["1158"]}
{"title": "Conversing with children: Cartoon and video people elicit similar conversational behaviors\n", "abstract": " Interactive animated characters have the potential to engage and educate children, but there is little research on children's interactions with animated characters and real people. We conducted an experiment with 69 children between the ages of 4 and 10 years to investigate how they might engage in conversation differently if their interactive partner appeared as a cartoon character or as a person. A subset of the participants interacted with characters that displayed exaggerated and damped facial motion. The children completed two conversations with an adult confederate who appeared once as herself through video and once as a cartoon character. We measured how much the children spoke and compared their gaze and gesture patterns. We asked them to rate their conversations and indicate their preferred partner. There was no difference in children's conversation behavior with the cartoon character and the …", "num_citations": "15\n", "authors": ["1158"]}
{"title": "Motivating Programming: using storytelling to make computer programming attractive to more middle school girls\n", "abstract": " CiteSeerX — Motivating Programming: Using Storytelling to Make Computer Programming Attractive to More Middle School Girls Documents Authors Tables Log in Sign up MetaCart DMCA Donate CiteSeerX logo Documents: Advanced Search Include Citations Authors: Advanced Search Include Citations Tables: DMCA Motivating Programming: Using Storytelling to Make Computer Programming Attractive to More Middle School Girls (2006) Cached Download as a PDF Download Links [reports-archive.adm.cs.cmu.edu] [reports-archive.adm.cs.cmu.edu] [reports-archive.adm.cs.cmu.edu] [reports-archive.adm.cs.cmu.edu] [reports-archive.adm.cs.cmu.edu] [reports-archive.adm.cs.cmu.edu] [reports-archive.adm.cs.cmu.edu] [reports-archive.adm.cs.cmu.edu] [reports-archive.adm.cs.cmu.edu] [reports-archive.adm.cs.cmu.edu] [reports-archive.adm.cs.cmu.edu] [reports-archive.adm.cs.cmu.edu] [reports-archive.adm.cs.cmu…", "num_citations": "15\n", "authors": ["1158"]}
{"title": "Matching robot appearance and behavior to tasks to improve human-robot cooperation\n", "abstract": " A robot’s appearance and behavior provide cues to the robot’s abilities and propensities. We hypothesize that an appropriate match between a robot’s social cues and its task will improve people’s acceptance of and cooperation with the robot. In an experiment, people systematically preferred robots for jobs when the robot’s humanlikeness matched the sociability required in those jobs. In two other experiments, people complied more with a robot whose demeanor matched the seriousness of the task.", "num_citations": "15\n", "authors": ["1158"]}
{"title": "Psychotherapists' perceptions of adjustment and attraction toward children described as in therapy\n", "abstract": " A consideration of the job requirements, training, and role of therapists and other service professionals lcd to the formulation of two hypotheses: that therapists will pcrceive more naladjustment than laymen in persons supposedly undergoing therapy, and that therapists will like these “clients” less than will laymen because maladjustment is socially undesirable. A group of professional therapists and a matched group of lay persons were asked to describe two children portrayed in films. One child was actually in therapy; the olher was not, but was described as such. Content analyses of the descriptions revealed greater attribution of maladjustment to the normal child by therapists and a tendency (but not significant) to like him less. Therapists also showed less attraction to the actually disţurbcd child. These data were viewed as having implications for clients' prognoses, Some recent thcorizing (Rosenthal and Jacobson …", "num_citations": "15\n", "authors": ["1158"]}
{"title": "Research funding for psychology.\n", "abstract": " Describes recent trends in funding for basic and applied research in psychology. Comparisons are made with other disciplines and in relation to available manpower. Data that bear on research costs, proposals funded, research quality, and support for young vs senior psychologists are presented.(PsycINFO Database Record (c) 2016 APA, all rights reserved)", "num_citations": "14\n", "authors": ["1158"]}
{"title": "Assessing naturalness and emotional intensity: a perceptual study of animated facial motion\n", "abstract": " Animated characters appear in applications for entertainment, education, and therapy. When these characters display appropriate emotions for their context, they can be particularly effective. Characters can display emotions by accurately mimicking the facial expressions and vocal cues that people display or by damping or exaggerating the emotionality of the expressions. In this work, we explored which of these strategies would be most effective for animated characters. We investigated the effects of altering the auditory and facial levels of expressiveness on emotion recognition accuracy and ratings of perceived emotional intensity and naturalness. We ran an experiment with emotion (angry, happy, sad), auditory emotion level (low, high), and facial motion magnitude (damped, unaltered, exaggerated) as within-subjects factors. Participants evaluated animations of a character whose facial motion matched that of …", "num_citations": "13\n", "authors": ["1158"]}
{"title": "Teammate inaccuracy blindness: when information sharing tools hinder collaborative analysis\n", "abstract": " Asynchronous collaborative analysis is important in many fields, but information sharing can be a bottleneck. Tools for annotating, organizing, and summarizing information can help, but their value will likely depend on the accuracy of teammates' information. To document this claim, two experiments examined participants' performance on a complex detective task when they asynchronously received information from a teammate in a collaboration tool or received no such information. We found that receiving a progress report containing accurate information was associated with improved performance (vs. no information shared in a tool) but worse performance when the information was inaccurate. Teammates were evaluated as helpful even when they were not. Our findings point to a phenomenon of teammate inaccuracy blindness that arises when teammates provide inaccurate information. We propose some …", "num_citations": "13\n", "authors": ["1158"]}
{"title": "Organization theory and new ways of working in science\n", "abstract": " Dramatic changes in the practice of science over the past half a century, including trends towards working in teams and on large projects, and geographically distributed and interdisciplinary collaboration, have created opportunities and challenges for scientists. We argue that these changes in science represent new organizational forms and ways of working that also create opportunities and challenges for organization theory. We describe how applying organization theory to science can push our knowledge of research organizations further and also raise questions for a range of organization theories, including coordination, social identity, the knowledge-based view, social networks, organizational learning, and absorptive capacity. We suggest that organization theory is critical for better understanding the sources of technological innovation, making effective policy around R&D investment, and developing …", "num_citations": "13\n", "authors": ["1158"]}
{"title": "Trajectories in multiple group coordination: a field study of hospital operating suites\n", "abstract": " Hospital surgery environments are dynamic and high risk. They require coordination across multiple groups whose incentives, cultures, and routines can conflict. In this paper, we describe a field study of multi-group coordination in the operating room (OR) environment. We studied work trajectories from the perspective of each group involved. Coordination breakdowns at group boundaries involving patients, doctors, nurses, and other staff led to local problem solving, but also to delays and interpersonal tension and conflict across groups. We conclude with design recommendations for multiple group coordination support that would promote trajectory awareness and learning at the organizational level", "num_citations": "13\n", "authors": ["1158"]}
{"title": "Do collaborators' annotations help or hurt asynchronous analysis\n", "abstract": " Our study investigated the use of annotations in an asynchronous crime-solving task. In Study 1, regardless of whether they anticipated a partner, participants had better performance if they annotated more about connections across documents. In Study 2, annotations that pointed to more connections across documents improved the performance of the second participant. Annotations that pointed to few connections across documents hurt performance, especially when people were more aware of their partners. This research suggests that future collaborative tools should help people discern useful from useless annotations.", "num_citations": "12\n", "authors": ["1158"]}
{"title": "Common ground in dialogue with a gendered humanoid robot\n", "abstract": " Research on human-human interaction shows that people estimate each others' knowledge to find where they have a common ground of understanding. They adapt their speech to this common ground. In particular, people explain themselves more to others when they have less common ground. We demonstrate that the same process can occur in human-robot interaction. In discussing dating, women participants explained dating norms for a woman more to a “male” robot than to a “female” robot, and men generally showed the opposite behavior. We discuss the development of the dialogue that produced common ground, and what our results imply for human-robot interfaces and interaction design.", "num_citations": "12\n", "authors": ["1158"]}
{"title": "Those who are number two try harder: The effect of sex on attributions of causality\n", "abstract": " Conducted 2 experiments to ascertain the causal attributions made by a total of 274 male and female undergraduates for identical performance (including success and failure) of males and females. In both experiments, Ss made attributions along 4 dimensions: ability, motivation, task difficulty, and luck. Whether evaluating undergraduates on an intellectual task (Exp I) or successful physicians (Exp II), Ss attributed greater motivation to females than to males. In addition, males perceived the female physician as being less able and having an easier task than the male physician. However, female Ss perceived the female physician as having a harder task than the male physician. Implications for attribution theory and the perception of professional women in our society are discussed.(17 ref)(PsycINFO Database Record (c) 2016 APA, all rights reserved)", "num_citations": "12\n", "authors": ["1158"]}
{"title": "Evaluating animated characters: Facial motion magnitude influences personality perceptions\n", "abstract": " Animated characters are expected to fulfill a variety of social roles across different domains. To be successful and effective, these characters must display a wide range of personalities. Designers and animators create characters with appropriate personalities by using their intuition and artistic expertise. Our goal is to provide evidence-based principles for creating social characters. In this article, we describe the results of two experiments that show how exaggerated and damped facial motion magnitude influence impressions of cartoon and more realistic animated characters. In our first experiment, participants watched animated characters that varied in rendering style and facial motion magnitude. The participants then rated the different animated characters on extroversion, warmth, and competence, which are social traits that are relevant for characters used in entertainment, therapy, and education. We found that …", "num_citations": "11\n", "authors": ["1158"]}
{"title": "What robots could teach us about perspective-taking\n", "abstract": " A distinctly social ability that underlies shared meaning, empathy, and cooperation is taking the perspective of another person during conversation. Research on communication has explored the manner in which human speakers account for their listeners’ perspectives and adjust their communications in their attempts to be understood (eg, Clark & Wilkes-Gibbs, 1986; Fussell & Krauss, 1992; Krauss & Fussell, 1991; Krauss, Vivekananthan, & Weinheimer, 1968). Speakers attend to their listeners’ group memberships and likely areas of expertise as they construct their messages (eg, Clark & Marshall, 1981; Fussell & Krauss, 1992; Hupet, Chantraine, & Neff, 1993; Isaacs & Clark, 1987). Speakers attend to what their partners can see, that is, their spatial perspective within the environment (eg, Gergle, Kraut, & Fussell, 2004b; Kraut, Miller, & Siegel, 1996; Lockridge & Brennan, 2002; Schober, 1993). In addition, speakers attend to the verbal and nonverbal responses of their listeners to assess whether their message is comprehended and to make appropriate repairs and adjustments (eg, Clark & Wilkes-Gibbs, 1986; Krauss & Bricker, 1966; Krauss & Weinheimer, 1964, 1966). These adjustments produce communication that is more effective, whether in the context of a single message (eg, Fussell & Krauss, 1989) or over the course of an ongoing conversation (Kraut, Lewis, & Swezey, 1982; Schober & Clark, 1989).There now exists considerable evidence on the information people use in perspective taking (for a recent review, see Schober & Brennan, 2003), but we know very little about failures in perspective taking and how conversationalists cope …", "num_citations": "11\n", "authors": ["1158"]}
{"title": "Predicting human interruptibility with sensors: A Wizard of Oz feasibility study\n", "abstract": " A person seeking another person’s attention is normally able to quickly assess how interruptible the other person currently is. Such assessments allow behavior that we consider natural, socially appropriate, or simply polite. This is in sharp contrast to current computer and communication systems, which are largely unaware of the social situations surrounding their usage and the impact that their actions have on these situations. If systems could model human interruptibility, they could use this information to negotiate interruptions at appropriate times, thus improving human computer interaction. This paper presents a series of studies that quantitatively demonstrate that simple sensors can support the construction of models that estimate human interruptibility as well as people. These models can be constructed without using complex sensors, such as vision-based techniques, and their use in everyday office environments is therefore both practical and affordable. Although currently based on a demographically limited sample, our results indicate a substantial opportunity for future research to validate these results over larger groups of office workers. Our results also motivate the development of systems that use these models to negotiate interruptions at socially appropriate times.", "num_citations": "11\n", "authors": ["1158"]}
{"title": "Computer networks in field research\n", "abstract": " In applied social research, the questions we can ask and the data we can collect depend on our tools. Computers have made possible many new tools—for instrument design, sampling, scheduling research, coding and editing, data entry, data cleaning, scale and index construction, data base organization and retrieval, statistical analysis, documentation, and report writing (Karweit & Meyers, 1983, pp. 379–414). In the past two decades, these tools have led to efficiencies and a scale of research heretofore impossible, but the data collection process remains much as it was. Today, most field researchers rely on paper questionnaires, personal observations, and interviews carried out face-to-face or by telephone. For example, of the 90 articles published in the Journal of Applied Social Psychology in 1989, 46 report data from a paper-and-pencil survey or face-to-face interview; in another 22, investigators used …", "num_citations": "11\n", "authors": ["1158"]}
{"title": "Shape-constrained whole-body adaptivity\n", "abstract": " The unique mobility characteristics that make novel robotic platforms potential assets to the search and rescue community can also, unfortunately, provide obstacles in transitioning them from use in the lab to effective use in the field. For example, snake-like robots have small-cross sectional areas that enable them to weave through extremely tightly-packed volumes, e.g., collapsed buildings. Unfortunately, the small size of these robot makes it difficult to incorporate traditional drive mechanisms, like tracks or wheels, and thus makes intuitively driving the robots quite difficult. This paper hypothesizes that, for snake-like robots, one way to extend their overall usefulness is to add layers of mobile autonomy based on biologically inspired behavioral design. A biologically-inspired control architecture that utilizes a novel snake-like robotic platform's ability to locally sense distributed forces along its body is introduced …", "num_citations": "10\n", "authors": ["1158"]}
{"title": "Network nation: Human communication via computer\n", "abstract": " In 1978, some of my current graduate students were born, and like more than 99% of the world’s population, I had never used a computer to communicate with another person. That year, Murray Turoff, a computer scientist at the New Jersey Institute of Technology, and Starr Roxanne Hiltz, a sociologist then at Upsala College, published a visionary book on communicating through computers. A few years later, their book, Network Nation: Human Communication via Computer, would help set my research and life off in a new direction. My dog-eared copy of the book has disappeared from my office, and I must borrow Jane Siegel’s copy. Her book is stuffed with little paper notes that say,“Xerox pg. 15, 27-28, 30.” Jane and I published several articles together; these faded notes are some of the evidence of the influence of this book on my own work. Network Nation is a combination of research report and insightful policy analysis. For its time--pre-personal computer, pre-AOL, pre-Web--it was prescient. Teresa Carpenter said in her Village Voice review in 1993 that the book laid out “a future when home computers would be as common as the telephone, when they would link person to person, shrinking...'time and 1 distance barriers among people, and between people and information, to near zero.'In its", "num_citations": "10\n", "authors": ["1158"]}
{"title": "The aging population, social trends, and changes of behavior and belief\n", "abstract": " In this chapter, I consider how changing characteristics of our population and related exogenous conditions may alter attitudes and beliefs about older people. The chapter applies current social-psychological theory to attitude change about older people. The basic argument is that exogenous demographic, economic, and social conditions change behavior and that behavior changes attitudes. This idea may be used as a framework for research to understand future stereotypes of older people, changing attitudes about social issues involving the elderly, and new attitudes about aging.", "num_citations": "10\n", "authors": ["1158"]}
{"title": "Thinking ahead\n", "abstract": " When the telephone was invented, everyone thought that it would serve businesspeople primarily No one envisaged that this business tool would revolutionize the way people–from remote farmers to teens in town–conduct their social lives. Technical in-novations have more effects than most people realize, and the same is true of the computer. What many managers regard as merely a tool for storing and transmitting information has social effects that can be more importantin the long run. Because computers break down hierarchies and cut across norms and organization boundaries, people behave differently when using them. And once the social context is altered, the organization changes. Because of these effects, managers need to be cau-tious when designing systems, but they should also see in them the potential for making great social gains in their organizations.", "num_citations": "8\n", "authors": ["1158"]}
{"title": "Overview on aging: Some biomedical, social, and behavioral perspectives\n", "abstract": " In the twentieth century, life expectancy of the average American has increased by more than 50%. Basic improvements in sanitation, immu-nization, and medical care have resulted in a decrease in the number of deaths during infancy, childhood, and, for women, the childbearing years. Only 20% of all newborns in 1776 lived into their sixties, compared with over 80% in 1980. Life expectancy at birth for the total population has jumped from 48.2 years at the turn of the century to 73.2 years in 1978. This triumphant increase in survivorship prompted the federal gov-ernment to create the National Institute on Aging (NIA) in 1974, as part of the National Institutes of Health. The NIA's mission is to support, conduct, and promote social and behavioral—as well as biomedical—research on aging. That the United States Congress judiciously gave the institute such a broad mandate reflects the complex nature of the aging process. Its various manifestations and underlying mechanisms must be addressed by the best fundamental, scientific, and scholarly concepts and methods.", "num_citations": "8\n", "authors": ["1158"]}
{"title": "Federal policies for research on children.\n", "abstract": " Federal policies for research on children have implications for individual investigators and for the direction and quality of the research they carry out. Preliminary analyses of patterns of support, management, and planning of research help reveal the nature of federal policies for research on children and how these policies may have affected research. Generally, policies for research on children are de facto outcomes of federal support of the sciences and domestic programs of the government that include children as clients. These latter, in turn, derive from chronic and acute historical developments such as the evolution of negotiated government contracting for research and the creation of politically sophisticated groups of professionals who deliver children's services. Examining how federal policies develop and change in response to such historical forces may contribute to understanding what is learned about …", "num_citations": "8\n", "authors": ["1158"]}
{"title": "Trying to be helpful: Social challenges for smart robots\n", "abstract": " Research on robotic helpers emphasizes their potential to improve human performance, but little attention has been given to the effects of robotic helpers on the social and psychological well-being of help recipients. Interactions with human helpers are not always positive and can threaten help recipients’ confidence, independence, sense of identity, and task enjoyment. In a similar way, recipients of robotic assistance may find that the benefits of receiving help are paired with negative social and psychological outcomes. In this paper, we review factors that may influence how help is perceived by help recipients. We then describe the challenge for robotic helpers and the contribution language may make to successful helping interactions. We conclude by outlining our current research agenda for empirically exploring these issues.", "num_citations": "7\n", "authors": ["1158"]}
{"title": "Approaches to authority in online disaster relief communities after Hurricane Katrina\n", "abstract": " The Internet is widely valued for distributing control over information to a lateral network of individuals, but it is not clear how these networks can most effectively organize themselves. This chapter presents a descriptive study of distributed networks of volunteers that emerged online following Hurricane Katrina. Online communities responded to the disaster by facilitating the distribution of donated goods from individuals directly to hurricane survivors. These “connected giving” groups faced several challenges: establishing authority within the group, providing relevant information, developing trust in one another, and sustaining the group over time. Two forms of computermediated connected giving were observed: small blog communities and large forums. Small blog communities had a centralized authority figure in the form of a moderator. These groups were more immediately successful in managing information and …", "num_citations": "7\n", "authors": ["1158"]}
{"title": "Juggling Work Among Multiple Projects and Partner\n", "abstract": " Prior research suggests people have trouble juggling effort across multiple projects with multiple partners. We investigated this problem, with an experiment where groups of four participants enacted the roles of police detectives. Each detective was assigned two homicide cases, each case with a different partner. To solve each case, detectives read their case documents and discussed relevant information with their partners. Half the groups used IM to communicate and the other half used an enhanced IM tool called project-view IM (PVIM). PVIM lists partners and joint projects and lets users know what a partner is working on. We analyzed keystroke level computer activity and the content of conversations. Generally, work unfolded as follows: coordinate across cases, start first case, read documents, coordinate within case with partner, switch to second case, and so on, but with frequent interruptions. We describe …", "num_citations": "7\n", "authors": ["1158"]}
{"title": "Expected and unexpected effects of computer media on group decision making\n", "abstract": " During the past several years, a number of investigators have hypothesized that electronic mail and other computer-mediated communication technologies greatly attenuate social context cues (Hiltz and Turoff, 1978; Short, Williams, and Christie, 1976; Kiesler, Siegel, and McGuire, 1984). Equalization across status categories has been observed in studies of electronic communication in organizations (Sproull and Kiesler, 1986; Eveland and Bikson, 1988). The equalization phenomenon has been demonstrated in experiments showing that the distribution of discussion remarks was more equal when groups of peer members made decisions electronically than the same groups made decisions face-to-face (Siegel et al., 1986, McGuire et al., 1987; Weisband, 1989). However, no experimental test was made to examine the effect of electronic communication on preexisting differences in social status. The purpose of this …", "num_citations": "7\n", "authors": ["1158"]}
{"title": "YourPassword: applying feedback loops to improve security behavior of managing multiple passwords\n", "abstract": " Various mechanisms exist to secure users' passwords, yet users continue to struggle with the complexity of multiple password management. We explore the effectiveness of a feedback loop to improve users' password management. We introduce YourPassword, a web-based application that uses feedback to inform users about the security of their password behavior. YourPassword has two main components: a password behavior checker that converts password strengths into numerical scores and a dashboard interface that visualizes users' overall password behavior and provides visual feedback in real time. YourPassword not only provides a total score on all passwords, but also visualizes when passwords are too similar to each other. To test the efficacy of YourPassword, we conducted a between-subjects experiment and think-aloud test with 48 participants. Participants either had access to YourPassword, an …", "num_citations": "6\n", "authors": ["1158"]}
{"title": "Appropriate Accommodations: Speech Technologies and the Needs of Older Adults.\n", "abstract": " Older adults interacting with speech technologies may benefit from a range of communicative accommodations. Potential accommodations include volume, intonation, and sentence structure, to name a few. This paper reviews the literature on human communication with the elderly in search of recommendations for speech interface design. We conclude that spontaneous human behavior cannot easily be taken as a guide in designing communicative interactions for older adults. Due to substantial variability in the population, successful accommodations are largely dependent on the specifics of speaker and situation. Regrettably, humans are frequently not attuned to these specifics, and inappropriate accommodation is often perceived as patronizing. Speech technologies present an opportunity to offer accommodations appropriate to the specific communication needs and social values of individual users. Acknowledging the limitations of using research between human communicators to inform the design of speech interfaces, we offer considerations for further research on appropriate communication technologies for older adults.", "num_citations": "6\n", "authors": ["1158"]}
{"title": "Accessing multi-modal information on cell phones while sitting and driving\n", "abstract": " Multimodal interfaces have been identified as a possible solution for reducing the visual and motor demands of small devices such as cell phones. In a within-subjects factorial experiment, we explored where audio is useful in a cell phone interface that supports database applications. Participants sat at a desk and drove in a car simulator while choosing a hotel from a descriptive long list. We compared participants' performance with and without the option to listen to the information while it was presented in text. Participants rarely preferred or used the audio option while seated. A substantial number preferred and used the audio option while driving, especially when the hotel choice task was more difficult. Those who chose the audio option looked less at the phone, but increased their task time and did not improve their driving performance. We discuss implications of reading and listening for safety and design.", "num_citations": "6\n", "authors": ["1158"]}
{"title": "Managing expertise in a distributed environment\n", "abstract": " Expertise is the primary resource and product of professional service and technical firms. These firms often organize around project teams that advise and work under contract for clients. A key problem for management is to deploy expertise in project teams so as to meet the expertise requirements of projects and clients. Because expertise may be geographically distributed across multiple sites, many of these firms create virtual or distributed teams. Doing so gives these firms access to a larger pool of knowledge resources than would be available at one site and helps leverage expertise across the organization. However, geographically distributed collaboration in teams incurs coordination and other costs that local work does not. Is a distributed team worth these costs? We studied a professional service firm with distributed and collocated project teams. In this firm, domain expertise tended to be concentrated within geographic sites, whereas methodological expertise was distributed across the firm. We examined whether a better match of domain and methodological expertise to the needs of projects resulted in more profitable projects, and whether distributed teams matched these two types of expertise to the requirements of projects as well as or better than did collocated teams. We found that most projects were collocated, with members drawn from one site who had domain expertise that matched project requirements as well as when members were drawn from other sites. The profits of projects were unrelated to the match of domain expertise with project requirements. However, project profits were significantly and positively related to a match of …", "num_citations": "6\n", "authors": ["1158"]}
{"title": "What's in a move? normal disruption and a design challenge\n", "abstract": " The CHI community has led efforts to support teamwork, but has neglected team disruption, as may occur if team members relocate to another institution. We studied moves in 548 interdisciplinary research projects with 2691 researchers (PIs). Moves, and thus disruptions, were not rare, especially in large distributed projects. Overall, one-third of all projects experienced at least one member relocating but most moves reflected churn across high-ranking institutions. When collaborators moved, the project was disrupted. Our data suggest that moves exemplify normal disruptions. A design challenge is to help projects adapt to disruption.", "num_citations": "5\n", "authors": ["1158"]}
{"title": "Utilizing expertise in the geographically dispersed organization\n", "abstract": " Medium-size and large professional and technical services organizations are increasingly geographically dispersed. These organizations are enlarging their pool of expertise and business through mergers and acquisitions, and offices opened in new regions. Managers can reach across the entire organization to staff project teams with experts who will meet customers’ requirements. Yet geographically dispersed work arrangements increase the coordination costs of project work. We applied the knowledge-based view and a theoretical analysis of coordination costs to understand the distribution of expertise in a geographically dispersed professional organization, managers’ decisions to create local or dispersed project teams, and the consequences of those decisions. We found that local sites developed specializations around frequently-used domain expertise, and that most projects were local. Managers avoided cross-site collaborations requiring a dispersed project. In accord with the knowledge-based view, managers were more likely to create dispersed projects when, to win a valuable or large bid, they could match customers’ project requirements better by drawing in infrequently-used methodological experts from other sites.", "num_citations": "5\n", "authors": ["1158"]}
{"title": "Virtual teams and the geographically dispersed professional organization\n", "abstract": " Professional and technical services organizations have responded to their competitive environment by growing their pool of expertise through mergers, acquisitions, and offices opened in new regions. Investments in telecommunications and computer technology nourished ideal visions of technology use for these larger firms. One such vision is the concept of virtual teams. With virtual teams, managers can reach across the geographically dispersed organization to staff project teams with the best experts. These experts work seamlessly at a distance, supported by technology. In this paper, we describe how virtual teams represent an ideal of modern, technologically-sophisticated collaboration. This ideal influences the agenda for technology design, organizational change, academic research, policy, and managerial decision making. We describe virtual teams in one organization from 1996 to 2000. We suggest how …", "num_citations": "5\n", "authors": ["1158"]}
{"title": "Systers: Contradictions in community\n", "abstract": " Systers is a 13-year old online community for technical women. Substantial growth in the membership (from an initial group of 12 to over 2300 today), and of the Internet generally, has changed the nature of this community. We report empirical research leading to redesign of Systers’ online community resources. Systers must serve an increasingly diverse membership. Newcomers desire more and broader discussion and services whereas long-time members tend to prefer limited interaction. Redesign must grapple with a fundamental tension between the goals of successful members who act as mentors and community leaders, and those needing support, who tend to participate more actively in the community.", "num_citations": "5\n", "authors": ["1158"]}
{"title": "When the interface is a face\n", "abstract": " When the interface is a face — Experts@Minnesota Skip to main navigation Skip to search Skip to main content Experts@Minnesota Logo Home Profiles Research Units University Assets Projects and Grants Research Output Press / Media Datasets Activities Fellowships, Honors, and Prizes Search by expertise, name or affiliation When the interface is a face Sproull Lee, Mani Subramani, Sara Kiesler, Janet H. Walker, Keith Waters Information and Decision Sciences Research output: Contribution to journal › Article › peer-review 229 Scopus citations Overview Fingerprint Original language English (US) Pages (from-to) 97-124 Number of pages 28 Journal Human-Computer Interaction Volume 11 Issue number 2 State Published - Dec 1 1996 Access Link to publication in Scopus Link to citation list in Scopus Cite this APA Standard Harvard Vancouver Author BIBTEX RIS Lee, S., Subramani, M., Kiesler, S., Walker, JH, …", "num_citations": "5\n", "authors": ["1158"]}
{"title": "Fundamental Research and the Process of Education. Final Report to the National Institute of Education.\n", "abstract": " ABSTRACT, The objectives of this report are stated in three broad questions that the research committee was asked to examine.(1) What are the_principal lines of reseach being pursued at the present time that are significantly strengthening the scientific foundations of education, and what are some of thei4. possib1e coltributions to American education? Are there some lines of research that appear", "num_citations": "5\n", "authors": ["1158"]}
{"title": "Global and virtual teamwork\n", "abstract": " Kiesler) looks at how electronic archives can be used to connect distant employees to seek and provide technical help. Chapter 16 (Moon and Sproull) is a case study of the Linux Kernel and argues that open source software development provides one of the most successful examples of distributed work. Section 5, Distributed Scientific Collaborations, is the last section and consists of two chapters. Chapter 17 (Schunn, Crowley, and Okada) looks at successful distributed collaboration in the cognitive science community whereas Chapter 18 (Walsh and Maloney) draws lessons from scientists in four different fields: biology, mathematics, physics, and sociology.The value of this book lies in the theoretical and analytical framework offered in the different chapters which introduce the reader to a vocabulary that is useful for having a conversation about issues that are critical for distributed and virtual work. The book is also useful for those who are interested in conducting research in this area. Chapters from this book can be used to frame discussions in class, supported with cases and more applied readings.", "num_citations": "4\n", "authors": ["1158"]}
{"title": "Improving the accuracy of cell phone interruptions: A study on the effect of contextual information on the behavior of callers\n", "abstract": " A problem with the location-free nature of cell phones is that callers have difficulty predicting receivers' states, leading to inappropriate calls. One promising solution involves helping callers decide when to interrupt by providing them contextual information about receivers. Our research tested the effectiveness of different kinds of contextual information. One group of participants played the role of Receivers while five other groups played the role of Callers. Callers were provided different contextual information about Receivers’ locations, their cell phones’ ringer state, and the presence of others. We examined the value of this information by measuring the degree of agreement between Receivers’ desires and Callers’ behavior. Callers provided with contextual awareness information made significantly more accurate interruptions than those without. However, adding detailed and explicit awareness information did not …", "num_citations": "4\n", "authors": ["1158"]}
{"title": "Negotiation and coordination: A preliminary field study of conflict management in large scale collaboration\n", "abstract": " Coordination of activities in many settings can be characterized by management of conflicts, potential and actual, because of resource limitations, high-stakes consequences, uncertainty, goal conflicts among stakeholders and hetero-hierarchical organizational structures. To understand coordination in such systems, we conducted a field study of management of surgical operating rooms. Although coordination efforts were focused on resolution of interdependencies, such as progress monitoring, scheduling and rescheduling, and prodding, coordinators managed a set of complicated conflicts, often through opportunistic means. They were very sensitive to potential conflicts, and used many different means to resolve the conflicts as reported in the literature. Additionally, they were very concerned with perceived fairness. The findings have direct implications to the deployment of information technology as it will change …", "num_citations": "4\n", "authors": ["1158"]}
{"title": "Reducing social context cues: electronic mail in organizational communication (Reprint)\n", "abstract": " Reducing social context cues: electronic mail in organizational communication (Reprint) | Computer-supported cooperative work: a book of readings ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleBooksComputer-supported cooperative work: a book of readingsReducing social context cues: electronic mail in organizational communication (Reprint) chapter Reducing social context cues: electronic mail in organizational communication (Reprint) Share on Authors: Lee S Sproull profile image Lee Sproull Carnegie-Mellon Univ., Pittsburgh, PA Carnegie-Mellon Univ., Pittsburgh, PA View Profile , S Kiesler profile image Sara Kiesler …", "num_citations": "4\n", "authors": ["1158"]}
{"title": "iPod for Home Balance Rehabilitation Exercise Monitoring\n", "abstract": " When people fall and experience problems of balance, physical therapists (PTs) often prescribe home balance exercises involving repetitive head movements. Currently, patients' compliance and performance of these home exercises are invisible to PTs, who need the data to make informed decisions for treatment adjustments. We present an easy-to-use tool that monitors patients' home balance exercises and provides PTs with accurate, quantitative patient data. The tool, Head Coach, is a wearable device implemented in an iPod, fitted in a pocket on a baseball cap, and worn by patients while doing their exercises. We tested the reliability of the system using a magnetic field tracking device (Polhemus) as the gold standard. The test showed that the iPod can be used to accurately track home balance exercises.", "num_citations": "3\n", "authors": ["1158"]}
{"title": "Architecture and information technology as factors in surgical suite information sharing and coordination\n", "abstract": " Scheduling surgeries in hospitals is one of the most challenging activities for surgical staff. Schedule changes occur as often as every few moments, affecting necessary coordination of tasks, resources, and people within and across staff groups, and the stress people feel. In prior fieldwork at four sites, we observed that the physical layout of hallways and rooms, and barriers and spaces around schedule displays and key coordinators, affected information sharing and coordination of the surgery schedule. To generalize beyond the sites studied, we conducted a survey of 135 surgical suite directors across the USA. Our findings suggest how the architecture of the physical space and information availability and practices influence information sharing and coordination outcomes. Visual access between the shared surgery schedule display and the nursing control desk influenced whether staff groups congregated around …", "num_citations": "3\n", "authors": ["1158"]}
{"title": "Human-robot Interaction: A Special Double Issue of human-computer Interaction\n", "abstract": " This special issue is made up of five articles which cover the emerging area of human-robot interaction. The first paper offers a theoretical ecological framework for the design of personal service robots in homes of elderly people. Next, a field study of two robots that visited a children's elementary school in Japan for two weeks, with the purpos", "num_citations": "3\n", "authors": ["1158"]}
{"title": "Multidisciplinary Collaboration\n", "abstract": " Collaborations [cross-site projects] undertaken when expected value is especially high. Collaborations draw upon scarce expertise to match project requirements.", "num_citations": "3\n", "authors": ["1158"]}
{"title": "Distributed work\n", "abstract": " Despite the increasing prevalence of organizations staffing important projects with team members from across the nation and around the globe, academic research on the effectiveness of these arrangements has remained relatively sparse. Many of us recall Thomas Allen's (1977) Managing the Flow of Technology, which alerted us to how the spatial layouts of workplaces can influence who interacts with whom, and, as a result, can affect employee and team productivity. His account emphasized the importance of locating together those who need to interact with one another. Following this auspicious beginning, however, interest in extend-", "num_citations": "3\n", "authors": ["1158"]}
{"title": "Blurring the boundaries\n", "abstract": " Drawing on the perspective of social ecology, we report an analysis of data from a 1993 trial of cellular PCS technology, prior to its current widespread use. Our primary focus was to examine changes in social and work communication, and the social meanings of settings that could arise from the use of “personal phones.” We documented these changes using diaries and interviews before and after 4-5 months into the trial. We found increased mobility and communication across settings, more work communication in social settings and nonwork hours, and more social communication in work settings and work hours. We also found that, despite significant usability problems, participants were enthusiastic about their “personal” phones, had possessive feelings about them, and used them frequently. We discuss how wireless technology (phone and other networked devices) is changing social views of places and time.", "num_citations": "3\n", "authors": ["1158"]}
{"title": "The cultural context of psychological approaches to alcoholism: Should we contest or collaborate?\n", "abstract": " Asserts that there are many points of conceptual agreement among the various approaches to understanding and treating alcohol problems. Although S. Peele (see record 1985-28347-001) may be right in his suggestion that psychologists need to continue contesting the disease notion of alcoholism, it is argued that it is equally important to explore areas of potential agreement between approaches in an effort to overcome the problems posed by substance abuse.(7 ref)(PsycINFO Database Record (c) 2016 APA, all rights reserved)", "num_citations": "3\n", "authors": ["1158"]}
{"title": "Inaccuracy Blindness in Collaboration Persists, even with an Evaluation Prompt\n", "abstract": " The tendency to believe and act on others' misinformation is documented in much prior work. This paper focuses on inaccuracy blindness, the tendency to take a collaborator's poor information at face value, which reduces problem-solving success. We draw on social psychological research from the 1970s showing that evaluative rating scales can prompt a change in perspective. In a series of studies, we prototyped and tested an evaluation prompt meant to encourage skepticism in participant detectives trying to identify a serial killer. In tests of the prototype, the prompt was partially successful in inducing skepticism (Exp. 1), but a larger study (Exp. 2) showed that, despite the evaluation prompt, participants' inaccuracy blindness persisted. This work, and the literature more generally, shows that the tendency to be misled by collaborators' inaccurate information remains a strong phenomenon that is hard to counteract …", "num_citations": "2\n", "authors": ["1158"]}
{"title": "Interpreting Soap Operas and Creating Community: Inside a Electronic Fan Culture\n", "abstract": " Information revolution technologies armed those who would resist the coup and political oppression better than ever before in the seven decades of the Soviet reign. The political transformation of the Soviet Union, at least partially fueled by information revolution technologies, arguably emboldened lesser connected countries in some regions of the world, to experiment with more democratic rule. Electronic mail is the specific information revolution technology of interest for this inquiry because it enables people to communicate across national borders in ways that have not been possible since the time when borders were drawn around nation states. The interconnectivity measure is a composite measure of the number of nodes per capita for the four globally dominant electronic mail networks, Internet, BITNET, UUCP, and FidoNet, as tracked and recorded by the Matrix Information Directory Service. Now, it is revealed …", "num_citations": "2\n", "authors": ["1158"]}
{"title": "The Lilypad System: Designing for Collaborative Reflection\n", "abstract": " Collaboration among healthcare teams requires integrating a patient’s data from different sources, reviewing changes in the data over time, and drawing from the knowledge of different practitioners to interpret these changes and make decisions. We call this data-driven process collaborative reflection. It enables decision-making over time based on what data reveals about the effects of interventions. Practitioners and patients also reflect on data individually, but ultimately this reflection is in support of the collaboration needed for a healthcare team to make decisions. Prior research has focused on supporting healthcare teams primarily by providing tools for structured work practices1, 2, 3. In this work, we investigate the ad hoc, unstructured aspects of healthcare teamwork and address the need for tools that enable this type of work. We investigated collaborative reflection among teams providing mental and …", "num_citations": "2\n", "authors": ["1158"]}
{"title": "Virtual Teams: High-Tech Rhetoric and Low-Tech Experience\n", "abstract": " Advances in telecommunications and computer technology have nourished visions of ideal technology use. One such vision is the concept of virtual teams. The rhetoric of virtual teams, like the rhetoric of other computerization movements, makes claims to greater efficiency, a better organization, and happier people. With virtual teams, managers reach across the geographically dispersed organization to staff project teams with the best experts at least cost. Employees enjoy working at a distance seamlessly, supported by technology. We describe the experiences of a professional, geographically dispersed organization that had to work across sites and might have nurtured virtual teams. Instead, the rhetoric of collaboration, not technology, inspired top management. Project managers did not create virtual teams, believing them to incur severe coordination costs. To foster collaboration, the company changed", "num_citations": "2\n", "authors": ["1158"]}
{"title": "The second International Conference on human-robot interaction\n", "abstract": " The second international conference on Human-Robot Interaction (HRI-2007) was held in Arlington, Virginia, March 9-11, 2007. The theme of the conference was\" Robot as Team Member\" and included posters and paper presentations on teamwork, social robotics, adaptation, observation and metrics, attention, user experience, and field testing. One hundred seventy-five researchers and practitioners attended the conference, and many more contributed to the conference as authors or reviewers. HRI-2008 will be held in Amsterdam, The Netherlands from March 12-15, 2008.", "num_citations": "2\n", "authors": ["1158"]}
{"title": "When the Interface is the User’s Face: Ideas for Research and Applications\n", "abstract": " There has been an interest in research on exploring the use of faces as interfaces [2, 10, 11]. These projects show that using faces can help interfaces seem more credible to the user [10], help with learning [2], and make the user feel more engaged and excited [11]. However, only a few researchers have looked at using one’s own face as an interface [10]. Using one’s own face has several benefits. Facial resemblance has been shown to have positive effects in social interaction and can lead to trust [4] and influence [1]. From the cocktail party phenomenon and scanning for one’s own face in a photograph, we know that one's own face can be recognized immediately. Practically, the face of the user is immediately available and that may alleviate the need to design agents or to use celebrity faces which can be difficult to obtain and can be prohibitively expensive.Self-representational (SR) agents are a relatively unexplored research topic. In 2005, we conducted an exploratory study that examined the preference for, and performance with, agents that looked like the self that provided motivational information. In this paper, we briefly present that study, and provide some discussion about the role and benefits of agents that look like oneself. We will describe several ideas that can guide research into SR agents. Finally, we will describe our ideas for applications.", "num_citations": "2\n", "authors": ["1158"]}
{"title": "Results Summary (~ 500 projects)\n", "abstract": " Full Mediation Model Page 1 Results Summary (~500 projects) Cummings, JN, & Kiesler, S. (2007). Coordination costs and project outcomes in multi-university collaborations. Research Policy, 36(10), 1620-1634. Page 2 Collaborative Dynamics of Distributed Science Teams 2 ∎ Impact of geographic differences = ∎ less informal communication (Allen, 1977) ∎ less common ground (Clark and Brennan, 1991) ∎ less task awareness (Weisband, 2002) ∎ more work delays (Herbsleb et al., 2000) ∎ more misunderstandings (Cramton, 2001) ∎ more local distractions (Mark et al., 1999) But how do institutional differences impact coordination costs? Page 3 Work in progress: Institutional differences ∎ “A”-list journals (general, field) ∎ Publication authorship (first, other) ∎ Promotion (disciplinary, interdisciplinary) ∎ Teaching schedule (semesters, quarters) ∎ Teaching load (preps, students) ∎ Grant writing (primary, secondary…", "num_citations": "2\n", "authors": ["1158"]}
{"title": "An Internet paradox(panel): a social medium that may undermine sociability\n", "abstract": " Abstract not available.", "num_citations": "2\n", "authors": ["1158"]}
{"title": "Connections: New ways of working in the networked organization\n", "abstract": " ILLUSTRATING COMPUTER DOCUMENTATION. Wil-liam Horton. New York: John Wiley & Sons, Inc., 1991. 313 pages with index. $32.95 (soft cover).... what you can present by means of pictures, do not tell by means of words.(Otto Neurath) In the preface of his book, Bill Horton laments that he prowled bookstores for years looking for a book on how to use graphics to communicate technical information. Not finding one, he decided to write one himself. Though a few other books now on the market are similar to it, I think Horton's book is unique. And the beautiful thing about it-as the author points out in his\" secret\" in the preface-is that it is full of concepts and techniques that can be applied to any kind of graphics, not just computer ones.In this sense, Illustrating Computer Documentation is not only for technical communicators who are\" graphophobia\" but for all those wishing to improve their visual literacy. It is not a …", "num_citations": "2\n", "authors": ["1158"]}
{"title": "Simultaneous Mode versus Sequential Mode in Real-Time Computer-Mediated Conferencing\n", "abstract": " A ‘standard’ simultaneous response mode of computer-mediated real-time conferencing was compared to a sequential response mode in order to examine whether deficiences in the former were responsible for earlier observations of arousal and disinhibited behavior of participants towards one another. Twenty four discussions of twelve groups of three and the responses on a postexperimental “preferences-difficulties” questionnaire were analyzed. It was found that both the modes have deficiences which could contribute to arousal and disinhibition. Main deficiences of the simultaneous and sequential modes are identified and discussed. Recommendations for design of conference software based on the analyses are suggested.", "num_citations": "2\n", "authors": ["1158"]}
{"title": "From the Couch to the Keyboard: Psychotherapy in Cyberspace\n", "abstract": " Social network analysis conceives of social structure as the patterned organization of these network members and their relationships. The social network approach provides ways for analysts to think about social relationships that are neither groups nor isolated duets. This chapter considers the implications for computer-supported social networks of two opposing ideal types: dense, bounded groups and sparse, unbounded networks. Even more than the conceptualization of work, healthy communities has come to be viewed as densely knit, tightly bounded groups. Just as loosely coupled network forms of cooperative work have become prevalent in the Western world, sparsely knit, unbounded communities also flourish. Computer-mediated communication supports both dense, bounded groups and sparse, unbounded networks. Boundedness refers to the proportion of network members ties that stay within the …", "num_citations": "1\n", "authors": ["1158"]}
{"title": "Communicative Strategies for Administrative Practices: Evaluating Weblogs, Their Benefits, and Uses\n", "abstract": " I once heard Donald Murray, an early and prominent member of the writing as process movement, make a distinction between having problems and having difficulties. I admired it and have carried these notions with me for some years now: problems, he claimed, can be solved once and for all, whereas difficulties require individual approaches and are always simply a part of life (Murray). Communicative issues fall very much into Murray’s category of difficulties. Unlike a problem, such as how to calculate cumulative grade-point average, in which the correct mathematical equation simply needs to be applied, communicative strategies and practices constantly offer challenges and difficulties for WPAs. How these communicative challenges are faced varies from program to program because writing programs are situated so differently. Variants include the size of the institute (large state universities to small liberal arts or …", "num_citations": "1\n", "authors": ["1158"]}
{"title": "Lessons from Collocated Work\n", "abstract": " Lessons from Collocated Work | MIT Press books | IEEE Xplore Lessons from Collocated Work Article #: ISBN Information: Online ISBN: 9780262256353 INSPEC Accession Number: Persistent Link: https://xplorestaging.ieee.org/servlet/opac?punumber=6267280 More » Publisher: MIT Press IEEE Account Change Username/Password Update Address Purchase Details Payment Options Order History View Purchased Documents Profile Information Communications Preferences Profession and Education Technical Interests Need Help? US & Canada: +1 800 678 4333 Worldwide: +1 732 981 0060 Contact & Support About IEEE Xplore Contact Us Help Accessibility Terms of Use Nondiscrimination Policy Sitemap Privacy & Opting Out of Cookies A not-for-profit organization, IEEE is the world's largest technical professional organization dedicated to advancing technology for the benefit of humanity. © Copyright 2021 …", "num_citations": "1\n", "authors": ["1158"]}
{"title": "A prisoner's dilemma experiment on cooperation with\n", "abstract": " We sought to understand basic properties of social exchange and how people interact with technology in an experiment on how people respond in a dilemma game with a computer partner varying in human-like attributes as compared with a real human partner. Explanations of cooperation following discussion in dilemmas draw on theories of human social identity and social contract. We proposed that talking with a computer partner triggers social identity feelings and commitment norms people typically follow in decisions. Subjects played a prisoner's dilemma game over 6 trials with a confederate or a computer partner who always cooperated on the 1st, 2nd, 3rd, and 5th trials. We varied discussion and inducements to make promises across trials. On trial 1, subjects conversed with the partner, and most proposed cooperation. Subjects kept their promises as much with the text-only computer as with a person; they kept their promises less with a human-like, but imperfectly human, computer, and they gave lower social evaluation ratings to this computer. Cooperation dropped precipitously in all conditions on trial 3, when the partner avoided discussion. We interpret competition with the human-like computer to be consistent with a social identity explanation of ingroup rejection, We interpret the strong impact of commitment to be consistent with a social contract explanation of cooperation following discussion. Subjects broke their promises to a computer more than to a person, however, indicating people make heterogeneous commitments.", "num_citations": "1\n", "authors": ["1158"]}
{"title": "Computers, networks and work: Electronic interactions differ significantly from face-to-face exchanges. as a result, computer networks will profoundly affect the structure of …\n", "abstract": " Publisher SummaryThis chapter discusses use of computer networking in organizations. The networked organization differs from the conventional workplace with respect to both time and space. Computer-based communication is extremely fast in comparison with telephone or postal services. People can send a message to the other side of the globe in minutes; each message can be directed to one person or many people. Networks can also essentially make time standstill. Electronic messages can be held indefinitely in computer memory. People can read or reread their messages at any time, copy them, change them or forward them. Managers are often attracted to networks by the promise of faster communication and greater efficiency. Many organizations have adopted internal networks that link anywhere from a few to a few thousand employees.", "num_citations": "1\n", "authors": ["1158"]}
{"title": "4 Reviews--Connections: New Ways of Working in the Networked Organization by Lee Sproull and Sara Kiesler\n", "abstract": " When Sproull and Kiesler talk about a networked organization, they mean it literally: an organization, or organizational field, all of whose members are connected to a single electronic network through which they communicate (sometimes on nonwork affairs) and by means of which they access or provide information. Technology, by itself, does not create such an organization. But if the basic vision exists, the technology not only facilitates but greatly enhances Its effectiveness. This is the basic message of Sproull and Kiesler's Connections, which summarizes a decade of research, their own and that of others, on computer-mediated communication.Their framework stems from cognitive social psychology. They postulate a two-level perspective on changes resulting from the new technology: first-level effects on the efficiency of work processes-usually intended-and second-level effects-often latent or unintended-on the …", "num_citations": "1\n", "authors": ["1158"]}
{"title": "Technology and the Development of Creative Environments\n", "abstract": " A paradoxical goal of research on creativity in organizations is to discover predictable conditions, rational strategies, and learnable attributes that we typically associate with unpredictability, intuition, and unlearning. The paradox is resolved if we view creativity as one facet of organizational change, and organizational change as arising from mundane processes (March 1981). During the last several years, my colleagues and I have been studying one aspect of organizational change-the introduction of new computer technologies into organizations. We have studied how managers introduce technology and the effects of technology on the organization. In this chapter I discuss only one aspect of our work: the effects of computers and computer networks on organizational communication. Managers spend the majority of their time communicating: talking on the telephone, attending meetings, reviewing and writing reports, visiting and being visited. Because managers stand at the intersection of the organization and the environment, and of different subunits and jobs, communication is an important part of their role. Although the incentive structure, slack resources, and other noncommunication factors determine in large part whether managers act creatively, a communication environment that affords free exchange of data, ideas, and feelings is one which creative management is made more possible.", "num_citations": "1\n", "authors": ["1158"]}
{"title": "REDUCING SOCIAL CONTEXT CUES: ELECTRONIC MAIL\n", "abstract": " The boss is always the last one to know. This aphorism summarizes both what is right and what is wrong about communication in organizations. The unequal distribution of information promotes organizational efficiency by shielding decision makers from unnecessary information (eg, O'Reilly 1980). But it can also lead to organizational disaster by separating decision makers from information they need to know (Allison 1971; Shlaim 1976; Wohlstetter 1962). Who has what information is a perennially important organizational question.The purpose of this paper is to investigate how a new communication technologyelectronic mail–affects who has what information in organizations. Most analyses of electronic mail view it simply as an information accelerator, a tool that reduces the amount of time it takes for people to get information they otherwise would have received more slowly. For instance managers in Digital …", "num_citations": "1\n", "authors": ["1158"]}
{"title": "An experimental study of gratitude\n", "abstract": " I wish to thank my adviser, Dr. Timothy Brock, for his guidance and encouragement in all phases of the research. I also wish to acknowledge the invaluable help of my husband, Dr. Charles Kiesler. This research could not have been done without the assistance of these two, and I hold them responsible for any good things one might find in the dissertation. I also thank the rest of my committee, Dr. Donald Mosher, and Dr. Raymond Miles for their valuable comments and criticisms. The administration of the Guilford High School and Dr. Larry Gould of Southern Connecticut State College are thanked for their cooperation in obtaining subjects. Dr. Barry Collins was very helpful in providing use of computer time. ii", "num_citations": "1\n", "authors": ["1158"]}
{"title": "5 Collaborative Research across Disciplinary and Organizational Boundaries\n", "abstract": " MethodsWe studied a research program created by the NSF’s Computer and Information Science and Engineering Directorate called Knowledge and Distributed Intelligence (KDI). Its purpose was ‘‘to span the scientific and engineering communities... to generate, model, and represent more complex and cross-disciplinary scientific data from new sources and at enormously varying scales.’’The program was highly competitive. It supported only 40 awards out of 697 proposals in 1998, and 31 awards out of 554 preproposals and 163 full proposals in 1999. These projects were supported at US $1.5 million each over three years. We report the analyses of 62 of the 71 projects awarded this funding.In fall 2001, the NSF asked us to organize a workshop of research grantees to assess what had happened in the KDI research projects. The NSF invited the principal investigator (PI) and one co-PI from each of the 71 KDI projects to the workshop. Researchers from 52 research projects attended the workshop, held in late April 2002. At this workshop we asked researchers, organized into small randomly assigned groups, to discuss with one another how their research projects were organized and managed, the kinds of outcomes they generated, and the ways in which their research experience could inform future program evaluation. During three mornings of group discussion, note takers as well as participants compiled lists of experiences, outcomes, and suggestions. We asked the participants to send us copies of reports they had written and links to their Web sites.", "num_citations": "1\n", "authors": ["1158"]}