{"title": "Vermicomposting of domestic waste by using two epigeic earthworms (Perionyx excavatus and Perionyx sansibaricus)\n", "abstract": " The composting potential of two epigeic earthworms (P. excavatus and P. sansibaricus) was studied in 2002 to breakdown the domestic waste under laboratory conditions. The experimental container with P. sansibaricus showed maximum mineralization and decomposition rate than that of P. excavatus. Except for exchangeable K (it was higher (P = 0.004) in a container with P. excavatus), the domestic waste processed by P. sansibaricus showed about 6% more total nitrogen (P = 0.002) and about 7% more available P (P = 0.269) at the end than by P. excavatus. As compared with the initial level organic C content as well as C:N ratio showed a considerable reduction that was noted higher in substrate with P. sansibaricus than those by P. excavatus (organic C, t-test: P = 0.870; C:N ratio, t-test: P = 0.002). The growth (biomass increase) and reproduction parameters such as mean individual live weight …", "num_citations": "287\n", "authors": ["810"]}
{"title": "Review of research work in sinking EDM and WEDM on metal matrix composite materials\n", "abstract": " Metal matrix composites (MMCs) are newly advanced materials having the properties of light weight, high specific strength, good wear resistance and a low thermal expansion coefficient. These materials are extensively used in industry. Greater hardness and reinforcement makes it difficult to machine using traditional techniques, which has impeded the development of MMCs. The use of traditional machinery to machine hard composite materials causes serious tool wear due to the abrasive nature of reinforcement. These materials can be machined by many non-traditional methods like water jet and laser cutting but these processes are limited to linear cutting only. Electrical discharge machining (EDM) shows higher capability for cutting complex shapes with high precision for these materials. The paper presents a review of EDM process and year wise research work done in EDM on MMCs. The paper also …", "num_citations": "267\n", "authors": ["810"]}
{"title": "Nitrate contamination in groundwater of some rural areas of Rajasthan, India\n", "abstract": " Efforts were made to evaluate the level of nitrate in some agro-economy based rural habitations of northern Rajasthan, India. A total of 64 groundwater samples from 21 different villages/sub-villages of district Sri Ganganagar, India were collected and analyzed for nitrate (as NO3−), sulphate (as SO42−) and few other parameters. NO3− level in groundwater was 7.10–82.0 mg l−1 for individual samples. But average NO3− for total samples was 60.6 ± 33.6 (SD) mg l−1, which indicates the non-suitability of groundwater for drinking purposes, if BIS permissible limit (22.6 mg l−1) is considered as reference level. SO42− ranged form 28.6 to 660.3 mg l−1 in this area. The regression analysis indicates the difference sources for NO3− and SO42− contamination in different regions rather than a common source. The point and non-point sources of NO3− and SO42− in groundwater of this region may be N-fertilizer, sewerage …", "num_citations": "248\n", "authors": ["810"]}
{"title": "Benzimidazole: an emerging scaffold for analgesic and anti-inflammatory agents\n", "abstract": " Within the vast range of heterocycles, benzimidazole and its derivatives are found to be trendy structures employed for discovery of drugs in the field of pharmaceutical and medicinal chemistry. The unique structural features of benzimidazole and a wide range of biological activities of its derivatives made it privileged structure in drug discovery. Recently, benzimidazole scaffold has emerged as a pharmacophore of choice for designing analgesic and anti-inflammatory agents active on different clinically approved targets. To pave the way for future research, there is a need to collect the latest information in this promising area. In the present review we have collated published reports on this versatile core to provide an insight so that its full therapeutic potential can be utilized for the treatment of pain and inflammation.", "num_citations": "236\n", "authors": ["810"]}
{"title": "Toxicity, degradation and analysis of the herbicide atrazine\n", "abstract": " Excessive use of pesticides and herbicides is a major environmental and health concern worldwide. Atrazine, a synthetic triazine herbicide commonly used to control grassy and broadleaf weeds in crops, is a major pollutant of soil and water ecosystems. Atrazine modifies the growth, enzymatic processes and photosynthesis in plants. Atrazine exerts mutagenicity, genotoxicity, defective cell division, erroneous lipid synthesis and hormonal imbalance in aquatic fauna and nontarget animals. It has threatened the sustainability of agricultural soils due to detrimental effects on resident soil microbial communities. The detection of atrazine in soil and reservoir sites is usually made by IR spectroscopy, ELISA, HPLC, UPLC, LC–MS and GC–MS techniques. HPLC/LC–MS and GC–MS techniques are considered the most effective tools, having detection limits up to ppb levels in different matrices. Biodegradation of …", "num_citations": "212\n", "authors": ["810"]}
{"title": "Feasibility of vermicomposting in biostabilization of sludge from a distillery industry\n", "abstract": " The feasibility of vermicomposting technology to stabilize the distillery industry sludge mixed with a bulking agent (cow dung) in different proportions viz. 20% (T1), 40% (T2), 60% (T3) and 80% (T4), was tested using composting earthworm Perionyx excavatus for 90 days. The vermitreated sludge was evaluated for different physico-chemical parameters and all vermibeds expressed a significant decrease in pH (10.5–19.5%) organic C contents (12.8–27.2%), and an increase in total N (128.8–151.9%), available P (19.5–78.3%) as well as exchangeable K (95.4–182.5%), Ca (45.9–115.6%), and Mg contents (13.2–58.6%). Data suggested that inoculated earthworms could maximize the decomposition and mineralization rate, if sludge is used with appropriate bulking material for earthworm feed. Vermicomposting also caused significant reduction in total concentration of metals: Zn (15.1–39.6%), Fe (5.2–29.8%), Mn (2 …", "num_citations": "190\n", "authors": ["810"]}
{"title": "Fabrication and heat treatment of ceramic-reinforced aluminium matrix composites-a review\n", "abstract": " Ceramic-reinforced aluminium matrix composites have attracted considerable attention in engineering applications as a result of their relatively low costs and characteristic isotropic properties. Reinforcement materials include carbides, nitrides and oxides. In an effort to achieve optimality in structure and properties of ceramic-reinforced metal matrix composites (MMCs), various fabrication and heat treatment techniques have evolved over the last 20 years. In this paper, the status of the research and development in fabrication and heat treatment techniques of ceramic-reinforced aluminium matrix composites is reviewed, with a major focus on material systems in terms of chemical compositions, weight or volume fraction, particle size of reinforcement, fabrication methods and heat treatment procedures. Various optical measurement techniques used by the researchers are highlighted. Also, limitations and needs of the …", "num_citations": "177\n", "authors": ["810"]}
{"title": "Toxicity, monitoring and biodegradation of the fungicide carbendazim\n", "abstract": " The increasing use of toxic pesticides is a major environmental concern. Carbendazim is a systemic fungicide having wide applications for controlling fungal diseases in agriculture, forestry and veterinary medicines. Carbendazim is a major pollutant detectable in food, soil and water. Carbendazim extensive and repeated use induces acute and delayed toxic effects on humans, invertebrates, aquatic life forms and soil microorganisms. Here, we review the pollution, non-target toxicity and microbial degradation of carbendazim for crop and veterinary purposes. We found that carbendazim causes embryotoxicity, apoptosis, teratogenicity, infertility, hepatocellular dysfunction, endocrine-disrupting effects, disruption of haematological functions, mitotic spindle abnormalities, mutagenic and aneugenic effect. We also found that carbendazim disrupted the microbial community structure in various ecosystems. The …", "num_citations": "173\n", "authors": ["810"]}
{"title": "Earthworms as bioindicator of metals (Zn, Fe, Mn, Cu, Pb and Cd) in soils: is metal bioaccumulation affected by their ecological category?\n", "abstract": " The importance of earthworms in metal pollution monitoring is widely recognized in terrestrial ecosystems. Metal bioaccumulation by soil-dwelling earthworms can be used as an ecological indicator of metal availability in soils. In this study, we quantify the level of DTPA extractable metals in casts and tissues of earthworms (endogeic: Metaphire posthuma (Vaillant) and anecic: Lampito mauritii Kinberg) and ingesting soils, collected form cultivated land, urban garden and sewage soils. Soil and worm casts collected from sewage and cultivated land showed the greater metal concentrations. The concentration of Zn, Fe, Pb and Mn in earthworm casts was in the order: sewage soil > cultivated land > urban garden, while for Cu and Cd the order was cultivated land > sewage soil > urban garden. Data suggested that the level of DTPA extractable metals was higher than that of surrounding soils. We got close relationships …", "num_citations": "172\n", "authors": ["810"]}
{"title": "Probiotics: interaction with gut microbiome and antiobesity potential\n", "abstract": " Obesity is a metabolic disorder afflicting people globally. There has been a pivotal advancement in the understanding of the intestinal microbiota composition and its implication in extraintestinal (metabolic) diseases. Therefore, any agent modulating gut microbiota may produce an influential effect in preventing the pathogenesis of disease. Probiotics are live microbes that, when administered in adequate amounts, have been shown to confer health benefits to the host. Over the years, probiotics have been a part of the human diet in the form of different fermented foods consumed around the world. Their influence on different physiologic functions in the host is increasingly being documented. The antiobesity potential of probiotics is also gaining wide attention because of increasing evidence of the role of gut microbiota in energy homeostasis and fat accumulation. Probiotics have also been shown to interact with the …", "num_citations": "167\n", "authors": ["810"]}
{"title": "Phacoemulsification in eyes with white cataract\n", "abstract": " PurposeTo study the results of phacoemulsification in eyes with white cataract.SettingAravind Eye Hospital, Madurai, India.MethodsThis retrospective study comprised 212 consecutive patients with white cataract: 192 mature (90.6%), 11 intumescent (5.2%), and 9 hypermature (4.2%). Patients had phacoemulsification and continuous curvilinear capsulorhexis. After the nucleus was removed by the divide and conquer or the phaco chop technique, a posterior chamber intraocular lens was implanted. Preoperative and intraoperative findings, as well as postoperative outcomes, were analyzed.ResultsIntraoperative complications included premature entry of the tunnel into the anterior chamber in 4 eyes (1.9%), incomplete capsulorhexis in 60 (28.3%), posterior capsular tear in 4 (1.9%), conversion to a manual nonphacoemulsification technique in 4 (1.9%), intraoperative miosis in 7 (3.3%), and iris chafing in 2 (0.9 …", "num_citations": "155\n", "authors": ["810"]}
{"title": "Biotechnological potential of plant-associated endophytic fungi: hope versus hype\n", "abstract": " The potential of endophytes, particularly endophytic fungi, capable of demonstrating desirable functional traits worth exploitation using red biotechnology is well established. However, these discoveries have not yet translated into industrial bioprocesses for commercial production of biopharmaceuticals using fungal endophytes. Here, we define the current challenges in transforming curiosity driven discoveries into industrial scale endophyte biotechnology. The possible practical, feasible, and sustainable strategies that can lead to harnessing fungal endophyte-mediated pharmaceutical products are discussed.", "num_citations": "146\n", "authors": ["810"]}
{"title": "Performance of an anaerobic baffled reactor and hybrid constructed wetland treating high-strength wastewater in Nepal—A model for DEWATS\n", "abstract": " Centralized wastewater treatment systems require sophisticated technologies and skilled manpower for their operation and maintenance (O&M). These systems have huge construction as well as O&M costs. Therefore, a Decentralized Wastewater Treatment System (DEWATS) rather than a centralized system might be especially beneficial in developing countries. A model for DEWATS is developed in Nepal with Anaerobic Baffled Reactor (ABR) and hybrid Constructed Wetland (CW). The DEWATS treats high-strength wastewater from 80 households (400 PE). This paper summarizes the performance of the DEWATS from July 2006 to August 2007 in the removal efficiencies of TSS, BOD5, COD, NH4–N, TP and FC. The ABR is very effective in the removal of organic pollutants and could achieve TSS removal up to 91%, BOD5 up to 78% and COD up to 77%. The average removal efficiencies of the DEWATS is 96 …", "num_citations": "142\n", "authors": ["810"]}
{"title": "Fluoride contamination in drinking water in rural habitations of Northern Rajasthan, India\n", "abstract": " This study was carried out to assess the fluoride concentration in groundwater in some villages of northern Rajasthan, India, where groundwater is the main source of drinking water. Water samples collected form deep aquifer based hand-pumps were analysed for fluoride content. Fluoride in presently studied sites was recorded in the ranges of 4.78 and 1.01 mg/l. The average fluoride concentration for this region was recorded 2.82 mg/l. As per the desirable and maximum permissible limit for fluoride in drinking water, determined by WHO or by Bureau of Indian Standards, the groundwater of about 95 of the studied sites is unfit for drinking purposes. Due to the higher fluoride level in drinking water several cases of dental and skeletal fluorosis have appeared at alarming rate in this region. The middle and eastern parts of the Hanumangarh, a northern most district of the state, can be classified as higher risk …", "num_citations": "136\n", "authors": ["810"]}
{"title": "Rethinking production of Taxol®(paclitaxel) using endophyte biotechnology\n", "abstract": " Taxol® (generic name paclitaxel) represents one of the most clinically valuable natural products known to mankind in the recent past. More than two decades have elapsed since the notable discovery of the first Taxol®-producing endophytic fungus, which was followed by a plethora of reports on other endophytes possessing similar biosynthetic potential. However, industrial-scale Taxol® production using fungal endophytes, although seemingly promising, has not seen the light of the day. In this opinion article, we embark on the current state of knowledge on Taxol® biosynthesis focusing on the chemical ecology of its producers, and ask whether it is actually possible to produce Taxol® using endophyte biotechnology. The key problems that have prevented the exploitation of potent endophytic fungi by industrial bioprocesses for sustained production of Taxol® are discussed.", "num_citations": "134\n", "authors": ["810"]}
{"title": "Salicylic acid to decrease plant stress\n", "abstract": " Pollution and climate change degrade plant health. Plant stress can be decreased by application of salicylic acid, an hormone involved in plant signaling. Salicylic acid indeed initiates pathogenesis-related gene expression and synthesis of defensive compounds involved in local resistance and systemic acquired resistance. Salicylic acid may thus be used against pathogen virulence, heavy metal stresses, salt stress, and toxicities of other elements. Applied salicylic acid improves photosynthesis, growth, and various other physiological and biochemical characteristics in stressed plants. Salicylic acid antagonizes the oxidative damaging effect of metal toxicity directly by acting as an antioxidant to scavenge the reactive oxygen species and by activating the antioxidant systems of plants and indirectly by reducing uptake of metals from their medium of growth. We review here the use of exogenous salicylic acid in …", "num_citations": "128\n", "authors": ["810"]}
{"title": "Potential of plant growth promoting traits by bacteria isolated from heavy metal contaminated soils\n", "abstract": " Rhizobacteria can enhance biomass production and heavy metal tolerance of plants under the stress environment. The aim of this study was to collect soil samples from different industrial sites followed by their heavy metal analysis.  After performing the ICP-AES analysis of soil samples from seven different sites, bacterial strains were isolated from the soil samples of most polluted (heavy metal) site. Phylogenetic analysis of isolates based on 16S rDNA sequences showed that the isolates belonged to four species: Bacillus thuringiensis, Azotobacter chroococcum, Paenibacillus ehimensis and Pseudomonas pseudoalcaligenes. Plant growth promoting activities; siderophore production, indole acetic acid production, HCN production, and phosphate solubilisation were assayed in vitro, and statistically analysis done by using ANOVA analysis and Tukey’s Honestly Significant Difference test (p ≤ 0.05). Plant …", "num_citations": "127\n", "authors": ["810"]}
{"title": "Synthesis and pharmacological evaluation of novel 5-substituted-1-(phenylsulfonyl)-2-methylbenzimidazole derivatives as anti-inflammatory and analgesic agents\n", "abstract": " A series of novel 5-substituted-1-(phenylsulfonyl)-2-methylbenzimidazole derivatives have been synthesized. The structures of these compounds were established by IR, 1H NMR, 13C NMR, Mass spectral data and elemental analyses. Compounds were evaluated for their anti-inflammatory and analgesic activity as well as gastric ulcerogenic effects. Derivatives 4a, 4b and 4c exhibited moderate to good anti-inflammatory and analgesic activity in carrageenan-induced rat paw edema and acetic acid-induced writhing in mice, respectively, with low ulcerogenicity compared with the standard drug indomethacin.", "num_citations": "126\n", "authors": ["810"]}
{"title": "Entropy and channel capacity in the regenerative setup with applications to Markov channels\n", "abstract": " We obtain new entropy and mutual information formulae for regenerative stochastic processes. We use them on Markov channels to generalize the results in Goldsmith and Varaiya (1996). Also we obtain tighter bounds on capacity and better algorithms than in Goldsmith and Varaiya.", "num_citations": "124\n", "authors": ["810"]}
{"title": "PAINA systematic literature review: Refactoring for disclosing code smells in object oriented software\n", "abstract": " ContextReusing a design pattern is not always in the favor of developers. Thus, the code starts smelling. The presence of “Code Smells” leads to more difficulties for the developers. This racket of code smells is sometimes called Anti-Patterns.ObjectiveThe paper aimed at a systematic literature review of refactoring with respect to code smells. However the review of refactoring is done in general and the identification of code smells and anti-patterns is performed in depth.MethodA systematic literature survey has been performed on 238 research items that includes articles from leading Conferences, Workshops and premier journals, theses of researchers and book chapters.ResultsSeveral data sets and tools for performing refactoring have been revealed under the specified research questions.ConclusionThe work done in the paper is an addition to prior systematic literature surveys. With the study of paper the …", "num_citations": "61\n", "authors": ["810"]}
{"title": "Comparison and analysis of logistic regression, Naïve Bayes and KNN machine learning algorithms for credit card fraud detection\n", "abstract": " Financial fraud is a threat which is increasing on a greater pace and has a very bad impact over the economy, collaborative institutions and administration. Credit card transactions are increasing faster because of the advancement in internet technology which leads to high dependence over internet. With the up-gradation of technology and increase in usage of credit cards, fraud rates become challenge for economy. With inclusion of new security features in credit card transactions the fraudsters are also developing new patterns or loopholes to chase the transactions. As a result of which behavior of frauds and normal transactions change constantly. Also the problem with the credit card data is that it is highly skewed which leads to inefficient prediction of fraudulent transactions. In order to achieve the better result, imbalanced or skewed data is pre-processed with the re-sampling (over-sampling or under sampling …", "num_citations": "12\n", "authors": ["810"]}
{"title": "Prediction of level of severity of faults in software systems using density based clustering\n", "abstract": " There is lot of work done in prediction of the faults and fault proneness in the various kinds of software systems. But, it is the impact or level of severity of those faults which is more important than number of faults existing in the systems, as the major faults matters most for a developer than the minor ones and these major faults needs immediate attention. Density-Based Spatial Clustering of Applications with Noise (DBSCAN) is most widely used density based algorithm and has played a significant role in finding non linear shapes structure based on the density in various application domains. In this paper, the comparative analysis of performance of Density-Based Spatial Clustering of Applications with Noise (DBSCAN) and Neuro-Fuzzy System is done for prediction of level of severity of faults in the object oriented software systems and NASA’s public domain defect dataset is used.", "num_citations": "9\n", "authors": ["810"]}
{"title": "Text Similarity Measures in News Articles by Vector Space Model Using NLP\n", "abstract": " The present global size of online news websites is more than 200 million. According to MarketingProfs, more than 2 million articles are published every day on the web, but Online News websites have also circulated editorial content over the internet that specifies which articles to display on their website’s home pages and what articles to highlight, e.g., broad text size for main news articles. Many of the articles posted on a news website are very similar to many other news websites. The selective reporting of top news headlines and also the similarity among news across various news associations is well-identified but not very well calculated. This paper identifies the top news items on the news sites and measures the similarity between two same news items in two languages (Hindi and English) referring to the same event. To accomplish this, a highlighted headline and link extractor has been created to …", "num_citations": "5\n", "authors": ["810"]}
{"title": "Fake news detection of Indian and United States election data using machine learning algorithm\n", "abstract": " The world of digital media is thriving by the day and hence, there is an urge of businesses to magnify it more gaining them maximum financial benefits. This particular urge calls for more and more expansions concerning creating and developing new content whether it's in the form of websites that aims at branding businesses or could be in the form of online newspapers and magazines. Since from last few decades’ medium of communication had changed. Now a day people are using social networks very extensively for news updates. These networks aim to make social lives better. Today, everyone knows and uses social media which contains unverified article, post, message and news. Nowadays' fake news is making various issues from mocking articles to a created news and plan government publicity in certain outlets. Fake news and the absence of trust in the media are developing issues with immense …", "num_citations": "2\n", "authors": ["810"]}
{"title": "Defect prediction model of static code features for cross-company and cross-project software\n", "abstract": " Software project metrics are seen needless in software industries but they are useful when some unacceptable situations come in the project (Satapathy et al., Proceedings of the 48th annual convention of CSI, vol 2, 2013). Mainly the focus of various defect prediction studies is to build prediction models using the regional data available within the company. So companies maintain a data repository where data of their past projects can be stored which can be used for defect prediction in the future. However, many companies do not follow this practice. In software engineering, the crucial task is Defect prediction. In this paper, a binary defect prediction model was built and examined if there is any conclusion or not. This paper presents the assets of cross-company and within-company data against software defect prediction. Neural network approach has been used to prepare the model for defect prediction …", "num_citations": "1\n", "authors": ["810"]}
{"title": "Prediction Model to Investigate Influence of Code Smells on Metrics in Apache Tomcat\n", "abstract": " For advancing software maintenance process, attempts are necessitated at developers end. One such endeavour is applying refactoring to eliminate code smells from the software. The aim of refactoring process is to identify the smelly areas known as Code Smells. It makes the code livelier, easier to read and hence understanding of code increases. The aim of the paper is to perform an empirical analysis on the code smells and metrics. A set of object oriented metrics are selected for the study. Hence the study introduces a metric based prediction model of code smells. The paper initially introduces the statistical relationship between code smells and metrics. Based on the results neural network model development is made possible. The accuracy of the developed model is validated on machine learning algorithms. Four versions of Apache Tomcat (6.0, 7.0, 8.0, 8.5. 11) are selected for the work. Successive versions …", "num_citations": "1\n", "authors": ["810"]}