{"title": "Cluster based routing using a k-tree core backbone for mobile ad hoc networks\n", "abstract": " The problem of routing in Mobile Ad hoc Networks is non-trivial because of the dynamic nature of the network topology. In addition to computing shortest paths, as in wire-line networks, any routing scheme must consider that the topology of the network can vary while the packet is being routed. Cluster based schemes have been proposed which segregate the network into manageable sets for maintaining routing information. In this paper we propose a novel method of constructing the clusters and a backbone based on the concept of a k-tree core. We also propose an hierarchical routing scheme using this cluster information and evaluate its performance through extensive simulations.", "num_citations": "47\n", "authors": ["1722"]}
{"title": "An accurate infrared hand geometry and vein pattern based authentication system\n", "abstract": " In this paper, hand dorsal images acquired under infrared light are used to design an accurate personal authentication system. Each of the image is segmented into palm dorsal and fingers which are subsequently used to extract palm dorsal veins and infrared hand geometry features respectively. A new quality estimation algorithm is proposed to estimate the quality of palm dorsal which assigns low values to the pixels containing hair or skin texture. Palm dorsal is enhanced using filtering. For vein extraction, information provided by the enhanced image and the vein quality is consolidated using a variational approach. The proposed vein extraction can handle the issues of hair, skin texture and variable width veins so as to extract the genuine veins accurately. Several post processing techniques are introduced in this paper for accurate feature extraction of infrared hand geometry features. Matching scores are …", "num_citations": "42\n", "authors": ["1722"]}
{"title": "Distributed algorithms for finding and maintaining a k-tree core in a dynamic network\n", "abstract": " A k-core Ck of a tree T is subtree with exactly k leaves for k⩽nl, where nl the number of leaves in T, and minimizes the sum of the distances of all nodes from Ck. In this paper first we propose a distributed algorithm for constructing a rooted spanning tree of a dynamic graph such that root of the tree is located near the center of the graph. Then we provide a distributed algorithm for finding k-core of that spanning tree. The spanning tree is constructed in two stages. In the first stage, a forest of trees is generated. In the next stage these trees are connected to form a single rooted tree. An interesting aspect of the first stage of proposed spanning algorithm is that it implicitly constructs the (convex) hull of those nodes which are not already included in the spanning forest. The process is repeated till all non root nodes of the graph have chosen a unique parent. We implemented the algorithms for finding spanning tree and its k …", "num_citations": "20\n", "authors": ["1722"]}
{"title": "A code allocation protocol for maximizing throughput in CDMA based ad hoc networks\n", "abstract": " We consider here the problem of allocating variable length orthogonal codes in an ad hoc network based on CDMA. We consider a snapshot version of the problem at some instant. It had been proved earlier than even for a static set of communications and topology the problem is intractable. A greedy algorithm is stated to provide a bounded approximation to the throughput maximizing optimal allocation. We present a simple distributed code allocation protocol based on the greedy approximation. Simulation experiments show the enhanced throughput obtained by our protocol as compared to other code allocation schemes.", "num_citations": "18\n", "authors": ["1722"]}
{"title": "Ab Initio Potential Energy Curves for the Ground and Low-Lying Excited States of OH and OH– and a Study of Rotational Fine Structure in Photodetachment\n", "abstract": " Complete basis set extrapolated ab initio potential energy curves obtained from multireference configuration interaction (MRCI) level calculations for the ground state (X1Σ+) of OH–, and the ground state (X2Π) and the first excited state (A2Σ+) of OH are reported. The potential energy curves for the excited states A1Π, a3Π, and b3Π of OH– have been computed using the V6Z basis set at the MRCI level. Λ-doubling parameters p and q were calculated for the ground and the first excited vibrational states of the ground electronic state of OH using second-order perturbation theory. Using the computed potential energy curves and the rovibrational spectra for photodetachment including the fine splitting, the threshold for electron detachment has been computed. The result is in agreement with the experimental results of Goldfarb et al. [J. Chem. Phys. 1985, 83, 4364].", "num_citations": "11\n", "authors": ["1722"]}
{"title": "An accurate ab initio potential energy curve and the vibrational bound states of X2Σu+ state of H2\n", "abstract": " Potential energy curve for the X 2 Σ u+ state of H 2-has been computed at the full CI/cc-pVXZ (X= D− Q) level. An analytic function is fitted to the resulting potential energy curve and is then used to calculate the vibrational bound states of H 2-and compared with those for H 2.", "num_citations": "11\n", "authors": ["1722"]}
{"title": "Modular information hiding and type-safe linking for C\n", "abstract": " This paper presents CMod, a novel tool that provides a sound module system for C. CMod works by enforcing four rules that are based on principles of modular reasoning and on current programming practice. CMod's rules flesh out the convention that .h header files are module interfaces and .c source files are module implementations. Although this convention is well-known, existing explanations of it are incomplete, omitting important subtleties needed for soundness. In contrast, we have proven formally that CMod's rules enforce both information hiding and type-safe linking. To use CMod, the programmer develops and builds their software as usual, redirecting the compiler and linker to CMod's wrappers. We evaluated CMod by applying it to 30 open source programs, totaling more than one million LoC. Violations to CMod's rules revealed more than a thousand information hiding errors, dozens of typing errors …", "num_citations": "11\n", "authors": ["1722"]}
{"title": "Satisfiability-based program reasoning and program synthesis\n", "abstract": " Program reasoning consists of the tasks of automatically and statically verifying correctness and inferring properties of programs. Program synthesis is the task of automatically generating programs. Both program reasoning and synthesis are theoretically undecidable, but the results in this dissertation show that they are practically tractable. We show that there is enough structure in programs written by human developers to make program reasoning feasible, and additionally we can leverage program reasoning technology for automatic program synthesis.  This dissertation describes expressive and efficient techniques for program reasoning and program synthesis. Our techniques work by encoding the underlying inference tasks as solutions to satisfiability instances.  A core ingredient in the reduction of these problems to finite satisfiability instances is the assumption of templates. Templates are user-provided hints about the structural form of the desired artifact, e.g., invariant, pre- and postcondition templates for reasoning; or program templates for synthesis. We propose novel algorithms, parameterized by suitable templates, that reduce the inference of these artifacts to satisfiability.  We show that fixed-point computation---the key technical challenge in program reasoning---is encodable as SAT instances. We also show that program synthesis can be viewed as generalized verification, facilitating the use of program reasoning tools as synthesizers. Lastly, we show that program reasoning tools augmented with symbolic testing can be used to build powerful synthesizers with approximate guarantees.  We implemented the techniques developed in this …", "num_citations": "10\n", "authors": ["1722"]}
{"title": "Ab Initio Potential Energy Curves for the Ground and Low Lying Excited States of NH– and the Effect of 2Σ± States on Λ-Doubling of the Ground State X2Π\n", "abstract": " Complete basis set extrapolated ab initio potential energy curves obtained from multireference configuration interaction (MRCI) level calculations for the ground state (X2Π) and the a4Σ– state of NH– and the ground state (X3Σ–) of NH are reported. The potential energy curves for the A′2Σ– and A2Σ+ states of NH– have been computed using the V6Z basis set at the MRCI level. Λ-doubling parameters p and q are calculated for the ground and the first excited vibrational states of the ground electronic state of NH– using second-orderperturbation theory. The effect of the 2Σ+ and 2Σ– states on the Λ-doubling values is discussed. Earlier experiments had not considered the influence of the 2Σ– state on p and q while fitting the spectral data. Using the computed potential energy curves and the ro-vibrational spectra including the fine splitting, we have computed the threshold for electron detachment. The result is in …", "num_citations": "8\n", "authors": ["1722"]}
{"title": "Jahn–Teller and coupled Jahn–Teller/Renner–Teller effects in the calculation of adiabatic-to-diabatic transformation angle for the lowest three 2A′ states of NH2 (NHH)\n", "abstract": " We report here on the first study of topological effects for the NHH system, as carried out by treating simultaneously the two dominant effects of this system, namely, the Jahn–Teller (JT) effect and the Renner–Teller (RT) effect. Both the effects were treated rigorously as demanded by the Born–Oppenheimer approach. No approximations were made and in those cases where convergence was required, it was achieved by including the required number of states. The study concentrates on calculating the privileged adiabatic-to-diabatic transformation (ADT) angle γ12, along closed contours, which is the only needed angle to carry out the ADT in the case of relatively low energies. For this purpose, three coupled A′-states are usually considered and only in the last two extreme cases, where the area in configuration space becomes relatively large, namely 15–35 Å2, we had also to include an A″ state (the second Δ …", "num_citations": "7\n", "authors": ["1722"]}
{"title": "Resource optimization in CDMA based wireless ad hoc networks\n", "abstract": " The introduction of the concept of ad hoc grouping of portable terminals to form a wireless network spurred a large amount of interest in the field of wireless data communications. CDMA had been shown to outperform other multiaccess schemes and IEEE specifed the 802.11 set of standards for wireless LANs using a CDMA based physical layer. But the lack of proper provisions in 802.11 to provide a communication network without the existence of an access point resulted in extremely low data rates for truely ad hoc networks. In this project, we propose an MC-CDMA based physical layer for wireless ad hoc networks and present techniques to efficiently utilize network resources in a distributed manner.", "num_citations": "7\n", "authors": ["1722"]}
{"title": "Radiative lifetimes of spin forbidden a1Δ → X 3Σ− and spin allowed A3Π → X 3Σ− transitions and complete basis set extrapolated ab initio potential energy curves …\n", "abstract": " The spin forbidden transition a1Δ → X3Σ− in CH− has been studied using the Breit-Pauli Hamiltonian for a large number of geometries. This transition acquires intensity through spin-orbit coupling with singlet and triplet Π states. The transition moment matrix including more than one singlet and triplet Π states was calculated at the multi-reference configuration interaction/aug-cc-pV6Z level of theory. The computed radiative lifetime of 5.63 s is in good agreement with the experimental (5.9 s) and other theoretical (6.14 s) results. Transition moment values of the spin allowed A3Π → X3Σ− transition have also been calculated at the same level of theory. Calculations show that the corresponding radiative lifetime is considerably low, 2.4 × 10−7 s. Complete basis set extrapolated potential energy curves for the ground state of CH and the ground state and six low lying excited states (a1Δ, b1Σ+, two 3Π, and two 1Π) of CH …", "num_citations": "4\n", "authors": ["1722"]}
{"title": "Appendix to CMod: Modular Information Hiding and Type-Safe Linking for C\n", "abstract": " This brief note is an appendix to the paper \"CMod: Modular Information Hiding and Type-Safe Linking for C.\" It consists of the proof of soundness for the formal language presented in that paper.", "num_citations": "2\n", "authors": ["1722"]}