{"title": "Participation-based student final performance prediction model through interpretable Genetic Programming: Integrating learning analytics, educational data mining and theory\n", "abstract": " Building a student performance prediction model that is both practical and understandable for users is a challenging task fraught with confounding factors to collect and measure. Most current prediction models are difficult for teachers to interpret. This poses significant problems for model use (e.g. personalizing education and intervention) as well as model evaluation. In this paper, we synthesize learning analytics approaches, educational data mining (EDM) and HCI theory to explore the development of more usable prediction models and prediction model representations using data from a collaborative geometry problem solving environment: Virtual Math Teams with Geogebra (VMTwG). First, based on theory proposed by Hrastinski (2009) establishing online learning as online participation, we operationalized activity theory to holistically quantify students’ participation in the CSCL (Computer-supported …", "num_citations": "280\n", "authors": ["909"]}
{"title": "Performance and participation in open source software on github\n", "abstract": " A few studies have attempted to provide metrics of success in open source software (OSS) projects but the role a code hosting workspace plays in how performance is viewed and measured is little examined. We conducted qualitative, exploratory research with lead and core developers on three successful projects on GitHub to understand how OSS communities on GitHub measure success. These results were obtained in connection with a larger project that is designed to understand the structure of code hosting platforms in relation to participation and performance. We report two main findings. First, lead and core members of the projects we interviewed display a nuanced understanding of community participation in their assessment of success. Second, they attribute increased participation on their projects to the features and usability provided by GitHub.", "num_citations": "95\n", "authors": ["909"]}
{"title": "Building models explaining student participation behavior in asynchronous online discussion\n", "abstract": " Previous studies have invested much effort in understanding how participation in asynchronous online discussion affects student learning, and what factors influence student participation behavior. Results of these studies have been inconclusive and these investigations are often conducted from isolated perspectives. Relying on social cognitive theory, this study proposes two dynamic student participation models in online dialogue and particularly highlights understudied factors – collective efficacy, social ability, reading behavior, the time dimension of participation – to examine the mediation and causal relationship among those factors and their influence on learning. The models are tested utilizing data collected from a large US university. Specifically, while the predictive constructs are operationalized through the survey instruments, the outcome measures are modeled using electronic trace data and actual …", "num_citations": "85\n", "authors": ["909"]}
{"title": "Building a model explaining the social nature of online learning\n", "abstract": " Based on a framework emphasizing the social nature of learning, this research examines a model of how social constructs affect satisfaction within online learning using path analysis for students in higher education. The social constructs evaluated in this study include sense of community (SOC), social ability (SA), perceived ease of use (PEU) and usefulness (PU) of social awareness tools, and self-reported participation (SRP) in online courses. Students’ social ability is predicted by perceived ease of use of social awareness tools and self-reported participation. Satisfaction with online learning is explained by sense of community, social ability, and selfreported participation. Sense of community is shown to be a mediator of the relationships between social ability and satisfaction (SA⇨ S) and between perceived usefulness and satisfaction (PU⇨ S). Additionally, students’ social ability, perception of usefulness of …", "num_citations": "78\n", "authors": ["909"]}
{"title": "Completely online group formation and development: small groups as socio‐technical systems\n", "abstract": " Purpose – This paper has two purposes. First, to provide insight into the formation of completely online small groups, paying special attention to how their work practices develop, and how they form identity. Second, to pursue conceptual development of a more multi‐level view of completely online group experience, which can be made visible through analysis of the unique interaction logging system used in this study.Design/methodology/approach – The authors conduct a mixed methods study that integrates interviews, grounded theory analysis, case study methods and social network analysis to build a multi‐layered view of completely online group and community development.Findings – Completely online group formation is explicated as a socio‐technical system. The paper identifies themes of tool uptake and use, and patterns of interaction that accompany group formation and development of completely online …", "num_citations": "72\n", "authors": ["909"]}
{"title": "Twitter zombie: Architecture for capturing, socially transforming and analyzing the Twittersphere\n", "abstract": " Social computational systems emerge in the wild on popular social networking sites like Facebook and Twitter, but there remains confusion about the relationship between social interactions and the technical traces of interaction left behind through use. Twitter interactions and social experience are particularly challenging to make sense of because of the wide range of tools used to access Twitter (text message, website, iPhone, TweetDeck and others), and the emergent set of practices for annotating message context (hashtags, reply to's and direct messaging). Further, Twitter is used as a back channel of communication in a wide range of contexts, ranging from disaster relief to watching television. Our study examines Twitter as a transport protocol that is used differently in different socio-technical contexts, and presents an analysis of how researchers might begin to approach studies of Twitter interactions with a …", "num_citations": "66\n", "authors": ["909"]}
{"title": "Group informatics: A methodological approach and ontology for sociotechnical group research\n", "abstract": " We present a methodological approach, called Group Informatics, for understanding the social connections that are created between members of technologically mediated groups. Our methodological approach supports focused thinking about how online groups differ from each other, and diverge from their face‐to‐face counterparts. Group Informatics is grounded in 5 years of empirical studies of technologically mediated groups in online learning, software engineering, online political discourse, crisis informatics, and other domains. We describe the Group Informatics model and the related, 2‐phase methodological approach in detail. Phase one of the methodological approach centers on a set of guiding research questions aimed at directing the application of Group Informatics to new corpora of integrated electronic trace data and qualitative research data. Phase 2 of the methodological approach is a systematic …", "num_citations": "64\n", "authors": ["909"]}
{"title": "CSCL@ Work: Computer-supported collaborative learning at the workplace—making learning visible in unexpected online places across established boundaries\n", "abstract": " We introduce Computer-Supported Collaborative Learning (CSCL) at the workplace (CSCL@Work) as a conceptual framework for bridging the knowledge of researchers in the field of CSCL to work-based learning. Research in the field of Organizational Learning emerged in 1978, and gathered increased attention beginning in the 1990s when the questions were focused on how to create a culture and practices for sharing existing knowledge within a firm. In addition to managing existing knowledge sharing, managing the creation of new knowledge is important for firms today. But are they able to create new knowledge when the answer to a problem is not available? What cultures of learning exist to support this? Contemporary answers to these questions must recognize that learning is an implicit, often invisible component of work. Some firms even avoid the term “learning.” From the cases presented in this …", "num_citations": "60\n", "authors": ["909"]}
{"title": "Brewing up citizen engagement: the coffee party on facebook\n", "abstract": " With this study we seek to provide an understanding of the discourse and agenda setting practices of an online issue based political group,\" Join the Coffee Party Movement\"(JCPM) in the United States. The stated goals of JCPM are to establish a place for individuals who identify themselves as disenfranchised to discuss and take action on issues of social and economic policy in the US. JCPM is one example of hundreds of issue-based organizations emerging on Facebook worldwide. Since its inception in January 2010, over 344,000 Facebook members have become followers of the JCPM page. Our analysis of the text of the discourse and the social networks, which emerge on the JCPM page, show three surprising results. First, in contrast to prior studies, significant deliberative discourse among members emerges in this open, public space without prompting. Second, the discourse practices and structure that …", "num_citations": "54\n", "authors": ["909"]}
{"title": "Relief work after the 2010 Haiti earthquake: leadership in an online resource coordination network\n", "abstract": " The US Navy directed its vast resources at the relief effort following the Haiti Earthquake on January 12, 2010. To coordinate with non-governmental-organizations (NGOs) participating in the relief effort, the US Navy used an online discussion forum. What follows is an examination of the emergence, rise, on-the-ground utility and decline of this\" walled-garden\" style discussion forum. Our findings show that most site activity is broadcast oriented and does not result in discussion, but in the small percentage of cases where discussion emerges, participants are focused on the exchange of medical, Global Information Systems (GIS) and equipment on the ground oriented information. We show how activity on the discussion forum changes over time, and corresponds with events on the ground in Haiti. Four archetypical users are profiled to demonstrate how invisible brokerage style leadership, identified through grounded …", "num_citations": "53\n", "authors": ["909"]}
{"title": "Learning analytics in CSCL with a focus on assessment: an exploratory study of activity theory-informed cluster analysis\n", "abstract": " In this paper we propose an automated strategy to assess participation in a multi-mode math discourse environment called Virtual Math Teams with Geogrebra (VMTwG). A holistic participation clustering algorithm is applied through the lens of activity theory. Our activity theory-informed algorithm is a step toward accelerating heuristic approaches to assessing collaborative work in synchronous technology mediated environments like VMTwG. Our Exploratory findings provide an example of a novel, time-efficient, valid, and reliable participatory learning assessment tool for teachers in computer mediated learning environments. Scaling online learning with a combination of computation and theory is the overall goal of the work this paper is situated within.", "num_citations": "40\n", "authors": ["909"]}
{"title": "Network analysis of trace data for the support of group work: Activity patterns in a completely online course\n", "abstract": " A 16-student, completely online software design course was studied using social network analysis and grounded theory techniques. Bi-directional (read and post) log data of user activity was recorded to understand how small group networks change over time with activity type (individual, peer-to-peer, and small group). Network structure was revealed through sociograms and triangulated with discussion board topics and interview data on group experience. Results show significant differences in network structure across activity types, which are supported by open coding and axial coding of the text of member discussions and editing patterns of member work products. It is also indicated that bi-directional log data, contextualized to specific activities and artifacts, revealed a more accurate and complete description of small group activity than ordinary, uni-directional log data would have. Our findings have implications …", "num_citations": "39\n", "authors": ["909"]}
{"title": "Group learning assessment: Developing a theory-informed analytics\n", "abstract": " Assessment in Computer Supported Collaborative Learning (CSCL) is an implicit issue, and most assessments are summative in nature. Process-oriented methods of assessment can vary significantly in their indicators and typically only partially address the complexity of group learning. Moreover, the majority of these assessment methods require time-intensive coding of qualitative data. Our study explores the operationalization of activity theory to frame group activity in a CSCL context by breaking group work into six dimensions. We map log data generated by a collaborative software, Virtual Math Teams with Geogebra, with these dimensions and construct six measures to lay the groundwork for automating CSCL assessment. Next, we move beyond identification and analysis of those measures to infer group learning using human judgment and employ a clustering algorithm to categorize groups with similar …", "num_citations": "35\n", "authors": ["909"]}
{"title": "Connecting theory to social technology platforms: A framework for measuring influence in context\n", "abstract": " In this article, the authors synthesize 3 years of social technologies research, including studies of Facebook, Twitter, and GitHub, to present a theory driven framework to guide future social scientific research using “Big Data.” They connect levels of analysis derived from empirical study of influence to the electronic trace data generated by social technologies. Specifically, the authors outline a relationship between social media technology platforms, individual goals for participation, and emergent small groups to inform future research on influence in social technologies. They incorporate theory from small group literature, communities and networks of practice, and media theory to explicate a contextual framework for measuring influence. In their discussion, the authors build on the contrast between influence indicators in Facebook, Twitter, and GitHub to argue for a greater focus on the influence abstractions of …", "num_citations": "35\n", "authors": ["909"]}
{"title": "Cooperation and groupness: Community formation in small online collaborative groups\n", "abstract": " We present a detailed descriptive analysis of the adoption and adaptation of common online tools by a newly forming small group with a cooperative work task. We compare their use of different tools over the course of successive specific cooperative activities, and describe how they use these tools as objects in the formation of a small online community. General patterns of participation that recognize the physical contexts of online group members, and specific patterns of interaction that influence the formation of an online community are explicated. The results of this study have implications for understanding how tools and tasks influence group formation and sense of community in online systems.", "num_citations": "35\n", "authors": ["909"]}
{"title": "Connecting performance to social structure and pedagogy as a pathway to scaling learning analytics in MOOCs: an exploratory study\n", "abstract": " This exploratory study focuses on the design and evaluation of teaching analytics that relate social learning structure with performance measures in a massive open online course (MOOC) prototype environment. Using reflexive analysis of online learning trace data and qualitative performance measures we present an exploratory empirical study that: (a) rigorously evaluates a novel, multi‐dimensional performance construct; (b) describes differences in small group dynamics and structure; and (c) draws a connection between learning performance and group structure. Performance is operationalized using a combination of knowledge construction measurement from discussion boards, rigorous analysis of student work products and several indicators of small group identity in the course examined. Interview and observational data are used to develop an approach for deriving and validating a model of the social …", "num_citations": "34\n", "authors": ["909"]}
{"title": "Learning Analytics at\" Small\" Scale: Exploring a Complexity-Grounded Model for Assessment Automation.\n", "abstract": " This study proposes a process-oriented, automatic, formative assessment model for small group learning based on complex systems theory using a small dataset from a technology-mediated, synchronous mathematics learning environment. We first conceptualize small group learning as a complex system and explain how group dynamics and interaction can be modeled via theoretically grounded, simple rules. These rules are then operationalized to build temporally-embodied measures, where varying weights are assigned to the same measures according to their significance during different time stages based on the golden ratio concept. This theory-based measure construction method in combination with a correlation-based feature subset selection algorithm reduces data dimensionality, making a complex system more understandable for people. Further, because the discipline of education often generates …", "num_citations": "34\n", "authors": ["909"]}
{"title": "Twitter as virtual town square: Citizen engagement during a nationally televised Republican primary debate\n", "abstract": " The Internet and social media create a geographically independent virtual town square (Kavanaugh, Perez-Quinones, Tedesco, & Sanders, 2010) that transforms citizen participation in political discourse. In our study, we examine over 185,420 publically available Twitter messages (hashtag# CNNDebate) during a Republican Primary Debate in November 2011, hosted by CNN and viewed by over 3.5 million individuals in the United States. Through analysis of how individuals use the syntactical features of Twitter such as@-mentions,@ Reply’s, hashtags, links and retweets we identify how civic discourse occurs at different phases of a televised debate. Understanding how individuals engage with each other in an open forum has broad implications for understanding social media’s effect on civic engagement and information diffusion among elected officials, candidates and citizens. Our findings suggest that a significant number of the syntactical features specific to Twitter such as retweeting,@ reply’s and hashtags are utilized to relay information, engage in discourse and create new threads of discourse related to issues that are brought up during the debate.", "num_citations": "34\n", "authors": ["909"]}
{"title": "A sociotechnical mechanism for online support provision\n", "abstract": " Social support can significantly improve health outcomes for individuals living with disease, and online forums have emerged as an important vehicle for social support. Whereas research has focused on the delivery and use of social support, little is known about how these communities are sustained. We describe one sociotechnical mechanism that enables sustainable communities to provide social support to a large number of people. We focus upon thirteen disease-specific discussion forums hosted by the WebMD online health community. In these forums, small, densely connected cores of members who maintain strong relationships generate the majority of support for others. Through content analysis we find they provide informational support to a large number of more itinerant members, but provide one another with community support. Based on these observations, we describe a sociotechnical mechanism of …", "num_citations": "30\n", "authors": ["909"]}
{"title": "Shepherding and censorship: Discourse management in the Tea Party Patriots Facebook group\n", "abstract": " Political groups on social networking sites enable a new type of collaborative, political discourse among citizens. In this study, we show how political discourse in social media is distinct from prior studies of political groups on the Internet. Specifically, we use network analysis in combination with communication theory to examine conversational social networks that emerge from direct addressals between participants in 10 discussions on the Tea Party Patriots Face book page associated with the shooting of US Representative Gabrielle Giffords. Our findings identify singling out of other participants as a key tactic for clarifying and questioning inaccurate information, apply social network analysis to identify different behaviors between networks and describe the elimination of dissent from the Tea Party Patriots Face book page over time. Important questions of how users experience political discourse online, including …", "num_citations": "27\n", "authors": ["909"]}
{"title": "A context awareness system for online learning: Design based research\n", "abstract": " A design based research strategy examining the impressions and behavior of members of courses taught entirely online is used for refining a context-aware activity notification system (CANS). The findings show that CANS must address substantial variety in courses and members while also fitting with multitasking between online and real world activities for the members. Two dimensions of online tools to support learning in a multitasking environment were identified: salience and meaningfulness. Salience is the tuning of awareness information to a particular technological and pedagogical context. Meaningfulness is achieved by ensuring that awareness data for a particular context align with the mental model of users receiving it. The design that emerged to support the diverse and multitasking nature of online learning includes reporter mechanisms customizing context awareness to the course, members, and …", "num_citations": "27\n", "authors": ["909"]}
{"title": "iSocial: A 3D VLE for Youth with Autism\n", "abstract": " This poster provides an introduction and brief illustration of iSocial, a 3D-Virtual Learning Environment to support social competence development for youth with Autism Spectrum Disorders. We report the results of a field test of a partial implementation of iSocial in the Fall of 2008. Of note are some key lessons learned in how to adapt a successful clinic- based approach to the new medium, as well as lessons in the identification of needed social orthotics and identity representation for supporting social interaction for this special population. Despite numerous challenges in the implementation, the learners and guides were highly engaged in their virtual learning and responded positively to the experience.", "num_citations": "26\n", "authors": ["909"]}
{"title": "Tweet recall: Examining real-time civic discourse on Twitter\n", "abstract": " We present a preliminary analysis of# widebate, a hashtag to identify discourse related to two debates in the June 2012, Wisconsin Gubernatorial recall election. Our analysis identifies the differences in discourse between the two debates. We find that only 14% of individuals participate in discourse surrounding both of the debates. Further, we identify differences in the way that the most active individuals in the discourse utilize syntactical features. Our findings contribute to the limited literature examining technologically-mediated discourse related to political debates.", "num_citations": "25\n", "authors": ["909"]}
{"title": "The daily brew: The structural evolution of the Coffee Party on Facebook during the 2010 United States midterm election season\n", "abstract": " The activity of the Facebook Group, “Join the Coffee Party Movement” (Coffee Party), is studied during a seven-month period leading up to and following the 2010 United States Midterm election. During this time period, the Coffee Party Facebook Group Administrator account posted 872 parent posts, which received 152,762 comments from participants. We examine the resulting electronic trace data utilizing a method for analyzing weighted social networks of discourse . Our findings explore the network centralization and total post activity across three units of analysis: (a) time, (b) parent post category, and (c) specific parent posts. We report three key findings. First, the structure, centralization, and leadership within the network differ in four key time periods: the time preceding the midterm election, the week of the midterm election, the time following the midterm election, and the time period when the new Congress …", "num_citations": "24\n", "authors": ["909"]}
{"title": "Quantifying the effect of informational support on membership retention in online communities through large-scale data analytics\n", "abstract": " Participating in online health communities for informational support can benefit patients in various ways. For the online communities to be sustainable and effective for their participants, membership retention and commitment are important. This study explores how informational support requesting and providing by users holding different social roles (core user and periphery user) are related with participants' retention in the community. We first crawled six years of data in the WebMD fibromyalgia forum with around 200,000 posts and 10,000 users. Then a supervised machine learning model is trained and validated to automatically identify the requesting and providing informational support posts exchanged between the members in the community. Lastly, survival analysis was employed to quantify how the informational support requesting and providing by different social roles predicts the member's continued …", "num_citations": "23\n", "authors": ["909"]}
{"title": "Social intelligence in completely online groups-Toward social prosthetics from log data analysis and transformation\n", "abstract": " Technology mediated groups interact in surprising ways to produce coherent behavior that contributes to collective and individual ends. Traces of these activities are captured in system log data. In this report we use Erickson's application of human social intelligence to social computing as a frame for contrasting 3 studies of rich trace data captured from an online learning management system. First, we present a data-mining algorithm that is effective for identifying small group membership in dense networks. Second, we describe our use of social network analysis techniques to make online group development more visible. Third, we transform raw trace data into a weighted, social form that enables the development of prosthetics for social intelligence in online learning and work environments. Finally, we assert that thinking about \"social intelligence prosthetics\" will help the social computing research community to …", "num_citations": "23\n", "authors": ["909"]}
{"title": "Modeling performance in asynchronous CSCL: an exploration of social ability, collective efficacy and social interaction\n", "abstract": " Previous studies have invested effort in understanding the factors affecting student learning from isolated perspectives. Based on social cognitive theory, this study proposes two dynamic CSCL models of learning using understudied factors – system functionality, social ability, collective efficacy and social interaction – to examine mediation and causal relationships among these constructs and their influence on learning. The models are tested using data collected from a large US university. Specifically, while the predictive constructs are operationalized through the survey instruments, outcome measures are modeled using electronic trace data and actual evaluation information. Data is analyzed via the Partial Least Squares method. Results demonstrate close relatedness among the constructs and a different influencing mechanism on learning for each. The addition of social interaction as a factor to the learning model increases predictability of student learning as compared to models without this factor. The paper concludes with discussion of the implications of this study.", "num_citations": "20\n", "authors": ["909"]}
{"title": "The design of iSocial: A three-dimensional, multi-user, virtual learning environment for individuals with autism spectrum disorders to learn social skills\n", "abstract": " This paper describes the design of iSocial, a three dimensional virtual learning environment (3D VLE) for the rapidly increasing number of youth with Autism Spectrum Disorders (ASD). iSocial is a long-term project to build an application that can be used both to support substantial numbers of youth and helpers, and as a testbed for developing optimal forms of social orthotics and a community that will sustain and grow the system. While some early efforts have shown potential for the use of 3D VLEs with individuals with ASD, the key attribute of the iSocial project is the use of digital media for social orthotics (ways of implementing the VLE to enable social interaction for those with deficits) and collaborative features of 3D VLEs. This paper discusses previous efforts to use 3D virtual environments with individuals with ASD, and how we have used the constructs of individual presence, social presence, behavioral management and adaptivity as design constructs to guide the design and development of iSocial. The discussion shows how the proposed system moves beyond previous attempts to use 3D VLEs to teach social skills and also examines how the system might be used by individuals with ASD to learn social skills. In addition, results from a formative evaluation of the proposed system design with individuals with ASD are discussed. Finally, a discussion of the implications of the proposed iSocial system on learning and instruction is provided.", "num_citations": "18\n", "authors": ["909"]}
{"title": "Technologically mediated political discourse during a nationally televised GOP primary debate\n", "abstract": " Social media creates a geographically independent commons that transforms citizen participation in political discourse. In our study, we examine 185,420 publicly available Twitter messages during a Republican primary debate in November 2011, hosted by CNN and viewed by over 3.5 million individuals in the United States. We identify how activity differs at various phases of a televised debate and who the subjects of this discourse are through analysis of how individuals use the syntactical features of Twitter such as at-mentions, at-replies, and URLs. Understanding how individuals engage with each other in an open forum has broad implications for understanding social media’s effect on civic engagement and information diffusion among elected officials, candidates, and citizens. Our findings suggest that a significant number of the syntactical features specific to Twitter are used to relay information, engage in …", "num_citations": "17\n", "authors": ["909"]}
{"title": "Towards the Facilitation Of an Online Community of Learners: Assessing the Quality of Interactions in Yammer\n", "abstract": " This paper focuses on evaluating a theoretically informed approach to using social media as a means to support the development of a community of learners in an introductory human computer interaction course at a major US research university. Social network and communication analysis were used to examine the form and function of social interactions in Yammer. The data suggests that the theoretically informed approach to using Yammer succeeded in encouraging processes associated with a community of learners. The methods used in this paper may contribute to more effective ways of assessing the quality of discourse in socio-technical environments and the findings provide potential models for using social media as new contexts for developing conceptualization and discourse practices.", "num_citations": "17\n", "authors": ["909"]}
{"title": "Not just a wink and smile: an analysis of user-defined success in online dating\n", "abstract": " This study examines the publically available stories of self-identified successful couples that met using the online dating services Match. com, eHarmony, or OkCupid. We enumerate four main findings; 1) the distribution of relationship status (Dating, Engaged, Married) varies among websites, 2) approximately half of all stories explicitly thank the service they used, 3) the locations of successful couples from Match. com and eHarmony are not statistically different when analyzed at a regional level, and 4) while the distribution of these couples follows general population trends, there are low population density islands where many self-identified successful couples live. These findings, coupled with a review of the existing literature, establish the context for future research into the technological and societal contexts in which online dating exists. This research has broad impacts of informing the design and development of …", "num_citations": "17\n", "authors": ["909"]}
{"title": "Social ability in online groups: Representing the quality of interactions in social computing environments\n", "abstract": " We propose social ability as a construct that will contribute to the development of social computing models. Completely online group experiences vary according to the composition of tools, tasks and individuals. This conditionality creates challenges for social computing researchers who seek to model social behavior online. We use social ability as a frame to describe how members of completely online groups (COGs) experience the social nature of their interaction and how the nature of their social computing changes over time. We show how social ability measures for COG participants change during collaboration and describe how two social ability factors - social presence and perceived written communication skills - are related to participation and contribution in online group activities. The findings from this mixed methods study show that members who participate in online groups experience increases in …", "num_citations": "16\n", "authors": ["909"]}
{"title": "Eight observations and 24 research questions about open source projects: illuminating new realities\n", "abstract": " The rapid acceleration of corporate engagement with open source projects is drawing out new ways for CSCW researchers to consider the dynamics of these projects. Research must now consider the complex ecosystems within which open source projects are situated, including issues of for-profit motivations, brokering foundations, and corporate collaboration. Localized project considerations cannot reveal broader workings of an open source ecosystem, yet much empirical work is constrained to a local context. In response, we present eight observations from our eight-year engaged field study about the changing nature of open source projects. We ground these observations through 24 research questions that serve as primers to spark research ideas in this new reality of open source projects. This paper contributes to CSCW in social and crowd computing by delivering a rich and fresh look at corporately …", "num_citations": "15\n", "authors": ["909"]}
{"title": "3D virtual worlds: Assessing the experience and informing design\n", "abstract": " Teams meet in 3D virtual worlds more frequently than ever before, yet the tools for evaluating 3D collaboration environments are underdeveloped. To close the 3D collaboration tool evaluation gap, the authors integrate lessons from the gaming industry and distributed work research. They develop two complementary approaches. First, the individual user’s perspective using eye-tracking (ET) is addressed, and second, the collaborative experience of the group using a technique called All-Views-Qualitative-Analysis (AVQA) is evaluated. The latter integrates the points-of-view of all subjects in a small group collaborating on a creative work task in a 3 dimensional virtual world. The authors show how these techniques enable evaluation of 3D environment design from the perspective of human computer interaction theory and theories related to distributed work. The paper discusses why designers should seek ways to …", "num_citations": "14\n", "authors": ["909"]}
{"title": "Collaborative information behavior in completely online groups\n", "abstract": " This chapter situates collaborative information behavior in completely online groups as a phenomenon distinct from prior work understanding collaborative information behavior in face-to-face groups, free and open source software groups and Wikipedia groups. The unexpected diversity of information resources utilized by completely online group members is analyzed through Sonnenwald’s Information Horizons theory. Information practices of completely online group members are described, and the key themes of groups as information resources, the influence of tool change on collaborative information behavior online, and the focusing potential of collaborative information tools for completely online group work are explicated. Future research directions that explore the potential of COGs for distributed innovation; new types of collaborative information behavior and breaking down the digital divide are reviewed.", "num_citations": "14\n", "authors": ["909"]}
{"title": "11. Analyzing the Discourse of GeoGebra Collaborations\n", "abstract": " This is a position paper presenting a perspective on fundamental assumptions about doing, teaching and learning mathematics in the presence of computer and communicative technologies. Doing, teaching and learning mathematics are activities that centrally involve discourse. Computer and communication technologies can facilitate collaborative interactions around mathematical topics. This can make the processes of doing, teaching and learning mathematics visible to researchers in the traces of small-group interaction. Analysis of the discourse can reveal processes of mathematical group cognition. We argue for a view of mathematics as discourse and for a specific set of complementary approaches to analyzing collaborative math discourse.", "num_citations": "13\n", "authors": ["909"]}
{"title": "One-sided conversations: The 2012 presidential election on twitter\n", "abstract": " Technology has been promoted as a way to facilitate interactions across disparate groups of people. Political discourse has been historically constrained by geographic proximity of participants. The introduction of the Internet and specifically social media has altered these geographic constraints and political discourse is now one of the most prevalent activities in social media. As more individuals begin to use technology for political activity, understanding how the technology is used becomes increasingly important. Previous research exploring political discourse on social media has focused on one discrete event or a narrow time period. This narrow focus limits the understanding of the complex election environment. This study takes a longitudinal approach to examine the use of conversational syntactical features in Twitter derived from a 53 million Twitter message corpus collected during the 2012 Presidential …", "num_citations": "13\n", "authors": ["909"]}
{"title": "Learning analytics in outer space: a Hidden Naïve Bayes model for automatic student off-task behavior detection\n", "abstract": " Learning analytics (LA) has invested much effort in the investigation of students' behavior and performance within learning systems. This paper expands the influence of LA to students' behavior outside of learning systems and describes a novel machine learning model which automatically detects students' off-task behavior as students interact with a learning system, ASSISTments, based solely on log file data. We first operationalize social cognitive theory to introduce two new variables, affect states and problem set, both of which can be automatically derived from the logs, and can be considered to have a major influence on students' behavior. These two variables further work as the feature vector data for a K-means clustering algorithm in order to quantify students' different behavioral characteristics. This quantified variable representing student behavior type expands the feature space and contributes to the …", "num_citations": "13\n", "authors": ["909"]}
{"title": "# TwitterPlay: a case study of fan roleplaying online\n", "abstract": " Using the highly anticipated release of the film version of\" The Hunger Games\" series as a case study, this study explores online fan community practices that employ the technological affordances of Twitter. We examine roleplaying practices that extend the Hunger Games story for roleplayers and fans. We conducted a discourse analysis examining the practices of active roleplayers, who interact with thousands of other fans and fellow players to continue their experience of the story, and engage in what we term Twitter play. Our findings illustrate how roleplayers are able to use Twitter to expand their experience of media and story. By examining roleplayers' use of Twitter affordances, we find that these performers not only exhibit deep knowledge of their characters and the narrative, but also of Twitter, demonstrated by expanding the uses of the service's affordances to playfully connect the story with popular culture …", "num_citations": "13\n", "authors": ["909"]}
{"title": "Advice reification, learning, and emergent collective intelligence in online health support communities\n", "abstract": " Online health support forums utilize straightforward online discussion designs to create a sociotechnical space where people can seek social support from others. The advice generated in these forums exists as an archival resource for future health information seekers. The present study uses mixed methods to investigate how invisible social processes lead advice to be adapted over time by forum members. Drawing on the construct of ‘reification’ from the communities of practice (COP) literature, we operationalize the reification of advice (RoA) as a process by which advice is developed across multiple discussion threads, and construct an algorithmic procedure to extract posts that trace this process. We evaluate our algorithm with crowd-workers, and perform an inductive, qualitative analysis to identify different modes of advice reification. We suggest that RoA could be used as the basis of a mid-level theory that …", "num_citations": "12\n", "authors": ["909"]}
{"title": "Network analytic techniques for online chat\n", "abstract": " Multivocal analysis applies two or more research methods to the same data set and then applies reflexivity in a joint analysis to achieve greater insights than would be possible with a single method. In this pilot study, we demonstrate how the application of specific methods are influenced by the ordering of the methods, and present a guideline for future multivocal analysis of online chat data using network analytic techniques. We do this in two phases. First, we use Stahl’s ethnomethodological analysis of one session of biology chat discourse to inform decisions about how to identify and weight implicit connections between participants. Implicit connections are useful because they can be easily automated and presented in real time. We then contrast Stahl’s analysis with the networks we derive from those implicit connections, showing some similarities. Second, we use Tatiana to construct …", "num_citations": "12\n", "authors": ["909"]}
{"title": "Sifting signal from noise: a new perspective on the meaning of tweets about the ‘big game’\n", "abstract": " A good deal of Twitter research focuses on event-detection using algorithms that rely on keywords and tweet density. We present an alternative analysis of tweets, filtering by hashtags related to the 2012 Superbowl and validated against the 2013 baseball World Series. We analyze low-volume, topically similar tweets which reference specific plays (sub-contexts) within the game at the time they occur. These communications are not explicitly linked; they pivot on keywords and do not correlate with spikes in tweets-per-minute. Such phenomena are not readily identified by current event-detection algorithms, which rely on volume to drive the analytic engine. We propose to demonstrate the effectiveness of empirically and theoretically informed approaches and use qualitative analysis and theory to inform the design of future event-detection algorithms. Specifically, we propose theories of Information Grounds and “third …", "num_citations": "11\n", "authors": ["909"]}
{"title": "Challenges for national civic engagement in the United States\n", "abstract": " Civic Engagement on the Internet is rapidly evolving. Successful examples of citizen engagement are prominent in recent global media coverage and are the subject of the authorʼs recent paper examining the use of Facebook for national political issues in the United States. With this workshop paper we present a brief overview of some current initiatives of civic engagement at the national level in the United States. We use these examples to form a basis to discuss the challenges facing civic engagement efforts. At the conclusion of the paper we present a series of questions to help inform and examine new and existing civic engagement issues. Although the discussion is specific to the United States, the questions may also apply to other countries and governments throughout the world.", "num_citations": "11\n", "authors": ["909"]}
{"title": "Comparing the social interaction pattern of online one-on-one peer and small group collaboration activities\n", "abstract": " This paper investigates how students' experience in an online learning environment varies across small group and one-on-one peer activities. Particular attention is paid to measures of sense of community and social ability. A multiple data analyses, including statistical analysis and social network analysis (SNA), are used to triangulate findings. The statistical findings show differences in perceived sense of community and social ability between different group compositions. The findings are confirmed by interaction patterns found in SNA.", "num_citations": "11\n", "authors": ["909"]}
{"title": "Designing computer‐supported collaborative learning at work for rural IT workers: Learning ensembles and geographic isolation\n", "abstract": " This paper presents the results of a 9‐month ethnographic and action research study of rural technology workers where computer support for collaborative learning through workplace technologies was introduced to a US‐based technology firm. Throughout the implementation of this support and participation, issues related to geographic isolation are contrasted with the information and learning needs of 89 employees. The development of information seeking, cataloguing and coordination practices through technology is described. Resulting insights have led to the identification of learning ensembles as an informal, socio‐technical unit of organization within geographically isolated firms. Learning ensembles are hypothesized as a bridge between the mid‐level, limited knowledge required in order to perform particular duties at the firm, and the greater potential of individual team members that is enabled by …", "num_citations": "10\n", "authors": ["909"]}
{"title": "Context matters: The experience of physical, informational, and cultural distance in a rural IT firm\n", "abstract": " We synthesize social informatics and regional studies literature to frame an examination of the role of information and communication technologies (ICT) uptake and use in the social experience of distance in a rural technology firm. Though distance is much talked about and regarded as a critical dimension in distributed work, the distinct ways that distance is experienced within a rural firm influence collaboration between the rural firm and its more urban customers and are little explored. This case-study town sheds light on how ICT use influences the experience of distance and collaboration in a remote location. In the first part of our results, we provide a descriptive account of the unique geographical, technical, and collaboration practice characteristics of the rural technology firm. In the second part of our results, we identify three experiences of distance: physical, cultural, and informational. We then synthesize our …", "num_citations": "10\n", "authors": ["909"]}
{"title": "The method to the madness: The 2012 United States presidential election Twitter corpus\n", "abstract": " Social media provides a rich environment for understanding social connections, interactions and information sharing across many aspects of society. The relative ease of access to social media data through provision of application program interface's (API) by social media companies has led to a significant number of studies that attempt to understand how social media fits into society and how the public uses it for discourse and information sharing. One of the existing gaps in these studies is the lack of extensive description of the data collection and processing methods. These gaps exist as a result of word limits in existing publication venues and a lack of appropriate publication venues to share this type of fundamental research. The following paper provides extensive detail as to how a 52 million corpus of Twitter data on the 2012 Presidential Election in the United States was collected, parsed and analyzed. This …", "num_citations": "9\n", "authors": ["909"]}
{"title": "Context aware CSCL: moving toward contextualized analysis\n", "abstract": " Groups change over time. CSCL groups, unliGe face to face groups, leave evidence of their interactions behind in the form of system logs. Most CSCL log analysis is opportunistic, relying on electronic traces which do not provide information about use context, user content reading behavior or insights about relations among users. To enable context rich analysis of student interactions, we developed a context aware notification system (CANS). In this paper we describe how such logs are processed and analyzed to support the development of multi-mode social networGs. In prior studies we reported on analysis of these networGs from CANS logs and context enriched logging systems focused on the small group unit of analysis. The purpose of this paper is to increase understanding of the methods we use within the CSCL community. We use CANS logs to create awareness of the social experience of online learning and emergent group formation.", "num_citations": "9\n", "authors": ["909"]}
{"title": "Multi-user support for virtual geogebra teams\n", "abstract": " This is a paper on innovative development activities to create a multi-user format for the GeoGebra interface. The Virtual Math Teams Project has for several years been developing an online environment to support small groups of students to engage in collaborative learning of mathematics. The software environment integrates synchronous and asynchronous media and associated tools. It supports a shared whiteboard, wiki pages, text chat and, most recently, an innovative multi-user version of GeoGebra. This will allow teams of students to work together—even globally—on dynamic mathematics constructions and discussions. This paper discusses some design considerations for an environment to support collaborative learning with GeoGebra—it is a technological design paper, assuming math educational goals discussed elsewhere.The Virtual Math Teams (VMT) Project grew out of the Problem-of-the-Week (PoW) service at the Math Forum. The Math Forum is a well-established online resource for improving math learning, teaching and communication (Renninger & Shumar, 2002). Operating since 1992, the Math Forum is now visited by several million different visitors a month. Its PoW service provides challenging problems for K-12 students on a weekly basis. These problems are primarily oriented to individual student work, and exemplary student solutions are posted to the http://mathforum. org site. The original idea of the VMT Project was to provide similar stimulating problems for small groups of students to work on collaboratively over the Internet (Stahl, 2006; 2009).", "num_citations": "9\n", "authors": ["909"]}
{"title": "A sociocultural approach to using social networking sites as learning tools\n", "abstract": " This paper focuses on evaluating a socio-cultural activity design (SCAD) model for using discussion-based social networking tools as a means to support the development of an online community of learners. Participants included 38 undergraduate students enrolled in a human-centered design course at a large, US university. The SCAD model includes concrete markers for identifying expected interactional, communication patterns for a community of learners. In order to examine the utility of our model we asked, (RQ1) to what extent do social network patterns coincide with expected outcomes for a community of learners; (RQ2) To what extent do students’ cognitive activities in the environment match expected outcomes for a community of learners. To answer these questions, we conducted social network and content analysis of 503 posts in an online discussion-based social networking tool. We examined …", "num_citations": "8\n", "authors": ["909"]}
{"title": "Group informatics: A multi-domain perspective on the development of teaching analytics\n", "abstract": " In this position paper, I argue that the separation of learning analytics, teaching analytics and other mechanisms for viewing the relationship between electronic trace data and performance will be enhanced by a perspective that takes related work in other domains into account. I present a few examples from domains I have developed statistical and visual analytics for as exemplars of how a research program might accomplish the fluid transfer of analytics research across domains in a way that impacts teaching and learning. I begin by characterizing some of the limitations I see in learning analytics generally, and which I argue remain salient issues in the development of teaching analytics. In both cases, the goal is to advance learning. Prior research measuring “online learning” performance has a number of limitations and inconsistencies. First, prior studies of online learning groups do not relate the temporality of group development as a central aspect of analysis, yet group performance, structure and identity are widely understood to change over time (Gersick, 1988; Knowles & Knowles, 1955; Tuckman, 1965). Second, learning performance is not consistently measured or is not measured at all. Student grades are frequently used as a method of convenience, but their limited utility as a measure for learning performance is well documented. Third, there is wide variation in the meaning of words like “online” and “computer supported collaborative learning”. In some studies online groups are those who meet partially online and partially face to face (Cho, Gay, Davidson, & Ingraffea, 2007; Cress, Barquero, Buder, & Hesse, 2005; Johnson, Suriya …", "num_citations": "7\n", "authors": ["909"]}
{"title": "Assessing multiple perspectives in three dimensional virtual worlds: Eye tracking and all views qualitative analysis (AVQA)\n", "abstract": " The Human Computer Interaction community is beginning to wrestle with the challenges of effective interaction design for groups collaborating in 3 dimensional virtual worlds. Understanding of the requirements and design processes necessary to support these new technologies is still emerging. While the gaming community has developed heuristics for game design over a 25 year period, the adaptation of this knowledge for the design of virtual collaboration spaces has been limited. Following a research through design approach, we create novel integrations and applications of Human Computer Interaction research methods in an attempt to understand the collaborative work of a small group of individuals in a 3 dimensional virtual world. Specifically, the fine grained perspective provided by eye-tracking (ET), and a more coarse unit of analysis, provided by All-Views-Qualitative-Analysis (AVQA), are applied to …", "num_citations": "7\n", "authors": ["909"]}
{"title": "The role of social information for social ability, sense of community and satisfaction in online learning\n", "abstract": " The purpose of this study is to explore the relationship and influence of enhanced social information on the social nature of online learning. A survey was implemented to collect students’ perceptions about their online learning experience across six online courses in a mid-west university. The results show students’ ways of accessing social information and their appreciation of the usefulness of social information for their learning goals influences their social ability, sense of community, and satisfaction in online learning. Additionally, aspects of students’ social ability differentially influence a sense of community and learning satisfaction. Perceptions of peers’ and instructor’s social presence and comfort in sharing personal information with others impacts the sense of community, and perceptions of the instructor’s social presence and sense of community impact learning satisfaction.", "num_citations": "7\n", "authors": ["909"]}
{"title": "Designing sustainable online support: Examining the effects of design change in 49 online health support communities\n", "abstract": " Online social support communities can significantly improve health outcomes for individuals living with disease. Although they are well studied in the literature, little research examines how sociotechnical design changes influence the sustainability of support communities for different medical conditions. We compare the impact of a single design change on 49 disease‐specific health support forums hosted on the WebMD platform, a popular online health information service. A statistical analysis showcases changes in posting patterns before and after the design intervention; a subsequent interpretive examination of forum content reveals how the design change affected members' perceived affordances of the platform. Our findings suggest that, despite differences between communities, the design change triggered a common set of cascading effects: it made it difficult for core users to create and maintain relationships …", "num_citations": "6\n", "authors": ["909"]}
{"title": "Using humanitarian free and open source software (HFOSS) to introduce computing for the social good\n", "abstract": " Humanitarian Free and Open Source Software (HFOSS) is a category of free and open source software that improves the human condition. HFOSS projects focus on a range of societal needs including microfinance, healthcare, education, and disaster relief. Many HFOSS projects are developed by international teams whose goal is to make the world a better place. These projects are often primarily used in developing nations, but many have been adopted across the world because of the robustness of the software and the ability to contribute to its direction and applications. HFOSS projects have been successfully infused into the computing curriculum at a number of institutions in a range of ways and courses [1]. The benefits of introducing students to HFOSS projects potentially includes improved students learning, increased motivation to study computing, attracting women to computing and increased appreciation …", "num_citations": "6\n", "authors": ["909"]}
{"title": "Quality Hackathon: Evaluating the Products of Online Co-Production Systems\n", "abstract": " This full-day workshop focuses on building Big Social Data research competencies for scholars interested in issues of contribution quality and contributor performance in online co-production systems that generate value through contributions by volunteers. The workshop is designed to engage discussion and promote co-working through a hackathon format to stimulate productive conversation and learning, using shared data sets to provide a common focus for participants to engage questions of contribution quality and contributor performance with multiple disciplinary, theoretical, and analytical backgrounds.", "num_citations": "6\n", "authors": ["909"]}
{"title": "OCData Hackathon@ CSCW 2014: online communities data hackathon\n", "abstract": " Online Communities data is prevalent in CSCW research, but the approaches to collecting, managing, analyzing and visualizing large scale social data varies on a lab by lab basis. The OCData hackathon is aimed at creating a community opportunity to share approaches to online communities research at the level of data. Integrating data, tools and theories to address interesting research questions remains a challenge for the community.", "num_citations": "6\n", "authors": ["909"]}
{"title": "Context Matters: ICT’s Effects on Physical, Informational and Cultural Distance in a Rural IT Firm\n", "abstract": " We synthesize social informatics and regional studies literature to frame an examination of the role of ICT uptake and use in the social experience of distance in a rural technology firm. Though distance is much talked about and regarded as a central component of distributed work, the distinct ways that distance is experienced within a rural firm and influences collaboration between the rural firm and its more urban customers is little explored (we found no prior studies). The concerns for economic development, resource agglomeration and knowledge spillover between firms that emerge from regional studies literature are examined using a social informatics frame to describe how one firm successfully developed in an isolated region. This case study sheds light on how ICT use influences the experience of distance and collaboration in a rural technology firm; bringing new knowledge into the social informatics …", "num_citations": "6\n", "authors": ["909"]}
{"title": "Tracing knowledge evolution in online forums\n", "abstract": " In this article, we describe our experiences with an approach for tracing the evolution of knowledge in online conversation data. Knowledge Evolution Analysis (KEvA) works by tracking evolving clusters of co-occurring words, and reveals how knowledge flows across discussion threads and is combined by people whose activities spans threads.We briefly present a version of the KEvA algorithm and describe its application to two different corpuses. First, we describe an analysis of small decision-making teams using two versions of an online decision support platform. KEvA identifies where participants jointly create new insights and reveals how the platform itself influences the creation of these insights.", "num_citations": "6\n", "authors": ["909"]}
{"title": "Emergent networks of topical discourse: A comparative framing and social network analysis of the Coffee Party and Tea Party Patriots groups on Facebook\n", "abstract": " In this chapter, we examine and compare the activity in the two politically focused Facebook groups, “Join the Coffee Party Movement” and “Tea Party Patriots,” from the time period immediately preceding the 2010 mid-term elections through the week following the seating of the newly elected Congress (October 25, 2010–January 12, 2011). We incorporate social network analysis of electronic trace data coupled with a framing analysis of the topics posted by the group administrators (parent posts) to provide an understanding of the agenda setting practices of administrators and subsequent discourse from the participants that occur in these two groups. Through this analysis we identify three interesting findings. First, there are shared topics of discourse that are framed differently in the two groups.", "num_citations": "6\n", "authors": ["909"]}
{"title": "Cscl@ work: Making learning visible in unexpected online places across established boundaries\n", "abstract": " The authors introduce Computer-Supported Collaborative Learning (CSCL) at the workplace (CSCL@ Work) as a conceptual framework for bridging the knowledge of researchers in the field of CSCL to work-based learning. In contemporary firms, shepherding the creation of new knowledge is of equal importance, and is driven by two primary research questions. First, how do organizations create new knowledge when the answer to a particular problem is not available within the firm? Second, what cultures of learning must and do exist to support solving problems when the answer is not known within an organization? Contemporary answers to these questions must recognize that learning is an implicit, often invisible component of work, and explicitly decouple the construct of learning from its main western institutionalization, the school. To advance thinking in this area, the authors undertook a meta analysis of 8 …", "num_citations": "5\n", "authors": ["909"]}
{"title": "Design, influence, and social technologies: techniques, impacts, and ethics\n", "abstract": " Our actions and opinions-\" what we know and believe, how we behave and make decisions\"-are embedded in and shaped by webs of social relationships. Small individual actions that flow within networks can lead to broad systemic dynamics that fundamentally impact how societies function economically, socially, and culturally.", "num_citations": "5\n", "authors": ["909"]}
{"title": "Collaborative information seeking in an online political group environment\n", "abstract": " In this paper, we present a framework for examination of group formation and information exchange on a Facebook Group,“Join the Coffee Party Movement”, that was created in response to the Tea Party Movement in the US. The stated goals of “Join the Coffee Party Movement” are to establish a place for otherwise disenfranchised individuals to share information and engage in productive dialogue and to develop solutions for problems facing the USA. Similar movements exist in other countries and social networking technology has been utilized to further the ideology and mobilize supporters of various national and international causes. Since its inception in January 2010, over 300,000 Facebook members have become followers of the Coffee Party. The Group’s page has over 155,000 discussion comments to official postings. Preliminary analysis of this dialogue suggests two intertwined avenues for investigation. First, it is clear that the Coffee Party Facebook page represents one virtual group through which many different virtual subgroups emerge from online discourse. Second, the groups that are emerging do so as a consequence of having a shared information need, which is fulfilled to some extent through participation in this group. These groups exhibit a certain type of completely online collaborative information behavior that we think warrants investigation from multiple perspectives. How members of online groups like these collaboratively seek information is of importance for this workshop; but we believe our broader perspective will be of interest.", "num_citations": "5\n", "authors": ["909"]}
{"title": "Context-aware activity notification system: supporting CSCL.\n", "abstract": " This poster provides an introduction to the Context-Aware Activity Notification System (CANS) and a brief discussion of its design research process. We report the results of three phases of design work. The cumulative results suggest progress toward useful activity visualizations to support forms of social and collaborative learning. The notifications can raise motivation to participate, enhance awareness of group, class, and self-activity, increase participation, and support awareness of instructional and problem-solving opportunities.", "num_citations": "5\n", "authors": ["909"]}
{"title": "Mission HydroSci: Distance learning through game-Based 3D virtual learning environments\n", "abstract": " Distance Learning through game-based 3D virtual learning environments has promise for helping rural and other communities that have become increasingly dependent upon online learning to meet the Next Generation Science Standards. The team developing Mission HydroSci (MHS) envisions a learning product that integrates a game-based 3D VLE with a learning progressions approach to curriculum and innovative methods for teacher support and learning analytics. MHS uses an eight level game which at each level immerses students in a simulation environment for learning about water systems and then requires the student to put that knowledge into practice in a context of developing their competencies for scientific argumentation. This chapter describes the vision for MHS at the beginning of the development process funded by a grant award from the Investing in Innovation (i3) Fund of the US Department …", "num_citations": "4\n", "authors": ["909"]}
{"title": "Assessment analytics in CSCL: Activity theory based method\n", "abstract": " In this exploratory study, we present and apply an automated student participation analysis method derived from activity theory. We show how it can be used in a specific computer supported collaborative learning (CSCL) environment (Virtual Math Teams with Geogrebra--VMTwG), and provide holistic analysis of individual student participation according to aggregate behavior, in order to inform teaching and assessment practices.", "num_citations": "4\n", "authors": ["909"]}
{"title": "Designing Socio-Technical Systems to Support Guided\" Discovery-Based\" Learning in Students: The Case of the Globaloria Game Design Initiative.\n", "abstract": " This in-progress research study investigates middle school students’ use of a wiki-based e-learning platform as a coordinating representation in the context of their guided discovery-based game design work. The study aims to (a) consider/validate the quality of wiki trace data and Google Analytics page read data as a source of insight for research;(b) describe group activity patterns using wiki trace data and Google Analytics page read data;(c) investigate relationships between measured activity patterns and student learning outcomes;(d) develop appropriate algorithms for early detection of success trajectories, and to establish formative assessment diagnostic tools deriving from actual user behavior patterns in situ. This research holds implications for instructional design optimization of the e-learning system under investigation, curriculum and professional development support for educators involved, for quality of actual student learning outcomes, and, for the wider field of e-learning systems design and learning analytics.", "num_citations": "4\n", "authors": ["909"]}
{"title": "Social media discourse and culture: A proposal for comparative informatics research\n", "abstract": " Public discourse is rapidly evolving through the use of social media platforms including Facebook, Twitter and others. Though often discussed in terms like “social media”, or even more general terms like “web 2.0”, social media platforms are not homogeneous. The reflexive relationship between social media and culture will be different for each combination of culture and social media platform. The Comparative Informatics community focuses attention on the role of culture in ICT uptake and use. Comparative Informatics examines the need for governments to consider the diverse cultures they serve when developing ICTs for eGovernment (Robertson, 2010), reflects on the cultural biases embedded in current technology, including the keyboard (Nardi, Vatrapu, & Clemmensen, 2011) and questions web 2.0 visions of global collaboration and remixing (Hughes & Lang, 2006) unencumbered by cultural differences (Cervantes, Nardi, & Kow, 2010). Social media is one component of web 2.0 that affords many opportunities for Comparative Informatics research. One important contribution of Comparative Informatics research in the area of social media will be the development of a more thorough understanding of the relationship between culture and social media uptake and use. This proposal focuses on the reflexive construction of culture through discourse using social media.Discourse is an appropriate construct for Comparative Informatics research on social media because discourse is the mechanism these media share. Social media discourse includes an immeasurable number of topics that are not fully catalogued and a manageable set of …", "num_citations": "4\n", "authors": ["909"]}
{"title": "Advancing an Industry/Academic Partnership Model for Open Collaboration Research\n", "abstract": " We propose a full day workshop focused on characterizing areas of research within the domain of Open Collaboration Systems (OCS's) where partnerships between academic and industry researchers can both increase our scientific understanding of OCS's and also support those systems through research. This workshop's purpose is to bring together researchers on both sides of the\" data divide\" to identify current challenges and opportunities for future research within these research areas, and to develop a preliminary set of requirements for improved resource sharing and collaboration between OC enterprises and academic research institutions.", "num_citations": "3\n", "authors": ["909"]}
{"title": "Collaborative assessment tool: a data-centric approach\n", "abstract": " Our study explores the operationalization of Activity Theory toward the holistic framing of collaborative math learning activity in a social-technical context by breaking down group work into the six dimensions as found in the theory. We then map the electronic trace data generated by the collaborative software (Virtual Math Teams) with these dimensions and construct six measures. Next, a clustering algorithm is coded to categorize groups with similar participation performance, which allows us to consider the six indicators simultaneously. Last, in terms of the complexity of group learning in a socio-technical context, we discuss a web-based tool that shows assessment of groups and individuals in CSCL and thus provides teachers with a holistic and multi-perspectival view of group learning.", "num_citations": "3\n", "authors": ["909"]}
{"title": "Exercising Control: A Comparative Study of Government Agencies and their Relationships with the Public Using Social Media\n", "abstract": " We frame the exercise of control through social media not as power-over or oppression, but in its broader sense, as purposive influence toward a predetermined goal. We focus on one growing channel of control; social media use for official communication between government agencies and the public. This paper introduces a framework for analyzing social media use and interaction between government agencies and the public, focusing on a comparative analysis of two consumer protections agencies; one, the Konsumentverket in Sweden, the second, the Consumer Financial Protection Bureau in the US. Contrasting the efficacy and practices associated with social media as a communication tool for citizens and their governments in different societies may lead to important insights regarding local and global applications of new media. The proposed framework is grounded in the concept of active co-construction of reality via Giddens structuration theory, as expanded on by Orlikowski. While this provides a useful lens for understanding the construction of government and public interaction, it does not provide a methodology for examining the discourse in action. To do this we embed critical discourse analysis in structuration theory and use algorithms and methods from social media research (group informatics and TwitterZombie) to collect data and identify social networks. The analysis includes examinations of the written policy as well as the discourse or text published via Twitter and Facebook. In this paper we present our synthesis of structuration theory, computational social science and social media research that emerges from our dozens of …", "num_citations": "3\n", "authors": ["909"]}
{"title": "CSCL@ work revisited-beyond CSCL and CSCW? are there key design principles for computer supported collaborative learning at the workplace?\n", "abstract": " We propose an interdisciplinary workshop to explore key design principles of collaborative learning in the workplace. The workshop's theme is, simply\" CSCL at the workplace\". Our first workshop at ACM Group 2010, and the resulting book, raise an important set of issues and potentials for research, but does not solve the thorny and controversial issues. This workshop will be focused on for making progress on the identified issues. The ACM Group conference remains an ideal venue for a workshop on this topic because the North American and European communities who participate in Group include leading members of the international CSCL and CSCW communities. The proposed workshop will be a full day. It will open with a situating presentation by the organizers and, participant questions and proposed solutions aimed at the issues we have raised and begun to recognize, and focus working groups on the …", "num_citations": "3\n", "authors": ["909"]}
{"title": "The 2012 Wisconsin Gubernatorial Recall Twitter Corpus\n", "abstract": " In the following document we detail what we identify as the Wisconsin Gubernatorial Recall Twitter Corpus. This dataset represents two and half months of collection surrounding and incorporating the June 2012 Wisconsin Gubernatorial Election collected using the Group Informatics Lab Infrastructure TwitterZombie at Drexel University (Black, Mascaro, Gallagher, & Goggins, 2012). This document is a précis for the larger dataset. We intend this document to be a way share with other researchers the type of syntactical feature use we identified in a statewide political race that many deemed to have national implications in a General Election year. Through this sharing we hope to build on existing knowledge about political discourse on Twitter and we welcome any researchers who are interested in collaborating in this space.", "num_citations": "3\n", "authors": ["909"]}
{"title": "Computer supported collaborative learning at work: CSCL at work\n", "abstract": " We propose an interdisciplinary workshop to explore collaborative learning in the workplace. The workshop's theme is, simply\" CSCL at work\". The ACM Group conference is an ideal venue for a workshop on this topic because the North American and European communities who participate in Group include leading members of the international CSCL and CSCW communities. The proposed workshop will be a full day. It will open with a situating presentation by the organizers and be followed by topically oriented small group breakout sessions. To participate in the workshop, discussants will be asked for a position paper of up to 4 pages in standard ACM format. Up to three papers will be selected for featured talks in the afternoon. The workshop will conclude with a decision on next steps. We have an outstanding book proposal with Springer on this topic, and an edited book is one possible next step.", "num_citations": "3\n", "authors": ["909"]}
{"title": "Collaborative information behavior: The case of an interdisciplinary Charrette\n", "abstract": " We present early findings from an ethnographic study of the information behaviors of nine groups with three to eight members each, conducted during a ten day interdisciplinary design Charrette (period of intense, collaborative design activity). Information from the organizers is shared using a portal that includes a rich set of social awareness, social navigation and information production tools. Six of the groups select different, publicly available technologies to support information sharing and production during the Charrette. Our poster will present two interconnected findings. First, technology choice diffuses according to physical adjacency of the groups. Second, technology choice influences collaborative information behavior (CIB) within each group.", "num_citations": "3\n", "authors": ["909"]}
{"title": "The rising tide: Open source’s steady transformation\n", "abstract": " Open source projects are transforming. Today, work within open source projects has come to be influenced by a growing set of companies and individuals who receive financial remuneration for their engagement. As such, there is a central focus on commoditization and commercialization of open source products, which drives a trend towards a concealment of the various inner workings that produce these products. Within this shift, the product becomes a central aim of open source project engagement, and the means of production becomes incidental. In this paper, we explore the HCI research and design implications of the transformation of open source projects as part of commercial work and how we can come to better understand and protect the rising tide of open source projects.", "num_citations": "2\n", "authors": ["909"]}
{"title": "Big data factories: Collaborative approaches\n", "abstract": " The book proposes a systematic approach to big data collection, documentation and development of analytic procedures that foster collaboration on a large scale. This approach, designated as “data factoring” emphasizes the need to think of each individual dataset developed by an individual project as part of a broader data ecosystem, easily accessible and exploitable by parties not directly involved with data collection and documentation. Furthermore, data factoring uses and encourages pre-analytic operations that add value to big data sets, especially recombining and repurposing. The book proposes a research-development agenda that can undergird an ideal data factory approach. Several programmatic chapters discuss specialized issues involved in data factoring (documentation, meta-data specification, building flexible, yet comprehensive data ontologies, usability issues involved in collaborative tools, etc.). The book also presents case studies for data factoring and processing that can lead to building better scientific collaboration and data sharing strategies and tools. Finally, the book presents the teaching utility of data factoring and the ethical and privacy concerns related to it. Chapter 9 of this book is available open access under a CC BY 4.0 license at link. springer. com", "num_citations": "2\n", "authors": ["909"]}
{"title": "The Open Community Data Exchange: Advancing Data Sharing and Discovery in Open Online Community Science\n", "abstract": " While online behavior creates an enormous amount of digital data that can be the basis for social science research, to date, the science has been conducted piecemeal, one Internet address at a time, often without social or scholarly impact beyond the site’s own stakeholders. Scientists lack the tools, methods, and practices to combine, compare, contrast, and communicate about online behavior across Internet addresses or over time. In response, we are building the infrastructure for computational social scientists, social scientists, and citizens to make corresponding advances in our understanding of online human interactions. In this chapter, we present our effort to (1) specify the Open Community Data Exchange (OCDX) metadata standard to describe datasets, (2) introduce concepts from the data curation lifecycle to social computing research, and (3) describe candidate infrastructure for creating, editing …", "num_citations": "2\n", "authors": ["909"]}
{"title": "The open community data exchange: advancing data sharing and discovery in open online community science\n", "abstract": " While online behavior creates an enormous amount of digital data that can be the basis for social science research, to date, the science has been conducted piecemeal, one internet address at a time, often without social or scholarly impact beyond the site's own stakeholders. Scientists lack the tools, methods, and practices to combine, compare, contrast and communicate about online behavior across internet addresses or over time. In response, we are building the infrastructure for computational social scientists, social scientists, and citizens to make corresponding advances in our understanding of online human interactions. In this paper, we present our effort to specify the Open Community Data Exchange (OCDX) metadata standard to describe datasets, as well as the necessary infrastructure for creating, editing, viewing, sharing, and analyzing manifests. The purpose of this paper is to communicate the current …", "num_citations": "2\n", "authors": ["909"]}
{"title": "An exploration of “localness” on twitter during the 2012 US elections\n", "abstract": " This poster presents an exploratory method used to analyze the geography of Twitter use. A shift has taken place in political speech from local to diffuse online environments, which necessitates the use of new tools and methods to analyze discourse. As such, this study presents a geo‐spatial analysis of tweets to members of the U.S. Congress in 2012 to aid researchers carrying out comparable research in the future. This poster also presents summarized findings about the sometimes localized, often national distribution of geo‐located tweets to Congress members. This poster concludes by calling for discussion about spatial analysis and social media tools, while highlighting methodological problems encountered in this study and offering directions for future research.", "num_citations": "2\n", "authors": ["909"]}
{"title": "Taming a menagerie of heavy tails with skew path analysis\n", "abstract": " The discovery of stable, heavy-tailed distributions of activity on the web has inspired many researchers to search for simple mechanisms that can cut through the complexity of countless social interactions to yield powerful new theories about human behavior. A dominant mode of investigation involves fitting a mathematical model to an observed distribution, and then inferring the behaviors that generate the modeled distribution. Yet, distributions of activity are not always stable, and the process of fitting a mathematical model to empirical distributions can be highly uncertain, especially for smaller and highly variable datasets.", "num_citations": "2\n", "authors": ["909"]}
{"title": "Using analytics for activity awareness in learning systems\n", "abstract": " The purpose of this design case is to tell the story of our work to design context-aware activity notification for learning management systems. The story of the design experience is not simple, in that it includes research and development, conceptual evolution, implementation and extinction, and multiple phases, including inspiration for future products. The main character in our story is the Context-aware Activity Notification System (CANS). CANS was created by researchers and students in a university laboratory and started (as do many designs) while doing something else; became a dissertation; drew FIPSE (Fund for the Improvement of Postsecondary Education) funding; was implemented over a number of years in a localized setting; eventually could no longer be supported; and continues to provide inspiration for visions of new forms of online learning. The design process is described across three phases: 1 …", "num_citations": "2\n", "authors": ["909"]}
{"title": "Towards Optimization of Macrocognitive Processes: Automating Analysis of the Emergence of Leadership in Ad Hoc Teams\n", "abstract": " An important focus for technical research related to machine learning has been to address not only generalization across sub-community structures within a hierarchical dataset, but also accommodating changes over time in a longitudinal dataset using evolving behavior models. We have two prototype models built and working and are extending that work to make it more scalable to larger datasets. We completed a highly scalable model, being able to be applied to networks with millions of users. We validated the model on 3 different data sets from Massive Open Online Courses and found that the sub-community structure identified by the algorithm was predictive of differences in dropout rate between subsets of students.Descriptors:", "num_citations": "2\n", "authors": ["909"]}
{"title": "The ethos and pragmatics of data sharing\n", "abstract": " The focus of this panel is the pragmatics of data sharing as framed by the needs and pressures of scholarly work. Panelists represent a lively blend of quantitative, qualitative and mixed methods researchers with recent experiences in developing and sharing data. Panelists will present research and address questions related to data collection and management, human subjects protocols, data archival and data repositories and other emergent issues.", "num_citations": "2\n", "authors": ["909"]}
{"title": "Assessing the structural fluidity of virtual organizations and its effects\n", "abstract": " A major advantage of Virtual Organizations (VOs) is flexible membership and participation. VO members are able to join and leave VOs at will, and can change whom they collaborate with at any point in time. Such flexibility may make VOs more efficient in the completion of collaborative work than traditional organizations. However, efficiency is only one of several measures of organizational performance; and flexibility in a virtual organization includes both how VO structures may be more fluid and adaptive, and how VO leadership emerges and evolves throughout the VO lifecycle. The aim of this chapter is to: (1) define and quantitatively assess the actual flexibility of participation in VOs, through a social network index that we call structural fluidity; and (2) measure the relationship between fluidity and performance in the work carried out within the VO. These are essential insights for the development of …", "num_citations": "2\n", "authors": ["909"]}
{"title": "Big social data for social and information scientists\n", "abstract": " Our proposed workshop is focused on helping to build Big Social Data collection, management, analysis and visualization research competencies in the iSchool Community.", "num_citations": "2\n", "authors": ["909"]}
{"title": "Collaboration in isolation: bridging social and geographical boundaries in two rural technology firms\n", "abstract": " Little attention has been given to understanding how technology is used to bridge social and geographical boundaries between metropolitan and rural firms in developed nations like the United States.  In this paper we draw on theory from social worlds to contrast the introduction and integration of collaboration technologies in two small (23-53 employees) rural technology firms in the Midwestern US.  We report on a three-year ethnographic study of the work practices and technologies used to forge relationships between distant offices and customers at each firm.  Data include participant observation, field notes, memos and interviews with 71 informants.   Based on our data, we identified organizational facets of geography, socio-technical configuration and collaboration practices as instrumental in the formation of working spheres [31] for members of each firm.  As the facets of each firm change over time, our data show social, organizational and technical practices lead to different types of virtual organization at each firm.  One firm’s working spheres coalesce, while the other firm’s working spheres split.  We show that small firms operating in rural areas experience unique social and geographic boundaries in their development as virtual organizations.", "num_citations": "2\n", "authors": ["909"]}
{"title": "Coffee or Tea: The Emergence of Networks of Discourse in Two Online Political Groups\n", "abstract": " BACKGROUNDFacebook groups associated with The Coffee Party and The Tea Party illustrate the different manifestations of political mobilization in the virtual space. The Coffee Party Facebook Group (Join the Coffee Party Movement) has over 358,000 followers and evolved from a strictly virtual presence to one that now exists in the physical world. In contrast, the Tea Party and their largest Facebook group (Tea Party Patriots) has over 657,500 followers and exists as an extension of a movement that began in the physical world.", "num_citations": "2\n", "authors": ["909"]}
{"title": "HIB & HCI: Common interests in different communities\n", "abstract": " New connections between research and practice are necessary to address human information behavior in an increasingly technologically mediated world.  Socio-technical systems for encountering, finding and sharing information have become sophisticated enough to blur the boundary between human and computer, and transform important design and research questions in human computer interaction (HCI) to questions for which human information behavior research (HIB) offers a deep tradition.  We sought to understand present connections between these two progressively more interrelated research areas by performing a citation analysis of prominent HIB research with the most prominent publications in the HCI field.  While the conceptual affinity between the two research fields is increasingly strong, the production of ideas and the exchange of research agendas between them is weak in the citations we analyzed.  We propose a number of explanations for this gap, and suggest a more activist research agenda by HIB in the realm of HCI as one potential means for bridging this gap.", "num_citations": "2\n", "authors": ["909"]}
{"title": "Mission HydroSci: a progress report on a transformational role playing game for science learning\n", "abstract": " Mission HydroSci is a game-based 3D virtual environment for enacting transformational role-playing for middle school science students. Student-players will be engaged in a narrative about needing to investigate water resources and use scientific argumentation to complete missions critical to the survival and accomplishments of the members of their scientific enterprise. Our poster presents our progress in years 1 and 2 of a funded project to integrate pedagogical and gameplay objectives, and build mechanisms for purposeful player engagement and activity.", "num_citations": "1\n", "authors": ["909"]}
{"title": "Breaking into new data-spaces: Infrastructure for open community science\n", "abstract": " Despite being freely accessible, open online community data can be difficult to use effectively. To access and analyze large amounts of data, researchers must become familiar with the meaning of data values. Then they must also find a way to obtain and process the datasets to extract their desired vectors of behavior and content. This process is fraught with problems that are solved over and over again by each research team/lab that breaks into a new dataset. Those who lack the necessary technical skills may never be able to start.", "num_citations": "1\n", "authors": ["909"]}
{"title": "Student assessment in small groups: A spectral clustering model\n", "abstract": " Enabling the formative assessment of students while limiting demands on teachers’ time is a significant concern for technology mediated learning in small groups. Previous approaches have either required extensive time commitments on the part of teachers or relied on the development of special computational models of behavior. Oftentimes, these models overlook the way in which traces of student interaction in a learning system also constitute traces of human behavior, and, act only as “blunt instruments” relying only on the automated accounting of student activities. We employ activity theory to categorize traces of student behavior captured from a Virtual Math Teams (VMT) geometry class in an online, synchronous environment. From this, six semantically-grounded measures are generated for each student. Using these, a recently-developed clustering algorithm – spectral clustering – is coded to identify students who have similar behavior patterns. Structured in such a fashion, the theoretical and computational approach taken allows for an automated and meaningfully-grounded assessment of student performance, enabling teachers to offer concrete and personalized help in a timely format.", "num_citations": "1\n", "authors": ["909"]}
{"title": "Looking@ position: Examining the location of Twitter handles in a political event\n", "abstract": " In the following poster we examine how differences in location of @--‐mentions constitute both differences in meaning and social signaling in the context of the 2012 United States Presidential election. Through our analysis we establish that the Twitter handles of Barack Obama and Mitt Romney have distinctly different positions in tweets where they are mentioned. We expand on this finding by exploring how these positions change over time and how different syntactical features affect this position.", "num_citations": "1\n", "authors": ["909"]}
{"title": "Challenges for the facilitation of political discourse in technologically-mediated environments\n", "abstract": " In the following workshop paper we provide a brief overview of existing research on technologies that have been used to engage the citizenry in the electoral process in the United States. We trace the early use of USENET for political discourse through the recent reliance of political candidates on social networking technologies for mobilizing support and engaging with the public. We use this prior research to identify a series of challenges that campaigns and issue groups may face when utilizing technology to engage in public discourse. Although we focus on the political discourse in the United States, our research has broader applications for understanding political coordination and discourse throughout the world.", "num_citations": "1\n", "authors": ["909"]}
{"title": "The science of socio-technical systems in iSchools\n", "abstract": " This workshop builds on and extends an effort begun in 2005 that led to the 2008 Summer Research Institute of the Consortium for the Science of Socio-Technical Systems (CSST). This Research Institute, supported by the National Science Foundation and held at the University of Michigan, brought together a diverse set of researchers, including the fields of science and technology studies, human-computer interaction, management and organizational studies, library and information science, sociology, social informatics, and computer science, to begin exploring and framing a future research agenda centered on socio-technical research. We now propose a workshop as a follow-on to the 2009 iConference to invite iSchool faculty and students to join the emerging CSST network and work to tailor its broad goals to both reflect and support the research being pursued within the greater iSchool community. We see this workshop as continuing and expanding on the 2008 Summer Research Institute.", "num_citations": "1\n", "authors": ["909"]}
{"title": "Knowledge construction, social identity and social network structure in completely online groups\n", "abstract": " Working, learning and informal information-seeking behavior is rapidly moving online. It will increasingly involve collaboration within small groups meeting online. While this process is being driven by technological innovation, the important socio-technical issues of human computer, human-human and human-information interaction under the new conditions are less well understood. Completely online groups (COGS) are phenomena that have emerged in computer supported collaborative learning (CSCL) environments. This mixed methods study examines the development of eight completely online groups in a CSCL course held at the University of Missouri during the summer of 2008. The principal contribution of this work is a new and deeper understanding of completely online groups and the diverse development trajectories they follow. This work also contributes a methodologically rich research design that leads to the comprehensive description of the context and experiences of completely online groups. The results presented include patterns of completely online small-group development, and the relation of those patterns to differences in social ability, group efficacy and information horizons among the groups and their members. Completely online small-group development is characterized through detailed analysis of social-network structure, patterns of group-knowledge construction and trajectories of group-identity formation.", "num_citations": "1\n", "authors": ["909"]}
{"title": "Big Data Factories\n", "abstract": " Human interactions facilitated by social media, collaborative platforms, and the blogosphere generate an unprecedented volume of electronic trace data every day. These traces of human behavior online are a unique source for understanding contemporary life behaviors, beliefs, interactions, and knowledge flows. The social connections we make online, which reveal multiple types of human connection, are also recorded on a scale and to a level of granularity previously unimaginable, except possibly by science fiction writers. To many in the data analytics world, these traces are a gold mine. New sub-domains of inquiry have emerged as a consequence of this revolution: computational social science, big data, data science, open innovation data analytics, network science, and undoubtedly new ones yet to appear in the near future. Massive amounts of data, each counting millions of data records and behaviors, are …", "num_citations": "1\n", "authors": ["909"]}