{"title": "Software metrics: an overview of recent results\n", "abstract": " The groundwork for software metrics was established in the seventies, and from these earlier works, interesting results have emerged in the eighties. Over 120 of the many publications on software metrics that have appeared since 1980 are classified and presented in five tables that comprise, respectively, 1.(1) the use of classic metrics,2.(2) a description of new metrics,3.(3) software metrics through the life cycle,4.(4) code metrics and popular programming languages, and5.(5) various metric-based estimation models.", "num_citations": "120\n", "authors": ["1219"]}
{"title": "The COSMIC Functional Size Measurement Method–Version 3.0. 1–Measurement Manual\n", "abstract": " CiNii 論文 - The COSMIC Functional Size Measurement Method version 3.0, Measurement Manual CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす 大学 図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考 文献 出版年 年から 年まで 検索 検索 検索 CiNii窓口業務の再開について The COSMIC Functional Size Measurement Method version 3.0, Measurement Manual ABRAN A. 被引用 文献: 1件 著者 ABRAN A. 収録刊行物 http://www.gelog.etsmtl.ca/cosmic-ffp/updates/COSMIC_method_V3.zip http://www.gelog.etsmtl.ca/cosmic-ffp/updates/COSMIC_method_V3.zip, 2007 被引用文献: 1件中 1-1件を 表示 1 COSMIC法による機能規模測定の信頼性評価 野中 誠 , 長野 伸一 , 荒木 盛次 , 菊本 正紀 情報処理学会研究報告. SE,ソフトウェア工学研究会報告 160, 17-24, 2008-06-19 参考文献…", "num_citations": "21\n", "authors": ["1219"]}
{"title": "Estimateurs de la taille d'un logiciel à partir des spécifications de conception\n", "abstract": " Cette étude présente des modèles d'estimation de la taille d'un logiciel mesurée en nombre de lignes de code. L'originalité de l'étude provient du fait que les métriques utilisées pour prédire le nombre de lignes de code sont disponibles durant la phase de conception d'un logiciel. Les modèles sont mis au point de façon empirique en procédant à l'analyse de quatre échantillons de mesures provenant de logiciels conçus à l'aide d'organigrammes structurels ainsi que d'un échantillon de mesures provenant d'un logiciel conçu à l'aide de diagrammes d'enchaînement d'écrans.  Les modèles sont évalués à l'aide de six critères. Dans un cas, l'évaluation du modèle permet de conclure à une applicabilité immédiate.", "num_citations": "2\n", "authors": ["1219"]}
{"title": "An automated approach for evaluating programs in an academic environment\n", "abstract": " This paper discusses an experiment in which we measure Halstead's effort, McCabe's cyclomatic complexity and the inter-connectivity metric for forty-two student Pascal programs. We then correlate these values with the marks attributed to the programs by the course marker. From this analysis, we present some probing insights into the field of automatic program measurement and suggest further research topics. i. introductionMuch progress has been made in the field of programming over the past twenty years, especially with the advent of structured programming, but relatively little of this progress has been quantified. We strongly believe that quantifying attempts, such as the one presented in this paper and others (BASI83, HARR66, JENS85, KAFU85, ROMD85, SHEN85, VESS84, VESS86), will grant us a better understanding of high and low quality programming.", "num_citations": "2\n", "authors": ["1219"]}