{"title": "Critical success factors for software projects: A comparative study\n", "abstract": " Although there have been studies completed on the critical success factors of software projects, these studies all have been specific to one particular country. There has been no comprehensive study reporting on different project sizes in various domains and in multiple countries. We present our extensive literature survey of critical success factors that impact software projects. Forty-three articles from the years 1990 to 2010 were found to be significant contributions that could be analysed in order to develop a list of critical factors that specifically affect the success of software projects. The method of content analysis and frequency analysis was adopted. Twenty-six critical success factors were found to be related to software project success. We suggest that organisation or project manager is attentive to control the top five critical factors to drive towards project success since the percentage of frequency of occurrences …", "num_citations": "306\n", "authors": ["1150"]}
{"title": "Combining ITIL, COBIT and ISO/IEC 27002 in order to design a comprehensive IT framework in organizations\n", "abstract": " Several frameworks, tools and standards have been included in IT management systems, in organizations. However, on their own, they are not comprehensive enough to serve as efficient IT management system. This paper reviews two established frameworks, i.e. ITIL, COBIT and a standard, ISO/IEC 27002 focusing on their similarities and differences. It then proposes a comprehensive framework by integrating the three general framework and standards into an IT framework that could be used in every company.", "num_citations": "205\n", "authors": ["1150"]}
{"title": "Exploratory factor analysis; concepts and theory\n", "abstract": " Exploratory factor analysis is a complex and multivariate statistical technique commonly employed in information system, social science, education and psychology. This paper intends to provide a simplified collection of information for researchers and practitioners undertaking exploratory factor analysis (EFA) and to make decisions about best practice in EFA. Particularly, the objective of the paper is to provide practical and theoretical information on decision making of sample size, extraction, number of factors to retain and rotational methods.", "num_citations": "203\n", "authors": ["1150"]}
{"title": "A framework for knowledge management system implementation in collaborative environment for higher learning institution\n", "abstract": " “Knowledge management (KM) system” is a phrase that is used to describe the creation of knowledge repositories, improvement of knowledge access and sharing as well as communication through collaboration, enhancing the knowledge environment and managing knowledge as an asset for an organization. In this paper, we analyze the KM concept, system and architecture; then we propose a framework of KM system implementation in collaborative environment for Higher Learning Institutions (HLI). We also discuss various issues involved in this field that will help organizations to increase productivity and quality as well as to achieve return on investment (ROI). Issues that are highlighted in this paper include how best to acquire and disseminate knowledge; how to determine the best way for approaching and acquiring knowledge effectively including motivating people to share and access knowledge through the system; how to determine metrics for evaluating KM efficiency; how to identify how people create, communicate and use knowledge; and how to create more inclusive and integrated KMS software packages.", "num_citations": "194\n", "authors": ["1150"]}
{"title": "Lessons learned in ITIL implementation failure\n", "abstract": " ITIL is the most widely used IT framework in majority of organizations in the world now. However, implementing such best practice experiences in an organization comes with some implementation challenges such as staff resistance, task conflicts and ambiguous orders. It means that implementing such framework is not easy and it can be caused of the organization destruction. This paper tries to describe overall view of ITIL framework and address major reasons on the failure of this framework’s implementation in the organizations", "num_citations": "73\n", "authors": ["1150"]}
{"title": "Smart card security; Technology and adoption\n", "abstract": " Newly, smart card technology are being used in a number of ways around the world, on the other hand, security has become significant in information technology, especially in those application involving data sharing and transactions through the internet. Furthermore, researches in information technology acceptance have identified the security as one of the factor that can influence on smart card adoption. This research is chiefly to study the security principals of smart card and assess the security aspects’ affect on smart card technology adoption. In order to achieve this purpose, a survey was conducted among the 640 university students to measure the acceptance of smart card technology from security aspects.", "num_citations": "61\n", "authors": ["1150"]}
{"title": "Requirements engineering problems and practices in software companies: An industrial survey\n", "abstract": " This paper presents about a study conducted to investigate the current state of Requirements Engineering (RE) problems and practices amongst the software development companies in Malaysia. The main objective of the study is to determine areas in RE process that should be addressed in future research in order to improve the process. Information required for the study was obtained through a survey, questionnaires distributed to project managers and software developers who are working at various software development companies in the country. Results show that software companies in this study are still facing great challenges in getting their requirements right due to organizational and technical factors. Also, we found out that high-maturity ratings do not generally correlate better performance and do not indicate effective, high-maturity practices especially to the RE practices. The findings imply that we …", "num_citations": "55\n", "authors": ["1150"]}
{"title": "Features’ evaluation of goods, services and e-services; electronic service characteristics exploration\n", "abstract": " The term service has several meanings depending on the field of expertise and the viewpoint it is considered from. Although the exportation of services is not new the degree to which information and communications technologies are facilitating the rapid acceleration of service exportation are new. Today, trade in services is one of the hot issues on international trade and the world economy. Numerous enterprises have already moved or planning to move their traditional services and goods to the electronic environment. In this regard, it is vital to know the characteristics of each type of products. This research is going to explore the characteristics of electronic services and then evaluating the features of goods, services and e-services.", "num_citations": "51\n", "authors": ["1150"]}
{"title": "Issues in implementing it governance in small and medium enterprises\n", "abstract": " Nowadays, almost all the enterprises in the world fall in Small Medium Enterprises (SMEs) category even though SMEs has different definitions in different countries. At the same time, there is no exemplar standard and /or framework for information technology (IT) governance for SMEs. This paper presents the main issues in implementing IT governance in SMEs. Firstly, it explains the definition of SMEs and their characteristics, secondly it discusses IT governance definition and its framework. Finally, some issues and approaches for ITG implementation in SMEs are described, and end with conclusion and future work.", "num_citations": "47\n", "authors": ["1150"]}
{"title": "Considering service strategy in ITIL V3 as a framework for IT Governance\n", "abstract": " IT governance is the process by which decisions are made around IT investments. A well-matured IT governance framework is based on three major elements: structure, process and communication. In addition, there are four objectives that drives IT governance and must be covered in IT governance processes: IT value and alignment, accountability, performance measurement, and risk management. As we know Information Technology Infrastructure Library (ITIL) is a public framework that describes Best Practice in IT service management. Although some researchers have considered ITIL V2 as a part of their IT Governance framework, this paper claims that ITIL V3 (new publication of ITIL in 2007) and “Service Strategy” as the core of this publication, can provide a well-matured framework for the governance of IT by covering all requirement of IT Governance.", "num_citations": "47\n", "authors": ["1150"]}
{"title": "E-services usage evaluation; applications’ level of co-creation and digitalization\n", "abstract": " Nowadays, many traditional services have been moved or planning to move to the electronic environment. As a result of this movement enterprises need to realize the users’ motivations regarding the electronic service applications. Electronic services have been classified on two dimensions, the degree of digitization and the ability for co-creation in 2* 2 matrix. This paper aims to evaluate the usage of these four areas. In this regard, 38 services have been introduced under the eleven e-service applications, and then a questionnaire was distributed among 172 e-service users. The results show that services with the high level of digitalization and the low level of co-creation be mostly used.", "num_citations": "45\n", "authors": ["1150"]}
{"title": "Adoption factors and implementation steps of ITSM in the target\n", "abstract": " ITIL is the most widely used IT framework in most organizations nowadays. Many public and private IT organizations have good impressions and attempt to adopt ITIL into their own businesses. However, the ITIL implementation faces some issues by the target organizations to accept this as a complete framework. In addition, there are several steps to implement this framework in the target organizations. This paper tries at first to clarify each of these major issues and then suggest a mature guideline on the implementation of ITIL in the target organizations.", "num_citations": "42\n", "authors": ["1150"]}
{"title": "Knowledge management system architecture for organizational learning with collaborative environment\n", "abstract": " Knowledge management system (KMS) is one of the most critical weapon to transform knowledge resources in organization into intellectual capital for competitive advantage. However, learning organizations (LO) still have difficulties in identifying an appropriate KMS architecture framework and KMS technologies for their organizations. There is also no clear mechanism on how to motivate and encourage a community of practice (CoP) to share and reuse knowledge, as well as to generate new knowledge in a collaborative environment. Therefore, this research aims to overcome these problems by developing a KMS model and architecture that would ensure the right knowledge could be acquired from and disseminated to the right people at the right time. A survey to a group of CoP was conducted to identify requirements as a basis for setting up a KMS model. The KMS model was used to develop a KMS architecture. The KMS architecture consists of an application layer, a technology layer, an infrastructure layer and a repository layer. This architecture was tested by developing a KMS prototype for a research and development CoP in a Public Higher Learning Institution (PHLI) LO. The system has developed by integrating Lotus Notes Script and JavaScript, which were ran over an Intranet and Internet infrastructure. Agent technology was used in the system for profiling, notification, alert and monitoring. Another questionnaire survey was conducted after the KMS prototype implementation to verify the functionality of the system in facilitating knowledge sharing in a collaborative environment. The findings from both questionnaire surveys were …", "num_citations": "36\n", "authors": ["1150"]}
{"title": "Adaptive indoor positioning model based on WLAN-fingerprinting for dynamic and multi-floor environments\n", "abstract": " The Global Positioning System demonstrates the significance of Location Based Services but it cannot be used indoors due to the lack of line of sight between satellites and receivers. Indoor Positioning Systems are needed to provide indoor Location Based Services. Wireless LAN fingerprints are one of the best choices for Indoor Positioning Systems because of their low cost, and high accuracy, however they have many drawbacks: creating radio maps is time consuming, the radio maps will become outdated with any environmental change, different mobile devices read the received signal strength (RSS) differently, and peoples’ presence in LOS between access points and mobile device affects the RSS. This research proposes a new Adaptive Indoor Positioning System model (called DIPS) based on: a dynamic radio map generator, RSS certainty technique and peoples’ presence effect integration for dynamic and multi-floor environments. Dynamic in our context refers to the effects of people and device heterogeneity. DIPS can achieve 98% and 92% positioning accuracy for floor and room positioning, and it achieves 1.2 m for point positioning error. RSS certainty enhanced the positioning accuracy for floor and room for different mobile devices by 11% and 9%. Then by considering the peoples’ presence effect, the error is reduced by 0.2 m. In comparison with other works, DIPS achieves better positioning without extra devices. View Full-Text", "num_citations": "32\n", "authors": ["1150"]}
{"title": "A review paper on e-service; technology concepts\n", "abstract": " Recent growth in information technology has set the pace for an electronic revolution leading to emergence of electronic services. Business to consumer e-service assists organizations to decrease costs, speed up delivery time and serve more customers. Therefore, many enterprises have already moved or planning to move their services and goods to the electronic environment. In this regard, it is crucial to recognize the characteristics of each type of products and services. The main goal of this research is to provide an extensive review and gather conceptual perspectives of electronic services. In order to understand the nature of electronic services it is essential to explore the characteristics, advantages and barriers of e-services. This study sets theoretical and research foundation for future empirical researches by differentiates of service and e-service features and furthermore categorization of e-service users.", "num_citations": "30\n", "authors": ["1150"]}
{"title": "Addressing a critical success factor for software projects: A multi-round Delphi study of TSP\n", "abstract": " A five-round Delphi study was conducted to determine the degree to which the Team Software Process (TSP) can address the identified critical success factors for software projects. Three high-reputation and high-calibre experts participated in this study. Our results found agreement among the experts that the TSP provided the ‘Best Practises’ for addressing 14 critical success factors. The experts also agreed that the TSP provided a ‘Very Good’framework for addressing 4 critical success factors. Our findings further suggested that 6 critical success factors were addressed by the TSP at a ‘Good’level; only 1 critical success factor was addressed to a limited degree and none of the critical success factors were addressed at the ‘Fair’level. The only critical success factor not addressed by the TSP was the ‘good performance by vendors/contractors/consultants’ factor. From an expert’s perspective, the TSP provides an …", "num_citations": "27\n", "authors": ["1150"]}
{"title": "Requirements engineering problems in 63 software companies in Malaysia\n", "abstract": " It is widely acknowledged that problems associated with Requirements Engineering affect the quality of software and the effectiveness of the software development process. Malaysia is fast becoming an IT outsourcing heaven yet there is a lack of published studies on these problems in the region. This paper presents exploratory survey results of project and Requirements Engineering problems as identified by 63 Malaysian software development companies.", "num_citations": "25\n", "authors": ["1150"]}
{"title": "Propose an educational plan for computer ethics and information security\n", "abstract": " As the general public becomes increasingly computer literate, the gap between technology and peoples’ mental power notably shrinks. However, at the same time computer technology may raise some unethical issues with current life style and developments. Information security and ethics are defined as an all-encompassing term that refers to all activities needed to secure information and systems that supports educational center and students with practical educational frameworks. The purpose of this paper is to design an instructional and realistic plan for introducing ethical subject with respect to information security in educational context.", "num_citations": "24\n", "authors": ["1150"]}
{"title": "Application of hybrid multi-resolution wavelet decomposition method in detecting human walking gait events\n", "abstract": " Identifying walking gait events is important in gait analysis. In particular, heel-strike and toe-off are commonly used to define the stance phase and swing phase in normal human walking gait cycle. They are used to segment a stream of human motion data into discrete and meaningful sections that can be analyzed and compared with available literatures. This paper proposes multi-resolution wavelet decomposition to reveal relevant information. Subsequently, proposed method differentiates the signal twice to identify the heel-strike and toe-off events. With this information, various temporal gait parameters can be easily estimated, such as the duration of swing phase and stance phase, and the duration of initial double support and terminal double support. Experimental results on the temporal parameters are comparable to the available benchmark data with minimal discrepancies due to the anthropometric properties …", "num_citations": "23\n", "authors": ["1150"]}
{"title": "Challenges of a project-based learning approach towards requirement engineering\n", "abstract": " Higher Learning Education (HLE) fails to deliver undergraduates with employability skills that expert in Requirement Engineering. The objective of this research is to identify challenges in the current practice of teaching Software Engineering at the undergraduate level in Requirement Engineering. To that reason, the Project-Based Learning (PjBL) proposed as well as a mechanism for educators in their delivery to assist students in enhancing their skill. The skills enhanced from the elicitation process until the management of requirement which students can easily apply in their employability skills. Future work will discuss on the analysis of the weaknesses in the current Requirement Engineering practices.", "num_citations": "22\n", "authors": ["1150"]}
{"title": "Re-defining the requirements engineering process improvement model\n", "abstract": " A specialized Requirements Capability Maturity Model (R-CMM) was created by a group of researchers from UK as an attempt to support the requirements engineering phase of software development. The validation performed to this model shows that it has some potentials to be a useful tool for both practitioners and researchers in the field of process improvement and requirements engineering. However, the R-CMM focuses on the requirements engineering process defined within the retired Software Engineering Institute's (SEI's) Software Capability Maturity Model (SW_CMM) process improvement framework. To continue its relevance and usefulness, we re-define the whole R-CMM within the characteristics of the latest Capability Maturity Model for Integration (CMMI) for Development (CMMI-DEV) v1.2. This paper describes how the CMMI-DEV characteristics are used to re-define the R-CMM, and rationale for re …", "num_citations": "22\n", "authors": ["1150"]}
{"title": "Collaborative knowledge management systems for learning organisations\n", "abstract": " A knowledge management system (KMS) is a concept that can be used for creating knowledge repositories, improving knowledge access and sharing as well as communicating through collaboration, enhancing the knowledge environment and managing knowledge as an asset for an institution or organisation. In this paper, we propose a collaborative KMS framework for learning organisations (LOs) and discuss components in the framework that will help organisations to increase productivity and quality as well as to gain return on investment from a KMS. These components are KMS functionality, architecture, taxonomy, psychological, sociocultural and audit.", "num_citations": "22\n", "authors": ["1150"]}
{"title": "Smart card adoption model: Social and ethical perspectives\n", "abstract": " In the current growth of information technology (IT), without realizing, smart cards have been brought as an ideal device for any transaction such as transportation, healthcare, ecommerce, telecommunication, banking and many other applications. Smart card improved the quality of services in terms of security and customization for users. Recognition of aspects which affect on smart card usage is crucial for sophisticated consumer with respect to ethical action and reaction, where knowing the customers ethical and behavioral intention to employ smart cards should be the main part in any decisionmaking procedure. In this study, a short review on ethical scenarios are introduced to identify personal understanding of ethical circumstances by using smart cards and furthermore, an adoption model is developed from the ethical and social perspective based on previous acceptance models, ethical frameworks and ethical scenarios.", "num_citations": "21\n", "authors": ["1150"]}
{"title": "The strength and weakness of requirement engineering (RE) process\n", "abstract": " The need of organization is to enhance the services through system application. The IT Personnel should talented in identified the critical issues in RE. The IT Personnel supposed to recognize the strength and weaknesses of selected RE standard. This paper shows listed of issues identified during the software project development. The RE process assist a standard in managing the system application needs throughout six components of software projects. RE does this by helping the management to well organize related processes, methods and tools.", "num_citations": "21\n", "authors": ["1150"]}
{"title": "IT governance and small medium enterprises\n", "abstract": " In this decade Information Technology Governance (ITG) has become a hot topic between IT based companies. Since ITG status company is referring to an IT matured organization having six principles as expected by ISO 38500, there is no exemplar standard or framework to cover all of them. However, the most widespread existing frameworks in this area are COBIT, ITIL, and CMMI which not necessarily cover all of them. On the other hand, with respect to Small Medium Enterprises (SMEs) limitations, they have some constraints to implement all expected ITG principles by ISO 38500, completely. In this paper, the most comprehensive definition for ITG has presented and those most common ITG frameworks have been discussed (explained). Later, the SMEs definition and their characteristics have been explored. And lastly the relationship between ITG and SMEs has been discussed.", "num_citations": "19\n", "authors": ["1150"]}
{"title": "A service based framework for integration of ITIL V3 and enterprise architecture\n", "abstract": " ITIL V3 could be introduced as a governance framework for IT service management (ITSM) and attempts to align IT investments with business objectives. Enterprise Architecture (EA) is also referred as a general framework for designing business and IT/IS architectures of organizations and it also attempts to align these architectures with business strategies. Our research tends to provide a service based framework for EA in order to meet IT Service Architecture requirements of ITIL V3. Regard to this issue our Integrated Service Architecture Framework (ISAF) is outlined here to be developed through main research. One of our goals is to provide a solution for practitioners in utilization of EA architectures in ITIL V3. Authors also hope this study would contribute in academic domain through bridging computer science and information system disciplines due to service-oriented technology and management aspects of the …", "num_citations": "19\n", "authors": ["1150"]}
{"title": "Adoption of requirements engineering practices in Malaysian software development companies\n", "abstract": " This paper presents exploratory survey results on Requirements Engineering (RE) practices of some software development companies in Malaysia. The survey attempted to identify patterns of RE practices the companies are implementing. Information required for the survey was obtained through a survey, mailed self-administered questionnaires distributed to project managers and software developers who are working at software development companies operated across the country. The results showed that the overall adoption of the RE practices in these companies is strong. However, the results also indicated that fewer companies in the survey have use appropriate CASE tools or software to support their RE process and practices, define traceability policies and maintain traceability manual in their projects.", "num_citations": "18\n", "authors": ["1150"]}
{"title": "Implementing ITIL-based CMDB in the organizations to minimize or remove service quality gaps\n", "abstract": " \"Gap\" is a fundamental problem in every organization and there are some models and methods to \"identify\" and remove or minimize those gaps in the organizations . This paper tries to use an ITIL based solution to remove or abate those \"key discrepancies\" in the organizations based on using Model of Service Quality Gaps(S. Q. G) as a most known model to identify gaps in the organizations in perspective of service quality. In this study the following questions were answered: Which gap or gaps are in the organizations based on S.Q.G model? ; Which method is better to make such ITIL- based repository? ; And how CMDB can be used within S. Q. G model in order to remove or abate known gaps?", "num_citations": "17\n", "authors": ["1150"]}
{"title": "Examination of electronic service definitions\n", "abstract": " The electronic service concept stands for one prominent application of using the information and communication technologies in dissimilar areas. However, providing an exact definition of e-service is hard to come by as researchers have been using different definitions to describe e-service. This paper presents and examines the e-service definitions from various perspectives by reviewing the recent research in this field.", "num_citations": "16\n", "authors": ["1150"]}
{"title": "A study of process improvement best practices\n", "abstract": " Software project success depends on various reasons including project control, software standards and procedures. Software development organizations realize the importance of using best practices to improve software development practices. An increasing number of literature have described about process improvement best practices and standards. Formal process improvement frameworks have emerged widely to promote the use of systematic processes for software engineering. These approaches identify best practices for managing software engineering quality. They provide methods for assessing an organization's process maturity level and capability. In this article, recent process improvement best practices and standards are presented. Its objective is to analyze the existing approaches towards software process improvement initiatives. Another objective is to determine the issues related to adoption of …", "num_citations": "16\n", "authors": ["1150"]}
{"title": "Requirement Engineering Critical Issues in Public SectorSoftware Project Success Factor\n", "abstract": " Requirements engineering is an important component of effective software engineering. The existing literature suggests that effective requirement engineering can lead to improved productivity, quality, and risk management. More research is needed to explain benefits of implementing the RE process to software project development. This finding is part of our research in developing requirement engineering best practices. It is targeted to organizations who want to apply requirement engineering process in their software project development. The development team who are responsible in gathering requirements should understand in depth about the RE process. The new RE Process model for the public sector is defined. This RE model will be implemented by the actors identified. We determine appropriate software project success factor for the organization. There are seven software project success factors that contribute to the development of software projects particularly in Malaysia’s Public Sector. We determine general issues that are related to software project success factor (SPSF). A pilot test was conducted with IT Manager in Malaysian Public Sectors. The result shows, the respondent mediums agree with the business rules, business process and manager is SPSF. They neutral agree with technology, stakeholder and developer is SPSF. We derived the SPSF to the critical issues mainly for developing best practice for software projects requirement in software project development.", "num_citations": "14\n", "authors": ["1150"]}
{"title": "Knowledge Management (KM) Framework for Representing Lessons Learned System for Communities of practice in institutions of higher learning\n", "abstract": " Organisations worldwide are using techniques and technologies to better manage their knowledge. Their objective is to improve the quality of knowledge sharing by exploiting tacit and explicit knowledge of successes and failures. The requirement to record, reference and access lessons learned to support teaching operations and exercises is mainly important to lecturers in Institutes of Higher Learning. Lessons learned are typically short descriptions of specific experiences that may have future applicability in similar situations. In general, this paper proposes a KM adapted model for representing Lessons Learned System (LLS) Framework. The model was derived by mapping the Nonaka’s KM model [1] with the Lessons Learned processes that are adapted from Weber [2]. Finally, based on this model, the main features of LLS were defined and a prototype of LLS was developed. The prototype of LLS is used to illustrate the features of LLS and to demonstrate how it can be used to access Lessons Learned in order to support Communities of Practices (CoP) in Institutions of Higher Learning. LLS is a web-based application developed using WAMP which is an open source software suite comprising of Apache server, MySQL database and PHP programming for Windows operating system.", "num_citations": "14\n", "authors": ["1150"]}
{"title": "Automatic WLAN fingerprint radio map generation for accurate indoor positioning based on signal path loss model\n", "abstract": " The first step in developing a ubiquitous environment, in which the user can interact with any available electronic device, is the existence of an accurate indoor positioning system. WLAN-based indoor positioning system is considered as one of the best choices for indoor positioning due to its low cost, simple configuration and high accuracy. Although the WLAN Received Signal Strength fingerprinting method is the most accurate positioning method, the offline phase of this method known as radio map creation is a time consuming process. On the other hand, in dynamically changing environments, this radio map will be outdated and this will reduce the positioning accuracy. In this paper the Multi-Wall signal path loss model will be used to automatically generate the radio map based on the knowledge of the environment layout. The results of the experiment show that the indoor positioning by using the generated radio map can achieve high accuracy with average distance error reaching up to 1.2 m. This promising results means that an accurate indoor positioning system can be easily developed with time saving features.", "num_citations": "13\n", "authors": ["1150"]}
{"title": "A new maturity model for requirements engineering process: An overview\n", "abstract": " It is widely acknowledged that Requirements Engineering (RE) has an important implication for the overall success of software or system development projects. As more and more organizations consider RE as the principal problem areas in the projects, improving RE process therefore appears critical for future business success. Moreover, nowadays there are evidences that support improving RE process maturity can contributes to improved business performance. There exist generic Software Process Improvement (SPI) standards, specialised RE process improvement models as well as guidance and advices on RE. However, they suffer from various issues that limit their adoption by organizations that are interested to assess and improve their RE process capability. Therefore, the research presented in this paper proposes a new RE process improvement model. The model is built by adapting and expanding the structure of the continuous representation of the formal maturity framework Capability Maturity Model Integration for Development (CMMI-DEV) developed by the Software Engineering Institute (SEI) through three rounds of development and validation stages, which involved RE and CMMI expert panel in the software industry. This paper aims to provide an overview on what, why and how we build the maturity model for RE. The intention is to provide a foundation for future development in the area of RE process improvement.", "num_citations": "13\n", "authors": ["1150"]}
{"title": "Involvement of service knowledge management system in integration of ITIL V3 and enterprise architecture\n", "abstract": " Problem statement: This study attempts to investigate and clarify the relationship of Service Knowledge Management System (SKMS) with our primary study regard to using enterprise architecture through ITIL V3. Approach: SKMS concepts are introduced by ITIL V3 as a set of tools and databases that are used to manage knowledge and information of IT services. Results: The SKMS stores, retrieves, updates and presents all information that is expected for management of whole lifecycle of IT Services. Primary goal of our research is to provide a comprehensive integrated framework to determine and address IT Service Architecture requirements and related issues in ITIL V3 through using Enterprise Architecture. Conclusion/Recommendations: Through the main process of our study we realized that ITIL Knowledge Management process and its model for SKMS might be good candidates for storing and retrieving architectures of IT services. In other word, SKMS can be used as a set of tools and databases for management of architecture components of our target framework. For next step, the concern is how to develop proposed SKMS.", "num_citations": "13\n", "authors": ["1150"]}
{"title": "PEOPLEâ€™ S PPRESENCE EFFECT ON WLAN-BASED IPSâ€™ ACCURACY\n", "abstract": " In order to enable Location Based Service (LBS) closed environment, many technologies have been investigated to replace the Global Positioning System (GPS) in the localization process in indoor environments. WLAN is considered as the most suitable and powerful technology for Indoor Positioning System (IPS) due to its widespread coverage and low cost. Although WLAN Received Signal Strength Indicator (RSS) fingerprinting can be considered as the most accurate IPS method, this accuracy can be weakened due to WLAN RSS fluctuation. WLAN RSS fluctuates due to the multipath being influenced by obstacles presence. People presence under WLAN coverage can be considered as one of the main obstacles which can affect the WLAN-IPS accuracy. This research presents experimental results demonstrating that peopleâ€™ s presence between access point (AP) and mobile device (MD) reduces the received signal strength by-2dBm to-5dBm. This reduction in RSS can lead to distance error greater than or equal to 2m. Hence, any accurate IPS must consider the presence of people in the indoor environment. Â", "num_citations": "12\n", "authors": ["1150"]}
{"title": "Perceived barriers and benefits of Web based services\n", "abstract": " Rapid developments in information communication and technology have set the pace for an electronic revolution leading to emergence of electronic services. Although, the pace with which electronic services are made available and accepted is lower than planned or expected. Therefore, it has been indicated that certain barriers exist which hinder the adoption of e-services. This paper aims to understand the advantages of e-services that reason individuals would choose e-service over more traditional methods and also the barriers to e-services from user perspective. Furthermore, SWOT analysis is applied to classify the findings from the literature review.", "num_citations": "11\n", "authors": ["1150"]}
{"title": "Classification of internet products and evaluation of application utilization based on the product fulfillment process\n", "abstract": " These days, many traditional services have been moved or planning to move to the electronic environment. Therefore, it is critical for enterprises to understand the users’ motivations about the applied eservice applications. Internet goods and services have been categorized on two scopes, the product type and the fulfillment process in 2* 2 matrix. This main goal of this paper is to assess the e-service usage based on these four areas. In this regard, fourteen e-service applications were classified under these four dimensions and then a survey was developed and distributed among 172 e-service users. The results show that Internet products which are electronic services are mostly used.", "num_citations": "11\n", "authors": ["1150"]}
{"title": "A unified framework for software engineering process improvement—A taxonomy comparative analysis\n", "abstract": " Concurrent adoption of software engineering process improvement frameworks have been widely practiced by the software organizations. The software development organizations leverage these frameworks to better address process improvement challenges. This paper develops an integrated framework for software engineering process improvement practices and unifies the theories in process definition and establishment. The unified framework provides a set of formal descriptions for software engineering process improvement frameworks. Requirements and architectures for software engineering process improvement frameworks are investigated. The main challenge in the integration is the interoperability of the frameworks. Inaccurate integration approach results in inefficiency of the integration process. Common interoperability issues in the integration of current process models and methodologies are …", "num_citations": "11\n", "authors": ["1150"]}
{"title": "Requirement engineering practice research framework for the public service organisation\n", "abstract": " The requirement engineering (RE) practice was implemented without knowing by IT Personnel. This RE framework design purposely to identify the RE practice that implemented during software project requirement in Malaysian Public Sector. We determine the software requirement system (SRS) flow from the initial interview. We have a list of IT Personnel RE practice experience for the software project from the pilot test. We identified the problem arise and the RE practice implemented from the actual survey. The RE practice that identify will validate by the IT expert in Malaysian Public Sector. We plan to developed standards, tools, and methods can help to improve the current practice. Our expectation is the practice that can be as a guideline to IT Personnel using RE practice during software project requirement.", "num_citations": "11\n", "authors": ["1150"]}
{"title": "The roles of an actor in requirement engineering (RE) process\n", "abstract": " The aim of our research is to find a suitable RE process to be applied in our organisation for the development of software projects. We identified the actor and their roles through the relation practice while implementing the RE process. In order to redefine the RE process, good analysis skill is needed besides having a good understanding of the RE process itself. We believe that our experience can be understood and used by other reseachers.", "num_citations": "11\n", "authors": ["1150"]}
{"title": "Social interaction in e-learning: an overview\n", "abstract": " Learning process can occur everywhere and anytime. People nowadays are offered with various opportunities to learn and practice their knowledge. Regarding the technology, ICT developers and other stakeholders strive to give the best learning platform to learners. With the help of technology and networking facilities, learners are able to use learning application online which can cater same time same place, same time different place, different time same place and different time different place constraints. This paper will give an overview about electronic learning and discuss the issues arise in e-learning application in order to permit effective collaborative learning.", "num_citations": "11\n", "authors": ["1150"]}
{"title": "Big data: Current challenges and future scope\n", "abstract": " Big Data encompasses huge amounts of raw material which influence multitude of research fields as well as different industries performance such as business, marketing, social network analysis, educational systems, healthcare, IoT, meteorology, fraud detection. It aimed to uncover hidden trends and has prompted a development from a model-driven perspective to a data-driven approach. Among numerous properties of Big Data, datasets of Big Data are identified primary as 3Vs attributes which have high variety, velocity and volume. These provide an invaluable insight and assist in making precise decisions. Analyzing this information and outlining the outcome into helpful data is the method for extricating an incentive from these enormous volumes of datasets. Nevertheless, Big Data containing unique features that cannot be handled and processed using the conventional methods. This has presented a …", "num_citations": "10\n", "authors": ["1150"]}
{"title": "OPC Protocol Application for Real-Time Carbon Monitoring System for Industrial Environment.\n", "abstract": " Global warming is referred to the rise in average surface temperatures on earth primarily due to the Greenhouse Gases (GHG) emissions such as Carbon Dioxide (CO2). Monitoring the emissions, either direct or indirect from the industrial processes, is important to control or to minimize their impact on the environment. Most of the existing environmental monitoring system is being designed and developed for normal environment monitoring. Hence, the aim of this project is to develop industrial CO2 emission monitoring system which implements industrial Open Platform Communications (OPC) protocol in an embedded microcontroller. The software algorithm based on OPC data format has been designed and programmed into the Arduino microcontroller to interface the sensor data to any existing industrial OPC compliant Supervisory Control and Data Acquisition (SCADA) system. The system has been successfully tested in a lab with the suitable environment for real-time CO2 emissions measurement. The real-time measurement data has been shown in an industrial SCADA application which indicates successful implementation of the OPC communications protocol.", "num_citations": "10\n", "authors": ["1150"]}
{"title": "Evaluation of Security Factors Effecting on Web-Based Service Adoption\n", "abstract": " The immense growth of Information and Communication Technology in past few years has seen the emergence of movement from Traditional Service to Web-based Service. One of the main obstacles in front of this movement is the security concern of users which will results in rejection of Web-base service usage. This research is going to evaluate the security factors effecting on adoption of Web-based services. In this regard, the security dimensions related to electronic services are extracted then Exploratory Factor Analysis is employed to propose the conceptual model.", "num_citations": "10\n", "authors": ["1150"]}
{"title": "A taxonomy analysis for multi-model process improvement from the context of software engineering processes and services\n", "abstract": " The industrial and research communities in Software Engineering have shown great interest in Software Process Improvement initiatives. There are variety of process improvement that addresses the process improvement practices for software processes and services. Organizations initially started with single model implementation and progresses for more process improvement certification by adopting multi-model, as their improvement needs become increasing crucial. The software development organizations and quality departments leverage these models and frameworks to better address process improvement challenges. These frameworks differ in variety of aspects and making them difficult to compare objectively. This paper discusses on the multi-model process improvement and the integration approach. The main integration issue is the interoperability of the frameworks which may results in inefficiency of the development of the integrated framework. In relation to this, architectures for multi-model are investigated. We propose taxonomy for the multiple software process frameworks to support the understanding and comparison of diverse software quality frameworks. The research outcome is expected to identify the structural relationships among the frameworks and resolve the interoperability issues. The results derived from the taxonomy include characteristics and categories of attributes which are tailored to the discipline-specific framework and applied to three selected frameworks. The result of taxonomy analysis will be used as input for Delphi research approach.", "num_citations": "10\n", "authors": ["1150"]}
{"title": "A review on multiple perspectives of IT services in information systems and computer science (A multi-disciplinary overview)\n", "abstract": " Services innovations are intensively associated with ICT innovations and adoption and diffusion of ICT. Recently, various issues and views of services have been addressed through new disciplines of services. This paper attempts to review multiple disciplines of IT services in Information Systems and Computer Science briefly. While in SSME and ITSM, the focus is mostly on planning and management of IT services, in Services Computing discipline and in service oriented domains of services such as SOA and SOI, the emphasis is on service design and operation. As we discussed in this paper, there is a call to conducting research in service-oriented technology and management for the coming decade. Also there is a rich context for researchers on services design, services development, services marketing, services delivery, services management, and services operation from behavioural, economics, technical …", "num_citations": "10\n", "authors": ["1150"]}
{"title": "The most applicable KPIs of problem management process in organizations\n", "abstract": " Currently, IT (Information Technology) departments are the most complex parts of organizations and ITIL (InformationTechnology Infrastructure Library) is considered the most widely used IT framework in them. This De-facto standard is intended to support IT units of organizations to implement quality based processes in an effort to improve the quality of IT services. ITIL, it self is consisting of five components which are service strategy, service design, service operation, service transition and continual service improvement. Every one of these components has several processes. The structure of every one of ITIL processes includes definition, detail description, Critical Success Factors (CSFs) and Key Performance Indicators (KPIs). On the other hand, The Control Objectives for Information and related Technology (COBIT) is an audit and IT based framework with high capability on process measurement. This measurement-based framework is consisting of four different domains which are plan and organize, acquire and implement, delivery and support and monitor and evaluate domains. Taking into consideration the strength and weaknesses of each standard and framework, an ideal and practical approach is to implement ITIL based processes through an effective collaboration with COBIT based KPIs to measure and enhance every ITIL based processes. However, one of the critical ITIL processes is Problem Management process. This process issues to identify rout causes of reported incidents and try to eliminate them. In this paper, all KPIs applied to this process were at first gathered with some industrial experiences and then analyzed to produce …", "num_citations": "10\n", "authors": ["1150"]}
{"title": "Dynamic WLAN fingerprinting RadioMap for adapted indoor positioning model\n", "abstract": " As a result of Smartphone usage increment a sharp growth in demand for indoor environment computing especially for Location Based Services (LBS) has been occurred. The basic concept of LBS is to determine the mobile users’ location, which is important for services such as tracking or navigation in Civil defense and Healthcare. Currently, there are many techniques used to locate a mobile user in indoor environment. WLAN is considered as one of the best choices for indoor positioning due to its low cost, simple configuration and high accuracy. Although the WLAN Received Signal Strength Indicator (RSSI) fingerprinting method is the most accurate positioning method, it has a serious drawback because it’s Radio Map (RM) become outdated when environmental change occurs. In addition, recalibrating the RM is a time consuming process. This paper presents a novel adapted indoor positioning model …", "num_citations": "9\n", "authors": ["1150"]}
{"title": "Business intelligence addressing service quality for big data analytics in public sector\n", "abstract": " With the inauguration of Big Data Analytics initiative nationally, many nations have participated and paved way for BDA ecosystem. The initiative is a catalyst to further encourage economic growth in Public Sectors. Some of the common key deliverables identified are increasing productivity involving information communications technology, cost savings, shared benefits, and encourage innovation. The objectives can be further elaborated by driving big data analytics demands in various public sectors agency, adopting big data analytics framework supporting the building of big data industry. This has encouraged talents and startup companies inspiring their capabilities by developing various technology platform, collaborate and innovate amongst public and private sectors, and further strengthen data governance by creating policy and procedures. With the establishment of big data analytics framework, performance measurement can be enforced effortlessly using the principles of business intelligence maturity model and the technological stack comes with it. Various data sources can be used to benchmark service quality using advanced analytics and data science techniques.", "num_citations": "8\n", "authors": ["1150"]}
{"title": "A systematic mapping study on microservices\n", "abstract": " Microservices has been drawing a lot of attention in recent years. Their smaller size compared to monolithic applications makes them more maintainable, faster to deploy and hence more appealing. Together with platforms like cloud and emerging practices like DevOps, they are gaining more popularities in the software industry. However, despite their popularity very few secondary researches have been conducted to date. The goal of this study is to find out the common trends and the direction of researches on microservices. We have conducted a systematic mapping to identify and classify different categories of these researches. We have attempted to select only those relevant papers that are specifically conducted with microservices as their primary topics. We have narrowed down to 38 papers from IEEE, ACM and Scopus. These papers were published between 2016 to early 2018. These papers are …", "num_citations": "8\n", "authors": ["1150"]}
{"title": "People effects on WLAN-Based IPS'accuracy experimental preliminary results\n", "abstract": " In order to enable Location Based Service (LBS) closed environment, many technologies have been investigated to replace the Global Positioning System (GPS) in the localization process in these indoor environments. WLAN occurs as the most suitable and powerful technology for Indoor Positioning System (IPS) due to its widespread and low cost. WLAN received signal strength (RSS) fingerprinting can be considered as the most accurate IPS method, but this accuracy can be decline due to WLAN RSS fluctuation. WLAN RSS fluctuates due to multipath influenced by obstacles presence. People presence under WLAN coverage can be considered as one of the main obstacles which can affect the WLAN-IPS accuracy. This research presents experimental results to show that the presence of one person between (Access Point) AP and (Mobile Device) MD decreases the Received Signal Strength (RSS) by -5dBm …", "num_citations": "8\n", "authors": ["1150"]}
{"title": "Pilot Study of Industry Perspective on Requirement Engineering Education: Measurement of Rasch Analysis\n", "abstract": " Software development industry identifies that human-based give a significant problem in Requirement Engineering. To that reason, education gives a substantial impact in delivering a skill worker and should be a medium to reduce the problem. Survey question was distributed among ICT for this pilot study to the organization of MSC status in Malaysia for pilot study. 15.53%(N= 32) respondent successfully return their respond back. The result shows that only 27 person is analyzed regarding to misfit data provided by Rasch Measurement Model. The unidimensionality, person-item map and misfit data are discussed. Research objective to identify the undergraduate problem in Requirement Engineering education is achieved. Future work will be discussed on further analysis on actual survey to improve employability skill among software engineering undergraduate students.", "num_citations": "8\n", "authors": ["1150"]}
{"title": "Understanding the Requirement Engineering for organization: The challenges\n", "abstract": " This paper explains the challenges that we faced during conducting research in requirement engineering. The aim of the research is to standardize the Requirement Engineering Best Practices Guideline for Software Project in Malaysia Public Sector. Our first step was to define the RE Process, the actors involved as well as their roles. This is followed by the development of RE Best Practices Framework to support the implementation of RE during software requirement specification (SRS) for software project. Finally, the SRS will be presented to the management for the approval. We hope the guideline will help IT Managers in improving their knowledge about RE and increase productivity.", "num_citations": "8\n", "authors": ["1150"]}
{"title": "Extracting soft issues during requirements elicitation: A preliminary study\n", "abstract": " Requirements Engineering (RE) is a critical process in Software Engineering (SE) activities. RE helps stakeholders to manage requirements appropriately before dedicated requirements are used to design and implement software. The first stage in RE process is known as requirements elicitation whereby during elicitation, stakeholders will perform a set of activities to permit understanding in problem domain for respected scenario and hence proposing a set of established requirements in developing software. In elicitation, stakeholders need to collaborate and communicate in order to produce unambiguous requirements and create mutual agreement for software design and development. This can produce desired solution for all stakeholders. Soft issue is one of non-technical requirements that can associate with social presence, social interaction elements such as comfort, connectedness and motivation. This requirements need to be emphasized during RE process especially for a system that is categorized in Computer-Supported Collaboration Working (CSCW) domain. Users need CSCW domain system to carry out virtual communication, knowledge sharing via system’s features. The aim of this paper is to carry out a preliminary study on RE process and requirements elicitation activities by identifying whether soft issues have been engaged in existing requirements elicitation process. Another aim is to compare stakeholders’ roles based on selected articles. The method to investigate requirements elicitation process is done by identifying existing elicitation processes as well as involvement of stakeholders’ collaboration during elicitation …", "num_citations": "8\n", "authors": ["1150"]}
{"title": "Development of a Project-Based Learning Approach in Requirement Engineering [J]\n", "abstract": " Engineering (RE) practice. The Industry needs to allocate another cost to send their employee for additional training before the employee can contribute to the job specification. It indicates that current practices of delivery mechanisms at the university fail to deliver graduates with employability skills. The objective of this research is to identify weaknesses in current practice of teaching Software Engineering undergraduate in Requirement Engineering. Additionally, this paper emphasized that Project-Based Learning (PjBL) is a right method for delivery mechanisms to enhance Software Engineering undergraduate skills particularly in RE. The PjBL is a superset to Problem-Based Learning, Individual-Collaborative Learning and Product-Based Learning. The intersection can strongly assist in the learning environment. Future work should be carried out to design the framework of PjBL, measuring the effectiveness of PjBL and the electronic Learning eNvironment (eLIN) system as a supportive tools to make PjBL successful.", "num_citations": "8\n", "authors": ["1150"]}
{"title": "Framework of a reflective e-portfolio supported by outcome based education and problem based learning\n", "abstract": " This paper presents a comprehensive Reflective Electronic Portfolio Framework (REPOF) supported by two important educational methods Problem Based Learning and Outcome Based Education. The aim of this study is to present a new comprehensive framework that contains combination of Problem Based Learning and Outcome Based Education .We identified 3 constructs related to REPOF from an empirical study of one Iranian pilot university: Learning, Teaching and administrative. The Framework is based on perception of 78 students and 8 Lecturers and 3 Administrators in a computing science program, Information Technology management Program and software engineering program in Sooreh Applied and Scientific University in Iran. Reliability and descriptive statistical information is provided. The authors advocate the REPOF in computing and IT programs.", "num_citations": "8\n", "authors": ["1150"]}
{"title": "A study on the most prominent areas of research in microservices\n", "abstract": " Microservices have recently gained a lot of attention in the software industry. Their modularity and smaller size offer flexibility advantageous to both development and operational teams. However, the bigger picture is still lacking despite numerous researches on microservices. There are few aspects of microservices that have never been discussed in depth despite being acknowledged repeatedly. The current research is the continuation of our previous paper,“A systematic mapping on microservices”. In the named paper we have identified the focus areas of microservices’ researches. Along with our previous findings we have spotted several crucial key points that require further discussions. These includes: definition of microservices, their sizes and boundaries. We have also explored the relationship of microservices with SOA and DDD. These are the two terms that are frequently associated with microservices. Finally, we have discussed DevOps, cloud and virtualization as three of the most essential factors in microservices ecosystem. We attempted to clarify the role of each of these factors. Based on our findings, there is still no standardized definition for microservices to-date. In absence of clear guidelines, SOA and DDD concepts are widely being used to develop microservices. DevOps practices together with the cloud environment are playing an important role in facilitating the implementation of microservices. We have also identified containerization as an effective method to overcome the hardware limitation besides speeding up the delivery process.", "num_citations": "7\n", "authors": ["1150"]}
{"title": "Accurate Indoor-Positioning Model Based on People Effect and Ray-Tracing Propagation\n", "abstract": " Wireless local area networks (WLAN)-fingerprinting has been highlighted as the preferred technology for indoor positioning due to its accurate positioning and minimal infrastructure cost. However, its accuracy is highly influenced by obstacles that cause fluctuation in the signal strength. Many researchers have modeled static obstacles such as walls and ceilings, but few studies have modeled the people’s presence effect (PPE), although the human body has a great impact on signal strength. Therefore, PPE must be addressed to obtain accurate positioning results. Previous research has proposed a model to address this issue, but these studies only considered the direct path signal between the transmitter and the receiver whereas multipath effects such as reflection also have a significant influence on indoor signal propagation. This research proposes an accurate indoor-positioning model by considering people’s presence and multipath using ray-tracing, we call it (AIRY). This study proposed two solutions to construct AIRY: an automatic radio map using ray tracing and a constant of people’s effect for the received signal strength indicator (RSSI) adaptation. The proposed model was simulated using MATLAB software and tested at Level 3, Menara Razak, Universiti Teknologi Malaysia. A K-nearest-neighbor (KNN) algorithm was used to define a position. The initial accuracy was 2.04 m, which then reduced to 0.57 m after people’s presence and multipath effects were considered. View Full-Text", "num_citations": "7\n", "authors": ["1150"]}
{"title": "A light WLAN radio map for floor detection in multi-floor environment localization\n", "abstract": " Ubiquitous environments relies on the localization process of the mobile device or user. Although WLAN Received Signal Strength (RSS) fingerprinting is the most accurate indoor positioning method, it is a time consuming process and become impractical process for multi-floor environments. In addition to this any proposed method for floor determination in multi-floor environment must take into account the mobile device's limitations. In this paper the path loss model will be used to generate a light fingerprint radio map in order to determine the floor where the mobile device located. The experimental results show that the proposed method can determine the floor of the mobile device accurately with percentage exceeded 97%.", "num_citations": "7\n", "authors": ["1150"]}
{"title": "The Important Role of People, Process and Technology during Software Project Requirement\n", "abstract": " The need of organisation is to enhance the services through Malaysian Public Sector system application. This paper described the role of people, process and technology during software project requirement in Malaysian Public Sector. We have done the survey to the IT Manager in Malaysian Public Sector. The Public Sector IT Manager contributed their working experienced and knowledge for the survey. The purpose of the survey is to determine the RE practice that implemented during software project requirement. We also determine the role for people, process and technology during the software project requirement. The result shows that 79.7 percent of IT Manager in Malaysia Public Sector has roles in software project requirement such as project leader, project manager and team leader. Some of them have to be a consultant to other agency or organization. They play their roles in business rules, business process indirectly.", "num_citations": "7\n", "authors": ["1150"]}
{"title": "Layered approach to open source software development success\n", "abstract": " Open source has emerged as a widely accepted software development phenomenon which has tremendously brought about a significant paradigm shift from traditional software development methodologies such as top down design and stepwise refinement to an unconventional software development approach by means of collaborative software development method among a wide geographically dispersed interested developers and committed project participants while paying less attention to immediate “physical gains”. The open source approach focuses on highly diverse views of developer motivations; ranging from ego gratification, ideological satisfaction and gift culture for individual developers and open source motivations may be viewed from spreading the software development risks and associated maintenance costs at corporate organisational level. In this article, a five layered open onion model of open source was broadly examined. Analysis and evaluation were narrowed down to only the initiation layer of the open onion model. Results show that open source success largely depends on the quality associated with successful initiation of the project. Our findings also reveal that the most popular open source license is GPL and that license type has significant impact on project rank. The domain audience has negative impact on project rank and user interface has significantly negative impact on project’s domain audience. Open source project topics covered have a significant impact on the domain audience and a negative effect on the user interface. This research has also presented a conceptual framework of open source success tree.", "num_citations": "7\n", "authors": ["1150"]}
{"title": "The effect of people presence on WLAN RSS is governed by influence distance\n", "abstract": " Recently, there is high demand for implementing Location Based Services (LBS) indoor. Many technologies and methods have been investigated for this issue since GPS could not prove accurate positioning indoor. Although WLAN-fingerprinting is considered as one of the most accurate IPS method, its accuracy vulnerable to WLAN RSS fluctuation. This fluctuation occurs due to the physical obstacles presence. Many research papers highlighted people's presence near to mobile device (MD) between it and Access point (AP) as RSS attenuate factor, but it is hard to find a research paper investigated this attenuation factor as in the case of walls and ceilings. People presence effect was estimated in previous work as -5dBm on closed distance from MD but it still need a lot of investigation. This paper raises the existence of people presence influence distance as a new concept related to people presence effect. In …", "num_citations": "6\n", "authors": ["1150"]}
{"title": "CMDB Implementation Approaches and Considerations in SME/SITU's Companies\n", "abstract": " ITIL (information technology infrastructure library) is the most widely used IT framework in organizations. This de-facto standard is a service-based IT-framework that aims to improve the quality of organizational services. The core of this framework is configuration management that includes configuration management data base (CMDB) to record, update and trace all assessed activities and information in the organization. However, ITIL implementation faces some challenges especially when it effects on culture, attitudes and processes in the organization. One major part of this implementation is related to CMDB implementation. There are several major approaches to implement this repository in organizations. This paper, at first describes ITIL infrastructure and then highlights major approaches and its challenges to implement CMDB in the SME companies.", "num_citations": "6\n", "authors": ["1150"]}
{"title": "The development of knowledge management system for public higher learning in collaborative environment using Lotus Notes software\n", "abstract": " In higher learning institution sectors,collaboration tools of Knowledge Management Systems (KMS) explore the opportunity to create, gather, access, organize, distribute and disseminate the knowledge to their community of practice for many purposes such as learning process, R & D and others.This paper describes the theoretical concept and approach of knowledge management system (KMS) that could be implemented in Public Higher Learning Institution (PHLI) by showing how the framework of knowledge management system model is developed using Lotus Notes software.The achievement of this KMS framework is an added value for any PHLI that needs to implement the KMS, which can help them to achieve their aims and objectives.The emphasis also will be given to the activities that may be of concern for each stage in the KM life cycle by including the critical success factors (CSF) to ensure that KMS initiatives will deliver competitive advantages to the organization.", "num_citations": "6\n", "authors": ["1150"]}
{"title": "MODEL DRIVEN ARCHITECTURE A REVIEW OF CURRENT LITERATURE.\n", "abstract": " Abstract Among different Model Driven Engineering (MDE) approaches, the Object Management Group (OMG) adopted the Model Driven Architecture (MDA). The MDA approach is aiming to automate the software develop process by using models instead of conventional coding and bases on the separation of concern concept. In June 2014, the OMG released the second version of the MDA guide trying to realize the fundamental principles and to support the first MDA guide issued in 2003 with more detailed specifications. A gap of 11 years makes researchers from their own perspective and background come up with different interpretations of the MDA terms. The thing that generates a confusion of what is beyond and what is within the MDA scope. By strictly referring to the MDA standard (not to model-driven engineering in general), we provide in this work a review of the current MDA literature. We also shed the …", "num_citations": "5\n", "authors": ["1150"]}
{"title": "How security issues can influence on usage of electronic services\n", "abstract": " Due to the fast growth of Information Communication Technologies, many traditional services already moved to the electronic environments. In order to achieve the success in implementation of e-services, service providers need to pay attention to customers’ needs and concerns. One of the biggest concerns of electronic service users is security; therefore, it is critical to understand how security issues can effect on usage of e-services. This paper is going to evaluate the security factors affecting on e-service acceptance. The security factors of Web-based service are extracted and the measurement tool will be developed. In final step, an adoption model will be proposed from the perspective of e-service security.", "num_citations": "5\n", "authors": ["1150"]}
{"title": "An Empirical Study of the Software Project Requirements Engineering Practice in Malaysia Public Sector-A Perspective from the Stakeholders' Challenges\n", "abstract": " Stakeholder is one of the software success factors for software project in Malaysia Public Sector. The stakeholders are defined as person who are close to the business process and really know what the requirements needed. Requirement is an important factor for the development of any project and it defines what different stakeholders (users, customer, manager and developer) need and how system will fulfil these needs. They are the main actors in the business process. Requirements are used as input in the design, implementation and validation stage of product development. Eventually, a software project can succeed or failed at any time during project life cycle because of poor requirement gathering and managing process. Among the key problems of information systems requirements process is the gap between analysts and stakeholders. Therefore, this paper describes the empirical study performed in public sectors in Malaysia to identify the challenges and problems arising from the stakeholders.", "num_citations": "5\n", "authors": ["1150"]}
{"title": "Computer and Information Security Ethics--Models\n", "abstract": " Recently the gap between technology and peoples' mental power notably shrinks. The available computer and information resources, software and assorted output devices have enlightened many unethical activities, privacy invasion and illegal purposes. Computer and information ethics are viewed as one of the leading areas of concern and interest by scholars, practitioners and academic researchers. In order to facilitate ethical use they are defined as an all-encompassing term that refers to all activities needed to secure information and systems that supports. The previous research in computer ethics and related models indicates the need of complete reference on this topic. The main goal of this research is to study the different computer ethical conceptions and frameworks from different perspective. This study reveals that research in computer ethics in general and computer ethics from scenario perspective in …", "num_citations": "5\n", "authors": ["1150"]}
{"title": "Using taxonomy comparative analysis for the unification of process improvement frameworks\n", "abstract": " At present, there is wide range of process improvement frameworks that are used as reference models for improving an organization's processes. These models are needed to improve the way to develop and manage the software development in an organization. This paper analyzes the current requirements and architecture of process improvement frameworks and applies taxonomy comparative analysis towards the frameworks. The taxonomy is expected to derive the understanding of the frameworks and used as a basis for performing the relations mapping to the frameworks. The authors propose relations mapping on the multiple process improvement frameworks to support the understanding and comparison of diversification in the multiple mode environments. The outcome is expected to identify the structural relationships among the frameworks and determine the connection point of the processes involved in …", "num_citations": "5\n", "authors": ["1150"]}
{"title": "Development strategy using cognitive domain in e-requirement engineering learning system\n", "abstract": " Current trend of e-learning promote continuous learning environment. Unfortunately, it fails to optimize the learning between student and learner. Some factors are discussed to encounter the current problem. It should have suitable contents representations that will be remembered and applied in practice by the students. The e-learning discussed in context of Requirement Engineering domain. Maximize the usage of e-Requirement Engineering Learning System, the cognitive domain is suggested to cooperate with the e-learning system. It will help Higher Learning Education (HLE) deliver students with employability skill with critical thinking strategy. In addition, it gives a big impact to software development project. Future work will be discussed on the quantitative analysis to measure the effectiveness of e-Requirement Engineering Learning System.", "num_citations": "5\n", "authors": ["1150"]}
{"title": "Informatics engineering and information science\n", "abstract": " This 4-Volume-Set, CCIS 0251-CCIS 0254, constitutes the refereed proceedings of the International Conference on Informatics Engineering and Information Science, ICIEIS 2011, held in Kuala Lumpur, Malaysia, in November 2011. The 210 revised full papers presented together with invited papers in the 4 volumes were carefully reviewed and selected from numerous submissions. The papers are organized in topical sections on e-learning, information security, software engineering, image processing, algorithms, artificial intelligence and soft computing, e-commerce, data mining, neural networks, social networks, grid computing, biometric technologies, networks, distributed and parallel computing, wireless networks, information and data management, web applications and software systems, multimedia, ad hoc networks, mobile computing, as well as miscellaneous topics in digital information and communications.", "num_citations": "5\n", "authors": ["1150"]}
{"title": "Measurement of rasch analysis towards requirement engineering education: industry perspective\n", "abstract": " Software development industry identifies that human-based give a significant problem in Requirement Engineering. To that reason, education gives a substantial impact in delivering a skill worker and should be a medium to reduce the problem. Survey question was distributed among 206 Shared Sharing Services company under MSC status. Malaysia. 15.53%(N= 32) respondent successfully return their respond back. The result shows that only 27 person is analyzed regarding to misfit data provided by Rasch Measurement Model. The unidimensionality, personitem map and misfit data are discussed. Research objective to identify the undergraduate problem in Requirement Engineering education is achieved. Future work will be discussed on further analysis on expert recommendation using QSR NVIVO v8 to enhance employability skill.", "num_citations": "5\n", "authors": ["1150"]}
{"title": "nhancing Cognitive Aspects of Software Visualization Using DocLike Modularized Graph.\n", "abstract": " Understanding an existing software system to trace possible changes involved in a maintenance task can be time consuming especially if its design document is absence or out-dated. In this case, visualizing the software artefacts graphically may improve the cognition of the subject system by software maintainers. A number of tools have emerged and they generally consist of a reverse engineering environment and a viewer to visualize software artefacts such as in the form of graphs. The tools also grant structural re-documentation of existing software systems but they do not explicitly employ document-like software visualization in their methods. This paper proposes DocLike Modularized Graph method that represents the software artefacts of a reverse engineered subject system graphically, module-by-module in a document-like re-documentation environment. The method is utilized in a prototype tool named DocLike viewer that generates graphical views of a C language software system parsed by a selected C language parser. Two experiments were conducted to validate how much the proposed method could improve cognition of a subject system by software maintainers without documentation, in terms of productivity and quality. Both results deduce that the method has the potential to improve cognitive aspects of software visualization to support software maintainers in finding solutions of assigned maintenance tasks.", "num_citations": "5\n", "authors": ["1150"]}
{"title": "Physical image quality evaluation of medical radiographs\n", "abstract": " The noise equivalent quanta (NEQ) has been recommended as a measure of physical quality of medical images. Digitised data of medical radiographs in a previous work have been analysed in terms of resolution via the modulation transfer function (MTF) and noise via the noise power spectrum (NPS), but not in terms of NEQ. As the NEQ is currently regarded as a basic device performance measure of the imaging system, it is very useful to be able to determine it. The average gamma of the radiograph was computed, both the MTF and the NPS data were interpolated and these values were used to compute the NEQ. The computation shows that for spatial frequency range 0–0.7 cycles/mm the NEQ of Lanex Regular/T Mat G screen-film combination is slightly lower than that of Lanex Regular/T Mat L, for 0.7–1.5 cycles/mm the NEQ of both are almost the same, and for frequencies greater than 1.5 cycles/mm the NEQ of the former is greater than that of the latter.", "num_citations": "5\n", "authors": ["1150"]}
{"title": "User Acceptance Testing in Mobile Health Applications: An overview and the Challenges\n", "abstract": " The software development trend has moved from the stand alone applications to the development of the mobile applications that had widely used nowadays. The software testing also reflected with this changes as it is needed to suit with this movement. Today, the mobile health applications had getting great attention from all people around the world and become the most important tools for the users. In order to promote confidence in using the mobile health applications, an acceptance testing needs to be conducted. Due to the importance and criticality of health, there is an urgency of needs to conduct the research in this particular area. Thus, the research is conducted to identify the challenges in conducting the UAT in M-Health applications.", "num_citations": "4\n", "authors": ["1150"]}
{"title": "Classification of malware analytics techniques: a systematic literature review\n", "abstract": " Context: Malware is a variety of forms of hostile or intrusive software that being thrown around online. Data analytics is the process of examining data sets in order to draw conclusions about information they contain, increasingly with the aid of specialized systems and software. Objectives: The aims of the study are to identify the types of malware analytics and identify the purpose of malware analytics. Method: A Systematic Literature Review (SLR) was carried out and reported based on the preferred reporting items for systematic reviews. 1114 papers were retrieved by manual search in six databases which are IEEE, Science Direct, Taylor and Francis, ACM, Wiley and Springer Link. 53 primary studies were finally included. Results: From these studies, 70% were conference papers and 30% were journal articles. Five classification of malware analytics techniques were identified and analysed. The classifications are …", "num_citations": "4\n", "authors": ["1150"]}
{"title": "Effect of people around user to WLAN indoor positioning system accuracy\n", "abstract": " The ability to check the location of people or mobile devices (MD) in indoor environment has a large number of application. Indoor Positioning System (IPS) utilizes many existing technologies such as radio frequencies, magnetic fields, acoustic signals, thermal, optical or other sensors. WLAN IPS become one of the most favorite solutions because it is already widely exist and provide good accuracy. Fingerprint is one of the methods in WLAN IPS. The performance of this method is greatly affected by received signal strength indicator (RSSI). In fact RSSI value is very dynamic and influenced by environmental conditions inside the room such as walls, ceiling and also human presence. This paper presented an experiment to explore the effect of many people around MD to the RSSI and position error of IPS. People around MD at certain distance and position will be barrier for WLAN signal, therefore the RSSI will …", "num_citations": "4\n", "authors": ["1150"]}
{"title": "Adapted WLAN fingerprint indoor positioning system (IPS) based on user orientations\n", "abstract": " Location determination techniques for IPS are divided into proximity, triangulation, and fingerprint techniques. WLAN-Fingerprint has become one of the best alternative methods because it is already widely available inside buildings and provides a high level of accuracy. However, the WLAN signal is highly influenced by the surrounding environment, such as walls, ceilings, and people. People who hold mobile devices (MDs) significantly affect IPS performance. This paper therefore proposes a new method to overcome the effect of user orientation on the accuracy of IPS by introducing an adaptation of the signal strength values based on user orientation. The average position error when using the initial radio map (RM) is found to be 8.84 m. After implementing the RM adaptation, the average error decreased to 3.5 m. This proposed method can therefore improve accuracy by 60.4% and decrease the …", "num_citations": "4\n", "authors": ["1150"]}
{"title": "Improving collaborative activities in e-learning using social presence requirement elicitation process\n", "abstract": " In developing learning application, a social presence requirement is needed to gain a sense of connectedness albeit through user interface. Social presence is important in order to increase interaction and collaboration between users. In motivating students to actively use E-learning, the requirements elicitation process plays an important role. Multiphase mixed method design is used in this study to evaluate the usability of requirements elicitation product that can be used to extract social presence requirements. There are three artefacts namely Technical Guide to Requirements Elicitation for Social Presence Support, Social Presence Requirements Template and Social Presence Requirements for E-learning that are produced in this study to demonstrate their role in supporting E-learning environment.", "num_citations": "4\n", "authors": ["1150"]}
{"title": "Identification of social presence for E-learning: an initial multiphase activities for requirements engineering\n", "abstract": " Social presence is an element for social interaction which a person perceived as ‘real’ in mediated communication. During interaction, the learners need to feel comfortable in order to interact among themselves for promoting active knowledge sharing. A sub-field of Software Engineering known as Requirements Engineering (RE) plays an important stage for e-Learning developers to elicit and to implement e-Learning for supporting active social interaction among learners. This paper reveals on how the knowledge of RE can be used in order to identify what is needed for providing e-Learning which is able to support social presence. The author uses multiphase mixed method design in order to initiate the identification of social presence requirements in RE activities. This paper also elaborates Exploratory Factor Analysis (EFA) and Confirmatory Factor Analysis (CFA) of social presence factors in e-Learning. As …", "num_citations": "4\n", "authors": ["1150"]}
{"title": "Adapted Indoor Positioning Model Based on Dynamic WLAN Fingerprinting RadioMap.\n", "abstract": " The mobile phone market increased dramatically in the last few years. As result there is a sharp growth in demand for indoor environment computing especially for Location Based Services (LBS). The basic concept of LBS is to determine the mobile users’ location, which is important for services such as tracking or navigation in Civil defense; Healthcare; Marketing and Management. Currently, there are many techniques used to find the location of a mobile user in indoor environment. WLAN technique is considered as one of the best choices for indoor positioning due to its low cost, simple configuration and high accuracy. Although the WLAN Received Signal Strength Indicator (RSSI) fingerprinting method is the most accurate positioning method, it has a serious drawback because its Radio Map (RM) become outdated when environmental change occurs. In addition, recalibrating the RM is a time consuming process. This paper presents a novel adapted indoor positioning model which uses the path loss propagation model of the wireless signal to overcome the outdated RM. The experimental results demonstrate that the proposed adapted model is highly efficient in solving the problems mentioned especially in a dynamically changing environment.", "num_citations": "4\n", "authors": ["1150"]}
{"title": "Classification of Web Based Service User Types\n", "abstract": " Due to the rapid development of information technology, many firms have already or plan to move from traditional service to electronic environment. One of the important factor issues which need to be considered is the user acceptance of e-service technology. In order to evaluate the adoption of web based information technology, it is vital to release the users' needs. Therefore, the diversity of Web based service user types need to be recognized. This paper is going to classify the e-service users based on their experience, purpose of usage and geographical place.", "num_citations": "4\n", "authors": ["1150"]}
{"title": "Assessment of Electronic Service Applications' Practice: Domains Perspective\n", "abstract": " Traditionally, electronic services have been considered in two domains, using information technology for interaction and the actual service deliver via the electronic channels. Newly, three constructs have been identified, namely, transform, informate and automate. Based on these concepts, the e-service applications are classified and then the usage of each application is evaluated. Afterward, the geomean of each domain is analyzed to figure out the customers' attitude towards these three domains. In this regards, a survey has been conducted among the 155 e-service users. The results reveal users are more using the e-services which provide them with higher levels of information on service, product and processes.", "num_citations": "4\n", "authors": ["1150"]}
{"title": "Multi-Process Quality Model: Identification of Key Processes in the Integration Approach.\n", "abstract": " In this paper we investigate the use of multiprocess quality model in the adoption of process improvement frameworks. We analyze an improvement effort based on multiple process quality models adoption. At present, there is a possibility of a software development organization to adopt multi-quality and improvement models in order to remain competitive in the IT market place. Various quality models emerge to satisfy different improvement objective such as to improve capability of models, quality management and serve as IT government purpose. The heterogeneity characteristics of the models require further research on dealing with multiple process models at a time. We discuss on the concept of software process and overview on software maintenance and evolution which are important elements in the quality models. The concepts related to process quality model and improvement models are discussed. The …", "num_citations": "4\n", "authors": ["1150"]}
{"title": "Intelligent reflective e-portfolio framework based on artificial intelligent Expert systems techniques\n", "abstract": " The aim of this paper is to present the role of Artificial Intelligence techniques (Expert systems) to enhance reflective e-portfolios quality. Some AI techniques such as the expert system; scheduling; Data Mining can support us to enhance our reflective e-portfolios quality. These tools together will define new intelligent Reflective e-portfolio that provides intelligent and customized learning method for each student based on their backgrounds and their realities. This paper analyzes the role of AI-Expert Systems to enhance learning smartness. The final vision of intelligent reflective e-portfolio is to act as an expert to consult students and support them to make Right decisions for their learning complexities.", "num_citations": "4\n", "authors": ["1150"]}
{"title": "A novel ITSM-based implementation method to maintain software assets in order to sustain organizational activities\n", "abstract": " One major problem is to record software assets and update them in the organizations. Information technology service management (ITSM) usually refers to ISO/IEC 20000 standard that the configuration management (CM) process known as hart of it. configuration management database (CMDB) is part of the CM that records and updates changes and retrieve the services. This paper focus on propose a novel ITSM-based implementation method to maintain software assets in order to sustain organizations activities.", "num_citations": "4\n", "authors": ["1150"]}
{"title": "An empirical study identifying high perceived value KPIs of incident management process in organizations\n", "abstract": " Currently, ITIL is considered the most widely used IT framework in organizations. This De-facto standard is intended to support IT units of organizations to implement quality based processes in an effort to improve the quality of IT services. ITIL itself is characterized by five components of which each has some processes that include the definition, detail description, Critical Success Factor and Key Performance Indicators. Also, ISO/IEC 20000 is a lightweight standard which has been derived from ITIL with fewer processes. On the other hand, COBIT is an audit and IT based framework with high capability on process measurement. Taking into consideration the strengths and weaknesses of each standard and framework, an ideal and practical approach is to implement ITIL or ISO/IEC 20000 based processes through an effective collaboration with COBIT based KPIs to measure and enhance its based processes. However, one of the critical ITIL or ISO/IEC 20000 processes is the Incident Management process. This process creates a firefight incident problem when an organization decides to revert services to normal situation. In this paper, all KPIs applied to this process were at first gathered with some industrial experiences and then analyzed to produce some findings relating to the most common KPIs and practices used.", "num_citations": "4\n", "authors": ["1150"]}
{"title": "Fingerprint indoor positioning based on user orientations and minimum computation time.\n", "abstract": " Abstract Indoor Positioning System (IPS) has an important role in the field of Internet of Thing. IPS works based on many existing radio frequency technologies. One of the most popular methods is WLAN Fingerprint because this technology has been installed widely inside buildings and it provides a high level of accuracy. The performance is affected by people who hold mobile devices (user) and also people around the users. This research aimed to minimize the computation time of kNN searching process. The results showed that when the value of k in kNN was greater, the computation time increased, especially when using Cityblock and Minkowski distance function. The smallest average computation time was 2.14 ms, when using Cityblock. Then the computational time for Euclidean and Chebychev were relatively stable, ie 2.2 ms and 2.23 ms, respectively.", "num_citations": "3\n", "authors": ["1150"]}
{"title": "Antihypertensive effects of edible brown seaweeds in rats\n", "abstract": " The present study is focused to evaluate the effect of three different brown seaweeds on blood pressure and heart rate (HR) using spontaneously hypertensive rats (SHR) and normotensive Wistar-Kyoto (WKY) rats. The seaweeds, Turbinaria ornata (T. ornata), Sargassum species (Sargassum sp.) and Padina tetrastromatica (P. tetrastromatica), were extracted in cold water and freeze-dried. Anaesthetised rats were prepared for direct blood pressure measurements with the changes in HR also being monitored. Rats were administered intravenously with the aqueous extract of the seaweeds at doses of 2.5 to 20.0 mg/kg. Concentrations of Na+, K+, Ca2+ and Mg2+ found in the dose of 20.0 mg/kg of the marine plant extracts were determined. Subsequently, salt solutions containing the equivalent cationic concentration found in each of the seaweed extracts were tested on Sprague-Dawley (SD) rats. All seaweeds investigated produced significant (P< 0.05) reductions in the blood pressure of both SHR and the control WKY rats. In T. ornata, significant (P< 0.05) HR reducing effect was produced. In contrast, this effect was not seen in other brown seaweeds tested. Analysis of the ionic composition present in all the extracts revealed that the salt solution with equivalent ionic content of each seaweed extract did not produce any significant decrease in blood pressure of the SD rats. In conclusion, the data obtained from the present study suggest that the aqueous extracts of T. ornata, Sargassum sp. and P. tetrastromatica may contain blood pressure lowering agents.", "num_citations": "3\n", "authors": ["1150"]}
{"title": "E-Learning effects on learning quality: A case study of Iranian students\n", "abstract": " Today our life has got a new dimension which called technological dimension. Technology has special effects on our life; it plays a very meaningful role in all countries, in this paper we intend to analyze e-learning effects and its advantages in the field of education in third world countries specially in Iran. the other purpose of this study is evaluating its educational effects to improve learning quality in Iran. Learning via the Internet combined with multimedia platforms can satisfy the demand for alternative forms of education.", "num_citations": "3\n", "authors": ["1150"]}
{"title": "Readiness of requirement engineering towards global collaboration and communication\n", "abstract": " Global collaboration is a very important key for nowadays industry integration. Projects fail because of lacks in Requirement Engineering (RE) practice. Software Engineering Education should be a kick-start to face the problem. The new technique develops for Requirement Engineering based on Project-Based Learning (PjBL) is suggested to encounter the problems through electronic Learning Industrial Environment (eLIN) system. Future work will be discussed on the eLIN system that will be proposed as a supportive tool to assist student to get feedback instantly from industry and to be a platform for core subject project's continuity and the effectiveness in using eLIN system as a supportive tool for PjBL in RE.", "num_citations": "3\n", "authors": ["1150"]}
{"title": "E-portfolio as a tool to support technical students to find appropriate job opportunity\n", "abstract": " E-portfolio is a new education technology; some of the students are not willing to use e-portfolio. e-portfolio features must be designed based on the student's requirements and demands to encourage them to use e-portfolio. Applying features toward employment of fresh graduated can motivate students to use e-portfolio. The aim of this research embeds some new features in e-portfolios related to employment to assist in student to have better job opportunity.", "num_citations": "3\n", "authors": ["1150"]}
{"title": "Comparative Evaluation of the State-of-the Art on Approaches to Software Adaptation\n", "abstract": " Software needs to evolve to ensure it continuously relevant in supporting the needs of an organization. Thus, software evolution is unavoidable for its survival. Due to rapid changes in business environment and advancement of technology, simplifying software evolution becomes more challenging and may involve high cost. Approaches in simplifying software evolution via software adaptation have been the subject of many current researches. Based on exhaustive literature review, we define four classifications of approaches to software adaptation. The four approaches are Architecture-based, Component-based, Middleware-based and Agent-based. In this paper we present the results of a systematic comparison on the state-of-the-art in software adaptation approaches mentioned earlier. Five evaluation criteria are defined to compare the said approaches. The evaluation criteria used are scalability, context …", "num_citations": "3\n", "authors": ["1150"]}
{"title": "Big Data Analytics Initiatives Using Business Intelligence Maturity Model Approach in Public Sector\n", "abstract": " Big Data requirement in Public Sector is gaining focus in many countries. Described in the Eleventh Malaysia Plan 2016–2020, Big Data Analytics (BDA) has been identified as key focus for Information and Communications Technology (ICT). Especially with the recent participation of Trans-Pacific Partnership Agreement, Malaysia will be competing amongst other nations to make quick and accurate decision contributing to economic and GDP growth. With good understanding and guided implementation framework of Business Intelligence, right and agile decision can be made using the various available information. Malaysia Public Sector requires ICT involvement in Business Intelligence domain to perform Big Data Analytics. With evolving of data availability and needs for building correlation with different sets of data, Big-Data offers an emerging space to analyze wealth of information form structure, semi …", "num_citations": "2\n", "authors": ["1150"]}
{"title": "PROPOSE AN INTEGRATION BETWEEN UML STATIC AND DYNAMIC MODELS USING ENTITY-ATTRIBUTEVALUE UNDER THE MDA CONTEXT.\n", "abstract": " Abstract The Model Driven Architecture (MDA) is adopting models to improve the software productivity, reusability, maintainability and quality by focusing on models and metamodels in place of conventional code. The MDA separates the technical details from the business logic in two different models. The Platform Independent Model (PIM) is concerned with the business logic while the Platform Specific Model (PSM) is more focusing on the targeted platform. Normally, PIM and PSM models stand in different level of abstraction. Moving from one level of abstraction to another is achieved by Model transformation. Both PIM and PSM are modeled using UML diagrams. The UML supports a variety of diagrams that can be categorized into static and dynamic diagrams. The static diagrams are normally targeted the system's structures and it is commonly used to define the PIM and PSM models. On the other hand, the …", "num_citations": "2\n", "authors": ["1150"]}
{"title": "A multi-process quality model: Identification of key processes in the integration approach\n", "abstract": " In this paper we investigate the use of multi-process quality model in the adoption of process improvement frameworks. We analyze an improvement effort based on multiple process quality models adoption. At present, there is a possibility of a software development organization to adopt multi-quality and improvement models in order to remain competitive in the IT market place. Various quality models emerge to satisfy different improvement objective such as to improve capability of models, quality management and serve as IT government purpose. The heterogeneity characteristics of the models require further research on dealing with multiple process models at a time. We discuss on the concept of software process and overview on software maintenance and evolution which are important elements in the quality models. The concepts related to process quality model and improvement models are discussed. The research outlined in this paper shows that software processes, maintenance, evolution, quality and improvement have become really important in software engineering. The synergy among the multi-focused process quality model is examined with respect to process improvement. The research outcome is to determine key processes vital to the implementation of multi-process quality model.", "num_citations": "2\n", "authors": ["1150"]}
{"title": "SRS development procedure: the roles and responsibility of key IT personnel in requirement engineering process\n", "abstract": " This paper explains the roles of key IT Personnel during the development of the Software Requirement Specification (SRS) in the Malaysian Public Sector. We determine the flow of the SRS procedure through the interview process to nine of IT Manager in Malaysian Public Sector. They explain their experience during requirement gathering in IT Project. Our purpose is to standardize their roles and responsibility as a guideline during our software project development. We diagram their experience to be easier understood by IT Personnel. The process flow contents of activity which blends with RE process. We have done the refining using Delphi Technique to the IT Expert in Malaysian Public Sector. We hope that the team will produce the structured SRS for as their guideline for complete the software project development.", "num_citations": "2\n", "authors": ["1150"]}
{"title": "A systematic mapping study on requirements elicitation techniques in collaborative application\n", "abstract": " This paper describes a mapping study to identify what are the existing requirements elicitation available for Computer-Supported Collaboration Work(CSCW) application. This study also points out type of requirements which the developers look for during requirements elicitation. Based on 14 papers that have been refined from the study, the authors look at types of domain involved in CSCW application. This paper also describes potential requirement to support social presence in collaborative application such as in E-learning as one of the domain in CSCW application.", "num_citations": "2\n", "authors": ["1150"]}
{"title": "Analysis of adaptive policy-based approach to avoid policy conflicts\n", "abstract": " PobMC is an adaptive scalable framework which uses policies to control and adapt the system behaviour. Moreover, PobMC has the capability to decouple the adaptation concerns from the application code. Since policies are used to govern the system behavior, conflicts may arise in the set of policies and also may arise during the refinement process, between the high-level goals and the implementable policies. Moreover, policy conflict can result from propagation, action composition and other constraint policies, which cannot be detected by simply comparing authorization policies. In this paper we present a static analysis to address the inconsistencies, scalability when there are two or more policies are enforced simultaneously. Then, we classify our system policy conflicts to verify that policies are enforced correctly. Moreover, the paper provides temporal specification patterns to detect each type of conflicts.", "num_citations": "2\n", "authors": ["1150"]}
{"title": "How artificial intelligent scheduling techniques support intelligent reflective E-Portfolio\n", "abstract": " The aim of this paper is to present the role of Artificial Intelligence techniques (Scheduling Techniques) to enhance reflective e-portfolios quality. Some AI techniques such as expert system; scheduling; Data Mining can support us to enhance our reflective e-portfolios quality. These tools together will define new intelligent Reflective e-portfolio that provides intelligent and customized learning method for each student based on their backgrounds and their realities. This paper analyzes the role of AI-Scheduling Techniques to enhance learning smartness. The final vision of intelligent reflective e-portfolio is to act as an expert to consult students and support them to make Right decisions for their learning complexities.", "num_citations": "2\n", "authors": ["1150"]}
{"title": "An ITIL-based Solution to Record and Retrieve Tacit and Explicit Knowledge based on Giga Knowledge Management Framework in the SME Companies\n", "abstract": " ITIL is the most widely used IT framework in most organizations in the world now. Every public and private IT organization tries to adopt ITIL into its own business and implement it because there are a lot of different kinds of information and activities in the organizations that should manage. There is a possible solution to record and retrieve those founded information in the ITIL-based repository which its name is Configuration Management Data Base (CMDB). Also SME companies have high impact on business market, today. SME’s are engines of developing the economy of developing countries. In addition, one of the most practical Knowledge management Frameworks is suggested by Giga Information Group which is a circular model with four stages that represents what people generally do with knowledge. This paper tries to extend the usability of this ITIL-based repository in to other parts of the SME’s as well to cover four stages of knowledge management framework.", "num_citations": "2\n", "authors": ["1150"]}
{"title": "Open Source Integration into Business Strategies: A Review\n", "abstract": " Open source projects have enabled many business establishments to take advantage of robust software at low cost. This is because open source software is one whose license allows for free modification of source code for ease of reusability. This paper discusses the values of Open Source that can be adopted in business development strategies. The concept of open source and open standards were reviewed. The Open source developments have been closely related to our “Open Onions Ontology” approach. This approach has viewed open source development from five layers. Each of these layers is recognized to have strong attachment with the next closest layer in that order. The bond of coexistence between these layers is identified as the unifying factor which forms the basis for open source developers’ motivation.", "num_citations": "2\n", "authors": ["1150"]}
{"title": "Distributed knowledge management portal for Learning Organizations with collaborative environment\n", "abstract": " A knowledge management system (KMS) is a concept that can be used for creating knowledge repositories, improving knowledge access, sharing and communicating through collaboration, enhancing the knowledge environment and managing knowledge as an asset for an organization as well as inter-organization especially in learning organization (LO). In this paper, we will discuss and propose a distributed KMS portal for LOs with collaborative environment, a model and its components of KMS portal in LOs that will help the organizations to increase its productivity and quality as well as to gain return on investment (ROI). The component of KMS portal consists of its functionality, architecture, taxonomy, psychological, sociocultural and audit.", "num_citations": "2\n", "authors": ["1150"]}
{"title": "Geospatial Data Sharing: Preliminary Studies on Issues and Challenges in Natural Disaster Management\n", "abstract": " The rapid development of information technology has led to the demand for the latest, precise and easy to understand data. Data especially geospatial data is becoming increasingly crucial in all types of planning and decision making. Geospatial data sharing can be categorized into different disciplines such as public safety, disaster management, transportation, traffic control, tracking, health, environment, natural resources, mining, agriculture, utilities and many more. Whether as a way of distribution or retrieval of data, geospatial data has become an essential component of government GIS operations. Despite the prominence of this activity and its centrality to the day-to-day function of many government systems, the geospatial data sharing is still given less attention in the field of natural disaster management. Preliminary information is gathered from Literature Reviews (LR) and unstructured interviews with experts …", "num_citations": "1\n", "authors": ["1150"]}
{"title": "A Review of MyGDI: The Catalyst of the evolution of Geographical Information Systems in Malaysian Public Sector\n", "abstract": " Spatial Data Infrastructure (SDI) is the base for the development and implementation of geospatial direction in many countries. SDI is made of framework of geographic data, Standards, Policies, Tools, Geographical information systems (GIS), Technical Infrastructure, Metadata and legal procedures. GIS being one of the components in the Spatial Data Infrastructure is important for dissemination of geospatial information and services. In Malaysia the Spatial Data Infrastructure or Geospatial Data Infrastructure is known as the Malaysia Geospatial Data Infrastructure (MyGDI). MyGDI enables the evolution of geographical information Systems in Malaysia Public Sector. Over the years many GIS applications have emerged through the development of MyGDI at the federal, state and the local authority levels. GIS application can be categorized into different disciplines such as public safety, disaster management, transportation, traffic control, tracking, health, environment, natural resources, mining, agriculture, utilities and many more. The aim of the paper is to discuss on how MyGDI has facilitated the evolution GIS in Malaysian Public Sector.", "num_citations": "1\n", "authors": ["1150"]}
{"title": "Performance analysis comparison between non mixed-criticality and mixed-criticality system in microcontroller\n", "abstract": " Nowadays, implementation of real-time embedded system or safety-critical in a real-time system is significant within emerging technologies because the system involves many aspects such as safety and task execution without missing deadlines. The main cause of implementation is to avoid catastrophic loss. Besides that, effectuation of the mixed-criticality system in embedded system making system more complex for task execution. For an embedded system, the main component involves real-time scheduling. The implementation of DPM method in real-time scheduling is well known, but in the mixed-criticality system, DPM method is still lacking. In order to cater this problem, Dynamic Power management (DPM) method is deployed onto the microcontroller of the mixed-criticality system to save energy when executing tasks in order to have better performance in the system. The usage of the DPM method in mixed-criticality of microcontroller resulting decrease of 0.82% in LED output voltage value meanwhile, for the LCD output, the voltage value decreased by 1.37% in the home alarm system. Thus, the energy-saving in the microcontroller of the mixed-criticality system using the DPM method is defined.", "num_citations": "1\n", "authors": ["1150"]}
{"title": "A Review of Hybrid Indoor Positioning Systems Employing WLAN Fingerprinting and Image Processing\n", "abstract": " Location-based services (LBS) are a significant permissive technology. One of the main components in indoor LBS is the indoor positioning system (IPS). IPS utilizes many existing technologies such as radio frequency, images, acoustic signals, as well as magnetic sensors, thermal sensors, optical sensors, and other sensors that are usually installed in a mobile device. The radio frequency technologies used in IPS are WLAN, Bluetooth, Zig Bee, RFID, frequency modulation, and ultra-wideband. This paper explores studies that have combined WLAN fingerprinting and image processing to build an IPS. The studies on combined WLAN fingerprinting and image processing techniques are divided based on the methods used. The first part explains the studies that have used WLAN fingerprinting to support image positioning. The second part examines works that have used image processing to support WLAN fingerprinting positioning. Then, image processing and WLAN fingerprinting are used in combination to build IPS in the third part. A new concept is proposed at the end for the future development of indoor positioning models based on WLAN fingerprinting and supported by image processing to solve the effect of people presence around users and the user orientation problem.", "num_citations": "1\n", "authors": ["1150"]}
{"title": "Shape feature extraction methods based pattern recognition: A survey\n", "abstract": " The most visible feature that is more important to an image is the shape. Shape representation is a", "num_citations": "1\n", "authors": ["1150"]}
{"title": "Malware Forensic Analytics Framework Using Big Data Platform\n", "abstract": " The dramatically increased threats such as malware attacks to our cyber world have given us the vital sign to strengthen the security in a more proactive way. Thus, in recent research we proposed an integrated malware forensic analytics framework that will expose the future threats of malware attacks. This framework incorporates malware collections, malware analytics and visualization of discovered malware attacks. In this paper, we present the design and implementation of the framework which focuses on analytics and visualization, and utilized the emerging technology of big data platform. The implementation of the framework shows promising results in presenting descriptive analytics and predicting the future attacks using machine learning algorithms. We also demonstrate the feasibility of Hortonworks Cybersecurity Package (HCP) in supporting the proposed framework. Finally, we discussed the …", "num_citations": "1\n", "authors": ["1150"]}
{"title": "A Preliminary Investigation on Managing Volatile Requirements in E-Learning Web Service\n", "abstract": " Web service is an URL-addressable set of functionality exposed over a network or hosted on the Internet. The service helps organization to interact by using various programming languages and machine platform. Web service requirements are evolving according to requirements’ volatility introduced by business demands and computer technology. In developing E-learning web service, developer needs to cater challenges in business requirements as well as web service issue. E-Learning web service must be managed properly to cater changing requirements of syllabus and courses contents. Therefore, changing requirements can be identified in order to meet requirements corresponding to requirements’ priority. There is a challenge for developer to develop changing requirements in e-Learning Web service since business demands and technical needs always change. For that reason, volatile …", "num_citations": "1\n", "authors": ["1150"]}
{"title": "Development of Social Presence Requirements Artefacts for E-Learning Using Multiphase Approach\n", "abstract": " E-learning is an application which facilitates learners’ activities throughout the learning process. An E-learning plays a role in attracting learners to sustain learners’ connectedness while they are sharing knowledge. To address the issue of lack of connectedness in E-learning, the authors have introduced multiphase approach whereby it is able to assist in providing a set of social presence requirements for E-learning development. This paper reveals four social presence elements for developing connectedness in E-learning. In requirements elicitation, the authors prioritize social presence elements via MoSCoW prioritization method. Delphi method is carried out to obtain experts’ consensus as the evaluation for all the artefacts related to social presence requirements development. The evaluation discusses results on Delphi round one and Delphi round two regarding social presence requirements. Three …", "num_citations": "1\n", "authors": ["1150"]}
{"title": "Energy performance evaluation for dynamic frequency scaling on rate monotonic and earliest deadline first scheduling algorithm\n", "abstract": " Dynamic Voltage and Frequency Scaling (DVFS) algorithm is widely used to reduce processor’s energy consumption in mixed-criticality systems. Existing works show that there are more DVFS algorithms were developed based on Earliest Deadline First (EDF) scheduling scheme compared to Rate Monotonic (RM) scheduling scheme. To understand the reason why EDF is prevalent for DVFS algorithms, simulation can be done to get the power consumption of both scheduling schemes. However, there is no simulation tools available dedicated for this purpose. This research aims to investigate power consumption of both scheduling schemes under different processor speed levels using SimSo simulator. The processor’s utilization and schedulability are determined using a set of task in SimSo. Power consumption for Least Common Multiple of tasks period is then calculated based on the proposed power model. The result shows that EDF performs better than RM and able to reduce 30% of energy at processor speed of 0.7. In addition, the capability of SimSo to be used in DVFS algorithm creation also had been observed. It is found that SimSo can be used for further research with additional codes.", "num_citations": "1\n", "authors": ["1150"]}
{"title": "Indoor positioning system based Wi-Fi fingerprinting for dynamic environment: Experimental preliminary result\n", "abstract": " Location Based Services (LBS) are an important permissive technology and it have wide range of application. The main component of LBS is location detection. It can be divided into proximity, triangulation and fingerprint. Fingerprint Wi-Fi has been preferred technology due to its accurate positioning results and minimal infrastructure cost. It is conducted in offline and online phase. In the first phase, a site survey is conducted to collect the vectors of Received Signal Strength Indicator (RSSI) at many reference points of known locations. Then users measures RSSI vector at their position in the online phase. System compares the received target vector with the stored fingerprints. People Presence Effect (PPE) has a dominant influence to RSSI in a dynamic environment. It is necessary to further research related to PPE so that it can be generated a more accurate indoor positioning system in dynamic environments such as airports, hospital and shopping area.", "num_citations": "1\n", "authors": ["1150"]}
{"title": "Tracking control of an unmanned aerial vehicle using cascade configuration of fuzzy logic controllers in presence of windflaw\n", "abstract": " In this study, an unmanned aerial vehicle (UAV), quadrotor particularly, with six degree of freedom (6-DOF) is modeled and a novel arrangement of fuzzy logic controller (FLC) are designed to control quadrotor’s attitude and altitude. The UAVs are high nonlinear in terms of dynamic equations and are in class of under-actuated systems with six degree of freedom and four propeller’s speed as inputs. So, designing an appropriate controller is the main challenge in UAV’s applications. The controller architectures is composed of three FLCs. A MIMO FLC is implemented to control angles and altitude which is fed by two first output controllers, namely desired roll and pitch angles. Then, an octagonal helix path is constructed in such a way that an octagonal schema is generated in XY plane and is developed in vertical direction. By applying the windflaw to the system as a disturbance, which is blew in three directions, namely x, y, and z, the performance of designed controller is investigated. Finally, results are presented to show the controller performance for tracking purpose in presence of a wind as disturbance.", "num_citations": "1\n", "authors": ["1150"]}
{"title": "MAPPING OF A PLATFORM SPECIFIC MODEL TO A PARTICULAR PLATFORM USING AN EAV DESIGNED PLATFORM MODEL\n", "abstract": " The Model Driven Architecture (MDA) aimed to produce applications that support multiple platforms using models instead of the conventional coding with less cost and time. The MDA development process separated to Platform Independent Model (PIM) and Platform Specific Model (PSM). Both, PIM and PSM are standing in different level of abstraction. The PIM focused on the business rules definition with no concern about the platform environment. It is the PSM role to emphasis on the implementation environment of the targeted platform. Although, the PSM models holding some technical implementation details about the targeted platform, but it’s still considered too abstract to be executed in a run-time platform environment. The degree of abstraction can be controlled by the model mapping, given the MDA standard Platform Model (PM). The PM can be described as a platform’s system manual that provides model mapping with a specific technical details required by the targeted run-time environment. In this work we explicitly employed a Platform Model (PM) designed by the Entity-Attribute-Value (EAV) concept to support the model mapping from PSM to Java platform. A case study provided as proof of concept to generate executable Java code that supports desktop and mobile platform.", "num_citations": "1\n", "authors": ["1150"]}
{"title": "Managing software projects with team software process (TSP)\n", "abstract": " Despite the widespread use of sound project management practices and process improvement models over the last several years, the failure of software projects remains a challenge to organisations. As part of the attempt to address software industry challenges, several models, frameworks, and methods have been developed that are intended to improve software processes to produce quality software on time, under budget, and in accordance with previously stipulated functionalities. One of the most widely practised methods is the Team Software Process (TSP). The TSP was designed to provide an operational framework for establishing an effective team environment and guiding engineering teams in their work. This chapter provides an overview of the TSP and its associated structures and processes. It also highlights how the TSP operational framework can assist project manager and software development …", "num_citations": "1\n", "authors": ["1150"]}
{"title": "COMMON SUB-EXPRESSION IDENTIFICATION STRATEGY FOR MQO\n", "abstract": " In query optimization, a query can be executed with different strategies, known as execution plan. The query optimizer will determine the best execution plan for a single query. However, when there are more than one query to be executed together, the locally optimal strategies for single queries may not be the best choice for obtaining a globally optimal execution cost. This will require for a multiple query optimizer that is able to select an alternative plan for each query in order to obtain an optimal global execution plan for the multiple queries. An optimal global plan can be obtained in two ways, by using an admissible heuristic with the search algorithms or by decreasing the number of search space through reducing the number of alternative plans generated. In generating alternative plans, the number and quality of the alternative plans produced are the major factors that will determine the performance of multiple-query optimization. In this paper, we propose the sharing opportunities for identifying the common sub-expressions.", "num_citations": "1\n", "authors": ["1150"]}
{"title": "FlexSIG: Flexible software inspection groupware.\n", "abstract": " Degree: Ph. D.DegreeYear: 1999Institute: Aston University (United Kingdom)The objective of this research is to design and build a groupware system which will allow members of a distributed group more flexibility in performing soft-ware inspection.", "num_citations": "1\n", "authors": ["1150"]}