{"title": "Robot motion planning with uncertainty in control and sensing\n", "abstract": " Most of the research in robot motion planning has focused on finding a collision-free path connecting two configurations of the robot among obstacles, under the assumptions that geometric models are complete and accurate and that robot control is perfect. In this paper we consider the problem of planning motion strategies in the presence of uncertainty in both control and sensing, using the preimage backchaining approach. Though attractive, this approach raises difficult computational issues. One of them, preimage computation, is the main topic of this paper. We describe two practical methods for computing preimages for a robot having a two-dimensional Euclidean configuration space. We also propose a combination of these two methods which yields the most powerful practical method devised so far for computing preimages. A motion planner based on these methods has been implemented and experimental …", "num_citations": "151\n", "authors": ["720"]}
{"title": "Sensor fusion and object localization\n", "abstract": " In this paper, we discuss the issue of locating objects through multiple sensory information. Sensor measurements are subject to limitations of sensor precision and accuracy. Although errors in position estimates are affected only by the errors of sensor measurements, errors in orientation estimates are also dependent on the dimensions over which the measurement has been made. The concept of good measurement is used in selecting and weighting partial estimates of the position and orientaion. The problem of finding the best estimate of the position and orientation is formulated as a linear system of these multiple estimates. The best estimate is then obtained by solving this system in a weighted least square sense. This method has been implemented for a manipulator end-effector instrumented with centroid and matrix tactile sensors.", "num_citations": "58\n", "authors": ["720"]}
{"title": "Wheel rolling constraints and slip in mobile robots\n", "abstract": " It is widely accepted that dead reckoning based on the rolling with no slip condition on wheels is not a reliable method to ascertain the position and orientation of a mobile robot for any reasonable distance. We establish that wheel slip is inevitable under the dynamic model of motion using classical results on the accessibility and controllability in nonlinear control theory and an analytical model of rolling of two linearly elastic bodies.", "num_citations": "32\n", "authors": ["720"]}
{"title": "Force strategies in real time fine motion assembly\n", "abstract": " The ability to execute precise assembly by position and force measurement is governed by our understanding of constrained motion of objects. In this paper, we present object motions under position and force feedback and its implementation in an operational space hybrid scheme. The translational motion of object has a simple model. We show possible rotation motions of object due to moment control. Moments arise due to reaction forces and provide contact information. Rotation motion due to contact moment allows assembly of objects under relaxed uncertainty condition.", "num_citations": "22\n", "authors": ["720"]}
{"title": "On goal recognizability in motion planning with uncertainty\n", "abstract": " Motion planning with uncertainty in control and sensing raises two basic issues, goal reachability and goal recognizability, which subtly interact. A partial analysis of this interaction is presented. It is shown that the capability of a motion command to recognize goal achievement is augmented by providing the termination condition of the motion command with the knowledge of the region in which the motion command is known to start (initial state) and the knowledge of the termination condition itself (final state). The increase in the recognition power of the termination condition is illustrated with a simple preimage construction example. The size of the preimage grows when one adds the initial and the final states in the knowledge of the termination condition. Although these results are preliminary it is expected that they will eventually help in the design of more powerful motion planners in the presence of uncertainty.<>", "num_citations": "13\n", "authors": ["720"]}
{"title": "Conceptual design of an aircraft automated coating removal system\n", "abstract": " Paint stripping of the US Air Forces large transport aircrafts is currently a labor-intensive, manual process. Significant reductions in costs, personnel and turnaround time can be accomplished by the judicious use of automation in some process tasks. This paper presents the conceptual design of a coating removal systems for the tail surfaces of the C-5 plane. Emphasis is placed on the technology selection to optimize human-automation synergy with respect to overall costs, throughput, quality, safety, and reliability. Trade-offs between field-proven vs. research-requiring technologies, and between expected gain vs. cost and complexity, have led to a conceptual design which is semi-autonomous (relying on the human for task specification and disturbance handling) yet incorporates sensor-based automation (for sweep path generation and tracking, surface following, stripping quality control and tape/breach handling).", "num_citations": "6\n", "authors": ["720"]}
{"title": "Wheel rolling constraints and slip in mobile robots-simulation results\n", "abstract": " Previously, we (1997) established that wheel slip is inevitable under the dynamic model of motion using classical results on the accessibility and controllability in nonlinear control theory and an analytical model of rolling of two linearly elastic bodies. In this paper, we present simulation results on the magnitude of such slip based on Kalker's simplified linear theory of the traction forces at the wheel-ground interface.", "num_citations": "3\n", "authors": ["720"]}
{"title": "Local characterization of invariant sets of an autonomous differential inclusion\n", "abstract": " An application in robotics motivates us to characterize the evolution of a subset in state space due to a compact neighborhood of an arbitrary dynamical system—an instance of a differential inclusion. Earlier results of Blagodat·skikh and Filippov (1986) and Butkovskii (1982) characterize the boundary of theattainable set and theforward projection operator of a state. Our first result is a local characterization of the boundary of the forward projection ofa compact regular subset of the state space.               Let the collection of states such that the differential inclusion contains an equilibrium point be called asingular invariant set. We show that the fields at the boundary of the forward projection of a singular invariant set are degenerate under some regularity assumptions when the state-wise boundary of the differential inclusion is smooth. Consider instead those differential inclusions such that the state-wise …", "num_citations": "1\n", "authors": ["720"]}
{"title": "Control uncertainty in fine motion planning\n", "abstract": " The goal of Fine Motion Planning is to generate provable robot programs in the presence of control, sensing, and model uncertainty. In particular, fine motion planning includes part mating sequences that require force control. We first present a new result in the formalism of fine motion planning that embedding the knowledge of the termination condition in the construction of preimage augments the size of preimage. We, then, present new results on the characterization of control uncertainty.", "num_citations": "1\n", "authors": ["720"]}