{"title": "A unified theory of implicit attitudes, stereotypes, self-esteem, and self-concept.\n", "abstract": " This theoretical integration of social psychology's main cognitive and affective constructs was shaped by 3 influences:(a) recent widespread interest in automatic and implicit cognition,(b) development of the Implicit Association Test (IAT; AG Greenwald, DE McGhee, & JLK Schwartz, 1998), and (c) social psychology's consistency theories of the 1950s, especially F. Heider's (1958) balance theory. The balanced identity design is introduced as a method to test correlational predictions of the theory. Data obtained with this method revealed that predicted consistency patterns were strongly apparent in the data for implicit (IAT) measures but not in those for parallel explicit (self-report) measures. Two additional not-yet-tested predictions of the theory are described.", "num_citations": "2485\n", "authors": ["1197"]}
{"title": "Using the implicit association test to measure self-esteem and self-concept.\n", "abstract": " Experiment 1 used the Implicit Association Test (IAT; AG Greenwald, DE McGhee, & JLK Schwartz, 1998) to measure self-esteem by assessing automatic associations of self with positive or negative valence. Confirmatory factor analysis (CFA) showed that two IAT measures defined a factor that was distinct from, but weakly correlated with, a factor defined by standard explicit (self-report) measures of self-esteem. Experiment 2 tested known-groups validity of two IAT gender self-concept measures. Compared with well-established explicit measures, the IAT measures revealed triple the difference in measured masculinity–femininity between men and women. Again, CFA revealed construct divergence between implicit and explicit measures. Experiment 3 assessed the self-esteem IAT's validity in predicting cognitive reactions to success and failure. High implicit self-esteem was associated in the predicted fashion with …", "num_citations": "2194\n", "authors": ["1197"]}
{"title": "Computer system architecture for automatic context associations\n", "abstract": " A computer system models human memory by deriving associations between objects, events, and the context of the computer user or users. These associations can be dynamically generated, changing depending on the behavior of the user and context. Examples of areas in which this system can be used include time management (eg, a calendar that presents time-based groupings of objects), people management (eg, use analysis of user communications to rank importance of people to the user, groupings, and associations between people/groups and other objects such as documents, email), and general computer management (eg, use analysis of user behavior to identify important objects and objects that are related to a current focus and context of the computer user).", "num_citations": "899\n", "authors": ["1197"]}
{"title": "Social mapping of contacts from computer communication information\n", "abstract": " Social information, including computer communication information, is modeled according to a network approach, and users are provided with representations of patterns within their social spaces and graphical interface tools for navigating through the spaces. This can enhance the user's ability to seek out social information and manage their online social relationships. The social mapping includes automatically collecting computer communication information relating to multiple contacts who are in computer communication with each other, one of the multiple contacts being a selected user. The computer communication information is filtered according to one or more preselected criteria to maintain the number of contacts associated with the selected user at or below a selected threshold. The computer communication information is analyzed to determine extents of similarity between the multiple contacts. A …", "num_citations": "608\n", "authors": ["1197"]}
{"title": "The social life of small graphical chat spaces\n", "abstract": " This paper provides a unique quantitative analysis of the social dynamics of three chat rooms in the Microsoft V-Chat graphical chat system. Survey and behavioral data were used to study user experience and activity. 150 V-Chat participants completed a web-based survey, and data logs were collected from three V-Chat rooms over the course of 119 days. This data illustrates the usage patterns of graphical chat systems, and highlights the ways physical proxemics are translated into social interactions in online environments. V-Chat participants actively used gestures, avatars, and movement as part of their social interactions. Analyses of clustering patterns and movement data show that avatars were used to provide nonverbal cues similar to those found in face-to-face interactions. However, use of some graphical features, in particular gestures, declined as users became more experienced with the system. These …", "num_citations": "550\n", "authors": ["1197"]}
{"title": "Systems and methods for sharing dynamic content among a plurality of online co-users\n", "abstract": " Systems and methods for establishing a shared dynamic content experience are disclosed. A method for sharing a dynamic content experience according to the invention includes an inviter computer communicating, via a first communication path between an invitee computer and a network based communication server, an invitation to establish a shared dynamic content experience between the inviter computer and the invitee computer. If the invitation is accepted, a content sharing communication path is established between the inviter computer and the invitee computer. Information relating to a current dynamic content experience at the inviter computer is communicated, via the content sharing communication path, to the invitee computer. Information relating to a current dynamic content experience at the invitee computer is communicated, via the content sharing communication path, to the inviter computer.", "num_citations": "471\n", "authors": ["1197"]}
{"title": "Sharing media objects in a network\n", "abstract": " A method, computer readable medium, user component, and system for sharing media object in a network environment are disclosed. A network manager may determine a similarity metric between users of the environment, between media objects, and/or between a user and media objects. Based upon the similarity metric, the network manager may share media objects with another user if the similarity metric exceeds a predetermined value or is more similar than other retrieved media objects. A user component may also provide a network map manager to display a network map, and may provide a tailored view manager to display a web log associated with at least one of the user icons displayed in the network map.", "num_citations": "348\n", "authors": ["1197"]}
{"title": "Implicit self-esteem.\n", "abstract": " The authors propose that an indirect measure of self-esteem has the potential of shedding light on the relationship between personal self-esteem and ingroup favoritism. A potential indirect measure is provided by the Implicit Association Test (IAT: AG Greenwald et al, 1998) which assesses automatic concept-attribute associations. This chapter (1) reviews the construct validity of self-report measures of self-esteem;(2) describes how the IAT can provide an indirect measure of self-esteem;(3) discusses how the IAT may be used to further understanding between personal self-esteem and evaluation of social identity.(PsycInfo Database Record (c) 2020 APA, all rights reserved)", "num_citations": "345\n", "authors": ["1197"]}
{"title": "Group-centric location tagging for mobile devices\n", "abstract": " An annotation is manually and/or automatically correlated with a location and selectively distributed to participants of an associated user network. Thus, network participants possessing a common bond can obtain “trusted” information regarding specific locations. This allows a network participant to locate resources such as friends, restaurants, hotels, and/or entertainment sites, etc. based on the annotations provided by other network participants for those locations. Network users can annotate locations with temporal information, text, audio/video, photos, and/or graphics, etc. The annotations can be provided to the network via mobile devices and/or via non-mobile devices. Annotation information can be entered before a user visits a location, while a user is visiting a particular location, and/or after a user has visited a location. Location coordinates can be automatically provided and/or manually entered. Annotations …", "num_citations": "272\n", "authors": ["1197"]}
{"title": "Faceted identity, faceted lives: social and technical issues with being yourself online\n", "abstract": " This paper explores key issues people experience managing personal boundaries within and across social technologies. We look in particular at email and online social networks. We offer a theoretical framework for understanding the errors in assumptions about the singularity of identity that are currently inscribed into the sharing models of social technology systems. Through a questionnaire study we examine how people facet their identities and their lives, and how these facets are expressed through use of email and Facebook. We found family was an extremely important context for sharing online, and that email was still a preferred form of communication for private sharing across facets of life. Single, working men had the highest level of incompatible facets, and a higher level of facet incompatibility was correlated with increased email usage and worry about sharing in the context of social networks.", "num_citations": "192\n", "authors": ["1197"]}
{"title": "People-centric view of email\n", "abstract": " The subject invention provides a unique system and method that facilitates contact-or people-based organization of messages. A list of contacts can be generated based on the people or groups who have communicated with the user (mailbox owner) via email or otherwise. To view desired messages, a user can select one or more contacts that participated in the desired messages as either a recipient or sender. Following the selection, messages between the selected contacts and the user can be displayed in a window. Any items or information shared in the messages can be viewed in a separate window. A link can be maintained between any shared item and its message of origin. The user can also view messages that include third parties. The contact list is dynamic and due to limited display space, contacts communicating the most frequently with the user can be listed on a top level.", "num_citations": "173\n", "authors": ["1197"]}
{"title": "Method for online game matchmaking using play style information\n", "abstract": " A method and system for accumulating data to match and matching a user, based upon a play style and/or personal attribute, in an online gaming environment is described. One aspect of the invention provides a matchmaking system that matches players based upon a play style of the players. The system matches players who are looking for games with players who prefer similar play styles. Similarly the system can match players based upon a personal attribute of the player. The system can be built into existing general skill level and technical capabilities based matchmaking systems to provide more user desired matchmaking parameters, allowing a user to choose based upon play style, personal attribute, general skill level, and/or technical capabilities.", "num_citations": "173\n", "authors": ["1197"]}
{"title": "Dynamic group formation for social interaction\n", "abstract": " A system and method that facilitates dynamic group formation for social interaction and/or real-time sharing of content with the group is provided. A group formation system includes a user interface component that facilitates a user's entry of information and display of information regarding group formation. For example, the user interface component can be employed, for example, with a mobile communication device such as a mobile phone, personal digital assistant (PDA), a smart phone, a small, web based mobile or a wireless application protocol (WAP) client, and/or a regular web client. The system can further include a group formation component that forms a group based, at least in part, upon information received from a user via the interface component. The group configuration component can further store information regarding groups (eg, a name/identifier, member (s), event (s) and/or shared context …", "num_citations": "166\n", "authors": ["1197"]}
{"title": "Implicit group formation around feed content for mobile devices\n", "abstract": " A unique system and method that facilitates group-based mobile communication around external feed content is provided. The system and method involve adding external feed content to content generated within a group. Both types of content can be viewed on the mobile devices of the group. Updates to the feed content can be obtained and communicated to the group. When multiple feeds are subscribed to by a group, one or more group members can display such feed content in a selective manner. For example, splinter groups can be formed off of the original group for members who wish to receive a subset of feeds (feed content) to assist them in focusing on a topic of interest. Group members can also employ display filters to restrict feed content displayed on their mobile devices. Users can also search for available feeds and form new groups around such content or join an existing group.", "num_citations": "153\n", "authors": ["1197"]}
{"title": "Structured online interactions: improving the decision-making of small discussion groups\n", "abstract": " A quantitative research experiment was used to examine whether a group's computer-mediated decision-making could be improved by providing a scripted structure to the groups text chat discussion. The study compared a regular chat discussion to a scripted chat discussion using Lead Line, a program that allows people to add a layer of pre-authored structure to regular text chat. We found that groups were more likely to come to consensus in structured chat discussions. In addition, groups applied the structure they learned to subsequent regular chat sessions.", "num_citations": "147\n", "authors": ["1197"]}
{"title": "Instant meeting preparation architecture\n", "abstract": " Architecture that facilitates generation of an event report that is an aggregation of public and private data related to a specific task. Information about the event is automatically compiled, including the recipients, URLs, shares, attachments, and documents, as well as location maps and social relationships. The report can be a one-page document that summarizes topics of a meeting or event, the attendees, how the attendees relate, their motivations, and what the attendees may be looking for from the meeting. The report can be formatted to structure event information in a certain way such as according to a company organizational chart, such that an attendee that is higher up on the org chart will be presented on the report higher than someone who is lower on the org chart. Moreover, attendees can be grouped according to functions, or social groupings or project groups, for example.", "num_citations": "142\n", "authors": ["1197"]}
{"title": "Implicit partisanship: Taking sides for no reason.\n", "abstract": " After spending 45 s studying the names of 4 members of a hypothetical group, subjects showed both implicit liking and implicit identification with the group. These effects of studying names were much larger than the mere exposure (RB Zajonc, 1968) effects of either 6 (Experiment 2) or 10 (Experiment 3) extra exposures to each name. This implicit partisanship effect differs from the minimal group effect (H. Tajfel, 1970) because its procedure involves no membership in the target group. It also differs from the mere exposure effect because the target stimuli are presented once as members of a group rather than multiple times as unrelated individuals. A plausible (but not established) interpretation is that the attitude and identification effects are consequences of mere categorization.(PsycINFO Database Record (c) 2016 APA, all rights reserved)", "num_citations": "123\n", "authors": ["1197"]}
{"title": "Designing for improved social responsibility, user participation and content in on-line communities\n", "abstract": " Web sites face difficult challenges in supporting successful communities. In this paper we discuss 2 operating web sites, identically designed but with different and distinct audiences. These sites collect user data from site activity and feed it back to the user community in novel ways. The sites are highly active and growing, and have fostered socially conscious, easily navigable and comprehensible on-line communities with little cost and maintenance. The practice of user data collection and re-purposing we describe works particularly well in highly contextual or information/resource-driven communities. These sites also integrate custom content authoring tools and track their use. The authoring tools were designed to quickly grow a specialized\" knowledge base\" of content created by users and published to a larger audience. A status system encourages the participation of users to contribute to this knowledge base …", "num_citations": "96\n", "authors": ["1197"]}
{"title": "HutchWorld: clinical study of computer-mediated social support for cancer patients and their caregivers\n", "abstract": " To address the needs of cancer patients and their caregivers, Microsoft Research and the Fred Hutchinson Cancer Research Center developed HutchWorld, an online community environment, to provide computer-mediated social and informational support. In a controlled clinical study, we deployed HutchWorld to bone marrow transplant patients and their caregivers and assessed the impact of Internet access and HutchWorld on their quality of life. We found that Internet access and the use of HutchWorld helped to buffer study participants against reductions in life satisfaction and social support following the transplant procedure. In particular, participants used the Internet to seek out support from family and friends", "num_citations": "91\n", "authors": ["1197"]}
{"title": "Command based group SMS with mobile message receiver and server\n", "abstract": " Disclosed is a unique system and method that facilitate group communication using SMS text messaging and a plurality of SMS based commands. More specifically, the system and method make use of mobile communication devices such as mobile or cellular phones, smart phones, and/or PDAs which are equipped with SMS capabilities. Communication within a group of users can be accomplished in part by creating a text message and sending it to at least one communication server by way of at least one common access number. The communication server can analyze the message to determine the recipient group and broadcast the message to the members of the group in real-time or near real-time. Groups can be user-defined and managed dynamically by users using either a website interface or a mobile communication device interface at any time or anywhere. The communication server can be a suitably …", "num_citations": "89\n", "authors": ["1197"]}
{"title": "Lessons learned: Building and deploying shared virtual environments\n", "abstract": " The design and structure of virtual environments have an impact on the nature of the social interactions found within the environment. Our goal in this chapter is to understand better why some designs and structures support sustainable, dynamic social interactions, while others do not. Over the past six years, the Virtual Worlds Group at Microsoft Research [1] has designed, deployed, and studied two virtual environment products, Microsoft V-Chat [2] and the Virtual Worlds Platform [3]. With both of these products, we designed tools for others to build and deploy their own environments, and we built and supported environments of our own. Over the years, hundreds of world builders have used these products to build virtual environments for their own communities. Thousands of end users have visited, joined, and helped to develop communities. Through our prototyping, observations, and data collection we …", "num_citations": "85\n", "authors": ["1197"]}
{"title": "13. Prologue to a Unified Theory of Attitudes, Stereotypes, and Self-concept\n", "abstract": " The theoretical analysis in this chapter connects social psychology's central cognitive constructs, stereotype and self-concept, to its central affective constructs, attitude and self-esteem. In addition to proposing this unified account of social psychology's major theoretical constructs, the chapter seeks to unify the competing affective-cognitive consistency principles of social psychology's classic consistency theories: Heider's (1958) balance theory, Osgood and Tannenbaum's (1955) congruity theory, and Festinger's (1957) cognitive dissonance theory. Initial support for the unified theory comes from experiments that use a new latency-based procedure, the Implicit Association Test (IAT), to obtain indirect measures of implicit attitudes, stereotypes, self-concept, and self-esteem (Banaji & Greenwald, 1995). The IAT's findings reveal patterns of affective-cognitive consistency that are not readily observed with explicit (self-report) measures.", "num_citations": "84\n", "authors": ["1197"]}
{"title": "Whoo. ly: Facilitating information seeking for hyperlocal communities using social media\n", "abstract": " Social media systems promise powerful opportunities for people to connect to timely, relevant information at the hyper local level. Yet, finding the meaningful signal in noisy social media streams can be quite daunting to users. In this paper, we present and evaluate Whoo. ly, a web service that provides neighborhood-specific information based on Twitter posts that were automatically inferred to be hyperlocal. Whoo. ly automatically extracts and summarizes hyperlocal information about events, topics, people, and places from these Twitter posts. We provide an overview of our design goals with Whoo. ly and describe the system including the user interface and our unique event detection and summarization algorithms. We tested the usefulness of the system as a tool for finding neighborhood information through a comprehensive user study. The outcome demonstrated that most participants found Whoo. ly easier to …", "num_citations": "77\n", "authors": ["1197"]}
{"title": "Supporting community in third places with situated social software\n", "abstract": " The Community Collage (CoCollage) is designed to cultivate community in a café, a quintessential\" third place\", by bringing the richness of online social software into a physical community space. The system shows photos and quotes uploaded to a web site by café patrons and staff on a large computer display in the café, providing a new channel for awareness, interactions and relationships among people there. We describe the CoCollage system and report on insights and experiences resulting from a 2-month deployment of the system, focusing on the impact the system has had on the sense of community within the café.", "num_citations": "70\n", "authors": ["1197"]}
{"title": "Life\" modes\" in social media\n", "abstract": " Current social media products such as Facebook and Twitter have not sufficiently addressed how to help users organize people and content streams across different areas of their lives. We conducted a qualitative design research study to explore how we might best leverage natural models of social organization to improve experiences of social media. We found that participants organize their social worlds based on life'modes', ie, family, work and social. They strategically use communication technologies to manage intimacy levels within these modes, and levels of permeability through the boundaries between these modes. Mobile communication in particular enabled participants to aggregate and share content dynamically across life modes. While exploring problems with managing their social media streams, people showed a strong need for focused sharing-the ability to share content only with appropriate …", "num_citations": "64\n", "authors": ["1197"]}
{"title": "Identification of relationships in an environment\n", "abstract": " A method identifies components associated with a first end point in an environment, such as a social environment. The method further identifies components associated with a second end point in the environment. A determination is made regarding whether any of the identified components are associated with both the first end point and the second end point. The method then displays relationships between the first end point, the second end point, and any components associated with both the first end point and the second end point.", "num_citations": "55\n", "authors": ["1197"]}
{"title": "Wallop: Designing social software for co-located social networks\n", "abstract": " Technology is increasingly being incorporated into people's day-to-day social relationships, particularly for people whose friendships occupy the center of their social lives. In the following paper we discuss a co-located social group's tendency to integrate planning and re-experiencing around social events with tools for persistent conversations. Through a questionnaire study we found that emails and mailing lists were used as much as phone conversations to plan social activities, and that said usage was positively correlated with measures of friendship satisfaction, sense of community, and percentage of time spent socializing. In response to our observations, we designed a sharing and communication application, Wallop, to enrich the co-located social group's planning and sharing around social events. Wallop provides both communication and social awareness tools, enabling users to build conversations in the …", "num_citations": "53\n", "authors": ["1197"]}
{"title": "Exploring wearable ambient displays for social awareness\n", "abstract": " Mobile phones represent not only a means of communication, but an increasingly omnipresent computing platform, enabling diverse modes of communication including ambient displays that are tied to bodies and social groups, rather than physical environments. As an example of such a display, we present Damage, a prototype device for mobile ambient awareness of a social group, and discuss design considerations for such devices.", "num_citations": "52\n", "authors": ["1197"]}
{"title": "Personal Map: Automatically Modeling the User's Online Social Network.\n", "abstract": " The Personal Map provides an automated visual overview of the user’s online social network, which can be used in lieu of user-generated contact lists. We explored people’s mental models of their social networks by having them draw whom they cared about, and then developed the Personal Map to automatically visualize these models. Our automated models use past email behavior to infer whom users care about, and how users implicitly cluster or organize contacts in their minds. A user test of the Personal Map indicates that people found it both accurate and compelling. We integrated the underlying model into users’ everyday email through a list of most important and related contacts, and studied its usage. While some people used the list of related contacts, they did not care for its dynamic nature, leading to new user interface designs.", "num_citations": "50\n", "authors": ["1197"]}
{"title": "Supporting sociability in a shared browser\n", "abstract": " The present paper explores the importance of designing shared browsing user interfaces to support sociability. In particular, several shared browsing interfaces were empirically tested for the extent to which they helped people achieve a sense of shared understanding--or common ground--while surfing the web. We found a) that people generally preferred a shared browser to an unshared browser when shopping online together, and b) that user interface features that enhanced common ground had a greater impact on enjoyment than did features affecting ease of use or functionality. These results suggest that web designers need to take into account supporting sociability when considering the tradeoffs in their user interface designs.", "num_citations": "47\n", "authors": ["1197"]}
{"title": "Educating the next generation of data scientists\n", "abstract": " My perception of big data from the student side is that there is not a great deal of consensus about what it actually is. It is a very popular buzzword. It gets thrown around a lot. How people who are creating and using the tools use the term is sometimes very different from how people in business who are trying to figure out what big data is use the term. I think a lot of the business side is a little bit more about master data management than it is necessarily big data in the more technical sense.", "num_citations": "46\n", "authors": ["1197"]}
{"title": "Swarm: Hyper awareness, micro coordination, and smart convergence through mobile group text messaging\n", "abstract": " Text messaging has become an integral part of mobile communication, with a significant impact on cultural and social norms in many countries. Our goal is to explore how group-based text messaging enables continuous social awareness, group coordination and smart convergence on social events. We implemented a group text messaging system, Swarm, and deployed it to several communication groups for ten months. Through usage logs, questionnaires, text analysis, and direct observation we examined how people integrate group text messaging into their day to day social lives. Swarm was used primarily for lightweight distribution of context information (availability, location, and event status) in order to facilitate social convergence. We discuss the lessons learned from our deployment, and the implications for the design of mobile, group communication systems.", "num_citations": "44\n", "authors": ["1197"]}
{"title": "HutchWorld: Lessons Learned A Collaborative Project: Fred Hutchsinson Cancer Research Center & Microsoft Research\n", "abstract": " The Virtual World Group (VWG) in Microsoft Research and the Fred Hutchinson Cancer Research Center (the Hutch) are collaborating to develop and study online social support systems for patients at the Hutch. Medical research has shown that social support contributes positively toward psychological and physical well-being. However, in the real world, it is difficult for immune-compromised patients, their families, and their caregivers to interact with others facing similar challenges. In order to address the needs of Hutch patients and their caregivers, Microsoft and the Hutch developed HutchWorld, a Virtual Worlds application, to provide online, computer-mediated social and informational support. The present paper describes the approach of each design phase of the project, and lessons learned about a) developing an interactive online support system for a specific audience, b) the deployment of the online …", "num_citations": "41\n", "authors": ["1197"]}
{"title": "Measuring the impact of third place attachment on the adoption of a place-based community technology\n", "abstract": " CoCollage is a placed-based community technology that leverages the power of online social networking to facilitate awareness and face-to-face interactions in a third place. We adapted standardized measures of place attachment, social networks and psychological sense of community to provide a framework grounded in the social science literature for studying real world adoption of place-based community technologies. We found the standardized measures of place attachment and psychological sense of community meaningfully predicted likelihood of technology adoption and usage in a café. We discuss some lessons learned from our initial deployment of CoCollage in a real-world setting to support a nascent place-based community.", "num_citations": "40\n", "authors": ["1197"]}
{"title": "Observation of Katrina/Rita Groove deployment: Addressing social and communication challenges of ephemeral groups\n", "abstract": " In order to better understand the challenges specific to the deployment of collaboration technologies in crisis situations, we conducted an informal observational study of the deployment of Groove Virtual Office to various civil and military groups at the heart of the disaster zone over the course of ten days. We summarize both general lessons learned from observations of social and communication challenges in crisis situations that impact technology adoption, and make specific recommendations for improving the deployment process of Groove to enable cross group collaboration. We generally found that dynamic, informal social networks and lightweight ephemeral work groups were essential social structures in the relief effort, and we discuss the need to innovate technologies to support these alternative types of organizations. We encourage that current technology centric innovation for ephemeral workgroups is complemented by a usage centric approach to help address emergent behaviors and opportunities.", "num_citations": "39\n", "authors": ["1197"]}
{"title": "Predicting user engagement on twitter with real-world events\n", "abstract": " People invest time, attention, and emotion while engaging in various activities in the real-world, for either purposes of awareness or participation. Social media platforms such as Twitter offer tremendous opportunities for people to become engaged in such real-world events through information sharing and communicating about these events. However, little is understood about the factors that affect people's Twitter engagement in such real-world events. In this paper, we address this question by first operationalizing a person's Twitter engagement in real-world events such as posting, retweeting, or replying to tweets about such events. Next, we construct statistical models that examine multiple predictive factors associated with four different perspectives of users' Twitter engagement, and quantify their potential influence on predicting the (i) presence; and (ii) degree—of the user's engagement with 643 real-world events. We also consider the effect of these factors with respect to a finer granularization of the different categories of events. We find that the measures of people's prior Twitter activities, topical interests, geolocation, and social network structures are all variously correlated to their engagement with real-world events.", "num_citations": "37\n", "authors": ["1197"]}
{"title": "Selective multi level expansion of data base via pivot point data\n", "abstract": " Systems and methodologies are provided for data visualization, retrieval and management of a logically ordered list by a selective multi level expansion of pivot point data. Such pivot points can represent hierarchy expansion designators to a subsequent level, which can include user created groups/clusters of data. The present invention facilitates data management by advantageously combining; the logical order of data with relevance criteria that can indicate importance of the data to a user. The logical order of the data can be a user friendly order that is easily recognizable and independent of the relevance criteria.", "num_citations": "30\n", "authors": ["1197"]}
{"title": "Personality matters: Incorporating detailed user attributes and preferences into the matchmaking process\n", "abstract": " Finding ways of reducing undesired behavior in online interactions is at the forefront of the social computing research agenda. One promising way to reduce perceived \"bad behavior\" is by matching members of online social environments with corresponding behavioral preferences. We present an empirical study (N=267) of an experimental system for matching users. As a test bed we chose the online game MechAssault, which largely supports one-off encounters within a socially homogenous population. Even within this population we found great variability in the way users selected their gaming partners. One type of player chose partners mainly on their skill, another mainly on a friendly gaming personality, and a third preferred aggressive players. Detailed analyses revealed the underlying attributes of user profiles that generated these user types. The findings suggest that a matchmaking system can better …", "num_citations": "30\n", "authors": ["1197"]}
{"title": "Ambient collage display of digital media content\n", "abstract": " Disclosed are methods and systems for automatically displaying media items (130) preselected by a user (110) on a collage display (700) located at a social gathering spot when the user is present. A user of the system sets up a personal online profile (110) through a website (100,200) and the profile identifies a portable device (500) associated with the user. User online profiles (110) are stored in a database (400) on a system web server (300), and may include selected media items (132) selected by the user. At a venue, the user's presence is automatically detected by various electronic means, and a personalized welcome message (702) may be displayed on the collage display screen (700) to notify other patrons of the venue. Users present may comment or vote (182,184) on the media items seen on the collage display, as well as send text messages to the display (164,750).", "num_citations": "27\n", "authors": ["1197"]}
{"title": "Emotional responses to changing feedback: is it better to have won and lost than never to have won at all?\n", "abstract": " Two experiments investigated how self‐esteem guides people'semotional responses to changing evaluative feedback. In both experiments, participants receivedan initial evaluation (either positive or negative) followed by a second evaluation (either positiveor negative). Emotional reactions to the second evaluation were then assessed. High self‐esteemparticipants found feedback that was consistently negative to be most distressing, whereas lowself‐esteem participants were most disturbed by feedback that changed from positive to negative.The theoretical and practical implications of the findings are discussed.", "num_citations": "27\n", "authors": ["1197"]}
{"title": "Wireless brainstorming: Overcoming status effects in small group decisions\n", "abstract": " Social factors, such as status differences, may prevent some members from participating in group decisions. Computerized group decision support systems (GDSSs) can reduce social influences by allowing group members to contribute anonymously and in parallel. This study explores how a simple GDSS on a wireless handheld-device can augment face-to-face group decisions. Small groups of men and women brainstormed potential names for a computer game and voted for the best name using the wireless devices. The names generated were either associated with the person who produced them or not, and group member status was manipulated through the nature of the task and the proportions of men and women in the groups; men were more knowledgeable computer gamers and were always the numeric majority. We found-that men and women generated more ideas when they were anonymous, and …", "num_citations": "24\n", "authors": ["1197"]}
{"title": "Puget sound off: fostering youth civic engagement through citizen journalism\n", "abstract": " Social media technologies provide unique channels to empower youth to become more civically engaged. Puget Sound Off is an online blogging and networking site focused on helping youth connect, collaborate, and take action around local community issues. We performed an evaluation study seeking lessons learned from a real world deployment. We found that a core group of youth became highly engaged with Puget Sound Off, and that both usage and identification with the community was positively correlated with civic engagement. Youth reported an appreciation for the opportunity for meaningful discussion around issues that mattered to them. We found however that growth of Puget Sound Off was slow, in part due to the constraints of deploying to youth in a real world context with concerns about inappropriate use. We end with recommendations for fostering growth and civic engagement in related social …", "num_citations": "20\n", "authors": ["1197"]}
{"title": "Using email mailing lists to approximate and explore corporate social networks\n", "abstract": " Online tools may facilitate knowledge exchange by allowing users to share information with others near them in their corporate social network. We first explore the viability of using public, corporate mailing lists to automatically approximate corporate social relationships. We found that co-occurrence in mailing lists provided a good predictor of who works with whom. We then developed Point to Point to allow users to explore networks through an interactive map. We found in a user study that organizational distance, social status, and informal social connections had a meaningful impact on whom users would chose to meet for sharing knowledge.", "num_citations": "19\n", "authors": ["1197"]}
{"title": "Leveraging social software for social networking and community development at events\n", "abstract": " Professional networking is a primary goal of people attending conferences and events. Over the past year we have developed an online social networking and community tool for events, Pathable, to help attendees meet the right people. Pathable provides an online directory of attendee profiles, communication tools, and a recommendation system optimized to help people find each other based on commonalities. We performed a questionnaire study at a pathable-enabled event to assess the importance of social networking, and found that quality of conversations and sense of community were strong predictors of who said they would return year after year. In addition, the more people used Pathable to meet others at the event, the greater their event attachment and sense of community. Based on lessons learned from an overview of seventeen Pathable-enabled events, we provide guidelines for leveraging social …", "num_citations": "18\n", "authors": ["1197"]}
{"title": "Swarm: Text messaging designed to enhance social coordination\n", "abstract": " Martin Cooper’s invention, the cell phone, has gone from a large, expensive gadget of the business elite to a small, stylish device that people from all walks of life can afford. Cell phones, also known as mobile phones, allow people to communicate with others while being just that, mobile. This newfound ease of mobile communication is creating new opportunities for meaningful social interaction, such as keeping in touch with and coordinating activities with friends and family.Cell phones have become an integral part of the feeling of connectedness that people share with one another. However, cell phones also have negative social implications because just as they allow people to reach out to the world, the world can reach back at any time, posing problems of interruptability, split-attention, and politeness in public settings (Pale, 2002). While voice communication is very natural and expressive, it also requires …", "num_citations": "18\n", "authors": ["1197"]}
{"title": "From implicit self-esteem to in-group favoritism\n", "abstract": " People tend to favor in-groups over out-groups, no matter how minimally the in-group is defined. Psychologists argue that such in-group favoritism is caused by either low or high self-esteem. Proponents of Social Identity Theory (Abrams & Hogg, 1988) argue that people with low self-esteem should have more in-group favoritism than people with high self-esteem, because people with low self-esteem have the greatest need to feel better about themselves. In contrast, according to Balance Theory (Heider, 1958), people with high self-esteem should have more in-group favoritism, because people maintain consistent attitudes toward the self and toward their in-groups. Psychologists have yet to find an empirical resolution of these contradictory predictions, perhaps because of their reliance on self-report measures of self-esteem. Self-report measures have limited validity because they are biased by self-presentational …", "num_citations": "18\n", "authors": ["1197"]}
{"title": "Sharing personal information in online community member profiles\n", "abstract": " We describe the results of a study that examined the amount of personal information people will share in an online community member profile. The type of online community and participants’ expectancies about the probability that they might meet online community members in person were manipulated. The results indicate that individuals will provide more personal information when completing profiles for online communities that facilitate deeper and more meaningful interpersonal relationships. Participants also expressed a strong preference for using pre-defined response choices, rather than providing their own free-text responses, and they want control over how their personal information is collected and used.", "num_citations": "14\n", "authors": ["1197"]}
{"title": "Designing for Inclusion: Supporting Gender Diversity in Independent Innovation Teams\n", "abstract": " We study how independent innovation teams develop an environment of inclusion to support gender diversity. Through a mixed-methods study involving surveys and interviews with people involved in independent innovation, we sought to better understand the mechanisms by which their teams fostered a sense of inclusion to support gender diversity via interpersonal practices and communication and collaboration technology usage. By understanding how inclusion supports gender diversity, we discuss design implications to help more diverse independent innovation teams form and function.", "num_citations": "13\n", "authors": ["1197"]}
{"title": "So. cl: An interest network for informal learning\n", "abstract": " Web search engines emerged prior to the dominance of social media. What if we imagined search as integrating with social media from the ground up? So. cl is a web application that combines web browsing, search, and social networking for the purposes of sharing and learning around topics of interest. In this paper, we present the results of a deployment study examining existing learning practices around search and social networking for students, and how these practices shifted when participants adopted So. cl. We found prior to using So. cl that students already heavily employed search tools and social media for learning. With the use of So. cl, we found that users engaged in lightweight, fun social sharing and learning for informal, personal topics, but not for more heavyweight collaboration around school or work. The public nature of So. cl encouraged users to post search results as much for self-expression as for searching, enabling serendipitous discovery around interests.", "num_citations": "13\n", "authors": ["1197"]}
{"title": "Sounds good to me: Effects of photo and voice profiles on gaming partner choice\n", "abstract": " In an empirical study we investigated how matchmaking for online gaming platforms could benefit from additional implicit information conveyed in profiles that include photos or voice recordings. We used 150 real online gamer profiles (50 text-only, 50 text & photo, 50 text & voice) to elicit gaming partner preferences from 267 online gamers. We found profiles with photos to lead to lower overall preference, indicating that people used them to reject potential partners. Voice recordings did not reduce overall preference but gave participants relevant information for gaming partner choice. We close with recommendations for the design of profile-based matchmaking systems.", "num_citations": "13\n", "authors": ["1197"]}
{"title": "Opportunities via extended networks for teens' informal learning\n", "abstract": " With the increasing use of the Internet and social media for knowledge and social connections, we might expect that people more easily expand their opportunities for new learning through social relationships online. Yet, this mixed methods study of teens' use of technologies (eg YouTube and social media) in informal learning contexts reveals that, in teens' preferred learning activities, few interact with new ties outside their immediate networks (school, family, and friends). Given the value of social interaction and weak ties for learning new knowledge, this research investigates teens' use of networked technologies with people and resources outside their immediate networks. Based on 23 semi-structured interviews, we describe teens' informal learning activities and technology practices, from which we identify design opportunities. To inform these, we examine teens' paths into extended networks, including the role …", "num_citations": "12\n", "authors": ["1197"]}
{"title": "Inner circle: people centered email client\n", "abstract": " We present an automatic people-centered organization of the email message store, where all the information is organized by the association with the message sender or recipients. By using a zoomable list control, we can show most frequent contacts on the top level, and still scale to a large number of contacts overall. Messages exchanged with a person or any ad-hoc defined group are displayed as a continuous conversation. Individual nuggets sent in email, such as attachments and links, are extracted from messages and put into their own window. Organizing nuggets into people-oriented shared spaces supports email-based collaboration. The proposed email client enhancements tested very well in a preliminary user study.", "num_citations": "11\n", "authors": ["1197"]}
{"title": "Two methods for auto-organizing personal web history\n", "abstract": " Two methods for automatically organizing personal web history were developed and evaluated, and compared to the Internet Explorer history. One method grouped visited web pages based on similarity of root URL and time co-occurrence. The second method started with the similarity ratings and further associated or dissociated web pages using an associative learning rule. In a preliminary experiment, participants reported that both methods organized their web history significantly more like their own mental organization of their web history than did IE history. Participants were also faster to revisit web pages using both organizations than when using IE history.", "num_citations": "11\n", "authors": ["1197"]}
{"title": "Modeling youth civic engagement in a new world of networked publics\n", "abstract": " In an increasingly networked public, the Internet and social media provide rich opportunities for reconnecting youth with their civic life. In a questionnaire study of 578 14-20 year old youth, we explore the relationship between Internet technology experiences, civic efficacy, community identification, and civic engagement in their everyday lives. Contrary to prevailing stereotypes of digital youth, we found that most rely on email and text messaging to communicate with others in their local communities about civic issues. Further, those more experienced with technologies in the public sphere (such as blogs, wikis, and Twitter) had higher levels of civic engagement. Teens who strongly identified with their local community and who had higher levels of civic efficacy were especially likely to be civically engaged. These results highlight the importance of encouraging youth to emotionally connect to their local communities, and to do so online in the public sphere rather than through more personal communication channels.", "num_citations": "10\n", "authors": ["1197"]}
{"title": "PhotoStory: Preserving emotion in digital photo sharing\n", "abstract": " We investigate why it is that sharing digital photographs on the Internet is not as compelling as sharing photographs in a face-to-face environment. We discuss prototypes from both the author and viewer’s perspective, and report user test findings. We then discuss the growing importance of emotion in the computing experience.", "num_citations": "9\n", "authors": ["1197"]}
{"title": "Lessons learned: Social interaction in virtual environments\n", "abstract": " With the goal of studying online community, we created two multi-user virtual environment products [1], Microsoft V-Chat [2] in 1996, and the Virtual Worlds Platform [3] in 1998. We analyzed the social interaction that developed in these virtual environments and were particularly interested in better understanding what factors contribute to sustaining online community. Drawing from the design and evolution of physical cities [4] we believed an online community must be able to change over time and evolve the space within a flexible infrastructure. Over the past six years we have learned a number of lessons about the design of community and the effects of design.", "num_citations": "8\n", "authors": ["1197"]}
{"title": "Neighborhood community well-being and social media\n", "abstract": " In the following study we adopt a multi-method approach to examine whether the growing use of social media as a channel for hyper-local conversation may provide meaningful insights into the well-being of neighborhood communities. First, through interviews and a questionnaire with 174 residents of 26 neighborhoods we explore what are indicators of neighborhood level well-being, and what are current communication practices around the use of social media to support community well-being. Second, through an analysis of neighborhood-level Twitter messages we examine the extent to which mood and social interactivity in Twitter correspond with our neighborhood well-being indicators. Overall, we found self-reported usage of social media positively correlated with community well-being. However, while smaller neighborhood communities had higher community well-being, they were lower in usage of social media for interacting with neighbors. Only in larger, more urban centers characterized by younger professionals, did Twitter message mood and social interactivity correlate with well-being.", "num_citations": "7\n", "authors": ["1197"]}
{"title": "WeDo: end-to-end computer supported collective action\n", "abstract": " Many celebrate the Internet’s ability to connect individuals and facilitate collective action toward a common goal. While numerous systems have been designed to support particular aspects of collective action, few systems support participatory, end-to-end collective action in which a crowd or community identifies opportunities, formulates goals, brainstorms ideas and develops plans, mobilizes, and takes action. To explore the possibilities and barriers in supporting such interactions, we introduce WeDo, a system aimed at promoting simple forms of participatory, end-to-end collective action. Pilot deployments of WeDo illustrate that sociotechnical systems can support automated transitions through different phases of end-to-end collective action, but that challenges, such as the elicitation of leadership and the accommodation of existing group norms, remain.", "num_citations": "7\n", "authors": ["1197"]}
{"title": "Sharing media objects in a network\n", "abstract": " A method, computer readable medium, user component, and system for sharing media object in a network environment are disclosed. A network manager may determine a similarity metric between users of the environment, between media objects, and/or between a user and media objects. Based upon the similarity metric, the network manager may share media objects with another user if the similarity metric exceeds a pre-determined value or is more similar than other retrieved media objects. A user component may also provide a network map manager to display a network map, and may provide a tailored view manager to display a web log associated with at least one of the user icons displayed in the network map.", "num_citations": "7\n", "authors": ["1197"]}
{"title": "Meta-analytic use of balanced identity theory to validate the Implicit Association Test\n", "abstract": " This meta-analysis evaluated theoretical predictions from balanced identity theory (BIT) and evaluated the validity of zero points of Implicit Association Test (IAT) and self-report measures used to test these predictions. Twenty-one researchers contributed individual subject data from 36 experiments (total N = 12,773) that used both explicit and implicit measures of the social–cognitive constructs. The meta-analysis confirmed predictions of BIT’s balance–congruity principle and simultaneously validated interpretation of the IAT’s zero point as indicating absence of preference between two attitude objects. Statistical power afforded by the sample size enabled the first confirmations of balance–congruity predictions with self-report measures. Beyond these empirical results, the meta-analysis introduced a within-study statistical test of the balance–congruity principle, finding that it had greater efficiency than the previous …", "num_citations": "5\n", "authors": ["1197"]}
{"title": "Obtaining hyperlocal content from social media\n", "abstract": " Hyperlocal information may be marshaled from social network postings, and may be analyzed to create content about a hyperlocality. In one example, tweets on the Twitter service are examined to determine the hyperlocality with which the tweets are associated. The tweets are then analyzed to identify trending terms, and events are identified based on the trending terms. Additionally, patterns of posting and re-posting are analyzed to identify prominent members in the hyperlocality. A user interface, such as a web page, may be created for the hyperlocality, where the user interface may identify events, topics, people, places, and postings associated with the hyperlocality.", "num_citations": "5\n", "authors": ["1197"]}
{"title": "&J. Riegelsberger.\" Social Engineers: Enabling the Matchmaking Game in Online Dating Systems.\" Position paper\n", "abstract": " In creating online dating systems, researchers and practitioners must focus on how to best design a system to increase the likelihood of two people finding each other and having successful dating experiences. At the core of online dating is the profile, through which people convey information about the self, and through which others filter for those with whom they want to initiate a social interaction. We found in two studies that the presence of photos in profiles had a negative impact on the overall ratings of attractiveness of the person profiled. However, photos provide important information through which people will make successful matches, so users should be encouraged to provide photos in their profiles.", "num_citations": "3\n", "authors": ["1197"]}
{"title": "Docs. com: Social file sharing in Facebook\n", "abstract": " Social networking sites provide a unique opportunity for users to engage in broadcast online file sharing and collaboration. In this study we examine the usage of Docs. com, which integrates Microsoft Office web documents with Facebook. In reviewing the content of Docs. com documents, we found they were equally created and shared for work, personal productivity, and play. Users actively employed relationship levels in their Facebook networks to define access to their documents. However, we also found the most viewed documents were those shared to the entire public, with Facebook notifications driving most of the traffic to these public documents. Finally, through a factor analysis of user activity four primary types of usage emerged–sharing, creating, collaborating, and consuming. Those who created and collaborated around documents had higher levels of engagement than those who just shared or consumed documents, interacting with more documents and returning on more unique days.", "num_citations": "2\n", "authors": ["1197"]}
{"title": "Redesigning the Contact List\n", "abstract": " We argue that standard contact lists do not accurately represent the nature of people. s social networks. In the present paper we discuss the linear structure in existing contact representations, the historical basis for that structure, and some of the problems created by that structure. We explored more intuitive visualizations of social contacts by conducting a study in which users drew their social networks on paper. We then applied the results of that user study to rapidly prototype several new representations of contacts. A usability test of the prototype showed that a more intuitive representation of contacts facilitated the completion of contact list tasks.", "num_citations": "2\n", "authors": ["1197"]}
{"title": "Fostering A Community of Innovation at the Intersection of Art and Technology in the Pacific Northwest\n", "abstract": " The Pacific Northwest is a top region for innovators at the intersection of art and technology. This density of technology creatives–artists, programmers, technologists, designers, entrepreneurs–combined with the Pacific Northwest’s uniquely community-oriented zeitgeist has had a meaningful impact on the local arts community, creating fertile ground for genres of interdisciplinary, technology-mediated art. In order to help foster this growing community of artists/technologists in pushing the bounds of what is possible in their work, we organized a workshop bringing together key stakeholders in the region. The workshop was structured as a focus group including a brief questionnaire to generate feedback for how to best support this community. The unique concerns and collective agenda of this interdisciplinary group are discussed as they would apply to broader contexts.", "num_citations": "1\n", "authors": ["1197"]}
{"title": "WeDo: Exploring Participatory, End-To-End Collective Action\n", "abstract": " Many celebrate the Internet's ability to connect individuals and facilitate collective action toward a common goal. While numerous systems have been designed to support particular aspects of collective action, few systems support participatory, end-to-end collective action in which a crowd or community identifies opportunities, formulates goals, brainstorms ideas, develops plans, mobilizes, and takes action. To explore the possibilities and barriers in supporting such interactions, we have developed WeDo, a system aimed at promoting simple forms of participatory, end-to-end collective action. Pilot deployments of WeDo illustrate that sociotechnical systems can support automated transitions through different phases of end-to-end collective action, but that challenges, such as the elicitation of leadership and the accommodation of existing group norms, remain.", "num_citations": "1\n", "authors": ["1197"]}
{"title": "Dotastic: achieving goals by socializing tasks\n", "abstract": " Dotastic is a mobile application that lets people challenge each other to get tasks done. Dotastic leverages social pressure to help people accomplish tasks that they would otherwise not be motivated to do. We propose using Dotastic as an integrated demo that adds an element of fun to real-time events, increasing interactions among the event attendees, and helping organizers use the persuasive technology to obtain desired outcomes.", "num_citations": "1\n", "authors": ["1197"]}
{"title": "Research in Social Computing: Approaches and New Directions\n", "abstract": " People have begun to accept technology as a matter of course in the day-to-day areas of their lives. As a result, the development and proliferation of social software has enjoyed exponential growth in the past several years. In this paper we argue that as researchers and practitioners who create social technologies, we must take a “social engineering” approach, actively designing social applications to help users achieve their social goals. We then review current trends in innovation in social technologies, and discuss some of the hard problems that need to be addressed by the field in the next several years. We expect that as social technologies continue to innovate in areas such as social networks, social navigation, lightweight authoring, and mobile and ubiquitous computing, we must increasingly envision an integrated social computing experience: that is, a social computing platform.", "num_citations": "1\n", "authors": ["1197"]}
{"title": "t. Scripting Business Social Interactions\n", "abstract": " Business social activity is often either formally or informally scripted, providing structure and streamlining. As social activity increasingly moves on-line, opportunities will arise for on-line scripting of those activities. We have developed an application, Lead Line, which allows authors to create scaleable, task-specific scripts for social interactions conducted via text chat. Lead Line is implemented as a distributed, Java-based client. We have created a range of structured social interactions, both business-and entertainment-oriented, plus a controlled study of structured versus unstructured, goal-directed interactions. As expected, structuring has a significant effect on results, whether the goal is productivity or entertainment. Less obvious is the persistent effect on subsequent interactions.", "num_citations": "1\n", "authors": ["1197"]}