{"title": "Continuous Integration and Automation\n", "abstract": " Current IT strategies depend largely on the ability of companies to push changes/features/fixes in an agile and error-free manner. The need for automation increases dramatically as technology advances. Waterfall software development techniques have been replaced by agile software development approaches in the last decades. In this shift, companies, operations, and software developers are unquestionably relatively close to the shared goals. To promote this merger, the industry offers a large range of open source and proprietary solutions. Technologies have increased themselves and thus new techniques have been developed, namely continuous integration (CI), continuous delivery (CDE) and permanent deployment (CD), assisted by all of the above mentioned open source and proprietary solution. Automation is the primary requirement for DevOps, and DevOps's main concept is\" Automate everything.\" DevOps automation commences from the coding on the developer machine until the code is run and then the application and system are controlled in production. The whole DevOps pipeline includes continuous integration, ongoing testing, and continuous deployment, including live application monitoring. The main focus of DevOps practice is the design and configuration of automated infrastructure and software delivery. DevOps practice depends heavily on automation, to implement for a few hours, and to execute frequently across different platforms. Automation in DevOps, therefore, promotes speed, greater precision, consistent, and reliable delivery rates. In the end, DevOps automation captures everything from design, delivery, and …", "num_citations": "79\n", "authors": ["1967"]}
{"title": "Security automation in Information technology\n", "abstract": " Security automation has been a major issue for many companies in the fight against rising cyber threats enabled by new cloud network attacks and proliferating the Internet of Things. A recent survey by the threat detection and hunting company Fidelis Cybersecurity has revealed this trend among 300 CISOs, CIOs, CTOs, architects, engineers, and analysts studied in a range of industries. More than half of the professionals analyzed (57 percent) said that their companies are concerned with a lack of automation. Cybersecurity automation is one of the developments in information technology. Automating humandriven, and repeatable processes will focus on the more productive problem-solving tasks within organizations and individuals. Focusing on these issues will foster innovation and contribute to a more robust organization from a cyber-security point of view. Automation also adds to the complexity of information systems in an organization and as malicious targets grow, cybersecurity initiatives must be prepared to implement automated cybersecurity solutions. As long as the information is available, the confidentiality, integrity, and availability of the cybersecurity programs must be safeguarded. In most industrial industries, automation is the main force of transition. By 2030, the automation industry is expected to completely replace over 800 million workers and technology transforms our way of working and organizing and communicating with others. The almost constant occurrence of data breaches suggests that it does not stop so that organizations are unable to have long-term reservations regarding security automation concepts and …", "num_citations": "68\n", "authors": ["1967"]}
{"title": "DevOps Automation and Agile Methodology\n", "abstract": " In recent times, interest in the collaboration between technology and IT activities which is part of the DevOps phenomenon has been on the rise among, software-engineering, practitioners, and scientists. However, DevOps is also associated with agile as well as continuous software development delivery approaches, given its increasing importance. The study of DevOps follows which are the roots, acceptance, integration, and priorities with agile, lean, and ongoing delivery strategies in software development. DevOps phenomenon was influenced by the development of agile software, based on lean principles. Successful DevOps deployment needs the agile development of software. DevOps is end-to-end automation in developing and delivering software. No one could approach it with a cook book like approach, but most developers would benefit from improving connectivity between previously isolated creation and activity silos. Even though agile software development methodologies are more and more common, many organizations have discovered that they have not reached a frequent release rate, largely because of the various departmental features in silos. Organizations have shifted towards DevOps to remove these silos. Companies are increasingly introducing DevOps as digitization continue. There are three different phases of the agile transition to DevOps: agile, ongoing integration, and constant delivery. Based on a comprehensive case study done in an enterprise with a long background of DevOps, we detect a fundamental disturbance in the soft ability and patterns of communication that software teams are supposed to possess.", "num_citations": "61\n", "authors": ["1967"]}
{"title": "An Exploratory Study of Devops and It's Future in the United States\n", "abstract": " This document will explore Deposits building blocks, and its future in the US Every organization is a software company nowadays, and large companies are keen to take over huge segments of the economy. This is a coordinated approach that would not only eradicate the endless series of concurrent activities but also maintain an effective implementation process in the life cycle of software development (SDLC). Currently, a very organized approach is called DevOps and is characterized by fewer errors, more efficiency, and remarkable coordination. With so much written about DevOps, it's easy to forget that it's still in its early stages of maturity. But it is expected to grow well beyond its current status over the next few years. Technologists have made great strides to benefit from it ever since the DevOps ideation. Notwithstanding advancements and the progress teams have seen in pockets, many of the core problems still prevail: scaling across the organization due to manual processes, inadequate coordination across dev and ops teams, and overlapping tools that hinder agility. Fortunately, there are hopes in the future especially for organizations hoping to get the most out of DevOps. Software engineers now can continue to increase their knowledge to be ready for the next DevOps stage, through growth, delivery, and quality assurance. At the same time, all team leaders need to be prepared to handle some major challenges. Over the years, DevOps has begun to evolve and gain recognition. This trend has picked up the exponential pace with the advent of mobile phones. Today, the DevOps cycle continues to thrive on the principles of enhanced …", "num_citations": "60\n", "authors": ["1967"]}
{"title": "Improve Software Quality through practicing DevOps Automation\n", "abstract": " Computer Developers over the past years have implemented new generation programming languages. DevOps is complemented by a range of agile practices designed to improve cooperation between development and operating teams. The main aim of this paper is to investigate how the use of DevOps has affected the quality of software. Another main aim is to explore and identify ways to continuously increase software quality. One way of finding information on this study is to conduct a literature review. The data will provide more information on the current DevOps activities that have been carried out in the software industry. The empirical analysis model has been developed and five theories have been established based on a literature survey. Testing theories using Pearson correlation has achieved research goals. On the basis of the linear regression model where the linear theory is obtained. A literature review was developed to gather quantitative data while DevOps and Quality Assurance experts' interviews were used to determine how DevOps can enhance software quality. Interview reviews, hypothesis testing, and regression tests are recommendations. The quantitative study found that by using CAMS (Culture, Automatic, Measurement, Sharing) systems, software quality is enhanced by practicing DevOps. The biggest factor in increasing software quality is automation. According to the findings of multiple regression analyses, culture has been shown to boost software quality through integration, evaluation, and sharing. In summary, it is best to use DevOps to generate applications of high quality.", "num_citations": "44\n", "authors": ["1967"]}
{"title": "Streamlining DevOps Automation For Cloud Applications\n", "abstract": " There are closer links between DevOps and cloud computing. DevOps aims to optimize progress for user specifications to be swiftly incorporated in application output, while the cloud enables automated supply and scaling to manage application changes. IT experts in cloud computing sometimes make errors that they could easily prevent. The question is that best practices are still undefined. These fields are very fresh, but the problem can be more about people than technology, and the challenge is often more difficult for people to overcome. DevOps transforms the face of IT processes and continuously hear new tools and features unveiled by different companies to boost the DevOps pipeline. Electric Cloud is a well-known leader in automation and ongoing delivery of DevOps and recently released a new ElectricFlow version which gives programmers a new data-driven way to onboard apps. The consumerization of IT improves job satisfaction and managing efficiency by encouraging workers to bring their own\" goods into the workplace. This streamlines the way activities are conducted and offers flexibility in updates and launches in the tool-chain.\" Today, ElectricFlow is allowing CD's' consumerization'to introduce organizations and workers to secure and well controlled DevOps tool-chain, introducing procedures, trends, methods, resources, and other techniques. DevOps and cloud computing do not exclude each other, but from a lay person's viewpoint, the relationship between them is often unclear and confusing. Although the technologies and infrastructure of cloud computing are concerned, DevOps is more concerned with processes and …", "num_citations": "43\n", "authors": ["1967"]}
{"title": "Novel Economical Social Distancing Smart Device for COVID-19\n", "abstract": " Spiritual intelligence is the science of human energy management that clarifies and in the era of COVID-19 in which everywhere there is a panic like situation and according to the World Health Organization Social Distancing will be proven to be the only solution. In this research paper, an innovative localization method was proposing to track humans' position in an outdoor environment based on sensors is proposed. With the help of artificial intelligence, this novel smart device is handy for maintaining a social distancing as well as detecting COVID-19 symptom patients and thereby safety. In these COVID-19 environments, where everyone is conscious about their safety, we came up with the idea of this novel device. Most of the time, people on the roadside watched their front but were not able to look after what is going on behind them. The device will give alert to the person if someone in the critical range of six feet around him. The method is reasonably accurate and can be very useful in maintaining social distancing. The sensor model used is described, and the expected errors in distance estimates are analyzed and modeled. Finally, the experimental results are presented.", "num_citations": "41\n", "authors": ["1967"]}
{"title": "Automation Testing in Information Technology\n", "abstract": " Despite the proliferation of quality assurance tools and experts, IT software testing has been critical in the development and security of software systems in the internet space. The complexities and challenges of testing have pushed experts to the technology of test automation, which comes in several phases and with ultimate calls for heightened levels of management and control. In this paper, a clear demonstration of the automation approaches and the development approaches is eminent. The results of the research clearly show that automating software testing realms is the new strategy that is poised to change the usability, security, efficiency, and reliability of the current and future software programs.", "num_citations": "26\n", "authors": ["1967"]}
{"title": "Artificial Intelligence in Information Technology\n", "abstract": " Artificial Intelligence is a broad field that encompasses various concepts in Information Technology. This research paper focuses on different technologies in AI and how they apply to improve the performance of multiple sectors. The purpose of this study is to discuss Artificial Intelligence and its present and future applications. AI is the foundation of multiple concepts, such as computing, software creation, and data transmission. The technologies that use AI are machine learning, deep learning, Natural Language Generation, speech recognition, robotics, and biometric identification. AI applies to many sectors such as healthcare sectors, assembling and manufacturing industries, business organizations, and in the automotive industries. AI also has various advantages that make it gain more popularity in many areas. The AI-powered machine can perform many jobs at once; they are not costly compared to human beings and are accurate and efficient. AI also encounters multiple problems that undermine its application. AI is prone to technical difficulties, security snags, data difficulties, and can cause accidents if users fail to understand the AI system. The increased use of AI has transformed various sectors by boosting the organization's performance and facilitating data safety.", "num_citations": "14\n", "authors": ["1967"]}
{"title": "Security and Privacy Concerns of the'Internet of Things'(IoT) in IT and its Help in the Various Sectors across the World\n", "abstract": " The so called internet of things (IoT) is a form of technology advancement that has a capacity for driving change in our daily lives in a variety of sectors. The fantastic opportunity will help in the collection of data that is relatively exponential and in a manner that is continuous to present changes that are significant on the lives. Devices growth and the speed in which they are developed to attain the IoT era of technology offers the challenges of security and the battling of freedom as people establish policies and governance that rebuilds the developments without interfering with the innovations. Among the issues, includes the concerns on the security and privacy brought by the technology. The vulnerabilities of security that are experienced by the IoT devices are as a result of the contributing factors like the low capabilities of the devices in terms of energy and the capabilities of computing, the wireless channels are seemingly unreliable, and the vulnerabilities on the physical nature of the devices. This paper will focus on the IoT evolution, the definitions attached to IoT, and some of the many applications of IoT. It will create an emphasis on the considerations of security and privacy, including the challenges that are tied to the general IoT and the IoT application context. A critical assessment of the works done for IoT is presented by the literature review on the perspective of the developmental era and the evaluation of the trend. The paper will also give the IoT security risks taxonomy, mechanisms, and attacks related to the technology.", "num_citations": "10\n", "authors": ["1967"]}
{"title": "Risk Management in Information Technology (June 9, 2020)\n", "abstract": " Risk management in information technology is the research problem in my essay. Research has shown that business risks related to information technology risk management can be considered and adopted within an organization or enterprise. The study has been demonstrated that some organizations have a well-laid enterprise risk management set out. In this case, therefore, risk management is seen as part of enterprise risk management. The study will also further expound on the risk management methodology, which constitutes a generic framework. The framework must, therefore, be considered as a risk management exercise. Based on a review of literature, the risk management procedure has taken into account risk assessment that ENISA has over time, reviewed the process to parameterize the entire risk management process. Risk identification states that there can be potential losses when threats, assets vulnerabilities, consequences, and related business processes are not considered. Therefore risk management in information technology must revolve around integrating risk management through the system development life cycle. The process cannot be termed as complete if risk management methods are not considered. In 2006, the threat sketch started a cybersecurity risk assessment that targeted small companies. In this study, the methodology uses real options, to prioritize and forecast a list of fixed high-level threats.", "num_citations": "5\n", "authors": ["1967"]}
{"title": "Facial Recognition Technology\n", "abstract": " Facial Recognition Technology (FRT) emerged as a solution to address several contemporary needs of identifying and verifying an individual's identity. It fulfills the biometric system requirements, which tries to recognize the status of an individual by using features distinctive from the body and functionalities that are more familiar with the operation of visual surveillance. This report develops an analysis that connects the socio-scientific literature with the technology on FTR and addresses the concerns and challenges attached to the development, evolutional, and the operational usage that are specific, the contexts, and goals. It highlights the problematic, potentials, and the limitations of the technology. The report also identifies the tasks that the FRT seems to be ready to deploy, the areas with specified obstacles, and how to overcome them by the developments of future technology and operating procedures of sound. It also addresses specific issues that appear to interact with technology. It is also concerned with the ethical considerations on the extent of efficacy. The report's findings are further broken down into different categories to understand further the evaluation, performance, operation, policy concerns, and political and moral operations. So far, the technology has been implemented in several fields to enable monitoring and surveillance. In this background, the report also addresses the FRT alterations on the nature of the authoritarian and lines that are oppressive in the United States as the primary focus.", "num_citations": "2\n", "authors": ["1967"]}
{"title": "System and method of maintaining social distancing guidelines with nearby persons\n", "abstract": " A system and method of maintaining social distancing guidelines with nearby persons allows a user to receive a notification when other people enter within a perimeter around them. A wearable device, especially a belt, equipped with infrared (IR) sensors detects heat signatures of nearby objects. The wearable device subsequently relays this information to the user's mobile electronic device, immediately notifying the user of persons within the predefined radius. The wearable device further differentiates between different distinctly human heat signatures, using artificial intelligence to determine whether a nearby person has the elevated internal temperature that could be attributed to COVID-19, or if the person within the preset radius is asymptomatic. In this way, users may be alerted to dangers approaching from all sides. Users are participants in the global effort to reduce human exposure and help in reducing the …", "num_citations": "0\n", "authors": ["1967"]}
{"title": "An Exploratory Research Analysis on Brain Machine/Computer Interface\n", "abstract": " BCI and its potential to enhance human cognitive abilities are investigated in this article. The findings indicate that BCI is one among multiple paths to super intelligence. BCI’s have potential to help humans with various neuro and mental functional disorders when utilized as neuroprosthetic. BCIBCI’s provide humans with communication channels that do not depend on peripheral nerves and muscles [BCI converts intention driven neural activity into a control signal that performs useful tasks. BCI paves path for Brain Driven Robot Controls based on brain activity. Brain actuated/assisted robot control brings benefits especially in difficult scenarios where robots cannot perform all functions successfully without human assistance, For eg., Dangerous missions with possible sensors and algorithms failure. Computer translation algorithms are used in modeling experiments to translate Brain activity signal to Device Command and controls to perform an activity, Transfer functions part of translation algorithms ar e classified into linear and non linear. Linear Transfer functions are Linear Equations whereas Non Linear Transfer functions are neural Networks. The idea of BCI may seem absurd at first glance, but it is based on decades of experimental study and is supported by scholars, scientists, and entrepreneurs such as Stephen Hawking and Elon Musk.", "num_citations": "0\n", "authors": ["1967"]}
{"title": "Exploratory Research on Simulation Hypothesis and the Research Method Analysis\n", "abstract": " The principle of simulation hypothesis and test process interpretation is investigated in this article. The findings indicate that the simulation hypothesis is the belief that everything is a digital simulation. This scientific theory is the systematic technique that must be followed for any appropriate scientific endeavors. The relationship between philosophy in the context of the hypothesis and quantitative experimental research is continually established with this approach. The scientific method has evolved to include a modern phase that includes the use of computer simulations and simulation experiments. Computer models may be used in modeling experiments to assess theories until they are tested experimentally as they are integrated into hypothesis formulation. An iterative input between these experiments and existing theories makes it possible to improve the hypothesis preliminarily and create smarter research protocols. Technological advancements would eventually lead to the creation of automated human superintelligence, which will in turn lead to the creation of simulations that can help us truly comprehend the world. This lends credence to the notion that superintelligence currently exists and has produced simulations that humans already occupy. The idea that life is pure simulation may seem absurd at first glance, but it is based on decades of experimental study and is supported by scholars, scientists, and entrepreneurs such as Stephen Hawking and Elon Musk.", "num_citations": "0\n", "authors": ["1967"]}
{"title": "Machine Learning Techniques for Sequence-Based Prediction of Viral-Host Interactions\n", "abstract": " In predicting the PPIs between the virus and human proteins, different machine learning models have been developed that are further verified using biological trials. Their classification techniques are consistent with the predictions of various sequence-based human protein properties, such as the structure of amino acids, the structure of pseudo amino acids, and correlational triads. This paper will focus on the SARS-CoV-2 virus, hepatitis E virus-human, and hepatitis B virus-human PPIs to illustrate how machine learning techniques are used to predict a sequence-based viral to host interaction. This research can promote the detection of possible targets for the more efficient production of antiviral drugs, which have now affected the entire world. The basic well-known automated machine learning methods are widely implemented to predict PPIs, such as Random Forest, Naïve Bayes, and SVM, are used to determine the output measure focused on five-fold methods of crossvalidations. In the last phase of viral infections in the host, protein-protein interactions (PPIs) play an important role. Human cells, however, are made up of a vast number of proteins. Consequently, it is just not possible to verify all different combinations of interactions through laboratory experiments. It contributes to the emergence of different computational techniques to predict and further verify PPIs in between virus and human proteins through biological experimentation. For drug usage, an understanding of how the PPIs virus proteins associate with cells of the host for reproduction and survival is important. One way that the virus associates with its host is Protein-Protein …", "num_citations": "0\n", "authors": ["1967"]}
{"title": "AI automation and application in diverse sectors\n", "abstract": " Artificial intelligence, commonly referred to as AI, has, in recent years, transformed the nature of human life in almost every aspect that is connected to human life. The aspects include economic status, job creation, and employment, communication, war, security, privacy, and healthcare. The long term evolution of AI is yet to be seen if it will lead humanity in making the world a better place for living in or a disastrous place. For every technology to survive in the market, the advantages must outdo the disadvantages since every technology has its advantages and disadvantages. In artificial intelligence, since we have not yet reached the long term evolution, we are, however, to see if it will have an impact on the positive effects than the adverse effects. In the world today, we are surrounded by technology in every aspect of life, and we seem to embrace them starting from the aspect of healthcare, industries, smart homes, and even cars that are autonomous. On the negative side, the technology seems to take away jobs from many individuals who are tot intellect on matters technology hence creating the context of unemployment. As technology is advancing quickly, robots and autonomous systems are developed and born daily, therefore replacing the labor provided by humans. However, this being the current situation generated by technology, the exciting parts are brought by the system’s long term results which tend to be very fulfilling to the human life. Throughout this essay, I will address the Artificial Intelligence starting from its development to the current situation, including its significance in human life in both the positive aspects and negative aspects …", "num_citations": "0\n", "authors": ["1967"]}