{"title": "On the use of domain terms in source code\n", "abstract": " Information about the problem domain of the software and the solution it implements is often embedded by developers in comments and identifiers. When using software developed by others or when are new to a project, programmers know little about how domain information is reflected in the source code. Programmers often learn about the domain from external sources such as books, articles, etc. Hence, it is important to use in comments and identifiers terms that are commonly known in the domain literature, as it is likely that programmers will use such terms when searching the source code. The paper presents a case study that investigated how domain terms are used in comments and identifiers. The study focused on three research questions: (1) to what degree are domain terms found in the source code of software from a particular problem domain?; (2) which is the preponderant source of domain terms …", "num_citations": "100\n", "authors": ["2284"]}
{"title": "Automatic tag recommendation for software development video tutorials\n", "abstract": " Software development video tutorials are emerging as a new resource for developers to support their information needs. However, when trying to find the right video to watch for a task at hand, developers have little information at their disposal to quickly decide if they found the right video or not. This can lead to missing the best tutorials or wasting time watching irrelevant ones. Other external sources of information for developers, such as StackOverflow, have benefited from the existence of informative tags, which help developers to quickly gauge the relevance of posts and find related ones. We argue that the same is valid also for videos and propose the first set of approaches to automatically generate tags describing the contents of software development video tutorials. We investigate seven tagging approaches for this purpose, some using information retrieval techniques and leveraging only the information in the …", "num_citations": "20\n", "authors": ["2284"]}
{"title": "Text retrieval-based tagging of software engineering video tutorials\n", "abstract": " Video tutorials are an emerging form of documentation in software engineering and can efficiently provide developers with useful information needed for their daily tasks. However, to get the information they need, developers have to find the right tutorial for their task at hand. Currently, there is little information available to quickly judge whether a tutorial is relevant to a topic or helpful to the task at hand, which can lead to missing the best tutorials and wasting time watching irrelevant ones. We present the first efforts towards new tagging approaches using text retrieval that describe the contents of software engineering video tutorials, making it easier and faster to understand their purpose and contents. We also present the results of a preliminary evaluation of thirteen such approaches, revealing the potential of some and limitations of others.", "num_citations": "17\n", "authors": ["2284"]}
{"title": "Accurately predicting the location of code fragments in programming video tutorials using deep learning\n", "abstract": " Background: Video programming tutorials are becoming a popular resource for developers looking for quick answers to a specific programming problem or trying to learn a programming topic in more depth. Since the most important source of information for developers in many such videos is source code, it is important to be able to accurately extract this code from the screen, such that developers can easily integrate it into their programs. Aims: Our main goal is to facilitate the accurate and noise-free extraction of code appearing in programming video tutorials. In particular, in this paper we aim to accurately predict the location of source code in video frames. This will allow for the dramatic reduction of noise when using extraction techniques such as Optical Character Recognition, which could otherwise extract a large amount of irrelevant text (eg, text found in menu items, package hierarchy, etc.). Method: We …", "num_citations": "14\n", "authors": ["2284"]}
{"title": "Automatically Detecting the Quality of the Query and its Implications in IR-based Concept Location\n", "abstract": " Concept location is an essential task during software maintenance and in particular program comprehension activities. One of the approaches to this task is based on leveraging the lexical information found in the source code by means of Information Retrieval techniques. All IR-based approaches to concept location are highly dependent on the queries written by the users. An IR approach, even though good on average, might fail when the input query is poor. Currently there is no way to tell when a query leads to poor results for IR-based concept location, unless a considerable effort is put into analyzing the results after the fact. We propose an approach based on recent advances in the field of IR research, which aims at automatically determining the difficulty a query poses to an IR-based concept location technique. We plan to evaluate several models and relate them to IR performance metrics.", "num_citations": "10\n", "authors": ["2284"]}
{"title": "Experiences building an answer bot for gitter\n", "abstract": " Software developers use modern chat platforms to communicate about the status of a project and to coordinate development and release efforts, among other things. Developers also use chat platforms to ask technical questions to other developers. While some questions are project-specific and require an experienced developer familiar with the system to answer, many questions are rather general and may have been already answered by other developers on platforms such as the Q&A site StackOverflow.", "num_citations": "8\n", "authors": ["2284"]}
{"title": "Code localization in programming screencasts\n", "abstract": " Programming screencasts are growing in popularity and are often used by developers as a learning source. The source code shown in these screencasts is often not available for download or copy-pasting. Without having the code readily available, developers have to frequently pause a video to transcribe the code. This is time-consuming and reduces the effectiveness of learning from videos. Recent approaches have applied Optical Character Recognition (OCR) techniques to automatically extract source code from programming screencasts. One of their major limitations, however, is the extraction of noise such as the text information in the menu, package hierarchy, etc. due to the imprecise approximation of the code location on the screen. This leads to incorrect, unusable code. We aim to address this limitation and propose an approach to significantly improve the accuracy of code localization in programming …", "num_citations": "7\n", "authors": ["2284"]}
{"title": "Making a difference: An overview of humanitarian free open source systems\n", "abstract": " Humanitarian Free Open Source Software (HFOSS) serves philanthropic goals that usually benefit non-profit organizations meant to improve the human condition. The altruistic goals these systems serve can offer developers additional motivation for contributing to OSS and have been seen as a way to attract more women to computing majors and to improve students' learning. We present an exploratory study of the currently existing HFOSS projects, aimed at giving an overview of their properties, including the most common application domains and the most popular programming languages used in this kind of systems. We also investigated the assumption that HFOSS systems attract more women developers and found the assumption to be incorrect.", "num_citations": "7\n", "authors": ["2284"]}
{"title": "Gittercom: A dataset of open source developer communications in gitter\n", "abstract": " Team communication is essential for the development of modern software systems. For distributed software development teams, such as those found in many open source projects, this communication usually takes place using electronic tools. Among these, modern chat platforms such as Gitter are becoming the de facto choice for many software projects due to their advanced features geared towards software development and effective team communication. Gitter channels contain numerous messages exchanged by developers regarding the state of the project, issues and features of the system, team logistics, etc. These messages can contain important information to researchers studying open source software systems, developers new to a particular project and trying to get familiar with the software, etc. Therefore, uncovering what developers are communicating about through Gitter is an essential first step …", "num_citations": "6\n", "authors": ["2284"]}
{"title": "Tracing with less data: active learning for classification-based traceability link recovery\n", "abstract": " Previous work has established both the importance and difficulty of establishing and maintaining adequate software traceability. While it has been shown to support essential maintenance and evolution tasks, recovering traceability links between related software artifacts is a time consuming and error prone task. As such, substantial research has been done to reduce this barrier to adoption by at least partially automating traceability link recovery. In particular, recent work has shown that supervised machine learning can be effectively used for automating traceability link recovery, as long as there is sufficient data (i.e., labeled traceability links) to train a classification model. Unfortunately, the amount of data required by these techniques is a serious limitation, given that most software systems rarely have traceability information to begin with. In this paper we address this limitation of previous work and propose an …", "num_citations": "6\n", "authors": ["2284"]}
{"title": "Spyse-a semantic search engine for python packages and modules\n", "abstract": " Code reuse is a common practice among software developers,whether novices or experts. Developers often rely on online resources in order to find code to reuse. For Python, the Python Package Index (PyPI) contains all packages developed for the community and is the largest catalog of reusable, opensource packages developers can consult. While a valuableresource, the state of the art PyPI search has very limitedcapabilities, making it hard for developers to find useful, highquality Python code to use for their task at hand.We introduce SPYSE (Semantic PYthon Search Engine), a Web-based search engine that overcomes the limitations of the state of the art, making it easier for developers to find useful code. The power of SPYSE lays in the combination of three different aspects meant to provide developers with relevant,and at the same time high quality code: code semantics,popularity, and code quality …", "num_citations": "6\n", "authors": ["2284"]}
{"title": "A study on the accuracy of ocr engines for source code transcription from programming screencasts\n", "abstract": " Programming screencasts can be a rich source of documentation for developers. However, despite the availability of such videos, the information available in them, and especially the source code being displayed is not easy to find, search, or reuse by programmers. Recent work has identified this challenge and proposed solutions that identify and extract source code from video tutorials in order to make it readily available to developers or other tools. A crucial component in these approaches is the Optical Character Recognition (OCR) engine used to transcribe the source code shown on screen. Previous work has simply chosen one OCR engine, without consideration for its accuracy or that of other engines on source code recognition. In this paper, we present an empirical study on the accuracy of six OCR engines for the extraction of source code from screencasts and code images. Our results show that the …", "num_citations": "4\n", "authors": ["2284"]}
{"title": "Supporting text retrieval query formulation in software engineering\n", "abstract": " The text found in software artifacts captures important information. Text Retrieval (TR) techniques have been successfully used to leverage this information. Despite their advantages, the success of TR techniques strongly depends on the textual queries given as input. When poorly chosen queries are used, developers can waste time investigating irrelevant results.", "num_citations": "4\n", "authors": ["2284"]}
{"title": "UI screens identification and extraction from mobile programming screencasts\n", "abstract": " Mobile applications demand is on the rise, leading to more programmers learning to develop or having to maintain this kind of programs. Developers often refer to online resources to find inspiration or answers to questions they have about mobile programming topics and screencasts are a popular resource. However, given the multitude of screencasts available, it can be difficult to quickly comprehend which of the many videos is relevant to one's needs.", "num_citations": "3\n", "authors": ["2284"]}
{"title": "Supporting query formulation for text retrieval applications in software engineering\n", "abstract": " Text Retrieval (TR) techniques have been successfully used to leverage the textual information found in software artifacts with the purpose of aiding developers with their daily tasks. TR techniques require a query as input and the usefulness of the results they retrieve depends greatly on this query. While some queries retrieve relevant information for the current task, others do not, therefore pointing developers in the wrong direction. Developers have a hard time realizing this before going through the search results, which, in the case of \"bad\" queries means time and effort lost looking at irrelevant information. In this scenario, developers have to reformulate the query, often without pointers on how to improve it. The work presented in this paper introduces novel approaches to address these challenges and makes two main contributions: 1) defines the first approach for predicting the success of a TR query in the context …", "num_citations": "3\n", "authors": ["2284"]}
{"title": "A comparative study and analysis of developer communications on Slack and Gitter﻿\n", "abstract": " Software developers are often using instant messaging platforms to communicate with each other and other stakeholders. Among these platforms, Gitter has emerged as a popular choice and the messages it contains can reveal important information to researchers studying open source software systems. Uncovering what developers are communicating about through Gitter is an essential first step towards successfully understanding and leveraging this information. In this paper, we first describe the largest manually labeled and curated dataset of Gitter developer messages, named GitterCom, obtained by manually analyzing and labeling 10,000 Gitter messages in 10 software projects. We then present a qualitative study to understand the extent to which the categories identified in previous work by Lin et al.  found on Slack through surveys are applicable to developer messages exchanged on Gitter. Further, in an …", "num_citations": "0\n", "authors": ["2284"]}
{"title": "UIScreens: extracting user interface screens from mobile programming video tutorials\n", "abstract": " Mobile apps are one of the most widely used types of software systems in existence today and more programmers and students learn how to develop them everyday. One of the most popular resources for learning mobile programming are videos hosted on social platforms such as YouTube. While useful, this type of resource has also its limitations, especially when developers are looking for user interface (UI) designs for mobile applications, since these are hard to search for and locate in videos. We propose UIScreens, a web-based analysis and search engine that analyzes the visual contents of mobile programming video tutorials, then identifies and extracts the UI screens displayed in the videos. Our tool offers features such as searching for UI screens in videos, displaying an overview of the UI screens identified in a video under each search result, and navigating to the part of a video where a particular UI screen …", "num_citations": "0\n", "authors": ["2284"]}
{"title": "GUI-focused overviews of mobile development videos\n", "abstract": " The need for mobile applications and mobile programming is increasing due to the continuous rise in the pervasiveness of mobile devices. Developers often refer to video programming tutorials to learn more about mobile programming topics. To find the right video to watch, developers typically skim over several videos, looking at their title, description, and video content in order to determine if they are relevant to their information needs. Unfortunately, the title and description do not always provide an accurate overview, and skimming over videos is time-consuming and can lead to missing important information. We propose a novel approach that locates and extracts the GUI screens showcased in a video tutorial, then selects and displays the most representative ones to provide a GUI-focused overview of the video. We believe this overview can be used by developers as an additional source of information for …", "num_citations": "0\n", "authors": ["2284"]}
{"title": "Welcome from the swan 2017 chairs\n", "abstract": " MacOdrum Library - Carleton's Institutional Repository: Welcome from the swan 2017 chairs university website Home About Submitting a Publication Carleton Research Stories sign in School of Computer Science / Article Search O. Baysal (Olga), Menzies, T. (Tim), Guerrouj, L. (Latifa), Metzger, A. (Andreas), Haiduc, S. (Sonia) and Escobar-Avila, J. (Javier) 2017-09-04 Welcome from the swan 2017 chairs Presented at the 3rd ACM SIGSOFT International Workshop on Software Analytics, SWAN 2017, Co-located with 11th Joint Meeting of the European Software Engineering Conference and the ACM SIGSOFT Symposium on the Foundations of Software Engineering, ESEC/FSE 2017 (September 2017), Paderborn Additional Metadata Conference 3rd ACM SIGSOFT International Workshop on Software Analytics, SWAN 2017, Co-located with 11th Joint Meeting of the European Software Engineering Conference and …", "num_citations": "0\n", "authors": ["2284"]}
{"title": "Mining & Modeling Unstructured Data in Software‐Challenges for the Future\n", "abstract": " To analyze, comprehend, and reverse engineer software projects and their software development processes, developers rely on various sources of information. Bug reports, execution logs, mailing lists, code review reports, change logs, requirements documents, and the actual source code contain implicit developer knowledge about the project and past development efforts. Most of this knowledge is captured as unstructured information, that is, natural language text used to exchange information among people.Researchers in the Information Retrieval (IR), Data Mining (DM), and Natural Language Processing (NLP) fields have experimented with various techniques (such as, Latent Dirichlet Allocation and Vector Space Model) and ad‐hoc approaches to enable the mining of unstructured data from software artifacts. However, these techniques were not designed to work with the complexities and peculiarities of unstructured software engineering data, and thus are not readily applicable to the software engineering research domain.", "num_citations": "0\n", "authors": ["2284"]}
{"title": "Appreciation to empirical software engineering reviewers of 2015\n", "abstract": " For helping us deliver timely decisions to our authors, the Editors-in-Chief and Publisher would like to thank the following individuals that contributed reviews between November 1, 2014 and November 1, 2015. We applaud your efforts and dedication to the community.", "num_citations": "0\n", "authors": ["2284"]}
{"title": "2015 IEEE 5th Workshop on Mining Unstructured Data (MUD)\n", "abstract": " Copyright and Reprint Permission: Abstracting is permitted with credit to the source. Libraries are permitted to photocopy beyond the limit of US copyright law for private use of patrons those articles in this volume that carry a code at the bottom of the first page, provided the per-copy fee indicated in the code is paid through Copyright Clearance Center, 222 Rosewood Drive, Danvers, MA 01923. For other copying, reprint or republication permission, write to IEEE Copyrights Manager, IEEE Operations Center, 445 Hoes Lane, PO Box 1331, Piscataway, NJ 08855-1331. All rights reserved.", "num_citations": "0\n", "authors": ["2284"]}
{"title": "Welcome message from the MUD 2014 co-chairs\n", "abstract": " Presents the introductory welcome message from the conference proceedings. May include the conference officers' congratulations to all involved with the conference event and publication of the proceedings record.", "num_citations": "0\n", "authors": ["2284"]}
{"title": "3rd workshop on Mining Unstructured Data\n", "abstract": " Software development knowledge resides in the source code and in a number of other artefacts produced during the development process. To extract such a knowledge, past software engineering research has extensively focused on mining the source code, i.e., the final product of the development effort. Currently, we witness an emerging trend where researchers strive to exploit the information captured in artifacts such as emails and bug reports, free-form text requirements and specifications, comments and identifiers. Being often expressed in natural language, and not having a well-defined structure, the information stored in these artifacts is defined as unstructured data. Although research communities in Information Retrieval, Data Mining and Natural Language Processing have devised techniques to deal with unstructured data, these techniques are usually limited in scope (i.e., designed for English language …", "num_citations": "0\n", "authors": ["2284"]}
{"title": "ICPC 2013 Team\n", "abstract": " Message from the Chairs Page 1 Message from the Chairs Welcome to San Francisco, CA, and the 21st International Conference on Program Comprehension (ICPC 2013)! Program comprehension is a vital software engineering and maintenance activity. It is necessary to facilitate reuse, inspection, maintenance, reverse engineering, reengineering, migration, and extension of existing software systems. ICPC provides an opportunity for researchers and industry practitioners to present and discuss both the state of the art and the state of the practice in the general area of program comprehension. We received a record number of 63 full paper submissions to the main/research track from across the world. The papers went through a rigorous review process. The final decision on including the papers in the proceedings was made based on the reviews, open discussion among program committee members, and …", "num_citations": "0\n", "authors": ["2284"]}
{"title": "BotSE 2021\n", "abstract": " Program Committee IEEE.org Help Cart Jobs Board Create Account Toggle navigation IEEE Computer Society Digital Library Jobs Tech News Resource Center Press Room Advertising About Us IEEE IEEE Computer Society IEEE Computer Society Digital Library My Subscriptions Magazines Journals Conference Proceedings Institutional Subscriptions IEEE IEEE Computer Society More Jobs Tech News Resource Center Press Room Advertising About Us Cart All Advanced Search Conference Cover Image Download 1.Home 2.Proceedings 3.botse 2021 Program Committee 2021, pp. 9-9, DOI Bookmark: 10.1109/BotSE52550.2021.00007 Keywords Authors Program Committee ,BotSE 2021 , ,Committee Members , ,Martin Monperrus, ,KTH Royal Institute of Technology, ,Riccardo Scandariato, ,Hamburg University of Technology ,Thomas Zimmermann, ,Microsoft ,Abram Hindle, ,University of Alberta ,Nicole Novielli, ,…", "num_citations": "0\n", "authors": ["2284"]}
{"title": "Steering Committee ICPC 2021\n", "abstract": " Steering Committee | IEEE Conference Publication | IEEE Xplore Steering Committee Abstract: Provides a listing of current committee members and society officers. Published in: 2021 IEEE/ACM 29th International Conference on Program Comprehension (ICPC) Article #: Date of Conference: 20-21 May 2021 Date Added to IEEE Xplore: 28 June 2021 ISBN Information: Electronic ISBN: 978-1-6654-1403-6 Print on Demand(PoD) ISBN: 978-1-6654-1404-3 ISSN Information: Electronic ISSN: 2643-7171 Print on Demand(PoD) ISSN: 2643-7147 INSPEC Accession Number: Persistent Link: https://xplorestaging.ieee.org/servlet/opac?punumber=9462945 More » Publisher: IEEE IEEE Account Change Username/Password Update Address Purchase Details Payment Options Order History View Purchased Documents Profile Information Communications Preferences Profession and Education Technical Interests Need Help…", "num_citations": "0\n", "authors": ["2284"]}
{"title": "Technical Research Track Program Committee\n", "abstract": " Technical Research Track Program Committee IEEE.org Help Cart Jobs Board Create Account Toggle navigation IEEE Computer Society Digital Library Jobs Tech News Resource Center Press Room Browse By Date Advertising About Us IEEE IEEE Computer Society IEEE Computer Society Digital Library My Subscriptions Magazines Journals Conference Proceedings Institutional Subscriptions IEEE IEEE Computer Society More Jobs Tech News Resource Center Press Room Browse By Date Advertising About Us Cart All Advanced Search Conference Cover Image Download 1.Home 2.Proceedings 3.icpc 2018 Technical Research Track Program Committee 2018, pp. 18-182, DOI Bookmark: Keywords Authors Abstract Provides a listing of current committee members and society officers. ,Technical Research Track Program Committee , , , ,Alberto Bacchelli ,University of Zurich ,Switzerland ,Titus Barik ,Microsoft ,…", "num_citations": "0\n", "authors": ["2284"]}
{"title": "Steering Committee of ICPC 2019\n", "abstract": " Steering Committee | IEEE Conference Publication | IEEE Xplore Steering Committee Abstract: Provides a listing of current committee members and society officers. Published in: 2019 IEEE/ACM 27th International Conference on Program Comprehension (ICPC) Article #: Date of Conference: 25-26 May 2019 Date Added to IEEE Xplore: 29 August 2019 ISBN Information: Electronic ISBN: 978-1-7281-1519-1 Print on Demand(PoD) ISBN: 978-1-7281-1520-7 ISSN Information: Electronic ISSN: 2643-7171 Print on Demand(PoD) ISSN: 2643-7147 INSPEC Accession Number: Persistent Link: https://xplorestaging.ieee.org/servlet/opac?punumber=8797605 More » Publisher: IEEE IEEE Account Change Username/Password Update Address Purchase Details Payment Options Order History View Purchased Documents Profile Information Communications Preferences Profession and Education Technical Interests Need …", "num_citations": "0\n", "authors": ["2284"]}
{"title": "Organizing Committee for MSR 2019\n", "abstract": " Organizing Committee for MSR 2019 Page 1 Organizing Committee for MSR 2019 General Chair Margaret-Anne Storey University of Victoria Canada Program Co-Chair Bram Adams MCIS, Polytechnique Montreal Canada Program Co-Chair Sonia Haiduc Florida State University United States Data Showcase Co-Chair Nicole Novielli University of Bari Italy Data Showcase Co-Chair Alexander Serebrenik Eindhoven University of Technology Netherlands Mining Challenge Co-Chair Stephan Diehl University of Trier Germany Mining Challenge Co-Chair Sebastian Baltes University of Trier Germany Mining Challenge Co-Chair Christoph Treude The University of Adelaide Australia Awards Co-Chair Christian Bird Microsoft Research United States Awards Co-Chair Ying Zou Queen's University Canada MIP Award Co-Chair Michael W. Godfrey University of Waterloo Canada MIP Award Co-Chair Jim Whitehead …", "num_citations": "0\n", "authors": ["2284"]}
{"title": "Bram Adams\n", "abstract": " Steering Committee Page 1 Steering Committee Bram Adams MCIS, Polytechnique Montreal Canada Alberto Bacchelli University of Zurich Switzerland Jesus M. Gonzalez-Barahona Universidad Rey Juan Carlos Spain Christian Bird Microsoft Research United States Massimiliano Di Penta University of Sannio Italy Georgios Gousios TU Delft Netherlands Sonia Haiduc Florida State University United States Ahmed E. Hassan Queen's University Canada Emily Hill Drew University United States Abram Hindle University of Alberta Canada xxx Page 2 2 Yasutaka Kamei Kyushu University Japan Miryung Kim University of California, Los Angeles United States Sunghun Kim The Hong Kong University of Science and Technology Hong Kong Gail Murphy University of British Columbia Canada Sarah Nadi University of Alberta Canada Mei Nagappan University of Waterloo Canada Martin Pinzger Alpen-Adria-Universität …", "num_citations": "0\n", "authors": ["2284"]}
{"title": "Research Track Chairs\n", "abstract": " Program Committee Page 1 Program Committee Research Track Chairs Foutse Khomh, Polytechnique Montréal, Canada David Lo, Singapore Management University, Singapore Members Antoniol Giuliano, Ecole Polytechnique de Montréal, Canada Arnaoudova Venera, Washington State University, USA Gabriele Bavonata, Universita della Svizzera italiana, Switzerland Bissyandé Tegawendé F., SnT, University of Luxembourg, Luxembourg Chen Tse-Hsun Peter, Concordia University, Canada Datta Subhajit, Singapore University of Technology and Design, Singapore Andrea De Lucia, University of Salerno, Italy Coen De Roover, Vrije Universiteit Brussel, Belgium Danny Dig, Oregon State University, USA Anne Etien, Ecole Polytechnique Universitaire de Lille, France Jean-Rémy Falleri, Bordeaux INP, France Jesús M. Gonzalez-Barahona, Universidad Rey Juan Carlos, Spain Latifa Guerrouj, École de …", "num_citations": "0\n", "authors": ["2284"]}
{"title": "ACM Student Research Competition Program Committee\n", "abstract": " ACM Student Research Competition Program Committee Page 1 ACM Student Research Competition Program Committee Bram Adams École Polytechnique de Montréal, Canada Marcel Böhme National University of Singapore, Singapore Georgios Gousios TU Delft, Netherlands Latifa Guerrouj École de Technologie Supérieure, Canada Ernst Moritz Hahn Chinese Academy of Sciences, China Sonia Haiduc Florida State University, United States David Lo Singapore Management University, Singapore Andrea Mocci Universita della Svizzera italiana, Switzerland xli Page 2 Laura Moreno Colorado State University, United States Sarah Nadi University of Alberta, Canada Martin Ochoa Singapore University of Technology and Design, Singapore Jun Pang University of Luxembourg, Luxembourg Sebastiano Panichella University of Zurich, Switzerland Patrizio Pelliccione University of Gothenburg & Chalmers University …", "num_citations": "0\n", "authors": ["2284"]}
{"title": "Selection Committee for the IEEE TCSE Distinguished Paper Award\n", "abstract": " Selection Committee for the IEEE TCSE Distinguished Paper Award IEEE.org Help Cart Jobs Board Create Account Toggle navigation IEEE Computer Society Digital Library Jobs Tech News Resource Center Press Room Browse By Date Advertising About Us IEEE IEEE Computer Society IEEE Computer Society Digital Library My Subscriptions Magazines Journals Conference Proceedings Institutional Subscriptions IEEE IEEE Computer Society More Jobs Tech News Resource Center Press Room Browse By Date Advertising About Us Cart All Advanced Search Conference Cover Image Download 1.Home 2.Proceedings 3.icsme 2017 Selection Committee for the IEEE TCSE Distinguished Paper Award 2017, pp. xx-xx, DOI Bookmark: 10.1109/ICSME.2017.88 Keywords Authors Abstract Provides a listing of current committee members and society officers. Selection Committee for the IEEE TCSE Distinguished Paper …", "num_citations": "0\n", "authors": ["2284"]}
{"title": "Technical Track\n", "abstract": " Program Committee IEEE.org Help Cart Jobs Board Create Account Toggle navigation IEEE Computer Society Digital Library Jobs Tech News Resource Center Press Room Browse By Date Advertising About Us IEEE IEEE Computer Society IEEE Computer Society Digital Library My Subscriptions Magazines Journals Conference Proceedings Institutional Subscriptions IEEE IEEE Computer Society More Jobs Tech News Resource Center Press Room Browse By Date Advertising About Us Cart All Advanced Search Conference Cover Image Download 1.Home 2.Proceedings 3.vissoft 2017 Program Committee 2017, pp. xi-xiii, DOI Bookmark: 10.1109/VISSOFT.2017.7 Keywords Authors Abstract Provides a listing of current committee members and society officers. VISSOFT 2017 Program Committee ,Technical Track, ,Alexandre Bergel, ,University of Chile, Chile, ,Derek Rayside, ,University of Waterloo, Canada, ,…", "num_citations": "0\n", "authors": ["2284"]}
{"title": "Program Committee Research Track Co-Chairs\n", "abstract": " Program Committee Page 1 Program Committee Program Committee Research Track Co-Chairs Coen De Roover Vrije Universiteit Brussel Belgium Jianjun Zhao Kyushu University Japan Members Christoph Treude University of Adelaide Australia Ralf Huuck Synopsys/University of New South Wales Australia Vadim Zaytsev Raincode Netherlands Jens Nicolay Vrije Universiteit Brussel Belgium Fernando Castor Universidade Federal de Pernambuco Brazil Cheng Zhang Google Canada Michael Godfrey University of Waterloo Canada Abram Hindle University of Alberta Canada Bram Adams Ecole Polytechnique de Montréal Canada Nicolas Anquetil University of Lille France Xavier Blanc Bordeaux University France Sybille Schupp Hamburg University of Technology Germany Sandro Schulze Otto-von-Guericke Universität Magdeburg Germany Ina Schaefer Technische Universität Braunschweig Germany Ralf …", "num_citations": "0\n", "authors": ["2284"]}
{"title": "ICPC 2017\n", "abstract": " ICPC 2017 Early Research Achievement Track Program Committee IEEE.org Help Cart Jobs Board Create Account Toggle navigation IEEE Computer Society Digital Library Jobs Tech News Resource Center Press Room Browse By Date Advertising About Us IEEE IEEE Computer Society IEEE Computer Society Digital Library My Subscriptions Magazines Journals Conference Proceedings Institutional Subscriptions IEEE IEEE Computer Society More Jobs Tech News Resource Center Press Room Browse By Date Advertising About Us Cart All Advanced Search Conference Cover Image Download 1.Home 2.Proceedings 3.icpc 2017 ICPC 2017 Early Research Achievement Track Program Committee 2017, pp. xvii-xvii, DOI Bookmark: 10.1109/ICPC.2017.42 Keywords Authors Abstract Provides a listing of current committee members and society officers. ,Early Research Achievement Track ,Program Committee ,…", "num_citations": "0\n", "authors": ["2284"]}
{"title": "MSR 2016\n", "abstract": " Program Committee Page 1 Program Committee MSR 2016 Research and Practice Track Alberto Bacchelli Delft University of Technology, The Netherlands Olga Baysal Carleton University, Canada Andrew Begel Microsoft Research, USA Yuanfang Cai Drexel University, USA Hoah Khanh Dam University of Wollongong, Australia Massimiliano Di Penta University of Sannio, Italy Vladimir Filkov University of California, Davis, USA Daniel German University of Victoria, Canada Marco Gerosa University of São Paulo, Brazil Mike Godfrey University of Waterloo, Canada Alesandra Gorla IMDEA Software Institute, Spain Georgios Gousios Radboud Universiteit Nijmegen, The Netherlands Sonia Haiduc Florida State University, USA Hideaka Hata Nara Institute of Technology, Japan Yoshiki Higo Osaka University, Japan Abram Hindle University of Alberta, Canada Reid Holmes University of Waterloo, Canada Akinori Ihara …", "num_citations": "0\n", "authors": ["2284"]}
{"title": "Program Committee Research Track\n", "abstract": " Program Committee Research Track Page 1 Program Committee Research Track Co-Chairs Gabriele Bavota Free University of Bolzano-Bozen, Italy Michaela Greiler Microsoft, United States of America Members Abram Hindle University of Alberta, Canada Aiko Yamashita Oslo and Akershus University College of Applied Sciences, Norway Alexander Serebrenik Eindhoven University of Technology, Netherlands Andy Zaidman Delft University of Technology, Netherlands Árpád Beszédes University of Szeged, Hungary Bram Adams École Polytechnique De Montréal, Canada Chanchal K. Roy University of Saskatchewan, Canada Christoph Treude University of Adelaide, Australia Cristina Marinescu Politehnica University Timisoara, Romania Dan Hao Peking University, China Dave Binkley Loyola University Maryland, United States of America David Lo Singapore Management University, Singapore Dawn Lawrie …", "num_citations": "0\n", "authors": ["2284"]}
{"title": "27th IEEE International Conference on Software Maintenance\n", "abstract": " Research Track: Submissions should describe original and significant work in the research and practice of software maintenance and evolution. Case studies, empirical research, and experiments are particularly welcome. We also welcome papers presenting cutting-edge ideas in software maintenance. Selected papers will invited to a special issue of the JSME.", "num_citations": "0\n", "authors": ["2284"]}
{"title": "MUD 2015-welcome message from the organizers\n", "abstract": " Welcome to MUD 2015, the 5th Workshop on Mining Unstructured Data. The workshop is co-located with the 31st International Conference on Software Maintenance and Evolution (ICSME 2015) and is taking place in Bremen, Germany.", "num_citations": "0\n", "authors": ["2284"]}