{"title": "Nuclear power plant thermocouple sensor-fault detection and classification using deep learning and generalized likelihood ratio test\n", "abstract": " In this paper, an online fault detection and classification method is proposed for thermocouples used in nuclear power plants. In the proposed method, the fault data are detected by the classification method, which classifies the fault data from the normal data. Deep belief network (DBN), a technique for deep learning, is applied to classify the fault data. The DBN has a multilayer feature extraction scheme, which is highly sensitive to a small variation of data. Since the classification method is unable to detect the faulty sensor; therefore, a technique is proposed to identify the faulty sensor from the fault data. Finally, the composite statistical hypothesis test, namely generalized likelihood ratio test, is applied to compute the fault pattern of the faulty sensor signal based on the magnitude of the fault. The performance of the proposed method is validated by field data obtained from thermocouple sensors of the fast breeder test …", "num_citations": "50\n", "authors": ["1254"]}
{"title": "Knowledge management maturity models–a morphological analysis\n", "abstract": " A Knowledge Management Maturity Model is a structured approach for implementing Knowledge Management. Many practitioners and researchers have developed Knowledge Management Maturity Models, which have different forms, structure and characteristics. Despite the availability of many models, a comprehensive framework that can represent different perspectives and provide a holistic picture of Knowledge Management Maturity Model is not found in literature. This paper attempts to fill this gap by developing a morphological framework of Knowledge Management Maturity Model through literature survey and analysis.", "num_citations": "49\n", "authors": ["1254"]}
{"title": "Knowledge management maturity model: an engineering approach\n", "abstract": " Knowledge Management Maturity Model is a structured approach for implementing knowledge management. It can also be considered as engineering of knowledge management Many practitioners and researchers have developed knowledge management maturity models, which have many strengths and inadequacies. This paper attempts to develop a new model combining the strengths and eliminating the inadequacies of the existing models, with flexibility, adaptability and practical usability as the core objectives. The concept of Key Maturity Indicator is introduced which makes the model more flexible.", "num_citations": "41\n", "authors": ["1254"]}
{"title": "Pulsating potentiometric titration technique for assay of dissolved oxygen in water at trace level\n", "abstract": " A simple but high performance potentiometric titration technique using pulsating sensors has been developed for assay of dissolved oxygen (DO) in water samples down to 10.0 μg L−1 levels. The technique involves Winkler titration chemistry, commonly used for determination of dissolved oxygen in water at mg L−1 levels, with modification in methodology for accurate detection of end point even at 10.0 μg L−1 levels DO present in the sample. An indigenously built sampling cum pretreatment vessel has been deployed for collection and chemical fixing of dissolved oxygen in water samples from flowing water line without exposure to air. A potentiometric titration facility using pulsating sensors developed in-house is used to carry out titration. The power of the titration technique has been realised in estimation of very dilute solution of iodine equivalent to 10 μg L−1 O2. Finally, several water samples containing …", "num_citations": "28\n", "authors": ["1254"]}
{"title": "High performance conductivity monitoring instrument with pulsating sensor\n", "abstract": " We present an unconventional but high performance pulsating conductivity monitoring instrument constructed by using a new class of sensor, viz., pulsating sensor developed in house. The design consists of a special type of logic gate oscillator (LGO) powered by 5 V direct current (dc). The conductivity cell constitutes a part of LGO. In this conductivity meter the primary signal generated from the sensor is directly in digital domain which is easily transmitted either to a personal computer or to a stand-alone embedded system. Hence it reduces the hardware components making the instrumentation highly simplified. The output of the instrument is pulse frequency which is directly related to the conductivity of solution used for measurement. The relation between pulse frequency and conductivity is determined following a multipoint calibration technique developed in our laboratory using a series of KCl standards. The …", "num_citations": "26\n", "authors": ["1254"]}
{"title": "Kinetic studies on saponification of ethyl acetate using an innovative conductivity‐monitoring instrument with a pulsating sensor\n", "abstract": " An innovative conductometric measurement technique using a nonconventional but high‐performance (high‐precision, high‐resolution, rapid response features for online graphic display) in house–built pulsating conductivity monitoring instrument has been deployed to study the kinetic behavior during the reaction of ethyl acetate and NaOH. A laboratory‐made constant temperature reaction bath with the facility of continuous stirring of solution for homogeneous mixing was used to carry out experiments at desired solution temperatures. Rate constants of the saponification reaction in the temperature range at various temperatures (30–55°C) were determined, and the results were compared with the reported values. Although the reported data exhibit wide scatter, our data are in agreement with some of the literature data. From these data, thermodynamic parameters such as activation energy, activation enthalpy …", "num_citations": "23\n", "authors": ["1254"]}
{"title": "An Ultrasonic Scanning Technique for In-SituBowing'Measurement of Prototype Fast Breeder Reactor Fuel Sub-Assembly\n", "abstract": " An ultrasonic under-sodium scanner has been developed for deployment in Prototype Fast Breeder Reactor (PFBR) which is in advanced stage of construction at Kalpakkam, India. Its purpose is to scan the above-core plenum for detection, if any, of displacement of sub-assemblies. During its burn-up in the reactor, the head of a Fuel Sub-Assembly (FSA) may undergo a lateral shift from its original position (called `bowing') due to the fast neutron induced damage on its structural material. A simple scanning technique has been developed for measuring the extent of bowing in-situ. This paper describes a PC-controlled mock-up of the scanner used to implement the scanning technique and the results obtained of scanning a mock-up FSA head under water. The details of the liquid-sodium proof transducer developed for use in the PFBR scanner and its performance are also discussed.", "num_citations": "17\n", "authors": ["1254"]}
{"title": "Simulation and integrated testing of process models of PFBR operator training simulator\n", "abstract": " High fidelity Full Scope Operator Training Simulators play a key role in imparting plant related knowledge to the operating personnel in an effective way. It provides a platform for training the operators on normal and emergency conditions including all types of scenarios that would arise in any Nuclear Power Plant. The scenario based training helps the plant operator to handle a crisis in an efficient manner with the ultimate goal of safe and efficient operation of the plant.This paper discusses about the general description of PFBR Operator Training Simulator, modeling and simulation of various process models, the complexities involved etc. It also covers the associated process logics, controls, display of alarms and indications, malfunctions and transient incidents related to each process model, integration with other sub systems, individual process model testing, integrated performance testing and verification and …", "num_citations": "16\n", "authors": ["1254"]}
{"title": "Comparison of the performance metrics of median filter and wavelet filter when applied on SONAR images for denoising\n", "abstract": " Under water image processing is significant due to the poor quality of images acquired. Basically, under water images suffer from degradation due to light scattering, low contrast and blurring. When we utilize those images much of the fine details in the image is lost, so the images must be post-processed to retain information and improve the quality. Filters are used as a preprocessing tool to suppress noise, preserves edges and corners, and to enhance the image. Therefore an attempt has been made to compare and evaluate the performance of two filters namely, median filter and symlet wavelet filter. Compared to median filter, symlet wavelet filter gives desirable results for denoising in terms of PSNR-Peak Signal to Noise Ratio.", "num_citations": "15\n", "authors": ["1254"]}
{"title": "Design patterns to implement safety and fault tolerance\n", "abstract": " This paper discusses an object orient approach based on design pattern and computational reflection concept to implement non-functional requirements of complex control system. Firstly we brief about software architecture design, followed by control-monitor safety pattern, Tri-Modular redundancy (TMR) pattern, reflective state pattern and fault tolerance redundancy patterns that are use for safety and fault management. Reflection state pattern is a refinement of the state design pattern based on reflection architectural pattern. With variation in reflective design pattern we can develop a well structured fault tolerant system. The main goal of this paper is to separate control and safety aspect from the application logic. It details its intent, motivation, participants, consequences and implementation of safety design pattern.", "num_citations": "15\n", "authors": ["1254"]}
{"title": "Sensor fault detection in Nuclear Power Plant using statistical methods\n", "abstract": " In this paper, a sensor fault detection and isolation technique is proposed using statistical methods. An enhanced reconstruction method is proposed using Singular Value Decomposition (SVD). In the traditional SVD reconstruction method, the faulty data may affect other fault free data. The enhanced SVD (ESVD) reconstruction method is a robust method to map as a normal data. The statistical hypothesis test, namely Generalized Likelihood Ratio Test (GLRT) is applied to detect the fault in the residual space. The proposed method performance is verified by the real data of Fast Breeder Test Reactor (FBTR).", "num_citations": "14\n", "authors": ["1254"]}
{"title": "Study on medical image watermarking techniques\n", "abstract": " Study on Medical Image Watermarking Techniques - NASA/ADS Now on home page ads icon ads Enable full ADS view NASA/ADS Study on Medical Image Watermarking Techniques Priya, S. ; ., B. Santhi ; ., P. Swaminathan Abstract Publication: Journal of Applied Sciences Pub Date: December 2014 DOI: 10.3923/jas..Bibcode: 2014JApSc..P full text sources Publisher | © The SAO/NASA Astrophysics Data System adshelp[at]cfa.harvard.edu The ADS is operated by the Smithsonian Astrophysical Observatory under NASA Cooperative Agreement NNX16AC86A NASA logo Smithsonian logo Resources About ADS ADS Help What's New Careers@ADS Social @adsabs ADS Blog Project Switch to full ADS Is ADS down? (or is it just me...) Smithsonian Institution Smithsonian Privacy Notice Smithsonian Terms of Use Smithsonian Astrophysical Observatory NASA …", "num_citations": "13\n", "authors": ["1254"]}
{"title": "Intelligent adaptive e-learning model for learning management system\n", "abstract": " In this study we have proposed an Intelligent Adaptive e-Learning Model that incorporates the ability to intelligently classify learners. There is a need for learning to continue, whether learners are on-or off-line. This study emphasize on developing an agent-based personalized adaptive learning model. This model is deployed as a service using agent technology and not just as an application as is the case with all other available LMS. We tested Intelligent Adaptive e-Learning Model prototype that implements an adaptive presentation of course content under conditions of intermittent Internet connections on postgraduate students studying a networking course. The study found out that it is possible for learners to study under both off-line and on-line modes through adaptive learning and the Intelligent Adaptive E-Learning system successfully classified learners and the accuracy was 85%.", "num_citations": "13\n", "authors": ["1254"]}
{"title": "The Secure Field Bus (SecFB) protocol-network communication security for secure industrial process control\n", "abstract": " This paper describes a protocol by which network security can be included in existing Fieldbus systems. The protocol makes use of the 56-bit DES cipher for data encryption. It also includes a scheme for symmetric key exchange and automatic key update at specific time intervals. In addition, the protocol includes a new idea called Key Refresh. The Key Refresh is a simple scheme that can be an alternative to operating the cipher in processor intensive chaining or feedback modes. The industrial field devices are equipped with the TMS series of digital signal processors to perform DES encryption/decryption. Since these processors are already present embedded in many of the state-of-art field devices, they were chosen so that the protocol would not require additional hardware. The protocol is generic and can run over any of the commercial Fieldbus networks", "num_citations": "12\n", "authors": ["1254"]}
{"title": "Double compression of test data using Huffman code\n", "abstract": " Increase in design complexity and fabrication technology results in high test data volume. As test size increases memory capacity also increases, which becomes the major difficulty in testing System-on-Chip (SoC). To reduce the test data volume, several compression techniques have been proposed. Code based schemes is one among those compression techniques. Run length coding is one of the most popular coding methodology in code based compression. Run length codes like Golomb code, Frequency directed run Length Code (FDR code), Extended FDR, Modified FDR, Shifted Alternate FDR and OLEL coding compress the test data and the compression ratio increases drastically. For further reduction of test data, double compression technique is proposed using Huffman code. Compression ratio using Double compression technique is presented and compared with the compression ratio obtained by other Run length codes.", "num_citations": "10\n", "authors": ["1254"]}
{"title": "Efficient resource allocation in multicasting over mobile adhoc networks\n", "abstract": " Abstract A Mobile Ad-hoc Network (MANET) represents an ad-hoc network which are able to change locations; which can also perform self-configuration and self-organization in a dynamic environment. Group communication system plays a major part in MANET environment which are implemented by multicasting method which provides delivery of packets to a group of destination. But there are many difficulties in implementing scalable, optimized and efficient multicasting network in mobile ad-hoc network because managing a dynamic environment with group membership is a challenging process. Efficient Geographic Multicast Protocol (EGMP) is proposed which uses a virtual zone base structure. The geographic region is divided into many virtual zones. The Distance between the source and other nodes in the group are found and the one closest to source is chosen as cluster head or zone leader. Zone leader communicates with its group members. Only zone leader transmits data and hence the node does not receive the same packets again and again. EGMP greatly simplifies zone management and packet forwarding. EGMP uses geographic forwarding to provide reliable packet transmission. It ensures the successful transmission of the data packets, has low overhead and reduced redundant packet transmissions. Compared with Scalable Position Based Multicast (SPBM), simulation results of EGMP shows high packet delivery ratio thus packet missing while transmission are reduced hence re-transmission of packets are reduced and bandwidth is utilized efficiently.", "num_citations": "9\n", "authors": ["1254"]}
{"title": "Nuclear power plant sensor fault detection using singular value decomposition-based method\n", "abstract": " In a nuclear power plant, periodic sensor calibration is necessary to ensure the correctness of measurements. Those sensors which have gone out of calibration can lead to malfunction of the plant, possibly causing a loss in revenue or damage to equipment. Continuous sensor status monitoring is desirable to assure smooth running of the plant and reduce maintenance costs associated with unnecessary manual sensor calibrations. In this paper, a method is proposed to detect and identify any degradation of sensor performance. The validation process consists of two steps: (i) residual generation and (ii) fault detection by residual evaluation. Singular value decomposition (SVD) and Euclidean distance (ED) methods are used to generate the residual and evaluate the fault on the residual space, respectively. This paper claims that SVD-based fault detection method is better than the well-known principal …", "num_citations": "8\n", "authors": ["1254"]}
{"title": "Inner race bearing fault detection using singular spectrum analysis\n", "abstract": " A novel method to diagnose the bearing fault is presented. The proposed method is based on the analysis of the bearing vibration signals using Singular Spectrum Analysis (SSA). SSA is a non-parametric technique of time series analysis that decomposes the acquired bearing vibration signals into an additive set of time series to extract information correlated with the condition of the bearing. Information in terms of time-domain features extracted from the SSA processed signal has been presented to a neural network for determination of inner race bearing fault. The result shows the effectiveness of the proposed method.", "num_citations": "8\n", "authors": ["1254"]}
{"title": "Hough Transform Method for Determining the Fuel Sub-Assembly's In-Situ ‘Bow’in Breeder Reactor Using Its Sparsely Scanned Ultrasonic Image\n", "abstract": " An Ultrasonic under-sodium scanner has been developed for use in Prototype Fast Breeder Reactor (PFBR), Kalpakkam, India. An ultrasonic scanning technique already developed enables us to determine the in-situ `bow', if any, of the Fuel Sub-Assembly (FSA) in reactor by two methods viz `circle-fitting' and `data-based'. This paper proposes another method viz Hough Transform by which we are able to determine the center of the circular top surface of a mock-up FSA head using its under- water image obtained in an earlier scanning experiment. A program written in MATLAB script carries out Hough transformation of four sparsely scanned images of the head kept at distances of 135 to 165 mm from the scanner-axis. We have devised a `composite' Hough Transform algorithm to obtain the `true' center coordinates and hence the scanner axis-FSA head distance values to an accuracy of 3 mm for distances up to …", "num_citations": "6\n", "authors": ["1254"]}
{"title": "Role of animated human machine interface in nuclear power plant simulation\n", "abstract": " The recent advances in Computer Science and Technology have revolutionized the way graphical user interfaces are used towards Human Machine Interface (HMI). The graphical user interface is so powerful, that the knowledge of a process or system can be transferred to plant personnel accurately and effectively within a short period of time. The techniques of animation can enhance the illusion of direct manipulation that many human computer interfaces strive to represent. This paper describes the role of human machine interface using animated information in Full Scope Replica type training simulator of Prototype Fast Breeder Reactor (PFBR). This paper covers general description of PFBR, the Full Scope Replica Simulator, the concept of simulation of plant dynamics, development of the animated core temperature distribution diagram and process flow diagram followed by its features. Also it covers how …", "num_citations": "6\n", "authors": ["1254"]}
{"title": "Fuzzy logic based feed water flow control model for prototype fast breeder reactor\n", "abstract": " Fuzzy Logic based control system for smooth controlling of the flow of feed water in a PFBR (Prototype Fast Breeder Reactor) to maintain the temperature of Steam generator sodium outlet temperature at a desired level during power setback. The flow of feed water into the steam generator is controlled by opening and closing of control valves. The Fuzzy Logic Controller (FLC) developed for this purpose will control the control valve based on the control value which is to be computed by a fuzzy logic controller using Fuzzy rules and inferencing based on the Steam generator sodium outlet temperature error and error rate. The Fuzzy Logic Control algorithm has been written in FORTRAN language and implemented in a Full Scope Replica Type Operator Training Simulator by integrating with the Steam Generator module of the simulator. The result has been compared with a PI controller and it has been observed that Fuzzy Logic Control performed better in attaining a smooth control of Feed water flow than PI control.(Abstract)", "num_citations": "6\n", "authors": ["1254"]}
{"title": "Reliability analysis by fmea method for object oriented distributed digital control system design model of nuclear power plant\n", "abstract": " Object Oriented Analysis and Design (OOAD) has been an efficient software engineering approach to model system as group of interacting objects. This approach is used to model Distributed digital control system (DDCS) of power plant in this paper. Complex system modeled in simple Model driven architecture can provide effective theoretical approach for Failure mode and effect analysis (FMEA). FMEA being a tedious process as it demands detailed and systematic examination of the operation of all aspect of the design, appropriate OOAD approach will be effective in concept and preliminary system design phase for FMEA analysis. In this paper we tried to analyze FMEA for network design for Prototype fast breeder reactor (PFBR) DDCS and examine how Object Oriented (00) approach can help us in finding common causes of failure via FMEA worksheet. Corrective generic actions for common faults can be …", "num_citations": "5\n", "authors": ["1254"]}
{"title": "An artificial neural network approach for the discordance sensor data validation for SCRAM parameters\n", "abstract": " In Fast Breeder Reactor (FBR), shutdown system is envisaged by Safety and Control Rod Acceleration Movement by using (SCRAM) signals. These SCRAM signals are realized with redundant triplicate sensors, which are made available at different locations of reactor. In this case sensors should be in healthy condition to run the reactor in trouble free manner. To know the health status of sensors a monitoring system is necessary. For this purpose, discordance supervision system is envisaged, to monitor the discordance among the SCRAM signal sensors and generate the alarm when discordance occurs. If discordance occurs, the sensor data validation is necessary to justify the discordance. The sensor data validation by knowledge based approach is simple and reliable. The discordance data is obtained from SCRAM signals. To validate these sensors data value, a neural network based approach is used. The …", "num_citations": "5\n", "authors": ["1254"]}
{"title": "Analysis of Markov renewal reward process on VLSI cell partitioning\n", "abstract": " It is well known that various characteristics in risk and queuing process can be formulated as Markov Renewal function. We study the max-position of finitely many Markov Renewal Reward process with countable state space. We define Markov Renewal equation associated with max-posed process. The solutions of the Markov Renewal Reward equation are derived and the asymptotic behaviors of the equations are studied. Also we discuss the idea of delayed Markov renewal reward with state space.", "num_citations": "4\n", "authors": ["1254"]}
{"title": "Accelerated life testing of field programmable gate arrays\n", "abstract": " Advent of VLSI technology has paved the way for Programmable Logic Devices (PLD), which are widely used as the basic building blocks in high integrity electronic systems. PLDs are considered for their robust features such as high gate density, performance, speed etc. For PFBR Instrumentation and Control systems, PLDs are extensively used to implement digital designs such as VME bus interface logic, control logic and sequencing logic etc. Types of PLDs, such as Field Programmable Gate Arrays, Complex Programmable Logic Devices and Gate Array Logic devices are used in Core Temperature Monitoring System and Safety logics of shutdown systems. Since these devices are reliable as per the manufacturer's specification, they were used in R & D facilities like Fast Breeder Test Reactor and Augmented Boron Enrichment Plant as test beds. However, in order to use PLDs in commercial Nuclear Power …", "num_citations": "4\n", "authors": ["1254"]}
{"title": "Modeling of instrumentation and Control system of prototype fast Breeder reactor\n", "abstract": " Safety analysis and operational experience consistently indicate that human error is the greatest contributor to the risk of a severe accident in a nuclear power plant. A classical example is the Three Mile Island accident. Subsequent to this accident, major efforts have been made by practically all the nations using nuclear technology to produce power to reduce the potential for human error through improved procedures and methodologies and greater emphasis on the training of plant operators. The use of full scope simulators in the training of operators is an essential element in these international efforts. For successful training using simulators, the simulator should closely represent the actual conditions and environment. Thus each simulator would be unique to that country depending on the nature and type of reactors under use. India with its three stage nuclear power program has now successfully entered the second stage. At the Indira Gandhi Centre for Atomic Research (IGCAR) a 40 MWt Fast Breeder Test Reactor (FBTR) is operational since 25th October 1985. Based on the valuable experience gained, design of 500 MWe Prototype Fast Breeder Reactor (PFBR) has been completed and construction is in progress. This thesis dwells on the experiences and knowledge gained in the operation of FBTR and how this has been fruitfully integrated in the development of such a simulator for PFBR. It should be highlighted here that while the training simulators", "num_citations": "4\n", "authors": ["1254"]}
{"title": "Optimized energy aware scheduling to minimize makespan in distributed systems.\n", "abstract": " In the present world of large distributed systems and energy shortages, energy efficiency has become mandatory. One way to achieve this is by proper scheduling of tasks in a system of connected and dissimilar machines to minimize the energy consumption. Also, Jobs have to be scheduled properly to different systems in order to achieve maximum utilization of machines.\" Makespan\" has been the standard optimization criteria used in scheduling algorithms. Makespan is the time elapsed until all jobs scheduled are completely processed. A scheduling algorithm must look to minimize the makespan while satisfying the precedence constraints between the tasks. Though the problem is NP-hard, many algorithms have been proposed. There are algorithms proposed to reduce the energy consumption for uni-machine systems and sequential tasks. Our algorithm tries to reduce the overall energy consumption of a …", "num_citations": "3\n", "authors": ["1254"]}
{"title": "Information retrieval by mining text and image\n", "abstract": " We have wonderful scripts which are lying to be digitised in Tamil. Tamil is a language which is enriched with several ancient scripts. Optical character recognition is done in Tamil in order to digitise the scripts. The optical character recognition consists of scanning phase, preprocessing phase, segmentation phase and recognition phase. The retrieved text is stored as an archive in the database. The archive also encompasses the original images. The front end GUI contains the search engine wherein which the keyword is put. The crawler crawls in the database and retrieves the searched page and the image based on context. The retrieved pages will be displayed in the order of relevant context and the appropriate page is clicked and fetched as desired.", "num_citations": "3\n", "authors": ["1254"]}
{"title": "Fault tolerance in distributed systems using fused data structures with the help of LT codes\n", "abstract": " To tolerate the crash faults among many different data structures which requires replication of every data structure, resulting in some number of additional or extra backups. It is to present a solution, referred to as fusion that uses both erasure codes and selective replication to tolerate 'f' crash faults based on 'f' additional fused backups. To improve efficiency, other techniques for fusion with a focus on erasure codes such as Luby transform codes (LT codes) can be applied (Balasubramanian and Garg, 2013). On implementing the LT codes, the advantages include faster recovery from fault than normal erasure codes and also improve scalability. The applications on networks without feedback channel can achieve reliability with the help of LT codes. Since LT codes are more suitable for distributed backup systems it is made use of in distributed systems for automated fault tolerance (Balasubramanian and Garg, 2013 …", "num_citations": "3\n", "authors": ["1254"]}
{"title": "Design of Fault Tolerant Automated Energy Metering System using GSM/GPRS Modems\n", "abstract": " Objectives: The proposed system addresses a fault tolerant technique to overcome the two major problems that are faced currently in the automated energy metering systems, used in telecom tower management. Methods/Analysis: It is analyzed that the effective supervision in the telecom tower sites, is currently affected due to the problem of SIM card interchange between the GSM/GPRS modems and IP connectivity failure between the GSM/GPRS modem and the server, in the automated energy metering system. Results: The fault tolerant technique addressed, utilizes a master GSM/GPRS modem which is capable of communicating with all the GSM/GPRS modems in the client side. Whenever the IP connectivity gets lost in any particular GSM/GPRS modem, the modem automatically sends the energy meter readings through SMS to the master GSM/GPRS modem, which in turn sends the data to the server via RS232 link. The problem of SIM card interchange in the GSM/GPRS modems is taken care by assigning an ID for each energy meter and the energy meter readings are mapped against this ID instead of mapping against the phone numbers. Improvements: There is not a single fault tolerant technique addressed for GSM/GPRS modems until today. These two automated solutions reduce the manual dependency and prevent most of the human prone errors. The system can further be improved by incorporating the security measures addressed for the GSM/GPRS modems and also the network failure of GSM modem (while receiving the SMS) can be addressed.", "num_citations": "3\n", "authors": ["1254"]}
{"title": "Simulation of control logics for plant transition state for PFBR Operator Training Simulator\n", "abstract": " In any nuclear power plant safety is assured by well defined procedures & practices and by implementing redundant & diverse technology. Procedures concern to the component/system will vary from state to state. Prototype Fast Breeder Reactor (PFBR) is a 500 MWe capacity, pool type reactor utilizing liquid sodium as a coolant and fuel as Mixed Oxide (Plutonium and Uranium). In general there are two reactor states inPFBR i.e. Transition state and Stable state. Wherein steady state indicates stable operating or shutdown state of reactor and transition state indicates an intermediate state between two stable states and this state ensures the healthiness of redundant/diverse system and its auxiliary system. This paper discusses about control logic simulation & implementation of Reactor Start-Up (RSU) system i.e. one of the transition state of PFBR which comes in-between Reactor in Shutdown (RSD) and Reactor in …", "num_citations": "3\n", "authors": ["1254"]}
{"title": "Design and development of switch over logic system for PFBR\n", "abstract": " [en] The Switch Over Logic System (SOLS) being a non-processor based highly reliable independent monitoring system in all Safety Class-2 (SC-2) and Fault Tolerant Non-Nuclear Safety (FT-NNS) I and C system architecture of PFBR, checks the healthiness of dual VME bus based Real Time Computer (RTC) systems and permits the healthy RTC system's output to the final control elements (FCE) in the plant for its uninterrupted operation. In this paper the design philosophy and the reliability analysis of SOLS is described.(author)", "num_citations": "3\n", "authors": ["1254"]}
{"title": "Knowledge management in a nuclear research centre\n", "abstract": " ∎ Science based high technology endeavor like Nuclear Energy with all it’s multi and inter disciplinary facets relies on creation, storage and dissemination of knowledge. Nuclear energy relies on robust design, manufacturing, operation & maintenance, modeling, analysis and root cause understanding of failures and associated mechanisms.", "num_citations": "3\n", "authors": ["1254"]}
{"title": "A comparative review of the challenges encountered in sentiment analysis of Indian regional language tweets vs English language tweets\n", "abstract": " With the developed use of online medium these days for sharing views, sentiments and opinions about products, services, organization and people, micro blogging and social networking sites are acquiring a huge popularity. One of the biggest social media sites namely Twitter is used by several people to share their life events, views and opinion about different areas and concepts. Sentiment analysis is the computational research of reviews, opinions, attitudes, views and peoples’ emotions about different products, services, firms and topics through categorizing them as negative and positive emotions. Sentiment analysis of tweets is a challenging task. This paper makes a critical review on the comparison of the challenges associated with sentiment analysis of Tweets in English Language versus Indian Regional Languages. Five Indian languages namely Tamil, Malayalam, Telugu, Hindi and Bengali have been considered in this research and several challenges associated with the analysis of Twitter sentiments in those languages have been identified and conceptualized in the form of a framework in this research through systematic review.", "num_citations": "2\n", "authors": ["1254"]}
{"title": "A. R, K. Kalaivani, and P. Swaminathan,‘A comprehensive survey on Content Based Image Retrieval system and its application in medical domain’\n", "abstract": " Content Based Image Retrieval (CBIR) is an important and widely used technique for retrieval of different kinds of images from large database. Collection of information in database are available in different formats such as text, image, graph, chart etc. Here, our focus is on information which is available in the form of images. Searching and retrieval of the image from a large amount of database is difficult problem because it uses the image visual information such as shape, text and color for indexing and representation of an image. For efficient CBIR system, there is a need to develop different kinds of retrieval methods using feature extraction, similarity matching etc. Text Based Image Retrieval systems are used in many hospitals, but for large databases these are inefficient. To solve this problem, CBIR systems are proposed to retrieve matching images from database using automated feature extraction method. At present, medical imaging field finds extensive growth in the generation and evaluation of various types of medical images which are high inconsistency, usually fused and the combination of various minor composition structures. For easy retrieval, need to be development of feature extraction and image classification methods. Different methods are used for different kinds of medical images. The Radiology department and Cardiology department are the largest producers of medical images and the patient abnormal images can be stored with the normal images. CBIR uses query image as input and it retrieves the images, which are similar to the query more efficiently and effectively. This paper provides a comprehensive Survey about CBIR …", "num_citations": "2\n", "authors": ["1254"]}
{"title": "Design and analysis of current mode amplifier as drive electronics for linear voice coil motor\n", "abstract": " Abstract Voice Coil Motor is a precise positioning and motion control device, the drive electronics must be of utmost accuracy such that it accounts for the exact requirements of the motor load. This work mainly focuses on the design and analysis of a current mode based operational amplifier, which is expected to generate the precise magnitudes of current. An improved Howland current pump, current drive based amplifier is theoretically analyzed and the analog simulation is performed. A novel hardware scheme is proposed which is suitable for VCM testing and the methodology to develop the hardware is also emphasized.", "num_citations": "2\n", "authors": ["1254"]}
{"title": "Enhanced Facet Ranking and Text Classifier for Opinion Mining\n", "abstract": " The enormous growth and usage of social networks offer positive ways to any business by sharing the emotions, feelings and experiences. Web users are benefited with valuable online reviews. To utilize the reviews effectively, researchers are working on necessary methods and ideas such as classification of positive and negative sense of reviews, ranking the facet in the reviews to make the effective classification etc. This study aims to propose a novel facet identification namely Facet Based Adjective identification method (FBAI) for efficient feature selection of reviews. The next algorithm FacetRank marks facet of each opinion from review set with positive, negative and neutral polarity. To classify the ranked facets, a novel Cluster based k Nearest Neighbor (C-kNN) algorithm is proposed. Constrained single pass clustering algorithm is combined with existing kNN classification algorithm to classify the review set as positive or negative. C-kNN reduces the resemblance checking calculation and can process high dimensional data which enable dynamic classification. This analysis takes household product reviews as input data set. The ranked review set (using FBAI+ FacetRank) is given to kNN and C-kNN for classification. F1 score of C-kNN 2.43% higher than kNN. Linear time complexity of C-kNN achieved is 68% of kNN.", "num_citations": "2\n", "authors": ["1254"]}
{"title": "Presenting a new protocol for probabilistic quality of service analysis for distributed control system\n", "abstract": " There has been extensive research on design, implementation and analysis of new dedicated protocols like group protocol, feasible protocol, secure protocol etc to cater communication requirement of distributed system. However there is no predefined strategy that can be readily used for protocol selection. Performance is defined as the efficient use of resources while still meeting the applications’ requirement, hence this paper provide probabilistic analysis of QoS in protocol selection. Ideal protocol features are listed in this paper. Model is design for selection criteria of protocol and creating customized QoS parameter for ease in probability analysis.", "num_citations": "2\n", "authors": ["1254"]}
{"title": "Reliability analysis of safety logic with fine impulse test system of indian prototype fast breeder reactor\n", "abstract": " Safety Logic (SL) System is a safety critical system provided to protect the Prototype Fast Breeder Reactor (PFBR) against various neutronic & thermal incidents. SL system receives trip parameters from various systems such as neutron flux monitoring, failed fuel detection, sodium flow monitoring, reactor inlet temperature monitoring etc and performs logical operations to drive Electro Magnet (EM) coils of Control and Safety Rod Drive Mechanism which holds the absorber rods. Whenever any trip parameter exceeds / falls below the preset threshold or whenever important equipment / system is not available, SL system shuts down the reactor by dropping the absorber rods into the reactor core. The trip parameters are triplicated in nature, i.e. Triple Modular Redundancy (TMR) concept is employed. SL system is built using solid state digital integrated circuits. The EM-Coil drive circuit is built using Insulated Gate Bipolar …", "num_citations": "2\n", "authors": ["1254"]}
{"title": "Real Time Simulation and Performance Testing of Process Model of Nuclear Power Plant\n", "abstract": " Growing needs in training methodologies call for Process Simulators to be designed, modeled and implemented to represent a real system or plant. Today the process simulators have taken a significant role in imparting comprehensive training to the operating personnel. The main points of considerations in Nuclear Power Plant operation include plant safety, equipment availability and efficient operation. These are achieved by incorporating efficient training tool based on process simulators. This paper discusses about the general description of PFBR Operator Training Simulator, modeling and simulation of feed water system process simulator, the complexities involved etc. It also covers the associated process logics, controls, display of alarms and indications, mal functions and transient incidents, interconnection with other sub systems, performance testing, verification and validation etc. The process of Verification and Validation for evaluating the model is also discussed.", "num_citations": "2\n", "authors": ["1254"]}
{"title": "Modeling the Instrumentation and control systems of fast breeder nuclear reactor\n", "abstract": " Improper design of Instrumentation & Control (I&C) systems is one of the main reasons for human errors during the operation and maintenance phase of Nuclear reactors. It is very important to carry out detailed failure/safety analysis of I & C systems. The design shall be such that any single failure of I&C system should not unnecessarily shut down commercial nuclear reactor. It is necessary to provide sufficient redundancy to ensure the specified high reliability of I&C systems. On-line testability shall be provided during the design stage itself for I&C systems. Fast Breeder Nuclear Reactor uses plutonium oxide as fuel and liquid sodium as coolant. Due to high power density (500 KW/litre) in the reactor core, computer based supervision and control systems are used to detect flow blockage in the fuel subassemblies. Physically and functionally distributed computer systems process nearly 15000 process signals in the nuclear reactor. The processed information is routed to the control room through optical fibre based plant area network. This paper explains distributed embedded systems, neutronic systems, diverse safety logic systems, etc. The on-line diagnostics to detect both safe failure and unsafe failure are explained with illustrations. The architecture of safety instrumentation and reliability analysis are detailed in this paper. The criteria for selecting the testing interval of I&C system is explained for neutronic system, safety logic system and real time computer system. The plant operator should be well trained in both normal and transient behaviour of various subsystems of nuclear reactors. Abnormal behaviour of subsystems is categorized based on …", "num_citations": "2\n", "authors": ["1254"]}
{"title": "Advances in Knowledge Management\n", "abstract": " Knowledge Management has become a core management discipline that enables knowledge to grow, flow and create value in an organization. In other words it is the process by which the organization generates wealth form its knowledge-based assets. It involves people, information, workflows,‘best practices’, alliances,‘Communities of Practice’etc.“Knowledge” in this context includes both the experience, emotions, values, hunches and understanding of the people in the organization, and the information artifacts, such as documents and reports, available within the organization and in the world outside. Value is created in the organization by\" productivity\" and\" innovation\", through the application of knowledge to work. Knowledge is basically classified into explicit knowledge and tacit knowledge. Explicit knowledge is available in paper, computers etc., where as tacit knowledge resides in the heads of people.Knowledge Management is concerned with creating organizational environments for people to share, create and leverage knowledge for innovation and competitive advantage. Knowledge Management has created a paradigm shift in the thinking of people from “knowledge is power” to “knowledge sharing is power”.‘First Generation Knowledge Management Systems’ deal more with explicit knowledge. It follows the hierarchy of ‘Data’,‘Information’,‘Knowledge’and ‘Wisdom’. Here the organization is treated as an ‘Information Processing Machine’. The ‘Second Generation Knowledge Management Systems’ deal more with tacit knowledge. The central tenet here is that ‘knowledge resides in the user and not in the collection; what matters is …", "num_citations": "2\n", "authors": ["1254"]}
{"title": "Computer based on-line monitoring system for Fast Breeder Test Reactor, India\n", "abstract": " /Abstract/Fast Breeder reactor uses mixed carbide/oxide of Plutonium & Uranium as fuel and liquid sodium as coolant. The temperature of the coolant is measured at outlet of each fuel subassembly by in-core Cr-Al thermocouple. Computer based signal processing system is used to supervise the reactor core against flow blockage, power excursion and clad-hot spot. The neutronic flux is measured by compensated ion chamber, which are housed in the surrounding biological shield concrete. The neutronic signal is processed for deriving neutronic power, period and reactivity. The ‘trip’signal from neutronic and temperature signal processing systems are further processed by solid state safety logic that works on ‘two out of three’logic scheme. The entire safety instrumentation system consisting of temperature sensors, digital temperature signal processing systems, neutronic signal processing systems and safety logic systems need to be periodically tested and calibrated. Computer based on-line calibration and monitoring system is deployed at Fast Breeder Test reactor for temperature sensor validation, calibration of digital signal processing system, discordance supervision of triplicate neutronic channels and fine-impulse testing of safety logic systems. The paper details the design, operation and maintenance of computer based on-line calibration and monitoring system for Fast Breeder Test reactor. The normalisation coefficients of the triplicate channels, safe faults and unsafe faults of safety logic systems, calibration of neutronic power with the help of calculated thermal power are explained in detail. Human-interface system for on-line calibration …", "num_citations": "2\n", "authors": ["1254"]}
{"title": "A Survey on big data analytics with deep learning in the text using machine learning mechanisms\n", "abstract": " Big Data Analytics and Deep Learning are two immense purpose of meeting of data science. Big Data has ended up being major a tantamount number of affiliations both open and private have been gathering huge measures of room specific information, which can contain enduring information about issues, for instance, national cognizance, motorized security, coercion presentation, advancing, and healing informatics. Relationship, for instance, Microsoft and Google are researching wide volumes of data for business examination and decisions, influencing existing and future progression. Critical Learning figuring's isolate odd state, complex reflections as data outlines through another levelled learning practice. Complex reflections are learnt at a given level in setting of all around less asking for thoughts figured in the past level in the dynamic framework. An indispensable favoured perspective of Profound Learning is the examination and culture of beast measures of unconfirmed data, making it a fundamental contraption for Great Statistics Analytics where offensive data is, everything seen as, unlabelled and un-arranged. In the present examination, we investigate how Deep Learning can be used for keeping an eye out for some essential issues in Big Data Analytics, including removing complex cases from Big volumes of information, semantic asking for, information naming, smart data recovery, and streamlining discriminative errands. Deep learning using Machine Learning (ML) is continuously unleashing its power in a wide range of applications. It has been pushed to the front line as of late mostly attributable to the advert of huge information …", "num_citations": "1\n", "authors": ["1254"]}
{"title": "A survey on big data analytics for enhanced security on cloud\n", "abstract": " Cloud based data storage has become a common activity these days. Because cloud storage offers more advantages than normal storage methods those are dynamic access and unlimited storage capabilities for pay and use. But the security of the data outsourced to the cloud is still challenging. The data owner should be capable of performing integrity verification as well as to perform data dynamics of his data stored in the cloud server. Various approaches like cryptographic techniques, proxy based solutions, code based analysis, homomorphic approaches and challenge response algorithms have been proposed. This survey depicts the limitations of the existing approaches and the requirements for a novel and enhanced approach that ensures integrity of the data stored in cloud enabling better performance with reduced complexity.", "num_citations": "1\n", "authors": ["1254"]}
{"title": "Location-specific real time monitoring and controlling of irrigation system using Raspberry Pi.\n", "abstract": " In the financial nation like India, agribusiness will be the most vital needed one and it is the spine where climatic conditions differ significantly and watering system offices are poor. Keeping in mind the end goal to overcome from that downside, computerization will be the feasible solution. Yet the past computerization was not that much accommodating for the ranchers to attempt it in view of a high cost, execution, troublesome in support. So now is the time to proceed onward to another innovation in view of android application utilizing RaspberryPi. By utilizing this most recent innovation, clients can monitor the field from anyplace around the globe. The reason for this work is to minimize the cost for the ranchers and to utilize the water very efficiently. Here, RaspberryPi is a completely adjustable and programmable little PC which supports for a substantial number of peripherals and it exchanges the gathered sensor information specifically to web without the need of ZigBee and a different PC. In the event that it goes past the particular threshold which is specified by the agriculturist, it permits the water to stream to the specific zone alone. At last it will send notification to the client's mobile app, so that an agriculturist can have the information about his own farming field from anyplace.", "num_citations": "1\n", "authors": ["1254"]}
{"title": "Reuse of sago treated wastewater partially substitute in concrete\n", "abstract": " In this paper, investigated the usages of sago treated wastewater as partially substitute to normal water in concrete. Most of the construction industries are impressed due to lack of normal water. Therefore we are in need off the alternative source such as recycle and reuse of wastewater is to be implemented. The research envisaged establishment by means of treated wastewater used as a partial substitute for potable water in concrete. The impact on using sago treated wastewater for mixing of concrete slump and density was studied. The compression behavior of concrete by using sago treated wastewater of 0, 30, 35 and 40% in M25 grade of concrete was taken place and effect of treated wastewater on Compressive, Split Tensile and Flexural strength at different stages of curing 7, 28, 56 and 90 days was also studied. The compressive strength for 90days of 40% replacement is reached 10.9%. The split tensile 56 and 90days of 30% replacement are raised 2.89% and 13.11% when compared to conventional concrete and gradually decrease after added 35 and 40%. The flexural strength is gradually increased for 7 and 28 days of 40% replacement is increased strength by 12.74% and 7.14% respectively.", "num_citations": "1\n", "authors": ["1254"]}
{"title": "Group key agreement for secure group communication using NTRU and CRT\n", "abstract": " GKA protocol is necessary for group communication as secure in dynamic environment. This paper, we present a general construction of GKA protocol which is based on the CRT. In future creation, each member of the group add using the own public key that involves to every various decryption keys. The members of the group can decrypt the cipher text with the help of secret key. CRT supports to achieve an efficient decryption process while the effective encryption process provides by NTRU which is computationally inexpensive and efficient key of public cryptosystem. In addition, to strengthen the security level by using the increased parameter of NTRU and provably STR (Short Tandem repeat) supports for less communication cost.", "num_citations": "1\n", "authors": ["1254"]}
{"title": "Interoperation Key Schema for Social Media Tools in IP Multimedia Subsystem.\n", "abstract": " IP Multimedia Subsystem (IMS) is now being a solution for packet switched networks. The future generation network is amalgamating the infrastructure of Wireless/wireline for providing the standard interface for Internet services. Nevertheless, the network infrastructures like multimedia and non-multimedia do not have any native mechanism to interpret the key schema of client media tools to establish the communication such as voice and data. To establish, as such services, a signaling protocol of Session Initiation Protocol (SIP) is being put to use to control the communication on Internet for establishing, Maintaining and terminating the communication session. Many papers have been proposed for authentication and authorization for securing the communication media. However, so far, no paper has been proposed for interpreting the built-in schema of multimedia tools. Thus we propose the Interoperation Key Schema to successfully exchange the mismatched schema between media client and server. Also we analyze the proposed mechanism with Internet security systems of Internet Protocol Security (IPSec) and Transport Layer Security (TLS). We deploy a real time platform of multimedia to examine the interoperation success rate and call setup time between the media clients.", "num_citations": "1\n", "authors": ["1254"]}
{"title": "Eliminating redundant link traffic for live multimedia data over distributed system\n", "abstract": " To incorporate the same, applications like video conferencing and e-learning need IP multicast or unicast. However in internet applications, lack of multicast services play a deterrent role in group communication. When live multimedia data is transferred to more than one receiver over the network, the more number of duplicate packets are transferred. Due to this duplicate packets, bandwidth and other resources are not properly utilized. When network connection is slow then clustering duplicate packets takes place in link. Due to this clustering, there is a chance for the data loss to occur. A CacheCast mechanism can be used on the router to eliminate such type of duplicate packets. Cache is placed on the router which acts independently for the sender and receiver. In single source multiple destinations, while transferring live multimedia data to more number of receivers, the duplicate packets may occur on the link. All duplicate packets are removed at the nearest router of sender and retrieved from the nearest router of receiver. This technique is used to achieve the better utilization of bandwidth. When send the live data to more than one receiver, bandwidth is efficiently used and the receiver’s side original data has to be reconstructed without any discrepancies.", "num_citations": "1\n", "authors": ["1254"]}
{"title": "Verification and Validation Methodology for Safety Critical Embedded Systems\n", "abstract": " Embedded Systems used for controlling processing plants can be classified as safety critical embedded systems. To achieve the specified probability failure on demand, it is essential to customize the relevant IEEE standards. Since the requirement specifications will be well specified for process control applications, it is appropriate to follow the waterfall product development cycle. Not enough thought has been given for the Verification and Validation of embedded systems. The Verification and Validation process for safety critical embedded systems and the challenges for the Verification and Validation team are detailed in this study.", "num_citations": "1\n", "authors": ["1254"]}
{"title": "Real time simulation and analysis of nuclear core temperature monitoring system for PFBR\n", "abstract": " Real time simulation of process models are in heavy demand in the present day industrial scenario especially in Nuclear Power Plant scenario. Nuclear core being the most important and critical component in the Nuclear reactor, the primary concern is towards safe and efficient operation of the reactor by adopting better techniques for monitoring and control of the reactor. Effort is on at global level to develop and build a Training Simulator, covering all the reactor subsystems to impart comprehensive training to Nuclear Power Plant operators. This paper describes about the importance of Core Temperature Monitoring System for Prototype Fast Breeder Reactor (PFBR), real time modeling and simulation of core temperature monitoring system, the basic requirements and methodologies adopted for modeling and simulation. The simulation includes run time calculation for all the fuel subassemblies (SA) outlet …", "num_citations": "1\n", "authors": ["1254"]}
{"title": "Development of full scope replica operator training simulator for PFBR\n", "abstract": " The safety of a plant is primarily determined by the knowledge and skill sets possessed by the plant operators. This is achieved by providing comprehensive training to the operators in all phases of plant operation. Full Scope Replica Training Simulators play an essential and extremely important role in imparting plant related knowledge to operating personnel. One of the most significant developments in Nuclear Power Plant training methodology is the adoption of Full Scope Replica Simulators in the training programme, thereby improving the safety of the plant significantly.", "num_citations": "1\n", "authors": ["1254"]}
{"title": "Computational Intelligent Systems for Prototype Fast Breeder Reactor\n", "abstract": " Computational intelligent systems play a major role in enhancing the safe operation of the nuclear reactor. In Prototype Fast Breeder Reactor (PFBR) nearly 15000 process signals are digit ized by physically and functionally distributed embedded systems. Digitized signals are processed and relevant informat ion is displayed through large video display systems at control room. It is necessary that correct and reliable informat ion need to be provided to the plant operator for efficient plant monitoring and control. The paper explains the features of four such systems namely on-line validation of neutronic power channel through on-line thermal balance calculation, detection of anomalous reactivity addition through on-line react ivity balance computation, on-line computation of reactor power from fluctuations of core thermocouple signals and detection of flow blockage in fuel subassemblies.", "num_citations": "1\n", "authors": ["1254"]}
{"title": "Making formal software specification easy\n", "abstract": " Even after so many years of research and development in building formal software specification languages, they are not yet popular in the industry for real-world applications. The number of reported success of using formal methods in industrial applications still remains very low. The reasons include: difficulty in learning new and complex mathematical notations, scarcity of experts in the field and difficulty in reviewing large specifications written in mathematical notations. In order to solve the above problems, this paper suggests use of high level programming languages as a formal specification language. Also, in order to demonstrate the effectiveness of this technique, three applications in nuclear industry are also presented.", "num_citations": "1\n", "authors": ["1254"]}
{"title": "Impact Study of Unbalanced Voltage Conditions on Induction Motor Using Mathematical Model\n", "abstract": " Analysis of the performance of an induction motor connected to unbalanced three phase voltages is presented. The method is based on the mathematical modeling. An induction motor model including the core loss resistance is built using MATLAB/SIMULINK tool. The unbalanced conditions studied are 1Φ, 2Φ and 3Φ unbalanced voltage under two torque conditions. The phase angle variation is not included. Under-voltage and Over-voltage condition of 1%, 2%, 4%, 6%, 8%, and 10% of rated voltage are included for all the unbalanced condition. The effect of the voltage variations on the electromagnetic torque, rotor speed, magnetizing current, stator phase currents, stator copper loss parameters are studied.", "num_citations": "1\n", "authors": ["1254"]}
{"title": "An Innovative Rapid Titration Facility Using Pulsating Sensors\n", "abstract": " In the Innovative Instrumentation Section (IIS) of Indira Gandhi Centre for Atomic Research (IGCAR) a new class of sensors, that is, pulsating sensors has been developed and these sensors have been deployed in many physicochemical applications. Using these pulsating sensors a rapid high performance PC-based titration facility has been developed which is the work horse of many miscellaneous chemical analysis even at trace level. In order to develop such a rapid titration facility, the following requirements were taken into consideration (i) short analysis time (ii) handling small volume of reagents (iii) good precision and fast response from the sensor end (iv) computer controlled and (v) automated volume dispensation. Considering these aspects we have developed a new type of high performance as well as cost effective rapid titrator which can be used in diverse chemical applications.", "num_citations": "1\n", "authors": ["1254"]}
{"title": "A Novel Conductometric Technique for Determination of Rate Constant Using Pulsating Sensor\n", "abstract": " W e have taken up a project to study the nature of oscillatory chemical reactions at elevated temperature using our ill-hOuSC built pulsating sensors in order to examine the suitability of such oscillatory reaction for rapid assay of chemical. Before studying the effect of temperature in an unknown system we wanted to see the effect of temperature on reaction rate of a well known non oscillatory system using our indigenously developed conductivity monitoring technique. Hence we chose one of the most popular reactions-saponification reaction of ethyl acetate and sodium hydroxide for kinetic study. In this paper we have brought out a new approach for rapid online measurement of conductivity during above mentioned chemical reaction using this in—house built instrument. From the online conductivity plot the data was processed to determine rate constant at a constant solution temperature. Using rate constants at …", "num_citations": "1\n", "authors": ["1254"]}
{"title": "A Novel Technique to Study Precipitation Reaction Using Pulsating Sensor\n", "abstract": " The principle of precipitation reaction is commonly used in chemical analysis using volumetric titration technique where appropriate indicator is used to detect the end point. The most common example is determination of chloride using Mohr's titration where the chloride is present in sample at several ppm to percentage level. In volumetric titration using colour indicator especially for halide estimation the analyst finds a lot of difficulty to judge the exact end point, Besides common errors associated in manual volumetric titration, the difficulty in judgment of end point deteriorates the accuracy in analysis. With the evolution of a new class of digital sensors (pulsating sensors) in the Innovative Instrumentation Section (IIS) of IGCAR we developed a simple and rapid conductometric titration technique and deployed it for routine monitoring of chloride in water samples where chloride is present from l ppm to several ppm …", "num_citations": "1\n", "authors": ["1254"]}
{"title": "Software development for computer based instrumentation and control systems for PFBR\n", "abstract": " [en] Software development for safety critical, safety related and non-nuclear safety systems for PFBR poses novel challenges to take care of factors like reliability, working in harmony in case of fault tolerant redundant systems and realizing the functional requirements in distributed modular ways besides meeting the basic functional and performance requirements. Hence it is mandatory to follow the established standards to develop this high quality software to meet these challenges. IEEE standards are followed to bring out the various artifacts at different developmental stages. Well established water-fall model approach is followed for the software development methodology. Computer Aided Software Engineering (CASE) tools are used to maintain the consistency and clarity of documents. Coding standards are adhered to knock out the weak and error prone constructs in the programming languages and style of coding.(author)", "num_citations": "1\n", "authors": ["1254"]}
{"title": "Qualifications of real time computer systems for PFBR\n", "abstract": " [en] Prototype Fast Breeder Reactor (PFBR) is being built at Kalpakkam. Instrumentation and Control (I and C) of PFBR are broadly classified as Safety Class 1 (SC1), Safety Class 2 (SC2) and Non-Nuclear Safety (NNS) systems. VME bus based Real Time Computer (RTC) systems and Switch Over Logic Systems (SOLS) were developed at Electronics and Instrumentation Group, IGCAR. These systems are deployed for I and C of SC1, SC2 and NNS systems. Hence qualifications of these systems for environmental tests, EMI/EMC tests, Seismic tests, Drop and topple tests were carried out. Environmental tests namely dry heat, dry cold, damp heat and temperature cycling were performed as per IS 9000 standards. EMI/EMC tests are broadly classified into Radiated Emission, Radiated immunity/Susceptibility, Conducted Emission and Conducted Susceptibility. Emission tests were carried out as per CISPR 11/22, and Susceptibility tests were carried out as per IEC 61000-4 standards. Seismic tests were performed for Operating Basis Earthquake and Safe Shutdown Earthquake conditions as per IEEE-344. Drop and topple tests were carried out as per IS 9000 standards. In this paper, test setup of RTC system, input/output simulation and test results of various tests performed are detailed.(author)", "num_citations": "1\n", "authors": ["1254"]}
{"title": "Design and development of remote terminal unit for PFBR\n", "abstract": " [en] Remote Terminal Unit (RTU) is a Microcontroller based single board computer used in all Non-Nuclear Safety (NNS) I and C systems of PFBR to acquire analog/digital signals (like voltage, signal inputs from thermocouple (K-type), leak detector (SPLD) and limit switches) and send digitized data packets over Ethernet to the nearest Local Control Center (LCC) and to generate control outputs in the form of potential free contacts during all states of the reactor operation. RTUs help in reducing cabling from large no of surface thermocouples attached with sodium pipelines and leak detectors in PFBR. It is designed to operate in extreme field conditions in various reactor buildings. The design implementation details and various RTU features are discussed in this paper.(author)", "num_citations": "1\n", "authors": ["1254"]}
{"title": "From management of organizational knowledge to management of organizational memory\n", "abstract": " Globalisation ubiquitous computing and knowledge centric view of the organization has brought knowledge management to the central stage in many organizations. Knowledge management enables organizational knowledge to grow flow and create more value in the organization. Knowledge Management is the process by which organization generates wealth from its knowledge based assets.Organizations which were initially concentrating on information management, started moving to knowledge management then to organizational memory and organizational learning. Organizational memory is the combined repository of data, information and knowledge across the organizational boundaries captured in accessible repositories. These repositories consist of documents, computers, people and culture. Any progressive organization will be continuously acquiring, updating, storing and managing the memory for making it available to all the relevant employees and improving the organizational effectiveness. Organizational learning uses organizational memory as its knowledge base. The effective utilization of organizational memory will result in organizational learning and improved organizational performance.", "num_citations": "1\n", "authors": ["1254"]}
{"title": "Training Simulators and their role in Nuclear Power Plant\n", "abstract": " Safe operation of the plant is of utmost importance in any Power Plant. The plant operators and their knowledge about the plant play a key role in safe operation of the plant. One of the most important developments in Nuclear Power Plant training methodology is the inclusion of Full Scope Replica Simulators in the training programme. Full Scope Replica Simulator is a major step towards enhancing the operator capability and significantly improving the safety of the plant. Plant Training Simulator is an effective and efficient training tool for transferring plant knowledge to the operators.This paper discusses the role of training simulators in imparting comprehensive training to the Nuclear Power Plant Operators. It includes the basic modules of the simulator, importance of each module with respect to plant, scope of training the operators etc. It also covers the various advanced technologies adopted in the system oriented training.", "num_citations": "1\n", "authors": ["1254"]}