{"title": "Authentication of smartphone users based on activity recognition and mobile sensing\n", "abstract": " Smartphones are context-aware devices that provide a compelling platform for ubiquitous computing and assist users in accomplishing many of their routine tasks anytime and anywhere, such as sending and receiving emails. The nature of tasks conducted with these devices has evolved with the exponential increase in the sensing and computing capabilities of a smartphone. Due to the ease of use and convenience, many users tend to store their private data, such as personal identifiers and bank account details, on their smartphone. However, this sensitive data can be vulnerable if the device gets stolen or lost. A traditional approach for protecting this type of data on mobile devices is to authenticate users with mechanisms such as PINs, passwords, and fingerprint recognition. However, these techniques are vulnerable to user compliance and a plethora of attacks, such as smudge attacks. The work in this paper addresses these challenges by proposing a novel authentication framework, which is based on recognizing the behavioral traits of smartphone users using the embedded sensors of smartphone, such as Accelerometer, Gyroscope and Magnetometer. The proposed framework also provides a platform for carrying out multi-class smart user authentication, which provides different levels of access to a wide range of smartphone users. This work has been validated with a series of experiments, which demonstrate the effectiveness of the proposed framework. View Full-Text", "num_citations": "86\n", "authors": ["934"]}
{"title": "A framework for cloud based e-government from the perspective of developing countries\n", "abstract": " Despite significant efforts to initiate electronic government projects, developing countries are still struggling to reap the benefits of using e-government services. An effective implementation of e-government infrastructure is necessary to increase the efficiency and transparency of the government services. There are several studies that observed causes like lack of infrastructure support, lack of payment gateway and improper e-government service delivery channel as main barriers to a wider adoption of e-government services. The main contribution of this research is to propose a cloud-based G2G (Government-to-government) e-government framework for a viable e-government solution from the perspective of developing countries. We have introduced a list of concepts and a systematic process to guide the implementation of e-government project based on the government’s vision, goals, chosen services through the service delivery channel to the appropriate cloud service and deployment model. We have used Nepal as a context of the case study and applied the framework to a real e-government project of driving licensing department using action research methodology. The results from the study show that the G2G approach of e-government implementation would be the best for providing effective government services to the stakeholders of developing countries. The proposed framework also supports a smooth integration of government services and reduces the time of the overall project. View Full-Text", "num_citations": "29\n", "authors": ["934"]}
{"title": "Jolinar: analysing the energy footprint of software applications\n", "abstract": " Monitoring energy consumption of applications is crucial for energy optimisation and improvements in software systems. With the recent emphasis on energy efficiency, it is vital that software engineers have an understanding of the energy consumed by the code they write. In this paper, we present Jolinar, a tool that bridges the gap between energy measurements and accessibility to software engineers and even end-users. The tool builds on top of recent energy models to provide an accurate, light and easy-to-use interface for energy measurements. The target audience of Jolinar is both software engineers and non-technical end-users who want to monitor their applications' energy footprint. We show that end-users can use Jolinar's GUI to determine the energy consumed by the software they are using, and software engineers can use the tool to analyse energy consumption of systems to make energy-conscious …", "num_citations": "22\n", "authors": ["934"]}
{"title": "Semantic fuzzy mining: Enhancement of process models and event logs analysis from syntactic to conceptual level\n", "abstract": " Semantic-based process mining is a useful technique towards improving information values of process models and analysis by means of conceptualization. The conceptual system of analysis allows the meaning of process elements to be enhanced through the use of property characteristics and classification of discoverable entities, to generate inference knowledge that can be used to determine useful patterns and predict future outcomes. The work in this paper presents a Semantic-Fuzzy mining approach that makes use of labels within event log about real-time process to provide a method which allows for mining and improved process analysis of the resulting process models through semantic–annotation, representation and reasoning. Qualitatively, the study shows by using a case study of Learning Process–how data from various process domains can be extracted, semantically prepared, and transformed into …", "num_citations": "14\n", "authors": ["934"]}
{"title": "Sentiment recognition from bangla text\n", "abstract": " Sentiment analysis is a very important area of the natural language processing. In general, sentiment classification means the analysis to determine the expression of a speaker whether he or she holds positive or negative opinion to a specific subject. With the rapid growth of e-commerce, sentiment analysis can greatly influence everyone in their real life. For example, product reviews on the Web have become an important source of information for customers’ decision making when they want to buy any product. As the reviews are often too many for customers to go through, how to automatically classify and detect the sentiment from them has become an important research problem. In this chapter, the authors present a Sentiment Analyzer that recognizes the Bangla sentiment or opinion about a subject from Bangla text. They construct some phrase patterns and calculate their sentiment orientation. They add tags to …", "num_citations": "14\n", "authors": ["934"]}
{"title": "Using semantic-based approach to manage perspectives of process mining: Application on improving learning process domain data\n", "abstract": " Mining useful knowledge from data readily available in today's information systems has been a common challenge in recent years as more and more events are being recorded, and there is need to improve and support many organisational processes in a competitive and rapidly changing environments. The work in this paper shows using a case study of Learning Process - how data from various process domains can be extracted, semantically prepared, and transformed into mining executable formats to support the discovery, monitoring and enhancement of real-time processes. In so doing, it enables the prediction of individual patterns/behaviour through further semantic analysis of the discovered models. Our aim is to extract streams of event logs from a learning execution environment and describe formats that allows for mining and improved process analysis of the captured data. The approach involves …", "num_citations": "13\n", "authors": ["934"]}
{"title": "Measuring energy footprint of software features\n", "abstract": " With the proliferation of Software systems and the rise of paradigms such the Internet of Things, Cyber-Physical Systems and Smart Cities to name a few, the energy consumed by software applications is emerging as a major concern. Hence, it has become vital that software engineers have a better understanding of the energy consumed by the code they write. At software level, work so far has focused on measuring the energy consumption at function and application level. In this paper, we propose a novel approach to measure energy consumption at a feature level, cross-cutting multiple functions, classes and systems. We argue the importance of such measurement and the new insight it provides to non-traditional stakeholders such as service providers. We then demonstrate, using an experiment, how the measurement can be done with a combination of tools, namely our program slicing tool (PORBS) and energy …", "num_citations": "11\n", "authors": ["934"]}
{"title": "The application of a semantic-based process mining framework on a learning process domain\n", "abstract": " The process mining (PM) field combines techniques from computational intelligence which has been lately considered to encompass artificial intelligence (AI) or even the latter, augmented intelligence (AIs) systems, and the data mining (DM) to process modelling in order to analyze event logs. To this end, this paper presents a semantic-based process mining framework (SPMaAF) that exhibits high level of accuracy and conceptual reasoning capabilities particularly with its application in real world settings. The proposed framework proves useful towards the extraction, semantic preparation, and transformation of events log from any domain process into minable executable formats – with focus on supporting the further process of discovering, monitoring and improvement of the extracted processes through semantic-based analysis of the discovered models. Practically, the implementation of the proposed …", "num_citations": "10\n", "authors": ["934"]}
{"title": "Transport of toxic metals through the major river systems of Bangladesh\n", "abstract": " [en] Bangladesh having an area of about 144,000 sq. km with a population of more than 120 millions is situated in the north eastern part of the south Asia subcontinent and a vast area to the south in the Bay of Bengal. The largest delta in the world has a largest catchment area of about 1554, 000 sq. km spread over five countries namely Bhutan, Nepal, China, India and Bangladesh. Environmental pollution usually refers to biological, chemical and physical materials introduced largely as a result of human activities. Water is one of the main source of the environmental pollution and the contamination of water by the metal ions at the trace level is generally occurred through natural process or anthropogenic sources. Buriganga, Sitalaksma, Karnafully, Bramhaputra and Jamuna were selected for the present study. The toxic metal ions concentration in water samples of various regions of different rivers were determined by ASS and GFAAS. Higher concentration of different toxic metal ions have been observed at different location of various rivers. This observation demand the need of regular monitoring of toxic metals ion concentration in different rivers especially Buriganga, Sitalaksma and Karnafully. The results of further study will reveal some important information that will certainly be useful for the GOB to instruct DOE and DPHE for the remedial measures.(author)", "num_citations": "10\n", "authors": ["934"]}
{"title": "Semantic-based model analysis towards enhancing information values of process mining: Case study of learning process domain\n", "abstract": " Process mining results can be enhanced by adding semantic knowledge to the derived models. Information discovered due to semantic enrichment of the deployed process models can be used to lift process analysis from syntactic level to a more conceptual level. The work in this paper corroborates that semantic-based process mining is a useful technique towards improving the information value of derived models from the large volume of event logs about any process domain. We use a case study of learning process to illustrate this notion. Our goal is to extract streams of event logs from a learning execution environment and describe formats that allows for mining and improved process analysis of the captured data. The approach involves mapping of the resulting learning model derived from mining event data about a learning process by semantically annotating the process elements with concepts they …", "num_citations": "9\n", "authors": ["934"]}
{"title": "Tetrabutylammonium tribromide as efficient catalyst in the synthesis of bis (indolyl) methanes\n", "abstract": " An efficient procedure has been developed for the synthesis of bis (indolyl) methane derivatives by condensation of aldehydes with indole in the presence of tetrabutylammonium tribromide as catalyst.Indoles and their derivatives are important as pharmacologically and biologically active compounds [1]. Bis (indolyl) methanes and their derivatives are widely recognized as bioactive metabolites of terrestrial and marine origin [2–6]. Significant efforts have been made to synthesize such compounds. They are usually prepared by condensation of indole with carbonyl compounds in the presence of a protic [7] or Lewis acid [8]. However, the problem in using Lewis acids is their sensitivity to moisture, and in many cases more than stoichiometric amount is required due to trapping by nitrogen-containing substrate. This problem may be avoided to some extent by using lithium perchlorate [9], but the latter is expensive, and the reaction time is longer. Some other reagents like NaHSO4–SiO2, I2, NBS, and K-10 montmorillonite were also used to catalyze the above reaction [10]. Some syntheses in the presence of rare earths, such as LnCl3, Ln (OTf) 3, and Re (PFO) 3, were recently reported as alternative of conventional Lewis acid catalysis [11, 12]. However, many of these procedures require long reaction time and large amounts of the catalyst. Ionic liquid [13] and surfactant [14] were used very recently to catalyze synthesis of bis (indolyl) methanes, but ionic liquids are expensive and the use of surfactant makes the experimental procedure very tedious.", "num_citations": "9\n", "authors": ["934"]}
{"title": "Voxel-based extraction of individual pylons and wires from lidar point cloud data\n", "abstract": " Extraction of individual pylons and wires is important for modelling of 3D objects in a power line corridor (PLC) map. However, the existing methods mostly classify points into distinct classes like pylons and wires, but hardly into individual pylons or wires. The proposed method extracts standalone pylons, vegetation and wires from LiDAR data. The extraction of individual objects is needed for a detailed PLC mapping. The proposed approach starts off with the separation of ground and non ground points. The non-ground points are then classified into vertical (eg, pylons and vegetation) and non-vertical (eg, wires) object points using the vertical profile feature (VPF) through the binary support vector machine (SVM) classifier. Individual pylons and vegetation are then separated using their shape and area properties. The locations of pylons are further used to extract the span points between two successive pylons. Finally, span points are voxelised and alignment properties of wires in the voxel grid is used to extract individual wires points. The results are evaluated on dataset which has multiple spans with bundled wires in each span. The evaluation results show that the proposed method and features are very effective for extraction of individual wires, pylons and vegetation with 99% correctness and 98% completeness.", "num_citations": "8\n", "authors": ["934"]}
{"title": "Design of hexagonal photonic crystal fiber with ultra-high birefringent and large negative dispersion coefficient for the application of broadband fiber\n", "abstract": " DESIGN OF HEXAGONAL PHOTONIC CRYSTAL FIBER WITH ULTRA-HIGH BIREFRINGENT AND LARGE NEGATIVE DISPERSION COEFFICIENT FOR THE APPLICATION OF BROADBAND FIBER", "num_citations": "8\n", "authors": ["934"]}
{"title": "Synthesis, structures and properties of novel platinum (II) acetylide complexes and polymers with tri (tolyl) phosphine as the auxiliary ligand\n", "abstract": " A new family of luminescent platinum(II) acetylide complexes and polymers were formed by the copper(I) catalyzed reaction of cis-[PtCl2(PR3)2] (R=C6H5–p-CH3) with appropriate acetylide ligands. The reaction of metal precursors with 2.5 equivalents of monoterminal acetylide ligands provided metal complexes trans-[Pt(p-tolyl3P)2(C≡C-R)2] (R=C6H4-p-NO2 (1) C6H4 -p-CH3 (2)), and equimolar amounts of diterminal ligand and metal chloride precursor, under reflux, afforded the metal poly-yne polymers [-Pt(p-tolyl3P)2C≡C–R–C≡C–]n, (R=biphenyl and 2,5-dioctyloxybenzene). Characterization of the newly developed polymer and metal complexes was accomplished by FT-IR, multinuclear NMR (1H, 31P, 13C) and mass spectrometry, as well as elemental analysis. The molecular structure of the metal complex trans-[Pt(p-tolyl3P)2(C≡CC6H4–p-NO2)2] (1) was confirmed by single crystal X-ray …", "num_citations": "8\n", "authors": ["934"]}
{"title": "Design of GaN/AlGaN HEMT class-E power amplifier considering trapping and thermal effects\n", "abstract": " A microwave class-E power amplifier using AlGaN/GaN HEMT as the switching device is reported by incorporating trapping and thermal effects in the large-signal device model. The load network of the class-E amplifier is designed by considering more realistic exponential decay of the drain current during fall time and finite quality factor of the resonant circuit to incorporate the nonidealities of the active device and passive components. With 9 V supply voltage, calculated output power and power conversion efficiency are 89 mW and 58% at 1GHz which decrease to 84 mW and 54% at 3.8 GHz, respectively for a GaN/Al/sub 0.30/Ga/sub 0.70/N HEMT with gate width of 50 /spl mu/m.", "num_citations": "8\n", "authors": ["934"]}
{"title": "Semantic-based process mining technique for annotation and modelling of domain processes\n", "abstract": " Semantic technologies aim to represent information or models in formatsthat are not just machine-readable but also machine-understandable. To this effect, thispaper shows how the semantic concepts can be layered on top of the derived models toprovide a more contextual analysis of the models through the conceptualization method.Technically, the method involves augmentation of informative value of the resulting mod-els by semantically annotating the process elements with concepts that they represent inreal-time settings, and then linking them to an ontology in order to allow for a moreabstract analysis of the extracted logs or models. The work illustrates the method usingthe case study of a learning process domain. Consequently, the results show that a systemwhich is formally encoded with semantic labelling (annotation), semantic representation(ontology) and semantic reasoning (reasoner) has the capacity to lift the process miningand analysis from the syntactic to a more conceptual level.", "num_citations": "7\n", "authors": ["934"]}
{"title": "Ontology: core process mining and querying enabling tool\n", "abstract": " Ontology permits the addition of semantics to process models derived from mining the various data stored in many information systems. The ontological schema enables for automated querying and inference of useful knowledge from the different domain processes. Indeed, such conceptualization methods particularly ontologies for process management which is currently allied to semantic process mining trails to combine process models with ontologies, and are increasingly gaining attention in recent years. In view of that, this chapter introduces an ontology-based mining approach that makes use of concepts within the extracted event logs about domain processes to propose a method which allows for effective querying and improved analysis of the resulting models through semantic labelling (annotation), semantic representation (ontology) and semantic reasoning (reasoner). The proposed method is a semantic-based process mining approach that is able to induce new knowledge based on previously unobserved behaviours, and a more intuitive and easy way to represent and query the datasets and the discovered models compared to other standard logical procedures. To this end, the study claims that it is possible to apply effective reasoning methods to make inferences over a process knowledge-base (eg the learning process) that leads to automated discovery of learning patterns and/or behaviour.", "num_citations": "7\n", "authors": ["934"]}
{"title": "Allelopathic activity of the Oxalis europea L. extracts on the growth of eight test plant species\n", "abstract": " Oxalis europea (Oxalidaceae) is an annual weed widely distributed in tropical and sub-tropical regions. A common wheat field weed, O. europea was studied to evaluate its allelopathic potential. Aqueous methanol extracts of O. europea were applied to cress, rapeseed, alfalfa, lettuce, Italian ryegrass, barnyard grass, foxtail fescue and timothy at six different concentrations to assess their effect on seedling growth. At a concentration ≥ 0.003 g dry weight equivalent extract/ml, the O. europea extracts significantly inhibited the shoot and root growth of all the test plant species with the exception of the root growth in cress. There was a significant negative correlation coefficient (R) between the concentration of the O. europea extracts and seedling length. The concentration needed to produce a growth inhibition of 50% of the all test plant species was in the range of 0.002 to 0.026 g dry weight equivalent extract/ml for …", "num_citations": "7\n", "authors": ["934"]}
{"title": "Allelopathic potential of the weed Fimbristylis dichotoma (L.) on four dicotyledonous and four monocotyledonous test plant species\n", "abstract": " Weed plants having strong allelopathic potential provide themselves with a competitive advantage in crop fields through the release of allelochemicals. Fimbristylis dichotoma, a well-known weed, was taken in the present study to evaluate its allelopathic potentiality under laboratory condition. Aqueous methanol extracts of dried F. dichotoma were applied on the seedling growth of four dicotyledonous [cress (Lepidum sativum L.), lettuce (Lactuca sativa L.), alfalfa (Medicago sativa L.) and rapeseed (Brassica napus L.)], and four monocotyledonous [Italian ryegrass (Lolium multiflorum Lam.), barnyard grass (Echinochloa crus-galli L.), timothy (Phleum pratense L.) and sand fescue (Festuca megalura Nutt.)] at four concentrations 0.01, 0.03, 0.1 and 0.3 g dry weight (DW) equivalent extract/ml. The seedling growth of all test plant species experienced an inhibition in all concentrations by the extracts of F. dichotoma and …", "num_citations": "7\n", "authors": ["934"]}
{"title": "A case study on fishing gears, fish species composition and fisher folk community at Jamuna river of sirajganj sadar fish landing site\n", "abstract": " A profilistic study on the socio-economic status of the fishermen community of Jamuna River under Sirajganj Sadar, was conducted for a period of 1 year and 6 months from August 2014 to February 2016 by employing PRP tools. A total sample of respondent was 120 families and head of the family was considered as respondents for accuracy of information. In this investigation information on fishing gears, fish diversity and social status such as education level, religion, age, occupation, housing condition, sanitary condition, electricity facilities and other facilities was studied. The surveyed result identified total 11 types on fishing net under 5 major groups of net of which Current jal, Chandi jal under the group of Gill net and Ber jal under Seine net group was responsible for large-scale caught. A total of 55 species under 44 genera and 28 families were identified from River Jamuna in the catches of different gears. Among different families Cyprinidae contributes highest number (10 species) of species and genus (7 genera) which was followed by Schilbeidae had 4 species under 4 different genera. The sociodemographic study revealed that most of the fishermen had aged 30-50 (62%) indicated middle class family. The majority of fishers are Muslim (69%). 62% fishermen were engaged in fishing as their main occupation. But, 53% had no educational knowledge. Monthly income varied from 3-25$ of fisher community. About 61% house had no electricity because of bad communication system. Social condition is not good because majority of them are landless. All of these situation can be promoted if the government and non-governmental organisation …", "num_citations": "7\n", "authors": ["934"]}
{"title": "Ion-acoustic double layers in a magnetized low-beta plasma consisting of warm adiabatic ions, non-thermal electrons and electrons with a vortex-like distribution\n", "abstract": " Ion-acoustic double layer structures propagating obliquely to an external uniform magnetic field have been considered in a low-beta plasma consisting of warm adiabatic ions, non-thermal electrons (due to Cairns et al) which generate fast energetic electrons, and electrons with a vortex-like distribution (due to Schamel), taking care of both free and trapped electrons, immersed in a uniform and static magnetic field. A combined Schamel's modified Korteweg–de Vries–Zakharov–Kuznetsov (S-KdV-ZK) equation more efficiently describes the nonlinear behavior of an ion-acoustic wave when the vortex-like velocity distribution function of electrons approaches the isothermal velocity distribution function of electrons, ie when the contribution of trapped electrons tends to zero. This combined S-KdV-ZK equation admits a double layer solution. The condition for the existence of this double layer solution has been discussed …", "num_citations": "7\n", "authors": ["934"]}
{"title": "A physics-based analytical model of a GaN/AlGaN HEMT incorporating spontaneous and piezoelectric polarization\n", "abstract": " A physics-based charge control model of an AlGaN/GaN high electron mobility transistor (HEMT) has been used to predict large- and small-signal characteristics. The 2DEG concentration in the channel is calculated using the Schrodinger equation in conjunction with the triangular quantum well approximation. Spontaneous and piezoelectric polarizations at the heterointerface and finite effective width of the 2DEG have been incorporated in the analysis. The calculated results are compared with experimental data from an Al/sub 0.15/Ga/sub 0.85/N/GaN HEMT structure to show the agreement. The model predicted a maximum drain current of 523 mA/mm and transconductance of 138 mS/mm for a device of length 1 /spl mu/m and width 75 /spl mu/m. The calculated data is compared against experimental values.", "num_citations": "7\n", "authors": ["934"]}
{"title": "GaN/AlGaN HEMT microwave class-e power amplifier\n", "abstract": " We report the first GaN/AlGaN microwave class-E power amplifier. A physics-based nonlinear model of the GaN/AlGaN HEMT is used instead of the switching models of the active device considered in previous works. The expressions of load network components of the class-E amplifier are derived considering exponential decay of the drain current during fall time and finite quality factor of the resonant circuit to incorporate the nonidealities of the active device and passive components. The class-E amplifier has been simulated using the Cadence circuit simulator using different HEMT structures. Calculated output power and power conversion efficiency are 93 mW and 72% at 1 GHz that decreases to 69 mW and 68% at 11 GHz, respectively for a 1 /spl mu/m/spl times/150 /spl mu/m GaN/Al/sub 0.25/Ga/sub 0.75/N HEMT. For a 0.12 /spl mu/m/spl times/100 /spl mu/m GaN/Al/sub 0.20/Ga/sub 0.80/N HEMT the …", "num_citations": "7\n", "authors": ["934"]}
{"title": "Temperature dependence of intermodulation and linearity in GaN based devices\n", "abstract": " Gain, intermodulation distortion of an AlGaN/GaN device operating at RF, have been analyzed using a general Volterra series representation. The circuit model to represent the GaN FET is obtained from a physics based analysis. Theoretical current-voltage characteristics are in excellent agreement with the experimental data. For a 1 /spl mu/m/spl times/500 /spl mu/m Al/sub 0.15/Ga/sub 0.85/N/GaN FET, the calculated output power, power added efficiency and gain are 25 dBm, 13% and 10.1 dB, respectively at 15 dBm input power and are in excellent agreement with the experimental data. The output referred third order intercept point IP3 is 39.9 dBm at 350 K and 33 dBm at 650 K. These are in agreement with the simulated results from Cadence which are 39.34 dBm and 35.7 dBm, respectively. At 10 GHz, third order intermodulation distortion IM3 for 10 dBm output power is -88 dB at 350 K and -82 dB at 650 K. At …", "num_citations": "7\n", "authors": ["934"]}
{"title": "A study on various applications of NLP developed for North-East languages\n", "abstract": " Language Processing (NLP) is an important research area and application in computer science and computational linguistics, which explores how a computer can be used to understand and manipulate the text or speech of natural languages to do useful things. A small number of research or applications of NLP has been done for North-East (NE) languages in India. In this paper, we discuss the five most important as well as one of the major applications of NLP which are developed for NE natural languages and frequently used in human life namely, Electronic Dictionary (E-dictionary), Machine Translation (MT), Part of Speech Tagging (POST), Wordnet and Word Sense Disambiguation (WSD). These applications are very helpful and form an intermediate and necessary step towards implementation of higher applications of NLP. Since NE is a multilingual region in India; therefore these applications will be basically helpful for NE people as well as other people of India and abroad. The main purpose of this paper is to explore the importance, techniques, features of E-dictionary, MT, POST, Wordnet and WSD and to review the existing works of these applications developed for NE natural languages in India.", "num_citations": "6\n", "authors": ["934"]}
{"title": "Investigation of peste des petits ruminants outbreaks in goat farms of Chuadanga District of Bangladesh in 2014\n", "abstract": " A case-control study was conducted in Chuadanga district of Bangladesh to investigate risk factors for Peste des petits ruminants (PPR) that occurred during November-December 2014 in goat farms. A total of 37 farms were reported to be PPR cases based on active and passive surveillance from 4 villages of Chuadanga Sadar and Damurhuda sub-districts. Fifty-five control-farms were selected from the same 4 villages. Farmers of both case and control farms were interviewed using a pre-tested semi-structured questionnaire for data collection on potential risk factors. Logistic regression analysis was used to evaluate the association between potential risk factors and disease outcome. Focus group discussions with farmers and livestock personnel in the selected villages were conducted using participatory epidemiological (PE) approach to identify issues with PPR in the villages. The results showed that 27% of the case-farms (n= 10) were vaccinated, 60%(n= 6) of which were vaccinated two times and 40%(n= 4) single time in a year. About 50%(n= 20) farms used perch/macha and the other 50% used mud type of housing. The morbidity and case-fatality rate in case-farms were 15.49%, 54.54%, respectively. Adoption of single time annual vaccination and using perch/macha housing were significant protective factors (OR= 0.03, 95% CI= 0.008-0.1, p< 0.001; OR= 0.29, 95% CI= 0.11-0.74, p= 0.004 respectively). Vaccination done twice in a year significantly lowered infection when compared to one time vaccination (OR= 0.21, 95% CI= 0.05-0.79, p= 0.02). The results from PE showed that proper labeling of PPR vaccines, logistics for mass …", "num_citations": "6\n", "authors": ["934"]}
{"title": "Prevalence of microflora and potentially toxigenic fungi in poultry feed mixtures\n", "abstract": " Eight different commercial poultry feeds obtained from their trade outlets in Dhaka city, was studied to determine the degree of risk of the occurrence of selected bacteria and microscopic fungi. Recorded results indicated that the bacterial count was higher in Broiler (3.9 x 103) cfu/g and it was relatively lower in Mash (1.6 x 102) cfu/g. Added to this; fungal count was highest in Starter (7.5 x105) cfu/g and least in Pellets (1.8 x103) cfu/g. Elevated number of pathogenic bacteria was found in feed samples while the majority (66.7%) of the microbial contaminants were detected as Gram negative rods,. The most common fungal genera detected in tested samples included, Penicillin, Aspergillus, Fusarium, Alternaria, Rhizopus and Mucor. Microorganisms require nutrients as source of energy for the production of ATP. Results of Mineral analysis indicated that the feed samples contain essential nutrients including Na+, K+, Ca2+, Mg 2+ and P. Proximate composition revealed the presence of moisture, ash, fat, protein contents and crude fibre. These data provide a clear insight that a Hazard Analysis Critical Control Point (HACCP) program should be instituted for the animal feed industry to reduce the risk of microbial contamination as well as potential human health hazards.", "num_citations": "6\n", "authors": ["934"]}
{"title": "Development of electric stove for the smart use of solar photovoltaic energy\n", "abstract": " Domestic gas supply for cooking in under developed countries is facing terrible insufficiency for last few years. Vehicles, being run by natural gas have mostly influenced the dearth. Electricity production in these countries is always inadequate and it is not a good solution either. Use of renewable energy can help the cause and also contribute for the energy generation. To solve this problem an electric stove was developed and later on experiment was done with it and finally analyzed to check its compatibility in real market. For this stove, solar photovoltaic (PV) energy will provide the electrical energy required for cooking. For the experimental purpose stove was developed by testing, analyzing and payback calculation. This paper discusses in details about each stairs. On-field tests and lab tests are also verified here. For testing its feasibility, a case study is also included in this paper.", "num_citations": "6\n", "authors": ["934"]}
{"title": "Experimental cross section for the 152Sm (n, γ) 153Sm reaction at 0.0334 eV\n", "abstract": " The neutron capture cross section for the 152Sm(n,  γ)153Sm reaction at an energy of 0.0334 eV was measured for the first time using monochromatic neutrons of a powder diffractometer at the TRIGA Mark II nuclear reactor at Dhaka, Bangladesh. The 197Au(n,  γ)198Au reaction was used to monitor the neutron beam intensity. The radioactivity of the products was determined via high resolution γ-ray spectrometry. The obtained cross section value is 184 ± 22 b, which is consistent with both the ENDF/B-VII and TENDL-2012 data libraries. The measured value at 0.0334 eV and the previous data at 0.0536 eV confirm the reliability of the data in the above libraries.", "num_citations": "6\n", "authors": ["934"]}
{"title": "Prevalence of microalbuminuria and overt proteinuria in hypertension and their relations with renal function in a rural population of Bangladesh\n", "abstract": " Hypertension is the third leading cause of chronic kidney disease (CKD) in Bangladesh. Microalbuminuria and overt proteinuria are the markers of the CKD. So detection of microalbuminuria and overt proteinuria in hypertensive subjects will help to identify the patient at risk of developing progressive renal impairment. This cross sectional study was carried out in a rural area of Bangladesh. 1134 adult population (age between 18 and 65 years) were screened. A total of 217 (19.1%) were detected hypertensive; spot urine dipstick test was done among them. Those who where dipstick negative further studied for presence of microalbumin [mg/L]. Blood glucose level, serum creatinine, and estimated glomerular filtration rate (eGFR) were evaluated. A group of normotensive people (n= 245) taken as comparison group. Microalbuminuria and overt proteinuria were present in 26.4% and 9.7% of the hypertensive subjects, respectively. Correlation between microalbuminuria and eGFR showed that two variables exhibited a tendency for negative relationship, although correlation was not statistically significant (P= 0.186, r=-0.064). Overt proteinuric subjects showed no statistically significant deterioration of eGFR (81.6±21.1). Microalbuminuria and overt proteinuria are prevalent among the hypertensive rural Bangladeshi people. So early detection of microalbuminuria and overt proteinuria will help to prevent or delay the development of end stage renal disease.", "num_citations": "6\n", "authors": ["934"]}
{"title": "Synthesis and characterization of Fe-doped hydroxyapatite\n", "abstract": " Fe-doped hydroxyapatite bio-ceramic material has been successfully synthesized by wet chemical precipitation method using waste egg shell as Ca precursor and (NH 4) 2 HPO 4 as P precursor. Two different concentrations of doping solutions (0.1 M and 0.05 M) were chosen and the developed apatite was characterized by using FT-IR, XRF, XRD and SEM techniques. Observed data were in excellent agreement with the standard values for hydroxyapatite which indicated successful formation of the Fe-doped apatite of different concentrations.", "num_citations": "6\n", "authors": ["934"]}
{"title": "An exact analysis of Class-E power amplifiers for RF communications\n", "abstract": " An exact analytical approach to the design of a Class-E high frequency power amplifier is presented. The analysis will optimize the load network parameters at the output of the switching transistor, while accounting for harmonics injected into the circuit from the choke inductor, finite quality factor of the output load network, and an exponential decay of the drain/collector current during OFF state. Calculated power performances in terms of efficiency and Total Harmonic Distortion (THD) as a function of decay angle and finite choke inductance are presented.", "num_citations": "6\n", "authors": ["934"]}
{"title": "Monolithically integrated Si/SiGe resonant interband tunneling diodes/CMOS MOBILE latch with high voltage swing\n", "abstract": " The Si/SiGe RITDs grown by MBE have been monolithically integrated with CMOS for the first time. The integrated devices resulted in a PVCR (peak-to-valley current ratio) of 2.8 at room temperature, showing promise towards the realization of RITD/CMOS circuitry. A RITD-NMOS MOBILE latch has been demonstrated in Si. This logic element enables digital and ternary circuit design for high density storage. The I-V characteristics of the integrated CMOS/RITD devices and I/sub D/-V/sub D/ characteristics of NMOS and PMOS have been studied.", "num_citations": "6\n", "authors": ["934"]}
{"title": "Comparative study of the effect of β-blockers with different pharmacological properties on cholesteryl ester formation in mouse peritoneal macrophages\n", "abstract": " The effect of three β-blockers: non-selective (propranolol), β1-selective (metoprolol), and with intrinsic sympathomimetic activity (pindolol), was investigated on 14C-oleic acid incorporation into cholesteryl esters in mouse peritoneal macrophages. Incorporation of 14C-oleic acid into cholesteryl esters was reduced about 10-fold by propranolol at 10−4 M while incorporation into triacylglycerols was only 30% decreased at the same concentration. Metoprolol and pindolol had no significant effect on 14C-oleic incorporation into cholesteryl esters or triacylglycerols. Finally, propranolol inhibited the acylcoenzyme A: cholesterol-O-acyltransferase activity, measured in vitro on macrophages homogenates, while the other studied β-blockers were ineffective. These results suggest that propranolol could antagonize cholesteryl ester accumulation by macrophages, one of the main processes involved in atherogenesis.", "num_citations": "6\n", "authors": ["934"]}
{"title": "Prolonged photoperiod inhibits growth and reproductive functions of rohu Labeo rohita\n", "abstract": " Among the environmental factors, photoperiod plays an important role in growth and reproduction of fish. This study was conducted to assess the effects of photoperiod on growth of juveniles and reproductive functions of matured female rohu (Labeo rohita), a commonly cultured freshwater fish species. Two experiments were conducted each with three different photoperiod treatments, such as 6 h of light and 18 h of dark (06L:18D), 12 h of light and 12 h of dark (12L:12D), and 18 h of light and 6 h of dark (18L:06D), each treatment with three replications. In the first experiment, fingerlings (2.39 ± 0.35 g BW, 6.67 ± 1.23 cm TL) were exposed in the three photoperiod conditions for 30 days and sampled fishes were sacrificed on 7, 15 and 30 days of exposure to measure growth parameters (weight gain (g); percent weight gain; specific growth rate, SGR and feed conversion ratio, FCR) and major hemato …", "num_citations": "5\n", "authors": ["934"]}
{"title": "Effects of intravenous hydration on risk of contrast induced nephropathy and in-hospital mortality in STEMI patients undergoing primary percutaneous coronary intervention: a …\n", "abstract": " The role of intravenous hydration at the time of primary percutaneous intervention (PCI) for ST-segment elevation myocardial infarction (STEMI) remains unclear. Guidelines are vague, supported by low level evidence, and hydration is used less often than other clinical settings.To perform a systematic review and meta-analysis of all randomized controlled trials assessing intravenous hydration compared with non-hydration for prevention of contrast induced nephropathy (CIN) and In-hospital mortality in patients with STEMI undergoing primary PCI. Medline, EMBASE and the Cochrane Register were searched to September 2018. Included studies reported the incidence of CIN, In-hospital mortality, requirement for dialysis and heart failure. Relative risks with 95% confidence intervals (CIs) for individual trials were pooled using a random effects model. Three moderate quality trials were identified including 1074 patients. Overall, compared with no hydration, intravenous hydration significantly reduced the incidence of CIN by 42% (RR 0.58; 95% CI: 0.45 to 0.74, p < 0.001). The estimated effects upon all-cause mortality (RR 0.56; 95% CI: 0.30 to 1.02, p = 0.057) and the requirement for dialysis (RR 0.52, 95% CI 0.14–1.88, p = 0.462) were not statistically significant. The outcome of heart failure was not consistently reported. Intravenous hydration likely reduces the incidence of CIN in patients with STEMI undergoing primary PCI. However, for key clinical outcomes such as mortality, heart failure and dialysis the effect estimates were imprecise. Further high quality studies are needed to clarify the appropriate volume of fluid and effects on outcomes.", "num_citations": "5\n", "authors": ["934"]}
{"title": "Analysis of obfuscated code with program slicing\n", "abstract": " In Man-At-The-End (MATE) attacks, software apps run on a device under full control of the attackers: they can violate the intellectual property of the app by means of malicious reverse engineering, software piracy, and software tampering. Obfuscation is a technique that is widely adopted by developers to mitigate this problem. Obfuscation increases complexity of software code, by obscuring the structure of code and data in order to thwart the reverse engineering process. However, it is possible to reverse engineer obfuscated code with time, determination and the right tools. In general, there is no accepted methodology to determine the strength of obfuscated code; however resilience is often considered a good metric as it indicates the percentage of obfuscated code that cannot be removed by automated de-obfuscation tools. We introduce a novel approach to measure the resilience of obfuscated C code using …", "num_citations": "5\n", "authors": ["934"]}
{"title": "Ceftriaxone resistance patterns of uropathogens isolated from urinary tract infection patients in selected areas of Dhaka city, Bangladesh\n", "abstract": " Antibiotic resistance is one of the biggest threats to global health, food security, and development today. Antibiotic resistance can affect anyone, of any age, in any country. Antibiotic resistance occurs naturally, but misuse of antibiotics in humans and animals is accelerating the process. A growing number of infections are becoming harder to treat as the antibiotics used to treat them become less effective. Antibiotic resistance leads to longer hospital stays, higher medical costs and increased mortality. Our aim was to assess the susceptible pattern of Ceftriaxone of 3rd generation cephalosporin antibiotic against uropathogens. A total of 12943 urine samples were collected in 2016 (Jan-Dec) and out of which 1236 (9.55%) were bacteriologically positive. Among the isolated uropathogens, 95.1% were gram negative and 4.9% gram positive organism. Male were found more prone to get UTI under 10 years and between 51-90 years of age and females were more affected in 10 to 50 years and over 90 years of age group. E. coli was the most prevalent (83.9%) isolate followed by Klebsiella spp (6.7%), Staphylococcus aureus (2.6%), Pseudomonas spp.(2.2%), Enterococcus spp.(2.0%) and Proteus spp.(1.1%). The most predominant organism Acinetobacter spp.(100%) were found sensitive to Ceftriaxone in both male & female patients and Enterococcus spp. in male (62.5%) & Streptococcus Group B in female (100%) were found resistant. Around (59.9%) males and (44.7%) females were found resistant to Ceftriaxone against E. coli.", "num_citations": "5\n", "authors": ["934"]}
{"title": "Risk assessment of chromium levels in broiler feeds and meats from selected farms of Bangladesh\n", "abstract": " The present study was conducted to evaluate the status of chromium concentration in broiler feeds with the risk assessment of chromium in broiler meat. Seven broiler farms were selected to collect the feed and meat samples of broiler. Atomic absorption spectrophotometer (AAS) was used to determine the chromium concentration in broiler feed and meat samples. The highest concentration of chromium in broiler meat samples was 1.31±0.20? g/g and in feed samples was 1.71±0.24? g/g. In this study, the mean (±SE) concentration of chromium in feed samples from Gazipur Sadar, Gazipur; Sreepur, Gazipur and Tangail Sadar, Tangail were 1.71 (±0.24)? g/g, 1.64 (±0.61)? g/g and 1.64 (±0.61)? g/g respectively. The mean (±SE) concentration of chromium in meat samples from Gazipur Sadar, Gazipur; Sreepur, Gazipur and Tangail Sadar, Tangail were 1.139 (±0.26)? g/g, 1.31 (±0.20)? g/g and 0.61 (±0.23)? g/g respectively. The concentrations of chromium in broiler edible tissues were much higher than permissible levels determined by FAO and WHO. Precocious steps must be taken to avoid use of such health hazardous concentrations of heavy metals in poultry feeds. Considering these findings, there is a critical need to set legal limits and surveillance system for detection of heavy metals in poultry industry of Bangladesh.", "num_citations": "5\n", "authors": ["934"]}
{"title": "An English to Assamese, Bengali and Hindi Multilingual E-Dictionary\n", "abstract": " Dictionary is a very demandable components of Natural Language Processing system nowadays. A dictionary is one of the important tools that can be used for learning new languages. A word is basically an association of linguistic sound and meaning. The spelling does not always easily correlate with the sound of a word. A dictionary helps us both with the spelling and pronunciation of such words. Electronic dictionaries are very popular nowadays. It can be accessed by many users simultaneously on online. The main objective of this paper is to develop an English to Assamese, Bengali and Hindi (E-ABH) multilingual electronic dictionary in such a way that it is user friendly dictionary and user can easily look up the meaning of word and other related information of the word like word Id, POS, synonyms and examples from English to Assamese, Bengali and Hindi languages. This dictionary will be beneficial and must be improved the knowledge of Assamese, Bengali, English and Hindi languages basically for people of North-East India.", "num_citations": "5\n", "authors": ["934"]}
{"title": "Development of multilingual assamese electronic dictionary\n", "abstract": " Language is the most important aspect in the life of all human beings. A language is one of the most important and effective modes of communication between the people belonging to different communities and cultures. The language acts as a bridge among us and helps in creating a bond among our cultures. Therefore, to learn mother language as well as other new languages is very important for us. The dictionary is one of the important tools that can be used for learning new languages. A word is basically an association of linguistic sound and meaning. The spelling does not always easily correlate with the sound of a word. A dictionary helps us both with the spelling and pronunciation of such words. Electronic dictionaries are very popular nowadays and many users can be accessed simultaneously on Online. This paper describes the Development of Multilingual Assamese Electronic Dictionary (MAED). The MAED contains four languages, namely Assamese, Bengali, English and Hindi. We have developed Assamese-Bengali, English and Hindi (A-BEH) Dictionary in MAED. The A-BEH Dictionary is a user friendly dictionary and user can easily look up the meanings of words and other related information of the words like word Id, POS, synonyms and examples from Assamese language to Bengali, English and Hindi languages on Online. This dictionary will be beneficial for Assamese people as well as other people living in India.", "num_citations": "5\n", "authors": ["934"]}
{"title": "Phase evolution in the AuCu/Sn system by solid-state reactive diffusion\n", "abstract": " The interfacial reactions between several Au(Cu) alloys and pure Sn were studied experimentally at 200°C. Amounts of Cu in the AuSn4 and AuSn2 phases were as low as 1 at.%. On the basis of these experimental results there is no continuous solid solution between (Au,Cu)Sn and (Cu,Au)6Sn5. The copper content of (Au,Cu)Sn was determined to be approximately 7–8 at.%. Substantial amounts of Au were present in the (Cu,Au)6Sn5 and (Cu,Au)3Sn phases. Two ternary compounds were formed, one with stoichiometry varying from (Au40.5Cu39)Sn20.5 to (Au20.2Cu59.3)Sn20.5 (ternary “B”), the other with the composition Au34Cu33Sn33 (ternary “C”). The measured phase boundary compositions of the product phases are plotted on the available Au–Cu–Sn isotherm and the phase equilibria are discussed. The complexity and average thickness of the diffusion zone decreases with increasing Cu …", "num_citations": "5\n", "authors": ["934"]}
{"title": "Earthquake vulnerability assessment of schools and colleges of Sylhet, a North-Eastern city of Bangladesh\n", "abstract": " Sylhet, the north-eastern divisional city of Bangladesh, is one of the most earthquake prone areas of the country. In this paper, seismic vulnerability of the educational institutions of Sylhet city has been assessed. Rapid Visual Screening (RVS) and Modified Turkish Method have been used to evaluate the seismic vulnerability of the existing school and college buildings of the city. More than fifty schools and colleges have been surveyed with an objective to identify the most vulnerable buildings, so that retrofitting measures can be conducted easily. The field observation including soil condition, zone type, apparent quality and structural state has been reported. After the walk down evaluation, preliminary assessment is carried out as it is essential for final structural and non-structural evaluation. From the study it was found that, 7.55%, 9.31% and 11.36% surveyed buildings are highly vulnerable to earthquake when existence of any fault is within 9-15 km, 5-8 km and less than 4 km respectively from the position of the building. At the end of the paper, some recommendations have been provided that might be followed to minimize structural damage of existing school and college buildings.", "num_citations": "5\n", "authors": ["934"]}
{"title": "Growth parameter dependence of gain compression in AlGaN/GaN HFETs\n", "abstract": " The dependence of gain compression on the Al-mole fraction and the thickness of the AlGaN barrier layer are reported for typical undoped supply layer AlGaN/GaN HFETs using a physics-based model. The gain compression is calculated using a large signal circuit model. The intrinsic circuit parameters are extracted from a physics-based model that self-consistently solves the Schrödinger and Poisson's equations to determine the 2DEG concentration in the channel including the effects of both spontaneous and piezoelectric polarization present in the AlGaN barrier and the underlying GaN layers. Transport parameters are obtained by ensemble Monte Carlo simulation and device non-linearity is addressed using Volterra series analysis. With AlGaN barrier thickness increasing from 100 to 250 Å, the 1 dB gain compression point ranges from 5 to 22 dBm of input power at 300 K for 0.25 × 100 μm Al0.20Ga0.80N …", "num_citations": "5\n", "authors": ["934"]}
{"title": "L1 influence on the spoken English proficiency of Bengali speakers\n", "abstract": " 1.1 Background: Influence of L1 in learning a second language has largely been addressed in the major research domain of Contrastive Analysis and Language Transfer. The field of Language Transfer has a long history of research data. Gass & Selinker quote from Lado (1957, p. 2)… that individuals tend to transfer the forms and meanings, and the distribution of forms and meaning of their native language and culture to the foreign language and culture---both productively when attempting to speak the language and to act in the culture, and receptively when attempting to grasp and understand the language and the culture as practiced by the natives\"(Gass & Selinker, 1994 p. 1).1.1. 1 Contrastive Analysis: This view of Lado gave to the rise of famous empirical studies in Contrastive Analysis (CA). Gass & Selinker (1994, p. 2) comment about Lado's definition of Contrastive Analysis. Contrastive analysis is a way of comparing and contrasting various linguistic features of two languages for example sound systems, grammatical structures, vocabulary systems, writing systems and above all cultural aspects of two languages. Results from contrastive analysis are valid and can be accepted but there are difficulties in interpreting this CA hypothesis in relation to learners’ behaviours. For example, an English speaking", "num_citations": "5\n", "authors": ["934"]}
{"title": "Association of autoimmune chronic active hepatitis and acquired erythroblastopenia cured by cyclophosphamide\n", "abstract": " To the best of our knowledge this is the reported first case of the successive occurrence in the same patient of chronic active hepatitis and acquired pure red cell aplasia, both probably of autoimmune origin. The diagnosis of autoimmune hepatitis was based on the presence of characteristic lesions at the examination of the liver biopsy specimen, high titer of anti-smooth muscle antibodies in the serum, and remission obtained by steroid therapy. Erythroid aplasia, which appeared during the course of this treatment, was revealed by a regenerative anemia (4.4 g Hb/100 ml) and proved by bone marrow aspiration and biopsy. In vitro bone marrow culture was normal, suggesting the in vivo presence of an inhibitor of erythroblastic differentiation. Red cell aplasia was cured by cyclophosphamide (100 mg/day during 56 days). No recurrence was noted until the death of the patient, which occurred one year later, due to hepatic cholangiocarcinoma. Action of cyclophosphamide on the pure red cell aplasia suggested the immune origin of this disease. The liver and the bone marrow erythroid lineage have probably been the successive targets of immunologic dyscrasia.", "num_citations": "5\n", "authors": ["934"]}
{"title": "Recuperation patterns in fish with reference to recovery of erythrocytes in Barbonymus gonionotus disordered by an organophosphate\n", "abstract": " Organophosphate pesticides are extravagantly used in worldwide context to get rid of insects. Due to their relevance and edges in agriculture, organophosphate pesticide can effortlessly stretch to the aquatic ecological units and, correspondingly, cause threats to aquatic animals, like fish. Profenofos could be a diligent and cytotoxic organophosphate pesticide. Animals become liable to profenofos by means of water and food. Present experiment determines toxicological impacts of profenofos through the in vivo presentation of silver barb (Barbonymus gonionotus) to 1/10th and 1/2 of the median lethal concentration (LC50) of profenofos as sublethal exposures for variable periods (7, 15, and 30 days). Succeeding recuperation arrays were additionally appraised yielding the exposed fish in tap water (without profenofos) for the identical time as they had been treated with profenofos. The study findings showed …", "num_citations": "4\n", "authors": ["934"]}
{"title": "May Measurement Month 2017: an analysis of blood pressure screening results from Australia—South-East Asia and Australasia\n", "abstract": " Increased blood pressure (BP) is the single biggest contributing risk factor to the global disease burden. May Measurement Month (MMM) is a global initiative of the International Society of Hypertension aimed at raising awareness of high BP. In Australia, hypertension affects around six million adults and continues to remain the greatest attributable cause of cardiovascular mortality and morbidity (48.3%), stroke deaths (28%), and kidney disease (14%). An opportunistic cross-sectional survey was carried out during May 2017 predominantly in capital cities across Australia which included adult volunteers. Blood pressure measurement, the definition of hypertension and statistical analysis followed the standard MMM protocol. Additional information obtained included anthropometric data and responses to questionnaires on demographic, lifestyle, and environmental factors. Data were collected from 3817 …", "num_citations": "4\n", "authors": ["934"]}
{"title": "Anticancer, antimicrobial and antioxidant potential of sterically tuned bis-N-heterocyclic salts\n", "abstract": " The current study was conducted to evaluate the antimicrobial, antioxidant, antileishmanial and cytotoxic potential of designed derivatives of 1,1′-(1,3-phenylenebis(methylene))bis(3-alkyl/aryl-1H-benzimidazol-3-ium) salts. The antibacterial potential of the test compounds was investigated against Staphylococcus aureus, Pseudomonas aeruginosa and two methicillin-resistant S. aureus (MRSA) strains (MRSA10, MRSA11), where compound 6 showed the best results. For brine shrimp lethality bioassay (BSLB), compound 6 again showed up to 100% mortality at 200 μg/mL and 56.7% mortality at 6.25 μg/mL. Antileishmanial assay was performed against Leishmania tropica at 20 μg/mL dosage, where 6 showed the most promising activity with 16.26% survival (83.74% mortality; IC50=14.63 μg/mL). The anticancer potential of the selected benzimidazole derivatives was evaluated against two selected cell lines …", "num_citations": "4\n", "authors": ["934"]}
{"title": "Construction of English-Bodo parallel text corpus for statistical machine translation\n", "abstract": " Corpus is a large collection of homogeneous and authentic written texts (or speech) of a particular natural language which exists in machine readable form. The scope of the corpus is endless in Computational Linguistics and Natural Language Processing (NLP). Parallel corpus is a very useful resource for most of the applications of NLP, especially for Statistical Machine Translation (SMT). The SMT is the most popular approach of Machine Translation (MT) nowadays and it can produce high quality translation result based on huge amount of aligned parallel text corpora in both the source and target languages. Although Bodo is a recognized natural language of India and co-official languages of Assam, still the machine readable information of Bodo language is very low. Therefore, to expand the computerized information of the language, English to Bodo SMT system has been developed. But this paper mainly focuses on building English-Bodo parallel text corpora to implement the English to Bodo SMT system using Phrase-Based SMT approach. We have designed an E-BPTC (English-Bodo Parallel Text Corpus) creator tool and have been constructed General and Newspaper domains English-Bodo parallel text corpora. Finally, the quality of the constructed parallel text corpora has been tested using two evaluation techniques in the SMT system.", "num_citations": "4\n", "authors": ["934"]}
{"title": "Ontology-driven activity recognition from patterns of object use\n", "abstract": " The recognition of the activities of daily living of the elderly and the cognitively impaired has made it possible to provide assistance and support for them. We describe in this paper activity recognition from patterns of object use for activities and a combined activity ontology. Activity-object use patterns are discovered to provide the knowledge of object concepts for routine activity concepts for an enhanced ontology-driven activity recognition.", "num_citations": "4\n", "authors": ["934"]}
{"title": "Process Models Discovery and Traces Classification: A Fuzzy-BPMN Mining Approach.\n", "abstract": " The discovery of useful or worthwhile process models must be performed with due regards to the transformation that needs to be achieved. The blend of the data representations (ie data mining) and process modelling methods, often allied to the field of Process Mining (PM), has proven to be effective in the process analysis of the event logs readily available in many organisations information systems. Moreover, the Process Discovery has been lately seen as the most important and most visible intellectual challenge related to the process mining. The method involves automatic construction of process models from event logs about any domain process, and describes causal dependencies between the various activities as performed within the process execution environment. In principle, one can use process discovery to obtain process models that describes reality. To this end, the work in this artcle presents a Fuzzy …", "num_citations": "4\n", "authors": ["934"]}
{"title": "A novel tool for reducing time and cost at software test estimation: An use cases and functions based approach\n", "abstract": " This paper represents a software test estimation tool, which is clearly defined to understand, that provides the estimated time as well as the cost of any software test project. There are different estimation tools for software development process [8] and those are well recognized. But there are lacks of standard tools for estimation of Software Test phase. Therefore, the researchers designed and applied this novel tool on 5 case projects, namely Climate Resilient Ecosystems and Livelihood (CREL), Management Accounts Consolidation System for Line Director (LDMACS), PBI Works Management System Software, PBI Mobile Apps and Human Resources Management System (HRMS), in order to determine the time and cost of those projects. Since few software test estimation tools are available in the market, however, this paper would be fruitful for the software industry to explore the time and cost of any real software …", "num_citations": "4\n", "authors": ["934"]}
{"title": "Intra household labour distribution and role of women in family decision making process\n", "abstract": " A study on intra-household labor distribution and role of women in family decision making process was conducted over a period of 3 months with respect to sample 1 (S-1) single family with two children (children age around 12 years), sample 2 (S-2) joint family with husband and wife, brother-sister, father mother and children, sample 3 (S-3) joint family, husband-wife, brother-sister, father-mother and children (with primary education in any one). Total 30 families (10 from each sample) were assessed in terms of labor distribution in productive, reproductive, community & other works, role of women in family decision making process and work load after joining in to SHABGE-DFID project. Male members from all samples were spent more time in productive works and they have negligible role in reproductive works. The female members were spent more time in reproductive works. They were also spent remarkable time in productive works and little bit in community works. The female members from sample 1 were spent more time for various works in a day than other samples. The female members in sample 3 were spent less time than other samples and it is due to their consciousness (for their primary education). Among all the samples workload increased after joining in SHABGE-DFID project. They were managed this work load by taking help from husband and children (incase of sample 2&3). After joining in the SHABGE-DFID project 50% female from sample (1&2) were took part in family decision making process ie they were involved in family decision making process actively. After completion of the project the family members would be aware …", "num_citations": "4\n", "authors": ["934"]}
{"title": "Talk-shows of Bangla vision: in the notion of power-play\n", "abstract": " Since my childhood, I was interested in the field of media. When I was admitted to the Department of English and Humanities of BRAC University, I came to know about the\" Media and Cultural Studies\" concentrations that the department offered. I chose\" Media and Cultural Studies\" as my major area of study with the hope to know about the field of media more closely. While I was studyingMedia and Cultural Studies', I found some interesting courses likeGlobalization and Media',English for Print Media',Translation Studies',Cultural Studies': Theory and Practice,Copy-Writing', etc which made me interested to work in media. When the time of my internship came, I chose to work in the program department of any TV channel in order to exercise my knowledge and creativity.I joined BanglaVision, a fairly new TV channel of Bangladesh, which has already become quite popular, as an intern on 18th September, 2011. My responsibility was to work as an Assistant Producer in twolive'shows. Besides, I also gave background voice to some programs during my internship.", "num_citations": "4\n", "authors": ["934"]}
{"title": "An Experimental Analysis of Random Early Discard (RED) Queue for Congestion Control\n", "abstract": " Active Queue Management (AQM) is receiving wide attention as a promising technique to prevent and avoid congestion collapse in packet-switched networks. By providing advanced warning of incipient congestion, end nodes can respond to congestion before router buffer overflows and hence ensure improved performance. Random Early Discard (RED) is an IETF recommended active queue management scheme that is expected to provide several Internet performance advantages such as minimizing packet loss and router queuing delay, avoiding global synchronization of sources, guaranteeing high link utilization and fairness. It tends to drop packets from each connection in proportion to the transmission rate the flow has on the output link. It does not minimize the number of dropped packets as expected, but it manages to achieve improved performance when compared to the Tail Drop. In this paper, extensive experimental analysis has been carried out on RED using Network Simulator (NS-2) in relation to congestion control and decision has been settled where RED can perform better.", "num_citations": "4\n", "authors": ["934"]}
{"title": "Alternative ion-acoustic solitary waves in magnetized low beta plasma consisting of warm adiabatic ions, nonthermal electrons, and electrons having a vortexlike distribution\n", "abstract": " The solitary wave structures of the ion-acoustic waves propagating obliquely to an external uniform magnetic field have been considered in a low beta plasma consisting of warm adiabatic ions, nonthermal electrons, due to Cairns et al. [Geophys. Res. Lett. 22, 2709 (1995)], which generates the fast energetic electrons and electrons having a vortexlike distribution, due to Schamel [Plasma Phys. 13, 491 (1971); 14, 905 (1972)], taking care of both free and trapped electrons, immersed in a uniform static magnetic field. The nonlinear dynamics of ion-acoustic waves in such a plasma is shown to be governed by Schamel’s modified Korteweg–de Vries–Zakharov–Kuznetsov equation. When the coefficient of the nonlinear term of this equation vanishes, the vortexlike velocity distribution function of electrons simply becomes the isothermal velocity distribution function of electrons and the nonlinear behavior of the same ion …", "num_citations": "4\n", "authors": ["934"]}
{"title": "Maternally-derived antibody and seroconversion to infectious bronchitis virus in chicken\n", "abstract": " An investigation was conducted with a view to determining the persistence of maternally-derived antibody (MDA) against infectious bronchitis virus (IBV) in chicks as well as seroconversion of IBV in relation to age and gender of chicks in field condition. Determination of antibody titre was performed by indirect enzymelinked immunosorbent assay (iELISA). The existence of MDA was calculated in Group A (n= 20) and Group B (n= 15) originating from parents vaccinated against IBV and with no such history respectively. In case of group A, titres of serum samples obtained were 5361.23±854.09, 2567.58±763.61, 808±751.361, 432.29±47.11, 178.36±88.28, 184.58±93.6, 80.89±70.11 and 43.55±32.92 on day 1, 5, 9, 13, 17, 21, 25 and 29 days aged birds respectively. On the other hand, sera samples of group B manifested a titre of 3285.18±685.03, 2219.16±419.77, 1783.62±219.84, 589.01±249.63, 186.66±88.21, 178.36±202.02, 105.77±75.69 and 41.34±69.28 on same schedule. It was further revealed that chicks with ancestor of non-vaccinated parents showed higher MDA titre up to 9th day of age. This might have happened due to exposure of field virus to the parent birds. As regards seroconversion, it was observed that 100, 20 and 80% of serum samples collected from chickens of 0-2 weeks, 3-4 weeks and 4 months of age were positive to IBV specific antibody respectively, whereas no serum sample was positive in case of 5-7 weeks aged birds. When considered the gender of birds, it was revealed that sera from the female showed 58.33% seropositivity against 25% from male. Maternally-derived antibody (MDA) might protect the chickens up …", "num_citations": "4\n", "authors": ["934"]}
{"title": "Large-signal modeling of GaN FET and nonlinearity analysis using Volterra series\n", "abstract": " A large-signal model is reported to investigate the nonlinearities of a GaN MESFET. The model developed accounts for the observed current collapse and frequency dispersion of output resistance and transconductance and uses Volterra series technique to determine the nonlinearities. Calculated f/sub T/ and f/sub max/ of a 0.8 /spl mu/m/spl times/150 /spl mu/m GaN MESFET are 6.5 GHz and 13 GHz, respectively, and are in close agreement with their measured values of 6 GHz and 14 GHz, respectively. For a 1.0 /spl mu/m/spl times/150 /spl mu/m FET operating at 1 GHz, 1-dB compression point and output referred third-order intercept point (OIP3) are 18 dBm and 25.3 dBm, respectively. The corresponding quantities are 19.6 dBm and 30.5 dBm for a 0.6 /spl mu/m/spl times/150 /spl mu/m FET at same frequency. Similar Improvements in third-order intermodulation (IM3) for shorter gate length devices are reported.", "num_citations": "4\n", "authors": ["934"]}
{"title": "Large-signal modeling of gallium nitride-based microwave power transistors\n", "abstract": " During the past decade, the commercial outlook for GaN-based devices has grown considerably to meet the future need for wireless communications. Although record high output power densities at microwave frequencies have been achieved, factors limiting output power and reliability of the devices under high power operation still remain uncertain. Drain current collapse has been identified as the major obstacle for development of highly reliable GaN-based devices. Traps, introduced during the growth of the material, have been associated with current collapse. However, the physical mechanism of carrier trapping/detrapping under the influence of device bias was not clearly understood. This dissertation is focused on the efforts to develop large-signal models of GaN-based field-effect transistors (FETs) after identifying the possible mechanism for current collapse. It is found that impact ionization plays a key role in …", "num_citations": "4\n", "authors": ["934"]}
{"title": "Ultra-high Negative Dispersion Compensating Index Guiding Single Mode Octagonal Photonic Crystal Fiber: Design and Analysis\n", "abstract": " A single mode octagonal photonic crystal fiber is numerically analyzed and proposed for compensation of chromatic dispersion in optical communication networks. Finite element method (FEM) has been used for researching the dispersion characteristics and nonlinearity of the proposed PCF. Simulation results suggest that it is considered to be a prime component for the compensation of chromatic dispersion due to the large negative dispersion value of -1969 ps/(nm.km) at 1.55 μm wavelength along with high nonlinear coefficient of 80.94 W -1  Km -1  at 1.55μm wavelength, making it convenient for sensing application. On top of that the geometric parameter variation of ±2% around the optimum value is investigated to evaluate the practical feasibility.", "num_citations": "3\n", "authors": ["934"]}
{"title": "Highly Nonlinear Dispersion Compensating Octagonal Photonic Crystal Fiber: Design and Analysis\n", "abstract": " In this paper, we have presented an octagonal photonic crystal fiber (PCF) having five rings with circular air-holes of two different diameters which can yield high negative chromatic dispersion as well as high nonlinear coefficient. Finite element method has been employed to investigate the optical features of the designed PCF. The numerical investigation indicates that a large dispersion of -1449 ps/(nm.km) is obtained at λ = 1.55 μm which makes it suitable for compensating dispersion in optical communication networks. Moreover, the proposed PCF also offers high nonlinearity of 100.5W -1 Km -1  at 1.55μm wavelength which makes it suitable for sensing application. Furthermore, structural parameter variation around appropriate value is investigated.", "num_citations": "3\n", "authors": ["934"]}
{"title": "Locsoldiers: Towards developing an emergency troops locating system in military operations\n", "abstract": " Military is the most vital asset for any country where manpower is considered as most effective resource. The success of a military operation depends on deliberate planning, secure and uninterrupted communication, and conservation of manpower till the last. The aim of this paper is to develop an efficient system for operation commander to deploy or positioning the soldiers and to aware the status (dead or alive) of soldiers during a military operation. To attain this objective, here firstly a conceptual framework is proposed to develop a system named LocSoldeirs. Secondly the conceptual framework is implemented comprising both the hardware and software parts. Finally, an evaluation study was conducted to assess the usability and effectiveness of the proposed LocSoldeirs system with 8 participants (military personnel). The LocSoldeirs system assist for accurate deployment of the troops during operation, help to …", "num_citations": "3\n", "authors": ["934"]}
{"title": "Analysis of Dispersion and Nonlinear Property in Defected Core Square Photonic Crystal Fiber\n", "abstract": " A PCF of square lattice architecture is designed, analyzed, proposed for the compensation of broadband dispersion in the framework of optical transmission data link. After completing the simulation process the result shows that it can be conceivable in order to get very high dispersion in the operating wavelength of 1550 nm. Finite element method is applied to study the geometrical guiding properties of the proposed PCF. Furthermore, the layer of boundary is set up extra strongly so that the proposed fiber can compensates the chromatic dispersion effectively of the general single mode in whole interest band. The result is very impressive because of very high negative dispersion and the corresponding nonlinear coefficient.", "num_citations": "3\n", "authors": ["934"]}
{"title": "English to Bodo Machine Transliteration System for Statistical Machine Translation\n", "abstract": " Machine translation and transliteration are both the challenging research tasks and applications in the field of Computational Linguistics (CL) and Natural Language Processing (NLP) nowadays. Machine Transliteration (MTn) is a technique to convert script of a text from a source natural language to a target natural language using computer without changing the pronunciation of the source text. On the other hand, Machine Translation (MT) is a technique to translate text from a source natural language to a target natural language using computer. MTn is a highly helpful technique for handling OOV (Out-Of-Vocabulary) words in MT system, especially in statistical and neural machine translation systems. Bodo is a recognized language of India and one of the major spoken languages of North-East India. Still, not much work has been done on MTn system as well as MT system for Bodo language. Therefore, it has been decided to develop English to Bodo machine transliteration and translation systems. The primary objective of this proposed research work is to develop English to Bodo machine transliteration system for enhancing the translation result of English to Bodo Statistical Machine Translation (SMT) system. The MTn system has been developed using hybrid approach with the help of multi-domain English-Bodo parallel words or terms. The accuracy of the translation result of the SMT system has been evaluated using automatic evaluation technique BLEU.", "num_citations": "3\n", "authors": ["934"]}
{"title": "Software test estimation tool: Comparable with COCOMOII model\n", "abstract": " This study illustrates an estimation tool for software test that provides the estimated time and the cost of any sort of software test project. There are different well-recognized estimation tools for software development process [9], however, there remains a lack of standard tools for estimation of Software Test phase. Therefore, the authors developed a web base tool (www.4beats.net/tpet/) in order to determine the time and cost of projects. This paper highlights the comparable result with COCOMOII (Constructive Cost Model) model. More than 22 projects are already estimated by this open tool and from them 5 case projects, namely, Climate Resilient Ecosystems and Livelihood (CREL), Management Accounts Consolidation System for Line Director (LDMACS), PBI (Police Bureau of Investigations) Works Management System Software, PBI Mobile Apps and Human Resources Management System (HRMS) have selected …", "num_citations": "3\n", "authors": ["934"]}
{"title": "Requirements for the formal representation of pathophysiology mechanisms by clinicians\n", "abstract": " Knowledge of multiscale mechanisms in pathophysiology is the bedrock of clinical practice. If quantitative methods, predicting patient-specific behaviour of these pathophysiology mechanisms, are to be brought to bear on clinical decision-making, the Human Physiome community and Clinical community must share a common computational blueprint for pathophysiology mechanisms. A number of obstacles stand in the way of this sharing—not least the technical and operational challenges that must be overcome to ensure that (i) the explicit biological meanings of the Physiome's quantitative methods to represent mechanisms are open to articulation, verification and study by clinicians, and that (ii) clinicians are given the tools and training to explicitly express disease manifestations in direct contribution to modelling. To this end, the Physiome and Clinical communities must co-develop a common computational toolkit …", "num_citations": "3\n", "authors": ["934"]}
{"title": "Evaluation of vitamin D status among doctors of a specialized hospital in Bangladesh\n", "abstract": " Vitamin D deficiency is now recognized as a widespread phenomenon, even in a sunny country likeBangladesh. Physicians may be vulnerable to low vitamin D levels due to long work hours and lack of sun exposure. This study sought to determine the prevalence of vitamin D deficiency and its relationship with sociodemographic characteristics among doctors of a specialized hospital in Bangladesh. This cross-sectional study involved 157 doctors who were present in the hospital at the day of examination and were willing to take part in the study. Levels of 25-hydroxyvitamin D [25 (OH) D] were measured and other sociodemographic characteristics were recorded according to detailed study criteria. Vitamin D deficiency was defined as serum 25 (OH) D levels below 20 ng/mL. The prevalence of vitamin D deficiency was present in 89.8% of the entire study population. The prevalence of vitamin D deficiency was significantly lower in those aged more than 45 years than those aged less than 30 years (77.3% & 94.3% respectively; p-value 0.003). Participants who had history of vitamin D supplementation had significantly lower percentage of vitamin D deficiency than those who had no such history (80% and 95.1% respectively; p-value 0.005). Vitamin D deficiency is prevalent among the doctors of tertiary care hospital and is largely attributed to obesity, female sex, smoking, hypertension and CHD. History of Vitamin D supplementation is a strong protective factor for vitamin D Deficiency. Considering that vitamin D deficiency is very common in all age groups and that only few foods contain vitamin D, supplementation might be considered at suggested …", "num_citations": "3\n", "authors": ["934"]}
{"title": "Potentiality of selected commercial antibiotics challenged with Aeromonas sp\n", "abstract": " This study was intended to address, the effect of oxytetracycline, erythromycin, and streptomycin on the antimicrobial resistance of Aeromonas sp. isolated during the production process, from infected common carp (Cyprinous carpio). Antimicrobial resistance patterns were defined by determination of minimal inhibitory concentrations (MIC) of three antimicrobial drugs, and bacteria. Results indicated that In vitro bactericidal activity, oxytetracycline showed lowest number of bacterial colonies (1× 10-4 cfu/ml) than erythromycin (3× 10-4) and streptomycin (4.5× 10-4) compared to the control (9× 10-4). Oxytetracycline showed the highest maximum zone of inhibition (20 mm) than erythromycin (18 mm) and streptomycin (15 mm) in antibiotic susceptibility test. In infection inhibition assay, serum from oxytetracycline fed diets inhibited Aeromonas infection to common carp. The susceptibility of the fish fed antibiotics (50 µg/mg feed) and challenge with Aeromonas sp.(1× 10-4) was examined for 30 days. There was high relative percent of survivility (RPS) in oxytetracycline was 73%. Very low RPS 63% and 47.37% was found in erythromycin and streptomycin against Aeromonas sp. infection. These results demonstrated that the oxytetracycline might be a potential for Aeromonas sp. infection to common carp (Cyprinous carpio).", "num_citations": "3\n", "authors": ["934"]}
{"title": "Bring back nature in the post mining landscape of the West Rand, Johannesburg\n", "abstract": " West Rand, Johannesburg in South Africa, the city which is famous for its celebration of gold mining for more than hundred years, but this growing situation of gold mining is creating a great deal of destruction and degradation of natural habitats and elimination of different species of plants with wildlife from this territory. In recent years the government and private developers are aware about post mining sector. Rehabilitation and alternate use of unused mine residue area are burning issues of Johannesburg. Environmental impacts like acidic water, toxic soil and polluted air are discussed again and again to reclaim the mining landscape [1]. Affordable housing for poor or utilize large portions of the area for industrial purpose is proposed to use these lands for productive purposes. Unfortunately, bring back the wildlife or regenerate the landscape as forest, woodland, savannah, grassland and wetland is rarely discussed as tools to reclaim the mining belt. But this landscape has the possibility to rejuvenate the nature together with solving the contamination problem. Environmental problem can be treated through the use of plants known as' Phytoremediation'that mitigate the problem without the contaminant material excavation and dispose of it elsewhere [2]. Sensible modification of topography can create a harmonious condition to improve the quality of vegetation and wildlife habitation. This paper emphasizes the importance of bringing back nature and the possible options to achieve the goal.", "num_citations": "3\n", "authors": ["934"]}
{"title": "Comparative studies of cerium and zirconium doped barium titanate\n", "abstract": " Comparative investigations of microstructure and dielectric properties of BaTiO3 ceramics doped with different concentration of CeO2 and ZrO2 have been studied. BaTiO3 samples were prepared using conventional method of solid state sintering at 1250C for four hours. Distinct microstructure was observed with pure and doped BaTiO3. The highest value of dielectric permittivity and the lowest value of loss tangent was found for CeO2 with x= 0.1 mole percent. In all investigated samples dielectric constant assumes initially large value at low frequencies (75KHz) and attains constant value at frequency 1MHz.", "num_citations": "3\n", "authors": ["934"]}
{"title": "Software test estimation tools using use cases and functions\n", "abstract": " This paper demonstrates the software test estimation tool, which is clearly defined to understand, that provides the time and cost of any software test project. There are different estimation tools for software development process [8] and those are well recognized. But there are lacks of standard tools for estimation of Software Test phase. Therefore, the researchers applied that tool on two projects, project 1 - Management Accounts Consolidation System for Line Director and project 2 - Persona, in order to determine the time and cost of those projects. Since few software test estimation tools are available in the market, however, this paper would be fruitful for the software industry to explore the time and cost of any real software test project.", "num_citations": "3\n", "authors": ["934"]}
{"title": "Cylindrical and spherical solitary waves in a dusty non-thermal plasma\n", "abstract": " A theoretical investigation of the basic characteristics of cylindrical and spherical dust-ion-acoustic (DIA) solitary waves (SWs) is made in a dusty non-thermal plasma, whose constituents are non-thermal electrons, inertial ions, and arbitrarily charged stationary dust. The reductive perturbation method is used to derive the modified Gardner equation. The latter is numerically analyzed for both positively and negatively charged dust. The basic features of cylindrical and spherical DIA SWs, which are found to exist in such a dusty non-thermal plasma, are identified. The implications of our results to both space and laboratory plasma situations are also discussed briefly.", "num_citations": "3\n", "authors": ["934"]}
{"title": "Effects of buffer layer thickness and doping concentration on SiC MESFET characteristics\n", "abstract": " Two-dimensional simulations have been carried out using the Atlas/spl reg/ device simulator to investigate the effects of the buffer layer thickness and doping concentration on the electrical characteristics of the SiC MESFET. The variations of transconductance, output resistance, gate-source capacitance, gate-drain capacitance and (cutoff frequency) f/sub T/ with respect to the change in buffer layer thickness and doping concentration have been investigated. It is observed that the performances of MESFET can be improved by reducing the leakage of channel carrier into the substrate at high drain bias, which is achieved by increasing buffer layer doping density and/or increasing buffer layer thickness. For a SiC MESFET with buffer layer thickness of 0.3/spl mu/m and gate length of 1/spl mu/m, drain current increases from 0.1 A//spl mu/m to above 0.45A//spl mu/m as the buffer layer doping density is decreased from 1 …", "num_citations": "3\n", "authors": ["934"]}
{"title": "A physics-based model of frequency-dependent electrical characteristics of GaN MESFETs\n", "abstract": " In this paper, the applied bias, detrapping time and temperature dependences of frequency dispersion of output resistance and transconductance of a GaN MESFET are reported.", "num_citations": "3\n", "authors": ["934"]}
{"title": "Effects of impurity traps on gate current and trapped charge in MOSFETs\n", "abstract": " A quantum mechanical analysis of the gate current and trapped charge inside oxide layer of an enhancement type MOSFET has been presented in this paper. The effects of the impurity atoms inside oxide layer on the gate current and trapped charge have been analyzed. Carrier trapping due to an impurity atom inside the oxide layer is simulated using a rectangular potential well. Calculation of the gate current and trapped charge is carried out for various MOSFET parameters.", "num_citations": "3\n", "authors": ["934"]}
{"title": "High frequency GaN/AlGaN HEMT class-E power amplifier\n", "abstract": " We report the analysis and simulation of GaN/AlGaN HEMT microwave class-E power amplifiers. The load network of the class-E amplifier is designed by considering exponential decay of the drain current during fall time and finite quality factor of the resonant circuit to incorporate the nonidealities of the active device and passive components. The class-E amplifier has been simulated using Cadence circuit simulator with different HEMT structures. Calculated output power and power conversion efficiency are 93 mW and 72% at 1 GHz that decreases to 69 mW and 68% at 11 GHz, respectively for a 1 μm× 150 μ m GaN/Al 0.25 Ga 0.75 N HEMT. For a 0.12 μm× 100 μm GaN/Al 0.20 Ga 0.80 N HEMT the corresponding quantities are 131 mW, 82%, 87 mW and 77%, respectively.", "num_citations": "3\n", "authors": ["934"]}
{"title": "Gain compression in GaN HEMT amplifiers\n", "abstract": " Volterra series analysis is used to determine linear and nonlinear gain, output power of a GaN HEMT amplifier. Gain compression defined as the difference between linear and nonlinear gain is reported for varying temperatures. Measured 1-dB gain compression of 17.5 dBm for a 1/spl times/500 /spl mu/m Al/sub 0.15/Ga/sub 0.85/N/GaN HEMT at 300 K and at 2 GHz is in excellent agreement with the calculated value of 17 dBm. With the operating frequency increasing from 1 GHz to 6 GHz the 1-dB gain compression point decreases from 20.5 dBm to 13.8 dBm at 300 K. At 2 GHz the 1-dB gain compression point decreases from 17.5 dBm at 300 K to 6.5 dBm at 600 K.", "num_citations": "3\n", "authors": ["934"]}
{"title": "In vitro screening of berberis lycium root extract on HCT-116 and MCF-7 cell lines\n", "abstract": " The objective of the current study was to evaluate the antioxidant, lethality and anticancer potential of root extracts of Berberis lycium. Equal weight of powdered roots was used to prepare water, methanol, ethyl acetate and n-hexane extracts. Methanol extract of Berberis lycium showed promising 2,2-diphenyl-1-picrylhydrazyl free radical scavenging potential with an IC50 of 144.31 µg/ml. In the brine shrimp lethality assay, the ethyl acetate extract produced 53.33 % mortality at 1000 µg/ml and its LD50 was 907.7 µg/ml. In the sulforhodamine B colorimetric cytotoxicity screening assay, methanol extracts of Berberis lycium caused 45 % inhibition in growth of HCT116, without producing much effect against MCF7 cell line. In addition, the potential mediators that could be involved in mediating these activities include AKT1, TP53, JUN, and TLR4. In conclusion, methanol extract of Berberis lycium exhibited excellent antioxidant, brine shrimp lethality, and cytotoxic activities, indicating the potential of this plant against colorectal and breast cancer.", "num_citations": "2\n", "authors": ["934"]}
{"title": "An Effective Framework for Enhancing Student Engagement and Performance in Final Year Projects\n", "abstract": " Over the years, there have been many factors that have influenced the landscape of higher education within the UK. These factors include the rise in tuition fees, the introduction of the Teaching Excellence Framework (TEF) and the formation of Office for Students. Although student performance plays a vital part, another significantly influential key performance indicator that impacts these factors is student experience, which is influenced by positive or negative feedback and engagement. Despite student engagement forming a key part of the learning environment, it is still perceived as one of the weakest aspects when it comes to enhancing the student experience. In this paper, we present the implementation of an innovative, holistic teaching & learning framework for the final year project module trialed within the Department of Engineering and Computing at the University of East London. This project module had …", "num_citations": "2\n", "authors": ["934"]}
{"title": "A New Series of Conjugated Platinum‐co‐Poly(p‐phenylenebutadiynylene)s Polymers: Syntheses and Photophysical Properties\n", "abstract": " An efficient route is developed to synthesize a series of platinum‐co‐poly(p‐phenylenebutadiynylene)s (Pt‐co‐PPBs) polymers by stoichiometric mixing of poly(p‐phenylenebutadiynylene)s (PPBs) and platinum bis‐phosphine dichlorides. This synthetic route involves two steps; first, oxidative coupling of diterminal phenyleneethynylenes (PEs) gives low‐molecular‐weight PPBs oligomers HCC(Ph(OR)2 CCCC)n  Ph(OR)2 CCH (R = C4H91, R = C8H172, R = C12H253) (Mn = 1000–3000, degrees of polymerization, Pn(Mn) = 4–6), which have bifunctional alkynyl end groups, and in the second step, these organic oligomers are allowed to react with trans‐[(PnBu3)2PtCl2] to form newly designed Pt‐co‐PPBs (R = C4H94, R = C8H175, R = C12H256) polymers. The yield of 4–6 varies from good (63%) to high (76%) with high molecular weights (Mn) ranging from 52 738 to 74 212, and this …", "num_citations": "2\n", "authors": ["934"]}
{"title": "Detecting the spandex injuries and therapies of stretched garments\n", "abstract": " The purpose of this research is to observe the reason behind the damage of the elastic fibers of woven garments while manufacturing and to find out their remedies. Different types of elastic spandex woven garments were used in this research of different manufacturing stages. The reasons of the damages of the spandex woven garments were identified and their remedies were conversed. Spandex woven garments were damaged due to sewing and all other operations involved from cutting to finishing at factories. The content of the spandex fibers were identified using FTIR spectroscopy in accordance with the test method provided by AATCC 20A. Infrared radiation could show the IR spectral scan since IR radiation can pass through the fabric. This research was practiced based and the findings could be beneficial to the personnel involved in textile industries and for the manufacture of elastic woven garments.", "num_citations": "2\n", "authors": ["934"]}
{"title": "Virtual Screening and Pharmacological Property Breakdown of Eight Patented and Candidate Drugs against Four Intended Targets in Alzheimer’s Disease\n", "abstract": " Alzheimer’s disease (AD) is one of the most common age related dementia in the world. AD is caused by several reasons. Many reasons are responsible for the AD development. The N-methyl-D-aspartate receptor and several kinases are responsible for many cases of AD. In this study, eight anti-AD agents: Memantine, Hymenialdisine, Tideglusib, Kenpaullone, Dihydrospiro [dibenzo [a, d][7] annulene-5, 4′-imidazol], Harmine, Harmol and 1-Methyl-4-Phenylpyridinium, that can inhibit the activity of the mentioned proteins, were selected to test their efficiency in inhibiting their targets as well as to determine their safety and efficacy in the human body. The techniques of molecular docking is used in this experiment. The safety and efficacy of the agents were determined by the druglikeness property and ADME/T tests. From the study, memantine, hymenialdisine, dihydrospiro [dibenzo [a, d][7] annulene-5, 4′-imidazol] and harmol showed quite satisfactory results both in inhibiting their targets as well as in druglikeness and ADME/T studies.", "num_citations": "2\n", "authors": ["934"]}
{"title": "Investigation of parasite and diseases at cage culture Nile tilapia (Oreochromis niloticus) in Southern region of Bangladesh\n", "abstract": " The study was carried out to identify the parasite and causative diseases on cage reared tilapia at Bakerganj upazila, Barisal district. The infected tilapia fishes were collected from the cages and brought to the laboratory to find out signs, symptoms and infection area on the fish body. Physico-chemical parameters of water, such as water temperature, pH, dissolved oxygen, nitrate, phosphate and ammonia were monitored fortnightly. The values of water temperature (C), pH, dissolved oxygen (mg/l), nitrate (mg/l), phosphate (mg/l) and ammonia (mg/l) were 32.4±2.1, 6.2±0.3, 7.52±0.4, 0.028±. 008, 11.30±2.26 and 0.09±0.02, respectively but the concentration of nitrate was so higher during the study time. Eleven species of parasites namely, Chilodonella sp, Trichodiniasp., Gyrodactylussp., Cichlidogyrus sp., Capillariasp, Orientocreadium sp, Eustrongylidae sp, Allocreadium sp, Euclinostomum sp, Tylodelphys sp. and Metagonimus spwere were identified. Parasites were found on all the examined parts of the fish body but gill showed the most infested area of the host. Highest mortality rate was occurred in the month of October and lowest mortality rate was in July. In this circumstance, proper management system and handling are best ways to prevent diseases and reduce the mortality rate of tilapia on cage farming in the southern area.", "num_citations": "2\n", "authors": ["934"]}
{"title": "AN ANALYSIS OF CONTRASTS BETWEEN ENGLISH AND BENGALI VOWEL PHONEMES\n", "abstract": " Both qualitative and quantitative aspects of the English vowel system mark it as distinct from many other vowel systems including that of the Bengali language. With respect to the English pure vowels or monophthongs, tongue height, tongue position and lip rounding are the qualitative features which make English distinctive. The quantitative aspect of the English vowels or vowel length is another feature which makes some Bengali vowels different from their English equivalents the fact being that vowel length in Bengali, though it theoretically exists, is not important in actual pronunciation of Bengali. English diphthongs, or the gliding vowels, on the other hand, have the unique feature that between the constituent vowels, the first vowel component is longer than the second. This paper examines these contrasts underpinned by the CAH (Contrastive Analysis Hypothesis) the proponents of which believe that through contrastive analysis of the L1 and the L2 being learnt, difficulties in the latter’s acquisition can be predicted and materials should be based on the anticipated difficulties. The hypothesis also lends itself to the assumption that degrees of differences correspond to the varying levels of difficulty. This paper adds that contrastive analysis also enhances L2 awareness among learners, help them unlearn L1 habits and aids in the automation and creative use of all aspects of the L2 including phonology. The analysis of the sounds in question has made some interesting discoveries hitherto unknown and unobserved. First, it has been found that with reference to the parameters of vowel articulation, ie tongue height, tongue position, lip rounding and …", "num_citations": "2\n", "authors": ["934"]}
{"title": "Evaluation of Different Features and Classifiers for Classification of Rays from Underwater Digital Images\n", "abstract": " Machine learning technique based classification approaches have proved credibility and gained popularity in recent years. Different feature extraction methods from two-dimensional images along with machine learning classifiers are being used for different computer vision problem-solving approaches. To address the challenges of image classification, sourced from underwater imaging, we have experimented on some prominent feature extraction algorithms namely histogram of oriented gradients (HOG) , local binary patterns (LBP), bag-of-features (SURF), and neural network based feature extraction on a dataset containing total 305 underwater images of blue spotted and manta rays. As classifiers, we have experimented on decision tree, support vector machine (SVM), k-nearest neighbours (KNN), and neural network (two-layered NN). Results show that the combination of bag-of-features with two-layered …", "num_citations": "2\n", "authors": ["934"]}
{"title": "A machine learning approach on classifying orthopedic patients based on their biomechanical features\n", "abstract": " A person's orthopedic health condition can be detected from his biomechanical features. Now a days, disease prediction can be done automatically. Application of machine learning algorithms in medical science is not new. Different algorithms are applied to detect diseases and classify patients accordingly. This paper aims to assist specialists to predict the type of orthopedic disease. In this paper we have applied various machine learning algorithms to find out how each algorithm performs to detect and classify orthopedic patients. Each of the patient in the dataset is represented by six biomechanical attributes derived from the shape and orientation of pelvis and lumbar spine. We performed our operation in two stages and got an average accuracy of more than 90 percent for most of the algorithms, whereas Decision Tree (DT) algorithm stood out from the rest providing 99 percent accuracy.", "num_citations": "2\n", "authors": ["934"]}
{"title": "Threat detection technique in context to mangrove ecosystem of Indian Sundarbans\n", "abstract": " Materials and MethodsThe entire network of the present study consist of three stages i) identification of respondents (policy maker, researcher, fisherman, agriculturist and local inhabitants) ii) identification of major threats (6 in number) and iii) evaluation of the respondent’s response to construct the threats scale through ranking and voting. Although threats can be of various types, our list captures the major threats operating on the mangrove ecosystem of Indian Sundarbans. Threats were ranked in terms of their importance by building a Threat Assessment Matrix (TAM). However, as there is high probability of variation of this ranking with the category of respondents, therefore the views of the respondents were also considered (by inclusion of the% of voting along with their respective ranking factor) and finally Composite Threat Scale (CTS) for each of the three sectors of Indian Sundarbans was constructed on the basis of Threat Scale (TS) computed as per the expression: It is to be noted in this context that the sample size of respondents are variable eg, for policy maker it is 15, but for other five groups of respondents n= 58 for each group.", "num_citations": "2\n", "authors": ["934"]}
{"title": "A review on electronic dictionary and machine translation system developed in north-east india\n", "abstract": " Electronic Dictionary and Machine Translation system are both the most important language learning tools to achieve the knowledge about the known and unknown natural languages. The natural languages are the most important aspect in human life for communication. Therefore, these two tools are very important and frequently used in human daily life. The Electronic Dictionary (E-dictionary) and Machine Translation (MT) systems are specially very helpful for students, research scholars, teachers, travellers and businessman. The E-dictionary and MT are very important applications and research tasks in Natural Language Processing (NLP). The demand of research task in E-dictionary and MT system are growing in the world as well as in India. North-East (NE) is a very popular and multilingual region of India. Even then, a small number of E-dictionary and MT system have been developed for NE languages. Through this paper, we want to elaborate about the importance, approaches and features of E-dictionary and MT system. This paper also tries to review about the existing E-dictionary and MT system which are developed for NE languages in NE India.", "num_citations": "2\n", "authors": ["934"]}
{"title": "Background gamma radiation mapping in forest ecosystem of Bangladesh: A study on the radioactivity distribution in the national reserve forest of Gazipur\n", "abstract": " Natural and artificial radioactivity appears to be different in different geological regions. Moreover, the radionuclides may migrate to the deeper region of the earth after deposition, and the depth profile of a radionuclide reveals information on the rate of migration. Countrywide background gamma radiation mapping program has been initiated in Bangladesh by dividing the whole country primarily into~ 2 km×~ 2 km (1'× 1'in Global Positioning System scale) systematic square grids to formulate the radioactivity profile. About 28 km× 30 km area of forest land of Gazipur district called the “BhawalGahr” including the Bhawal National Park was selected for sampling. Soil samples from 0 to 5 cm, 5 to 15, cm and 15 to 30 cm depth were collected from the 27 grid node points of the square grids. A total of 81 samples were collected for the current study. The samples were subjected to elemental and radioactivity analyses. The …", "num_citations": "2\n", "authors": ["934"]}
{"title": "Recognising activities of daily living from patterns of object use\n", "abstract": " To provide assistance and support to the elderly disabled and cognitively impaired, the recognition of their activities of daily living (ADL) must be accurate and precise with regards to the object use for the activity situations. Current knowledge-driven and ontology-based activity recognition techniques model object concepts from assumptions and common everyday knowledge of object use of routine activities. Modelling activities from assumptions and common everyday knowledge of object use could lead to faulty recognition of particular routine activities and possibly undermine abnormal activity trends. A significant step in the recognition of activities of daily living is the discovery of the object use for specific routine activities due to its ability to relate object use to their associated activities. The discovering particular object (s) which are used to perform routine activities could help enhance knowledge-driven ontology …", "num_citations": "2\n", "authors": ["934"]}
{"title": "Synthesis, characterization and liquid crystalline properties of a series of hydroxybiphenyl benzoate and biphenyl bis (benzoate)\n", "abstract": " Two series of hydroxybiphenyl benzoate 2a–2c and biphenyl bis(benzoate) 3a–3c have been synthesized by the esterification reaction of 4-alkoxybenzoic acid 1a–c with 1,1′-biphenyl-4,4′-diol in presence of DCC and DMAP in dichloromethane at room temperature under nitrogen atmosphere. Products ratio (2 vs 3) were not significantly influenced with the variation of alkoxy substituents. The newly synthesized ester products were characterized by IR and NMR spectroscopy as well as elemental analysis. The transition temperatures and mesophases have been investigated by differential scanning calorimetry and polarized optical microscopy. Although the synthesized ester derivatives, 3a–c are achiral, molecular chirality is exhibited in their mesophases.", "num_citations": "2\n", "authors": ["934"]}
{"title": "Socio-Demographic and Oral Health Related Risk Factors for Periodontal Disease in Inner North East London (INEL) Adults: A Secondary Analysis of the INEL Data.\n", "abstract": " Introduction: Periodontal disease is a serious collection of diseases which can lead to chronic inflammation, the destruction of tooth supporting structures and ultimately; tooth loss. It is also one of the most common diseases of the oral cavity and the major cause of tooth loss in adults and may have a major impact on the quality of life off those who suffer with the condition. Objectives: To determine the socio-demographic and oral-health-related risk factors for periodontal disease in a sample of adults living in Inner North East London (INEL), UK. Methods: A secondary analysis was conducted on data from the 2008 survey on ‘The Oral Health of Adults in INEL.’ Data were entered into the Statistical Package for Social Sciences (SPSS v19, IBM UK Ltd, Portsmouth, UK) and analysed using descriptive analysis, chi-squared tests (P ≤ 0.05), together with multivariate regression analysis. The original survey employed a multi-stage sampling procedure and the final sample size was 361. All of the participants were selected from the London Boroughs of Tower Hamlets, City and Hackney and Newham. Periodontal disease indicators, such as the loss of clinical attachment and periodontal pocket depths were cross-matched with socio-demographic and oral health-related behaviours. Associations between the two were ascertained using chi-squared statistics and multivariate regression analysis. The case-definition adopted to indicate the presence of periodontal disease was “a clinical loss of attachment and periodontal pocketing of four millimetres or more, in at-least one tooth respectively”. Results: The prevalence of periodontal disease in the original INEL …", "num_citations": "2\n", "authors": ["934"]}
{"title": "Towards cloud security monitoring: a case study\n", "abstract": " Cloud computing has become the norm in the provisioning of computing resources due to its flexible and proven reliability. Businesses perceive cloud services as a trend that presents enormous possibilities both in economic and technical terms. The growth in cloud services have also increased bottlenecks and security risks to business assets. Cloud security monitoring has remained relatively unexplored in security terms, a factor that has led businesses to be oblivious on the metrics to capture and the appropriate techniques to use. In this paper, we explore security monitoring in terms of tracking specific user requirements based on a case study. We identify various security tools that are practically relevant for addressing the requirements, and devise selection criteria for choosing the best tools. We present an evaluation of the tools and present a ranking for the tools that meet the particular requirements of the case …", "num_citations": "2\n", "authors": ["934"]}
{"title": "Ventricular septal defect as a complication of blunt chest trauma: A rare occurrence and first case-report in Bangladesh\n", "abstract": " Traumatic ventricular septal defect (VSD) is a very uncommon condition, especially in association with blunt chest trauma. A healthy young adult was diagnosed as a case of VSD one week after a road-traffic accident. History and other medical records suggest it was an acquired post-traumatic VSD. Thus, all patients of blunt chest trauma deserve close cardiac evaluation.", "num_citations": "2\n", "authors": ["934"]}
{"title": "Evaluation of antibody production against Newcastle Disease Virus after immunization with different vaccines in Fayoumi chicks\n", "abstract": " The research work was performed in the experimental sheds and virology laboratory of the Department of Microbiology and Hygiene, Faculty of Veterinary Science, Bangladesh Agricultural University (BAU), Mymensingh during the period from January to November 2006 for the detection of persistence of maternallyderived antibody (MDA) against Newcastle disease virus (NDV) in Fayoumi chicks as well as evaluation of antibody production in chicks after vaccination. Five experimental groups of 110-day-old Fayoumi chicks were vaccinated for comparative study. Group A was vaccinated with baby chick ranikhet disease vaccine (BCRDV, F-strain), group B with Izovac B 1 Hitchner®(B1 strain), group C with Cevac New L®(LaSota strain) and group D with Avinew®(VG/GA strain) through intraocular (i/o) route while group E was kept as unvaccinated control. Serum samples obtained from 10 randomly selected birds from each group on the occasion of 7, 13, 15, 17, 19 and 21 days post-vaccination (DPV) were subjected to haemagglutination inhibition (HI) test. It was found that persistence of MDA against Newcastle disease virus (NDV) retained until the age of day 20 in Fayoumi chicks and among the four commercial vaccines, Avinew®(VG/GA strain) appeared to be slightly superior compared to those of BCRDV (F-strain), Izovac B 1 Hitchner®(B 1 strain) and Cevac New L®(LaSota strain) in respect of HI antibody response. The F-values of HI titre among four vaccines were significantly different (p< 0.01).", "num_citations": "2\n", "authors": ["934"]}
{"title": "Nonlinear finite element analysis of reinforced concrete plates in punching shear\n", "abstract": " Punching shear is one of the most critical phenomena for flat plate building systems due to the brittle nature of this failure mode. The region of a slab in the vicinity of a column could fail in shear by developing a failure surface in the form of a truncated cone or pyramid. This type of failure, called a punching shear failure, is usually the source of collapse of flat plate and flat slab buildings. It is one of the topics of intensive research in recent years by various researchers in the field of concrete structure. Numerous tests have been carried out to evaluate the punching shear strength of slabs. Several theories have been put forward to predict the strength observed in these tests. An attempt has been made in this research to study the punching shear of reinforced concrete flat plates. Before carrying out the systematic computational investigation, existing literature on the relevant field based on experimental investigation, analytical methods, numerical models and various Codes of Practice is thoroughly reviewed. A 3-dimensional reinforced concrete flat plate model was generated. The formulation has been checked against experimental results of tests on slabs subjected to punching shear. From a comparison of the numerical and the experimental results, it is concluded that the adopted model of the Finite Element Analysis package (ANSYS)is suitable for analyzing reinforced concrete plates. The good agreement obtained between the numerical and the experimental results establish the validity and accuracy of the computational model. A systematic study is carried out to determine the punching shear capacity due to variations of different structural …", "num_citations": "2\n", "authors": ["934"]}
{"title": "Barrier thickness and mole fraction dependence of power performance of undoped supply layer-AlGaN/GaN HFETs\n", "abstract": " In the present abstract the non-linearity and power performance of AlGaN/GaN HFETs upon varying thickness and Al-mole fraction of the barrier AlGaN layer is presented. The present calculation is based upon the determination of the 2DEG concentration by solving Schrodinger and Poisson's equations self-consistently as well as incorporating non-stationary transport to obtain the carrier velocity-electric field characteristics. Charge control is obtained by accounting for the total polarization in the barrier AlGaN layer and the GaN layer at the heterointerface. Device nonlinearity has been analyzed using Volterra Series technique which shows the output referred third-order intercept point (OIP3), referred as the output power level at which third-order intermodulation component of the output power crosses the fundamental component. the third-order intermodulation is also achieved at higher barrier thickness. A higher …", "num_citations": "2\n", "authors": ["934"]}
{"title": "Analysis of RF performances of GaN MESFETs including self-heating and trapping effects\n", "abstract": " A physics-based large-signal model of GaN-MESFETs is reported which includes temperature dependences of transport and trapping parameters. RF power performances are analyzed using generalized Volterra series techniques. At 2 GHz, the calculated maximum output power of a 0.3 /spl mu/m/spl times/100 /spl mu/m GaN MESFET is 22.8 dBm at a power gain of 6.1 dB and power added efficiency of 28.5%. The corresponding quantities are in excellent agreement with the measured values of 23 dBm, 5.8 dB and 27.5%, respectively. At 2 GHz, gain compressions, due to self-heating effects, of 2.2 dB and 0.75 dB are obtained for 0.30 /spl mu/m/spl times/100 /spl mu/m and 0.75 /spl mu/m/spl times/100 /spl mu/m GaN MESFETs, respectively. At 4 GHz and 10 dBm output power, the calculated third-order intermodulations (IM3) for 0.30 /spl mu/m/spl times/100 /spl mu/m and 0.75 /spl mu/m/spl times/100 /spl mu/m …", "num_citations": "2\n", "authors": ["934"]}
{"title": "Thermal and trapping effects in GaN-based MESFETs\n", "abstract": " RF power performances of GaN-MESFETs are reported using a physics-based model that incorporates dispersion in the output resistance and transconductance due to traps and thermal effects. Calculated I-V characteristics are in excellent agreement with the measured results. Taking thermal effects into account, the maximum output power of a 0.3 /spl mu/m/spl times/100 /spl mu/m GaN MESFET is 22 dBm at a power gain of 4.2 dB at 4 GHz. The corresponding quantities are 27 dBm and 6.4 dB, respectively if a constant channel temperature of 300 K is assumed. At elevated temperatures, compression in output power, gain and PAE is less in MESFETs with longer gate lengths.", "num_citations": "2\n", "authors": ["934"]}
{"title": "RF performance of GaN/AlGaN HEMT amplifier\n", "abstract": " An exact time-domain technique to analyze the RF performance considering the thermal effects of the GaN/AlGaN HEMT amplifier is reported. The maximum output power of 28 dBm at a power gain of 8.2 dB, and power added efficiency (PAE) of 19% with low frequency gain of 11 dB at an operating frequency of 2 GHz, reported for a 1 /spl mu/m/spl times/500 /spl mu/m Al/sub 0.15/Ga/sub 0.85/N/GaN HEMT are in excellent agreement with theoretical calculations. The calculated third-order intermodulation (IM3) and carrier-to-IM3 ratio are -16.5 dB and 13.5 dBc, respectively, at the peak operating power/PAE at 2 GHz. With output power decreasing to 16 dBm at 2 GHz the above quantities are -37 dB and 22.5 dBc, respectively.", "num_citations": "2\n", "authors": ["934"]}
{"title": "L1 Interference in the Acquisition of English Syntax and Lexis\n", "abstract": " By and large, the occurrence of errors is integral to the process of learning. The learning of languages (both the mother tongue and the second language), likewise, involves the making of errors. It is claimed and supported by research evidence that SLA error are caused by inter-and intra-language factors. Inter-lingual errors result from the negative transfer of a learner’s L1 features while intra-lingual errors are due to factors within the L2 itself like overgeneralization, ignorance of rule restrictions, incomplete application of rules, and false concepts hypothesized. Although both inter-and intra-lingual factors act as sources of errors in SLA, there is compelling evidence in the research literature that SLA errors are overwhelmingly L1 driven, ie mainly caused by the negative transfer of the language features of the first language of the learner. There is also strong evidence that first language interference presents itself to the learning of all aspects of a second language, ie morphology, syntax, semantics and discourse. At first, this paper discusses the claims and views on L1 negative transfer to SLA. Next, it presents secondary data and its analysis in support of and as evidence for the claims made for L1 interference in the acquisition of the English syntactic properties of word order, subject-verb agreement, tense, copula BE, subject omission, the subordinate clause, expletive pronouns, positions of adverbs, and plurals among other things. Later, L1 lexical negative transfer of form and meaning, is discussed at word, phrase and idiom level. Finally, form-focused L2 instruction in tandem with meaning-focused communicative activities is explained, justified …", "num_citations": "1\n", "authors": ["934"]}
{"title": "Synthesis and Characterization of Bismuth Doped Barium Titanate\n", "abstract": " The mixture Ba1-xBi2x/3TiO3 was prepared by the standard solid state reaction method. Bi2O3 was added as a dopant to the powder mixture of Barium Carbonate BaCO3 and Titanium Dioxide TiO2 and sintered at 1150ºC for five hours. The microstructure, dielectric and electric properties of the mixture have been investigated. The dielectric constant increased with increasing Bi2O3 until it reached the maximum value with 0.6 mol% Bi2O3 additive, and the maximum dielectric loss was found 0.021 for 0.02% Bi2O3 content. The maximum Curie temperature was found 135ºC for 0.02, 0.03, 0.04% Bi content. The frequency dependent dielectric constant (ε) and dielectric loss (tanδ) of the samples at room temperature were collected in the frequency range from 40 Hz to 110MHz.", "num_citations": "1\n", "authors": ["934"]}
{"title": "Functional connectivity evaluation for infant EEG signals based on artificial neural network\n", "abstract": " The employment of the brain signals electroencephalography (EEG) could supply a deep intuitive understanding for infants behaviour and their alertness level within the living environment. The study of human brain through a computer-based approach has increased significantly as it aims at the understanding of infants’ mind and measures their attention towards the surrounding activities. The artificial neural network achieved a significant level of success in different fields, such as pattern classification, decision making, prediction, and adaptive control by learning from a set of data and construct weight matrices to represent the learning patterns. This research study proposes an artificial neural network based approach to predict the rightward asymmetry or leftward asymmetry which reflects higher frontal functional connectivity in the frontal right and frontal left, respectively within infant’s brain. In the traditional …", "num_citations": "1\n", "authors": ["934"]}
{"title": "Taskification: gamification of tasks\n", "abstract": " Leading a busy lifestyle can have a negative impact on the productivity levels of individuals. Lack of motivation is also another factor that can influence the output of any task or activity conducted by a user. This also applies to students within an academic context, where the distractions and lack of motivation can have a negative impact on their learning and results. In this paper, we propose'Taskification', a task management mobile application, which incorporates core gamification features. The objective of this application is to increase student engagement and motivation during tasks such as coursework or exam preparation.", "num_citations": "1\n", "authors": ["934"]}
{"title": "Design of Low Power 8-Bit DAC Using PTM-LP Technology\n", "abstract": " With emerging high performance digital circuits, the need for data converters with high accuracy, high speed and low power for various kinds of applications has increased greatly. Extensive researches are being conducted in order to decrease the size of data converters to obtain low power and high speed characteristics. Digital to Analog Converters (DACs) convert digital signals to analog signals. This paper presents the design of a low power, 8-bit, segmented current steering DAC using PTM 32nm technology. The simulation was carried out in LTSpice software. The DNL and INL of the converter was measured to be 0.37 LSB and 1.5 LSB respectively. With an input date rate of 1GHz, the SFDR was measured to be 33dB. The total power consumption of the converter was 0.257mW. The same design was simulated with PTM 16nm technology and results were compared with each other and other recent works.", "num_citations": "1\n", "authors": ["934"]}
{"title": "Cloud strife: Expanding the horizons of cloud gaming services\n", "abstract": " Cloud gaming where computer games are executed on cloud based resources is a new service which can be extremely challenging for service providers. Unlike other web and video streaming applications it requires both a relatively high constant downlink bandwidth and low latency simultaneously. Hence, cloud gaming providers recommend that clients be relatively close to data centers to ensure reasonable Quality of Service. Latency, however, is also dependent on the compression type used for the video streaming and there is a trade-off between compression efficiency and complexity which affects client computer capability. In this paper we propose the Strife system which examines the processing capabilities of the client as well as the network conditions between the client and data center to select the compression type that maximizes the size of the client base for cloud gaming services for which reasonable …", "num_citations": "1\n", "authors": ["934"]}
{"title": "gUML: Reasoning about energy at design time by extending UML deployment diagrams with data centre contextual information\n", "abstract": " With the rising energy demand in ICT services and its associated environmental impact, the need for energy efficient Enterprise ICT solutions is growing. As data centres account for a large part of energy consumption in ICT, data centre operators strive to create opportunities to put more emphasis on reducing energy consumption. However, creating ICT Systems that are energy efficient by design remains a key challenge. In this paper, we identify and map contextual energy information about data centre operations in order to model their power related components. This contextual modelling is then mapped to deployment diagram where we introduce greenUML (gUML), an extension to UML diagrams to improve energy efficiency through energy analysis at design time. gUML will allow system architects to reason about the energy footprint of their applications at design time.", "num_citations": "1\n", "authors": ["934"]}
{"title": "Level of consumption of complementary foods among under-weight children from 6 to 23 months in Bangladesh\n", "abstract": " Inadequate and inappropriate consumptions of complementary foods among children under five years of age, is a burning agenda over the nutritional status of children in Bangladesh. The aim of the study is to measure the level of consumption of complementary foods among underweight children from 6 to 23 months in Bangladesh. All data including complementary food patterns, nutritional status and other socio-demographic factors were obtained from Bangladesh Demographic Health Survey (BDHS) 2011 data set. A total of 706 underweight children aged 6–23 months were selected for analysis. A simple but prominent index called “dimension index” was used to estimate the level of consumption of complementary foods among children. T-test and ANOVA test have been used to identify the mean difference of the level of consumption of complementary foods among underweight children aged 6 to 23 months. The overall mean level consumption of complimentary foods was 22.5%. The study also identified that the multilevel factors, such as, age of child, birth order of child, size of the child, mother’s education, father’s education, father’s employment status, socio-economic status, food insecurity and place of residence are responsible for assessing significant mean differences of the level consumption of complementary foods among underweight children aged 6 to 23 months. Concerned stakeholders must take into account multilevel social factors while formulating strategies to improve nutritional status among children.According to various studies, children aged 6–23 months is considered a “critical window” for transition of body and cognitive …", "num_citations": "1\n", "authors": ["934"]}
{"title": "Self-microemulsifying: a new approach of lipid based drug delivery systems\n", "abstract": " Solubility is one of the key factor in drug formulation in order to ensure better bioavailability. As 40% of new drugs are poorly soluble, it has become a matter of concern and challenge for the formulation scientists with regard to solubility and bioavailability. Though formulation approaches like solid dispersions, complexation, pH modification exist, but there are areas of further research and development for better approaches. Lipid-based drug delivery systems (LBDDS) are one of the emerging technologies designed to address such challenges in recent time. These systems have shown great promise which can lead to increased solubilization and absorption, resulting in enhanced bioavailability. This review provides a comprehensive understandings of Lipid-based drug delivery systems especially for oral delivery, from both physicochemical and biopharmaceutical perspectives. This review also focuses on …", "num_citations": "1\n", "authors": ["934"]}
{"title": "A Contrastive Analysis of English and Bengali Consonant\n", "abstract": " This paper is an analysis of similarities and differences between English and Bengali consonant phonemes. The reason why a study of contrast has been undertaken are these majors tenets of the CAH (Contrastive Analysis Hypothesis) to which the author subscribes: 1) Errors are mainly L1 induced, 2) the more different the two languages are, the more difficult or erroneous the acquisition of the TL is, 3) the study of contrasts helps both the teacher and the learners predict learning difficulties and, helps the teacher design appropriate remedial and corrective materials and tasks, 4) CA can be applied to any aspect of language, ie, phonology, syntax, or pragmatics, 5) the study of phonological contrasts between two languages work out the best, and 6) L1 phonological negative transfer is more pronounced than the transfer of any other aspects of language. Based on the above assumptions about contrastive analysis of languages, English and Bengali consonant phonemes are analyzed in detail in this paper in terms of the features of articulation, namely place or articulation, manner of articulation, voicing and, also, aspiration because it is a distinctive feature of some Bengali consonants which are likely to interfere with the acquisition of their counterparts in English. After a detailed analysis of the differences and a very few similarities that exist between the two consonant systems, an inventory of the difficult English consonants is made according to the respective severity of difficulty the consonants pose. Lastly, it is recommended that along with the segmental features of L2 pronunciation, its supra-segmental features are also to be taken care of and …", "num_citations": "1\n", "authors": ["934"]}
{"title": "COMPARATIVE EVALUATION OF TWO RAPID DIAGNOSTIC TEST DEVICES AND REAL [TIME PCR FOR THE DETECTION OF HEPATITIS B SURFACE ANTIGENS IN HUMAN PLASMA: IMPLICATIONS IN BLOOD DONATION …\n", "abstract": " Background and Aims: Hepatitis b Virus (HbV), a parenterally transmitted infectious virus, is one of the leading causes of hepatitis. screening for HbV infection is recommended before vaccination and blood transfusion in order to prevent its transmission. Immunochromatography (Ict) based rapid HbsAg kits are popular for the screening of HbV infection as they are faster, cheaper and easier to perform than other methods. this study was aimed to evaluate two rapid HbsAg detection Ict kits for the screening of HbV infection by comparing them with the gold standard real-time polymerase chain reaction (real-time PCR) system that quantifies HBV-DNA.Materials and Methods: the study comprised 203 samples, of which 103 had detectable and 100 had no detectable HbV-DNA by real time Pcr. these samples were tested with Ict kits from two companies: Onsite HbsAg rapid test (ctK biotech, Inc., UsA) and HbsAg test Device (EXcEL®, UsA).Results: sensitivity of ctK and EXcEL were found to be 97.1% and 95.1% respectively. Negative predictive value (NPV) of CTK and EXCEL were 97.1% and 95.2% respectively. Both kits showed 100% specificity and 100% positive predictive value (PPV). HbV-DNA status strongly correlated with ctK (r= 0.971, p< 0.001) and with EXcEL (r= 0.952, p< 0.001). Three and five moderate to high HBV load containing samples were undetected by CTK and EXCEL respectively.Conclusions: the study demonstrates that Ict based rapid test Devices might be considered suitable for screening of HbV infection as a point of care test. However, Nucleic Acid testing for hepatitis b virus (NAt-HbV) should be implemented for donor …", "num_citations": "1\n", "authors": ["934"]}
{"title": "Indian ournal of\n", "abstract": " REVIEW ARTICLE untreated industrial wastes disposed into the open water aquatic lives and fishermen. Industrialization magnifies th which is largely responsible for ecological imbalance. Indu BOD, Cu, Zn, Pb, Turbidity, EC, TSS, TDS etc. crossing the p enhances the individual family income and reform the socia", "num_citations": "1\n", "authors": ["934"]}
{"title": "Marketing system of some fish species in the north-eastern region of Bangladesh: An empirical study\n", "abstract": " In Sylhet district, several markets and super shops are developed to continue fish related business. Therefore, the study was undertaken to discern about the inclusive market status by employing PRP tools for a period of six months from June-November 2015. The study revealed that in supply chain about 5% consumers received fish and fishery products from fish farmers directly and rest 95% fishes reached to the consumer levels through intermediaries. About 55% fish species were found as local origin and 45% came from different parts of the country. The gross margin of paiker, wholesaler and retailer was 800, 400, 1100 taka/quintal whereas net margin was 600, 320 and 960 taka/quintal, respectively. It was found that 45% consumer not prefers to take fish in fillet form and rest 55% accepted fish fillet for consumption. Major constraints of the study areas were poor drainage, transportation, icing facilities, unhygienic environment. Not only GO but also NGO should take recommended measures to overcome the existing problems of fish market in Sylhet district.", "num_citations": "1\n", "authors": ["934"]}
{"title": "A male person of 55 years with hypothyroidism, ascites and heart failure.\n", "abstract": " Primary hypothyroidism is a common clinical condition but ascites caused by hypothyroidism is rare. Concurrent exudative ascites with heart failure even rarer. So its diagnosis is often delayed and patients frequently receive unnecessary procedures such as liver biopsies and exploratory laparotomies. We report a male person of 55 years with hypothyroidism with ascites and heart failure who responded well with thyroid hormone replacement therapy with complete resolution of ascites. Analyses of ascites from patients in this condition usually shows exudative ascites with high protein (> 2.5 gm/dl) and SAAG< 1.1 gm/dl. High index of suspicion is required to reach at such diagnosis. Though it is a rare but prognosis is excellent with replacement therapy.", "num_citations": "1\n", "authors": ["934"]}
{"title": "Trans-catheter Treatment of Lutembacher Syndrome-A case report\n", "abstract": " Lutembacher syndrome is a rare combination of congenital Atrial Septal Defect (ASD) and acquired Rheumatic Mitral Stenosis (MS). It is usually treated by surgical repair with potential risk of cardiopulmonary bypass. With the advancement of interventional methods of treatment it is amenable to nonsurgical transcatheter management. We are reporting a case of Lutembacher syndrome that was successfully treated with percutaneouos Inoue balloon mitral valvuloplasty and device closure of atrial septal defect.", "num_citations": "1\n", "authors": ["934"]}
{"title": "Synthesis, characterization and Electrochemical studies of Ferrocenyl-2, 4-Dinitrophenylhydrazone\n", "abstract": " A ferrocenyl imine complex, Fc-C (CH 3)= N-NH-C 6 H 3-2, 4-(NO 2) 2 (Fc= ferrocenyl) has been synthesized by the condensation reaction between acetylferrocene and 2, 4-dinitrophenyl hydrazine. The compound was synthesised previously, and characterized by IR, 1 H and elemental analysis. It was further characterized by 13 C {1 H} NMR spectroscopy and mass spectrometry. The redox property of the complex was studied by cyclic voltammetry, differential pulse voltammetry and chronocoulometry. The redox process of the complex was found to be reversible at a platinum-disc electrode, and the redox potential of the imine complex was shifted to more anodic position with respect to ferrocene. The redox reactivity of the complex was enhanced in the presence of oxygen.", "num_citations": "1\n", "authors": ["934"]}
{"title": "Assessment of copper in diverse pulses, bananas, vegetables and arums of five upazila of Chittagong area in Bangladesh by spectro-photometric method.\n", "abstract": " Copper is common element in the environment. People are exposed to copper by breathing air, drinking water, eating food, and by skin contact with soil, water and other copper-containing substances. Most copper compounds found in air, water, sediment, soil and rock are strongly attached to dust and dirt or imbedded in minerals. It rapidly enters into the bloodstream and is distributed throughout the body after eating or drinking the copper containing products. Certain substances in foods are eaten with copper can affect the amount of copper that enters into the bloodstream from the gastrointestinal tract. The present investigation shows that four verities of vital food ie pulses, bananas, vegetables and arums contain diverse amount of copper in Chittagong area of Bangladesh. This food is taken for survival the life. The amounts of copper in pulses were found to vary from 3.2250-29.6531 µg/g of that region. The …", "num_citations": "1\n", "authors": ["934"]}
{"title": "Investment Pattern for Required Economic Growth to Achieve Poverty Reduction Targets\n", "abstract": " According to the Poverty Reduction Strategy Paper (PRSP) document, an enhanced economic growth rate of 8 to10 percent per annum is required to achieve the poverty reduction targets set by Millennium Development Goals (MDGs) in Bangladesh. During 2006-09, the economic growth of Bangladesh is averaged 6.16 percent per annum. The economy is estimated to have grown at a rate of 6 percent in FY10, slightly above the growth rate (5.9 percent) of FY09, but still it falls short of an economic growth of 8 to 10 percent as would be consistent with PRSP. Therefore, poverty reduction targets will remain unrealized unless the factors responsible for lower economic growth are identified accordingly and managed, one of which is the lower investment spending.Even though current investment spending in Bangladesh is considerably higher than earlier, still our economy is operating far below the targeted growth rate as mentioned in PRSP. It may be the result of insufficient investment spending to attain and maintain the required growth rate set by the MDGs. It is therefore the major challenge of Bangladesh to raise investment to a certain level so that the required growth can be achieved.", "num_citations": "1\n", "authors": ["934"]}
{"title": "Species availability and marketing system of traditionally dried fish in Rangpur division of Bangladesh\n", "abstract": " A survey was conducted on traditionally dried fish marketing of Rangpur division. The present study found that there are 22 species of dry fishes available in Rangpur division of which 15 are freshwater species and 7 are marine water species. Prices of the dried fishes in wholesale or retail markets were found to vary on the basis of species, size and quality of the final product. In Rangpur retail markets the maximum net profit was calculated as 12.14 Tk/kg for (Trichiurus lepturus) Churi dried fish. On the other hand, the minimum net profit was found in small indigenous species such as Chela (Salmostoma acinaces) fishes. Whereas, in Dinajpur and Thakurgaon retail market the maximum net profit was found higher in case of Mola (Amblypharyngodon mola) as 18.77 Tk/kg and 32.60 Tk/kg respectively. Two wholesale markets are reported in Rangpur division; the Ghaghatpara arat and Saidpur arat. The retailers of this region usually collect dry fish from those arats and consumers get the dry fishes from the retailers. Locally produced dry fishes are sold to the wholesalers of Rangpur and Saidpur arat and finally go to the consumers through retailers. Several marketing problems were found which include lack of capital, higher transportation cost, storage problem, lower market demand and higher loan interest rate etc.", "num_citations": "1\n", "authors": ["934"]}
{"title": "Process centric work breakdown structure for easing Software Project management challenges: Business case analysis example\n", "abstract": " Software project management involves coordinating various aspects of a project in order to bring forth a positive result. There have been increasing challenges faced by project managers. The major challenges of project management include unrealistic deadlines, communication deficit, uncertain dependencies, failure to manage risk, not well-defined vision and goals, and invisibility of the final product. Meeting these challenges is very difficult and in many cases they are not met which eventually leads to the project failure. This situation is even worse where project dispersion is higher. Different studies reveal that an IT project is more likely to be unsuccessful than successful and 7 out of 10 IT projects fail in some respect. The process centric work breakdown structure (WBS) can play a very vital role in this regard to improve the situations significantly. Instead of hierarchical work breakdown structures as a tree, the …", "num_citations": "1\n", "authors": ["934"]}
{"title": "Stability of ion–acoustic solitary waves in a multi-species magnetized plasma consisting of non-thermal and isothermal electrons\n", "abstract": " A theoretical study of the first-order stability analysis of an ion–acoustic solitary wave, propagating obliquely to an external uniform static magnetic field, has been made in a plasma consisting of warm adiabatic ions and a superposition of two distinct populations of electrons, one due to Cairns et al. and the other being the well-known Maxwell–Boltzmann distributed electrons. The weakly nonlinear and the weakly dispersive ion–acoustic wave in this plasma system can be described by the Korteweg–de Vries–Zakharov–Kuznetsov (KdV-ZK) equation and different modified KdV-ZK equations depending on the values of different parameters of the system. The nonlinear term of the KdV-ZK equation and the different modified KdV-ZK equations is of the form [φ(1)]ν(∂φ(1)/∂ζ), where ν = 1, 2, 3, 4; φ(1) is the first-order perturbed quantity of the electrostatic potential φ. For ν = 1, we have the usual KdV-ZK equation. Three …", "num_citations": "1\n", "authors": ["934"]}
{"title": "Marketing system of fishes and socioeconomic condition of fish retailers in Madaripur town\n", "abstract": " The fish marketing system in three markets of Madaripur town and the socio-economic status of the fish retailers were studied for a period of six months from January to June, 2008. Data were collected through questionnaire interviews and focus group discussions. The fish marketing chain started from the fish farmers to the consumers passes through a number of intermediaries such as, local fish traders, agents/supplier, commission agents and the retailers. The daily supply of fish in Iterpool bazar, Puran bazar and Municipal market was estimated as 1-2, 4-5 and 0.5-1 tones, respectively where carp fish was the highest (33.66%) and tilapia was the lowest (4%). The fish price varied according to daily demand and seasonal variations. Most of the fish retailers in all level of marketing chain had education at some level and were quite young. The average family size of the fish retailers was 5.6 and 81.66% were improved their socio-economic conditions through fish trading. Higher production cost, transport cost, unhygienic market place, lack of sanitary facilities, poor ice-supply, exploitation by the middlemen, lack of capital and the political disturbances were the common constraints of the fish marketing.", "num_citations": "1\n", "authors": ["934"]}
{"title": "Dependence Cluster Analysis\n", "abstract": " Although the presence of dependence structures within code was established a long time ago it was primarily used for the purpose of slicing which aided code modification, maintenance and debugging process. The use of dependence structure of code for the purpose of categorization and analysis of software quality is a very recent approach. The notions of dependence cluster and dependence pollution was recently introduced through an empirical study which also suggested that global variables were one of the primary causes of dependence clusters within code. The project takes these notions of dependence cluster and dependence pollution to analyze their existence in depth.This project involved development of a technique which could be used to locate and identify global variables that are responsible for formation of large dependence clusters in programs. The technique was implemented with the aid of a tool that allows the automation of the removal process of individual global variables. Other major contributions of the project include proposing framework for categorizing programs according to level of dependence present in them, framework for classifying dependence clusters according to their detection and measurement criteria, techniques that may be used to compare different characteristics of clusters and a framework for categorization of programs according to the likelihood of them containing global variables that are responsible for causing dependence clusters. The framework which uses the likelihood of presence of global variables responsible for causing dependence clusters is given the name Global Dependence Category …", "num_citations": "1\n", "authors": ["934"]}
{"title": "Shelf life and quality of mango as influenced by low temperature storage\n", "abstract": " The experiment was carried out to study the shelf life and postharvest quality of mango as influenced by low temperature storage at the Laboratories of the Department of Horticulture and Biochemistry and the Central Laboratory of the Bangladesh Agricultural University, Mymensingh. Four varieties of mango such as Langra, Fazli, Laksmanbhog and Kalibhog were used in the experiment. Low temperatures used in this experiment were 9, 11, 13 and 15C including a control (room temperature). There were significant variations among the varieties and also among the storage temperature treatments in respect of shelf life, pulp to peel ratio, total weight loss and total sugar content. Although longer shelf life was recorded in fruits stored at lower temperatures (9 and 11C), the fruits did not ripen properly at these temperatures even after keeping at room temperature and also the edible qualities of those fruits were not satisfactory. In case of cv. Fazli, the longest shelf life was obtained in fruits stored at 13C which was statistically identical with those stored at 15C.", "num_citations": "1\n", "authors": ["934"]}
{"title": "Screening and Molecular Characterization of Xylanase-Producing Bacteria from Damp Straw\n", "abstract": " The xylanase-producing bacterial strains were screened from damp straw. The strains were isolated on xylan agar media and screening was carried out by xylanolysis method. The xylanase-producing capacity of the isolates was further confirmed by DNS (dinitrosalisylic acid) method. The isolated strains were identified as Aeromonas on the basis of morphological and colonical characteristics and different biochemical tests. Aeromonas is one of the most important strains producing xylanase that are used for degrading the xylosidic bonds of xylan in plant kingdom. Multi-drug resistant of these strains was confirmed by disc diffusion and antibiotic spread plate method. Plasmid DNA was isolated from maximum xylanase-producing isolate. Agarose gel electrophoresis of the isolated plasmid DNA in 0.8% agarose showed the presence of only one 28 kb plasmid. The plasmid DNA was transformed into nonxylanase-producing sensitive E. coli LE392. The transformants showed xylanase activity as well as multi-drug resistance. Xylanase activity and multi-drug resistance in Aeromonas strain was proposed to be plasmid mediated.", "num_citations": "1\n", "authors": ["934"]}
{"title": "Deploying VoIP over a Small Enterprise Network\n", "abstract": " The possibility of voice communications traveling over the Internet, rather than the PSTN, first became a reality in February 1995 when Vocaltec, Inc. introduced its Internet Phone software. This technology has advanced rapidly. This paper is aimed at making suggestions on things to consider when deploying VoIP onto a small enterprise network. Though the suggestions to be presented are centered on small network, some of the issues are applicable to a bigger network. These suggestions are based on some theoretical analysis, which are supported with some experimental work. An experiment was conducted for about 24 hours in order to capture the network measurement of a small LAN. The results obtained from the measurement were used in analyzing the whole network based on queuing theory; this provides ground for making judicious modifications to the network in order to support the deployment of Voice over IP.", "num_citations": "1\n", "authors": ["934"]}
{"title": "Frequency dependence of GaN/AlGaN HEMT amplifier using time-domain analysis\n", "abstract": " An exact time-domain technique to analyze RF performance considering thermal effects of the GaN/AlGaN HEMT amplifier is reported. The measured maximum output power of 28 dBm with a power gain of 8.2 dB, power added efficiency (PAE) of 19% a 1 μm× 500 μm Al 0.15 Ga 0.85 N/GaN HEMT at 2 GHz are in excellent agreement with theoretical calculations. The calculated third-order intermodulation (IM3) and carrier-to-IM3 ratio at the peak operating power/PAE at 2 GHz are− 16.5 dB and 13.5 dBc, respectively. With output power decreasing to 16 dBm at 2 GHz the above quantities are− 37 dB and 22.5 dBc, respectively. For a 0.45 μm× 250 μm Al 0.14 Ga 0.86 N/GaN HEMT, IM3 and carrier-to-IM3 ratio at 16 dBm output power and 2 GHz are− 50 dB and 36 dBc, respectively. With increasing output power level and frequency these quantities degrade at a higher rate compared to the longer-gate length device.", "num_citations": "1\n", "authors": ["934"]}