{"title": "Towards an industrial use of FLUCTUAT on safety-critical avionics software\n", "abstract": " Most modern safety-critical control programs, such as those embedded in fly-by-wire control systems, perform a lot of floating-point computations. The well-known pitfalls of IEEE 754 arithmetic make stability and accuracy analyses a requirement for this type of software. This need is traditionally addressed through a combination of testing and sophisticated intellectual analyses, but such a process is both costly and error-prone. FLUCTUAT is a static analyzer developed by CEA-LIST for studying the propagation of rounding errors in C programs. After a long time research collaboration with CEA-LIST on this tool, Airbus is now willing to use FLUCTUAT industrially, in order to automate part of the accuracy analyses of some control programs. In this paper, we present the IEEE 754 standard, the FLUCTUAT tool, the types of codes to be analyzed and the analysis methodology, together with code examples and …", "num_citations": "189\n", "authors": ["1769"]}
{"title": "Static analysis of numerical algorithms\n", "abstract": " We present a new numerical abstract domain for static analysis of the errors introduced by the approximation by floating-point arithmetic of real numbers computation, by abstract interpretation [3]. This work extends a former domain [4,8], with an implicitly relational domain for the approximation of the floating-point values of variables, based on affine arithmetic [2]. It allows us to analyze non trivial numerical computations, that no other abstract domain we know of can analyze with such precise results, such as linear recursive filters of different orders, Newton methods for solving non-linear equations, polynomial iterations, conjugate gradient algorithms.", "num_citations": "161\n", "authors": ["1769"]}
{"title": "Static analysis of finite precision computations\n", "abstract": " We define several abstract semantics for the static analysis of finite precision computations, that bound not only the ranges of values taken by numerical variables of a program, but also the difference with the result of the same sequence of operations in an idealized real number semantics. These domains point out with more or less detail (control point, block, function for instance) sources of numerical errors in the program and the way they were propagated by further computations, thus allowing to evaluate not only the rounding error, but also sensitivity to inputs or parameters of the program. We describe two classes of abstractions, a non relational one based on intervals, and a weakly relational one based on parametrized zonotopic abstract domains called affine sets, especially well suited for sensitivity analysis and test generation. These abstract domains are implemented in the Fluctuat static analyzer …", "num_citations": "138\n", "authors": ["1769"]}
{"title": "A policy iteration algorithm for computing fixed points in static analysis of programs\n", "abstract": " We present a new method for solving the fixed point equations that appear in the static analysis of programs by abstract interpretation. We introduce and analyze a policy iteration algorithm for monotone self-maps of complete lattices. We apply this algorithm to the particular case of lattices arising in the interval abstraction of values of variables. We demonstrate the improvements in terms of speed and precision over existing techniques based on Kleene iteration, including traditional widening/narrowing acceleration mecanisms.", "num_citations": "129\n", "authors": ["1769"]}
{"title": "The zonotope abstract domain taylor1+\n", "abstract": " Static analysis by abstract interpretation [1] aims at automatically inferring properties on the behaviour of programs. We focus here on a specific kind of numerical invariants: the set of values taken by numerical variables, with a real numbers semantics, at each control point of a program.", "num_citations": "101\n", "authors": ["1769"]}
{"title": "Asserting the precision of floating-point computations: A simple abstract interpreter\n", "abstract": " The manipulation of real numbers by computers is approximated by floatingpoint arithmetic, which uses a finite representation of numbers. This implies that a (small in general) rounding error may be committed at each operation. Although this approximation is accurate enough for most applications, there are some cases where results become irrelevant because of the precision lost at some stages of the computation, even when the underlying numerical scheme is stable. In this paper, we present a tool for studying the propagation of rounding errors in floating-point computations, that carries out some ideas proposed in [3], [7]. Its aim is to detect automatically a possible catastrophic loss of precision, and its source. The tool is intended to cope with real industrial problems, and we believe it is specially appropriate for critical instrumentation software. On these numerically quite simple programs, we believe our …", "num_citations": "87\n", "authors": ["1769"]}
{"title": "A logical product approach to zonotope intersection\n", "abstract": " We define and study a new abstract domain which is a fine-grained combination of zonotopes with (sub-)polyhedric domains such as the interval, octagon, linear template or polyhedron domains. While abstract transfer functions are still rather inexpensive and accurate even for interpreting non-linear computations, we are able to also interpret tests (i.e. intersections) efficiently. This fixes a known drawback of zonotopic methods, as used for reachability analysis for hybrid systems as well as for invariant generation in abstract interpretation: intersection of zonotopes are not always zonotopes, and there is not even a best zonotopic over-approximation of the intersection. We describe some examples and an implementation of our method in the APRON library, and discuss some further interesting combinations of zonotopes with non-linear or non-convex domains such as quadratic templates and maxplus …", "num_citations": "65\n", "authors": ["1769"]}
{"title": "Static analysis-based validation of floating-point computations\n", "abstract": " Finite precision computations can severely affect the accuracy of computed solutions. We present a static analysis, and a prototype implementing this analysis for C codes, for studying the propagation of rounding errors occurring at every intermediary step in floating-point computations. The analysis presented relies on abstract interpretation by interval values and series of interval error terms. Considering all errors possibly introduced by floating-point numbers, it aims at identifying the operations responsible for the main losses of accuracy. We believe this approach is for now specially appropriate for numerically simple programs which results must be verified, such as critical instrumentation software.", "num_citations": "63\n", "authors": ["1769"]}
{"title": "Static analysis of the accuracy in control systems: Principles and experiments\n", "abstract": " Finite precision computations can severely affect the accuracy of computed solutions. We present a complete survey of a static analysis based on abstract interpretation, and a prototype implementing this analysis for C code, for studying the propagation of rounding errors occurring at every intermediary step in floating-point computations. In the first part of this paper, we briefly present the domains and techniques used in the implemented analyzer, called FLUCTUAT. We describe in the second part, the experiments made on real industrial codes, at Institut de Radioprotection et de Sûreté Nucléaire and at Hispano-Suiza, respectively coming from the nuclear industry and from aeronautics industry. This paper aims at filling in the gaps between some theoretical aspects of the static analysis of floating-point computations that have been described in [13,14,21], and the necessary choices of algorithms and …", "num_citations": "58\n", "authors": ["1769"]}
{"title": "Robustness analysis of finite precision implementations\n", "abstract": " A desirable property of control systems is robustness to inputs, when small perturbations of the inputs of a system will cause only small perturbations on outputs. This property should be maintained at the implementation level, where close inputs can lead to different execution paths. The problem becomes crucial for finite precision implementations, where any elementary computation is affected by an error. In this context, almost every test is potentially unstable, that is, for a given input, the finite precision and real numbers paths may differ. Still, state-of-the-art error analyses rely on the stable test hypothesis, yielding unsound error bounds when the conditional block is not robust to uncertainties. We propose a new abstract-interpretation based error analysis of finite precision implementations, which is sound in presence of unstable tests, by bounding the discontinuity error for path divergences. This gives a …", "num_citations": "51\n", "authors": ["1769"]}
{"title": "A generalization of p-boxes to affine arithmetic\n", "abstract": " We often need to deal with information that contains both interval and probabilistic uncertainties. P-boxes and Dempster–Shafer structures are models that unify both kind of information, but they suffer from the main defect of intervals, the wrapping effect. We present here a new arithmetic that mixes, in a guaranteed manner, interval uncertainty with probabilities, while using some information about variable dependencies, hence limiting the loss from not accounting for correlations. This increases the precision of the result and decreases the computation time compared to standard p-box arithmetic.", "num_citations": "44\n", "authors": ["1769"]}
{"title": "HybridFluctuat: A static analyzer of numerical programs within a continuous environment\n", "abstract": " A new static analyzer is described, based on the analyzer Fluctuat. Its goal is to synthetize invariants for hybrid systems, encompassing a continuous environment described by a system of possibly switched ODEs, and an ANSI C program, in interaction with it. The evolution of the continuous environment is over-approximated using a guaranteed integrator that we developped, and special assertions are added to the program that simulate the action of sensors and actuators, making the continuous environment and the program communicate. We demonstrate our approach on an industrial case study, a part of the flight control software of ASTRIUM’s Automated Transfer Vehicle (ATV).", "num_citations": "43\n", "authors": ["1769"]}
{"title": "Some future challenges in the validation of control systems\n", "abstract": " Starting with our work on the characterization of the imprecision error in programs using floating-point-numbers, by abstract interpretation, this paper shows that there are numerous perspectives, if one wants to fully qualify the numerical quality of control systems, as found in the aeronautical and automotive industry, for instance. Some very common functions (e.g. integrators) are hard to statically analyse, because their numerical correctness depend on a fine-grained specification of the classes of input signals they handle. This gets even more complex in the case of e.g. PID controllers, which interact in closed loop with an external environment, since their input signals are in part the consequence of their own computation, similarly for the imprecision errors. We show examples of non-trivial bad and good numerical behaviours, discuss the results of our methods, and present our current research directions, that should hopefully help characterize the imprecision error of such control systems.", "num_citations": "39\n", "authors": ["1769"]}
{"title": "Inner approximated reachability analysis\n", "abstract": " Computing a tight inner approximation of the range of a function over some set is notoriously difficult, way beyond obtaining outer approximations. We propose here a new method to compute a tight inner approximation of the set of reachable states of non-linear dynamical systems on a bounded time interval. This approach involves affine forms and Kaucher arithmetic, plus a number of extra ingredients from set-based methods. An implementation of the method is discussed, and illustrated on representative numerical schemes, discrete-time and continuous-time dynamical systems.", "num_citations": "38\n", "authors": ["1769"]}
{"title": "Modular static analysis with zonotopes\n", "abstract": " Being able to analyze programs function by function, or module by module is a key ingredient to scalable static analyses. The main difficulty for modular static analysis is to be able to do so while not losing too much precision. In this paper, we present a new summary-based approach that builds on previous work of the authors, a zonotopic functional abstraction, that is economical both in space and time complexity. This approach has been implemented, and experiments on numerical programs, reported here, show that this approach is very efficient, and that we still obtain precise analyses in realistic cases.", "num_citations": "36\n", "authors": ["1769"]}
{"title": "Under-approximations of computations in real numbers based on generalized affine arithmetic\n", "abstract": " We build a new, implicitly relational abstract domain which gives accurate under-approximations of the set of real values that program variables can take. This statement is demonstrated both on a theoretical basis and on non-trivial numerical examples. It is, we believe, the first non-trivial under-approximating numerical domain in the static analysis literature.", "num_citations": "36\n", "authors": ["1769"]}
{"title": "Forward inner-approximated reachability of non-linear continuous systems\n", "abstract": " We propose an approach for computing inner-approximations (also called under-approximations) of reachable sets of dynamical systems defined by non-linear, uncertain, ordinary differential equations. This is a notoriously difficult problem, much more intricate than outer-approximations (also called over-approximations), for which there exist well known solutions, mostly based on Taylor models. The few methods developed recently for inner-approximation mostly rely on backward flowmaps, and extra ingredients, either coming from optimization, or involving topological criteria, are required. Our solution, in comparison, builds on rather inexpensive set-based methods, namely a generalized mean-value theorem combined with Taylor models outer-approximations of the flow and its Jacobian with respect to the uncertain inputs and parameters. We demonstrate with a C/C++ prototype implementation that our method …", "num_citations": "28\n", "authors": ["1769"]}
{"title": "A zonotopic framework for functional abstractions\n", "abstract": " This article formalizes an abstraction of input/output relations, based on parameterized zonotopes, which we call affine sets. We describe the abstract transfer functions and prove their correctness, which allows the generation of accurate numerical invariants. Other applications range from compositional reasoning to proofs of user-defined complex invariants and test case generation.", "num_citations": "27\n", "authors": ["1769"]}
{"title": "Static analysis of programs with imprecise probabilistic inputs\n", "abstract": " Having a precise yet sound abstraction of the inputs of numerical programs is important to analyze their behavior. For many programs, these inputs are probabilistic, but the actual distribution used is only partially known. We present a static analysis framework for reasoning about programs with inputs given as imprecise probabilities: we define a collecting semantics based on the notion of previsions and an abstract semantics based on an extension of Dempster-Shafer structures. We prove the correctness of our approach and show on some realistic examples the kind of invariants we are able to infer.", "num_citations": "22\n", "authors": ["1769"]}
{"title": "Perturbed affine arithmetic for invariant computation in numerical program analysis\n", "abstract": " We completely describe a new domain for abstract interpretation of numerical programs. Fixpoint iteration in this domain is proved to converge to finite precise invariants for (at least) the class of stable linear recursive filters of any order. Good evidence shows it behaves well also for some non-linear schemes. The result, and the structure of the domain, rely on an interesting interplay between order and topology.", "num_citations": "21\n", "authors": ["1769"]}
{"title": "Inner and outer approximating flowpipes for delay differential equations\n", "abstract": " Delay differential equations are fundamental for modeling networked control systems where the underlying network induces delay for retrieving values from sensors or delivering orders to actuators. They are notoriously difficult to integrate as these are actually functional equations, the initial state being a function. We propose a scheme to compute inner and outer-approximating flowpipes for such equations with uncertain initial states and parameters. Inner-approximating flowpipes are guaranteed to contain only reachable states, while outer-approximating flowpipes enclose all reachable states. We also introduce a notion of robust inner-approximation, which we believe opens promising perspectives for verification, beyond property falsification. The efficiency of our approach relies on the combination of Taylor models in time, with an abstraction or parameterization in space based on affine forms, or …", "num_citations": "19\n", "authors": ["1769"]}
{"title": "A scalable algebraic method to infer quadratic invariants of switched systems\n", "abstract": " We present a new numerical abstract domain based on ellipsoids designed for the formal verification of switched linear systems. Unlike the existing approaches, this domain does not rely on a user-given template. We overcome the difficulty that ellipsoids do not have a lattice structure by exhibiting a canonical operator overapproximating the union. This operator is the only one that permits the performance of analyses that are invariant with respect to a linear transformation of state variables. It provides the minimum volume ellipsoid enclosing two given ellipsoids. We show that it can be computed in O(n3) elementary algebraic operations. We finally develop a fast nonlinear power-type algorithm, which allows one to determine sound quadratic invariants on switched systems in a tractable way, by solving fixed-point problems over the space of ellipsoids. We test our approach on several benchmarks, and compare it …", "num_citations": "19\n", "authors": ["1769"]}
{"title": "Inner and outer reachability for the verification of control systems\n", "abstract": " We investigate the information and guarantees provided by different inner and outer approximated reachability analyses, for proving properties of dynamical systems. We explore the connection of these approximated sets with the maximal and minimal reachable sets of Mitchell [31], with an additional notion of robustness to disturbance. We demonstrate the practical use of a specific computation of these approximated reachable sets. We revisit in particular the reachavoid properties.", "num_citations": "18\n", "authors": ["1769"]}
{"title": "Extraction of (R, L, C, G) interconnect parameters in 2D transmission lines using fast and efficient numerical tools\n", "abstract": " We present a new simulation method for a fast and efficient extraction of frequency dependent R,L,C,G parameters in 2D transmission line structures embedded in a multilayered dielectric environment. Our method is based on two variational finite element formulations and use very efficient numerical tools (fictitious domain approach (Putot et al., 1999), fast solver, domain decomposition). It needs only an unstructured mesh of the conductor boundaries and is very memory and CPU time efficient. The results are validated on test structures with an original method of measurements and characterization.", "num_citations": "16\n", "authors": ["1769"]}
{"title": "A zonotopic framework for functional abstractions\n", "abstract": " This article fully describes an abstract domain, dedicated to the generation of accurate numerical invariants and based on zonotopes parameterized by vectors of affine forms. We introduce the abstract transfer functions, prove their correctness and demonstrate their efficiency. One strength of the domain is its simple abstraction of non-linear operations. These affine vectors also abstract input/output relations, which allows in particular modular analysis, proofs of user-defined complex invariants and test case generation. Finally, the affine vectors like parametrization is flexible enough to allow variations that yield different interesting abstractions, such as inner-approximations or abstraction of probabilistic information.", "num_citations": "15\n", "authors": ["1769"]}
{"title": "General inner approximation of vector-valued functions\n", "abstract": " This paper addresses the problem of evaluating a subset of the range of a vector-valued function. It is based on a work by Gold- sztejn and Jaulin which provides methods based on interval analysis to address this problem when the dimension of the domain and co-domain of the function are equal. This paper extends this result to vector-valued functions with domain and co-domain of different dimensions. This ex- tension requires the knowledge of the rank of the Jacobian function on the whole domain. This leads to the sub-problem of extracting an in- terval sub-matrix of maximum rank from a given interval matrix. Three different techniques leading to approximate solutions of this extraction are proposed and compared.", "num_citations": "14\n", "authors": ["1769"]}
{"title": "An accurate join for zonotopes, preserving affine input/output relations\n", "abstract": " Zonotopes are a convenient abstract domain for the precise analysis of programs with numerical variables. Compared to the domain of convex polyhedra, it is less expensive and may easily handle non-linear assignments. However, the classical join operator of this abstract domain does not always preserve linear invariants, unlike the convex hull. We present a global join operator that preserves some affine relations. We end up by showing some experiments conducted on the constrained Taylor1+ domain of Apron.", "num_citations": "11\n", "authors": ["1769"]}
{"title": "A fast and accurate computation of interconnect capacitance\n", "abstract": " We present a new simulation tool for efficient extraction of 3D capacitance matrix in interconnect structures embedded in a multilayered dielectric environment. We use a fictitious domain method, which replaces the initial problem on a complex geometry by a problem on a simple shape domain embedding the initial domain, and is consequently ideally suited for the treatment of complex geometries. Numerical results confirm that this method is more efficient, both in CPU time and memory, than a finite elements or a boundary elements method.", "num_citations": "11\n", "authors": ["1769"]}
{"title": "Weakly relational domains for floating-point computation analysis\n", "abstract": " We present new numerical abstract domains for static analysis of the errors introduced by the approximation by floating-point arithmetic of real numbers computation, by abstract interpretation [2]. The analysis follows the floatingpoint computation, and bounds at each operation, the error committed between the floating-point and the real result. These new domains extend a former domain [3],[5], based for each variable on the abstraction of the floating-point value by an interval, and of the error by a sum of intervals decomposing the provenance of the total error along the control points (or groups of points) in the source code.The idea of this former domain is to provide some information on the source of errors in the program. The origin of the main losses of precision is most of the time very localized, so identifying the operations responsible for these main losses, while bounding the total error, can be very useful. But it does not allow to improve the accuracy of the total error on one variable, compared to the much less costly floating-point plus total error version-it can prove even worse some times. Indeed, the correlations between variables are not used for a tighter computation values or of errors, and the method suffers from the classical drawbacks of intervals.", "num_citations": "10\n", "authors": ["1769"]}
{"title": "Design of fixed-point embedded systems (defis) french anr project\n", "abstract": " Embedded applications are usually coming with stringent constraints in term of cost, energy consumption and realtime. Consequently, fixed-point arithmetic is mainstream for their implementation into embedded systems. Hence, the main objective of the french ANR project DEFIS is to provide a complete design flow for fixed-point refinement of complex applications. This tool flow is like the missing link between high-level application specification tools and low-level implementation.", "num_citations": "9\n", "authors": ["1769"]}
{"title": "A reduced product of absolute and relative error bounds for floating-point analysis\n", "abstract": " Rigorous estimation of bounds on errors in finite precision computation has become a key point of many formal verification tools. The primary interest of the use of such tools is generally to obtain worst-case bounds on the absolute errors. However, the natural bound on the elementary error committed by each floating-point arithmetic operation is a bound on the relative error, which suggests that relative error bounds could also play a role in the process of computing tight error estimations. In this work, we introduce a very simple interval-based abstraction, combining absolute and relative error propagations. We demonstrate with a prototype implementation how this simple product allows us in many cases to improve absolute error bounds, and even to often favorably compare with state-of-the art tools, that rely on much more costly relational abstractions or optimization-based estimations.", "num_citations": "8\n", "authors": ["1769"]}
{"title": "Robust under-approximations and application to reachability of non-linear control systems with disturbances\n", "abstract": " We describe a set-based approach, relying on mean-value extensions, for computing guaranteed under-approximations of ranges (or images) of continuously differentiable functions f from Rm to Rn, including what we call robust ranges, i.e., ranges of functions under adversarial uncertainties. Our method is capable of computing efficiently, at a low computational cost, full n-dimensional subsets of the image of f. As an application, we show how to compute under-approximations of robust reachable sets of non-linear controlled dynamical systems under timevarying uncertainties, which is central to many verification problems in control theory.", "num_citations": "7\n", "authors": ["1769"]}
{"title": "On-the-fly control of unknown smooth systems from limited data\n", "abstract": " We investigate the problem of data-driven, on-the-fly control of systems with unknown nonlinear dynamics where data from only a single finite-horizon trajectory and possibly side information on the dynamics are available. Such side information may include knowledge of the regularity of the dynamics, monotonicity of the states, or decoupling in the dynamics between the states. Specifically, we develop two algorithms, DaTaReach and DaTaControl, to over-approximate the reachable set and design control signals for the system on the fly. DaTaReach constructs a differential inclusion that contains the unknown vector field. Then, it computes an over-approximation of the reachable set based on interval Taylor-based methods applied to systems with dynamics described as differential inclusions. DaTaControl enables convex-optimization-based, near-optimal control using the computed over-approximation and the …", "num_citations": "6\n", "authors": ["1769"]}
{"title": "A fast method to compute disjunctive quadratic invariants of numerical programs\n", "abstract": " We introduce a new method to compute non-convex invariants of numerical programs, which includes the class of switched affine systems with affine guards. We obtain disjunctive and non-convex invariants by associating different partial execution traces with different ellipsoids. A key ingredient is the solution of non-monotone fixed points problems over the space of ellipsoids with a reduction to small size linear matrix inequalities. This allows us to analyze instances that are inaccessible in terms of expressivity or scale by earlier methods based on semi-definite programming.", "num_citations": "6\n", "authors": ["1769"]}
{"title": "Static analysis of numerical programs and systems\n", "abstract": " Software-driven systems are pervasive in today’s world, and grow more complex every day. While theirfrequent-dysfunctions are mainly a hassle in most applications, the safety-critical systems can not allow bugs, their correct behavior has to be proved thoroughly. In that respect, the norms of the safety-critical industries, such as DO-178B [128] and its recent update DO-178C [129] for the aeronautic industry, are evolving towards replacing part of the tests by methods providing guarantees for all possible executions, such as static analysis.Meanwhile, the complexity of computation in these safety-critical systems is quickly increasing. For instance, Airbus has been using fly-by-wire systems, that is flight control computers, to replace manual flight control, for all its commercial airplanes since the A320 program, officially launched in 1984. Of course, if correct, these computer-driven systems increase the safety and performance of the flight control. But proving their correction, whatever the conditions driven by the airplane’s environment, is a challenge at the state of the art of validation. These systems now involve millions of lines of programs, and, this will be the point of this document, quite intricate numerical computations. Indeed, the control and monitoring of physical systems needs computations in real numbers. Of course, these can only be approximated on a computer: most applications now use floating-point approximations, a flexible and efficient representation, well specified by the IEEE-754 standard [1]. By specifying in particular the size of the mantissa and the exponent of floating-point numbers, this norm greatly improved the portability of …", "num_citations": "5\n", "authors": ["1769"]}
{"title": "Discrete choice in the presence of numerical uncertainties\n", "abstract": " Numerical uncertainties from noisy inputs or finite-precision roundoff errors are unavoidable on resource-constrained systems. While techniques exist to compute worst-case bounds on these errors for arithmetic operations, these approaches do not generalize to programs which take discrete decisions. In this case, the more interesting quantity is the probability of the program making the wrong decision. In this paper, we study two approaches to compute a guaranteed bound on this probability: 1) exact probabilistic inference and 2) probabilistic static analysis. By themselves, they provide accuracy and scalability, respectively, but unfortunately not at the same time. We propose an extension to the latter approach which allows us to bound the probability tightly and fully automatically while scaling to small but interesting embedded examples.", "num_citations": "4\n", "authors": ["1769"]}
{"title": "Formal verification of station keeping maneuvers for a planar autonomous hybrid system\n", "abstract": " We formally verify a hybrid control law designed to perform a station keeping maneuver for a planar vehicle. Such maneuver requires that the vehicle reaches a neighborhood of its station in finite time and remains in it while waiting for further instructions. We model the dynamics as well as the control law as a hybrid program and formally verify both the reachability and safety properties involved. We highlight in particular the automated generation of invariant regions which turns out to be crucial in performing such verification. We use the theorem prover Keymaera X to discharge some of the generated proof obligations.", "num_citations": "4\n", "authors": ["1769"]}
{"title": "A generalization of P-boxes to affine arithmetic, and applications to static analysis of programs\n", "abstract": " Some inputs being known set theoretically (non-deterministic inputs) or in probability (probabilistic inputs) eg temperature distribution maybe known but we might only know a range for pressure, in some software-driven apparatus In fact, more generally, inputs may be thought of as given by imprecise probabilities", "num_citations": "4\n", "authors": ["1769"]}
{"title": "Autonomous racecar control in head-to-head competition using mixed-integer quadratic programming\n", "abstract": " This work deals with the control of an autonomous racecar that should perform the fastest lap time on a track, while in presence of an opponent vehicle. Controlling the vehicle at its physical limit while ensuring collision-freeness is a challenging problem.We propose a Nonlinear Model Predictive Control (NMPC) model under a minimum time objective, which integrates the opponent vehicle’s trajectory as a collision-avoidance constraint. By using a curvilinear coordinates system, progress time can be set as a direct optimization objective. The approximation of vehicle’s shape is proposed and collision-avoidance constraints can therefore be represented efficiently. A safe control strategy is finally generated by a method based on Mixed-Integer Quadratic Programming (MIQP). We perform several experiments on our prototype implementation and discuss its performance issues.", "num_citations": "3\n", "authors": ["1769"]}
{"title": "A topological method for finding invariant sets of switched systems\n", "abstract": " We revisit the problem of finding controlled invariants sets (viability), for a class of differential inclusions, using topological methods based on Wazewski property. In many ways, this generalizes the Viability Theorem approach, which is itself a generalization of the Lyapunov function approach for systems described by ordinary differential equations. We give a computable criterion based on SoS methods for a class of differential inclusions to have a non-empty viability kernel within some given region. We use this method to prove the existence of (controlled) invariant sets of switched systems inside a region described by a polynomial template, both with time-dependent switching and with state-based switching through a finite set of hypersurfaces. A Matlab implementation allows us to demonstrate its use.", "num_citations": "3\n", "authors": ["1769"]}
{"title": "A new algorithm for interconnect capacitance extraction based on a fictitious domain method\n", "abstract": " We propose a new approach for fast and accurate extraction of capacitance in multiconductor cells embedded in multiple dielectric media. We use the so-called fictitious domain method with Lagrange multipliers for the problem formulation. It leads to a coupled linear system in which unknowns are the potential on a regular 3D grid of a simple-shaped domain, imbedding the dielectric media, and the charge on a mesh of the conductor surfaces. Thanks to the regular grid, the storage of information related to the volumic mesh is not necessary and we can use fast solvers. Numerical results on 3D complex structures show that the method is more efficient, both in time and memory, than a finite elements or a boundary elements method.", "num_citations": "3\n", "authors": ["1769"]}
{"title": "On-The-Fly Control of Unknown Systems: From Side Information to Performance Guarantees through Reachability\n", "abstract": " We develop data-driven algorithms for reachability analysis and control of systems with a priori unknown nonlinear dynamics. The resulting algorithms not only are suitable for settings with real-time requirements but also provide provable performance guarantees. To this end, they merge data from only a single finite-horizon trajectory and, if available, various forms of side information. Such side information may include knowledge of the regularity of the dynamics, algebraic constraints on the states, monotonicity, or decoupling in the dynamics between the states. Specifically, we develop two algorithms,  and , to over-approximate the reachable set and design control signals for the system on the fly.  constructs a differential inclusion that contains the unknown dynamics. Then, in a discrete-time setting, it over-approximates the reachable set through interval Taylor-based methods applied to systems with dynamics described as differential inclusions. We provide a bound on the time step size that ensures the correctness and termination of .  enables convex-optimization-based control using the computed over-approximation and the receding-horizon control framework. Besides,  achieves near-optimal control and is suitable for real-time control of such systems. We establish a bound on its suboptimality and the number of primitive operations it requires to compute control values. Then, we theoretically show that  achieves tighter suboptimality bounds with an increasing amount of data and richer side information. Finally, experiments on a unicycle, quadrotor, and aircraft systems …", "num_citations": "2\n", "authors": ["1769"]}
{"title": "A topological method for finding invariant sets of continuous systems\n", "abstract": " A usual way to find positive invariant sets of ordinary differential equations is to restrict the search to predefined finitely generated shapes, such as linear templates, or ellipsoids as in classical quadratic Lyapunov function based approaches. One then looks for generators or parameters for which the corresponding shape has the property that the flow of the ODE goes inwards on its border. But for non-linear systems, where the structure of invariant sets may be very complicated, such simple predefined shapes are generally not well suited. The present work proposes a more general approach based on a topological property, namely Ważewski’s property. Even for complicated non-linear dynamics, it is possible to successfully restrict the search for isolating blocks of simple shapes, that are bound to contain non-empty invariant sets. This approach generalizes the Lyapunov-like approaches, by allowing for …", "num_citations": "2\n", "authors": ["1769"]}
{"title": "Automatic analysis of imprecision errors in software\n", "abstract": " Machines only compute with finite-precision arithmetic, using for instance IEEE 754 floatingpoint number, an approximation of the mathematical real number field. Also, data that programs process are not always known with precision. There are hopefully a number of means to deal with this: a careful mathematical design of the algorithmics involved, the use of alternative arithmetics, the study of the effect on the algorithm of this imprecision, and of uncertainties of its inputs and parameters. For the last point, different methods have been designed, among which interval and stochastic methods. Our approach is slightly different [4]. We start with a source code written in C, assertions describing the range of inputs, their imprecision errors, and possibly the range of the gradient of their values, and we automatically compute, ie by a tool, an over-approximation of the range of all variables known at the end of the code, and of their imprecision errors. The latter have two sources: the propagation of the initial imprecision errors, and the errors due to the IEEE 754 semantics of floating-point computations. This is based on abstract interpretation [3], which ensures the correctness of the approach. We only describe in this abstract some of the basic ideas of the underlying mathematical model computing these over-approximations, the full model will be developped in the final version of the paper. Our mathematical model describing the propagation of errors for sets of executions of a code is based on ideas from affine arithmetic [2]. Affine arithmetic is an improvement of interval arithmetic allowing to take into account linear correlations. Typically, if x takes its values in …", "num_citations": "2\n", "authors": ["1769"]}
{"title": "Neural Networks with Physics-Informed Architectures and Constraints for Dynamical Systems Modeling\n", "abstract": " Effective inclusion of physics-based knowledge into deep neural network models of dynamical systems can greatly improve data efficiency and generalization. Such a-priori knowledge might arise from physical principles (e.g., conservation laws) or from the system's design (e.g., the Jacobian matrix of a robot), even if large portions of the system dynamics remain unknown. We develop a framework to learn dynamics models from trajectory data while incorporating a-priori system knowledge as inductive bias. More specifically, the proposed framework uses physics-based side information to inform the structure of the neural network itself, and to place constraints on the values of the outputs and the internal states of the model. It represents the system's vector field as a composition of known and unknown functions, the latter of which are parametrized by neural networks. The physics-informed constraints are enforced via the augmented Lagrangian method during the model's training. We experimentally demonstrate the benefits of the proposed approach on a variety of dynamical systems -- including a benchmark suite of robotics environments featuring large state spaces, non-linear dynamics, external forces, contact forces, and control inputs. By exploiting a-priori system knowledge during training, the proposed approach learns to predict the system dynamics two orders of magnitude more accurately than a baseline approach that does not include prior knowledge, given the same training dataset.", "num_citations": "1\n", "authors": ["1769"]}
{"title": "A few lessons learned in reinforcement learning for quadcopter attitude control\n", "abstract": " In the context of developing safe air transportation, our work is focused on understanding how Reinforcement Learning methods can improve the state of the art in traditional control, in nominal as well as non-nominal cases. The end goal is to train provably safe controllers, by improving both training and verification methods. In this paper, we explore this path for controlling the attitude of a quadcopter: we discuss theoretical as well as practical aspects of training neural nets for controlling a crazyflie 2.0 drone. In particular we describe thoroughly the choices in training algorithms, neural net architecture, hyperparameters, observation space etc. We also discuss the robustness of the obtained controllers, both to partial loss of power for one rotor and to wind gusts. Finally, we measure the performance of the approach by using a robust form of a signal temporal logic to quantitatively evaluate the vehicle's behavior.", "num_citations": "1\n", "authors": ["1769"]}
{"title": "A concoction of zonotope abstraction and constraint programming for finding an invariant\n", "abstract": " A Concoction of Zonotope Abstraction and Constraint Programming for finding an Invariant Page 1 A Concoction of Zonotope Abstraction and Constraint Programming for finding an Invariant Bibek Kabi, Eric Goubault and Sylvie Putot LIX, Ecole Polytechnique, CNRS, Université Paris-Saclay 91128 Palaiseau, France bibek@lix.polytechnique.fr, goubault@lix.polytechnique.fr, putot@lix.polytechnique.fr Keywords: abstract interpretation, constraint solving, inductive invariants, zonotopes Synthesizing an invariant is a key concept in formal verification ensuring correctness of programs and finding bugs [1]. The standard method for finding an invariant is to look for inductive invariants, which is a stronger form of invariant. This work deals with the challenges associated while combining abstract interpretation (zonotopes) and constraint programming for infering inductive invariants. The well-known approach for finding …", "num_citations": "1\n", "authors": ["1769"]}
{"title": "Analyse statique de programmes et systèmes numériques.\n", "abstract": " Alors que la complexité des traitements informatiques dans les systèmes embarqués croit chaque jour, la sûreté du fonctionnement de ces systèmes devient un enjeu crucial, tout particulièrement pour les systèmes critiques. Plus largement, synthétiser et garantir des propriétés sur le comportement d’un programme, est un objectif naturel et de large utilité. Cette habilitation (Putot, 2012) porte sur la validation automatique de propriétés numériques des programmes, par des méthodes d’analyse statique par interprétation abstraite (Cousot, Cousot, 1977).Une première partie du document porte sur une classe de domaines abstraits zonotopiques (Goubault, Putot, 2006; 2008; 2009; Ghorbal et al., 2009; 2010; Goubault, Putot, Vedrine, 2012; Goubault, Gall, Putot, 2012), faiblement relationnels et peu coûteux. Ces domaines sont basés sur l’arithmétique affine (Comba, Stolfi, 1993), une extension de l’arithmétique d …", "num_citations": "1\n", "authors": ["1769"]}
{"title": "Calcul des capacités parasites dans les interconnexions des circuits intégrés par une méthode de domaines fictifs\n", "abstract": " Cette thèse présente une méthode performante pour le calcul des capacités parasites dues aux interconnexions des circuits intégrés. Il s'agit de calculer la charge des conducteurs, comme la dérivée normale à la surface de ces conducteurs, du potentiel solution de l'équation de Laplace sur des couches horizontales, la valeur du potentiel étant fixée constante sur chaque conducteur. La difficulté de la résolution numérique provient de la complexité des structures : sur une portion de circuit d'une surface d'un centimètre carré et d'une hauteur de quelques microns, il peut y avoir plus d'un kilomètre d'interconnexions, c'est-à-dire de fils conducteurs enchevêtrés. Une méthode de domaines fictifs avec multiplicateurs de Lagrange surfaciques est utilisée. Elle donne une formulation mixte du problème, couplant le potentiel sur un domaine parallélépipédique contenant le circuit, et la charge à la surface des conducteurs. Nous en proposons une approximation, qui tient compte du saut du gradient du potentiel à travers la surface des conducteurs dans la discrétisation du potentiel, tout en menant à un système que l'on peut résoudre par une méthode rapide. Cette approximation garantit une bonne convergence du calcul de la charge vers la valeur réelle, sans condition de compatibilité contraignante entre les maillages de volume et de surface. Une implémentation efficace en dimension 3, avec laquelle nous avons effectué des tests numériques sur des structures réelles, permet de montrer l'intérêt de la méthode, en temps de calcul et en place mémoire.", "num_citations": "1\n", "authors": ["1769"]}