{"title": "Review on teaching and learning of computational thinking through programming: What is next for K-12?\n", "abstract": " Programming is more than just coding, for, it exposes students to computational thinking which involves problem-solving using computer science concepts like abstraction and decomposition. Even for non-computing majors, computational thinking is applicable and useful in their daily lives. The three dimensions of computational thinking are computational concepts, computational practices and computational perspectives. In recent years, the availability of free and user-friendly programming languages has fuelled the interest of researchers and educators to explore how computational thinking can be introduced in K-12 contexts. Through an analysis of 27 available intervention studies, this paper presents the current trends of empirical research in the development of computational thinking through programming and suggests possible research and instructional implications. From the review, we propose that more K …", "num_citations": "1040\n", "authors": ["874"]}
{"title": "Open-source learning management system and Web 2.0 online social software applications as learning platforms for an elementary school in Singapore\n", "abstract": " This paper analyses how an elementary-level future school in Singapore implements and uses various open-source online platforms, which are easily available online and could be implemented with minimal software cost, for the purpose of teaching and learning. Online platforms have the potential to facilitate students’ engagement for independent and collaborative learning, enhance student–teacher interactions, and develop students’ technological skills. A framework is constructed to facilitate the conceptualisation of the various pedagogical approaches for learning using such online platforms – learning from and with technology is proposed. Learning from technology leans itself more towards the didactic and behaviouristic theories whereas learning with technology has its origin from the constructivism and social constructivism paradigms. In addition, both the didactic and constructivist pedagogical approaches …", "num_citations": "22\n", "authors": ["874"]}
{"title": "Case studies of elementary children’s engagement in computational thinking through scratch programming\n", "abstract": " Scratch is a programming environment designed to facilitate children’s engagement in computational thinking through the creation of interactive multimedia products. It is purported that children’s engagement in computational thinking can possibly build their problem-solving skills, which is a key twenty-first-century competency. As such, Scratch programming has attracted considerable attention in the educational field recently, especially through the integration of Scratch programming into the school curriculum. Despite this increased interest, there is limited understanding of the possible achievements and challenges that children with different programming abilities may have when engaging in computational thinking. Such studies are critical for understanding the computational thinking of elementary students and are useful for helping educators to better design programming lessons. To address this gap …", "num_citations": "17\n", "authors": ["874"]}
{"title": "Design, customization and implementation of energy simulation with 5E model in elementary classroom\n", "abstract": " Science simulations are popular among educators as such simulations afford for multiple visual representation and interactivity. Despite the popularity and abundance on the internet, our literature review suggested little research has been conducted on the use of simulation in elementary school. Thus, an exploratory pilot case study was conducted to address this research gap. In this study, an open source energy simulation was remixed for use in elementary school targeted at the Grade 4 & 5 students as an after-school enrichment program. We proposed 3 stages: design, customization and implementation, to provide useful insights with the aim to allow other educators to conduct their own remixed simulation lessons. The simulation design principles (eg, learning outcomes and colour coding) with the corresponding TPACK construct that emerged from the design and customization stages were reported. Such …", "num_citations": "14\n", "authors": ["874"]}
{"title": "Addressing learning difficulties in Newtons 1st and 3rd Laws through problem based inquiry using Easy Java Simulation\n", "abstract": " We develop an Easy Java Simulation (EJS) model for students to visualize Newtons 1st and 3rd laws, using frictionless constant motion equation and a spring collision equation during impact. Using Physics by Inquiry instructional (PbI) strategy, the simulation and its problem based inquiry worksheet aim to enhance learning of these two Newtonian concepts. We report results from Experimental (N=62 students) and Control (N=67) Groups in 11 multiple choice questions pre and post tests, conducted by three teachers in the school. Results suggest, at 95 percent confidence level, significant improvement for concept of Newtons 1st Law while not so for Newtons 3rd Law. A Focus Group Discussion revealed students confirming the usefulness of the EJS model in visualizing the 1st Law while not so much for the 3rd Law. We speculate the design ideas for constant velocity motion in the computer model coupled with the PbI worksheet did allow for making sense and experiencing of the 1st Law, where traditional pen-paper representations could not. We have improved the features for the action-reaction contact forces visualization associated with the 3rd Law and we hope other teachers will find the simulation useful for their classes and further customize them to benefit all mankind, becoming citizens for the world.", "num_citations": "12\n", "authors": ["874"]}
{"title": "Exploring the use of online space in an elementary school\n", "abstract": " This paper analysed how three teacher-researchers of Singapore’s elementary school used online space extensively in Grade 2–Grade 4 classrooms. Such online space, made possible by free and readily available web 2.0 and open source applications, was meant to complement the physical learning space as such space can allow learning activities, which were otherwise not possible in the typical classroom setting, to be carried out. The results revealed that students have positive learning experience but the learning impact was small. Despite such unfaltering results, the teacher-researchers were not daunted due to their strong conviction that technology is vital in their students’ learning.", "num_citations": "11\n", "authors": ["874"]}
{"title": "Computer Models Design for Teaching and Learning using Easy Java Simulation\n", "abstract": " We are teachers who have benefited from the Open Source Physics (Brown, 2012; Christian, 2010; Esquembre, 2012) community's work and we would like to share some of the computer models and lesson packages that we have designed and implemented in five schools grade 11 to 12 classes. In a ground-up teacher-leadership (MOE, 2010) approach, we came together to learn, advancing the professionalism (MOE, 2009) of physics educators and improve students' learning experiences through suitable blend (Jaakkola, 2012) of real equipment and computer models where appropriate . We will share computer models that we have remixed from existing library of computer models into suitable learning environments for inquiry of physics customized (Wee & Mak, 2009) for the Advanced Level Physics syllabus (SEAB, 2010, 2012). We hope other teachers would find these computer models useful and remix them to suit their own context, design better learning activities and share them to benefit all humankind, becoming citizens for the world. This is an eduLab (MOE, 2012b; Wee, 2010) project funded by the National Research Fund (NRF) Singapore and Ministry of Education (MOE) Singapore.", "num_citations": "4\n", "authors": ["874"]}
{"title": "Designing open source computer models for physics by inquiry using easy Java simulation\n", "abstract": " The Open Source Physics community has created hundreds of physics computer models (Wolfgang Christian, Esquembre, & Barbato, 2011; F. K. Hwang & Esquembre, 2003) which are mathematical computation representations of real-life Physics phenomenon. Since the source codes are available and can be modified for redistribution licensed Creative Commons Attribution or other compatible copyrights like GNU General Public License (GPL), educators can customize (Wee & Mak, 2009) these models for more targeted productive (Wee, 2012) activities for their classroom teaching and redistribute them to benefit all humankind. In this interactive event, we will share the basics of using the free authoring toolkit called Easy Java Simulation (W. Christian, Esquembre, & Mason, 2010; Esquembre, 2010) so that participants can modify the open source computer models for their own learning and teaching needs. These computer models has the potential to provide the experience and context, essential for deepening students conceptual understanding of Physics through student centred guided inquiry approach (Eick, Meadows, & Balkcom, 2005; Jackson, Dukerich, & Hestenes, 2008; McDermott, Shaffer, & Rosenquist, 1995; Wee, Lee, & Goh, 2011).", "num_citations": "4\n", "authors": ["874"]}
{"title": "Teaching with technology in a Future School in Singapore: A mathematics teacher’s experience\n", "abstract": " Over the last few years Singapore Government has been funding the establishment and operations of a small group of experimental technology-rich schools. These schools were known as “Future Schools” where teachers were encouraged to experiment with and apply technologies in their practice to enhance teaching and learning in line with the demands of the workplace in the future. One of the authors of this article was engaged as a Mathematics teacher in a Future School over the last four years. This article provides reflection on this experience, outlines issues that facilitated and impeded effectiveness of technology integration, and provides recommendations for teachers, policy-makers and researchers involved with technology integration in school.", "num_citations": "1\n", "authors": ["874"]}