{"title": "Visualizing a multiagent-based medical diagnosis system using a methodology based on use case maps\n", "abstract": " Multi-agent systems are realized as a practical solution to the problem of constructing flexible and dynamic environments. Understanding such systems needs a high-level visual view of how the system operates as a whole to achieve some application related purpose. In this paper, we demonstrate how a visual high-level view called Use Case Maps (UCMs) may help in visualizing, understanding, and defining the behaviour of a Multi-agent medical diagnostic system.", "num_citations": "25\n", "authors": ["1261"]}
{"title": "An Approach to Improvement the Usability in Software Products\n", "abstract": " One of the significantaspects of software quality is usability. It is one of the characteristics that judge by the success or failure of software applications. The most important risk facing the software applications is usability which may lead to the existence of a gap between users and systems. This may lead to system failure because of Poor design. This is due to the design is not based on the desires and requirements of the customer. To overcome these problems, this paper proposed an approach to improve usability of software applications to meet the needs of the customer and interacts with the user easily with an efficient and effective manner. The proposed approach is based prototyping technique due to itssimplicity and it does not require additional costs to elicit precise and complete requirement and design.", "num_citations": "19\n", "authors": ["1261"]}
{"title": "A framework for the evaluation of agent-oriented methodologies\n", "abstract": " A number of methodologies are being suggested for multi-agent systems. Yet, their application is still very limited because they still lack several aspects for the development of agent systems and require improvement. In this context, a comparative framework for the evaluation of those methodologies is needed in order to show their advantages and disadvantages. This framework is an important factor for their improvement and development. This paper presents a framework for comparison and evaluation of agent methodologies. Several known methodologies are evaluated using this framework. The framework aims at recognizing the shortcomings of each of the methodologies and should help those pursuing development and improvement of agent oriented methodologies.", "num_citations": "18\n", "authors": ["1261"]}
{"title": "MASD: Multi-agent systems development methodology\n", "abstract": " In recent years, multi-agent systems gained growing acceptance as a required technology to develop complex distributed systems. As result, there is an increased need for practical methodology for developing such systems. This paper presents a new Multi-Agent System Development (MASD) methodology developed over several years through analyzing and studying most of the existing agent oriented methodologies. This new methodology is constructed based on the strengths and weaknesses of existing methodologies. MASD aims to provide designers of agent-based systems with a set of methods and guidelines that allow them to control the construction process of complex systems, enabling software engineers to specify agent-based systems that would be implemented within an execution environment, for example the Jadex platform. MASD differs from existing methodologies in that it is a detailed and …", "num_citations": "17\n", "authors": ["1261"]}
{"title": "MASD: towards a comprehensive multi-agent system development methodology\n", "abstract": " In recent years multi-agent systems have gained a growing acceptance as a required technology to develop complex distributed systems. As result, there is a growing need for practical methodology for developing such systems. This paper presents a new Multi-Agent System Development (MASD) methodology, which has been developed over several years through analyzing and studying most of the existing agent-oriented ones. This methodology is constructed based on the strengths and weaknesses of existing methodologies. MASD aims to provide designers of agent-based systems with a set of methods and guidelines to allow them to control the construction process of complex systems. It enables software engineers to specify agent-based systems that would be implemented within an execution environment, for example Jadex platform. MASD differs from existing methodologies in that, it is a detailed …", "num_citations": "11\n", "authors": ["1261"]}
{"title": "Aspect-oriented requirements engineering: approaches and techniques\n", "abstract": " Aspect Oriented Software Development (AOSD) builds on the concept of Separation of Concerns (SoC). It improves software modularity by encapsulating crosscutting concerns into new units called aspects. Aspect Oriented Requirements Engineering (AORE) is an early stage of AOSD. It handles the identification and analysis of crosscutting concerns in requirements. The systematic activities of SoC are identification, separation, representation and composition of concerns. Numerous approaches have been proposed to support the identification and treatment of aspectual requirements. A large body of literature has been found dealing with crosscutting concerns in requirements phase. The aim of this paper is to review and investigate this literature. Few of these approaches provide validation techniques of elicited aspects. The analysis presented in this paper shows that, the validation of aspectual requirements …", "num_citations": "9\n", "authors": ["1261"]}
{"title": "Validation Framework for Aspectual Requirements Engineering (ValFAR)\n", "abstract": " Aspect-Oriented Requirements Engineering (AORE) extends the existing requirements engineering approaches to support the identification and handling of crosscutting concerns. Crosscutting concerns are considered as potential aspects and can lead to the phenomenal\" tyranny of the dominant decomposition\". Requirements-level aspects are responsible for producing scattered and tangled descriptions of requirements in the requirements document. Requirements validation artifact is an essential task in software development. This task ensures that requirements are correct and valid in terms of completeness and consistency, hence, reducing the development cost, maintenance and establish an approximately correct estimate of effort and completion time of the project. In this paper, we present a validation framework for aspectual requirements that can be used with AORE approaches to facilitate the validation of …", "num_citations": "7\n", "authors": ["1261"]}
{"title": "Applying the ISO standard in Assesing the Quality of Software Systems\n", "abstract": " Owing to the rapid developments in data and information systems, the software system quality is becoming an increasingly important issue. Ensuring quality in any product or service requires setting standards and ensuring that these are adhered to. In software development, using measurement and metrics ensures reliability and guarantees that the performance meets the requirements. Many software systems fail to achieve the goals they were designed for, as their weaknesses are not discovered in a timely manner. Moreover, their assessment is often not based on scientific methods. In order to mitigate this issue, in this research, the ISO standard (9126) is used to evaluate the quality of software. The findings reveal shortcomings in the construction, maintenance, evolution and reuse. A descriptive survey methodology is used, as this enables applying the standards when evaluating the quality of software systems …", "num_citations": "6\n", "authors": ["1261"]}
{"title": "Generating UML Class Diagram using NLP Techniques and Heuristic Rules\n", "abstract": " Several tools and approaches have been proposed to generate Unified Modeling Language (UML) diagrams. Researchers focus on automating the process of extracting valuable information from Natural Language (NL) text to generate UML models. The existing approaches show less accurateness because of the ambiguity of NL. In this paper, we present a method for generation class models from software specification requirements using NL practices and a set of heuristic rules to facilitate the transformation process. The NL requirements are converted into a formal and controlled representation to increase the accuracy of the generated class diagram. A set of pre-defined rules has been developed to extract OO concepts such as classes, attributes, methods, and relationships to generate a UML class diagram from the given requirements specifications. The approach has been applied and evaluated practically …", "num_citations": "5\n", "authors": ["1261"]}
{"title": "Migrating Relational Databases into XML Documents\n", "abstract": " This paper aims to devise a method for migrating a relational database (RDB) into an XML document. Database migration is concerned with the process of converting schema and data from a source RDB, as a one-time conversion, into a target XML database to be managed and handled in its new environment. The source schema is enriched semantically and translated into a target schema, and the data stored in the source database is converted into a target database based on the new schema. The semantic enrichment process is requisite to produce an enhanced metadata model from the source database and captures essential characteristics of target XML schema, and suitable for converting RDB data into an XML document. Algorithms are developed for producing the target database according to a set of migration rules to translate all constructs of an RDB into an XML Schema, based on which RDB data is …", "num_citations": "3\n", "authors": ["1261"]}
{"title": "A Comparative Study of Network Access Control and Software-Defined Perimeter\n", "abstract": " This paper is intended to conduct a comparison between two access control solutions, to determine which is most suitable for the infrastructure of modern computer networks. These two solutions are the software-defined perimeter (SDP) and the traditional network access control (NAC) system. The comparison demonstrates that SDP can enhance the access control process and overcomes security challenges.", "num_citations": "2\n", "authors": ["1261"]}
{"title": "INCREASING THE ARCHITECTURES DESIGN QUALITY FOR MAS: AN APPROACH TO MINIMIZE THE EFFECTS OF COMPLEXITY\n", "abstract": " The efficiency of multi agent system design mainly relies on the quality of a conceptual architecture of such systems. Hence, quality issues should be considered at an early stage in the software development process. Large systems such as multi agents systems (MAS) require many communications and interactions to fulfil their tasks, and this leads to complexity of architecture design (AD) which have crucial influence on architecture design quality. This work attempts to introduce approach to increase the architecture design quality of MAS by minimizing the effect of complexity.", "num_citations": "2\n", "authors": ["1261"]}
{"title": "AStructural APPROACH TO IMPROVE SOFTWARE DESIGN REUSABILITY\n", "abstract": " Software reuse become a very promising area that has many benefits such as reducing costs, time, and most importantly, increasing quality of software. However, the concept of reuse is not only related to implementation level, in fact, it can be included in the earlier stages of the software development life cycle such as design stage. Adopting reuse at this stage provides many benefits such as increasing productivity, saving time and reducing cost of software development.Accordingly, this paper presents the concept of reuse at design level in more details. As well as, it proposes an approach to improve the reusability of software design using the directed graph concept. This leads to produce a design to be considered as reusable components which can be adapted in many software systems.", "num_citations": "2\n", "authors": ["1261"]}
{"title": "A Framework for Aspectual Requirements Validation: An Experimental Study\n", "abstract": " Requirements engineering is a discipline of software engineering that is concerned with the identification and handling of user and system requirements. Aspect-Oriented Requirements Engineering (AORE) extends the existing requirements engineering approaches to cope with the issue of tangling and scattering resulted from crosscutting concerns. Crosscutting concerns are considered as potential aspects and can lead to the phenomena tyranny of the dominant decomposition. Requirements-level aspects are responsible for producing scattered and tangled descriptions of requirements in the requirements document. Validation of requirements artefacts is an essential task in software development. This task ensures that requirements are correct and valid in terms of completeness and consistency, hence, reducing the development cost, maintenance and establish an approximately correct estimate of effort and completion time of the project. In this paper, we present a validation framework to validate the aspectual requirements and the crosscutting relationship of concerns that are resulted from the requirements engineering phase. The proposed framework comprises a high-level and low-level validation to implement on software requirements specification (SRS). The high-level validation validates the concerns with stakeholders, whereas the low-level validation validates the aspectual requirement by requirements engineers and analysts using a checklist. The approach has been evaluated using an experimental study on two AORE approaches. The approaches are viewpoint-based called AORE with ArCaDe and lexical analysis based on …", "num_citations": "1\n", "authors": ["1261"]}
{"title": "A Framework for Improving Data Quality in Data Warehouse: A Case Study\n", "abstract": " Nowadays, the development of data warehouses shows the importance of data quality in business success. Data warehouse projects fail for many reasons, one of which is the low quality of data. High-quality data achievement in data warehouses is a persistent challenge. Data cleaning aims at finding, correcting data errors and inconsistencies. This paper presents a general framework for the implementation of data cleaning according to the scientific principles followed in the data warehouse field, where the framework offers guidelines that define and facilitate the implementation of the data cleaning process to the enterprises interested in the data warehouse field. The research methodology used in this study is qualitative research, in which the data are collected through system analyst interviews. The study concluded that the low level of data quality is an obstacle to any progress in the implementation of modern …", "num_citations": "1\n", "authors": ["1261"]}
{"title": "A Novel Approach for Improving the Quality of Software Code using Reverse Engineering\n", "abstract": " Copying and pasting program code fragments with minor changes is a common practice in software development. Software systems often have similar segments of code, called code clones. Due to many reasons, unintentional smells may also appear in the source code without awareness of program developers. Code smell may violate the principles of software design and negatively impact program design quality, thus making software development and maintenance very costly. This paper presents an enhanced approach to facilitate the process of identification and elimination of code smells. The proposed solution allows the detection and removal of code smells for refinement and improvement of the quality of software system. Code smells are analyzed, restructured and eliminated from the source code using reverse engineering techniques. The solution maintains the external behaviour of software system and …", "num_citations": "1\n", "authors": ["1261"]}
{"title": "A novel approach for improving the quality of software code using reverse engineering\n", "abstract": " Copying and pasting program code fragments with minor changes is a common practice in software development. Software systems often have similar segments of code, called code clones. Due to many reasons, unintentional smells may also appear in the source code without awareness of program developers. Code smell may violate the principles of software design and negatively impact program design quality, thus making software development and maintenance very costly. This paper presents an enhanced approach to facilitate the process of identification and elimination of code smells. The proposed solution allows the detection and removal of code smells for refinement and improvement of the quality of software system. Code smells are analyzed, restructured and eliminated from the source code using reverse engineering techniques. The solution maintains the external behaviour of software system and judges the efficiency of systems code. An experiment has been conducted using a real software system, which is evaluated before and after using the approach. The results have been encouraging and help in detecting code smells.", "num_citations": "1\n", "authors": ["1261"]}
{"title": "Conceptual Framework for Formalizing Multi-Agent Systems\n", "abstract": " Many of agent systems concepts are proposed in last decade. Most of them are inspired from the approach or discipline upon which they are based. Some of these concepts are developed based on the approach of extending existing Object Oriented concepts to include the relevant aspects of agents. Others are developed based on agent-based concepts or based on knowledge engineering concepts. The difference between disciplines of knowledge is causing the misunderstanding of some concepts that relate to agent systems, as well as some inconsistencies. In this paper, a conceptual formal framework is constructed to determine the essential MAS concepts and to reduce the possible turmoil and define the relationships among those concepts. The proposed framework is well-structured formal system that was constructed to ensure that the proposed MAS conceptual system is logically coherent and free …", "num_citations": "1\n", "authors": ["1261"]}
{"title": "PROBLEMATIC QUALITY OF THE INFORMATION IN THE WEBSITES\n", "abstract": " In the last decade, there has been a rapid development of internet technology. As a result, billions of pages on different subjects are on offer, albeit with great variation in the quality of content. Given almost total absence of quality controls and means of verification of the credibility of sources, the service users face a real problem when evaluating the accuracy of information presented on various websites. This paper addresses internet services, quality of information presented on the Internet, highlighting the need for solutions such as the quality control of electronic information.", "num_citations": "1\n", "authors": ["1261"]}
{"title": "Towards a comprehensive agent-oriented software engineering methodology\n", "abstract": " Recently, agent systems have proven to be a powerful new approach for designing and developing complex and distributed software systems. The agent area is one of the most dynamic and exciting areas in computer science today, because of the agents ability to impact the lives and work of all of us. Developing multi-agent systems for complex and distributed systems entails a robust methodology to assist developers to develop such systems in appropriate way. In the last ten years, many of agent oriented methodologies have been proposed. Although, these methodologies are based on strong basis they still suffer from a set of shortcomings and they still have the problems of traditional distributed systems as well as the difficulties that arise from flexibility requirements and sophisticated interactions. This thesis proposed a new agent oriented software engineering methodology called: Multi-Agent System …", "num_citations": "1\n", "authors": ["1261"]}