{"title": "Designing Personas with Empathy Map.\n", "abstract": " A software product’s acceptance depends on the user experience that it provides to its users. The software product must meet the user needs, and one way to understand those needs is through creation of Personas. The Personas technique allows describing the users’ characteristics, goals and skills. The Empathy Map (EM) method can be used to describe personas. The EM’s goal is to create a degree of empathy with the user so the product developing team starts to understand more deeply the users and become more aware of their real needs. To assess the EM effects on the creation of personas, we conducted a feasibility study with 20 subjects. Initially, the subjects learned how to describe personas in textual form. After that, they applied the EM to create personas. After using the EM, the subjects answered a questionnaire about their perceptions regarding the EM’s ease of use and its usefulness. The results showed that majority of subjects considered EM useful and easy to create personas. Furthermore, this majority also said that they would use the EM for the creation of personas again.", "num_citations": "91\n", "authors": ["1141"]}
{"title": "Systematic literature reviews in distributed software development: A tertiary study\n", "abstract": " Distributed Software Development (DSD) emerged from the need to achieve geographically distant customers and currently, allows organizations have global customers and other benefits. This scenario has given rise to new Software Engineering challenges resulting from DSD particularities. Several Systematic Reviews were conducted to address these new challenges. The objective of this paper is to categorize systematic reviews conducted in DSD context. We used the systematic review method to identify SLRs (Systematic Literature Reviews) that address DSD aspects. This study is categorized as a tertiary review. Of fourteen SLRs, seven address aspects of managing distributed development. Four SLRs addressed topics of engineering process. The three remaining are related to Requirements, Design and Software Engineering Education in DSD. The topic areas covered by SLRs are limited, where the …", "num_citations": "75\n", "authors": ["1141"]}
{"title": "The students' perspectives on applying design thinking for the design of mobile applications\n", "abstract": " Design Thinking (DT) is relevant for companies committed to developing a more creative and innovative application. DT provides a human-centered view of technological artifact design. Therefore, it is important to learn DT in Computer Science and Software Engineering courses as an analytic and creative process, in order to better prepare students for the software development industry. We conducted an empirical study with 17 postgraduate students in the context of mobile applications design. We used coding procedures from the Grounded Theory method for analyzing the obtained qualitative data. Based on the results, we identified some difficulties that participants experienced in using different DT techniques. The results of this study can help teachers understand the difficulties faced by students in learning DT and, consequently, help them to look for new teaching strategies for their classes. Moreover, these …", "num_citations": "40\n", "authors": ["1141"]}
{"title": "Usability and user experience evaluation of learning management systems-a systematic mapping study\n", "abstract": " Background: Advances in technology made possible the development of powerful platforms called Learning Management Systems (LMSs), designed to help the teaching and learning process. Studies show that usability and User Experience (UX) of such platforms may influence in this process. Although several studies had been conducted in this area, most of them are at initial stages and need improvements or deeper empirical studies. Aim: This work aims to analyze scientific publications in order to characterize the usability and UX evaluation techniques in the context of LMSs. Method: We performed a systematic mapping study regarding the usability and UX evaluation techniques in the context of LMSs. Results: A total of 62 publications were accepted in this mapping, which helped identifying the techniques used to evaluate the usability and UX of LMSs and their characteristics such as its origin, type, performing method, learning factors, restriction and availability. Conclusion: Several studies were conducted regarding the evaluation of LMSs. However, there are still some gaps such as the lack of techniques with some features, eg, feedback with suggestions to correct the identified problems. Besides, there is no sufficient evidence of which of them is best suited for this context.", "num_citations": "37\n", "authors": ["1141"]}
{"title": "Eliciting requirements using personas and empathy map to enhance the user experience\n", "abstract": " More than just meet the functional requirements, software is expected to promote a good user experience to its users. However, to achieve an adequate degree of user experience, it is necessary to understand users, their needs and expectations very well. Currently, part of the software industry focuses on developing mobile Web applications. A significant difficulty in the design of this type of application is that the development team often does not have a clear group of target users available, with whom the team could use traditional techniques for eliciting requirements such as interviews and questionnaires. Therefore, it is necessary to use different techniques that allow an immersion in the needs and characteristics of users, even when the users are not directly involved in the development. One of these techniques that help thinking of the target users of the application is the Persona technique. An important criticism …", "num_citations": "37\n", "authors": ["1141"]}
{"title": "A systematic mapping study on research contributions on UX evaluation technologies\n", "abstract": " User eXperience (UX) refers to quality attributes related to the feelings and emotions of the users. In order to evaluate UX, several technologies (tools, methods, techniques, others) have been proposed that range from using questionnaires to employing biometrics. However, it is essential to characterize UX evaluation technologies to obtain evidence on the contexts in which using a specific technology can provide better evaluation results. In this paper, we present the state of the art on how to evaluate the UX of software applications. We performed a systematic mapping study with an initial sample of 2101 papers from which 227 relevant papers describing UX evaluation technologies have been identified. The results suggest that there is a need for specific UX evaluation technologies that are easy and comfortable to use from the point of view of users, while supporting practitioners in the correction of the aspects that …", "num_citations": "27\n", "authors": ["1141"]}
{"title": "Using an empirical study to evaluate the feasibility of a new usability inspection technique for paper based prototypes of web applications\n", "abstract": " Usability is one of the most important factors that determine the quality of Web applications, which can be verified performing usability inspection. This paper presents the Web Design Usability Evaluation (Web DUE) technique, which allows the identification of usability problems in low-fidelity prototypes (or mockups) of Web applications during the design phases of the development. We have also proposed the Mockup Design Usability Evaluation (Mockup DUE) tool which is able to assist inspectors using the Web DUE technique. In order to verify the feasibility of these technologies, we have performed two empirical studies. During the first study, we compared the effectiveness and efficiency indicators of the Web DUE technique with the ones of its predecessor, the Web Design Perspective (WDP) based usability inspection technique. Also, during the second study, experienced inspectors used the Mockup DUE tool and answered a questionnaire aiming at identifying improvement opportunities in its design. The analysis of the quantitative data showed that the Web DUE technique allowed the identification of more usability problems in lesser time when compared to the WDP technique. Moreover, the qualitative data from the second empirical study provided information on the tool’s perceived ease of use, indicating that inspectors were satisfied and that they would use it to perform a usability inspection with the Web DUE technique. These results showed that the DUE technologies could be applied in the identification of usability problems early in the design of Web applications. Thus, their use could enable the correction of such problems before the …", "num_citations": "26\n", "authors": ["1141"]}
{"title": "Evaluating HCI Design with Interaction Modeling and Mockups\n", "abstract": " Interactive systems are increasingly present in daily life, but many people still face difficulties to use them. We believe that using models and artifacts to represent the interaction in a systematic way during systems design may prevent such difficulties. In this paper, we investigate the combined use of MoLIC, an interaction modeling language, with user interface mockups. While both artifacts are supposed to promote the understanding of user goals and the designer’s reflection on alternative solutions and decisions regarding the interaction, we have not found evidence of their usage impacts on quality. Thus, this paper presents an experimental study on the joint usage of MoLIC interaction diagrams and mockups during systems design, aiming both to identify participants’ perceptions on the joint use of the two artifacts and to analyze the quality of the generated artifacts by observing which types of defects would occur. The results show that, although some participants found that MoLIC diagrams were not very easy to build, most participants considered the creation of mockups based on MoLIC diagrams useful. In addition, the number of defects found in the MoLIC diagrams points to the need of developing techniques to evaluate the artifact before proceeding with the design process.", "num_citations": "23\n", "authors": ["1141"]}
{"title": "Technique for representing requirements using personas: a controlled experiment\n", "abstract": " Understanding the users' needs is important for designing an application that provides a good usage experience. One can use design thinking (DT) to help identify those needs. Persona is a technique used in DT to support the requirements elicitation by describing user profiles. Nevertheless, the persona descriptions created using a traditional template may include many details about the users that are not relevant to the application design. To overcome this limitation, the authors proposed the PATHY technique to guide software engineers in creating and describing more useful personas, i.e. personas with information that is more relevant to the application design. They conducted an experiment to compare PATHY to another persona-based technique which uses a traditional template and also supports the representation of the application's requirements. In this study, they assessed which of the two techniques …", "num_citations": "22\n", "authors": ["1141"]}
{"title": "Characterizing usability inspection methods through the analysis of a systematic mapping study extension\n", "abstract": " Usability is one of the most relevant quality aspects in Web applications. A Web application is usable if it provides a friendly, direct and easy to understand interface. Many Usability Inspection Methods (UIMs) have been proposed as a cost effective way to enhance usability. However, many companies are not aware of these UIMs and consequently, are not using them. A secondary study can identify, evaluate and interpret all data that is relevant to the current knowledge available regarding UIMs that have been used to evaluate Web applications in the past few decades. Therefore, we have extended a systematic mapping study about Usability Evaluation Methods by analyzing 26 of its research papers from which we extracted and categorized UIMs. We provide practitioners and researches with the rationale to understand both the strengths and weaknesses of the emerging UIMs for the Web. Furthermore, we have summarized the relevant information of the UIMs, which suggested new ideas or theoretical basis regarding usability inspection in the Web domain. In addition, we present a new UIM and a tool for Web usability inspection starting from the results shown in this paper.", "num_citations": "22\n", "authors": ["1141"]}
{"title": "Collaborative identification of code smells: A multi-case study\n", "abstract": " Code smells are anomalous program structures that may indicate software maintainability problems. God Classes and Feature Envies are examples of code smells that frequently become the target of software refactoring. However, smell identification might be harder than expected due to the subjectivity involved in the recognition of the apparently simple structure of each smell. Moreover, smell identification might require the knowledge of multiple program elements, which are better understood by different developers. Thus, the use of collaboration among developers may have the potential to improve effectiveness on smell identification. However, current knowledge, especially empirically developed and evaluated in the industry, is quite scarce. This paper reports an industrial case study aimed at observing how 13 developers individually and collaboratively performed smell identification in five software projects …", "num_citations": "21\n", "authors": ["1141"]}
{"title": "Pathy: Using empathy with personas to design applications that meet the users’ needs\n", "abstract": " The importance of User Experience has been increasingly recognized in the context of developing interactive applications. The Personas technique aims to help designers to better understand users’ needs. However, various Personas techniques use too much information and the textual description template does not explicitly guide designers in identifying functionality and features of the applications. Therefore, some designers have questioned the usefulness of the technique, limiting its acceptance and adoption. In this context, we proposed the PATHY technique, combining Personas and Empathy Maps in a novel approach. We conducted an empirical study to determine the participants’ perception about the usefulness and ease of use of the technique. We analyzed the participants’ quantitative and qualitative answers. The study showed that PATHY was considered both easy to use and useful …", "num_citations": "21\n", "authors": ["1141"]}
{"title": "Userbility: a technique for the evaluation of user experience and usability on mobile applications\n", "abstract": " User eXperience (UX) covers the relationship between usability, context of use, and user emotions regarding an application. Improving the UX and usability of an application, especially mobile applications, can influence their acceptance by end users. Although UX and usability evaluations focus on improving the quality of these applications, the software industry performs these evaluations separately. Based on this, we proposed Userbility, a technique for evaluating UX and usability in mobile applications. This technique is based on two methods: the Heuristic Evaluation and 3E method. In order to evaluate the Userbility technique, we conducted a study through the evaluation of five mobile applications. The results of this study show that it is possible to identify improvements in applications through a UX and usability inspection conducted with Userbility and a new version Userbility.", "num_citations": "21\n", "authors": ["1141"]}
{"title": "UsabiliCity: um jogo de apoio ao ensino de propriedades de usabilidade de software através de analogias\n", "abstract": " Usabilidade é um atributo de qualidade muito importante no desenvolvimento de software. É necessário que o profissional de computação aprenda o uso de técnicas de avaliação de usabilidade, como inspeção e teste, para garantir a qualidade e aceitação do software desenvolvido. Para facilitar a aprendizagem de uma técnica de inspeção de usabilidade muito aplicada por profissionais de computação, a Avaliação Heurística-AH, foi desenvolvido o UsabiliCity. Este jogo tem como objetivo o ensino da AH através de analogias. Além de apresentar o jogo, este artigo descreve o seu processo de desenvolvimento e avaliação experimental inicial.", "num_citations": "21\n", "authors": ["1141"]}
{"title": "Avaliando a Experiência do Usuário ea Usabilidade de um Aplicativo Web Móvel: Um Relato de Experiência.\n", "abstract": " The number of people who are using mobile web applications has increased in recent years. For this reason, the software industry is concerned with producing mobile web applications with high quality. To improve the quality of these applications, we should evaluate the user experience and usability, in order to offer a good user experience to end users. In this paper, we report a practical case of a user experience evaluation and a usability testing of a mobile web application, called Swarm. The results of this experience show the possibility of conducting usability tests along with user experience evaluation with good cost-benefit relationship.Resumo. A quantidade de pessoas que estão utilizando aplicações web móveis tem aumentado nos últimos anos. Por este motivo, a indústria de software está preocupada em produzir aplicações web móveis com alta qualidade. Para melhorar a qualidade dessas aplicações deve-se avaliar em conjunto a experiência do usuário e a usabilidade, visando oferecer uma boa experiência de uso aos usuários finais. Neste artigo, relatamos um caso prático de uma avaliação da experiência do usuário e de um teste de usabilidade realizado em um aplicativo web móvel, chamado Swarm. Os resultados desta experiência mostram a possibilidade de realizar testes de usabilidade juntamente com a avaliação da experiência do usuário com boa relação custo-benefício.", "num_citations": "18\n", "authors": ["1141"]}
{"title": "Influence factors in software productivity—a tertiary literature review\n", "abstract": " Software organizations need to increase their productivity to stay competitive. Although there is a lot of research on productivity in software development, software organizations still do not know what are the most significant productivity factors in which they should invest. This paper presents a Tertiary Literature Review (TLR) that aims to identify and analyze Systematic Literature Reviews (SLR) on the influence factors of software productivity reported in the scientific literature. We extracted and classified the influence factors into organizational factors (organizational-dependent factors) and human factors (people-dependent factors). The relevance of the factors was extracted according to the amount of references found in the secondary studies. Using this information, software organizations can improve the productivity of their projects by evaluating the influence factors that best fit their context.", "num_citations": "17\n", "authors": ["1141"]}
{"title": "How do software developers identify design problems? a qualitative analysis\n", "abstract": " When a software design decision has a negative impact on one or more quality attributes, we call it a design problem. For example, the Fat Interface problem indicates that an interface exposes non-cohesive services Thus, clients and implementations of this interface may have to handle with services that they are not interested. A design problem such as this hampers the extensibility and maintainability of a software system. As illustrated by the example, a single design problem often affects several elements in the program. Despite its harmfulness, it is difficult to identify a design problem in a system. It is even more challenging to identify design problems when the source code is the only available artifact. In particular, no study has observed what strategy (ies) developers use in practice to identify design problems when the design documentation is unavailable. In order to address this gap, we conducted a qualitative …", "num_citations": "16\n", "authors": ["1141"]}
{"title": "An empirical study to evaluate the feasibility of a UX and usability inspection technique for mobile applications\n", "abstract": " Usability and UX (User eXperience) are some of the most important factors for evaluating the quality of mobile applications. They focus on how easy to use an application is and the emotions that such use evokes. However, these aspects are often evaluated separately in industry through different evaluation techniques. Although it is possible to identify more usability and UX problems by employing different UX and usability evaluation methods, this distributed approach may not be cost effective and may not allow to thoroughly explore the identified issues. In order to support the identification of both UX and usability problems in a single evaluation, we have proposed Userbility, an UX and usability inspection technique that allows evaluating these aspects in mobile applications. This paper presents an empirical study over the second version of Userbility to verify its feasibility. In this study, we compared Userbility with the UX and Usability Guidelines Approach (UUGA) that helps the evaluation of usability and UX separately in mobile applications. According to the quantitative results, considering efficiency, UUGA was better than the Userbility technique. However, the qualitative results suggest that Userbility pointed more improvement suggestions, which could be useful for redesigning the evaluated application.", "num_citations": "16\n", "authors": ["1141"]}
{"title": "Improving a usability inspection technique based on quantitative and qualitative analysis\n", "abstract": " Usability is one of the most important factors that determine the quality of software product. Many usability inspection methods are gaining popularity as an effective alternative for addressing usability issues. However, usability evaluations are often avoided by developers and software companies due to their lack of knowledge and experience in the field. Usability evaluation can be expensive in terms of time and human resources; and sometimes companies' projects do not have budget to hire an expert inspector. Additionally, most of the evaluation methods can only be applied late in development, increasing correction costs. Aiming at solving this problem, we proposed a set of inspection techniques called MIT - Model Inspection Techniques for Usability Evaluation. This paper focuses on one of these techniques: the MIT2 technique that supports the inspection of mockups by software engineers. The goal of this …", "num_citations": "16\n", "authors": ["1141"]}
{"title": "Applying user-centered techniques to analyze and design a mobile application\n", "abstract": " Techniques that help in understanding and designing user needs are increasingly being used in Software Engineering to improve the acceptance of applications. Among these techniques we can cite personas, scenarios and interaction models. Personas are fictitious representations of target users. Scenarios provide various types of information at different levels of abstraction. Interaction models help in design of an adequate user interaction with the system. This paper presents a research that reports a set of practical activities applied by a software team using techniques in the analysis and design phases of a mobile application. In the analysis phase, we created personas and scenarios for the extraction of requirements. In the design phase, we created interaction models for describes the behavior between user and system during the interaction. We employed these interaction models to develop other artifacts, such as prototypes. In addition, we presented a technique developed by the analysis and design team for the inspection of interaction models. This technique reduced the spread of defects in the interaction models. From the results of this research, we suggest: (i) employing personas and scenarios to understand the requirements; (ii) employing interaction models to understand the behavior between user and system; and (iii) using interaction models as basis to develop other artifacts. Through the reporting of this set of practical activities, we hope to provide support for software engineers willing to adopt techniques that support the analysis and design of applications aiming at better quality of use for their users.", "num_citations": "15\n", "authors": ["1141"]}
{"title": "Aplicando design thinking em engenharia de software: um mapeamento sistemático\n", "abstract": " Vários problemas na construção de software estão relacionados a falta de envolvimento do usuário no processo de desenvolvimento. Com isso, Design Thinking (DT) surge como uma metodologia para elicitação das reais necessidades do usuário produzindo serviços e produtos inovadores. O objetivo deste artigo é investigar e compreender como DT é aplicado em Engenharia de Software. Nesse contexto, foi realizado um mapeamento sistemático da literatura sobre o uso de Design Thinking em Engenharia de Software, extraindo informações de sua aplicação no processo de desenvolvimento. O mapeamento sistemático apresenta 11 modelos de Design Thinking. Além disso, 10 ferramentas de software e 55 técnicas de DT são apresentadas. Foi possível observar que Design Thinking é uma metodologia que não segue necessariamente uma ordem entre as suas fases. Os modelos podem ser adaptados de acordo com o contexto do problema e suas técnicas auxiliam no processo de inovação do produto final.", "num_citations": "15\n", "authors": ["1141"]}
{"title": "A conceptual model to address threats to validity in controlled experiments\n", "abstract": " Context: During the planning phase of an experiment, the threats to validity must be identified in order to assess their impact over the data. In addition, the actions to address these threats must be defined (if possible). Objective: This paper proposes a conceptual model which contains the relationships between threats to validity and actions to address them. Method: A Systematic Literature Review was conducted to collect data for building the conceptual model. We identified 166 papers published in nine journals and four conferences that reported threats to validity in controlled experiments. Results: We identified 39 threats to internal validity (95 actions to address them), 9 to external validity (23 actions to address them), 10 to construct validity (21 actions to address them), and 8 to conclusion validity (19 actions to address them). Conclusion: By presenting this conceptual model, we intend to assist novice researchers …", "num_citations": "15\n", "authors": ["1141"]}
{"title": "Impacto da usabilidade na educação a distância: um estudo de caso no Moodle IFAM\n", "abstract": " Este artigo apresenta uma avaliação de usabilidade do ambiente virtual de aprendizagem Moodle IFAM, utilizado em educação a distância, aplicando o Percurso Cognitivo e o Método de Avaliação de Comunicabilidade. Foram obtidas várias informações úteis de como melhorar a usabilidade deste ambiente. Verificou-se também que muito pode ser melhorado com algumas práticas dos administradores e criadores de curso do sistema.", "num_citations": "15\n", "authors": ["1141"]}
{"title": "Are generic UX evaluation techniques enough? A study on the UX evaluation of the edmodo learning management system\n", "abstract": " As technology evolves and new interaction patterns emerge, User eXperience (UX) is becoming more important. Although several UX evaluation techniques have been proposed, there is no enough evidence regarding their adequacy in the e-learning context. This paper presents an analysis of two UX evaluation techniques applied to the Edmodo Learning Management System. We performed a study with 34 students to evaluate the UX of Edmodo and the perceptions of the techniques. Results showed that Edmodo provided a positive UX. However, around 41% of the students reported that they were not able to fully evaluate their UX using the techniques, indicating a need for improvement.", "num_citations": "14\n", "authors": ["1141"]}
{"title": "WE-QT: A web usability inspection technique to support novice inspectors\n", "abstract": " Given the growth in the usage of Web Applications, the usability of these applications has become a key success factor. There are several technologies to evaluate and improve this quality factor. However, the usability inspections results still depend on the inspector's experience. We have proposed a Web usability inspection approach, called WE-QT (Web Evaluation -- Question Technique), a question based technique that aims to reduce the difficulties of inspectors with little knowledge of usability. We are following an empirical methodology to support its development and improvement. This paper presents two experimental studies conducted until this point of the research: a feasibility and an observational study. We discuss the qualitative and quantitative results of both studies and their impact on improving the WE-QT. With this paper we also aim to spread the knowledge about experimental studies to evaluate …", "num_citations": "14\n", "authors": ["1141"]}
{"title": "Integrating the Usability into the Software Development Process\n", "abstract": " With the increasing use of interactive applications, there is a need for a development with better quality and a good interaction that facilitates the use for end users, because such applications are increasingly present in daily life. Therefore, it is necessary to include usability, which is one of the important quality attributes, in the development process for obtaining good acceptance rates and, consequently, improving the quality of these applications. In this paper we present a Systematic Mapping Study (SM) that assists categorizing and summarizing technologies that have been used in order to improve usability. The results from our SM show some technologies that can help improving usability in various applications. Also, it identifies gaps that still need to be researched. We found that most technologies have been proposed for the Testing phase (67.28%) and that Web applications are the most evaluated type of application (52.65%). We also identified that few technologies assist designers improving usability in the early stages of the development process (13.50% Analysis phase and 15.95% Design phase). The results from this SM allow observing the state of the art regarding technologies that can be integrated into the development process, aimed at improving the usability of interactive applications.", "num_citations": "13\n", "authors": ["1141"]}
{"title": "Towards a conversational agent to support the software testing education\n", "abstract": " The training of professionals in the field of software testing is increasing its relevance in the past few years and, therefore, efforts in appropriate methodologies for the learning-teaching process in this context have been proposed and appreciated. The emergence of pedagogical models, such as flipped classroom and team-based learning, which demand from the students a previous study of the theory before the lecture, creates a concern: how to support the before class learning? Because of the hybrid nature of these pedagogical models, which means they mix elements from traditional and distance education, it is possible that the support mechanisms used in distance learning platforms, such as conversational agents, can be applied for this matter. At the same time in which the academic work tries carefully to provide a proper software testing formation, there are also many contributions being established …", "num_citations": "12\n", "authors": ["1141"]}
{"title": "Defining a notation for usability-oriented interaction and navigation modeling for interactive systems\n", "abstract": " Modeling the interaction and navigation of an interactive system can assist designers in making decisions about how the users will be able to achieve their interaction goals. However, there is a lack of proposals to:(1) deal with interaction and navigation in an integrated way and (2) deal with usability features in interaction and navigation modeling. In this paper, we propose a usability-oriented interaction and navigation model to improve the quality in use of interactive systems. We evaluate the feasibility of the model through a study with three participants with experience in using models in industry, teaching models and carrying out academic research about models. Our main contributions are:(1) a knowledge base about the existing solutions for the problem,(2) the USINN (Usability-oriented Interaction and Navigation) model,(3) a preliminary evaluation about the feasibility of USINN,(4) the evolution of the USINN notation based on the results of the feasibility study, and (5) the definition of the USINN metamodel.", "num_citations": "12\n", "authors": ["1141"]}
{"title": "UBICUA: A customizable usability inspection approach for web mobile applications\n", "abstract": " Paper Abstract: The increasing interest on mobile technologies as well as the evolutionary context in which mobile applications are developed, have made the usability evaluation of these applications an important research area. However, usability evaluations are often avoided by developers or companies due to their lack of experience in the field. For this reason, in this paper we propose and evaluate of a new usability inspection technique that are specific for evaluating Web mobile applications, the UBICUA (Usability-Based Inspection CUstomizable Approach). In our solution, we propose a customizable approach that is based on the inspector knowledge, resulting in greater usability defect identification as well as encouraging the use of usability inspection by the developers. In this paper, we also show and discuss the results of a feasibility study through a quantitative analysis.", "num_citations": "12\n", "authors": ["1141"]}
{"title": "Creating personas focused on representing potential requirements to support the design of applications\n", "abstract": " Personas help in understanding the users' needs. However, their descriptions usually contain too many details related to personal characteristics and too little information relevant to the software that will be developed. This may limit their use and acceptance. In this context, the PATHY technique was proposed. It uses guiding questions to create personas more focused on the design of applications. In this paper, we present an experimental study where the technique was integrated with user stories. The study aims at evaluating the participants' perception regarding the structure of the technique and analyzing the requirements generated when using PATHY in a software development process. The results showed that, although the participants found some difficulties, they considered the technique useful for creating personas. Furthermore, it helped in the identification of requirements used as basis for the elaboration …", "num_citations": "11\n", "authors": ["1141"]}
{"title": "A comparative evaluation of interaction models for the design of interactive systems\n", "abstract": " Traditional models applied in the design of interactive systems focus on aspects related to the application functionality rather than its interaction with the user. Although some approaches have been developed for interaction modeling, there is no consensus on the more adequate model, making it necessary to evaluate the proposed models. To address the issue, this paper presents an empirical study comparing MoLIC (Modeling Language for Interaction as a Conversation) and CTDM (Comprehensive Tasks and Dialog Model) regarding their support for interaction modeling. While the number of defects in MOLIC diagrams was higher, there was no significant difference between the number of defects in MoLIC and CTDM diagrams. 60% of the participants pointed out that MoLIC is more useful and easier to use for designing interaction. And 56% of them indicated MoLIC as the more complete model in comparison …", "num_citations": "11\n", "authors": ["1141"]}
{"title": "Um estudo preliminar sobre as implicaçoes de tipos de personalidade no ensino de computaçao\n", "abstract": " When dealing with computing teaching methodology it is possible to innovate taking into account that different approaches affect the student development. In this context, this paper aims to consider and start a discussion, based on the MBTI (Myers-Briggs Type Indicator) indicator, about how much the student's psychological profiles and their individual characteristics may affect the computing teachingResumo. Ao tratar metodologias de ensino de computação é possível inovar à medida que se leva em consideração que diferentes abordagens influenciam no desenvolvimento do aluno. Neste contexto, este trabalho tem por objetivo considerar e iniciar uma discussão, com base no indicador MBTI (Myers-Briggs Type Indicator,) do quanto os perfis psicológicos dos alunos e suas características individuais podem influenciar o ensino de computação.", "num_citations": "11\n", "authors": ["1141"]}
{"title": "Gerência quantitativa para o processo de desenvolvimento de requisitos\n", "abstract": " Este artigo apresenta um conjunto de orientações para a implementação da gerência quantitativa de processos de software. O processo de Desenvolvimento de Requisitos foi escolhido como objeto de estudo e exemplo da gerência quantitativa, devido à sua relevância para os projetos de software. Estas orientações foram produzidas a partir da pesquisa bibliográfica sobre o tema, e da experiência dos autores em implementação e avaliação de processos. O propósito é que, quando seguidas, estas orientações levem a uma implementação que atenda aos objetivos das organizações, e ao mesmo tempo seja aderente ao que é especificado como resultado esperado dos níveis avançados dos modelos de maturidade.", "num_citations": "11\n", "authors": ["1141"]}
{"title": "Are scale-based techniques enough for learners to convey their UX when using a Learning Management System?\n", "abstract": " As technology evolves, learning institutions have sought to invest in new learning technologies. Many universities have been adopting platforms designed to support the learning process, called Learning Management Systems (LMSs), to complement face-to-face learning, as well as to support distance learning. This widespread adoption of LMSs raises the need for evaluating them regarding aspects related to quality in use, such as User eXperience (UX). UX is very important in e-learning context, given that it may influence learner’s attitude towards the use of the LMS. Despite its importance, few studies evaluated the UX of LMSs. Moreover, researchers have been using generic techniques to evaluate them. In this context, there is no evidence of studies conducted to identify whether these techniques can fully capture the experience conveyed by these platforms. This paper presents an analysis of two UX evaluation techniques (User Experience Questionnaire, and Integrated Experience Acceptance Model) applied to an LMS called Edmodo. We carried out a study with 34 students, divided into two groups, to evaluate the UX of Edmodo and obtain their perceptions about the technique they used. We also gathered the difficulties faced by the students during the execution of the tasks on the platform, while correlating those difficulties with learning issues. In addition, we performed a qualitative analysis in order to better understand the results. Regarding Edmodo, the results showed that the students perceived its UX as positive. Regarding the techniques, both groups considered them easy to use and useful. However, around 41% of the students in …", "num_citations": "10\n", "authors": ["1141"]}
{"title": "Projeto SciTechGirls: desenvolvimento de aplicativos e participação em competições de programação científicas e tecnológicas\n", "abstract": " Este artigo apresenta o projeto SciTechGirls, do Instituto de Computação da Universidade Federal do Amazonas (IComp/UFAM), com ações voltadas para o envolvimento de alunas dos cursos de graduação em Computação, no desenvolvimento de aplicativos computacionais e na participação em competições de programação científicas e tecnológicas, como forma de incentivá-las a aprofundar suas habilidades de programação e, assim, também desmistificar o falso mantra dito por muitos da área de que meninas não programam ou não gostam de programar. Neste trabalho são apresentados casos de sucesso no envolvimento de alunas universitárias em competições de programação, bem como apresentados alguns dos aplicativos de temática feminina desenvolvidos.", "num_citations": "10\n", "authors": ["1141"]}
{"title": "A controlled experiment with usability inspection techniques applied to use case specifications: comparing the MIT 1 and the UCE techniques\n", "abstract": " A Use Case Model is composed of use cases that describe software functionalities through Use Case Specifications. The evaluation of the specifications that compose such a model can allow for an early identification of usability defects. We previously proposed MIT 1-Model Inspection Technique for Usability Evaluation that aims to support the identification of usability defects through the evaluation of use cases specifications. In this paper, we present the evaluation of this technique through a controlled experiment that measured its efficiency, effectiveness, perceived ease of use, and perceived usefulness when compared to the Use Case Evaluation (UCE) method. Our quantitative findings indicate that MIT 1 allows users to find more usability defects in less time than UCE. However, UCE was considered easiest to use and more useful than MIT 1, highlighting improvement needs for MIT 1.", "num_citations": "10\n", "authors": ["1141"]}
{"title": "Using a controlled experiment to evaluate usability inspection technologies for improving the quality of mobile web applications earlier in their design\n", "abstract": " Usability is one of the key attributes for software quality that verifies the ability of the software to be understood, operated and attractive to users. In the specific case of mobile Web applications, usability can make the difference between their actual use and lack of acceptance. To assist software quality improvement at a lower cost, in previous work we proposed a set of usability inspection technologies for mockups, called Design Usability Evaluation (DUE), which can be applied earlier in the development of mobile Web applications. This paper shows an empirical study evaluating if the DUE technologies are able to aid development teams in the quality improvement of mobile Web applications. A development team applied the suggestions from the DUE technologies to make improvements over a set of previously evaluated mockups from a real mobile Web application. Then, users from different profiles tested both …", "num_citations": "10\n", "authors": ["1141"]}
{"title": "Persona security: A technique for supporting the elicitation of security requirements\n", "abstract": " Safety-critical embedded systems have assisted people in the execution of daily tasks, causing a search for security approaches in the initial phases of the development. The elicitation of security requirements in such systems is a key element for the definition of secure software. Nonetheless, security requirements are mostly ambiguous, incomplete or even not considered, which may be the reason of accidents. In this sense, it is essential to provide a good comprehension of peoples’ roles within the development process, and the interactions with the safety-critical embedded systems. This paper presents the Persona Security technique which aims at aiding software engineers in the elicitation of security requirements. We have performed a pilot study to verify the perception and relationship between the easiness of eliciting security requirements, and find out improvement points. The initial results indicate that dividing the requirements into both system and users allows the software engineer to have a clearer and more general view of the system. However, we also identified improvement opportunities such as:(a) the need for identifying requirements related to users and generating their traceability with the software requirements; and (b) the need for the identification of the security requirements that are most relevant for the problem domain, showing their dependencies and their selection impact.", "num_citations": "10\n", "authors": ["1141"]}
{"title": "Programas de Melhoria de Processo de Software–Uma pesquisa sobre a influência dos aspectos humanos\n", "abstract": " É sabido que diversos fatores podem influenciar o sucesso de um programa de melhoria de processo de software (MPS). Os resultados de pesquisas anteriores mostram que alguns destes fatores são de natureza humana e social. Por esta razão, é importante analisar os aspectos humanos envolvidos a fim de obter uma maior compreensão da influência destes em um programa MPS. Este artigo discute os principais resultados de uma pesquisa qualitativa conduzida em três diferentes fases para analisar quais fatores humanos tiveram maior influência do ponto de vista dos colaboradores das organizações. O objetivo é aprofundar a compreensão sobre como estes aspectos humanos podem influenciar um programa de MPS.", "num_citations": "10\n", "authors": ["1141"]}
{"title": "Melhor prevenir do que remediar: Avaliando usabilidade e UX de software antes de levá-lo para a sala de aula\n", "abstract": " Academic environments are excellent places to promote research and development. Innovative proposal, as technological tools for education, may emerge from these environments. In this work, an application that explores the origin of Portuguese words was developed. Before taking it to the classroom, a Usability and UX (User eXperience) evaluation of the application was carried out. To the surprise of the developers, several problems were found. Thus, the main theme of this work is to encourage this type of research and development, taking into account the importance of submitting applications and software for usability and UX testing and inspections to prevent major problems.", "num_citations": "9\n", "authors": ["1141"]}
{"title": "Avaliando a qualidade de um aplicativo web móvel através de um teste de usabilidade: um relato de experiência\n", "abstract": " A crescente utilização de dispositivos móveis tem incentivado as empresas a buscar uma maior qualidade dos aplicativos usados nestes dispositivos, tornando-os fáceis de utilizar. Um dos métodos de avaliação que auxilia na melhoria da qualidade é o teste de usabilidade. Este envolve o usuário interagindo com a própria aplicação, possibilitando a descoberta de problemas de maneira mais eficaz. Neste artigo, relatamos um caso prático de teste de usabilidade em um aplicativo educacional chamado Education Hub. Os resultados desta experiência mostram a possibilidade de realizar testes de usabilidade eficazes, com baixo custo e com diferentes perfis de usuário.", "num_citations": "9\n", "authors": ["1141"]}
{"title": "Estudo comparativo entre técnicas de inspeção de usabilidade sobre diagramas de atividades\n", "abstract": " Todos los ítems en el Repositorio de la PUCRS están protegidos por derechos de autor, con todos los derechos reservados, y están bajo una licencia de Creative Commons Reconocimiento-NoComercial 4.0 Internacional. Sepa más.", "num_citations": "9\n", "authors": ["1141"]}
{"title": "Improving Usability Inspection Technologies for Web Mockups through Empirical Studies.\n", "abstract": " Usability is the absence of obstacles that stop the user from carrying out his/her tasks in the system with efficiency, effectiveness and satisfaction. In Web applications, usability is crucial because it determines their acceptance. Researchers have proposed many Usability Inspection Methods (UIMs) to improve the usability of Web applications. However, we identified that these UIMs are mostly applied in later stages of the development process, which can increase the cost of correcting the identified usability problems. Correcting problems in later stages can be costly since most of the source code will have already been written. To improve the quality of Web applications by ensuring usability in earlier stages of their development process, we proposed the Web Design Usability Evaluation technique and its tool support, which allow the evaluation of low fidelity prototypes or mockups. In this paper, we present the results from empirical studies evaluating these technologies. The quantitative and qualitative results provided indicators of their feasibility and also allowed us to identify improvement opportunities. We have further analyzed and then integrated the identified suggestions to generate newer and improved versions of both the technique and its tool support; and to develop a new tool suitable for novice inspectors.", "num_citations": "9\n", "authors": ["1141"]}
{"title": "On the use of design thinking: A survey of the brazilian agile software development community\n", "abstract": " Design Thinking (DT) has been chosen as an approach to support problem-solving by many software development companies. However, there are divergences between the professionals of these companies concerning which techniques are performed, which steps are followed, and the way to implement this approach, as it proposes itself, to be divergent to generate numerous alternatives and, also, convergent, to find a solution. For this reason, aiming to characterize how the software companies have been implemented DT, this paper presents the results of a survey answered by 127 professionals from the Brazilian software industry. The results report a variety of scenarios in which DT has been applied: more than ten different models (sets of steps) are followed by the professionals; more than 50 techniques have been used, mainly, for meeting the needs in the process, according to the context of use and based on previous experiences. We also present 29 computational tools that, according to the respondents, assist the execution of DT, in addition to the integration with agile methods, allowing them to generate ideas and solutions, to explore and understand the problem.", "num_citations": "8\n", "authors": ["1141"]}
{"title": "Design Thinking in Software Requirements: What Techniques to Use? A Proposal for a Recommendation Tool.\n", "abstract": " Design Thinking (DT) has been incorporated into software processes by teams from startups to large companies, used in problem exploration fostering innovative solutions, and integrated into agile methods to satisfy the real stakeholders’ needs. DT places the customer needs up-front and helps to empathize with users, examining their behaviors, and producing outcomes focused on users’ demand. A set of techniques, like personas and user journey, can be used to support this human-centered approach. Selecting which technique to use might be challenging since factors such as the application scenario, stakeholder engagement level and previous knowledge of the problem-to-be-solved may vary from case to case. Therefore, this paper presents an ongoing research that aims to develop a collaborative tool with the purpose of providing recommendations about potential DT techniques to be used in the support of requirements engineering activities. Our tool proposal was developed from results of a DT session that identified the collaborative tool as a proposal solution, a requirements elicitation activity to define the tool scope, and an interview-based early experimental study with professionals that use DT in industry. Our preliminary results show that our proposal has the potential to contribute to professionals that apply DT in requirements engineering by suggesting the most suitable techniques according to the established context.", "num_citations": "8\n", "authors": ["1141"]}
{"title": "Directives of communicability: towards better communication through software models\n", "abstract": " In the development process, software models are commonly used to support communication among members of the development team. The risks of miscommunication through software models relate to the model content and to how content is expressed by the modeler. Communication failures mediated by software models may generate inconsistencies in software behavior, generating rework to correct them later. Aiming to improve model communication quality between their producers and consumers, we developed the Directives of Communicability (DCs). The aim of this paper is to present the DCs and an empirical study. The empirical study indicated that the directives had the intended potential to reduce miscommunication of what software models meant to those who produced them. From the results of this study, we notice that DCs can improve communication quality between model producers and consumers …", "num_citations": "8\n", "authors": ["1141"]}
{"title": "Estimativa de Projetos de Aplicativos Móveis: Um Mapeamento Sistemático da Literatura\n", "abstract": " As aplicações móveis têm necessidades e características diferentes em relação aos demais sistemas de informação. Essas características são fatores que influenciam a estimativa de esforço. Neste contexto, este artigo apresenta um mapeamento sistemático da literatura que caracteriza fatores preditores de esforço e modelos de estimativa voltados para projetos de aplicativos móveis. Como resultado, foram identificados cinco modelos para estimar tamanho, três modelos de esforço, três modelos para estimar tamanho e esforço em conjunto e noventa e três fatores preditores. A partir dos resultados, conclui-se que não há uma padronização dos fatores preditores de esforço que apoie os profissionais a estimar aplicativos móveis.", "num_citations": "8\n", "authors": ["1141"]}
{"title": "Knowledge Transfer between Senior and Novice Software Engineers: A Qualitative Analysis.\n", "abstract": " Software development is a knowledge intensive activity. Software engineers need to gather domain knowledge to be able to successfully deliver a software system. In particular, novice software engineers need to acquire enough knowledge to perform their tasks. This means that knowledge transfer to novice software engineers must be quickly and effectively performed to facilitate the onboarding process. One way to understand the knowledge transfer process is by analyzing the software development context and the involved team members. Such analysis enables the development team to determine key aspects that can influence knowledge acquisition by novice software engineers. This can also allow the identification of possible strategies that minimize the effort employed by the team members during this process. This paper presents a qualitative study about knowledge transfer in a small software organization from the point of view of software practitioners. Our results suggest that software developers have several knowledge sources and novice engineers learn when they observe organizational procedures and when the tasks have detailed guidelines. In addition, we identified that developers carry out most steps of the knowledge creation process defined by Nonaka and Takeuchi. We believe our results can support other software organizations to improve the sharing of knowledge and learning practices.", "num_citations": "8\n", "authors": ["1141"]}
{"title": "Towards validating complexity-based metrics for software product line architectures\n", "abstract": " Software product line (PL) is an approach that focuses on software reuse and has been successfully applied for specific domains. The PL architecture (PLA) is one of the most important assets, and it represents commonalities and variabilities of a PL. The analysis of the PLA, supported by metrics, can be used as an important indicator of the PL quality and return on investment (ROI). This paper presents the replication of a controlled experiment for validating complexity metrics for PLAs. In particular, in this replication we are focused on evaluating how subjects less-qualified than the subjects from the original experiment evaluate complexity of a PLA by means of generated specific products. It was applied a PLA variability resolution model of a given PL to a sample of subjects from at least basic knowledge on UML modeling, PL and variability management. Apart of the selection of different subjects, the same original …", "num_citations": "8\n", "authors": ["1141"]}
{"title": "Avaliação do Jogo InspSoft: Um Jogo para o Ensino de Inspeção de Software\n", "abstract": " Educational games support better learning in software engineering, as they reinforce concepts through practice, allowing a greater knowledge acquisition. The literature has proposed several games for software engineering teaching; however some of them do not have the evaluation of its effectiveness as a learning tool. This paper presents the game InspSoft, an educational game for teaching software inspection and the results of its evaluation by a specific model.Resumo. Os jogos educacionais apoiam melhor aprendizagem na Engenharia de Software, pois reforçam conceitos através da prática, permitindo um aprofundamento dos conhecimentos. A literatura apresenta vários jogos propostos para o ensino da Engenharia de Software, porém, alguns não possuem a avaliação de sua eficácia enquanto ferramenta de aprendizagem. Este artigo apresenta o jogo InspSoft, um jogo educacional voltado para o ensino da inspeção de software, e os resultados da sua avaliação através de um modelo específico.", "num_citations": "8\n", "authors": ["1141"]}
{"title": "Negative Emotions, Positive Experience: What Are We Doing Wrong When Evaluating the UX?\n", "abstract": " Since its idealization more than 20 years ago, much research has been carried out on the User eXperience (UX) field, with several evaluation methods being proposed. However, studies have been pointing out conflicting results when evaluating the UX. Users frequently evaluate their UX as positive, even when experiencing many negative emotions when interacting with a product. Moreover, variables such as the peak-end effect and the memory-experience gap may also have been influencing the results, leading to misinterpretations about the product's quality. In this context, this paper presents our work-in-progress research on the following research question:\" What are we doing wrong when evaluating the UX?\". We discuss about different variables that may have been influencing users' perceptions about their experiences in previous studies and highlight research opportunities. With this work, we expect to shed …", "num_citations": "7\n", "authors": ["1141"]}
{"title": "Applying design science research to develop a technique to evaluate the usability and user eXperience of learning management systems\n", "abstract": " As Internet-based technology becomes more accessible, learning institutions have been adopting platforms such as Learning Management Systems (LMS) to support and also complement face to face learning. Their widespread adoption raises the importance to evaluate them regarding quality in use attributes such as usability and User eXperience (UX). This paper presents the development of a technique and a tool to evaluate the usability and UX of LMS through Design Science Research (DSR) methodology. By applying DSR, we ensure a high level of rigor in the development process, combining theory and practice. The empirical studies indicated that our technique is adequate, in addition to providing better results compared to other techniques.", "num_citations": "7\n", "authors": ["1141"]}
{"title": "Evaluating the usability expressiveness of a USability-oriented INteraction and Navigation model\n", "abstract": " The success of an interactive system is strongly related not only to the quality of its user interface, but also to the quality of its interaction and navigation mechanisms. Those mechanisms need to be carefully designed, but there are still no de facto standard design models to represent user-system interaction in a way that privileges decisions regarding the usability of the product being developed. Recently, we proposed USINN (USability-oriented INteraction and Navigation model) to express usability mechanisms in interaction and navigation modeling solutions. In this paper, we present an empirical study conducted in academic environment to investigate the use of USINN to represent usability mechanisms in interaction and navigation design solutions. The results indicated that the participants consider USINN to be easy to use and useful for the interaction and interface design. They also pointed out the need for a …", "num_citations": "7\n", "authors": ["1141"]}
{"title": "MoLVERIC: An Inspection Technique for MoLIC Diagrams.\n", "abstract": " During interaction design, interaction models are developed to help design adequate user interaction with the system. MoLIC (Modeling Language for Interaction as Conversation) is a language used to represent an interaction model, which can then be used as a basis for building other artifacts, such as mockups. However, inspections are necessary to verify whether the MoLIC diagrams are complete, consistent, unambiguous, and contain few or no defects, to avoid propagating preventable defects to derived artifacts. In this paper, we present MoLVERIC, a technique for the inspection of MoLIC diagrams that uses cards with verification items and employs principles of gamification. Furthermore, we discuss the results of a pilot study conducted to analyze the feasibility of this technique.", "num_citations": "7\n", "authors": ["1141"]}
{"title": "Evaluating an Inspection Technique for Use Case Specifications\n", "abstract": " Usability inspections in early stages of the development process help revealing problems that can be corrected at a lower cost than at advanced stages of the development. The MIT 1 (Model Inspection Technique for Usability Evaluation) is a usability inspection technique, which aims to anticipate usability problems through the evaluation of use cases. This technique was evaluated using a controlled experiment aimed at measuring its efficiency and effectiveness, when compared to the Heuristic Evaluation (HEV) method. According to quantitative results, the MIT 1 exceeded the HEV in terms of effectiveness and obtained a similar performance in terms of efficiency. In other words, the MIT 1 allows finding more problems than the HEV. On the other hand, the subjects spent more time finding these problems using MIT 1. Moreover, the MIT 1 was considered easy to use and useful by the subjects of the study. We analysed the qualitative data using the procedures from the Grounded Theory (GT) method and results indicate improvement opportunities.", "num_citations": "7\n", "authors": ["1141"]}
{"title": "Towards a semantic knowledge base on threats to validity and control actions in controlled experiments\n", "abstract": " [Context] Experiment planners need to be aware of relevant Threats to Validity (TTVs), so they can devise effective control actions or accept the risk.[Objective] The aim of this paper is to introduce a TTV knowledge base (KB) that supports experiment planners in identifying relevant TTVs in their research context and actions to control these TTVs.[Method] We identified requirements, designed and populated a TTV KB with data extracted during a systematic review: 63 TTVs and 149 control actions from 206 peer-reviewed published software engineering experiments. We conducted an initial proof of concept on the feasibility of using the TTV KB and analyzed its content.[Results] The proof of concept and content analysis provided indications that experiment planners can benefit from an extensible TTV KB for identifying relevant TTVs and control actions in their specific context.[Conclusions] The TTV KB should be …", "num_citations": "7\n", "authors": ["1141"]}
{"title": "Aplicando design e avaliação de usabilidade para melhorar a qualidade de um aplicativo web móvel\n", "abstract": " Usabilidade é um dos atributos chave de qualidade de software que afeta a aceitação e facilidade de uso de aplicativos móveis. Este artigo relata um caso prático do uso de técnicas de design e avaliação de usabilidade para a melhoria da qualidade do aplicativo Web móvel Dona Know. Ao aplicar técnicas de design de usabilidade, foi possível entender melhor os usuários finais do aplicativo. Além disso, a execução de avaliações de usabilidade permitiu apontar problemas de usabilidade que devem ser corrigidos. Os resultados desta experiência mostram que é possível identificar oportunidades de melhoria da qualidade a um baixo custo.", "num_citations": "7\n", "authors": ["1141"]}
{"title": "Evoluindo um Assistente de Apoio à Inspeção de Usabilidade através de Estudos Experimentais.\n", "abstract": " This paper presents the development of an assistant to support usability inspection for Web applications-APIU. The development was based on the execution and analysis of results of experimental studies. The objectives of this paper are: to explain the experimental studies and the quantitative and qualitative analysis of each study. The qualitative analysis was based on procedures of two complementary techniques–The Technology Acceptance Model (TAM) and Grounded Theory (GT). We also presented the evolution of APIU based on improvements suggested by the studies’ results.", "num_citations": "7\n", "authors": ["1141"]}
{"title": "Codeplay: Uma plataforma de gamificação baseada em jogos de rpg multiplayer\n", "abstract": " Este artigo apresenta uma plataforma de gamificação estrutural chamada CodePlay, que possui elementos e mecânicas típicas de jogos de RPG. A plataforma foi integrada a um juiz online e utilizada por 9 turmas de introdução à programação. Por ser baseada em jogos de RPG, cada aluno dessa plataforma assume o papel de um personagem que será usado para visitar lugares, interagir com outros personagens, lutar contra inimigos, etc. Foi conduzido um conjunto de experimentos que apontou que a plataforma de gamificação proposta, quando comparada à um modelo de gamificação tradicional, consegue promover um engajamento maior dos alunos.", "num_citations": "6\n", "authors": ["1141"]}
{"title": "An experience report on teaching multiple design thinking techniques to software engineering students\n", "abstract": " Nowadays, we need to teach new approaches to elicit requirements that support a systems development with differentiated resources. One new approach that could be employed to elicit requirements is Design Thinking (DT), characterized by interactivity, user focus, and innovation. Some papers have presented the teaching of DT in computer courses, focused on the use of DT concepts and techniques aimed for requirements elicitation. However, previous experiences reported the teaching of a limited number of techniques. Thus, there is an opportunity to teach a higher number of techniques, making DT teaching richer. This paper aims to present an experience report about the teaching of multiple DT techniques to Software Engineering students in two different courses. In these courses, we presented 15 different DT techniques that can support the requirements elicitation. In the first course, we introduced the …", "num_citations": "6\n", "authors": ["1141"]}
{"title": "Evaluating a MoLIC extension for collaborative systems design\n", "abstract": " Collaborative Systems go beyond user-system interaction, allowing users to cooperate, coordinate and communicate with each other through the system. This kind of system has brought new issues and challenges for research in several fields, including interaction design, as many works proposed ways to facilitate the process of designing for collaboration. To support model-based design for collaborative systems, we propose an extension for the Modeling Language for Interaction as Conversation (MoLIC), allowing designers to represent user influences, cooperative tasks and awareness mechanisms to design collaboration. In this paper, we present a case study to evaluate the MoLIC extension during interpretation and design tasks applied with 12 undergraduate students. Results points to a good acceptance of the extension, but defects introduced in the models indicate that some concepts were not very easy to …", "num_citations": "6\n", "authors": ["1141"]}
{"title": "Practical findings from applying innovative design usability evaluation technologies for mockups of web applications\n", "abstract": " Web flow is an optimal perceived user experience which improves the user orientation and navigational behaviors towards Web applications. In order for Web applications to achieve Web flow in terms of navigation, it is necessary to enhance their degree of user interaction. However, despite their importance, user interaction features that can improve ease of use and navigation are mostly evaluated late in development. This paper presents practical findings from applying proposed Design Usability Evaluation (DUE) technologies. Such technologies allow the usability inspection of Web applications mockups to reduce the cost of identifying and fixing navigation and ease of use problems early in the development process. We planned an empirical study to evaluate: (a) the capability of applying these technologies without training, and (b) the perceived ease of use and utility of the technologies, using the Technology …", "num_citations": "6\n", "authors": ["1141"]}
{"title": "Identifying Threats to Validity and Control Actions in the Planning Stages of Controlled Experiments.\n", "abstract": " During the planning phase of an experiment, we must identify threats to validity in order to assess their impact over the analyzed data. Furthermore, actions to address these threats must be defined, if possible, so that we can minimize their impact over the experiment’s results. In this paper, we propose the Threats to Validity Assistant (TVA), which is a tool to assist novice researchers in identifying and addressing threats to validity of controlled experiments in Software Engineering. The TVA was evaluated through a controlled experiment which aimed at measuring the effectiveness and efficiency in identifying threats to validity and actions to address them. Sixteen subjects were asked to identify threats to validity and control actions related to an empirical study reported in literature. Our results indicate that the subjects who used TVA were significantly more effective and efficient than the subjects who did not use it.", "num_citations": "6\n", "authors": ["1141"]}
{"title": "Using the Results from a Systematic Mapping Extension to Define a Usability Inspection Method for Web Applications.\n", "abstract": " Usability is one of the most crucial factors in Web applications, allowing the successful usage of such systems. Many Usability Inspection Methods (UIMs) have been proposed to guarantee that Web applications provide a friendly, direct and easy to understand interface to their users. Nevertheless, some of these methods are not being used due to the lack of information about them. In this paper we describe the actual state of UIMs for Web applications through the extension of a systematic mapping study about Usability Evaluation Methods. Besides providing background knowledge to UIMs, our results showed that in order to meet the actual needs of the software development industry, emerging UIMs should:(a) find problems in early stages of the development process;(b) find specific problems and suggest solutions; and (c) provide automation. Using these features and usability criteria from other UIMs, we developed the Web Design Usability Evaluation (Web DUE) technique. The Web DUE aims to improve the quality of Web applications by allowing the usability evaluation of paper based prototypes by using pieces of Web pages called Web page zones. We have provided a proof of concept of the Web DUE by evaluating a paper based mock-up of a real Web application.", "num_citations": "6\n", "authors": ["1141"]}
{"title": "Aspectos humanos que afetam um programa de melhoria de processo de software-Uma análise qualitativa.\n", "abstract": " The success of a software process improvement (SPI) program depends on several technical and social questions. Although the technical aspects are important for a good performance of the improvement activities, they are not enough to guarantee the success of the program since SPI programs heavily depend on the human commitment. Therefore, it is important to indentify and to analyze the ‘different human aspects that can affect a SPI program. Therefore, this paper has two main goals:(1) to present the results of a qualitative study using the Grounded Theory method to identify the human aspects that influence SPI program from the view-point of the collaborators; and (2) to disseminate knowledge about qualitative studies in order to encourage its adoption by other Software Engineering researchers in the context of SPI programs.", "num_citations": "6\n", "authors": ["1141"]}
{"title": "Supporting the teaching of design thinking techniques for requirements elicitation through a recommendation tool\n", "abstract": " The development of systems with different features becomes increasingly challenging, given the actual context, implying on the search for new approaches for requirements elicitation. One of these approaches is design thinking (DT), a process of encouraging innovation used by designers, which presents itself as fundamental in the success of new products. This scenario motivates the importance of knowing DT concepts and their techniques, which can support requirements elicitation. In this context, the authors present DTA4RE (DT assistant for requirements elicitation), a tool that suggests DT techniques for requirements elicitation, which can be used by both students and professionals who would like to adopt DT in their projects. The DTA4RE is composed of a set of 27 techniques that could be suggested to the user through a recommendation questionnaire as well as an open repository with material to support …", "num_citations": "5\n", "authors": ["1141"]}
{"title": "e‐VOL BPMN: a technique to support the evolution and learning of BPMN diagrams\n", "abstract": " In the software maintenance, business process models help practitioners understanding of the software, because it represents the organisational process in which software is embedded. BPMN (Business Process Modelling and Notation) is the standard notation for business process modelling. However, it is common for the BPMN diagrams to be outdated, which, among other possibilities, may be caused due to the lack of adequate knowledge of some practitioners about the notation. It is important to provide means to stimulate the evolution of these models and, consequently, to aid in the learning of BPMN notation. With this focus, the authors proposed and evaluated the e-VOL BPMN, a technique that supports the evolution and the learning of BPMN diagrams. In this evaluation, they compared e-VOL BPMN with the BPMN 2.0 Poster, an artefact used commonly to support BPMN notation in companies. Participants …", "num_citations": "5\n", "authors": ["1141"]}
{"title": "Do Usability and Agility Combine? Investigating the Adoption of Usability Modeling in an Agile Software Project in the Industry\n", "abstract": " Creating design models that represent usability aspects can promote a better quality in use. However, it is necessary to investigate how do design processes commonly used in industry can be adapted to include this practice. This paper reports a case study in an agile software development company which adopts the Scrum methodology. The company decided to include the usability modeling practice in order to improve the quality of their products. For modeling usability aspects, the company adopted the USINN model in the initial sprints of a web development project. The results indicated that it was possible to integrate usability modeling before starting the development activities, anticipating the concern with usability. The USINN model enabled to prevent usability problems in the UIs developed later and to identify requirements for the application. Moreover, the USINN model was used in the sprint planning.", "num_citations": "5\n", "authors": ["1141"]}
{"title": "The contribution of non-technical stakeholders on the specification of UX requirements: an experimental study using the proto-persona technique\n", "abstract": " Context: Requirements elicitation is a software development phase that should investigate both functional and user experience (UX) requirements. Proto-persona is a technique that encourage the attention on the needs of a group of users. Usually its elaboration is conducted by software specialists, technical stakeholders. However, non-technical stakeholders usually know more about target users and frequently do not take part in proto-persona elaboration. Objective: Investigate the contribution of non-tecnichal stakeholders in the specification of UX requirements by using the proto-persona technique. Method: An experimental study with the participation of two groups of stakeholders, 8 non-technical and 5 technical. Results: Both stakeholders have written up details of UX requirements on the artifact, however, throughout different and complementary perspectives. Conclusion: We can highlight nontechnical …", "num_citations": "5\n", "authors": ["1141"]}
{"title": "Privacy Evaluation of Online Social Network Stories Feature: An Empirical Study with PDM\n", "abstract": " In recent years, privacy design and evaluation in the context of Online Social Network (OSNs) have become a relevant requirement to support the quality of use of these applications. This paper presents a study about the Privacy Design Model (PDM) that is used to support the designer in the elaboration and evaluation of the designer-to-user discourse in OSNs. In this context, the aim of this study was to extend the initial evaluation of the PDM. We analyzed the understanding and perception about ease-of-use and usefulness of PDM from the point of view of potential designers. In this way, we seek to understand how PDM can be used as a tool to support the privacy evaluate. Our results show that PDM was able to express clarity and comprehension as a tool to support the evaluation of privacy in OSNs. In this way, we hope to provide a better understanding about the privacy dimensions proposed in PDM and which …", "num_citations": "5\n", "authors": ["1141"]}
{"title": "Representing the interaction and navigation of interactive systems through a usability-oriented model: A feasibility study\n", "abstract": " Modeling the interaction and navigation of an interactive system can assist designers in making decisions about how the users will be able to achieve their interaction goals. However, there is lack of proposals to (1) deal with interaction and navigation through an integrated way and (2) deal with usability features in interaction and navigation modeling. In this paper, we propose a usability-oriented interaction and navigation model to improve the quality in use of interactive systems. We evaluate the model feasibility through a study with three subjects with experience in using models in industry, teaching models and academic researching about models. Our main contributions are:(1) knowledge base about the existing solutions for the problem,(2) the USINN (Usability-oriented Interaction and Navigation) model, and (3) a preliminary evaluation about the feasibility of USINN.", "num_citations": "5\n", "authors": ["1141"]}
{"title": "Evaluating the feasibility of max: a method using cards and a board for assessing the post-use UX\n", "abstract": " User Experience (UX) is an important attribute for the success and quality of a software application. UX explores how an application is used and the emotional and behavioral consequences of such use. Although several UX evaluation methods allow understanding the reasons for a poor UX, some of them are tedious or too intrusive, making the evaluation unpleasant. This paper presents the Method for the Assessment of eXperience (MAX), which through cards and a board assists software engineers in gathering UX data while motivating users to report their experience. We conducted two pilot studies to verify the feasibility of MAX, which showed that the method is useful for evaluating the UX of finished/prototyped applications from the point of view of users and software engineers.", "num_citations": "5\n", "authors": ["1141"]}
{"title": "Using a Study to Assess User eXperience Evaluation Methods from the Point of View of Users.\n", "abstract": " User eXperience (UX) refers to a holistic perspective and an enrichment of traditional quality models with non-utilitarian concepts, such as fun, joy, pleasure or hedonic value. In order to evaluate UX, several methods have been proposed that range from using questionnaires to employing biometrics to evaluate the users’ emotions. However, few of these UX evaluation methods are comfortable or easy to use from the point of view of users. This paper presents a study in which 10 users applied the Expressing Emotions and Experiences (3E) and EmoCards methods. While 3E provides a template for reporting the experience, the EmoCards provides a set of cards illustrating emotions as helping material. We have analyzed the features that make it easy or difficult for users to employ these methods, the users’ preference and the number of identified problems. Besides showing an application example of the methods to aid software practitioners in future evaluations, we identified that the EmoCards allowed users to identify more problems, but 3E was preferred do to its ease of use and freedom when describing an emotion and its causes.", "num_citations": "5\n", "authors": ["1141"]}
{"title": "Aplicação de métodos de avaliação da experiência do usuário na utilização de serious game em sala de aula\n", "abstract": " Serious games são jogos com outras finalidades além do entretenimento, e têm sido utilizados como apoio ao ensino de diversos tópicos da Engenharia de Software. Porém não é o bastante que estes jogos sejam apenas didaticamente adequados e provedores do aprendizado, é necessário que eles proporcionem uma boa experiência aos alunos. Portanto, torna-se importante avaliar a experiência de uso destas aplicações. Neste artigo, é relatada a avaliação do jogo uTest através de dois métodos de avaliação da experiência do usuário: Game Experience Questionnarie e as 10 Heurísticas da Emoção. Além disso, os resultados permitiram identificar possíveis melhorias nos métodos de avaliação aplicados que poderiam enriquecer os resultados obtidos.Abstract—Serious games are games for purposes other than entertainment and have been used to support the teaching of various disciplines in software engineering. However, it is not enough to be didactic adequate and learning providers but it is necessary to provide a good experience for students. Therefore, it becomes important to assess the students' use experience with serious game. In this paper, we report the evaluation of uTest game using two user experience evaluation methods: Game Experience Questionnaire and the 10 heuristics of Emotion. Furthermore, the results allowed identify possible improvements in user experience of serious game that could enrich the results.", "num_citations": "5\n", "authors": ["1141"]}
{"title": "An approach for the elicitation of usability requirements in the development of web applications\n", "abstract": " Non-functional requirements specify software restrictions and how well the software shall perform its functions. In Web applications, usability requirements are the most important type of non-functional requirements because they determine the acceptability of such applications. Nevertheless, usability requirements are usually forgotten or unconsidered, which increases the cost of their development and the cost of fixing usability problems. This paper presents the research agenda for the development of a set of technologies for the elicitation and specification of usability requirements for Web applications. We will propose and develop a set of techniques and a tool support that will allow software engineers to produce descriptive requirements specifications. Such specifications will guide the development team through the implementation of Web applications meeting usability principals. Finally, to verify the feasibility of the techniques and tool; identify improvement opportunities; and safely apply the technologies in the industry, we will evaluate the technologies through empirical studies.", "num_citations": "5\n", "authors": ["1141"]}
{"title": "O Uso de Design Thinking no Apoio ao Desenvolvimento de Software: Um Estudo de Caso no Contexto de Academias de Musculação\n", "abstract": " Design Thinking (DT) aparece na Engenharia de Software como uma abordagem promissora. Inspirado em praticas de design centradas no usuário, ainda tem seus benefıcios pouco conhecidos. Como parte de um projeto que visa identificar como o DT é utilizado, este artigo apresenta o relato de um estudo de caso da aplicação de DT na exploração das necessidades de academias de musculação. Utilizou-se o modelo duplo diamante [Design Council 2012] com um conjunto de 13 técnicas. Baseado na opinião dos stakeholders e demais participantes, o entendimento foi adequado e a solução proposta foi desejada pelos stakeholders, sugerindo que as técnicas utilizadas foram apropriadas.", "num_citations": "4\n", "authors": ["1141"]}
{"title": "ProAut: Um Processo para Apoio de Projetos de Interface de Produtos de Software para Crianças Autista\n", "abstract": " As principais características de uma criança autista são o atraso na comunicação e a dificuldade de interação social que podem limitar seu desenvolvimento pessoal e educacional. Quanto mais cedo uma criança autista receber intervenção, maiores serão suas chances de diminuir as dificuldades citadas. Dentre as intervenções usadas com crianças autistas existe o uso de ferramentas tecnológicas que contemplam produtos como: softwares, ambientes, aplicativos e robôs. No entanto, equipes de desenvolvimento desse tipo de produtos, podem enfrentar diversas dificuldades ao tentar incluir crianças autistas dentro do processo de desenvolvimento. Nesse contexto, este artigo visa apresentar a proposta de um processo para apoiar projetos de interfaces destinados a crianças autistas. Este processo, denominado ProAut, se baseia nos princípios das abordagens do Design Participativo e Design Centrado no Usuário, com o intuito de facilitar a identificação das necessidades destes usuários. Além disso, o ProAut sugere o uso de um conjunto de diretrizes iniciais para auxiliar equipes de desenvolvimento com baixa experiência na criação desse tipo de interfaces.", "num_citations": "4\n", "authors": ["1141"]}
{"title": "Representando a interação e navegação de sistemas interativos através de um modelo orientado à usabilidade: Um estudo de viabilidade\n", "abstract": " Modeling the interaction and navigation of an interactive system can assist designers in making decisions about how the users will be able to achieve their interaction goals. However, there is lack of proposals to (1) deal with interaction and navigation through an integrated way and (2) deal with usability features in interaction and navigation modeling. In this paper, we propose a usability-oriented interaction and navigation model to improve the quality in use of interactive systems. We evaluate the model feasibility through a study with three subjects with experience in using models in industry, teaching models and academic researching about models. Our main contributions are:(1) knowledge base about the existing solutions for the problem,(2) the USINN (Usability-oriented Interaction and Navigation) model, and (3) a preliminary evaluation about the feasibility of USINN.", "num_citations": "4\n", "authors": ["1141"]}
{"title": "Projetando diagramas de atividade visando a usabilidade de aplicações interativas\n", "abstract": " No projeto de aplicações interativas, há a necessidade de integrar os métodos e técnicas propostos pelas áreas de Interação Humano Computador e Engenharia de Software. Esta integração visa melhorar a qualidade destas aplicações. O objetivo deste trabalho é apresentar uma técnica para o projeto de Diagramas de Atividades, com a finalidade de integrar a usabilidade durante o projeto da aplicação. Além disso, um estudo piloto foi realizado para avaliar a viabilidade de aplicação da técnica e verificar possíveis melhorias na técnica.", "num_citations": "4\n", "authors": ["1141"]}
{"title": "\" Offizielle\" elektronische Version der Publikation (entsprechend ihrem Digital Object Identifier-DOI)\n", "abstract": " Publikationseintrag [Zurück] Zeitschriftenartikel: E. Piatkowska, A. Belbachir, M. Gelautz: \"Cooperative and asynchronous stereo vision for dynamic vision sensors\"; Measurement Science & Technology, 25 (2014), 5; S. 1 - 8. Kurzfassung englisch: Dynamic vision sensors (DVSs) encode visual input as a stream of events generated upon relative light intensity changes in the scene. These sensors have the advantage of allowing simultaneously high temporal resolution (better than 10 μs) and wide dynamic range (>120 dB) at sparse data representation, which is not possible with clocked vision sensors. In this paper, we focus on the task of stereo reconstruction. The spatiotemporal and asynchronous aspects of data provided by the sensor impose a different stereo reconstruction approach from the one applied for synchronous frame-based cameras. We propose to model the event-driven stereo matching by a …", "num_citations": "4\n", "authors": ["1141"]}
{"title": "On the identification of best practices for improving the efficiency of testing activities in distributed software projects: preliminary findings from an empirical study\n", "abstract": " Testing aims at identifying whether the software product attends its specification and the customer needs. It is a collaborative task since it requires coordination and communication of activities with those responsible for defining the project scope and for developing the source-code in order to clarify requirements, to stay up-to-date about changes, and to coordinate working schedule. It is a challenging but necessary activity in any software development life cycle. Distribution exacerbates the difficulties faced by testing team members. This paper presents empirical exploratory preliminary findings on challenges faced by testing teams in distributed projects and discusses best practices adopted by such teams to facilitate coordination and, as a consequence, increase the efficiency of their work. Our findings suggest corroboration of preliminary literature that focuses mainly in requirements engineering and in development …", "num_citations": "4\n", "authors": ["1141"]}
{"title": "Avaliação de usabilidade de aplicações em dispositivos móveis.\n", "abstract": " O objetivo desta proposta é desenvolver uma técnica de avaliação de usabilidade aplicações Web em dispositivos móveis, permitindo identificar o maior número de problemas de usabilidade, diminuindo os custos no processo de desenvolvimento e consequentemente aumentando a qualidade das aplicações.", "num_citations": "4\n", "authors": ["1141"]}
{"title": "Aprimorando a Qualidade de um Serviço Web através de Teste de Usabilidade–Uma Experiência Prática\n", "abstract": " A aceitabilidade das aplicações Web por seus usuários depende diretamente da usabilidade da aplicação, que pode ser melhorada através da realização de avaliações. Neste artigo, relatamos um caso prático de teste de usabilidade, no qual um serviço de sincronização de dados de navegação entre múltiplos dispositivos, chamado Browserver, é comparado com um serviço de finalidade semelhante. Os resultados desta experiência mostram a possibilidade de realizar testes de usabilidade eficazes com baixo custo.", "num_citations": "4\n", "authors": ["1141"]}
{"title": "UX trek: a post-interaction journey from immersive experience logs\n", "abstract": " User Experience (UX) is a holistic attribute focused on the quality of user-product interaction. However, the technology evolution in different contexts has not imposed limits on user-product interactions. For instance, in immersive technologies, the goal is to create a sense of immersion for the user, to the point that the boundaries between the physical and virtual worlds are blurred. There are entertainment applications for large events in that context, whose goal is to transform the audience's role from a mere spectator to an active element of the show. Thus, one of UX's most important dimensions in this context is user engagement (UE). In this work, we propose two metrics to investigate engagement through the automated analysis of logs, which are records that contain the data of the users' immersive interaction. We carried out two studies with two applications that actively engage the user in different experiences. The …", "num_citations": "3\n", "authors": ["1141"]}
{"title": "Reducing the risks of communication failures through software models\n", "abstract": " In the development process, software models support communication among members of the development team. Communication failures caused by software models may generate inconsistencies in the system, impairing its quality. Aiming to reduce risks of communication failures through software models, researchers can use the Directives of Communicability (DCs). The DCs were created based on Semiotic Engineering Theory and Grice's Cooperative Principle to improve the quality of communication among software development team members through software models. The aim of this paper is to present an empirical study assessing the use of DCs in the production of three software models. The results indicated that the DCs achieved the intended potential to reduce communication failures of what software models meant to those who produced them. The DCs also contributed to the quality of artifacts produced …", "num_citations": "3\n", "authors": ["1141"]}
{"title": "Land of lost knowledge: An initial investigation into projects lost knowledge\n", "abstract": " Background: Software development teams adopt various communication tools to support coordination and team interaction during the software development process. Among many other communication channels, developers' use instant messaging to discuss ideas, decisions and other project related issues with team members. Due to the informal nature of instant messaging, many of these discussions and decisions are lost. This situation could be even more critical in startups and other software companies that rely more heavily on instant message tools or other informal communication channels.Aims: This work investigates the effectiveness of using a semiautomatic approach for identifying, extracting, and determining a project's lost knowledge that was discussed using unstructured communication tools such as instant message.Methodology: We employed data-mining techniques to automatically retrieve …", "num_citations": "3\n", "authors": ["1141"]}
{"title": "Evaluating Usability of IFML Models: How Usability is Perceived and Propagated\n", "abstract": " System acceptance is strongly related to its usability. It is important that the usability is carefully designed during the system design steps and later propagated to the interface. This care avoids reworking the interface design of an application in the future because of its usability. However, we did not find works that specifically addresses the modeling of interfaces in conjunction with usability. The Interaction Flow Modeling Language (IFML) is a proposal that supports the modeling of the interface. This work investigates the following research question:\" usability in IFML models is perceived and propagated to the final interface?\" In order to answer this research question, we performed an empirical study to evaluate how usability is perceived by participants through IFML models and if usability is propagated to an interface prototype. The study showed that not all aspects of usability are easily perceived and propagated in …", "num_citations": "3\n", "authors": ["1141"]}
{"title": "Um Modelo sobre as Dificuldades para Especificar Casos de Uso.\n", "abstract": " Contexto: Casos de Uso (Use Cases–UCs) tornaram-se um importante artefato para a especificação dos requisitos de software. No entanto, há várias dificuldades que impedem estudantes e engenheiros de software de especificarem UCs de forma correta. Objetivo: Para explorar e entender as dificuldades em especificar UCs, foi realizado um estudo qualitativo. Método: Utilizou-se entrevistas semiestruturadas com estudantes visando identificar estas dificuldades. A análise dos dados foi conduzida utilizando procedimentos do método Grounded Theory (GT). Resultados: Foi proposto um modelo que apresenta as dificuldades encontradas para especificação de UC. Estas dificuldades foram classificadas nas categorias: abstração dos requisitos, identificação e descrição dos fluxos, relacionamento entre as regras de negócio e os fluxos na especificação do UC. Conclusões: O modelo serve como base para futuras pesquisas na área, bem como no apoio à sugestão de práticas para melhorar o processo de ensino/aprendizagem dos alunos na especificação de UC.", "num_citations": "3\n", "authors": ["1141"]}
{"title": "MoLVERIC cards feasibility study: a technique for inspection of moLIC diagrams\n", "abstract": " During Human Computer Interaction design, the MoLIC (Modeling Language for the Conversation Interaction) interaction diagrams can be used as a basis for building other artifacts, such as mockups. However, if the MoLIC diagrams have consistency or completeness defects, such defects can be propagated to the artifacts that are built based on these MoLIC diagrams. For this reason, we should carry out an inspection in MoLIC diagrams, to prevent the propagation of defects. This paper presents a feasibility study conducted with the MoLVERIC Cards technique, a technique that helps the inspection of MoLIC diagrams. The results show the participants' perception regarding MoLVERIC Cards technique and discuss opportunities for improvement.", "num_citations": "3\n", "authors": ["1141"]}
{"title": "Evaluating Software Engineers’ Acceptance of a Technique and Tool for Web Usability Inspection\n", "abstract": " Usability is related to software quality, improving its ability to be understood, operated and attractive to users. We proposed the Design Usability Evaluation (DUE) technologies to allow identifying usability problems earlier in the development of Web applications, through the inspection of mockups. While we found that the DUE technique and tool were effective and efficient in the identification of usability problems, we saw the need to investigate their acceptance in practitioners’ work environment. This paper reports the results from a study evaluating the acceptance of the DUE technologies from the point of view of software engineers. We asked questions based on the indicators from the Technology Acceptance Model and identified that a majority of the software engineers who participated in the study:(a) found the DUE technologies useful and easy to use for supporting the usability inspection process; and (b) would regularly use the DUE technologies for future inspections in their job. Nevertheless, the practitioners indicated that the technique should be refined in order to reduce the ambiguity and repetition of some of its items, while the tool should become more intuitive.", "num_citations": "3\n", "authors": ["1141"]}
{"title": "A Usability Inspection Approach to Assist in the Software Development Process\n", "abstract": " Several approaches have been proposed to ensure the quality of interactive systems. However, interactive systems continue to reach users with malfunctions, such as usability, communicability and interaction errors. Researches show that the lack of usability knowledge in software development organizations is an obstacle for usability evaluation. Our research goal is to popularize usability inspections so that even novice inspectors are able to perform it. Aiming to provide an approach to be used during the development process of web application, we have proposed the WE-QT technique. We are using an experimental methodology to evolve our technique and transfer it from the academy to industry. This paper presents a new comparative study; the results show that WEQT technique is more efficient than and as effective as the compared technique.", "num_citations": "3\n", "authors": ["1141"]}
{"title": "Evaluating a Usability Inspection Technique by means of Industry: Case Studies\n", "abstract": " GOMES, Marcos; OLIVEIRA, Horácio ABF de y CONTE, Tayana. Evaluating a Usability Inspection Technique by means of Industry: Case Studies. CLEIej [online]. 2013, vol. 16, n. 1, pp. 8-8. ISSN 0717-5000.", "num_citations": "3\n", "authors": ["1141"]}
{"title": "Evoluindo um Assistente de Apoio ao Processo de Inspeção através de Análise Quantitativa e Qualitativa\n", "abstract": " Users’ acceptability of a Web application relies strictly on this applications’ usability. One of the main means of evaluating and improving the usability of a system is by carrying out inspections. In this paper, we propose the automation of this process throw an Assistant for Usability Inspection Process (“APIU”). We also evaluate the assistant by carrying out an experimental study. The data gathered by the study is analyzed quantitative and qualitatively, in which the qualitative analysis is done by using two complementary techniques: the technology acceptance model (TAM) and the Grounded Theory. At last, we present the changes we made in the proposed assistant based on the results of the experimental study.Resumo—A aceitabilidade das aplicações Web está diretamente ligada à usabilidade dessas aplicações, um dos principais meios de avaliar e melhorar a usabilidade é a realização de inspeções. Neste …", "num_citations": "3\n", "authors": ["1141"]}
{"title": "Rotule-me! Uma experiência de engenharia de requisitos para um sistema de rotulagem\n", "abstract": " Machine Learning (ML) tem sido cada vez mais aplicado em diversos domınios do conhecimento humano. Em projetos de ML supervisionado, é necessário que haja uma base de dados para treinamento do modelo de ML. Sistemas de rotulagem de dados sao frequentemente utilizados para apoiar o desenvolvimento desse tipo de ML quando a gestao dessa base de dados é crıtica para o sucesso do projeto. Contudo, a elicitaçao de requisitos desses sistemas apresenta desafios relacionadosa interaçao dos usuários com grande volume de dados. Há a necessidade de entender os requisitos especıficos desses sistemas para elaborar um software de qualidade. Este trabalho relata uma experiência de engenharia de requisitos em um sistema de rotulagem de dados para ML. Esse sistema tem como objetivo atuar na inspeçao de rotulagem de milhoes de produtos para fiscalizaçao de impostos pelas Secretarias da Fazenda dos Estados Federativos do Brasil. A partir dos requisitos iniciais, foi realizado um processo evolutivo de prototipagem de interfaces. O processo incluiu três iteraçoes, envolvendo o gerente de produto e a equipe de desenvolvimento. Os protótipos auxiliaram a refinar os requisitos a partir da análise de cada iteraçao, além de possibilitar a avaliaçao dos requisitos atendidos.", "num_citations": "2\n", "authors": ["1141"]}
{"title": "An Interface Design Catalog for Interactive Labeling Systems\n", "abstract": " Machine Learning (ML) systems have been widely used in recent years in different areas of human knowledge. However, to achieve highly accurate ML systems, it is necessary to train the ML model with data carefully labeled by specialists in the problem domain. In the context of ML and Human Computer Interaction (HCI), there are studies that propose interfaces that facilitate interactive labeling by domain specialists, in order to minimize effort and maximize productivity. This paper extends a previous secondary study that discusses some labeling systems. This paper proposes a catalog of design elements for the interface development of this type of system. We built the catalog based on the interface elements found in the studies analyzed in the previous secondary study. With this contribution, we expect to improve the development of better interfaces for interactive labeling systems and, thus, enhance the development of more accurate ML systems.", "num_citations": "2\n", "authors": ["1141"]}
{"title": "Checklist-based techniques with gamification and traditional approaches for inspection of interaction models\n", "abstract": " Interaction models specify the structure and content of the user interface, the allowed user actions, and the corresponding system responses. There is a need to inspect interaction models, as it avoids the propagation of defects to other artefacts. We created two inspection techniques for interaction models, called MoLVERIC Cards (MCards) and MoLVERIC Check (MCheck). MCards employs a gamification mechanism to motivate practitioners during the inspection. MCheck is a simple technique to be used by practitioners in a traditional way. Both techniques have questions, whose answers assist in identifying defects. We performed three studies to verify whether these techniques support the inspection of interaction models. In the first and second studies, we evaluated MCards and MCheck in comparison with an ad-hoc technique supported by the conventional inspection approach based on defect types. The results …", "num_citations": "2\n", "authors": ["1141"]}
{"title": "Directives of communicability: teaching students how to improve communication through software modeling\n", "abstract": " In the development process, software models are used to support communication among development team members. Failures of communication that is mediated by software models may generate inconsistencies in software behavior, generating rework to correct them. This may occur because producers usually focus only on model content, although they should also reflect on how other members of the development team will interpret their models. We should therefore teach software engineering students how to communicate better through software models. In an attempt to improve communication through software models, we have developed the Directives of Communicability (DCs), based on theories that investigate different kinds of communication. In this poster, we present the highlights of a study to find out whether DCs improve software engineering students' communication through software models. Our …", "num_citations": "2\n", "authors": ["1141"]}
{"title": "On the contributions of non-technical stakeholders to describing UX requirements by using proto-persona\n", "abstract": " Context: Requirements elicitation phase in software development investigates both requirements, functional and user experience (UX). Proto-persona is a technique that encourages attention on the needs of a group of users. Usually, the elaboration of proto-personas is done by software specialists and technical stakeholders without the participation of non-technical stakeholders. However, non-technical stakeholders often have a well-knowledge about target users. Objective: This work aims to investigate the contribution that non-technical stakeholders bring to the specification of UX requirements when they use the proto-persona+ technique to this end. To achieve our objective, we extend the original proposal of proto-persona technique creating the proto-persona+. We also explored the construction of proto-persona+ artifacts and their use to the prototyping of solutions. Method: We conducted an empirical study in …", "num_citations": "2\n", "authors": ["1141"]}
{"title": "Assistant MEEGA+: Uma ferramenta de apoio para avaliação de jogos educacionais usando modelo MEEGA+\n", "abstract": " Jogos educacionais tem se mostrado uma estratégia inovadora para o ensino. Todavia é necessário avaliar os jogos para obter evidências sobre os benefícios de sua adoção. O MEEGA+ é um modelo para avaliar jogos educacionais usados no ensino de computação e analisa a experiência e percepção de aprendizagem do ponto de vista de alunos e instrutores. Apesar de fornecer modelos e planilhas predefinidas, não existe uma ferramenta de apoio que compreenda todo o processo de avaliação. Este artigo apresenta o Assistant MEEGA+, uma ferramenta web de apoio ao MEEGA+. Uma avaliação do Assistant MEEGA+ por instrutores e profissionais interessados no desenvolvimento e avaliação de jogos educacionais indicou resultados positivos em relação à utilidade, facilidade e intenção de usar a ferramenta. Os resultados encorajam a avaliação de jogos educacionais e o uso da ferramenta para planejar, executar e analisar os resultados dessas avaliações.", "num_citations": "2\n", "authors": ["1141"]}
{"title": "ComD2: Family of Techniques for Inspecting Defects in Models that Affect Team Communication.\n", "abstract": " Communication failures in software development teams can compromise the software quality. Therefore, identifying and mitigating risks for effective team communication are important activities in software development. Software models are one of the means of communication in development teams, because it communicates other members of the development team about the software. Thus, our research focuses on inspection techniques for identifying defects that affect the team communication through the software models. This paper presents a family of techniques for inspecting defects that affect team communication, called ComD2 (Communication between Designers and Developers). The ComD2 family was developed based on theories that investigate different ways of communication. For the time being, the ComD2 family has three specific inspection techniques for UML models, such as class diagrams, activity diagrams, and state machine diagrams. We performed a feasibility study and the results showed that the ComD2 family was considered useful for the identification of defects that affect the team communication through the software models.", "num_citations": "2\n", "authors": ["1141"]}
{"title": "IFactor-KM: A Process for Supporting Knowledge Management Initiatives in Software Organizations Considering Influencing Factors.\n", "abstract": " Knowledge management has become a real need in the software industry. Knowledge management factors refer to management and organizational factors that need to be addressed effectively in order to increase the chances of a knowledge management successful implementation. Many organizations have questions about the approach they should take in their knowledge management initiatives. Literature studies have been conducted to identify the factors that affect the implementation of a knowledge management, but do not suggest knowledge management practices for organizations. A process named IFactor-km (influencing factors on knowledge management) was created to address these needs. The goal of this process is to support knowledge management initiatives and to suggest knowledge management practices for software organizations considering the following influencing factors: people, leadership and culture. The IFactor-KM supports software organizations by: a) identifying the knowledge management objectives; b) checking how tacit knowledge is shared; c) showing the knowledge experts; d) understanding leadership and people aspects; e) characterizing the organizational culture profile; and f) suggesting knowledge management practices. The process is composed of: i) a procedure detailing the steps of the process; and ii) a set of artifacts detailing how to use the process and examples of completed artifacts to facilitate the use of the process.", "num_citations": "2\n", "authors": ["1141"]}
{"title": "When software impacts the economy and environment\n", "abstract": " When customers visit a Brazilian e-commerce site and search for a product, they're likely using software developed by Neemu, a start-up created in Manaus, a city in the heart of the Amazon rainforest. Nowadays, millions of people throughout Brazil use this software, which demonstrates alternative economic development in Amazonia that has low impact on the environment.", "num_citations": "2\n", "authors": ["1141"]}
{"title": "Evangelizing HCI research and practice in Brazil\n", "abstract": " Opening session: Research-related themes were discussed and participants shared common interests and challenges in order to strengthen the local learning of HCI. Participants learned about the role of relevant organizations such as ACM and SIGCHI.", "num_citations": "2\n", "authors": ["1141"]}
{"title": "Um processo baseado em modelagem de interação para o projeto de jogos educacionais a partir de livros: um estudo de caso no contexto de um jogo para dispositivos móveis\n", "abstract": " O uso de jogos educacionais tem se tornado uma estratégia importante no ensino, pois auxilia na construção e fixação de novos conhecimentos. O conteúdo de livros educativos pode ser adaptado para jogos educacionais digitais, promovendo uma experiência interativa e tornando o aprendizado interessante. Este artigo propõe um processo que auxilia a construção de jogos educacionais a partir do conteúdo extraído de livros educativos. O processo é composto por atividades para modelar a interação do jogador com o conteúdo digital. O artigo apresenta um relato da adoção do processo proposto, descrevendo os artefatos construídos em cada etapa do processo, de forma a encorajar sua adoção em projetos futuros.", "num_citations": "2\n", "authors": ["1141"]}
{"title": "Utilizando Modelagem de Interação para Projetar uma Aplicação Móvel Multiusuário: Um Relato de Experiência\n", "abstract": " Modelos de interação especificam a estrutura e o comportamento do sistema durante a interação do usuário. Desta forma, estes modelos podem melhorar a qualidade de uso, uma vez que auxiliam engenheiros de software a projetarem as funcionalidades do sistema. Além disso, os modelos permitem a identificação de possíveis dificuldades de interação. Este artigo relata a experiência de uma equipe de projeto com modelos de interação durante o desenvolvimento de uma aplicação móvel. Os modelos foram usados como base para construir outros artefatos, como casos de uso. Os resultados deste trabalho mostram que houve melhor compreensão da equipe sobre a aplicação móvel, diminuindo o retrabalho na construção dos demais artefatos.", "num_citations": "2\n", "authors": ["1141"]}
{"title": "Evolving a Wizard to Support Inspection Process through Qualitative and Quantitative Analysis\n", "abstract": " Users' acceptability of a Web application relies strictly on this applications' usability. One of the main means of evaluating and improving the usability of a system is by carrying out inspections. In this paper, we propose the automation of this process throw an Assistant for Usability Inspection Process (\"APIU\"). We also evaluate the assistant by carrying out an experimental study. The data gathered by the study is analyzed quantitative and qualitatively, in which the qualitative analysis is done by using two complementary techniques: the technology acceptance model (TAM) and the Grounded Theory. At last, we present the changes we made in the proposed assistant based on the results of the experimental study.", "num_citations": "2\n", "authors": ["1141"]}
{"title": "Aplicando Grounded Theory para Compreender os Fatores Críticos de Sucesso em Iniciativas de Melhoria de Processo de Software\n", "abstract": " Aplicando Grounded Theory para Compreender os Fatores Críticos de Sucesso em Iniciativas de Melhoria de Processo de Software Page 1 VI Workshop de Olhar Sócio Técnico Sobre a Engenharia de Software (WOSES) 2010 Aplicando Grounded Theory para Compreender os Fatores Críticos de Sucesso em Iniciativas de Melhoria de Processo de Software Olavo O. de Matos Junior Vinícius P. Secatti Davi Viana dos Santos Horácio ABF de Oliveira Tayana Conte Pesquisador Colaborador: Rafael Rodolfo D. dos Santos USES - Usabilidade e Engenharia de Software UFAM Page 2 Roteiro 1. Introdução 2. Objetivo 3. Melhoria de Processo de Software 4. Etapas do Estudo Qualitativo 5. Análise dos dados Qualitativos 6. Conclusões 7. Referências Page 3 Introdução Existem vários fatores críticos em MPS que não são simplesmente questões técnicas de engenharia de software e sim questões sócio-técnicas …", "num_citations": "2\n", "authors": ["1141"]}
{"title": "Um estudo sobre a relação entre os elementos de jogos e os tipos de usuários de sistemas gamificados\n", "abstract": " Neste trabalho em progresso está sendo realizado um estudo sobre quais elementos de jogos mais motivam e atraem os diferentes tipos de usuários de sistemas gamificados, bem como quais são as tendências e interesses típicos dos usuários de cada tipo. O modelo HEXAD será adotado para classificar os usuários em seis tipos distintos. Para realizar esse estudo, serão empregados o juiz on-line CodeBench e a plataforma de gamificação CodePlay, onde os alunos precisam completar os exercícios de programação disponibilizados pelos professores para avançar nas fases do sistema gamificado.", "num_citations": "1\n", "authors": ["1141"]}
{"title": "Towards an understanding of benefits and challenges in the use of design thinking in requirements engineering\n", "abstract": " Agile approaches arose as a way of addressing some of the main challenges in software development. Some of the challenges are changing requirements, lack of understanding about the system's scope, and out-of-sync between code, requirements, and documentation. Software companies' professionals have adopted Design Thinking (DT) to support software development to understand better what customers want, fostering the creation of features and products. Due to the importance of requirement engineering to software development success, this study aimed to characterize what DT benefits and challenges were perceived in requirements engineering by the Brazilian software development community. The current study used mixed methods combining two qualitative methods, a focus group to collect and understand the professionals' DT usage opinions and a survey to confirm the professionals' challenges …", "num_citations": "1\n", "authors": ["1141"]}
{"title": "It’sa Match! A Knowledge based Recommendation System for Matching Technology with Events\n", "abstract": " The use of technologies to promote interaction and engagement at events is part of modern entertainment. In the different types of events, there are different technologies to increase this interaction. In scientific events, for example, organizers use voting platforms with the public; in music festivals, LED bracelets and the flash light of the smartphone are used; while in cultural and sports events, there are digital cheer leading thermometers. Considering the search by experts in the field of events and entertainment for new technologies, in this study, a recommendation system is proposed that relates different classification aspects of events in order to suggest a list of appropriate technologies for that event, based on knowledge bases built by the experience of experts. The proposed solution was evaluated through acceptance studies using the technology acceptance model (TAM), and interviews with six experts with experience in the area of production and organization of various events. Results indicate that users intend to use the platform to assist in the definition of technologies due to its innovative factor, among other information discussed in this paper.", "num_citations": "1\n", "authors": ["1141"]}
{"title": "Supporting the Evolution of BPMN Models through e-VOL BPMN\n", "abstract": " During software maintenance, software models play a fundamental role, as they assist in understanding the software that will be corrected or evolved. Business process models, generally produced using Business Process Modeling and Notation (BPMN), help understanding the business processes supported by software. Therefore, these models are instrumental in maintaining corporate software. However, it is common that during software maintenance, models related to the software are not updated. Thus, the models are inconsistent with the version in use of the software, becoming increasingly obsolete over time. Given that, we developed the e-VOL BPMN technique to support BPMN models' evolution during software maintenance. The objective of e-VOL BPMN is to assist software engineers and developers, with little experience in BPMN notation, to carry out the necessary evolutions in the processes supported …", "num_citations": "1\n", "authors": ["1141"]}
{"title": "Exploring the Directives of Communicability for Improving the Quality of Software Artifacts\n", "abstract": " Software artifacts developed in the early stages of the development process describe the proposed solutions for the software in construction. Thus, these artifacts support team communication. Failures in communication via software artifacts occur because practitioners typically concentrate on the artifacts’ content, without reflecting on how other software development team members will interpret these artifacts. Such communication failures can negatively affect the quality of software artifacts. To support better communication via artifact, we proposed the Directives of Communicability (DCs). The DCs aim to support practitioners in analyzing the characteristics that affect the artifacts’ content on team communication. In this paper, we present an exploratory study carried out to evaluate the practitioners’ perception about the contribution of DCs to the quality of a specific software artifact. The results indicate that DCs …", "num_citations": "1\n", "authors": ["1141"]}
{"title": "LESSQL: Dealing with Database Schema Changes in Continuous Deployment\n", "abstract": " The adoption of Continuous Deployment (CD) aims at allowing software systems to quickly evolve to accommodate new features. However, structural changes to the database schema are frequent and may incur in systems' services downtime. This encompasses the proper maintenance of both schema and source code, including rewrites of all outdated queries that use the same database. Previous solutions try to mitigate the burdening task of manually rewriting outdated queries. Unfortunately, a software team must still interact with some tools to properly fix the affected queries. Moreover, the team still has to locate and modify all the impacted code, which are often error-prone tasks. Thus, a project may not experience CD benefits when changes impact various code regions. In this paper we present an alternative approach, called LESSQL, whose goal is to improve queries' stability in the presence of structural …", "num_citations": "1\n", "authors": ["1141"]}
{"title": "UX-Tips: A UX evaluation technique to support the identification of software application problems\n", "abstract": " User Experience (UX) is a quality attribute that plays an important role in the quality of software applications, as it addresses users' feelings about a given product. Thus, evaluating the UX is essential to improve its quality. However, most UX evaluation techniques limit to indicate whether the UX was positive or negative, which makes it challenging to identify what must be corrected by the software development team. This paper presents UX-Tips (User eXperience for Interactive ProductS), a technique developed to deal with this limitation, whose main objective is to allow the identification of problems related to UX. We also present two empirical studies conducted to evaluate UX-Tips. In the first study, we assessed the feasibility of the technique concerning its primary goal. In the second study, we compared the performance of UX-Tips with a similar technique. The results showed that UX-Tips allowed the subjects to …", "num_citations": "1\n", "authors": ["1141"]}
{"title": "Empirical Studies Concerning the Maintenance of BPMN Diagrams: A Systematic Mapping Study.\n", "abstract": " Business process models help understand the organizational process and the software that supports it. BPMN (Business Process Modeling and Notation) is the standard notation for business process modeling, and it is widely accepted in industry. BPMN models can elucidate the activities carried out by a software during its construction and maintenance. However, during the maintenance of the software that supports an organizational process, usually only the source code of the software undergoes modifications, even when inserting new features. The software design models, including the BPMN models, often become outdated over time and, in future maintenance, they will not help understand the business process in which the software is inserted and which the software aims to support. Such scenario highlights the importance of supporting the maintenance of BPMN models. However, what has been experimentally investigated regarding the maintenance of BPMN models? To answer this question, we performed a systematic mapping, which showed experimental studies, factors and technologies that influence the maintenance of BPMN models. These results present conclusions about the state of the art and gaps that can be explored in this field of research.", "num_citations": "1\n", "authors": ["1141"]}
{"title": "Exploring how experienced and unexperienced designers use and evaluate a usability-oriented interaction and navigation model\n", "abstract": " Representing quality aspects in models used in the design of interactive systems can support to design solutions with higher quality of use. However, the quality of the designed solutions can be influenced by the designers’ experience and by the models’ expressiveness for representing the quality aspects. Recently, we proposed USINN (USability-oriented INteraction and Navigation model) to express usability mechanisms in interaction and navigation modeling solutions. In this paper, we present an experimental study conducted with students, characterized as experienced and unexperienced designers, in order to investigate how is USINN adopted and evaluated by designers with different levels of experience in the software industry. The results indicated that the quality of artifacts produced by experienced and unexperienced designers was similar. However, the unexperienced designers indicated higher intention to adopt USINN in the software industry.", "num_citations": "1\n", "authors": ["1141"]}
{"title": "Influence Factors for Knowledge Management Initiatives\n", "abstract": " Context: Knowledge Management (KM) is becoming critical in software organizations due to the increasing demands of the market. Despite the importance of KM, there is no consensus on which factors can influence KM initiatives in software organizations. Aim: The goal of this paper is to investigate what are the factors that influence KM in software organizations. Method: we performed a systematic mapping study on influencing factors for knowledge management in software organizations. Results: From a set of 1028 publications, 147 publications were analyzed and 10 were selected in this mapping, which helped us identify the influence factors that were most cited by the authors. Among the selected publications, the following factors were the most cited: Organizational Culture, Leadership, Information Technology and Social Network of Knowledge. Conclusion: There is a shortage of papers that address this issue of influencing factors for software organizations, and how to assess these factors in software organizations. Most studies show statistical data on the relationship between KM and the factors, but do not show how these factors can be evaluated in the organization. These aspects need to be addressed in the influence factors in order to improve knowledge management initiatives in software organizations.", "num_citations": "1\n", "authors": ["1141"]}
{"title": "Using IFML for user interface modeling: an empirical study (S).\n", "abstract": " Front-end interface and user-system interaction are factors that must be carefully considered in software development due to their influence in quality of use. On some occasions, it is the first concern addressed by developers, as it comes naturally from the requirements analysis performed with stakeholders. IFML is a standard language of OMG that supports the abstract description of these front-end interfaces, for software applications on different devices. IFML has been used in the context of Model-Driven Development (MDD) and Model-Driven Architecture (MDA) to describe the elements and behavior of interfaces, aiming to generate code for those interfaces. However, it is necessary to investigate the use of IFML in traditional software development, in order to better understand how it is used for modeling front-end interfaces. This article presents an empirical study that aimed to verify the quality of IFML models created based on a subset of requirements of software two web applications. The quality was defined in terms of models’ correctness and completeness. The results showed that the correctness of the models was low, varying from 51% to 55%, while the completeness varied from 66% to 69%. In order to better understand the results, we analyzed syntactic and semantic defects found.", "num_citations": "1\n", "authors": ["1141"]}
{"title": "Analyzing the Use Case Communicability\n", "abstract": " Software artifacts are products created during software development. Through them, designers communicate their intent and understanding of a system to other members of the development team. And the intent will, in the end, be communicated to end users through the system's interface. In this paper, we present a study about forms of expression for the informational content of use cases, and how they can affect mutual understanding among members of a software development team. We adopted the Semiotic Engineering perspective (in particular, the SigniFYIng Message tool) and the maxims of the Grice's Cooperative Principle to structure and analyze data collected from 17 pairs of participants. The results show evidence of communication strategies that may impair the communication between designers and developers and, subsequently, the metacommunication of design intent to end users through the system …", "num_citations": "1\n", "authors": ["1141"]}
{"title": "Mapeamento Sistemático para a geração de um Framework que Projetam e/ou Avaliam a Usabilidade nos Estágios Iniciais do Processo de Desenvolvimento de Software\n", "abstract": " Este relatório apresenta a execução de um mapeamento sistemático sobre tecnologias que podem ser empregadas para projetar e/ou avaliar a usabilidade nos estágios iniciais do processo de desenvolvimento de software. O planejamento do mapeamento em detalhes é apresentado, assim como os critérios de inclusão e exclusão, as fontes de informação utilizadas, a listagem de artigos encontrados de acordo com os critérios definidos no protocolo do mapeamento e os dados completos da extração de dados são descritos neste relatório. Além disso, uma análise dos artigos resultantes é realizada. Portanto, neste relatório ocorre a documentação do processo de mapeamento servindo de fonte de referência para artigos que tratem da análise dos achados nesta revisão de literatura.", "num_citations": "1\n", "authors": ["1141"]}
{"title": "Designing Activity Diagrams Aiming at Achieving Usability in Interactive Applications: An Empirical Study\n", "abstract": " With the increasing use of interactive applications, it is necessary that software companies produce applications providing a good quality of use for end users. It is important to assist designers in elaborating of design models, aiming at achieving usability of the interactive applications. We proposed a technique, called UDRT-AD (Usability Design Reading Technique for Activity Diagrams) that helps designers in modeling Activity Diagrams aiming at achieving usability in interactive applications. The goal of this paper is to present an empirical study carried out to verify the feasibility of using the UDRT-AD technique. The analysis of the results showed that the UDRT-AD technique could be employed to help in both creating the activity diagrams and early prevention of usability problems. Furthermore, we identified some issues that need to be improved in the UDRT-AD technique to further facilitate its use for …", "num_citations": "1\n", "authors": ["1141"]}
{"title": "How Novice Software Engineers Apply User Interface Design Patterns: An Empirical Study\n", "abstract": " Conveying a positive User eXperience (UX) is essential for the success of any application, as it affects use a product. Nevertheless, novice software engineers may have difficulties in finding an appropriate solution for UX problems due to their lack of knowledge in interface design. User interface design patterns are well-working solutions to user problems that occur repeatedly which can help new developers solve interface problems. Although several studies investigated the effectiveness of applying design patterns in real development projects, few studies evaluate the difficulties that novice software engineers face when applying user interface design patterns for the first time. To understand how novice software engineers apply design patterns in the correction of UX problems, we carried out an empirical study with four small novice development teams redesigning mobile applications interfaces. We collected data on factors affecting the applicability of the employed design patterns, through questionnaires. Our results suggest that novice software engineers find this type of patterns useful but require means to find and select an adequate pattern to solve a problem.", "num_citations": "1\n", "authors": ["1141"]}
{"title": "Aplicando Design Thinking para Melhorar a Qualidade de um Aplicativo Web Móvel\n", "abstract": " Design Thinking (DT) é uma metodologia que engloba iniciativas de inovação em atividades de projeto centrado no usuário, que pode ser aplicada para proporcionar uma melhor experiência de usuário (UX). Este artigo relata uma experiência na aplicação de DT no reprojeto do aplicativo web móvel Dona Know, o que permitiu identificar oportunidades de melhoria. Foram aplicados métodos de avaliação de UX com o objetivo de comparar a nova versão do aplicativo com a versão anterior ao reprojeto. Os resultados deste trabalho demonstram que houve aumento no nível de satisfação dos usuários ao utilizar a versão reprojetada do aplicativo.", "num_citations": "1\n", "authors": ["1141"]}
{"title": "Técnica para projeto de diagramas de atividades visando a usabilidade nas aplicações interativas\n", "abstract": " O projeto das aplicações interativas é uma atividade que necessita ser realizada de maneira correta e atendendo aos requisitos de qualidade, para que aplicação final seja fácil de usar. O objetivo deste trabalho é propor uma técnica que auxilie tanto os designers de IHC quanto os engenheiros de software a projetar Diagramas de Atividades, visando a usabilidade da aplicação final. Essa técnica auxiliará no aumento da qualidade das aplicações interativas.", "num_citations": "1\n", "authors": ["1141"]}
{"title": "Estudo comparativo entre diagrama de atividade e análise hierárquica de tarefas: uma análise da facilidade de modelagem e compreensão\n", "abstract": " O projeto de aplicações interativas ainda é uma atividade que necessita de bastante atenção da indústria. Muitos dos modelos utilizados nesta fase requerem um cuidado específico para sua construção. Com base nisso, neste trabalho foram avaliados dois diagramas utilizados na fase de projeto: o Diagrama de Atividade e a representação diagramática da Análise Hierárquica de Tarefas. O objetivo deste trabalho foi analisar estes dois diagramas, para verificar a facilidade de modelagem e a compreensão dos mesmos.", "num_citations": "1\n", "authors": ["1141"]}
{"title": "Web DUE: Uma Técnica de Inspeção de Usabilidade de Mockups de Aplicações Web Guiada Por Zonas Próprias de Páginas Web\n", "abstract": " Usabilidade é um dos atributos de qualidade de software que afetam a aceitação das aplicações desenvolvidas. No entanto, apesar do aumento do número de métodos de inspeção de usabilidade de aplicações Web, a maioria destes métodos só pode ser aplicada nas últimas etapas do processo de desenvolvimento, aumentando o custo de correção dos problemas identificados. Com o intuito de solucionar esta dificuldade, nesta pesquisa de mestrado foram propostas as tecnologias Design Usability Evaluation (DUE):(a) a técnica Web DUE, que é específica para inspeção de usabilidade de protótipos de baixa fidelidade (ou mockups) de aplicações Web; e (b) a ferramenta Mockup DUE que apoia sua aplicação. Além de apresentar como foram desenvolvidas estas tecnologias, este artigo apresenta a avaliação experimental das mesmas, sua evolução, e os resultados e benefícios decorrentes desta pesquisa.", "num_citations": "1\n", "authors": ["1141"]}
{"title": "Apoiando o Ensino de Qualidade de Software\n", "abstract": " A inspeção de usabilidade é uma atividade fundamental para garantir o desenvolvimento de um software de qualidade. Uma das técnicas de inspeção de usabilidade mais aplicadas para avaliar a usabilidade de artefatos de software é a Avaliação Heurística (AH). No entanto, o desempenho dos inspetores (número de defeitos identificados e tempo gasto na inspeção) depende da sua expertise, tornando a técnica mais indicada para inspetores experientes. Desta forma, torna-se importante investir no ensino da técnica AH para aumentar o desempenho dos inspetores novatos. Com o intuito de facilitar o processo de aprendizagem das heurísticas da técnica AH por este tipo de inspetores, foi desenvolvido o jogo educacional UsabiliCity que mostra, através de analogias, como as heurísticas podem ajudar a detectar e resolver problemas específicos de usabilidade. Além de introduzir o jogo, este artigo mostra a sua avaliação através de um experimento. Neste contexto, 37 alunos testaram o jogo, enquanto observadores identificaram oportunidades de melhoria. Foi medida a percepção dos alunos sobre o aprendizado para verificar se o jogo ajuda a entender melhor as heurísticas. Os resultados mostraram que, de um modo geral, as analogias facilitaram o entendimento das heurísticas e que o jogo contribuiu para o processo de aprendizagem.", "num_citations": "1\n", "authors": ["1141"]}
{"title": "Identificando Oportunidades de Melhoria em Tecnologias de Inspeção de Usabilidade para o Contexto Web Móvel através de um Experimento Controlado.\n", "abstract": " Um software com alto grau de usabilidade pode ser entendido e utilizado com maior facilidade pelos usuários. No caso específico de aplicações Web móveis, a usabilidade pode fazer a diferença entre o uso ou abandono da aplicação pelos usuários finais. Neste artigo, descreve-se um conjunto de tecnologias (técnicas e ferramenta) de inspeção de usabilidade que podem ser aplicadas por engenheiros de software para avaliar aplicações Web durante o seu design, diminuindo o custo de correção de problemas antes da escrita do código fonte da aplicação. Para identificar oportunidades de melhoria destas tecnologias para o contexto Web móvel, foi executado um estudo experimental comparando o seu desempenho e coletando dados sobre os fatores que dificultam a sua utilização. Espera-se com essas medidas adequar as tecnologias avaliadas ao contexto Web móvel, encorajando a indústria a utilizá-las no início do processo de desenvolvimento, garantindo a qualidade do software desenvolvido.", "num_citations": "1\n", "authors": ["1141"]}
{"title": "Monk: Uma Ferramenta de Apoio à Socialização do Conhecimento em Equipes de Software\n", "abstract": " In the development process, evaluations and metrics are used for measurement and control of the involved variables, such as expenses, labor effort and project prioritization. Therefore, it is necessary to manage human resources as well, beyond the administration of resources invested on products. This paper proposes the Monk tool that suggests professionals who can collaborate on a team with tacit knowledge, based on team organization supported by the Belbin theory. The Monk tool aims to support Knowledge Management, specifically on the socialization of the tacit knowledge in development teams and the sharing of organizational experience. Also, it seeks to encourage collaboration among the group and minimize conflicts on a team.", "num_citations": "1\n", "authors": ["1141"]}
{"title": "Especificação e Automação Colaborativas de Testes utilizando a técnica BDD\n", "abstract": " Teste é uma atividade indispensável no processo de desenvolvimento de software. Porém, sua execução manual tem um alto custo e, muitas vezes o cliente requer um feedback rápido, assim comprometendo a qualidade do produto. Uma forma de atuar nesse problema é por meio do uso do BDD (Behavior-Driven Development), em conjunto com o framework para automatização de testes web Selenium WebDriver. Este artigo apresenta um relato de experiência da utilização dessa técnica com automatização de testes no desenvolvimento de um software, permitindo a colaboração entre os integrantes do time, aumentando a qualidade do software e dando uma resposta ágil ao cliente.", "num_citations": "1\n", "authors": ["1141"]}
{"title": "WE-QT tool: uma ferramenta de apoio a inspeção de usabilidade de aplicações web\n", "abstract": " In the current days, there are a many inspection techniques. However, just few techniques offer tool support. In addition, usability inspections are still a challenge when the reviewers have little knowledge in this activity. This paper presents a tool to support a new specific usability inspection technique, called Web Evaluation Question", "num_citations": "1\n", "authors": ["1141"]}
{"title": "Uso conjunto de modelos e métodos para a melhor compreensão de fatores em Engenharia de Software\n", "abstract": " Sociotechnical processes are present in both Software development process and in the use of new technologies. Therefore, such processes require appropriate analysis methods to capture their aspects. In empirical studies, the amount of information extracted from the data can be expanded by combining quantitative and qualitative methods to obtain a more comprehensive understanding. This paper presents the combined use of the Technology Acceptance Model (TAM) as well as the procedures of Grounded Theory method in an experimental study. The article discusses how the combination of the Technology Acceptance model and the Grounded Theory method allowed a better understanding about the object of study.Resumo. Processos sóciotécnicos estão presentes tanto no processo de desenvolvimento de software quanto na utilização de novas tecnologias. Por essa razão, tais processos requerem …", "num_citations": "1\n", "authors": ["1141"]}
{"title": "Reading Techniques for Web Application Design\n", "abstract": " This paper presents a doctorate degree research which main goal is the definition of quality-related activities for the development of Web applications. Specifically, this work intends to develop a new kind of inspection techniques: Reading Techniques for Web Applications Design. It also defines a proposal to evaluate experimentally the feasibility of such techniques.", "num_citations": "1\n", "authors": ["1141"]}