{"title": "Artistic Research. Theories, Methods and Practices.\n", "abstract": " Artistic Research. Theories, Methods and Practices. — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Artistic Research. Theories, Methods and Practices. Mika Hannula, Juha Suoranta, Tere Vadén Research output: Book/Report › Commissioned report Overview Original language Undefined/Unknown Place of Publication Gothenburg Edition 1 Publication status Published - 2005 Publication type D4 Published development or research report or study Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Hannula, M., Suoranta, J., & Vadén, T. (2005). Artistic Research. Theories, Methods and Practices. (1 ed.). Hannula, Mika ; Suoranta, Juha ; Vadén, Tere. / …", "num_citations": "331\n", "authors": ["915"]}
{"title": "3D printing community and emerging practices of peer production\n", "abstract": " Based on the results of a 2012 survey on people doing 3D printing, we present results on the demographics and self-identification of the community, as well as describing participants' printing activity. Combining results from the survey with insights from research literature, we analyse emerging patterns and practices of 3D printing as a subdivision of a more general trend of physical peer production, and, even, of a revolution in manufacturing, as predicted by several theorists.", "num_citations": "95\n", "authors": ["915"]}
{"title": "Artistic Research: Methodology\n", "abstract": " In this book, we discuss not so much the arts themselves but the methodology of artistic research. To put it in a nutshell, the core message of the book is as follows: artistic research! art and art making. Thus we are not interested here in taking part in the well-worn discussions on the arts and art making (frequently understood as artistic creativity and originality) or their intrinsic value. Instead, we try to advance research on the arts in the academic context and for the audiences around academia, that is, to contribute to the development of the research culture of the area. In so doing, we write about research methodologies and suitable methods for artistic research. The methodological guidelines, discussions, case studies and examples to follow are meant to provide ideas for those who want to deepen their understanding of their own artwork, in particular, and the art forms that provide the context for their work in general. In a word, our aim is to increase the awareness and reflectivity of both artists and their audiences about how to study art from the inside. Artistic researchers have at least three intertwined jobs ahead of them. First, they need to develop and perfect their own artistic craft, creativity and conceptual thinking by doing art and thinking (conceptualizing) art, that is, developing a personal vocabulary for speaking about art and its world. In addition, they have to contribute to academia and return something to their academic colleagues by proposing an argument in the form of a thesis, thus assisting in constructing the not yet very strong academic communities around artistic research. Third, they must communicate with practising artists and the …", "num_citations": "89\n", "authors": ["915"]}
{"title": "Wikiworld\n", "abstract": " Wikiworld / Wikiworld / Se connecter English Accueil d'EDUQ.info → Autres → Autres → Visualiser le document Texte intégral disponible Recherche avancée Permalien de la fiche: http://eduq.info/xmlui/handle/11515/18319 Wikiworld / Suoranta, Juha; Vadén, Tere Date: 2009. Support matériel: Ressource physique Type de document: Livre Langue: eng ISBN: 9780745328911 Éditeur: Palgrave McMillan, Description matérielle: 201 p. ; 22 cm. Note: Bibliogr. Afficher la notice détaillée Fichier(s) pour ce document Fichier(s) Taille Format Visualiser Ce document est peut-être: Un livre numérique. Pour y accéder, cliquez ci-haut sur le «Lien externe» contenant ez-proxy.cdc.qc.ca et suivez les instructions. OU Un livre papier. Contactez-nous pour l'emprunter: info@cdc.qc.ca Ce document provient de la/les collection(s) suivante(s) Autres [15516] Parcourir Tout EDUQ.info Communautés et collections Date de publication …", "num_citations": "71\n", "authors": ["915"]}
{"title": "Otsikko uusiksi. Taiteellisen tutkimuksen suuntaviivat.\n", "abstract": " Otsikko uusiksi. Taiteellisen tutkimuksen suuntaviivat. — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Otsikko uusiksi. Taiteellisen tutkimuksen suuntaviivat. Mika Hannula, Juha Suoranta, Tere Vadén Research output: Book/Report › Book › Professional Overview Original language Finnish Place of Publication Tampere Edition 1 Publication status Published - 2003 Publication type D5 Text book, professional manual or guide or a dictionary Keywords taiteellinen tutkimus Access to Document http://granum.uta.fi/granum/kirjanTiedot.php?tuote_id=9355 Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Hannula, M., Suoranta, J., & Vadén, T. (2003). …", "num_citations": "66\n", "authors": ["915"]}
{"title": "Decoupling for ecological sustainability: A categorisation and review of research literature\n", "abstract": " The idea of decoupling “environmental bads” from “economic goods” has been proposed as a path towards sustainability by organizations such as the OECD and UN. Scientific consensus reports on environmental impacts (e.g., greenhouse gas emissions) and resource use give an indication of the kind of decoupling needed for ecological sustainability: global, absolute, fast-enough and long-enough. This goal gives grounds for a categorisation of the different kinds of decoupling, with regard to their relevance. We conducted a survey of recent (1990–2019) research on decoupling on Web of Science and reviewed the results in the research according to the categorisation. The reviewed 179 articles contain evidence of absolute impact decoupling, especially between CO2 (and SOX) emissions and evidence on geographically limited (national level) cases of absolute decoupling of land and blue water use from GDP …", "num_citations": "49\n", "authors": ["915"]}
{"title": "The Protestant ethic strikes back: Open source developers and the ethic of capitalism\n", "abstract": " Free/Open Source software development has initiated new models and theories of social organization and immaterial labor in terms of a “hacker” culture. However, our survey of four developer communities shows that there is a continuum of communities from voluntary communities, corresponding to the “hacker” image, to more business-oriented communities deviating from the image. It is particularly noteworthy that old and familiar modes of organization based on waged labor are increasingly a part of developer communities. This may create new dynamics and tensions both inside communities and between the various partners taking part in Free/Open Source software development projects.", "num_citations": "44\n", "authors": ["915"]}
{"title": "Energia ja kokemus\n", "abstract": " Jos kerran porvarillinen vallankumous murhasi Jumalan, Hän laskeutui maan alle tullakseen hyödynnetyksi sen tarpeisiin öljynä. Ensimmäinen kaupallinen öljynporaustorni nousee Pennsylvaniaan vuonna 1859, seuraavalla vuosikymmenellä rakennetaan ensimmäiset alkeelliset putkistot ja öljy alkaa kulkea pitkiä matkoja. Nietzsche tunnistaa ruumiin vuonna 1882. Aikayhteys tiivistää puolitiedostamattoman kokemuksen, joka on vaivannut viimeistä 150 vuotta Euroopassa, Yhdysvalloissa ja näiden mahtien välityksellä vähitellen ympäri maapalloa. Jumalan kuolema on koettu paitsi vapautumisena auktoriteetin kahleista, myös kaikkinaisena merkityksen virttymisenä, arvojen ja päämäärien auringonlaskuna, jonka jälkeen on vain välineiden ja Nietzschen kuvaamien» viimeisten ihmisten» työläs ja tasapäinen aika. Öljyn aikakausi on seurannut kuin varjona kapitalismin ja globalisaation maailmanvalloitusta, jonka 1990-luvulla väitettiin jo päättyneen liberaalin demokratian ja siten itsensä tiedostavan historian voittoon.", "num_citations": "35\n", "authors": ["915"]}
{"title": "Mapping Low-Income African American Parents' Roles in Their Children's Education in a Changing Political Economy.\n", "abstract": " Background: Much discussion and debate has surrounded the role that low-income minority parents can play in their children’s education. Research focusing on parents’ roles has stressed parents’ sense of self-efficacy, cultural background, socio-economic factors, and the context of school to explain not only what motivates parents to become involved in their children’s education, but also how, why, and in whose interests. However, few researchers have examined parents’ roles in the context of race and a changing political economy or the less visible roles that parents’ play in fostering their children’s intellectual and emotional growth.Purpose: This research examined the roles parents constructed for themselves in their children’s education and the assets they brought to bear to support their children at home, at school, and in the community. This study also focused on the extent to which their roles changed over …", "num_citations": "32\n", "authors": ["915"]}
{"title": "Learning in and with an open wiki project: Wikiversity’s potential in global capacity building\n", "abstract": " There is a chance that Wikiversity will become the Internet's free university just as Wikipedia is the free encyclopedia on the Internet. The building of an educational entity demands considering a number of philosophical and practical questions such as pedagogy and organization. In this paper we will address some of these, starting by introducing several earlier approaches and ideas related to wikis' potential for education. We continue by presenting three commonly used metaphors of learning: acquisition, participation and knowledge creation. Then we will present the main principles of two existing alternative educational approaches: free adult education and free school movement. To test these educational approaches and practices on Wikiversity and increase our understanding of the possibilities of this initiative, in the spring of 2008 we implemented an experimental course in Wikiversity. We conclude with several recommendations essentially advocating for Wikiversity and the use of wikis in education. However, more than just presenting our opinions, as authors we aim to make an educated-traditionally and in the wiki way-contribution to the international discussion about the future of education for all in the digital era.", "num_citations": "32\n", "authors": ["915"]}
{"title": "Musical meaning in between: Ineffability, atmosphere and asubjectivity in musical experience\n", "abstract": " Ineffability of musical meaning is a frequent theme in music philosophy. However, talk about musical meaning persists and seems to be not only inherently enjoyable and socially acceptable, but also functionally useful. Relying on a phenomenological account of musical meaning combined with a naturalist explanatory attitude, we argue for a novel explanation of how ineffability is a feature of musical meaning and experience and we show why it cannot be remedied by perfecting language or musico-philosophical study.Musical meaning is seen as an experiential phenomenon that consists of layers, some recent, others archaic. As such, musical meaning is strongly characterized by asubjectivity. It is in-between, in a state where the division of subject and object is not yet valid or valid anymore. A naturalistic interplay of experiential layers in music brings about a non-reified dynamics driving for expressions …", "num_citations": "31\n", "authors": ["915"]}
{"title": "From social to socialist media: The critical potential of the wikiworld\n", "abstract": " From Social to Socialist Media: The Critical Potential of the Wikiworld — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation From Social to Socialist Media: The Critical Potential of the Wikiworld J Suoranta, T Vadén Research output: Chapter in Book/Report/Conference proceeding › Chapter › Scientific › peer-review Overview Original language English Title of host publication Critical Pedagogy: Where Are We Now? Editors P McLaren, J Kincheloe Place of Publication New York Publisher Peter Lang Pages 143 162 ISBN (Print) 978-0820481470 Publication status Published - 2007 Publication type A3 Part of a book or another research book Keywords Critical pedagogy …", "num_citations": "30\n", "authors": ["915"]}
{"title": "To continue to burn something? Technological, economic and political path dependencies in district heating in Helsinki, Finland\n", "abstract": " The transition away from fossil fuel based infrastructure for heating and cooling has to happen on a scale and timetable with no historical precedent. As the systems are large and networked, path-dependencies constrain the transition that is further complicated by the diversity of stakeholders. Here we analyze the case of transitioning the district heating system in the city of Helsinki, Finland, within the target of a carbon neutral metropolitan area. Despite relatively advanced climate policies, path-dependencies on the political, technological-material and economical levels interact in creating a ”wicked” problem with no obvious solution and potential for backsliding. It is in this context that a possibility of a green paradox arises: despite the explicit commitment of all stakeholders toward carbon dioxide emission reductions, the combination of the path-dependencies may result in a transition that increases emissions. Our …", "num_citations": "24\n", "authors": ["915"]}
{"title": "Heidegger, Žižek and revolution\n", "abstract": " Why did Martin Heidegger, the giant of continental philosophy, believe in 1933 that Hitler is the future of Europe? And why does Slavoj Žižek,“the most dangerous philosopher in the West”, support Heidegger’s right wing militancy? Heidegger and Žižek are not only erudite thinkers on human being but also incorrigible revolutionaries who even after the catastrophic failures of their favourite revolutions–the October revolution for Žižek and the National Socialist revolution for Heidegger–want to overcome capitalism; undemocratically, if necessary. The two share a spirited and sophisticated rejection of the liberalist worldview and the social order based on it. The problem is not that liberalism is factually wrong, but rather that it is ethically bad. Both argue for building and educating a new collective based on human finitude and communality. In the tradition of the Enlightenment, Žižek advocates a universalist revolution, whereas Heidegger sees the transformation rooted in particular historical existence, inviting a bewildering array of mutually exclusive criticisms and apologies of his view. The crisis that Heidegger and Žižek want to address is still here, but their unquestioned Europocentrism sets a dark cloud over the whole idea of revolution.", "num_citations": "17\n", "authors": ["915"]}
{"title": "Rock the boat: localized ethics, the situated self, and particularism in contemporary art\n", "abstract": " Tere Vadén, Rock the Boat: Localized Ethics, the Situated Self, and Particularism in Contemporary Art - PhilPapers Sign in | Create an account PhilPapers PhilPeople PhilArchive PhilEvents PhilJobs PhilPapers home Syntax Advanced Search Syntax Advanced Search Syntax Advanced Search Rock the Boat: Localized Ethics, the Situated Self, and Particularism in Contemporary Art Tere Vadén Salon (2003) Abstract This article has no associated abstract. (fix it) Keywords Place (Philosophy) in art Identity (Psychology) in art Art, Modern Categories Aesthetics (categorize this paper) Buy this book Find it on Amazon.com Call number N8236.P46.V33 2003 ISBN(s) 3897701936 Options Edit this record Mark as duplicate Export citation Find it on Scholar Request removal from index Revision history Download options PhilArchive copy Upload a copy of this paper Check publisher's policy Papers currently archived: 59,666 …", "num_citations": "16\n", "authors": ["915"]}
{"title": "Raising the bar: on the type, size and timeline of a ‘successful’decoupling\n", "abstract": " Decoupling environmental ‘bads’ from economic ‘goods’ is a key part of policies such as green growth and circular economy that see economic growth as desirable or necessary, and also see that current use of natural resources and its environmental impacts is unsustainable. We estimate what a ‘successful decoupling’ (2% annual GDP growth and a decline in resource use by 2050 to a level that could be sustainable and compatible with a maximum 2°C global warming) would mean in terms of its type, timeline and size. Compared to 2017, ‘successful’ decoupling has to result in 2.6 times more GDP out of every ton of material use, including in-use material stocks. There are no realistic scenarios for such an increase in resource productivity.", "num_citations": "15\n", "authors": ["915"]}
{"title": "A definition and criticism of cybercommunism\n", "abstract": " When Žižek (2002b) defines his idea of cybercommunism using an adaptation of the Leninist formula ‘Socialism = free access to internet + the power of the soviets’, he omits the crucial part about electricity. The cybercommunist idea that the information society is more ‘spectral’ and ‘malleable’ than were the previous ‘crudely’ economical societies conceals the question of what types of communities it favours. The political economy of cybercommunism also demands an analysis of the material conditions of cyber-freedom that can be conceptualised, for instance, in terms of levels of decreasing alienation.", "num_citations": "15\n", "authors": ["915"]}
{"title": "Community created open source hardware: A case study of\" eCars-Now!\"\n", "abstract": " Based on a survey, we describe the demographic and motivational structure of one open source hardware (OSH) community and compare it to open source software (OSS) communities. Taken separately, both the demographics and the motivational structure of the OSH community fall clearly within the typology of OSS communities, but when the two are taken together the OSH community forms a type of its own. We also discuss bottlenecks in OSH development revealed by the survey and subsequent interviews.", "num_citations": "14\n", "authors": ["915"]}
{"title": "Free Software Philosophy and Open Source\n", "abstract": " This chapter introduces and explains some of the most relevant features of the free software philosophy formulated by Richard M. Stallman in the 1980s. The free software philosophy and the free software movement built on it historically preceded the open source movement by a decade and provided some of the key technological, legal and ideological foundations of the open source movement. Thus, in order to study the ideology of open source and its differences with regard to other modes of software production, it is important to understand the reasoning and the presuppositions included in Stallman’s free software philosophy.", "num_citations": "14\n", "authors": ["915"]}
{"title": "Digital nominalism. Notes on the ethics of information society in view of the ontology of the digital\n", "abstract": " The commodification of code demands two preconditions: a belief if the existence of code and a system of ownership for the code. An examination of these preconditions is helpful for resisting the further widening of digital divides. The ontological belief in the relatively independent existence of code is dependent on our understanding of what the “digital” is. Here it is claimed that the digital is not a natural kind, but a concept that is relative to our practices of interpretation. An interpretative system that sees code as something that can or should always be owned implies an increase of social control and threatens vital processes of knowledge creation that are necessary for an open and egalitarian information society. The ontological belief in “digital code” thus provides the backdrop for an ethical view of the information society. Consequently, if we see digital code as an interpretative notion (in the nominalist way …", "num_citations": "14\n", "authors": ["915"]}
{"title": "Northern Warning Lights: Ambiguities of Environmental Security in Finland and Sweden\n", "abstract": " As the literature on environmental security has evolved and widened, knowledge of the full range of potential consequences of environmental change for different societies remains scattered. This article contributes to a more comprehensive approach to the implications of environmental change by providing a three-level framework of the security impacts. In particular, it will address gaps in knowledge by pointing out the relevance of geopolitical and structural factors behind environmental security impacts. The article will focus on the cases of two countries, Finland and Sweden—both seen as stable, high-income democracies that are well equipped to adapt to climate risks. Yet even under these conditions, preparedness to threat-prevention will not follow without a recognition of the full range of risks, including ones that are linked to socio-economic and geopolitical factors. On the basis of the Finnish and Swedish cases, the article proposes an analytical framework of three categories of environmental security impacts: local, geopolitical and structural. View Full-Text", "num_citations": "13\n", "authors": ["915"]}
{"title": "Wikilearning as radical equality\n", "abstract": " A working defi nition of wikilearning could be as follows:(1) the group is self-organized and volunteer (in opposition to pupils and students as captive audience in the school settings); this naturally includes the option of starting", "num_citations": "13\n", "authors": ["915"]}
{"title": "Onnistunut irtikytkentä Suomessa?\n", "abstract": " Ympäristövaikutusten irtikytkentää talouden koosta ja kasvusta on esitetty ratkaisuksi ekologisen kestämättömyyden ongelmaan. Irtikytkentä on myös “vihreän kasvun” ja kiertotalouden välttämätön taustaoletus. Kun arvioidaan, minkä kokoinen tehtävä onnistunut irtikytkentä Suomessa olisi ja miten nopeasti se pitäisi toteuttaa, huomataan sen olevan mahdotonta. Löytämämme empiiriset havainnot eivät osoita vaadittavan nopeaa ja syvää irtikytkentää. Tämän vuoksi irtikytkentä ei ole hyvä käsite ohjaamaan yhteiskunnallista päätöksentekoa, vaan tarvittavan muutoksen luonnetta on parempi kuvata käsittein, jotka eivät sitoudu irtikytkennän oletuksiin talouskasvusta.", "num_citations": "12\n", "authors": ["915"]}
{"title": "Karhun nimi. Kuusi luentoa luonnosta.\n", "abstract": " Karhun nimi. Kuusi luentoa luonnosta. — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Karhun nimi. Kuusi luentoa luonnosta. Tere Vadén Research output: Book/Report › Book › Professional Overview Original language Undefined/Unknown Place of Publication Tampere Publication status Published - 2006 Publication type D5 Text book, professional manual or guide or a dictionary Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Vadén, T. (2006). Karhun nimi. Kuusi luentoa luonnosta. Vadén, Tere. / Karhun nimi. Kuusi luentoa luonnosta. Tampere, 2006. Vadén, T 2006, Karhun nimi. Kuusi luentoa luonnosta. Tampere. Karhun nimi. Kuusi luentoa …", "num_citations": "12\n", "authors": ["915"]}
{"title": "Elements of open source community sustainability\n", "abstract": " A framework for analysing the sustainability of a community in four dimensions–social, cultural, legal and economical–is presented. The framework, complementing the typical technological assessment, is further differentiated by taking into account the different types of open source software communities, particularly with regard to their work ethics: voluntary or salary-based. In conclusion, the framework is tentatively applied to two communities, Debian and Eclipse.", "num_citations": "12\n", "authors": ["915"]}
{"title": "Kaksijalkainen ympäristövallankumous\n", "abstract": " Talouskasvuun ja teknologiseen edistykseen tähtäävä järjestelmä–oli se sitten kapitalistinen, sosialistinen, kansallis-sosialistinen, auktoritaaris-demokraattinen–on kestämätön. Kestämättömyys on tärkeä syy ympäristövallankumoukselle. Yksinkertaisesti: tarvitaan kestävä elämäntapa, jos elämää tahdotaan jatkaa. Tämä reaktiivinen syy ilmenee monessa yhteiskunnallisessa liikkeessä, joita yhdistää vastarinta ja antikapitalismi. Mutta on myös suorempi, ei-reaktiivinen syy. Elämä maailmassa, jossa vettä voi juoda purosta, marjan syödä metsästä ja jossa orava kirskuu oksalla on haluttavampaa kuin elämä, jossa ei. Ympäristövallankumous pitäisi siis tehdä vaikka talouskasvujärjestelmät tai teknoutopiat olisivat mahdollisia.Talouskasvujärjestelmät ovat kestämättömiä, koska ovat epärealistisia ja utooppisia. Kapitalismi on jo satoja vuosia koettanut poistaa köyhyyttä rikastuttamalla rikkaita, onnistumatta. Neuvostotyylinen sosialismi törmäsi ihmisluonnon karuuteen ja katteettomaan tuotanto-optimismiin. Samoille kareille ajaa pikkuisen perässä länsimainen kapitalismi. Ajatus näkymättömästä kädestä on kaunis ihanne, mutta ei toimi käytännössä. Alkanut finanssikriisi on merkki suuremmasta muutoksesta. Aineellisten resurssien, erityisesti fossiilisten polttoaineiden kuten öljyn, helppo ja halpa saatavuus loppuu vähittäin ja nykäyksittäin. Samoin loppuu tila jätteiltä ja saasteilta. Meret ja ilma ovat liian pieniä roskiksiksi. Öljy yksistään on tuonut valtavan työnlisäyksen 1 800-luvun puo-", "num_citations": "11\n", "authors": ["915"]}
{"title": "Experiences of Wiki use in Finnish companies\n", "abstract": " The objective of our study was two-fold. The first and most important objective was to gather experiences on the use of wiki software in Finnish companies. The second objective was to study the frequency of the use of wikis among Finland's 50 biggest companies. Twenty answers on wiki use experiences were received, the responses were divided fairly evenly into different sized companies which operate within different branches. The following questions were surveyed: reasons for the introduction of wikis, purposes of use, motivation methods, introduction processes, present purposes of use, integration of wiki applications to other operating systems, experienced problems and advantages, and tailoring of wiki applications.", "num_citations": "11\n", "authors": ["915"]}
{"title": "Ajo ja jälki. Filosofisia esseitä kielestä ja ajattelusta.\n", "abstract": " Ajo ja jälki. Filosofisia esseitä kielestä ja ajattelusta. — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Ajo ja jälki. Filosofisia esseitä kielestä ja ajattelusta. Tere Vadén Research output: Book/Report › Book › Professional Overview Original language Undefined/Unknown Place of Publication Jyväskylä Edition 1 Publication status Published - 2000 Publication type D5 Text book, professional manual or guide or a dictionary Keywords kielifilosofia mielenfilosofia Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Vadén, T. (2000). Ajo ja jälki. Filosofisia esseitä kielestä ja ajattelusta. (1 ed.). Vadén, Tere. / Ajo ja jälki. Filosofisia esseitä kielestä ja ajattelusta. 1 ed…", "num_citations": "11\n", "authors": ["915"]}
{"title": "A Study in Counterfactual Correspondence\n", "abstract": " It is suggested by Smolensky that in cognitive science the symbolic is an idealization of the subsymbolic. They may be seen as complementary ways to understand and explain cognition, and therefore we should not try to eliminate one of them in favour of the other. Rather, we should think of their relationship as providing a cognitive correspondence principle, a principle analogous to the correspondence principle much discussed in the philosophy of physics. But Smolensky's proposals are vague, and there seem to be no attempts in the literature to give them a more definite form. For this reason it is somewhat difficult to see their real significance.In this paper, we shall evaluate the proposals by relating them to the work recently done in the philosophy of science, and offer a case study of the relationship between symbolic and subsymbolic representations. It turns out that good sense can be given to the suggestion that a particular kind of symbolic representation (or a theory of symbolic representation) is a limiting case of a particular kind of subsymbolic representation (or a theory). Due to the method used, the case study also sheds some light on the notion of idealization in cognitive science.", "num_citations": "11\n", "authors": ["915"]}
{"title": "Breaking Radical Monopolies: towards political economy of digital literacy\n", "abstract": " In this article, the authors argue for a leap from a ‘weak’ digital literacy (skills of interpretation and strategies of reception) to strong digital literacy (authorship and autonomous skills and capacities). Strong digital literacy implies politico-structural analysis of the information societies to come. Given the current forms of economic production and corporate markets, the liberating and democratic potential of digital information is counteracted by the concentration of media ownership, as well as by policy, legislation, and the development of propriety forms of technology. The authors apply the concept of radical monopoly in analysing the possibilities of strong digital literacy in two contexts: education and computer software. In these, as in other areas, digital technology promises abundance, but only if the formal vision of the information society in the singular is overcome. This would not only mean interaction and authorship …", "num_citations": "10\n", "authors": ["915"]}
{"title": "Koodi vapaaksi: hakkerietiikan vaativuus\n", "abstract": " Lukija pitää käsissään kiistakirjoitusta, jonka tarkoituksena on esittää, että informaatioteknologian myönteisten eettisten mahdollisuuksien saavuttaminen vaatii vaivaa, ja että yksi tapa tuohon vaivannnäköön on vapaiden ohjelmistojen käyttö. Kirjan ensimmäinen artikkeli esittelee vapaan ohjelmiston historiallisen taustan ja johdattaa termeihin kuten” hakkeri”,” koodi” ja” käyttäjänoikeus”. Toinen artikkeli, Richard M. Stallmanin kirjoittama” Miksi ohjelmistojen pitäisi olla vapaita”, esittää yksityiskohtaisen argumentin ohjelmistojen omistusta vastaan (alkuperäinen engalnninkielinen artikkeli löytyy osoitteesta http://www. gnu. org/philosophy/shouldbefree. html). Kolmanneksi kirja sisältää Stallmanin haastattelun, jossa keskustellaan vapaan ohjelmiston vaikutuksista ja sen yhteyksistä muihin informaatioteknologian ja etiikan suhdetta koskeviin näkemyksiin ja liikkeisiin. Viimeisessä artikkelissa koetan parhaani mukaan laajentaa stallmanilaisia ajatuskulkuja filosofiseen pohdiskeluun, joka ei koske pelkästään ohjelmistojen käyttöä vaan teknologiaa ja vapaaehtoista yhteistyötä laajemminkin.", "num_citations": "10\n", "authors": ["915"]}
{"title": "Between Žižek and Wagner: Retrieving the Revolutionary Potential of Music\n", "abstract": " In his foreword to Adorno's In Search of Wagner ii Slavoj Žižek intimates that Wagner contains a revolutionary potential that has not been spotted or fully brought out yet and that now,\" after the exhaustion of the critical-historicist and aestheticist paradigms\"(Žižek 2009a: xxvii), is the right, decisive time. Žižek sees the new phase as ideologico-critical, or, better yet, political. While Žižek's determination to enlist even Wagnerian opera in revolutionary struggle is laudable, there are some reasons to suspect the grounds on which his view is based. Žižek's conception of music inherits a tension that characterises his view on the subject, including that of the revolutionary subject, and this tension is, in fact, intensified when it is transposed to the description of music. The underlying question is, can music ever bear the revolutionary role envisaged for it by Žižek? The conception seems to lead to an unhappy choice (correlative to a more general double-bind in the notion of the subject). On one hand, if music is a symbolic form, can it find experiential purchase to move people into revolution? On the other hand, if it is has a direct lifeline to pre-individual experience, can it point towards a revolution that is emancipatory in the Enlightenment sense?", "num_citations": "9\n", "authors": ["915"]}
{"title": "Open source software management framework\n", "abstract": " As open source and open source business is rapidly becoming mainstream as witnessed eg by the latest estimates from IDC, Gartner and seemingly most analysts it felt that it was an appropriate time to try to get some feedback from entrepreneurs and experts in this space about some of the do’s and don’ts they have learned over the years building open source businesses. All the answers can be found collected in Mikko Puhakka’s blog at http://blogit. digitoday. fi/opensource/2007/06/15/, but here are few select ones.", "num_citations": "9\n", "authors": ["915"]}
{"title": "Nerous, yksilö, lahja. Huomioita nerosta ja vallasta\n", "abstract": " Nerous, yksilö, lahja. Huomioita nerosta ja vallasta — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Nerous, yksilö, lahja. Huomioita nerosta ja vallasta Tere Vadén Research output: Chapter in Book/Report/Conference proceeding › Chapter › Scientific › peer-review Overview Original language Undefined/Unknown Title of host publication Kirjoituksia neroudesta. Myytit, kultit, persoonat Editors Taava Koskinen Place of Publication Helsinki Publication status Published - 2006 Publication type A3 Part of a book or another research book Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Vadén, T. (2006). Nerous, yksilö, lahja. Huomioita nerosta ja vallasta. …", "num_citations": "9\n", "authors": ["915"]}
{"title": "Survey on four OSS communities: description, analysis and typology\n", "abstract": " Mikkonen, T., Vainio, N., & Vadén, T.(2006). Survey on four oss communities: Description, analysis and typology. In N. Helander, & M. Mäntymäki (Eds.), EMPIRICAL INSIGHTS ON OPEN SOURCE SOFTWARE BUSINESS (EBRC Research Reports; No. 34). Tampere University of Technology (TUT) and University of Tampere (UTA). http://ossi. coss. fi/ossi/fileadmin/user_upload/Publications/Ossi_Report_0606. pdf", "num_citations": "9\n", "authors": ["915"]}
{"title": "Filosofian haasteet\n", "abstract": " Filosofian haasteet — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Filosofian haasteet Jari Keinänen, Tere Vadén Research output: Book/Report › Book › Professional Overview Original language Finnish Place of Publication Jyväskylä Edition 1 Publication status Published - 2005 Externally published Yes Publication type D5 Text book, professional manual or guide or a dictionary Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Keinänen, J., & Vadén, T. (2005). Filosofian haasteet. (1 ed.). Keinänen, Jari ; Vadén, Tere. / Filosofian haasteet. 1 ed. Jyväskylä, 2005. Keinänen, J & Vadén, T 2005, Filosofian haasteet. 1 edn, Jyväskylä. Filosofian haasteet. …", "num_citations": "9\n", "authors": ["915"]}
{"title": "Ethics of living technology: design principles for proactive home environments\n", "abstract": " The entry of proactive technology into highly sensitive environments, such as the home, produces specific design challenges that are inextricably linked to ethical issues. Two design goals are presented and analysed: proactive solutions have to be both personalized and consistent. These requirements are partially contradictory, and need to be understood in the context of the socio-cognitive setting of the home. The embedding of proactive technology into a home environment has to provide the user with an awareness of the possibilities of control and play. These design goals are further developed with regard to different user cultures: here we concentrate on early adopters and elderly people.", "num_citations": "9\n", "authors": ["915"]}
{"title": "Väännetäänkö rautalangasta? Huomioita kokemukselliseen käytäntöön perustuvan tutkimuksen metodologiasta\n", "abstract": " Väännetäänkö rautalangasta? Huomioita kokemukselliseen käytäntöön perustuvan tutkimuksen metodologiasta — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Väännetäänkö rautalangasta? Huomioita kokemukselliseen käytäntöön perustuvan tutkimuksen metodologiasta Tere Vaden Research output: Chapter in Book/Report/Conference proceeding › Chapter › Professional Overview Original language Undefined/Unknown Title of host publication Taiteellinen tutkimus Editors Satu Kiljunen, Mika Hannula Place of Publication Helsinki Pages 91-111 Publication status Published - 2001 Publication type D2 Article in professional manuals or guides or professional …", "num_citations": "9\n", "authors": ["915"]}
{"title": "Elo ja anergia\n", "abstract": " Tätä kirjoitettaessa on kulunut puoli vuosikymmentä teoksemme Energia ja kokemus ilmestymisestä. Näinä vuosina energia-ja materiavauraan eliitin, johon vaikkapa läntispohjoinen keskiluokka lukeutuu, normaalielämä on säilynyt neuvottelemattomissa, siinä missä planetaariset tunnusluvut osoittavat yhä kiihtyvään romahdussuuntaan. Usko fossiilisilla polttoaineilla pystytetyn ja uusinnetun moderniteetin edistyskertomuksiin vaikuttaa edelleen liikuttavan horjumattomalta. Eritoten vaurailla maailmankolkilla tieteellisen konsensuksen ja kokemuksellisen normaalin ristiriita voisi tuskin olla räikeämpi. Ristiriidan ylläpitoon tarvittavan fossiiliporvarillisen humanismin hegemonia on sivilisaatiohistoriallisestikin tarkastellen ennenkuulumattoman hybrinen: ensimmäistä kertaa tietyn ihmisryhmän käsitys hyvästä elämästä ja keinot siihen pääsemiseksi näyttävät riittävän romauttamaan kokonaisen planeetan elinolosuhteet ennakoimattomaksi ajaksi.", "num_citations": "8\n", "authors": ["915"]}
{"title": "Kenen antroposeeni?: maapallojärjestelmätieteen paradigmamuutos, ihmistieteiden antroposeeni ja käsitteiden moninaisuus\n", "abstract": " Nykymuotoinen keskustelu antroposeenista sai alkunsa Paul Crutzenin ja Eugene Stoermerin artikkelista vuonna 2000. Tutkijat ehdottivat, että olisi nimettävä uusi aikakausi, antroposeeni, kuvaamaan ihmisen laajentunutta vaikutusta maapallolla. Ehdotuksen mukaan ihmiskunnasta on tullut geologinen voima, joka vaikuttaa pysyvästi koko maapallojärjestelmän toimintaan. Vaikka antroposeenilla ei ole vielä virallista luonnontieteellistä asemaa, on termin käyttö levinnyt laajalle eri tieteenaloilla.", "num_citations": "8\n", "authors": ["915"]}
{"title": "Results from 3D printing survey 2013\n", "abstract": " ResultsThe amount of respondents was 344 (2012 count was 358), out of which 254 answered to all questions. 90 participants did not finish the survey for some reason. One of the reasons might be difficulties with the survey, a problem discussed at the end. Average respondent was a 35 years old male from Europe or North America.", "num_citations": "8\n", "authors": ["915"]}
{"title": "Ethics and gods: How is local ethics possible?\n", "abstract": " One prominent interpretation of Heidegger's thought on issues that are traditionally called “ethical” is that it gives us a formal description of how to reach authenticity (the early Heidegger) or how to gain a free relationship to technology (the late Heidegger) without stating any positive prescriptions. However, as Hubert L. Dreyfus (1995), (2000) has argued, there is more than pure formalism to Heidegger's thought: he points again and again to how important rootedness, Boden and Heimat, are in trying to overcome the technological understanding of being. Notoriously, Heidegger sees a special role to the Greek-German linguistic axis in internally challenging the tradition of Western metaphysics. This putative special status is in an unsettling way connected to Heidegger's antidemocratic ideas and to the “closedness” of the tradition that according to him is able to challenge the technological world. We will claim …", "num_citations": "8\n", "authors": ["915"]}
{"title": "Mitä on paikallinen ajattelu?\n", "abstract": " Kysymys vmitä on suomalainen filosofia? v voidaan ym märtää ainakin kahdella eri tavalla. Voidaan ensinnäkin kysyä, millaista suomalainen filosofia on ollut. Vastauksena saamme tietää, miten muualta tullut filosofia on Suomessa tulkittu, samaan tapaan kuin kysymykseen suomalaisesta kristillisyydestä saadaan vastaus siitä, miten kristillisyys on Suomeen tuotu, ja mitä muotoja se on saanut. Tämä ky symyksen muoto on tärkeä esimerkiksi jos halutaan tietää, miksi suomalaisessa filosofiassa ei ole kysytty paikallisuuden kysymystä. Kysymättömyyteen on syynsä n eivätkä ne ole kokonaan erilaiset syyt kuin uskonnollisen käännytyksen syyt n ja ne paljastavat filosofiasta Suomessa paljon. Kysymyksen toinen muoto on kysymys suomalaisesta filosofiasta silloin, kun se on ainutlaatuista ajattelua tai ai nutkertaista ajattelua. Ainutkertaista siten, että se tapahtuu vain kerran ja siten, että sitä ei voida mielivaltaisesti toistaa. Ainutlaatuista siten, että ajattelun ominaisuudet ovat kiinni ajattelun tapahtumissa, eikä niitä voida abstrahoida tai idealisoida niistä erikseen. Tällainen suomalainen filosofia olisi paikallista, toisin kuin yleispäteväksi väitetty Kreikasta alkanut perinne.Voiko olla ainutlaatuista suomalaista filosofiaa? Ensim mäinen vastaus on kielteinen. Olemassa oleva suomalainen filosofia on eurooppalaista filosofiaa tai amerikkalaista filo sofiaa; sanalla sanoen länsimaista filosofiaa. Pidetään jon kinlaisena ongelmana, jos on olemassa ajattelua, joka ei ole eurooppalaista tai amerikkalaista (samaan tapaan kuin on pidetty ongelmana, jos on suomalaisia menoja, jotka eivät ole kristillisiä); ainakaan tuo ajattelu ei ole selvästi filosofiaa.", "num_citations": "8\n", "authors": ["915"]}
{"title": "Ethics, nafthism, and the fossil subject\n", "abstract": " Several socio-economic and technological conditions shaped the faces of modernity, but without massive energy surplus modernity as we know it would not be possible at all. Fossil fuels are not created by humans. Consequently, part of the credit for modernity that is assigned to the other (human) conditions, belongs to (non-human) fossil fuels. The misplaced assignment of credit also points to modernity's characteristic blindness to its material conditions. By and large, modernity has been described as a human victory over nature. This is supremely ironic, as the supposed human independence relies on a particular natural phenomenon. Unfortunately, this forgetfulness extends into ethics. Typical modern views on ethics rely on a subject with an autonomous capacity to act and deliberate. There is a structural parallel between the way in which the modern subject detaches itself from its material and social …", "num_citations": "7\n", "authors": ["915"]}
{"title": "Qui perd gagne: Failure and cinematic seduction\n", "abstract": " Although it is mentioned only once in the writings of Sigmund Freud, the so called “Jewish joke” appears on various occasions in the work of Jacques Lacan (1978: 139; 1993: 37; 2006: 13, 436) and is developed in various permutations, and with great didactic force, by Slavoj Žižek (1989: 197; 1992: 73; 1998: 12). The joke, as Freud originally presents it, is as follows:Two Jews met in a railway carriage at a station in Galicia.“Where are you going?” asked one.“To Cracow,” was the answer.“What a liar you are!” broke out the other.“If you say you’re going to Cracow, you want me to believe you’re going to Lemberg. But I know that in fact you’re going to Cracow. So why are you lying to me?”(1960: 137-8)", "num_citations": "7\n", "authors": ["915"]}
{"title": "Modernin yksilön harhat ja ympäristötaidekasvatus\n", "abstract": " ENSIMMÄINEN ONGELMA Jotta teollisen sivilisaation niin kutsuttu ylikuluttava luokka (Ulvila & Pasanen, 2010) eläisi yhden maapallon rajoissa, tarvitaan muutos, jota on laadultaan verrattava uskonnolliseen herätykseen. Kulutustottumusten tai tuotantotapojen tehostamiset eivät riitä, vaan muutoksen on kosketettava ihmisenä olemista; sitä, mitä pidetään merkittävänä, itsestään selvänä, tärkeänä ja nautinnollisena. Kuten ilmaus” herätys” kertoo, muutoksen myötä jätetään entiset asiat–usein myös entiset ystävyyssuhteet, jopa sukulaisuudet, kuten Luukkaan evankeliumissa:” Jos joku tulee minun luokseni mutta ei ole valmis luopumaan isästään ja äidistään, vaimostaan ja lapsistaan, veljistään ja sisaristaan, vieläpä omasta elämästään, hän ei voi olla minun opetuslapseni”(14: 26). Toisin sanoen ei tarvita muutosta vain siinä, miten kulutetaan, vaan asenteessa, että kulutetaan. Kulutus merkitysrakenteena on hylättävä. Karkeasti sanottuna näin on, koska teollisen sivilisaation kumppanina esiintyvä liberaali subjekti¹ pyrkii pysyvyyteen, irrallisuuteen muiden vaatimuksista ja valinnanmahdollisuuksiensa lisäämiseen. Subjektin päämäärä on lisätä yksilöllisiä vapauden asteita, joiden ehdoton edellytys on subjektin pysyvyys. Pysyvyyteen keskittyessään subjekti vastustaa kaikkea juuriin menevää uusiutumista. Siksi liberaali subjekti ei välitä esimerkiksi ilmastonmuutosta tai luonnon tuhoa koskevasta valistuksesta, vaikka se oman itseymmärryksenä mukaan toimii” rationaalisesti.” Muutoksen on kuljettava eisubjektiivisia reittejä, asubjektiivisella (Vadén, 2004) eli subjektia edeltävällä tai sen jälkeen tulevalla tasolla. ² Koulumestarimainen valistus ei …", "num_citations": "7\n", "authors": ["915"]}
{"title": "Open source hardware through volunteer community: a case study of eCars--now!\n", "abstract": " The development model of Open Source Software (OSS) has been widely recognized as resilient and productive. Consequently, high hopes have been placed on projects that try to adapt the OSS model into material production, in projects that can be called Open Source Hardware (OSH). While OSS development has received increasing scholarly attention, the research on OSH is still in its early stages. Here, based on a survey done in 2010, we describe the demographic and motivational structure of one OSH community and compare it to OSS communities. The community analysis will be accompanied with a short discussion of what we see as bottlenecks in OSH development, ie, features that may disable some of the beneficial dynamics of OSS development, and consequently merit further study.", "num_citations": "7\n", "authors": ["915"]}
{"title": "Fire next time: or revisioning higher education in the context of digital social creativity\n", "abstract": " This article presents an idea of ‘digital social creativity’ as part of social media and examines an approach emphasising openness and experimentation and collaborative learning in the world of information and communication technologies. Wikipedia and similar digital tools provide both challenges to and possibilities for building learning sites in higher education and other forms of education and socialisation that recognise various forms of information and knowledge creation. The dialogical nature of knowledge and the emphasis on social interaction create a tremendous opportunity for education, but at the same time form new hegemonic battlegrounds in terms of various uses of social media.", "num_citations": "7\n", "authors": ["915"]}
{"title": "A lot of talk, but little action—The blind spots of Nordic environmental security policy\n", "abstract": " Despite an increasing recognition that environmental change may have implications for security, there only are few policies to address the issue. This article will look at environmental security policies in Finland and Sweden and propose ways to develop more effective measures. It relies on a three-level framework that aims to enable the identification of environmental security impacts by categorising them into local, geopolitical and structural ones. The article will examine present environmental security strategies and policies in Finland and Sweden, consider their efficacy for addressing various kinds of impacts and point out approaches that are currently missing. Based on the discussion, it argues that a comprehensive policy approach is needed to tackle environmental security impacts. This requires closer coordination and interchange between sectors as well as strategic intent. In addition, further research is needed on the structural impacts of mitigating and adapting to environmental change. View Full-Text", "num_citations": "6\n", "authors": ["915"]}
{"title": "Governance of economic transition: Invited background document for global sustainable development report 2019\n", "abstract": " Governance of Economic Transition: Invited background document for Global Sustainable Development Report 2019 — University of Helsinki Skip to main navigation Skip to search Skip to main content University of Helsinki Logo Accessibility statement English Svenska Suomi Home Persons Publications Projects Research Infrastructures Research Units Datasets Activities Prizes Press / Media Search by expertise, name or affiliation Governance of Economic Transition: Invited background document for Global Sustainable Development Report 2019 Paavo Järvensivu, Tero Toivanen, Tere Váden, Ville Lähde, Antti Majava, Jussi T. Eronen Political Science Helsinki Institute of Sustainability Science (HELSUS) Ecosystems and Environment Research Programme Faculty of Biological and Environmental Sciences Creative adaptation to wicked socio-environmental disruptions (WISE STN) Research output: Working paper …", "num_citations": "6\n", "authors": ["915"]}
{"title": "Free Software Philosophy and Open Source\n", "abstract": " This article introduces and explains some of the most relevant features of the free software philosophy formulated by Richard M. Stallman in the 1980s. The free software philosophy and the free software movement built on it historically preceded the open source movement by a decade and provided some of the key technological, legal and ideological foundations of the open source movement. Thus, in order to study the ideology of open source and its differences with regard to other modes of software production, it is important to understand the reasoning and the presuppositions included in Stallman’s free software philosophy.", "num_citations": "5\n", "authors": ["915"]}
{"title": "Oportunidades Digitales, Imposibilidades Reales La promesa pendiente de la “Industria Cultural” y el Cibercomunismo\n", "abstract": " Oportunidades Digitales, Imposibilidades Reales La promesa pendiente de la “Industria Cultural” y el Cibercomunismo — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Oportunidades Digitales, Imposibilidades Reales La promesa pendiente de la “Industria Cultural” y el Cibercomunismo Tere Vadén Research output: Contribution to journal › Article › Professional Overview Original language Spanish Pages (from-to) 104-112 Journal Emergencia Volume 2011 Issue number 3 Publication status Published - 2011 Publication type D1 Article in a trade journal Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Vadén, T. (2011). Oportunidades Digitales, …", "num_citations": "5\n", "authors": ["915"]}
{"title": "Tuleva yliopisto\n", "abstract": " \"Emme kirjoita vain tulevien yliopistojen puolesta, vaan toteamme, että uudet yliopistot ovat jo täällä. Tieto ei ole jossakin tuolla tavoittamattomissa, yliopisto ei ole pelkkä ihanne, jota lähestytään.  Jokainen meistä on jo kokonainen ihminen, tietoineen ja taitoineen, ongelmineen ja pulmineen. Jokaisella meistä on ajatuksia, teorioita. Jokainen miestä on jo osa sukua, kylää, kaupunkia, kieltä, kulttuuria. Yliopisto ei ole siellä, missä Suomen laki ja asetus sanovat sen olevan (\"viralliset yliopistot\"), vaan siellä, missä jo tasa-arvoiset ja jo oppivat ihmiset yhdessä toistensa avulla ymmärtävät, tutkivat ja oppivat.  Yliopistovallankumous on jo tapahtunut, uusia yliopistoja putkahtelee kuin sieniä sateella. Tulevien yliopistojen aika on tullut: ei vielä on nyt.\" - Salminen, Suoranta & Vadén, Tuleva yliopisto", "num_citations": "5\n", "authors": ["915"]}
{"title": "What is “Local Thinking”?(Can There Be Finnish Philosophy?)\n", "abstract": " The question of what local philosophy is can be understood in two different ways. I am looking at the case of Finland. On the one hand, Western philosophy has been imported, classical authors have been received, there is a certain local perspective on the tradition, etc. On the other hand, there is thought that contains something unique and unrepeatable. This thought becomes available for analysis only on three conditions:(1) to see language as experience.(2) To understand linguistic experience through its asubjective side as language that is not the useful communication between subjects.(3) To adopt a non-hierarchical mode of conceptualization of experience with no unquestionably prioritized forms of experience. It is necessary to separate open local thinking from closed, semi-chauvinistic variants of Heideggerian being-historical philosophy. These conditions describe a form of thinking that is local in the …", "num_citations": "5\n", "authors": ["915"]}
{"title": "Qualifying qualia through the skyhook test\n", "abstract": " If we are to preserve qualia, one possibility is to take the current academic, philosophical, and theoretical notion less seriously and current natural science and some pre-theoretical intuitions about qualia more seriously. Dennett (1997) is instrumental in showing how ideas of the intrinsicalness and privacy of qualia are misguided and those of ineffability and immediacy misinterpreted. However, by combining ideas of non-mechanicalness used in contemporary natural science with the pre-theoretical idea that qualia are special because they are unique, we get a notion of qualia that is acceptable to naturalistic philosophy. The notion of unique qualia is not opposed to the idea that some of the characterizations of qualia have to be qualified. It is the folk-philosophical, academic, notions of theoreticity and conceptuality that have to be modified.", "num_citations": "5\n", "authors": ["915"]}
{"title": "From Limitivism to Correspondence: The Symbolic-Subsymbolic Relation\n", "abstract": " \"From Limitivism to Correspondence: The Symbolic-Subsymbolic Relation\" — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation \"From Limitivism to Correspondence: The Symbolic-Subsymbolic Relation\" Tere Vadén Research output: Chapter in Book/Report/Conference proceeding › Chapter › Scientific › peer-review Overview Original language Undefined/Unknown Title of host publication Current Trends in Connectionism Editors Lars Niklasson, Mikael Boden Place of Publication New Jersey Publication status Published - 1995 Publication type A3 Part of a book or another research book Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Vadén, T. (1995). \"…", "num_citations": "5\n", "authors": ["915"]}
{"title": "Ekoterveyskasvatuksen luonnos\n", "abstract": " Our article formulates the basic idea of ecological and life-centered health education, eco-health education. Ecological health education is a nature-based solution that, when implemented, includes both the emergence of various nature-based health promotion tools and rethinking the prevailing health philosophy. The starting point for eco-health education is the need for ecological reassessment of health-related thinking and practices in the era of climate change and other eco-crises. This article focuses on identifying existing ways of thinking and scrutinizing their need for change. We analyze the philosophical foundations of current health promotion and related health education and justify the need for eco-health education. As a practical example, we refer to the Finnish Comprehensive School Curriculum in Health Education, whose individualistic and human-centered underpinning we analyze. Our basic assertion is that a framework where people are sharply separated from natural cycles does not produce health or good health education sustainably. Eco-health education is based theoretically on eco-justice education, where humans and other organisms are valuable beings whose well-being is addressed in good education. Only by producing health and well-being for all living beings and their common well-being, ie, ecosystems, we can produce health for ourselves.", "num_citations": "4\n", "authors": ["915"]}
{"title": "Žižek's phenomenology of the subject: transcendental or materialist?\n", "abstract": " Husserlian and Heideggerian phenomenology face severe problems if not dead-ends while trying to formulate a politically active philosophical position. It can be assumed, at least for the sake of the argument, that Žižek's return to Hegel is, in part, an attempt to avoid these problems that are connected to the philosophy of the subject and action, or even, work. Consequently, it may be relevant to see how Žižek's phenomenology of the subject compares to that of Husserl and Heidegger, especially with regard to progressive or revolutionary action, a place where, necessarily, the notions of subjectivity, of being human, and of work, of engaging materially and socially in the world, come together. The emphasis here will be on Žižek's thoughts as they are presented, not on their historical roots or accuracy, for instance, in view of his interpretation of Hegel (not, even, on what that interpretation exactly is). The historical momentum included in a Hegelian phenomenology of the subject is explicit. Furthermore, if we, like Žižek, read Hegel as philosopher of the negativity of subjectivity, there is ample reason to suspect that Husserlian and Heideggerian phenomenology has not been radical enough in its allegedly purely formal (phenomenological) description of subjectivity. Crudely put, the claim could be that while both Husserl and Heidegger stay too close to a particular positive subjectivity (transcendental reason, German Dasein) they miss the truly universal dimension attainable through a dialectic of subjectivity. In Žižek's reading of Hegelian dialectic such universality is, however, necessary for radical political engagement. In this sense, whatever the", "num_citations": "4\n", "authors": ["915"]}
{"title": "Heidegger, Zizek ja vallankumous\n", "abstract": " Heidegger, Zizek ja vallankumous — Aalto University's research portal Skip to main navigation Skip to search Skip to main content Aalto University's research portal Logo Accessibility statement English Suomi Home Profiles Research output Datasets Projects Prizes Activities Press / Media Infrastructure Research Units Impacts Search by expertise, name or affiliation Heidegger, Zizek ja vallankumous Tere Vadén Department of Art Research output: Book/Report › Book › Scientific › peer-review Overview Original language Finnish Place of Publication Helsinki Publisher GAUDEAMUS Publication status Published - 2012 MoE publication type C1 Separate scientific books Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Vadén, T. (2012). Heidegger, Zizek ja vallankumous. GAUDEAMUS. Vadén, Tere. / Heidegger, Zizek ja vallankumous. Helsinki : GAUDEAMUS, 2012. Vadén, T 2012, Heidegger, Zizek ja …", "num_citations": "4\n", "authors": ["915"]}
{"title": "Linkolan ajamana\n", "abstract": " Lukijalle Pentti Linkola on kuuluisa ja hän on vaikuttanut monella tavalla. Nyt ei ole puhe siitä. Kokoelman aiheena on Linkolan ajattelu, mikä ei ole aivan sama asia kuin esimerkiksi Linkolan julkaisemat tekstit tai pitämät puheet. Kyse ei ole myöskään puhtaasti filosofiasta, vaikka filosofia olisikin ajattelun taitoa. Sen sijaan kirjoittajat vastaavat kukin omalla tavallaan Linkolan ajatuksiin–ei yksittäisiin väitteisiin tai provokaatioihin, vaan teemoihin, kysymyksiin ja ratkaisuihin, joita Linkola on vuosikymmeniä kehittänyt. Tarkoitus ei ole sanoa viimeisiä sanoja tai antaa kokonaiskuvaa, vaan lähteä liikkeelle, ottaa osaa Linkolan ajatusten paineeseen. Merkkinä Linkolan ajattelun pitkästä kaaresta kokoelma alkaa hänen omalla esseellään vuodelta 1960,", "num_citations": "4\n", "authors": ["915"]}
{"title": "“Intellectual Property” and Knowledge Creation in Disorganisations\n", "abstract": " Given the current forms of economic production and corporate markets, the liberating and democratic potential of digital information is counteracted by the concentration of media ownership, as well as by policy, legislation, and the development of proprietary forms of technology. The notion of ‘intellectual property’ produces artificial scarcity where digital technology could remove it. This tension between the proprietary and non-proprietary aspects of the information society can be analysed by looking at two types of knowledge creation: organisational and disorganisational. While organisational knowledge work can benefit from a notion of ‘intellectual property’, disorganisational knowledge work is disrupted, if not destroyed, by proprietary barriers on information. This is unfortunate if and when the crucial innovations and ethical potential of the information society are connected to disorganisational communities, even …", "num_citations": "4\n", "authors": ["915"]}
{"title": "Dimensions of conscious experience\n", "abstract": " It is by now commonly agreed that the proper study of consciousness requires a multidisciplinary approach which focuses on the varieties and dimensions of conscious experience from different angles. This book, which is based on a workshop held at the University of Skövde, Sweden, provides a microcosm of the emerging discipline of consciousness studies and focuses on some important but neglected aspects of consciousness. The book brings together philosophy, psychology, cognitive neuroscience, linguistics, cognitive and computer science, biology, physics, art and the new media. It contains critical studies of subjectivity vs objectivity, nonconceptuality vs conceptuality, language, evolutionary aspects, neural correlates, microphysical level, creativity, visual arts and dreams. It is suitable as a text-book for a third-year undergraduate or a graduate seminar on consciousness studies.(Series A)", "num_citations": "4\n", "authors": ["915"]}
{"title": "Arktinen Hekuma Kalervo Palsa Ja Suomalaisen Ajattelun Mahdollisuus\n", "abstract": " Tere Vadâen, Arktinen Hekuma Kalervo Palsa Ja Suomalaisen Ajattelun Mahdollisuus - PhilPapers Sign in | Create an account PhilPapers PhilPeople PhilArchive PhilEvents PhilJobs PhilPapers home Syntax Advanced Search Syntax Advanced Search Syntax Advanced Search Arktinen Hekuma Kalervo Palsa Ja Suomalaisen Ajattelun Mahdollisuus Tere Vadâen (1997) Abstract This article has no associated abstract. (fix it) Keywords Palsa, Kalervo Art Gay artists Categories No categories specified (categorize this paper) Buy this book Find it on Amazon.com ISBN(s) 9517960964 (nid.) Options Edit this record Mark as duplicate Export citation Find it on Scholar Request removal from index Translate to english Revision history Download options PhilArchive copy Upload a copy of this paper Check publisher's policy Papers currently archived: 59,338 External links This entry has no external links. Add one. Setup an …", "num_citations": "4\n", "authors": ["915"]}
{"title": "The symbolic and subsymbolic theories in cognitive science\n", "abstract": " The Symbolic and Subsymbolic Theories in Cognitive Science — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation The Symbolic and Subsymbolic Theories in Cognitive Science Tere Vadén Research output: Book/Report › Doctoral thesis › Monograph Overview Original language English Place of Publication Tampere Edition 1. Publication status Published - 1996 Publication type G4 Doctoral dissertation (monograph) Keywords hermoverkot kognitio mielenfilosofia Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Vadén, T. (1996). The Symbolic and Subsymbolic Theories in Cognitive Science. (1. ed.). Vadén, Tere. / The Symbolic and Subsymbolic …", "num_citations": "4\n", "authors": ["915"]}
{"title": "Arkiymmärrys ja omavaraisuus. Havaintoja yhdestä omavaraistaloutta koskevasta keskustelusta\n", "abstract": " Arkiymmärrys ja omavaraisuus. Havaintoja yhdestä omavaraistaloutta koskevasta keskustelusta — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Arkiymmärrys ja omavaraisuus. Havaintoja yhdestä omavaraistaloutta koskevasta keskustelusta Olli Herranen, Tere Vadén Research output: Contribution to journal › Article › Scientific › peer-review Overview Original language Finnish Pages (from-to) 41-54 Journal Kulttuurintutkimus Volume 34 Issue number 2-3 Publication status Published - 2017 Publication type A1 Journal article-refereed Keywords Antonio Gramsci Arkiymmärrys Common sense Omavaraistalous Omavaraisuus Overton window Overtonin ikkuna Self-…", "num_citations": "3\n", "authors": ["915"]}
{"title": "Talous fossiilikapitalismin jälkeen\n", "abstract": " Talous fossiilikapitalismin jälkeen — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Talous fossiilikapitalismin jälkeen Tere Vadén Research output: Chapter in Book/Report/Conference proceeding › Chapter › General public Overview Original language Finnish Title of host publication Talouden uudet muodot Editors Mikko Jakonen, Tiina Silvasti Place of Publication Helsinki Publication status Published - 2015 Publication type E1 Popularised article, newspaper article Keywords fossiilikapotalismi modernismi resurssit öljy Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Vadén, T. (2015). Talous fossiilikapitalismin jälkeen. In M. Jakonen, & T. Silvasti (…", "num_citations": "3\n", "authors": ["915"]}
{"title": "Energy and the Experience of Modernity\n", "abstract": " Energy and the experience of modernity — Aalto University's research portal Skip to main navigation Skip to search Skip to main content Aalto University's research portal Logo Accessibility statement English Suomi Home Profiles Research output Datasets Projects Prizes Activities Press / Media Infrastructure Research Units Impacts Search by expertise, name or affiliation Energy and the experience of modernity Tere Vadén, Antti Salminen Department of Art Research output: Contribution to journal › Article › Scientific 2 Citations (Scopus) Overview Original language English Journal Suomen antropologi Publication status Published - 2013 MoE publication type B1 Article in a scientific magazine Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Vadén, T., & Salminen, A. (2013). Energy and the experience of modernity. Suomen antropologi. Vadén, Tere ; Salminen, Antti. / Energy and the experience of …", "num_citations": "3\n", "authors": ["915"]}
{"title": "Oil and the Regime of Capitalism\n", "abstract": " \" What if the hegemony of the West was not, after all, defined by modern natural science and technology, enlightenment and individualism but by a one-time offering of coal, gas and oil?\"The anthropological record suggests that, typically, in pre-modern and non-industrialized communities the foundation of meaning is not separate from the world of material income: utility objects are beautiful and beauty is purposeful. Contrary to this, industrial civilization has often been described as a divider of the world of values and tools, means and objectives, which, through calculated reason, extracts everything it can without actually knowing why or for what purpose.", "num_citations": "3\n", "authors": ["915"]}
{"title": "Wikipedia ja filosofit: huomioita wikipedioiden epistemologisesta potentiaalista\n", "abstract": " Wikipedia ja filosofit: huomioita wikipedioiden epistemologisesta potentiaalista — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Wikipedia ja filosofit: huomioita wikipedioiden epistemologisesta potentiaalista Tere Vadén Research output: Contribution to journal › Article › Scientific › peer-review Overview Original language Undefined/Unknown Journal Tieteessä tapahtuu Volume 24 Issue number 7 Publication status Published - 2007 Publication type A1 Journal article-refereed Access to Document http://ojs.tsv.fi/index.php/tt/article/view/319 Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Vadén, T. (2007). Wikipedia ja filosofit: huomioita wikipedioiden …", "num_citations": "3\n", "authors": ["915"]}
{"title": "Kuin kalat verkossa\n", "abstract": " Imago on tunnetusti paitsi kuva myös vaikutelma; tietoyhteiskunnan imago on kuin ihmisen persoona, joka peittää näyttäessään itsensä alastomuudessaan. Eikö imago kuitenkin ole totta, sikäli kuin sillä on syynsä, seurauksensa ja vaikutushistoriansa? Entä jos tietoyhteiskunnan–kuten minkä tahansa muunkin yhteiskuntamuodon–riitauttaminen, sitä koskeva polemos, pitääkin tapahtua juuri kuvan, sen vaikuttavuuden ja liikkuvuuden tasolla? Entä jos tietoyhteiskunnan imago verkostojen logiikkana, informationalismina ja riskiyhteiskuntana on totta, entä jos tämä kuva vastaa Suomen tilannetta Euroopassa ja maailmassa? Imago itse tietysti hymyilee meille vinosti ja sanoo, että ei asioita pidä ottaa niin vakavasti, että totuus on suhteellista, totuutta jollekulle. Kenelle yhteiskunta on tietoyhteiskunta? Riskiyhteiskunta kuuluu tietoyhteiskunnan tavoin niiden” aikalaisdiagnostisten” käsitteiden joukkoon, joilla on pyritty ymmärtämään maailmaa vastaamalla kysymyksiin siitä, keitä me olemme ja millaista aikakautta elämme. 2 Vastaukseksi on tarjottu muun muassa ajatusta", "num_citations": "3\n", "authors": ["915"]}
{"title": "Kokemuksellinen demokratia ja tutkimuksen avoimuus ja kriittisyys\n", "abstract": " Kokemuksellinen demokratia ja tutkimuksen avoimuus ja kriittisyys — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Kokemuksellinen demokratia ja tutkimuksen avoimuus ja kriittisyys Tere Vaden Research output: Chapter in Book/Report/Conference proceeding › Chapter › Professional Overview Original language Finnish Title of host publication Kohtaamisia taiteen ja tutkimuksen maastoissa Editors H. Tervahattu Pages 80-91 Publication status Published - 2003 Publication type D2 Article in professional manuals or guides or professional information systems or text book material Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Vaden, T. (2003). …", "num_citations": "3\n", "authors": ["915"]}
{"title": "Openness, Criticality and Language. Observations on the methodology of practice-based experiental research\n", "abstract": " Openness, Criticality and Language. Observations on the methodology of practice-based experiental research — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Openness, Criticality and Language. Observations on the methodology of practice-based experiental research Tere Vadén Research output: Chapter in Book/Report/Conference proceeding › Chapter › Professional Overview Original language Undefined/Unknown Title of host publication Artistic research Editors Satu Kiljunen, Mika Hannula Place of Publication Helsinki Publication status Published - 2002 Publication type D2 Article in professional manuals or guides or professional information systems or text …", "num_citations": "3\n", "authors": ["915"]}
{"title": "Do dreams work?\n", "abstract": " University of Skéivde cc people are starting to behave as though it was nothing at all, as though nothing had happened, as though taking into account the event of psychoanalysis, a logic of the unconscious, of ‘unconscious concepts’, even, were no longer de rigueur, no longer even had a place in some—thing like the history of reason: as if one could calmly continue the good old discourse of the Enlightenment, return to Kant, call us back to the ethical or juridical or political responsibility of the subject by restoring the authority of consciousness, of the ego, ofthe reﬂexive cogito, ofan ‘I think’without pain or paradox; as if, in this moment of philosophical restoration that is in the air—for what is on the agenda, the agenda’s moral agenda, is a sort of shameful, botched restoration—as if it were a matter of ﬂattening supposed demands of reason into a discourse that is purely communicative, informational, smooth; as though, ﬁnally, it were again legitimate to accuse of obscurity or irrationalism anyone who complicates things a little by wondering about the reason of reason, about the history of the principle of reason or about the event—perhaps a traumatic one—constituted by something like psycho—analysis in reason’s relation to itself.”(Jacques Derrida “Let Us Not Forget—Psychoanalysis.” Oxford Literary Review 12: 4).", "num_citations": "3\n", "authors": ["915"]}
{"title": "Minds as connoting systems: Logic and the language of thought\n", "abstract": " The principal aim of this essay is to discuss some logical features of the so-called Classical model of cognitive architecture as it is advocated by J. Fodor and Z. Pylyshyn in their much discussed article 'Connectionism and Cognitive Architecture: A Critical Analysis'. It is pointed out that their structural assumptions have consequences of a logical kind which call into question the view that the Classical architecture (in their sense) can be employed to model human cognition. It seems that the consequences have escaped Fodor and Pylyshyn's notice, or else they have failed to appreciate them, since some of their claims evidently conflict with them. It is also investigated whether the human mind can be characterized as being logical in some weaker sense of logic. Furthermore, it is argued that J. H. Fetzer's view that it is a semiotic system is more realistic than the Classical model, but the distinction he suggests …", "num_citations": "3\n", "authors": ["915"]}
{"title": "\" Oleminen on tuotantoprosessi\"-Heidegger lukee Marxia\n", "abstract": " \"Oleminen on tuotantoprosessi\" - Heidegger lukee Marxia — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation \"Oleminen on tuotantoprosessi\" - Heidegger lukee Marxia Tere VadÈn Research output: Contribution to journal › Article › Scientific › peer-review Overview Original language Finnish Pages (from-to) 73-78 Journal Niin & N‰in Volume 2014 Issue number 3 Publication status Published - 2014 Publication type A1 Journal article-refereed Publication forum classification Publication forum level 1 Cite this APA Author BIBTEX Harvard Standard RIS Vancouver VadÈn, T. (2014). \"Oleminen on tuotantoprosessi\" - Heidegger lukee Marxia. Niin & N‰in, 2014(3), 73-78. …", "num_citations": "2\n", "authors": ["915"]}
{"title": "Tepidity of the Majority and Participatory Creativity\n", "abstract": " Tere Vadén: It seems to me that the possibilities of participating are real, and that they are having an effect. Just think of something like Wikipedia. For Scandinavians with a good tradition of libraries Wikipedia is easily less impressive than it should be. But this really is the first free encyclopedia. Thousands of people daily contribute to a common epistemological project; this is bound to have effects similar to or on the scale of the “scientific revolution” some centuries back.", "num_citations": "2\n", "authors": ["915"]}
{"title": "EROEI-fantasia eli kysymyksiä tulevaisuuden filosofeille\n", "abstract": " Kalevalaisessa kansanrunoudessa nimellä” synty” kuvataan ihmisjoukon kollektiivista eipropositionaalista tietoa oman elämäntapansa merkitysperustoista. Usein ei-teollisessa elämässä merkitysperusta ei olekaan erillään aineellisen toimeentulon maailmasta: käyttöesineet ovat kauniita ja kauneus on tarkoituksenmukaista. Teollista sivilisaatiota taas on kuvattu arvojen ja välineiden, keinojen ja päämäärien erottelijana, joka laskevalla järjellään ottaa irti kaiken, minkä saa, tietämättä varsinaisesti, miksi tai mitä varten. Kahtiajaossa on itua, mutta vielä häiritsevämpi kuva saadaan, jos teollinenkin sivilisaatio nähdään yhtenäisenä, käyttöesineissään merkitysperustansa paljastavana kulttuurina. Pitkin maapalloa putket kiemurtelevat kohti valtaisia säiliöitä ja verkostoja. Tankkerit ja säiliöautot rahtaavat pistävänhajuista nestettä yhä kauemmas yhä uusiin yhä pienempiin säiliöihin ja tankkeihin, kunnes ohuet putket päätyvät puristuskammioon, jossa kaasuksi pirstoutuvat pisarat räjäytetään uudelleen ja uudelleen. Mitä tämä merkitys-ja aineellisen elämän perusta meistä tietää? Ainakin sen, että jos se on perusta, olemme sille sokeita, ja kahtiajakoteoria on yksi sokeuden muoto.", "num_citations": "2\n", "authors": ["915"]}
{"title": "Internetin avoin Wikiopisto haastaa kansalliset korkeakoulut\n", "abstract": " Internetin avoin Wikiopisto haastaa kansalliset korkeakoulut — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Internetin avoin Wikiopisto haastaa kansalliset korkeakoulut Juha Suoranta, Tere Vadén Research output: Contribution to journal › Article › General public Overview Original language Finnish Journal Helsingin sanomat Publication status Published - 28 Jan 2008 Publication type E1 Popularised article, newspaper article Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Suoranta, J., & Vadén, T. (2008). Internetin avoin Wikiopisto haastaa kansalliset korkeakoulut. Helsingin sanomat. Suoranta, Juha ; Vadén, Tere. / Internetin avoin Wikiopisto …", "num_citations": "2\n", "authors": ["915"]}
{"title": "Etiikan haasteet\n", "abstract": " Etiikan haasteet — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Etiikan haasteet Marika Enwald, Jari Keinänen, Tere Vadén Research output: Book/Report › Book › Professional Overview Original language Undefined/Unknown Place of Publication Jyväskylä Publication status Published - 2007 Publication type D5 Text book, professional manual or guide or a dictionary Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Enwald, M., Keinänen, J., & Vadén, T. (2007). Etiikan haasteet. Enwald, Marika ; Keinänen, Jari ; Vadén, Tere. / Etiikan haasteet. Jyväskylä, 2007. Enwald, M, Keinänen, J & Vadén, T 2007, Etiikan haasteet. Jyväskylä. Etiikan haasteet. / …", "num_citations": "2\n", "authors": ["915"]}
{"title": "Valoa basaarista. Internetin vapaan ja avoimen koodin kollektiivinen kehitystyö\n", "abstract": " Valoa basaarista. Internetin vapaan ja avoimen koodin kollektiivinen kehitystyö — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Valoa basaarista. Internetin vapaan ja avoimen koodin kollektiivinen kehitystyö Niklas Vainio, Tere Vadén Research output: Chapter in Book/Report/Conference proceeding › Chapter › Scientific › peer-review Overview Original language Undefined/Unknown Title of host publication Kollektiivinen asiantuntijuus Editors Jaana Parviainen Place of Publication Tampere Publication status Published - 2006 Publication type A3 Part of a book or another research book Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Vainio, N., & …", "num_citations": "2\n", "authors": ["915"]}
{"title": "Heidegger ja etiikka: Muotoa vai sisältöä\n", "abstract": " Tere Vadén, Heidegger ja etiikka: Muotoa vai sisältöä - PhilPapers Sign in | Create an account PhilPapers PhilPeople PhilArchive PhilEvents PhilJobs PhilPapers home Syntax Advanced Search Syntax Advanced Search Syntax Advanced Search Heidegger ja etiikka: Muotoa vai sisältöä Tere Vadén In Maxence Caron & Jocelyn Benoist (eds.), Heidegger. Cerf (2006) Abstract This article has no associated abstract. (fix it) Keywords No keywords specified (fix it) Categories No categories specified (categorize this paper) Options Edit this record Mark as duplicate Export citation Find it on Scholar Request removal from index Translate to english Revision history Download options PhilArchive copy Upload a copy of this paper Check publisher's policy Papers currently archived: 50,971 External links This entry has no external links. Add one. Setup an account with your affiliations in order to access resources via your …", "num_citations": "2\n", "authors": ["915"]}
{"title": "Free and Open Source Software Strategies for Sustainable Information Society\n", "abstract": " Our research group has been working with contextual, culturally sensitive ICT education, applications and technologies in developing countries for ten years now. Our work is based on a reciprocal development in an international and interdisciplinary network. From this reciprocity, our partners in developing countries gain technological know-how and theoretical understanding of modern technologies, whereas we gain new, practical viewpoints to computing, technology, and education. In this paper we describe the main features of our work, focusing on Tanzania in general, and on four distinct projects in particular. First we discuss some aspects of development, then present our collaboration, and finally analyze the features and outcomes of our projects from an educational point of view.", "num_citations": "2\n", "authors": ["915"]}
{"title": "Luonnot ja jumalat\n", "abstract": " Tere Vadén Luonnot ja jumalat Johdanto Heideggerin Olemisen ja ajan ladattu kieli ja sanontatapa kantavat raskasta painolastia, Page 1 synnyt/origins 1 | 2004 20 Tere Vadén Luonnot ja jumalat Johdanto Heideggerin Olemisen ja ajan ladattu kieli ja sanontatapa kantavat raskasta painolastia, ne vihjailevat ja suggeroivat. On luontevaa ajatella, että Heidegger kirjoittaa näin, koska hän haluaa saada meidät huomaamaan, että varsinainen olemisentapa on jollakin tapaa parempi kuin epävarsinainen. Samalla Heidegger kuitenkin jaksaa muistuttamasta päästyäänkin muistuttaa, että Oleminen ja aika on fenomenologisten rakenteiden ontologinen kuvaus, jolla ei ole mitään normatiivista sisältöä. Silti – eikä varmaan vähiten juuri Heideggerin kielenkäytön vuoksi – monet tulkitsijat ovat löytäneet teoksesta eettisen ohjelman: varsinaisuutta kohti voidaan pyrkiä pitämällä kuolevaisuus mielessä tai pareminkin sanottuna …", "num_citations": "2\n", "authors": ["915"]}
{"title": "Future proactive homes: some design principles\n", "abstract": " In this workshop paper we present some of the challenges for designing and applying proactive technology into a home context. On the basis of our initial research, we have formed five design principles that are offered here as tentative design guidelines, carrying both short-and longterm implications.", "num_citations": "2\n", "authors": ["915"]}
{"title": "Intellectual Property, Open Source and Free Software\n", "abstract": " The concept of\" intellectual property\" has gained a lot of attention recently. Several conflicting trends make it a focal point of controversy. The global trend towards an\" information society\" gives an increasing role to information, knowledge and other immaterial assets in production. Therefore the economy also needs ways of controlling, identifying and using immaterial assets. This happens largely through the concept of intellectual property.", "num_citations": "2\n", "authors": ["915"]}
{"title": "Ymmärtäminen, päättäväisyys, sisu\n", "abstract": " Ymmärtäminen, päättäväisyys, sisu — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Ymmärtäminen, päättäväisyys, sisu Tere Vaden Research output: Chapter in Book/Report/Conference proceeding › Chapter › Scientific › peer-review Overview Original language Undefined/Unknown Title of host publication Katseen tarkentaminen. Kirjoituksia Martin Heideggerin Olemisesta ja ajasta Editors Leena Kakkori Pages 157-166 Publication status Published - 2003 Publication type A3 Part of a book or another research book Keywords heidegger ymmärtäminen Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Vaden, T. (2003). Ymmärtäminen, päättäväisyys, …", "num_citations": "2\n", "authors": ["915"]}
{"title": "Volter Kilpi ja kielen paikallisuus\n", "abstract": " Volter Kilpi ja kielen paikallisuus — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Volter Kilpi ja kielen paikallisuus Tere Vaden Research output: Contribution to journal › Article › Scientific › peer-review Overview Original language Undefined/Unknown Pages (from-to) 48-65 Journal SYNTEESI Volume 2003 Issue number 4 Publication status Published - 2003 Publication type A1 Journal article-refereed Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Vaden, T. (2003). Volter Kilpi ja kielen paikallisuus. SYNTEESI, 2003(4), 48-65. Vaden, Tere. / Volter Kilpi ja kielen paikallisuus. In: SYNTEESI. 2003 ; Vol. 2003, No. 4. pp. 48-65. Vaden, T 2003, 'Volter …", "num_citations": "2\n", "authors": ["915"]}
{"title": "Dimensions of Conscious Experience\n", "abstract": " Dimensions of Conscious Experience — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Dimensions of Conscious Experience Tere Vadén, Paavo Pylkkänen Research output: Book/Report › Anthology › Scientific › peer-review Overview Original language English Place of Publication Amsterdam Edition 1 Publication status Published - 2001 Publication type C2 Edited books Publication series Name Advances in Consiousness Research No. 37 Keywords tajunta tietoisuus Access to Document http://www.benjamins.nl/cgi-bin/t_bookview.cgi?bookid=AICR_37 Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Vadén, T., & Pylkkänen, P. (2001). Dimensions …", "num_citations": "2\n", "authors": ["915"]}
{"title": "Conceptual modelling as theory construction: Some implications for the metalevel treatment\n", "abstract": " \"Conceptual Modelling as Theory Construction: Some Implications for the Metalevel Treatment\" — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation \"Conceptual Modelling as Theory Construction: Some Implications for the Metalevel Treatment\" Tere Vadén Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific › peer-review Overview Original language Undefined/Unknown Title of host publication Unknown Editors Hannu Jaakkola, Kangassalo Hannu Place of Publication Amsterdam Publisher IOS Press Publication status Published - 1994 Publication type A4 Article in a conference publication Publication series Name …", "num_citations": "2\n", "authors": ["915"]}
{"title": "Counterfactual Reduction and the Symbolic-Subsymbolic Relation\n", "abstract": " T. Vadén, Counterfactual Reduction and the Symbolic-Subsymbolic Relation - PhilPapers Sign in | Create an account PhilPapers PhilPeople PhilArchive PhilEvents PhilJobs PhilPapers home Syntax Advanced Search Syntax Advanced Search Syntax Advanced Search Counterfactual Reduction and the Symbolic-Subsymbolic Relation T. Vadén In Christopher Hookway (ed.), Philosophy and the Cognitive Sciences. Cambridge University Press (1993) Abstract This article has no associated abstract. (fix it) Keywords No keywords specified (fix it) Categories Reduction in Cognitive Science in Philosophy of Cognitive Science (categorize this paper) Buy the book Find it on Amazon.com Options Edit this record Mark as duplicate Export citation Find it on Scholar Request removal from index Revision history Download options PhilArchive copy Upload a copy of this paper Check publisher's policy Papers currently archived: …", "num_citations": "2\n", "authors": ["915"]}
{"title": "Ilmastokriisiin sopeutuminen on kansanterveydellinen kysymys\n", "abstract": " On arvioitu, että fossiilisten polttoaineiden käytön maailmanlaajuinen lopettaminen ja puh taamman kotitalousenergian saaminen käyttöön köyhemmillä alueilla voisi estää vuositasolla yli 5 miljoonaa kuolintapausta (5). Vuoden 2018 Lancet Countdown on Climate and Health ra portti muistuttaa myös, että ilman voimakkaita päästövähennyksiä sopeutumistoimilla on tek nologiset ja taloudelliset rajansa (3). Nähdäksemme keskustelussa on kuitenkin merkittävä puute. Siirtyminen ensin hiilineutraa leihin ja sitten hiilinegatiivisiin yhteiskuntiin on historiallisesti ainutlaatuinen muutosvaatimus, ja siirtymän systeemisiä kansanterveydellisiä vai kutuksia olisi pohdittava huomattavasti enem män. Tietoa ympäristömuutosten suorista vaiku tuksista sekä vahingollisen sopeutumisen haitois ta ja onnistuneen sopeutumisen lisähyödyistä on kertynyt, mutta nämä olisi suhteutettava siihen, miten perusteellisesti yhteiskunnan on muutut tava.", "num_citations": "1\n", "authors": ["915"]}
{"title": "Musical meaning in between: Ineffability, atmosphere and asubjectivity in musical experience\n", "abstract": " Music in general, and pieces of music in particular, obviously mean a lot to humans as individuals and groups. The modes of musical signification are elusive and shifting, and their linguistic description is unavoidably metaphorical and vague. There are various ways of explaining what the ineffability of musical meaning is all about. There have been many efforts towards fixing the meaning of music and musical structures or motifs. Different contexts and instrumentations of musical figures have remarkably different effects, depending also on the listener and the form of musical culture. Fixed musical meanings as well as fixed subjectivity are, in this regard, like snapshots of this phenomenologically more fundamental level of experience. The notion of atmosphere has interesting consequences for the study of musical meaning. To recap, musical meaning has roots in an experience of atmospheric “in-between” of …", "num_citations": "1\n", "authors": ["915"]}
{"title": "Wikilearning\n", "abstract": " Wikilearning — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Wikilearning Juha Suoranta, Tere Vadén Research output: Chapter in Book/Report/Conference proceeding › Chapter › Scientific › peer-review Overview Original language English Title of host publication Encyclopedia of Educational Philosophy and Theory Editors Michael Peters Place of Publication Singapore Publisher Springer Pages 1-6 ISBN (Print) 978-981-287-532-7 DOIs https://doi.org/10.1007/978-981-287-532-7_123-1 Publication status Published - 2015 Publication type A3 Part of a book or another research book Keywords Wikilearning collaborative learning networked learning verkosto-…", "num_citations": "1\n", "authors": ["915"]}
{"title": "Haamusärkyä. Huomioita viime vuosisadan luontosuhteen heikkouksista\n", "abstract": " Haamusärkyä. Huomioita viime vuosisadan luontosuhteen heikkouksista — Aalto University's research portal Skip to main navigation Skip to search Skip to main content Aalto University's research portal Logo Accessibility statement English Suomi Home Profiles Research output Datasets Projects Prizes Activities Press / Media Infrastructure Research Units Impacts Search by expertise, name or affiliation Haamusärkyä. Huomioita viime vuosisadan luontosuhteen heikkouksista Tere Vadén, Pasi Takkinen Department of Art Research output: Contribution to journal › Article › General public Overview Original language Finnish Journal Elonkehä Issue number 4 Publication status Published - 2013 MoE publication type E1 Popularised article, newspaper article Keywords Heikki Turunen Helmi Kellokumpu Immi Hellén metsä Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Vadén, T., & Takkinen, P. (2013). …", "num_citations": "1\n", "authors": ["915"]}
{"title": "Notes on an Anarchist Theory of Language: Or, A Sympathetic Critique of Zerzan’s Primitivist Refusal of Symbolic Language\n", "abstract": " The anarcho-primitivist refusal of symbolic language is typically presented in writing or in speech. This obvious paradox can be alleviated by adopting a notion of language that is both more naturalistic and more phenomenological than the one included in the primitivist critique. From the primitivist point of view, a positive consequence is the possibility of a non-hierarchical theory of experience and language, one in which the cut between the two is erased. At the same time, this asubjective theory of experience and language means that the critique of technology and civilisation can not be based on the notions of subjectivity and individuality; a consequence that does not sit well with all of the tenets of anarcho-primitivist thought.", "num_citations": "1\n", "authors": ["915"]}
{"title": "The Anatomy of Sustainable Open Source Community Building The Cultural Point of View\n", "abstract": " Open source software (OSS) communities are too various to permit a one-size-fits-all solution to sustainability and successful development. In particular, the hacker ethic of volunteer communities and the salary-based work ethic of company-driven communities do not mix easily, and have very different conditions of sustainability. Based on earlier work on OSS community typology, we characterize three new cases of community (Wringer, IT Mill Toolkit, NoTA). These three communities are just being launched, and the typology suggests some possible bottlenecks of socio-cultural sustainability that the building communities may face.", "num_citations": "1\n", "authors": ["915"]}
{"title": "Social media and levels of freedom\n", "abstract": " Social media and levels of freedom — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Social media and levels of freedom T Vadén, J Suoranta Research output: Contribution to journal › Article › General public Overview Original language English Journal re-public Publication status Published - 2008 Publication type E1 Popularised article, newspaper article Keywords capitalism open access open infrastuctures plato social web Access to Document http://www.re-public.gr/en/?p=290#more-290 Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Vadén, T., & Suoranta, J. (2008). Social media and levels of freedom. re-public. http://www.re-public.gr/en/?p=…", "num_citations": "1\n", "authors": ["915"]}
{"title": "Notes on Language in Zerzan’s Primitivism\n", "abstract": " In Fragments of an Anarchist Anthropology the self-proclaimed anarchist anthropologist David Graeber (2004, 15) credits author and poet Robert Graves with the (most recent)“invention” of two major intellectual traditions: the idea of a Great Goddess (Mother Earth, Gaia) and a rejection of industrial civilisation. Graeber goes on to say that while Pagans have taken up the first idea, a group of Primitivists with John Zerzan as the most famous proponent, have taken the rejection of civilisation and hope of its collapse even further by suggesting that the adoption of agriculture was a Big Mistake. 1 Graeber is very symphatetic to, indeed adamant on one tenet of “Primitivist” theory: there have been and still are societies (people's, groups) that display very little of the hierarchical and violent tenets that are still often seen as somehow necessary or natural parts of living with other humans. This is something that the anthropological record is clear on, and while Graeber relies also on contemporary work (partly his own) on contemporary societies, the locus classicus of Primitivism, Zerzan's essay “Future Primitive”(1994), credits the seminal work of anthropologists like Marshall Sahlin and Richard Lee.Graeber and Zerzan insist that past and present non-western traditional or non-industrialised societies display a richer and more full realisation of human potential than the Western enlightened societies. They agree that anarchist societies are not only possible or desirable, but exist even now as pockets inside a huge unified wasteland of more or less hierarchical and non-egalitarian societies. In the era of a quickly and mercilessly spreading global mass culture …", "num_citations": "1\n", "authors": ["915"]}
{"title": "Wikipedia–monta näkökulmaa avoimeen tietosanakirjaan\n", "abstract": " TIETEESSÄ TAPAHTUU 7/2007 mukaansa Wikipedian kaltaisella yhteisöpalvelulla on huomattavia etuja yksittäisen ihmisen tuottamaan tietoon nähden. Seuraavana on WSOY: n tietosanakirjojen päätoimittajan Juha Honkalan kriittinen puheenvuoro, jossa hän vertaa Wikipediaa kaupallisiin tietosanakirjoihin. Honkala näkee Wikipedian enemmänkin täydentämässä kaupallisia tietosanakirjoja kuin korvaamassa niitä kokonaan. Teemu Mikkonen avaa Wikipediaan toisenlaisen kriittisen näkökulman artikkelissa, jossa hän käsittelee sensuurin mahdollisuuksia ja sen eri muotoja Wikipediassa. Mikkonen päättelee, että Wikipediakaan ei ole niin” vapaa” kuin jotkut sen puolestapuhujat antavat ymmärtää–jokaisen artikkelin laadinta sisältää joukon valintoja ja poissulkemisia. Viimeisessä artikkelissa Mikko Välimäki tarkastelee Wikipediaa esimerkkinä yhteisöpalvelusta, jota tekijänoikeuslaki rajoittaa. Hän esittää joukon oikeuspoliittisia haasteita käyttäjälähtöisten palvelujen kehittämiseksi. Wikipediaan voidaan tutkimuskohteena soveltaa hyvin erilaisia näkökulmia. Tässä artikkelikokoelmassa on avattu niistä vain osaa. Muita näkökulmia voivat olla esimerkiksi:", "num_citations": "1\n", "authors": ["915"]}
{"title": "Tiedon tuottaminen postmodernissa yhteiskunnassa: vapaa ja omistettu malli\n", "abstract": " Tiedon tuottaminen postmodernissa yhteiskunnassa: vapaa ja omistettu malli — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Tiedon tuottaminen postmodernissa yhteiskunnassa: vapaa ja omistettu malli Tere Vadén Research output: Chapter in Book/Report/Conference proceeding › Chapter › Scientific › peer-review Overview Original language Undefined/Unknown Title of host publication Tekemisen vapaus Editors Tuomas Mylly, Juha Lavapuro, Marko Karo Place of Publication Helsinki Publication status Published - 2007 Publication type A3 Part of a book or another research book Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Vadén, T. (2007). …", "num_citations": "1\n", "authors": ["915"]}
{"title": "Sociology of Free and Open Source Software Communities: Motivations and Structures\n", "abstract": " In this paper, we use the concept free software to refer to the programmers' social movement started by Richard M. Stallman around 1984 with his GNU project and the Free Software Foundation. The free software movement was based on an ethical principle according to which restrictions on software use, modification and redistribution are not acceptable because of the asocial implications they have for “the spirit of co-operation in society”. The free software movement was the basis for the software development model called open source (since 1998). The open source movement was formed around the observation that the distributed development model used in the Linux kernel project was more effective than the model of closed-source development. While for the free software movement the freedom of software is a social and ethical imperative, for open source it is a requisite for effective software development process.(Stallman 2002; Raymond 1999; DiBona et al. 1999.)Both of these movements still exist. As communities and movements they overlap. Several communities, such as the Debian project, subscribe to the ideals of free software movement and are guided strongly by the argument of software freedom. Several others, such as the Eclipse project, are based on the open source idea that co-operation between different actors and companies produces high-quality code with less investment. The combined movement of both free software and open source actors is called FOSS (free/open source software).", "num_citations": "1\n", "authors": ["915"]}
{"title": "Open Source Communities: A Mix of New, Old and Very Old Characteristics\n", "abstract": " Free/Open Source software development has initiated new models and theories of social organization and immaterial labor in terms of a\" hacker\" culture. However, our survey of four developer communities shows that there is a continuum of communities from voluntary communities, corresponding to the\" hacker\" image, to more business-oriented communities deviating from the image. It is particularly noteworthy that old and familiar modes of organization based on waged labor are increasingly a part of developer communities. This may create new dynamics and tensions both inside communities and between the various partners taking part in Free/Open Source software development projects.“For everyone without exception God's Providence has prepared a calling, which he should profess and in which he should labor. And this calling is not, as it was for the Lutheran, a fate to which he must submit and which he must make the best of, but God's commandment to the individual to work for the divine glory..”--Max Weber [1]", "num_citations": "1\n", "authors": ["915"]}
{"title": "Teknologiset intressit ja omaehtoiset käyttötavat. Huomioita hakkerietiikasta ja omistajuudesta\n", "abstract": " Teknologiset intressit ja omaehtoiset käyttötavat. Huomioita hakkerietiikasta ja omistajuudesta — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Teknologiset intressit ja omaehtoiset käyttötavat. Huomioita hakkerietiikasta ja omistajuudesta Tere Vaden Research output: Chapter in Book/Report/Conference proceeding › Chapter › Professional Overview Original language Finnish Title of host publication MarxIT. Informaatiokapitalismin kriittistä tarkastelua Editors J. Heiskanen, J. Mäntylä Pages 87-102 Publication status Published - 2003 Publication type D2 Article in professional manuals or guides or professional information systems or text book material Keywords …", "num_citations": "1\n", "authors": ["915"]}
{"title": "Itsenäisyys ja vapaus kokemuksina\n", "abstract": " Itsenäisyys ja vapaus kokemuksina — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Itsenäisyys ja vapaus kokemuksina Tere Vadén Research output: Chapter in Book/Report/Conference proceeding › Conference contribution › Scientific Overview Original language Undefined/Unknown Title of host publication Henkinen itsenäisyys Editors Mikko Lahtinen Place of Publication Tampere Publication status Published - 2002 Publication type B3 Non-refereed article in conference proceedings Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Vadén, T. (2002). Itsenäisyys ja vapaus kokemuksina. In M. Lahtinen (Ed.), Henkinen itsenäisyys Vadén, Tere. / …", "num_citations": "1\n", "authors": ["915"]}
{"title": "Unityö ja subjekti\n", "abstract": " \"Unityö ja subjekti\" — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation \"Unityö ja subjekti\" Tere Vadén Research output: Contribution to journal › Article › Scientific › peer-review Overview Original language Undefined/Unknown Journal niin & näin Issue number 4 Publication status Published - 2000 Publication type A1 Journal article-refereed Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Vadén, T. (2000). \"Unityö ja subjekti\". niin & näin, (4). Vadén, Tere. / \"Unityö ja subjekti\". In: niin & näin. 2000 ; No. 4. Vadén, T 2000, '\"Unityö ja subjekti\"', niin & näin, no. 4. \"Unityö ja subjekti\". / Vadén, Tere. In: niin & näin, No. 4, 2000. Research output: Contribution to …", "num_citations": "1\n", "authors": ["915"]}
{"title": "Tekoälyn järkikäsityksestä\n", "abstract": " \"Tekoälyn järkikäsityksestä\" — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation \"Tekoälyn järkikäsityksestä\" Tere Vadén Research output: Chapter in Book/Report/Conference proceeding › Chapter › Professional Overview Original language Undefined/Unknown Title of host publication Järki Editors I. Niiniluoto, I. Halonen Place of Publication Helsinki Publisher Yliopistopaino Publication status Published - 1997 Publication type D2 Article in professional manuals or guides or professional information systems or text book material Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Vadén, T. (1997). \"Tekoälyn järkikäsityksestä\". In I. Niiniluoto, & I. Halonen (Eds…", "num_citations": "1\n", "authors": ["915"]}
{"title": "Connectionist Paradoxes?\n", "abstract": " \"Connectionist Paradoxes?\" — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation \"Connectionist Paradoxes?\" Tere Vadén Research output: Chapter in Book/Report/Conference proceeding › Chapter › Scientific › peer-review Overview Original language Undefined/Unknown Title of host publication Unknown Editors L. Haaparanta, S. Heinämaa Place of Publication Helsinki Publication status Published - 1996 Publication type A3 Part of a book or another research book Publication series Name Acta Philosophica Fennica Number LVIII Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Vadén, T. (1996). \"Connectionist Paradoxes?\". In L. Haaparanta, & S. …", "num_citations": "1\n", "authors": ["915"]}
{"title": "Subsymbolic connectionism: representational vehicles and contents\n", "abstract": " Subsymbolic connectionism | selected papers from the Swedish conference on Connectionism in a broad perspective ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleProceedingsselected papers from the Swedish conference on Connectionism in a broad perspectiveSubsymbolic connectionism: representational vehicles and contents Article Subsymbolic connectionism: representational vehicles and contents Share on Author: Tere Vadén View Profile Authors Info & Affiliations selected papers from the Swedish conference on Connectionism in a broad perspectiveJuly 1994 Pages 43–47 Published:01 July 1994 0citation 0 Downloads …", "num_citations": "1\n", "authors": ["915"]}
{"title": "Malli Metodi Merkitys. Esseitä Veikko Rantalan 60-vuotispäivän kunniaksi\n", "abstract": " Malli Metodi Merkitys.Esseitä Veikko Rantalan 60-vuotispäivän kunniaksi — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Malli Metodi Merkitys.Esseitä Veikko Rantalan 60-vuotispäivän kunniaksi Leila Haaparanta, Ismo Koskinen, Erna Oesch, Tere Vadén Research output: Book/Report › Anthology › Scientific › peer-review Overview Original language Undefined/Unknown Publication status Published - 1993 Publication type C2 Edited books Publication series Name Filosofisia tutkimuksia Tampereen yliopistosta No. 49 ISSN (Print) 0786-647X Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Haaparanta, L., Koskinen, I., Oesch, E., & Vadén, T. (1993). …", "num_citations": "1\n", "authors": ["915"]}
{"title": "Alisymbolinen konnektionismi\n", "abstract": " Alisymbolinen konnektionismi — Tampere University Research Portal Skip to main navigation Skip to search Skip to main content Tampere University Research Portal Help & FAQ English Suomi Home Profiles Research Units Research output Datasets Activities Prizes Press / Media Equipment Search by expertise, name or affiliation Alisymbolinen konnektionismi Tere Vadén Research output: Book/Report › Book › Scientific › peer-review Overview Original language Undefined/Unknown Place of Publication Tampere Edition 1. Publication status Published - 1992 Externally published Yes Publication type C1 Separate scientific books Keywords kognitio mielenfilosofia Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Vadén, T. (1992). Alisymbolinen konnektionismi. (1. ed.). Vadén, Tere. / Alisymbolinen konnektionismi. 1. ed. Tampere, 1992. Vadén, T 1992, Alisymbolinen konnektionismi. 1. edn, Tampere. …", "num_citations": "1\n", "authors": ["915"]}