{"title": "Software Accessibility for Visually Impaired People: a systematic mapping study\n", "abstract": " Software accessibility evaluation for visually impaired people is strongly restricted to the Web platform. Many tools are able to automatically evaluate the accessibility degree of a website according to given Web accessibility guidelines. However, these guidelines are not sufficient to objectively evaluate the accessibility of any software product, including desktop and mobile platforms. On the other hand, the ISO/IEC 25000 standards, which provide a conceptual framework for quality specification and evaluation of software products, proposes measures that while providing some guidance on how to observe and measure aspects related to accessibility are relatively abstract. In this context, this work presents a systematic mapping study that tried to identify in the technical literature the attributes and measures of software accessibility for visually impaired people, take into account that visual impairment is the most …", "num_citations": "6\n", "authors": ["1310"]}
{"title": "ArdWeather: Uma estação meteorológica baseada no Arduino e em Web Services RESTful\n", "abstract": " Weather stations are equipment used for weather and climate characterization. Areas such as Agriculture and Civil Defense require daily climate information more specific than those provided by TV programs. However, professional weather stations usually have high cost and complexity of operation, which restricts its use. This paper presents the ArdWeather, an integrated hardware and software system composed by a low cost weather station and a web application. The station uses an Arduino board equipped with sensors to measure the temperature, relative humidity, barometric pressure, wind speed, luminance and rain precipitation. The web application can display the data measured, send alerts via Twitter and manage similar weather stations. The features of the application were developed like RESTful Web Services, enabling other applications to integrate to the system.", "num_citations": "3\n", "authors": ["1310"]}
{"title": "Uma Abordagem Baseada em Especificação para Testes Web Services RESTful\n", "abstract": " This paper presents an approach for RESTful Web Services test case generation. RESTful Web Services have features that are not fully covered by traditional software testing techniques. The proposed approach uses model transformation techniques to generate platform independent test cases from UML class models enriched with Object Constraint Language (OCL) constraints. These test cases are then transformed into platform specific test cases that can be used to verify the implementation of CRUD RESTful Web Services.Resumo. Este trabalho apresenta uma abordagem para geração de casos de teste para Web Services RESTful. Web Services RESTful possuem características que não são cobertas pelas técnicas tradicionais de teste de software. A abordagem proposta utiliza técnicas de transformação de modelos para gerar casos de teste independentes de plataforma a partir de modelos de classes UML enriquecidos com restrições Object Constraint Language (OCL). Tais casos de teste são, então, transformados em casos de teste específicos de plataforma que podem ser usados para verificar a implementação de Web Services RESTful do tipo CRUD.", "num_citations": "3\n", "authors": ["1310"]}
{"title": "Rational Unified Process: uma abordagem gerencial\n", "abstract": " O Rational Unified Process–RUP é um processo de engenharia de software criado a princípio pela Rational Software Corporation, portanto um método de desenvolvimento de software proprietário, que dita técnicas a serem obedecidas por cada membro de uma equipe de desenvolvimento vislumbrando o aumento da produtividade (KRUCHTEN, 2001).", "num_citations": "3\n", "authors": ["1310"]}
{"title": "Defining RESTful Web Services Test Cases from UML Models\n", "abstract": " Services test case generation. RESTful Web Services have features that are not fully covered by traditional software testing techniques. The proposed approach uses model transformation techniques to generate platform independent test cases from UML class models enriched with Object Constraint Language (OCL) constraints. These test cases are then transformed into platform specific test cases that can be used to verify the implementation of CRUD RESTful Web Services.", "num_citations": "2\n", "authors": ["1310"]}
{"title": "BOTCH4: Um robô remotamente controlado para detecção de gás metano em aterros sanitários\n", "abstract": " Generally, the methane leak detection in landfills is performed manually. Although nontoxic, methane is a flammable gas, which can become highly dangerous for humans. In this paper, we introduce BotCH4, an integrated hardware and software system that aims to automatize methane emission monitoring in landfills and biogas production sites. BotCH4 consists of a robot and an Android application. The robot comprises, among other equipment, an Arduino board, a gas sensor and GSM and Bluetooth modules. Through Android application one can remotely control the robot's movements and measure the methane concentration in certain spots. The result in parts per million (ppm) is sent by SMS. The robot also has line followers sensors making it capable of operating in automatic mode, following a predetermined circuit.", "num_citations": "1\n", "authors": ["1310"]}