{"title": "ObsPy: a bridge for seismology into the scientific Python ecosystem\n", "abstract": " The Python libraries NumPy and SciPy are extremely powerful tools for numerical processing and analysis well suited to a large variety of applications. We developed ObsPy (http://obspy. org), a Python library for seismology intended to facilitate the development of seismological software packages and workflows, to utilize these abilities and provide a bridge for seismology into the larger scientific Python ecosystem. Scientists in many domains who wish to convert their existing tools and applications to take advantage of a platform like the one Python provides are confronted with several hurdles such as special file formats, unknown terminology, and no suitable replacement for a non-trivial piece of software. We present an approach to implement a domain-specific time series library on top of the scientific NumPy stack. In so doing, we show a realization of an abstract internal representation of time series data …", "num_citations": "379\n", "authors": ["922"]}
{"title": "Global quieting of high-frequency seismic noise due to COVID-19 pandemic lockdown measures\n", "abstract": " Human activity causes vibrations that propagate into the ground as high-frequency seismic waves. Measures to mitigate the coronavirus disease 2019 (COVID-19) pandemic caused widespread changes in human activity, leading to a months-long reduction in seismic noise of up to 50%. The 2020 seismic noise quiet period is the longest and most prominent global anthropogenic seismic noise reduction on record. Although the reduction is strongest at surface seismometers in populated areas, this seismic quiescence extends for many kilometers radially and hundreds of meters in depth. This quiet period provides an opportunity to detect subtle signals from subsurface seismic sources that would have been concealed in noisier times and to benchmark sources of anthropogenic noise. A strong correlation between seismic noise and independent measurements of human mobility suggests that seismology provides an …", "num_citations": "146\n", "authors": ["922"]}
{"title": "MSNoise, a Python Package for Monitoring Seismic Velocity Changes Using Ambient Seismic Noise\n", "abstract": " The usage of seismic ambient noise has recently proved its efficiency in different contexts, from imaging to monitoring. The impulse response (or Green’s function [GF]) between two sensors can be reconstructed from the correlation of seismic noise recorded (Campillo and Paul, 2003). This method has provided excellent results in imaging the Earth’s interior, from global to regional or local scales. More recently, the method was extended to study time-dependent variations in those GF. A change in the delay times might originate from a change in the medium velocity or from a dramatic change in the position of the source or of one/many scatterers. Several studies using seismic ambient noise have shown that small perturbations within a volcanic edifice can be detected as changes in seismic-wave properties (Sens-Schönfelder and Wegler, 2006; Brenguier, Shapiro, et al., 2008; Duputel et al., 2009; Mordret et al …", "num_citations": "138\n", "authors": ["922"]}
{"title": "Monitoring ground water storage at mesoscale using seismic noise: 30 years of continuous observation and thermo-elastic and hydrological modeling\n", "abstract": " Groundwater is a vital freshwater resource for both humans and ecosystems. Achieving sustainable management requires a detailed knowledge of the aquifer structure and of its behavior in response to climatic and anthropogenic forcing. Traditional monitoring is carried out using piezometer networks, and recently complemented with new geophysical or satellite-based observations. These techniques survey either local (small-scale) water systems or regional areas (large scale) but, to date, adequate observation tools are lacking at the water management scale (ie several tens of kms), which is generally explored by modeling. Using 30 years of continuous recording by four seismic stations of the Gräfenberg Array (Germany), we demonstrate that long-term observations of velocity variations (approximately 0.01%) of surface waves can be extracted from such recordings of ocean-generated seismic noise. These …", "num_citations": "64\n", "authors": ["922"]}
{"title": "Space-and ground-based measurements of sulphur dioxide emissions from Turrialba Volcano (Costa Rica)\n", "abstract": " Remotely sensed measurements of sulphur dioxide (SO2) emitted by Turrialba Volcano (Costa Rica) are reported for the period September 2009–January 2011. These measurements were obtained using images from Advanced Spaceborne Thermal Emission and Reflexion radiometer, Ozone Monitoring Instrument and a ground-based UV camera. These three very different instruments provide flux measurements in good agreement with each other, which demonstrate that they can be integrated for monitoring SO2 fluxes. Fluxes from Turrialba increased fourfold in January 2010, following a phreatic explosion that formed a degassing vent in the W crater of Turrialba. Since then, the SO2 flux has remained high (30–50 kg/s) but seems to be showing a slowly decreasing trend. We interpret this evolution as the start of open vent degassing from a recently intruded magma body. The opening of the degassing …", "num_citations": "63\n", "authors": ["922"]}
{"title": "Train traffic as a powerful noise source for monitoring active faults with seismic interferometry\n", "abstract": " Laboratory experiments report that detectable seismic velocity changes should occur in the vicinity of fault zones prior to earthquakes. However, operating permanent active seismic sources to monitor natural faults at seismogenic depth is found to be nearly impossible to achieve. We show that seismic noise generated by vehicle traffic, and especially heavy freight trains, can be turned into a powerful repetitive seismic source to continuously probe the Earth's crust at a few kilometers depth. Results of an exploratory seismic experiment in Southern California demonstrate that correlations of train‐generated seismic signals allow daily reconstruction of direct P body waves probing the San Jacinto Fault down to 4‐km depth. This new approach may facilitate monitoring most of the San Andreas Fault system using the railway and highway network of California.", "num_citations": "43\n", "authors": ["922"]}
{"title": "4-D noise-based seismology at volcanoes: Ongoing efforts and perspectives\n", "abstract": " Monitoring magma pressure buildup at depth and transport to surface is a key point for improving volcanic eruption prediction. Seismic waves, through their velocity dependence to stress perturbations, can provide crucial information on the temporal evolution of the mechanical properties of volcanic edifices. In this article, we review past and ongoing efforts for extracting accurate information of temporal changes of seismic velocities at volcanoes continuously in time using records of ambient seismic noise. We will first introduce the general methodology for retrieving accurate seismic velocity changes from seismic noise records and discuss the origin of seismic velocity temporal changes in rocks. We will then discuss in a second part how noise-based monitoring can improve our knowledge about magmatic activity at a long (years) to a short (days) time scale taking example from Piton de la Fournaise volcano (La …", "num_citations": "42\n", "authors": ["922"]}
{"title": "City‐scale dark fiber DAS measurements of infrastructure use during the COVID‐19 pandemic\n", "abstract": " Throughout the recent COVID‐19 pandemic, real‐time measurements about shifting use of roads, hospitals, grocery stores, and other public infrastructure became vital for government decision makers. Mobile phone locations are increasingly assimilated for this purpose, but an alternative, unexplored, natively anonymous, absolute method would be to use geophysical sensing to directly measure public infrastructure usage. In this paper, we demonstrate how fiber‐optic distributed acoustic sensing (DAS) connected to a telecommunication cable beneath Palo Alto, CA, successfully monitored traffic over a 2‐month period, including major reductions associated with COVID‐19 response. Continuous DAS recordings of over 450,000 individual vehicles were analyzed using an automatic template‐matching detection algorithm based on roadbed strain. In one commuter sector, we found a 50% decrease in vehicles …", "num_citations": "41\n", "authors": ["922"]}
{"title": "Repeated absolute gravity measurements for monitoring slow intraplate vertical deformation in western Europe\n", "abstract": " In continental plate interiors, ground surface movements are at the limit of the noise level and close to or below the accuracy of current geodetic techniques. Absolute gravity measurements are valuable to quantify slow vertical movements, as this instrument is drift free and, unlike GPS, independent of the terrestrial reference frame. Repeated absolute gravity (AG) measurements have been performed in Oostende (Belgian coastline) and at eight stations along a southwest‐northeast profile across the Belgian Ardennes and the Roer Valley Graben (Germany), in order to estimate the tectonic deformation in the area. The AG measurements, repeated once or twice a year, can resolve elusive gravity changes with a precision better than 3.7 nm/s2/yr (95% confidence interval) after 11 years, even in difficult conditions. After 8–15 years (depending on the station), we find that the gravity rates of change lie in the [−3.1, 8.1] nm …", "num_citations": "39\n", "authors": ["922"]}
{"title": "Toward 4D Noise-Based Seismic Probing of Volcanoes: Perspectives from a Large-N Experiment on Piton de la Fournaise Volcano\n", "abstract": " Noise-based seismology is proving to be a complementary approach to active-source or earthquake-based methods for imaging and monitoring the Earth’s interior. Until recently, however, noise-based imaging and monitoring relied mostly on the inversion of surface waves reconstructed from correlations of mostly microseismic seismic noise (around 5 s of period). Compared to body-wave tomography and considering similar wavelengths, surface-wave tomography succeeds in retrieving lateral subsurface velocity contrasts but is less efficient in resolving velocity perturbations at depth. Recently, the use of large-N seismic arrays has proven to be of great benefit for extracting body waves from noise correlations by stacking over a large number of receiver pairs and by applying array processing. In this article, we describe a recent large-N array experiment that we conducted on Piton de la Fournaise (PdF). Our …", "num_citations": "38\n", "authors": ["922"]}
{"title": "Kawah Ijen volcanic activity: a review\n", "abstract": " Kawah Ijen is a composite volcano located at the easternmost part of Java island in Indonesia and hosts the largest natural acidic lake in the world. We have gathered all available historical reports on Kawah Ijen’s activity since 1770 with the purpose of reviewing the temporal evolution of its activity. Most of these observations and studies have been conducted from a geochemical perspective and in punctuated scientific campaigns. Starting in 1991, the seismic activity and a set of volcanic lake parameters began to be weekly available. We present a database of those measurements that, combined with historical reports, allow us to review each eruption/unrest that occurred during the last two centuries. As of 2010, the volcanic activity is monitored by a new multi-disciplinary network, including digital seismic stations, and lake level and temperature measurements. This detailed monitoring provides an …", "num_citations": "37\n", "authors": ["922"]}
{"title": "Toward Seismic Metamaterials: The METAFORET Project\n", "abstract": " We report on a seismic metamaterial experiment in a pine‐tree forest environment where the dense collection of trees behaves as subwavelength coupled resonators for surface seismic waves. For the METAFORET experiment, more than 1000 seismic sensors were deployed over a  area to study the properties of the ambient and induced seismic wavefield that propagates in the ground and in trees. The goal of the experiment was to establish a link between seismic‐relevant scales and microscale and mesoscale studies that pioneered the development of metamaterial physics in optics and acoustics. The first results of the METAFORET experiment show the presence of frequency band gaps for Rayleigh waves associated with compressional and flexural resonances of the trees, which confirms the strong influence that a dense collection of trees can have on the propagation of seismic waves.", "num_citations": "35\n", "authors": ["922"]}
{"title": "Single‐station monitoring of volcanoes using seismic ambient noise\n", "abstract": " Seismic ambient noise cross correlation is increasingly used to monitor volcanic activity. However, this method is usually limited to volcanoes equipped with large and dense networks of broadband stations. The single‐station approach may provide a powerful and reliable alternative to the classical “cross‐station” approach when measuring variation of seismic velocities. We implemented it on the Piton de la Fournaise in Reunion Island, a very active volcano with a remarkable multidisciplinary continuous monitoring. Over the past decade, this volcano has been increasingly studied using the traditional cross‐correlation technique and therefore represents a unique laboratory to validate our approach. Our results, tested on stations located up to 3.5 km from the eruptive site, performed as well as the classical approach to detect the volcanic eruption in the 1–2 Hz frequency band. This opens new perspectives to …", "num_citations": "30\n", "authors": ["922"]}
{"title": "Stress and mass changes at a “wet” volcano: Example during the 2011–2012 volcanic unrest at Kawah Ijen volcano (Indonesia)\n", "abstract": " Since 2010, Kawah Ijen volcano has been equipped with seismometers, and its extremely acid volcanic lake has been monitored using temperature and leveling sensors, providing unprecedented time resolution of multiparametric data for an acidic volcanic lake. The nature of stress and mass changes of the volcano is studied by combining seismic analyses and volcanic lake measurements that were made during the strongest unrest ever recorded by the seismic network at Kawah Ijen. The distal VT earthquake swarm that occurred in May 2011 was the precursor of volcanic unrest in October 2011 that caused an increase in shallow earthquakes. The proximal VT earthquakes opened pathways for fluids to ascend by increasing the permeability of the rock matrix. The following months were characterized by two periods of strong heat and mass discharge into the lake and by the initiation of monochromatic tremor …", "num_citations": "28\n", "authors": ["922"]}
{"title": "Ambient noise multimode Rayleigh and Love wave tomography to determine the shear velocity structure above the Groningen gas field\n", "abstract": " The Groningen gas field is one of the largest gas fields in Europe. The continuous gas extraction led to an induced seismic activity in the area. In order to monitor the seismic activity and study the gas field many permanent and temporary seismic arrays were deployed. In particular, the extraction of the shear wave velocity model is crucial in seismic hazard assessment. Local S-wave velocity-depth profiles allow us the estimation of a potential amplification due to soft sediments.         Ambient seismic noise tomography is an interesting alternative to traditional methods that were used in modelling the S-wave velocity. The ambient noise field consists mostly of surface waves, which are sensitive to the Swave and if inverted, they reveal the corresponding S-wave structures.         In this study, we present results of a depth inversion of surface waves obtained from the cross-correlation of 1 month of ambient noise data …", "num_citations": "25\n", "authors": ["922"]}
{"title": "Velocity models and site effects at Kawah Ijen volcano and Ijen caldera (Indonesia) determined from ambient noise cross-correlations and directional energy density spectral ratios\n", "abstract": " Two different ambient seismic noise techniques allow the determination of velocity models at Ijen caldera and Kawah Ijen volcano. At Ijen caldera, two average velocity models are constrained down to a depth of 3 km by inverting the stacked dispersion curve obtained by ambient noise cross-correlation. In addition, four local velocity models were obtained by inverting the horizontal to vertical spectral ratio of the directional energy densities of ambient noise (DEDHVR) i.e., computed through auto-correlation of ambient noise. This set of velocity models is then compared to the geology of the caldera and the local discontinuities are evidenced. At Kawah Ijen volcano, a map of local dominant frequencies is provided by the DEDHVR measurements recorded at 87 sites around Kawah Ijen volcano. The horizontality of the shallow layers and the great outcrop of the crater rim facilitate the interpretation of the DEDHVRs …", "num_citations": "23\n", "authors": ["922"]}
{"title": "Sea state trends and variability: consistency between models, altimeters, buoys, and seismic data (1979-2016)\n", "abstract": " Wave hindcasts of long time series (>30 years) have been instrumental in understanding the wave climate. However, it is still difficult to have a consistent reanalysis suitable for study of trends and interannual variability. Here we explore the consistency of a wave hindcast with independent observations from moored buoys, satellite altimeters, and seismic data. We use the Climate Forecast System Reanalysis (CFSR) winds to drive a wave model since extreme events are generally well captured. Unfortunately, the original CFSR winds are not homogeneous in time. We systematically modify this wind field in time and space to produce a wave field that has homogeneous differences against the Globwave/SeaStateCCI altimeter wave height database. These corrections to the winds and resulting waves are validated using independent buoy and microseism data. We particularly use seismic data in the dominant double …", "num_citations": "20\n", "authors": ["922"]}
{"title": "The impact of the earthquake activity in Western Europe from the historical and architectural records\n", "abstract": " The impact of the earthquake activity in Western Europe from the historical and architectural records - Camelbeeck Thierry Open Repository and Bibliography Home Other OA projects at the University Help? University of Liège | Library Network | Login | You are here: ORBi Detailled reference Reference : The impact of the earthquake activity in Western Europe from the historical and archi... Document type : Parts of books : Contribution to collective works Discipline(s) : Arts & humanities : History Physical, chemical, mathematical & earth Sciences : Earth sciences & physical geography To cite this reference: http://hdl.handle.net/2268/168448 Title : The impact of the earthquake activity in Western Europe from the historical and architectural records Language : English Author, co-author : Camelbeeck, Thierry mailto [Observatoire Royal de Belgique - ORB > > > >] Alexandre, Pierre mailto [Université de Liège - ULiège > …", "num_citations": "20\n", "authors": ["922"]}
{"title": "Anatomy of phreatic eruptions\n", "abstract": " This study investigates phreatic eruptions at two similar volcanoes, Kawah Ijen (Indonesia) and White Island (New Zealand). By carefully processing broadband seismic signals, we reveal seismic signatures and characteristics of these eruptions. At both volcanoes, the phreatic eruptions are initiated by a very-long-period (VLP) seismic event located at shallow depths between 700 and 900 m below the crater region, and may be triggered by excitation of gas trapped behind a ductile magma carapace. The shallow hydrothermal systems respond in different ways. At Kawah Ijen, the stress change induced by VLPs directly triggers an eigenoscillation of the hyperacidic lake. This so-called seiche is characterized by long-lasting, long-period oscillations with frequencies governed by the dimensions of the crater lake. A progressive lateral rupture of a seal below the crater lake and/or fluids migrating toward the surface is seismically recorded                                                                                                                                                            15 min later as high-frequency bursts superimposed to tilt signals. At White Island, the hydrothermal system later (                                                                                                                                                           25 min) responds by radiating harmonic tremor at a fixed location that could be generated through eddy-shedding. These seismic signals shed light on several aspects of phreatic eruptions, their generation and timeline. They are mostly recorded at periods longer than tens of seconds further emphasizing the need to deploy broadband seismic equipment close to active volcanic activity.", "num_citations": "19\n", "authors": ["922"]}
{"title": "Breathing and Coughing: The extraordinarily high degassing of Popocatépetl volcano investigated with an SO2 camera\n", "abstract": " How do lava domes release volcanic gases? Studying this problem is crucial to understand, and potentially anticipate, the generation of the sudden and dangerous explosive eruptions that frequently accompany dome extrusions. Since its awakening in 1994, Popocatépetl volcano has produced more than fifty lava domes and has been consistently among the strongest permanent emitters of volcanic gases. In this work, we have characterized the passive and explosive degassing between 2013 and 2016 at a high time resolution using an SO2 camera, to achieve a better understanding of the conduit processes. Our 4-year average SO2 flux is 45 kg/s, in line with the long-term average of the whole current eruptive period. We show that Popocatépetl volcano is essentially an open system and that passive degassing, i.e. degassing with no associated emission of lava or ash, dominates >95% of the time. This passive degassing is continuous and sustained, whether the crater contains a lava dome or not. It shows most of the time a strong periodic component, with a pseudo-period of ~5 minutes, and amplitudes of 30 to 60% of the average value. We could distinguish two types of explosions based on their SO2 flux patterns. The first type (E1) occurs in the middle of the normal passive degassing and is followed by a rapid return of the SO2 flux down to its pre-explosive level. The second type (E2), which corresponds to the strongest events, is anticipated by a rapid decrease of the SO2 flux to abnormally low values and is followed by a return to its normal values. The E2 explosions are probably caused by the accumulation of gas below a rapidly …", "num_citations": "18\n", "authors": ["922"]}
{"title": "Fluid dynamics inside a “wet” volcano inferred from the complex frequencies of long-period (LP) events: An example from Papandayan volcano, West Java, Indonesia, during the …\n", "abstract": " We present results of our study aimed at understanding the dynamics of fluids inside a “wet” volcano through the analysis of swarms of long-period (LP) events accompanying the 2011 seismic unrest at Papandayan volcano, West Java, Indonesia. Prior to this unrest, we measured an extremely high percentage (100 %) of CO2 in the ground at the summit crater, however with a very low value of SO2 flux (~ 6 tons/day). Increase in volcanic activity was also observed from the records of a tiltmeter. A long-term inflation was followed by an abrupt deflation that took place concurrently with the swarms of LP events. Thereafter, swarms of local-tectonic (LT) and volcano-tectonic (VT) earthquakes started. We focus here on analyzing the LP events in the following manner. First, we estimate the source location of LP events by applying a 3-D non-linear hypocenter localization algorithm which includes topography. We then study …", "num_citations": "18\n", "authors": ["922"]}
{"title": "Noise-based ballistic wave passive seismic monitoring. Part 1: body waves\n", "abstract": " Unveiling the mechanisms of earthquake and volcanic eruption preparation requires improving our ability to monitor the rock mass response to transient stress perturbations at depth. The standard passive monitoring seismic interferometry technique based on coda waves is robust but recovering accurate and properly localized P- and S-wave velocity temporal anomalies at depth is intrinsically limited by the complexity of scattered, diffracted waves. In order to mitigate this limitation, we propose a complementary, novel, passive seismic monitoring approach based on detecting weak temporal changes of velocities of ballistic waves recovered from seismic noise correlations. This new technique requires dense arrays of seismic sensors in order to circumvent the bias linked to the intrinsic high sensitivity of ballistic waves recovered from noise correlations to changes in the noise source properties. In this work we …", "num_citations": "17\n", "authors": ["922"]}
{"title": "Path and site effects deduced from merged transfrontier internet macroseismic data of two recent M4 earthquakes in northwest Europe using a grid cell approach\n", "abstract": " The online collection of earthquake reports in Europe is strongly fragmented across numerous seismological agencies. This paper demonstrates how collecting and merging online institutional macroseismic data strongly improves the density of observations and the quality of intensity shaking maps. Instead of using ZIP code Community Internet Intensity Maps, we geocode individual response addresses for location improvement, assign intensities to grouped answers within 100 km2 grid cells, and generate intensity attenuation relations from the grid cell intensities. Grid cell intensity maps are less subjective and illustrate a more homogeneous intensity distribution than communal ZIP code intensity maps. Using grid cells for ground motion analysis offers an advanced method for exchanging transfrontier equal-area intensity data without sharing any personal information. The applicability of the method is demonstrated on the felt responses of two clearly felt earthquakes: the 8 September 2011 ML 4.3 (Mw 3.7) Goch (Germany) and the 22 May 2015 ML 4.2 (Mw 3.7) Ramsgate (UK) earthquakes. Both events resulted in a non-circular distribution of intensities which is not explained by geometrical amplitude attenuation alone but illustrates an important low-pass filtering due to the sedimentary cover above the Anglo-Brabant Massif and in the Lower Rhine Graben. Our study illustrates the effect of increasing bedrock depth on intensity attenuation and the importance of the WNW–ESE Caledonian structural axis of the Anglo-Brabant Massif for seismic wave propagation. Seismic waves are less attenuated – high Q – along the strike of a tectonic structure …", "num_citations": "16\n", "authors": ["922"]}
{"title": "New insights into the Kawah Ijen hydrothermal system from geophysical data\n", "abstract": " The magmatic–hydrothermal system of Kawah Ijen volcano is one of the most exotic on Earth, featuring the largest acidic lake on the planet, a hyper-acidic river and a passively degassing silicic dome. While previous studies have mostly described this unique system from a geochemical perspective, to date there has been no comprehensive geophysical investigation of the system. In our study, we surveyed the lake using a thermocouple, a thermal camera, an echo sounder and CO2 sensors. Furthermore, we gained insights into the hydrogeological structures by combining self-potential surveys with ground and water temperatures. Our results show that the hydrothermal system is self-sealed within the upper edifice and releases pressurized gas only through the active crater. We also show that the extensive hydrological system is formed by not one but three aquifers: a south aquifer that seems to be completely …", "num_citations": "13\n", "authors": ["922"]}
{"title": "Noise-based ballistic wave passive seismic monitoring–Part 2: surface waves\n", "abstract": " We develop a new method to monitor and locate seismic velocity changes in the subsurface using seismic noise interferometry. Contrary to most ambient noise monitoring techniques, we use the ballistic Rayleigh waves computed from 30 d records on a dense nodal array located above the Groningen gas field (the Netherlands), instead of their coda waves. We infer the daily relative phase velocity dispersion changes as a function of frequency and propagation distance with a cross-wavelet transform processing. Assuming a 1-D velocity change within the medium, the induced ballistic Rayleigh wave phase shift exhibits a linear trend as a function of the propagation distance. Measuring this trend for the fundamental mode and the first overtone of the Rayleigh waves for frequencies between 0.5 and 1.1 Hz enables us to invert for shear wave daily velocity changes in the first 1.5 km of the subsurface. The …", "num_citations": "12\n", "authors": ["922"]}
{"title": "Electrical resistivity tomography data across the Hockai Fault Zone (Ardenne, Belgium)\n", "abstract": " In this work, we present the result of a large-scale geophysical survey that had the objective of identifying the subsurface characteristics and the NE–SW extension of the Hockai Fault Zone: a major NNW–SSE oriented crustal-rooted fault zone crossing the Stavelot-Venn Massif (Eastern Belgium). 31 two-dimensional electrical resistivity tomography (ERT) profiles are presented, resulting in 10,679 m of 2D sections. All profiles were acquired between 2008 and 2010 using a single channel ABEM Terrameter SAS1000 instrument connected to a 64 electrodes setup of maximum 315 m extent which was often extended using the roll-along technique. Major findings based on the data presented here are reported in the manuscript \"A geophysical cross-section of the Hockai Fault Zone (Eastern Belgium)\" (Lecocq and Camelbeeck, Submitted for publication) [1].", "num_citations": "12\n", "authors": ["922"]}
{"title": "Stratification at the Earth's largest hyperacidic lake and its consequences\n", "abstract": " Volcanic lakes provide windows into the interior of volcanoes as they integrate the heat flux discharged by a magma body and condense volcanic gases. Volcanic lake temperatures and geochemical compositions therefore typically serve as warnings for resumed unrest or prior to eruptions. If acidic and hot, these lakes are usually considered to be too convective to allow any stratification within their waters. Kawah Ijen volcano, featuring the largest hyperacidic lake on Earth (volume of 27 million m3), is less homogeneous than previously thought. Hourly temperature measurements reveal the development of a stagnant layer of cold waters (<30 °C), overlying warmer and denser water (generally above 30 °C and density ∼1.083 kg/m3). Examination of 20 yrs of historical records and temporary measurements show a systematic thermal stratification during rainy seasons. The yearly rupture of stratification at the end …", "num_citations": "12\n", "authors": ["922"]}
{"title": "Seismic evidence of the COVID-19 lockdown measures: a case study from eastern Sicily (Italy)\n", "abstract": " During the COVID-19 pandemic, most countries put in place social interventions, restricting the mobility of citizens, to slow the spread of the epidemic. Italy, the first European country severely impacted by the COVID-19 outbreak, applied a sequence of progressive restrictions to reduce human mobility from the end of February to mid-March 2020. Here, we analysed the seismic signatures of these lockdown measures in densely populated eastern Sicily, characterized by the presence of a permanent seismic network used for earthquake and volcanic monitoring. We emphasize how the anthropogenic seismic noise decrease is visible even at stations located in remote areas (Etna and Aeolian Islands) and that the amount of this reduction (reaching ∼ 50 %–60 %), its temporal pattern and spectral content are strongly station-dependent. Concerning the latter, we showed that on average the frequencies above 10 Hz are the most influenced by the anthropogenic seismic noise. We found similarities between the temporal patterns of anthropogenic seismic noise and human mobility, as quantified by the mobile-phone-derived data shared by Google, Facebook and Apple, as well as by ship traffic data. These results further confirm how seismic data, routinely acquired worldwide for seismic and volcanic surveillance, can be used to monitor human mobility too.", "num_citations": "9\n", "authors": ["922"]}
{"title": "The 6 May 1976 Friuli earthquake: re-evaluating and consolidating transnational macroseismic data.\n", "abstract": " The aim of this paper is to propose the creation, in terms of European Macroseismic Scale (EMS-98), of the entire macroseismic field of the 6 May 1976 Friuli earthquake. Only forty odd years have passed, and nothwithstanding that there is a huge quantity of existing data, it was still disturbing to find that much of the original data are missing and probably lost forever. Efforts have, therefore, been made to find additional and still unknown primary data. For the majority of the collected national data sets, a reevaluation was, then, possible. This study presents the comprehensive macroseismic data set for 14 European countries. It is, to our knowledge, one of the largest European data sets, consisting of 3423 intensity data points. The earthquake was felt from Rome to the Baltic Sea, and from Belgium to Warsaw. The maximum intensity 10 EMS-98 was reached in eight localities in Friuli (Italy). Compared to previous studies, the Imax values have changed from country to country, in some cases being lowered due to methodological differences, but in the case of three among the most hit countries, Imax is now higher than in the previous studies, mainly due to the new data.", "num_citations": "9\n", "authors": ["922"]}
{"title": "Temporal changes of seismic velocity caused by volcanic activity at Mt. Etna revealed by the autocorrelation of ambient seismic noise\n", "abstract": " On active volcanoes, ambient noise-based seismic interferometry, able to detect very slight variations in seismic velocity associated with magma transport towards the surface, can be a very useful monitoring tool. In this work, we performed the autocorrelation of ambient seismic noise recorded at Mt. Etna volcano, by three stations located close to the active summit craters, during April 2013 - October 2014. Such an interval was chosen because of the number and variety of eruptions. The method implemented to perform autocorrelation was the phase cross-correlation, which does not require normalization of the signals. The detected seismic velocity variations were very consistent for all three stations throughout the study period, mainly ranging between 0.3 and -0.2%, and were time-related to both sequences of paroxysmal eruptions and more effusive activities. In particular, we observed seismic velocity decreases accompanying paroxysmal eruptions, suggesting an intense pressurization within the plumbing system, which created an area of extensional strain with crack openings. It is worth noting that classical cross-station approach failed to detect seismic velocity changes related to volcano activity. In addition, seismic velocity variations over time were integrated with ground deformation data recorded by GPS stations and volcanic tremor centroid locations. Finally, we showed that, although the investigated frequency band (1-2 Hz) contains most of the volcanic tremor energy, our results did not indicate a particular contamination of seismic velocity variation measurements by variations of tremor sources.", "num_citations": "9\n", "authors": ["922"]}
{"title": "Seismotectonic significance of the 2008–2010 Walloon Brabant seismic swarm in the Brabant Massif, Belgium\n", "abstract": " Between 12 July 2008 and 18 January 2010 a seismic swarm occurred close to the town of Court-Saint-Etienne, 20 km SE of Brussels (Belgium). The Belgian network and a temporary seismic network covering the epicentral area established a seismic catalogue in which magnitude varies between ML -0.7 and ML 3.2. Based on waveform cross-correlation of co-located earthquakes, the spatial distribution of the hypocentre locations was improved considerably and shows a dense cluster displaying a 200 m-wide, 1.5-km long, NW-SE oriented fault structure at a depth range between 5 and 7 km, located in the Cambrian basement rocks of the Lower Palaeozoic Anglo-Brabant Massif. Waveform comparison of the largest events of the 2008–2010 swarm with an ML 4.0 event that occurred during swarm activity between 1953 and 1957 in the same region shows similar P- and S-wave arrivals at the Belgian Uccle seismic …", "num_citations": "9\n", "authors": ["922"]}
{"title": "Integrated study on the topographic and shallow subsurface expression of the Grote Brogel Fault at the boundary of the Roer Valley Graben, Belgium\n", "abstract": " The Grote Brogel Fault (GBF) is a major WNW-ESE striking normal fault in Belgium that diverges westward from the NW-SE striking western border fault system of the Roer Valley Graben. The GBF delimits the topographically higher Campine Block from the subsiding Roer Valley Graben, and is expressed in the Digital Terrain Model (DTM) by relief gradients or scarps. By integrating DTM, Electrical Resistivity Tomography (ERT), Cone Penetration Test (CPT) and borehole data, we studied the Quaternary activity of the GBF and its effects on local hydrogeology. In the shallow subsurface (< 50 m) underneath these scarps, fault splays of the GBF were interpreted on newly acquired ERT profiles at two investigation sites: one on the eastern section and the other on the western section, near the limit of the visible surface trace of the fault. Borehole and CPT data enabled stratigraphic interpretations of the ERT profiles and …", "num_citations": "7\n", "authors": ["922"]}
{"title": "L'activité sismique en Ardenne et sa relation avec la tectonique active\n", "abstract": " Dans cette thèse, nous avons réalisé une étud collectées par le réseau de surveillance sism avec celles des réseaux allemands et holland terre en appliquant les méthodes modern validées pour les contextes de sismicité e généralisé une méthode d'étude de la distrib pour obtenir non seulement les tremblements de terre, mais aussi leur no volume et d'établir s' il peut représenter un p ainsi de pouvoir le comparer avec le mécani", "num_citations": "7\n", "authors": ["922"]}
{"title": "B-FEARS: The Belgian Felt Earthquake Alert and Report System\n", "abstract": " An automatic felt earthquake alert and report system, BFEARS, was developed around the Belgian seismic network allowing seismologists to provide the authorities, the media and the public with information on local felt earthquakes a few minutes after their occurrence. This system is based on the analysis of the connection flow on the website of the Royal Observatory of Belgium (ROB) in parallel to an automatic control of a web macroseismic inquiry based on the “Did you feel it?” of the US Geological Survey (Wald et al., 1999), available on the ROB website since 2002. This information is neither as precise nor as reliable as the one supplied by the analysis of seismic signals, but is efficient thanks to the great population density in Belgium. The alert is supplemented by the analysis of the seismic signals from seven real time seismic stations appearing on the website with a delay of more or less ten minutes.", "num_citations": "5\n", "authors": ["922"]}
{"title": "Seismic monitoring of the Auckland Volcanic Field during New Zealand's COVID-19 lockdown\n", "abstract": " The city of Auckland, New Zealand (Tāmaki Makaurau, Aotearoa), sits on top of an active volcanic field. Seismic stations in and around the city monitor activity of the Auckland Volcanic Field (AVF) and provide data to image its subsurface. The seismic sensors – some positioned at the surface and others in boreholes – are generally noisier during the day than during nighttime. For most stations, weekdays are noisier than weekends, proving human activity contributes to recordings of seismic noise, even on seismographs as deep as 384 m below the surface and as far as 15 km from Auckland's Central Business District. Lockdown measures in New Zealand to battle the spread of COVID-19 allow us to separate sources of seismic energy and evaluate both the quality of the monitoring network and the level of local seismicity. A matched-filtering scheme based on template matching with known earthquakes improved the existing catalogue of five known local earthquakes to 35 for the period between 1 November 2019 and 15 June 2020. However, the Level-4 lockdown from 25 March to 27 April – with its drop in anthropogenic seismic noise above 1 Hz – did not mark an enhanced detection level. Nevertheless, it may be that wind and ocean swell mask the presence of weak local seismicity, particularly near surface-mounted seismographs in the Hauraki Gulf that show much higher levels of noise than the rest of the local network.", "num_citations": "4\n", "authors": ["922"]}
{"title": "On the Extraction of Microseismic Ground Motion from Analog Seismograms for the Validation of Ocean‐Climate Models\n", "abstract": " We report on a pilot demonstration of the usefulness of analog seismograms to improve the database of ocean storms before the 1980s by providing additional data for the quantitative validation of ocean wave modeling, in particular for extreme events. We present a method for automatic digitization of paper seismograms to extract microseismic ground‐motion periods and amplitudes. Each minute of the original paper records is scanned and vectorized. The amplitudes are calibrated based on the original metadata taken from official bulletins. The digitized time series is processed to extract power spectral densities, which are compared with modeled microseisms levels computed using a numerical ocean wave model. As a case study, we focus on one month of data recorded at the Royal Observatory of Belgium (ROB) from January to February 1953, around the “Big Flood” event, a tragic storm surge that flooded …", "num_citations": "4\n", "authors": ["922"]}
{"title": "Recording Belgium's Gravitational History\n", "abstract": " Page 1 of 8 Recording Belgium’s Gravitational History - Eos 03/01/2018 https://eos.org/project-updates/recording-belgiums-grav Page 1 Page 1 of 8 Recording Belgium’s Gravitational History - Eos 03/01/2018 https://eos.org/project-updates/recording-belgiums-gravitational-history Page 2 Page 2 of 8 Recording Belgium’s Gravitational History - Eos 03/01/2018 https://eos.org/project-updates/recording-belgiums-gravitational-history Page 3 Page 3 of 8 Recording Belgium’s Gravitational History - Eos 03/01/2018 https://eos.org/project-updates/recording-belgiums-gravitational-history Page 4 Page 4 of 8 Recording Belgium’s Gravitational History - Eos 03/01/2018 https://eos.org/project-updates/recording-belgiums-gravitational-history Page 5 Page 5 of 8 Recording Belgium’s Gravitational History - Eos 03/01/2018 https://eos.org/project-updates/recording-belgiums-gravitational-history Page 6 Page 6 of 8 Recording …", "num_citations": "4\n", "authors": ["922"]}
{"title": "Earthquake relocation in the Ardenne (Belgium): identification of active structures in intraplate context\n", "abstract": " Notable tectonic activity exists in the Belgian Ardenne and Eifel mountains in Germany. The strongest known seismic event in northwest Europe occurred in this area, near the Belgian city of Verviers, on 18 September 1692 with a magnitude estimated around 6 1/4 [1]. In the seismic hazards and risks perspectives, it is important to provide «scientifically supported» hypothesis on the possible seismogenic structure that generated the earthquake but also to realize an inventory of the sources of large earthquakes.", "num_citations": "4\n", "authors": ["922"]}
{"title": "Rayleigh group velocity extraction from ambient seismic noise to map the south Eastern Cape Karoo region, South Africa\n", "abstract": " The Karoo region of South Africa is an ideal laboratory to use ambient seismic signals to map the shallow subsurface, as it is a quiet and pristine environment with a geology that is relatively well known. Ambient seismic signals were continuously recorded for a ten week period between August and October 2015. The ambient seismic noise network consisted of two groups of 17 temporary, stand-alone seismic stations each. These were installed in the southeastern Cape Karoo region, near the town of Jansenville. Here we present data on the retrieval and coherency of Rayleigh surface waves extracted from the vertical component recordings. We reconstruct and show, for the first time in the southeastern Cape Karoo, estimates of Green's function from cross-correlating ambient noise data between stations pairs, which can be successfully used to image the subsurface. The stacked cross-correlations between all …", "num_citations": "3\n", "authors": ["922"]}
{"title": "Wind-induced seismic noise at the Princess Elisabeth Antarctica Station\n", "abstract": " Icequakes are the result of processes occurring within the ice mass or between the ice and its environment. Studying icequakes provides a unique view on ice dynamics, specifically on the basal conditions. Changes in conditions due to environmental or climate changes are reflected in icequakes. Counting and characterizing icequakes is thus essential to monitor them. Most of the icequakes recorded by the seismic station at the Belgian Princess Elisabeth Antarctica Station (PE) have small amplitudes corresponding to maximal displacements of a few nanometres. Their detection threshold is highly variable because of the rapid and strong changes in the local seismic noise level. Therefore, we evaluated the influence of katabatic winds on the noise measured by the well-protected PE surface seismometer. Our purpose is to identify whether the lack of icequake detection during some periods could be associated with variations in the processes generating them or simply with a stronger seismic noise linked to stronger wind conditions. We observed that the wind mainly influences seismic noise at frequencies greater than 1 Hz. The seismic noise power exhibits a bilinear correlation with the wind velocity, with two different slopes at a wind velocity lower and greater than 6 m s−1 and with, for example at a period of 0.26 s, a respective variation of 0.4 dB (m −1 s) and 1.4 dB (m −1 s). These results allowed a synthetic frequency and wind-speed-dependent noise model to be presented that explains the behaviour of the wind-induced seismic noise at PE, which shows that seismic noise amplitude increases exponentially with increasing wind …", "num_citations": "2\n", "authors": ["922"]}
{"title": "The 23 February 1828 Belgian earthquake: a destructive moderate event typical of the seismic activity in Western Europe\n", "abstract": " We present a comprehensive study of the 23 February 1828 earthquake that caused severe damage in the central part of the present Belgian territory. We synthesised and critically reassessed the information provided by contemporaneous scientific studies and newspapers of the Low Countries. In addition, a systematic survey of official, private, and religious historical sources was undertaken to improve our knowledge of the earthquake effects in the most affected region. In total, we collected information for 185 localities in the present territory of Belgium, France, Germany, The Netherlands, Grand Duchy of Luxembourg, and southern England. The complex spatial repartition of earthquake testimony locations is related to the population density, the types of historical sources, and the regional geological context. Our 1828 earthquake intensity analysis demonstrates that the shaking strength diminished more …", "num_citations": "2\n", "authors": ["922"]}
{"title": "Characterizing Stalagmites’ Eigenfrequencies by Combining In Situ Vibration Measurements and Finite Element Modeling Based on 3D Scans\n", "abstract": " Broken or deformed speleothems have been used as indicators of paleo-earthquakes since the 1990s; however, a causal link is difficult to prove except for some thin speleothems. In contrast, the presence of intact speleothems permits estimating an upper limit of the level of horizontal ground motions of past seismicity in the area. The natural frequencies of speleothems are fundamental parameters for their response to earthquakes. This study proposes a new method of in situ characterization of these natural frequencies. Tested in the Han-sur-Lesse cave (Belgian Ardennes), the method is based on recording the ambient seismic noise using three-component sensors on a stalagmite and a 3D laser scan of its shape. The ambient seismic noise records allow a precise determination of the eigenfrequencies of the stalagmite. In addition, numerical models based on the 3D scan show good consistency between measured and modeled data. The joint analysis of these two techniques concludes that the shape of the stalagmite (elliptical cross-section and shape irregularities) influence the eigenfrequencies and polarization of the modes while also causing a near-orthogonal split of natural frequencies. The motions recorded on the stalagmite show significant amplification compared to those recorded at the free surface outside the cave, which has a strong impact on seismic hazard assessment based on speleothems. View Full-Text", "num_citations": "2\n", "authors": ["922"]}
{"title": "Monitoring of fields using body and surface waves reconstructed from passive seismic ambient noise\n", "abstract": " There are important economic, environmental and societal reasons for monitoring production from oil, gas and geothermal fields. Unfortunately, standard microseismic monitoring is often not useful due to low levels of microseismicity. We propose to use body and surface waves reconstructed from ambient seismic noise for such monitoring. In this work, we use seismic data recorded from a dense sensor array at the Groningen gas field in northern Holland and show how direct P-waves can be extracted from the ambient noise cross correlations and then used to monitor seismic velocity variations over time. This approach has advantages over the use of coda wave interferometry due to the ability to localise such changes in the subsurface. We show how both direct and refracted (head) P-waves as well as Rayleigh surface waves can be used for such field monitoring, with changes of âˆ¼1% being resolved. Both …", "num_citations": "2\n", "authors": ["922"]}
{"title": "Contribution of the seismic monitoring at the Belgian Princess Elisabeth base to East Antarctica ice sheet dynamics and global seismicity studies\n", "abstract": " Owing to the implantation of the «Princess Elisabeth» polar base in East-Antarctica, the Royal Observatory of Belgium undertook research in seismology by installing in February 2010 a permanent broadband seismic station on the bedrock near the base. Due to the poor coverage of permanent seismic stations in Antarctica and the small number build on the bedrock, the station (code name: ELIB) is an interesting new source of information for global seismicity studies.Since its installation, the station also records numerous local and regional seismic events related to the interaction between the ice sheet flow and the bedrock. To study this seismicity, we installed five additional temporary broadband seismic stations separated by 25-30 km distance in January 2014. All those stations were operational from January to April 2014, which allowed locating different spots of ice-related seismicity in a radius of 200 km around ELIB and studying the processes at their origin.", "num_citations": "2\n", "authors": ["922"]}
{"title": "How well does known seismicity between the Lower Rhine Graben and southern North Sea reflect future earthquake activity?\n", "abstract": " Since the 14th century, moderate seismic activity with 14 earthquakes of magnitude MW≥5.0 occurred in Western Europe in a region extending from the Lower Rhine Graben (LRG) to the southern North Sea. In this paper, we investigate how well this seismic activity could reflect that of the future. The observed earthquake activity in the LRG is continuous and concentrates on the Quaternary normal faults delimiting the LRG, which are also the source of large surface rupturing Holocene and Late Pleistocene earthquakes. The estimated magnitudes of these past earthquakes range from 6.3±0.3 to 7.0±0.3 while their average recurrence on individual faults varies from ten thousand to a few ten thousand years, which makes foreseeing future activity over the long-term possible. Three of the largest historical earthquakes with MW≥5.5 occurred outside the LRG. Late Quaternary activity along the fault zones suspected to be the source of two of these earthquakes, i.e. the 1580 Strait of Dover and 1692 northern Belgian Ardennes earthquakes, is very elusive if it exists. Hence, similar earthquakes would be very infrequent at these locations suggesting that the seismicity outside of the LRG would be episodic and clustered on some faults during periods of a few hundreds of years interrupted by long periods of inactivity typically lasting for some tens to hundreds of thousand years. Seismic moment release estimation and its comparison between recent geological and historical seismicity periods lead us to suggest that the high seismicity level observed between AD 1350 and AD 1700 west of the LRG would be uncommon.", "num_citations": "1\n", "authors": ["922"]}
{"title": "Vs imaging from ambient noise Rayleigh wave tomography for oil exploration in Nevada, USA\n", "abstract": " Passive seismic imaging is a low-impact, low-cost technique that can be used to explore for and evaluate oil and gas deposits. Recent development of autonomous seismic recorders (“nodes”) allows for reliable continuous recording of seismic data for weeks or months at a time. In addition to improving field operations for traditional 3D active-source reflection surveys, nodes greatly increase the flexibility of seismic survey design and, most importantly, permit low-cost collection of dense passive seismic data with minimal impact on the local environment. The technique uses ambient seismic noise from natural and anthropogenic sources for subsurface imaging and monitoring. Cross-correlation between receiver pairs of stations is used to extract the Green function and a near-surface velocity model can be estimated from the analysis of surface wave dispersion curves obtained from the cross-correlated data. This …", "num_citations": "1\n", "authors": ["922"]}
{"title": "Noise-based Ballistic Body-wave Passive Seismic Monitoring.\n", "abstract": " Unveiling the mechanisms of earthquake and volcanic eruption preparation requires improving our ability to monitor the rock mass response to transient stress perturbations at depth. The standard passive monitoring seismic interferometry technique based on coda-waves is very stable but suffers from limited spatial resolution. In order to overcome this limitation, we propose a complementary, novel, passive seismic monitoring approach based on detecting weak temporal changes of velocities of ballistic waves recovered from seismic noise correlations. This new technique requires dense arrays of seismic sensors in order to circumvent the bias linked to the intrinsic high sensitivity of ballistic waves recovered from noise correlations to changes in the noise source properties. In this work we use a dense network of 417 seismometers in the Groningen area of the Netherlands, one of Europe's largest gas fields. Over the …", "num_citations": "1\n", "authors": ["922"]}
{"title": "Processing passive seismic data recorded on a dense array for CCS site characterization\n", "abstract": " Passive seismic data were recorded during an active surveyon more than 10,000 nodal geophones directly above a planned carbon sequestration site. The dense array enables us to use modern signal processing methods to better characterise the CCS site prior to injection. We used matched-field processing to detect and locate seismic events that are buried within the background noise. The locations of the seismic events may illuminate pre-existing faults or fractures that can influence plume movement after injection. Thousands of seismic events were detected and located in a small time series up to 2 km below surface. Additionally, we used ambient noise crosscorrelation to create seismic Green’s functions between all station pairs. The Raleigh wave dispersion curves were used to invert for a 3D velocity model of the subsurface, that can be compared to the results of the active survey. Ambient noise …", "num_citations": "1\n", "authors": ["922"]}
{"title": "Bedrock morphology modelling using geologically-dependant empirical equations between resonance frequency and bedrock depth\n", "abstract": " Calculating thickness variations of soft sediments above bedrock is important for site effect characterisation, earthquake ground motion amplification and for hydrogeological and geothermal purposes. In case seismic array instrumentation is not available and hence shear-wave velocity profiles cannot be obtained, other correlation techniques need to be applied to accurately deduce bedrock depth. Nakamura's H/V Spectral Ratio (HVSR) analysis of ambient noise is a powerful seismological method to reveal a site's resonance frequency. The conversion from a resonance map to a bedrock depth map in areas with a different sedimentary cover in terms of layer thickness and lithologies is, however, not straightforward. Converting resonance frequencies to depth by applying a mean shear-wave velocity (Vs) will under-and overestimate bedrock depth at higher and lower topographies, respectively. Applying an …", "num_citations": "1\n", "authors": ["922"]}
{"title": "Reawakening of Öræfajökull volcano monitored using a multidisciplinary approach\n", "abstract": " Öræfajökull is a stratovolcano in SE Iceland overlain by Vatnajökull ice cap. It is the highest peak of Iceland (2110 m). The volcano has steep slopes towards west, south and east and encompasses an oval caldera with a diameter of 3.5-5 km. It is responsible for two eruptions during the past 1000 years, in 1362 and 1727-28. Because of low seismic activity and the comparatively few eruptions in the last millennium, Öræfajökull has not been considered highly active. Extensive monitoring infrastructure has therefore not been operated around the volcano before 2017. The eruption in 1362 was a major Plinian eruption, destroying the nearby inhabited area by pyroclastic flows, massive tephra fallout, ballistics and volcanogenic floods. The eruption spread tephra over E-Iceland as well as Greenland, Ireland and Norway. The 1727 eruption was a VEI3-4 flank eruption but nevertheless had major effects on the closest …", "num_citations": "1\n", "authors": ["922"]}
{"title": "The great cobar passive seismic exploration pilot study\n", "abstract": " A pilot passive seismic exploration survey was conducted at Great Cobar over a 2-day period using 100 seismic sensors deployed on the surface. Ambient seismic noise was used to characterise the sub-surface seismic velocities. The resulting tomographic maps show a high velocity body on the North West of the studied area that could be a marker for the bedrock. The 3D analysis shows a deep low velocity anomaly on the North East that is suggestive of old mine workings. The shallow low velocities on the south are likely related to the slag heap which would be thicker on the South West of the studied area. Some other velocity anomalies are apparent and in particular a high velocity zone to the North East and South West suggests a different rock unit.", "num_citations": "1\n", "authors": ["922"]}
{"title": "Continuous H/V spectral ratio analysis of ambient noise: a necessity to understand microzonation results obtained by mobile stations\n", "abstract": " Estimating the resonance frequency (f0) and amplification factor of unconsolidated sediments by H/V spectral ratio (HVSR) analysis of seismic ambient noise has been widely used since Nakamura's proposal in 1989. To measure f0 properly, Nakamura suggested to perform microzonation surveys at night when the artificial microtremor is small and does not fully disrupt the ambient seismic noise. As nightly fieldwork is not always a reasonable demand, we propose an alternative workflow of Nakamura's technique to improve the quality of HVSR results obtained by ambient noise measurements of mobile stations during the day. This new workflow includes the automated H/V calculation of continuous seismic data of a stationary or permanent station installed near the microzonation site for as long as the survey lasts in order to control the error in the HVSR analysis obtained by the mobile stations. In this presentation …", "num_citations": "1\n", "authors": ["922"]}