{"title": "Comparison of improved precipitation methods for quantification of high-density lipoprotein cholesterol.\n", "abstract": " We compared the standard Lipid Research Clinics heparin-Mn2+ (46 mmol/L) method and five improved precipitation methods for quantification of high-density lipoprotein (HDL) cholesterol. Three of these methods--a dextran sulfate-Mg2+ procedure, reported as a Selected Method, a modified heparin-Mn2+ (92 mmol/L) method, and a modified phosphotungstate-Mg2+ procedure--all gave similar results. Three other methods--the standard heparin-Mn2+ (46 mmol/L) method and two polyethylene glycol methods (75 g/L or pH 10 reagent at 100 g/L final concentrations)--gave slightly higher values for HDL cholesterol. Addition of NaCl or glucose to specimens did not significantly change protein precipitation. In terms of sedimentation effectiveness with hypertriglyceridemic specimens, the methods were ranked in the following order: polyethylene glycol (pH 10, 100 g/L) greater than dextran sulfate-Mg2+ greater …", "num_citations": "516\n", "authors": ["126"]}
{"title": "The impact of dengue haemorrhagic fever on liver function\n", "abstract": " The impact of dengue haemorrhagic fever (DHF) on liver function was studied by measuring serum transaminase levels on 45 patients with DHF confirmed by virus isolation and serodiagnosis in 1995. Abnormal levels of AST and ALT were observed in 97.7 and 37.3% of the patients, respectively. The fact that the level of AST was higher than that of ALT and that the elevation of transaminases was mild to moderate in most cases (<5-fold greater than the normal upper limit for AST and ALT) showed that liver involvement was also mild to moderate in most cases of DHF. The results of transaminases did not differ significantly between cases with and without hepatitis B or hepatitis C virus infection, nor between primary and secondary cases of infection, but a significantly higher elevation of AST and ALT was observed in DHF patients with gastrointestinal haemorrhage. Two patients with dengue encephalopathy (in 1992 …", "num_citations": "262\n", "authors": ["126"]}
{"title": "Adverse drug reactions among children over a 10-year period\n", "abstract": " OBJECTIVES. This study was designed to evaluate (1) the incidence and common types of adverse drug reactions among hospitalized children, (2) the frequency of adverse drug reaction reporting by health care providers, and (3) the follow-up processes resulting from adverse drug reactions.METHODS. A retrospective cohort study of pediatric patients who experienced an adverse drug reaction between January 1, 1995, and December 31, 2004, was conducted at a community-based, tertiary care, children9s teaching hospital.RESULTS. A total of 1087 adverse drug reactions were reported; the overall incidence was 1.6%. The severity of most adverse drug reactions was low (levels 1–3: 89%; high levels 4–6: 11%). Adverse drug reactions with low severity were significantly more common in both the general pediatric unit and the NICU. Adverse reactions resulting from use of antibiotics (particularly penicillins …", "num_citations": "184\n", "authors": ["126"]}
{"title": "Global patterns in monthly activity of influenza virus, respiratory syncytial virus, parainfluenza virus, and metapneumovirus: a systematic analysis\n", "abstract": " BackgroundInfluenza virus, respiratory syncytial virus, parainfluenza virus, and metapneumovirus are the most common viruses associated with acute lower respiratory infections in young children (<5 years) and older people (≥65 years). A global report of the monthly activity of these viruses is needed to inform public health strategies and programmes for their control.MethodsIn this systematic analysis, we compiled data from a systematic literature review of studies published between Jan 1, 2000, and Dec 31, 2017; online datasets; and unpublished research data. Studies were eligible for inclusion if they reported laboratory-confirmed incidence data of human infection of influenza virus, respiratory syncytial virus, parainfluenza virus, or metapneumovirus, or a combination of these, for at least 12 consecutive months (or 52 weeks equivalent); stable testing practice throughout all years reported; virus results among …", "num_citations": "132\n", "authors": ["126"]}
{"title": "Scar formation of laser skin lesions after cold atmospheric pressure plasma (CAP) treatment: a clinical long term observation\n", "abstract": " CAP treatment is likely to be of benefit in wound healing. In a clinical study, 20 laser lesions in five individuals have been treated with argon plasma 10, 30 or three times for 10 s, with untreated as control. The scar formation was followed for 10 days, six and 12 months. In early stages of wound healing, plasma treatment seems to support the inflammation needed for tissue recovery. In later stages, plasma treatment shows better results in terms of avoiding post-traumatic skin disorders. Plasma treatment shows superior aesthetics during scar formation. No precancerous skin features occurred up to 12 months.", "num_citations": "121\n", "authors": ["126"]}
{"title": "A double-blind, randomized, controlled trial of the effects of two eggs per day in moderately hypercholesterolemic and combined hyperlipidemic subjects taught the NCEP step I diet.\n", "abstract": " We investigated the effect of egg feeding in 161 hypercholesterolemic (HC) or combined hyperlipidemic (CHL) free-living subjects taught the NCEP Step I Diet.Subjects had LDL-C between 3.36 and 4.91 mmol/L (130 and 190 mg/dL). HC subjects had triglyceride concentrations < 75th %-ile, CHL > or = 75th %-ile. Six weeks after instituting the Step I Diet, subjects were randomized to two eggs or egg substitute daily for 12 weeks.Mean dietary intake (9-day food records) was within NCEP guidelines and 131 subjects finished with stable weight and adherence > 80%. Placebo group lipoprotein lipids were unchanged at study end for both HC (n = 35) and CHL (n = 21) subjects. Egg-fed HC subjects (n = 44) increased LDL-C nonsignificantly, 0.07 mmol/L (3 mg/dL) (p = 0.49). Egg-fed CHL subjects (n = 31) increased LDL-C 0.31 mmol/L (12 mg/dL) (p < 0.001). HDL-C increased significantly in both HC and CHL groups …", "num_citations": "68\n", "authors": ["126"]}
{"title": "Impact of empiric antibiotic use on development of infections caused by extended-spectrum β-lactamase bacteria in a neonatal intensive care unit\n", "abstract": " Background:The neonatal intensive care unit at Miller Children's Hospital changed from empiric use of cefotaxime and vancomycin (CEF) to tobramycin and vancomycin (TOB) for hospital-acquired infections in November 1999 because of an increase in infections caused by extended-spectrum β-lactamase (ESBL)-producing bacteria. The objectives of this study were to evaluate the incidence and impact of this change on the development of ESBL infections.Methods:We retrospectively reviewed medical records of infants who received CEF or TOB between January 1998 and December 2002. A standardized form was used to collect demographic data, information on antibiotic use, and culture results.Results:The mean gestational age and birth weight of the 250 infants were 28.8±4.0 weeks and 1213.1±662 g, respectively. There were no differences between infants who received CEF (N= 130) or TOB (N= 120) in …", "num_citations": "60\n", "authors": ["126"]}
{"title": "Contact lenses\n", "abstract": " XP-002.200206 & JP 03079608 A (Shingijutsu Kaihatsu KK), Apr. 4, 1991, Database WPI, Section Ch, Week 199120, Derwent Publications, Ltd., London, GB: AN 1991-143954.", "num_citations": "58\n", "authors": ["126"]}
{"title": "The Legionella IcmSW Complex Directly Interacts with DotL to Mediate Translocation of Adaptor-Dependent Substrates\n", "abstract": " Legionella pneumophila is a Gram-negative bacterium that replicates within human alveolar macrophages by evasion of the host endocytic pathway through the formation of a replicative vacuole. Generation of this vacuole is dependent upon the secretion of over 275 effector proteins into the host cell via the Dot/Icm type IVB secretion system (T4SS). The type IV coupling protein (T4CP) subcomplex, consisting of DotL, DotM, DotN, IcmS and IcmW, was recently defined. DotL is proposed to be the T4CP of the L. pneumophila T4SS based on its homology to known T4CPs, which function as inner-membrane receptors for substrates. As a result, DotL is hypothesized to play an integral role(s) in the L. pneumophila T4SS for the engagement and translocation of substrates. To elucidate this role, a genetic approach was taken to screen for dotL mutants that were unable to survive inside host cells. One mutant, dotLY725Stop, did not interact with the type IV adaptor proteins IcmS/IcmW (IcmSW) leading to the identification of an IcmSW-binding domain on DotL. Interestingly, the dotLY725Stop mutant was competent for export of one class of secreted effectors, the IcmSW-independent substrates, but exhibited a specific defect in secretion of IcmSW-dependent substrates. This differential secretion illustrates that DotL requires a direct interaction with the type IV adaptor proteins for the secretion of a major class of substrates. Thus, by identifying a new target for IcmSW, we have discovered that the type IV adaptors perform an additional role in the export of substrates by the L. pneumophila Dot/Icm T4SS.", "num_citations": "57\n", "authors": ["126"]}
{"title": "Inhibition of Group IVA Cytosolic Phospholipase A2 by Thiazolyl Ketones in Vitro, ex Vivo, and in Vivo\n", "abstract": " Group IVA cytosolic phospholipase A2 (GIVA cPLA2) is the rate-limiting provider of pro-inflammatory mediators in many tissues and is thus an attractive target for the development of novel anti-inflammatory agents. In this work, we present the synthesis of new thiazolyl ketones and the study of their activities in vitro, in cells, and in vivo. Within this series of compounds, methyl 2-(2-(4-octylphenoxy)acetyl)thiazole-4-carboxylate (GK470) was found to be the most potent inhibitor of GIVA cPLA2, exhibiting an XI(50) value of 0.011 mole fraction in a mixed micelle assay and an IC50 of 300 nM in a vesicle assay. In a cellular assay using SW982 fibroblast-like synoviocytes, it suppressed the release of arachidonic acid with an IC50 value of 0.6 μM. In a prophylactic collagen-induced arthritis model, it exhibited an anti-inflammatory effect comparable to the reference drug methotrexate, whereas in a therapeutic model, it …", "num_citations": "39\n", "authors": ["126"]}
{"title": "Lipoprotein effects of combined ezetimibe and colesevelam hydrochloride versus ezetimibe alone in hypercholesterolemic subjects: a pilot study\n", "abstract": " Two drug classes act in the intestine to lower cholesterol. Ezetimibe inhibits cholesterol absorption, whereas bile acid–binding resins enhance cholesterol excretion via enhanced conversion to bile acids. Combining these 2 classes may be beneficial, but cholestyramine binds ezetimibe, and the combined effect of colesevelam hydrochloride and ezetimibe was little studied. The aim of the study was to determine if adding colesevelam HCl to ezetimibe provides additional lowering of low-density lipoprotein– and apolipoprotein B–containing lipoproteins or alters ezetimibe levels. Twenty subjects with low-density lipoprotein cholesterol (LDL-C) levels of 130 mg/dL or higher were enrolled and taught a National Cholesterol Education Program Step I diet. At a second baseline visit, lipoproteins were measured and subjects were randomly allocated to (1) ezetimibe 10 mg daily with placebo colesevelam HCl twice daily (E …", "num_citations": "39\n", "authors": ["126"]}
{"title": "Predictive factors of dengue shock syndrome at the children Hospital No. 1, Ho-chi-Minh City, Vietnam\n", "abstract": " The dengue shock syndrome (DSS) is primarily a complication of dengue haemorrhagic fever (DHF) among children in South East Asia. A case-control study was carried out at the children hospital no 1 (Ho-Chi-Minh City, Vietnam) in May-July 2005, to identify the predictive factors of the DSS among 1-15 year patients with DHE Forty consecutive admitted cases and forty controls were studied. The associated features of DSS were the 7-12 year age group and the re-infection by the dengue virus. The vaccination against the Japanese encephalitis B was not associated statistically significantly with the shock syndrome. The clinical predictors of DSS gathered an abdominal tenderness, an hepatomegaly, a lethargy, a cold extremity presentation. DSS associated laboratory features were a value of hematocrit a 50% and a platelet cell count< or= 75,000/mm3.", "num_citations": "33\n", "authors": ["126"]}
{"title": "Health care utilization, cost burden and coping strategies by disability status: an analysis of the Viet Nam National Health Survey\n", "abstract": " There is a need for nationally representative information on the affordability of health care by disability status to assist in the design of equitable health systems in developing countries. Using the Viet Nam National Health Survey (2001–2002), this paper analyses health care utilization, cost burden and coping strategies for people with disabilities versus the population at large. The results clearly show that the disabled population are more prone to hospitalization, and spend more on inpatient stays and pharmaceuticals. Households with disabled members are at greater risk of catastrophic health expenditures and debt financing, posing a serious threat to economic welfare. Copyright © 2010 John Wiley & Sons, Ltd.", "num_citations": "31\n", "authors": ["126"]}
{"title": "The ω3‐polyunsaturated fatty acid derivatives AVX001 and AVX002 directly inhibit cytosolic phospholipase A2 and suppress PGE2 formation in mesangial cells\n", "abstract": " Background and Purpose ω3‐polyunsaturated fatty acids (ω3‐PUFAs) are known to exert anti‐inflammatory effects in various disease models although their direct targets are only poorly characterized.   Experimental approach Here we report on two new cPLA2 inhibitors, the ω3‐derivatives AVX001 and AVX002, and their effects on inflammatory PGE2 production in cultures of renal mesangial cells.   Key Results AVX001 and AVX002 dose‐dependently inhibited the group IVA cytosolic phospholipase A2 (cPLA2) in an in vitro activity assay with similar IC50 values for AVX001 and AVX002, whereas the known cPLA2 inhibitor AACOCF3 was less potent and docosahexaenoic acid (DHA) was inactive. In renal mesangial cells, AVX001 and AVX002 suppressed IL‐1β‐induced PGE2 synthesis. Mechanistically, this effect occurred by a down‐regulation of IL‐1β‐induced group IIA‐sPLA2 protein expression, mRNA …", "num_citations": "29\n", "authors": ["126"]}
{"title": "Writing performance of narrow gap heads made with sputtered laminated FeN materials on 3800 Oe coercivity media\n", "abstract": " Recording results of write heads using sputtered laminated FeN/Al/sub 2/O/sub 3/ materials on thin film media with coercivity up to 3800 Oe are compared with those obtained using plated NiFe materials. The thickness of P2 (second pole) of FeN merged write heads is about 3.2 /spl mu/m, and those of plated NiFe heads, 3.5 and 6.3 /spl mu/m respectively. These heads have two write gap thickness, around 0.2 and 0.4 /spl mu/m. Various recording measurements show that these high magnetization FeN heads of 0.15 /spl mu/m gap write well on media of 3800 Oe, while the corresponding NiFe ones with a P2 of twice the thickness could not. For a wide 0.39 /spl mu/m gap, the FeN write heads still work well and the NiFe ones with twice the pole thickness, also did, but at reduced resolution, In short, write heads using a narrow gap and high magnetization materials such as FeN can write 3800 Oe coercivity media …", "num_citations": "28\n", "authors": ["126"]}
{"title": "The SLIM study: Slo-Niacin® and atorvastatin treatment of lipoproteins and inflammatory markers in combined hyperlipidemia\n", "abstract": " BackgroundThe combination of niacin and statin has proven value in the management of hyperlipidemia and prevention of heart disease. However, the efficacy of the nonprescription time-release niacin, Slo-Niacin®, is little studied alone and not at all with atorvastatin. We studied Slo-Niacin® and atorvastatin, singly and together, to determine efficacy on the combined abnormalities of triglyceride (TG), low-density lipoprotein cholesterol (LDL-C), and high-density lipoprotein cholesterol (HDL-C).MethodsA total of 42 men and women with LDL-C >130 mg/dL and HDL-C <45 mg/dL (men) or <55 mg/dL (women) were randomized to 3 months of atorvastatin 10 mg/d or incremental doses of Slo-Niacin® to 1500 mg/d. The alternate drug was added in the next 3-month segment. Lipid profiles and transaminases were measured monthly and other measures at baseline and the end of each treatment sequence.ResultsMean …", "num_citations": "27\n", "authors": ["126"]}
{"title": "The spatial distribution of vulnerability to the health impacts of flooding in the Mekong Delta, Vietnam\n", "abstract": " Flooding causes significant public health issues. The Mekong Delta has been considered the region to be the most vulnerable to flooding in Vietnam. This study assessed the spatial vulnerability of the health impacts of flooding in the Mekong Delta region, Vietnam. This study applied a vulnerability assessment framework which was computed as the function of three dimensions: exposure, sensitivity, and adaptive capacity. The indicators for each dimension were derived from the relevant literature, consultations with experts, and data availability. An analytic hierarchy process (AHP) and a principal component analysis (PCA) were used to determine the weight of indicators. Vulnerability indexes (VIs) were then computed for each province. A total of 29 indicators (sensitivity index, 14; adaptive capacity index, 13; and exposure index, 2) were employed to evaluate the vulnerability to the health impacts of …", "num_citations": "25\n", "authors": ["126"]}
{"title": "Synthesis of benzoxazoles, benzimidazoles, and benzothiazoles using a Brønsted acidic ionic liquid gel as an efficient heterogeneous catalyst under a solvent-free condition\n", "abstract": " Herein, we introduce a reusable Brønsted acidic ionic liquid gel (BAIL gel) obtained by treating 1-methyl-3-(4-sulfobutyl)-1H-imidazolium hydrogen sulfate with tetraethyl orthosilicate (TEOS). The grafting of the Brønsted acidic ionic liquid to the surface of TEOS has increased the catalytic activity of the material and also simplified catalyst recovery from the reaction mixture. This reaction has a wide substrate scope, and the BAIL gel represents a new catalyst for the synthesis of benzoxazoles, benzimidazoles, and benzothiazoles. The method shows attractive characteristics such as high yields, recyclable catalyst, and work-up simplicity. More importantly, no additional additives or volatile organic solvent and inert atmosphere are required for the reaction, and the BAIL gel has shown a great promise for industrial applications. To the best of our knowledge, the synthesis of benzoxazoles, benzimidazoles, and …", "num_citations": "22\n", "authors": ["126"]}
{"title": "Flavone-based analogues inspired by the natural product simocyclinone D8 as DNA gyrase inhibitors\n", "abstract": " The increasing occurrence of drug-resistant bacterial infections in the clinic has created a need for new antibacterial agents. Natural products have historically been a rich source of both antibiotics and lead compounds for new antibacterial agents. The natural product simocyclinone D8 (SD8) has been reported to inhibit DNA gyrase, a validated antibacterial drug target, by a unique catalytic inhibition mechanism of action. In this work, we have prepared simplified flavone-based analogues inspired by the complex natural product and evaluated their inhibitory activity and mechanism of action. While two of these compounds do inhibit DNA gyrase, they do so by a different mechanism of action than SD8, namely DNA intercalation.", "num_citations": "22\n", "authors": ["126"]}
{"title": "Lipoprotein quantification: an electrophoretic method compared with the Lipid Research Clinics method.\n", "abstract": " We compared a turbidimetric electrophoretic method (Lipidophor) for lipoprotein quantification with the standardized Lipid Research Clinics (LRC) method. In the Lipidophor procedure, major lipoproteins are separated by electrophoresis on agarose gels, precipitated on the gels with phosphotungstate-Mg2+ reagent, and the resulting turbidity is measured densitometrically. Measurements of relative turbidity were converted into lipoprotein cholesterol values by the use of numeric constants provided by the manufacturer. Among-day CVs (n = 46) for the Lipidophor method were 6.0%, 3.6%, and 9.9% for cholesterol in the alpha-, beta-, and pre-beta lipoproteins, respectively. The Lipidophor alpha-cholesterol was significantly lower (n = 171 specimens) than the LRC high-density lipoprotein (HDL) cholesterol (514 vs 586 mg/L), and beta-cholesterol was significantly higher than the corresponding LRC low-density …", "num_citations": "21\n", "authors": ["126"]}
{"title": "Crystal structure and magnetic properties of perovskite YFe1-xMnxO3 nanopowders synthesized by co-precipitation method\n", "abstract": " Perovskite YFe1-xMnxO3 nanopowders (0.1 ≤ x ≤ 0.4) were synthesized by the co-precipation method in which the hydrate process of Y(III), Fe(III) and Mn(II) cations in boiling water took place. After annealing at 800 °C for 1 h, the nano YFe1-xMnxO3 materials had the single phase of YFe1-xMnxO3. The results showed that in the range of Mn (II) х from 0.1 to 0.4, the materials had the indexes of crystal size (DXRD = 23.61 ÷ 22.95 nm), lattice constant (a = 5.5932 ÷ 5.6744 Å, b = 7.7373 ÷ 7.5194 Å, c = 5.3014 ÷ 5.2592 Å, and V = 229.425 ÷ 224.4012 Å3), saturation magnetization (Ms = 2.19 ÷ 1.12 emu/g), maximum energy product ((BH)max = 2.19 ÷ 1.12 emu/g), coercive force (Hc = 56.94 ÷ 150.95 Oe), remanent magnetization (Mr = 0.23–0.50 emu/g). When increasing the amount of Mn (II), the indexes of crystal size, lattice constant (b, c, V), saturation …", "num_citations": "17\n", "authors": ["126"]}
{"title": "Inhibition of human topoisomerases I and II by simocyclinone D8\n", "abstract": " Simocyclinone D8 is an antibiotic isolated from Streptomyces antibioticus Tü 6040 that inhibits the supercoiling activity of DNA gyrase. It also exhibits an inhibitory effect on human topoisomerase II and an antiproliferative activity against some cancer cell lines. Our biochemical studies have revealed that simocyclinone D8 can inhibit the catalytic activity of human topoisomerase I. Thus, simocyclinone D8 is a dual catalytic inhibitor of human topoisomerases I and II.", "num_citations": "17\n", "authors": ["126"]}
{"title": "Impact of corporate social responsibility on supply chain management and financial performance in Vietnamese garment and textile firms\n", "abstract": " This study is conducted to investigate the impact of corporate social responsibility (CSR) on supply chain management (SCM) and financial performance, and the effect of SCM on financial performance through the mediate role of corporate reputation and customer loyalty. In addition, the study tests the moderate role of firm size and the ratio of export products in the relationship between SCM and financial performance. The research sample is 389 Vietnamese garment and textile firms by collecting through survey questionnaire. The results show that corporate social responsibility has a positive impact on SCM and financial performance and SCM has a positive impact on financial performance. However, firm reputation and customer loyalty do not have any mediate role in the relationship between SCM and financial performance. Firm size and export product ratio play a moderate role with statistical significance in the relationship between SCM and financial performance.", "num_citations": "16\n", "authors": ["126"]}
{"title": "Studies on the apoproteins of the major lipoprotein of the yolk of hen's eggs. V. Protein sulfhydryl groups: accessibility in the lipoprotein and the effect of temperature\n", "abstract": " Sulfhydryl groups in the apoproteins of the major lipoprotein (density 0·95 gjml) of hen's egg yolk have been studied by colorimetry, analysis for carboxymethylcysteine, and labelling with (14C]iodocompounds and their distribution amongst the individual apoproteins (i.e. apovitellenins I-VI) has been determined.", "num_citations": "16\n", "authors": ["126"]}
{"title": "Phosphonium acidic ionic liquid: an efficient and recyclable homogeneous catalyst for the synthesis of 2-arylbenzoxazoles, 2-arylbenzimidazoles, and 2-arylbenzothiazoles\n", "abstract": " A highly efficient and green strategy for the synthesis of 2-arylbenzoxazoles, 2-arylbenzimidazoles, and 2-arylbenzothiazoles catalyzed by phosphonium acidic ionic liquid has been developed via the condensation of o-aminophenol, o-phenylenediamines, and o-aminothiophenol, respectively, with aldehydes. The reaction has a good yield, the broad substrate scope, and mild condition. Triphenyl(butyl-3-sulphonyl)phosphonium toluenesulfonate catalyst was easily obtained from cheap and available starting materials through a one-pot synthesis. Its structure was identified by 1H NMR, 13C NMR, 31P NMR, and FT-IR techniques. Other properties including thermal stability and acidity were determined by TGA and Hammett acidity function method. Interestingly, the catalyst can maintain its constantly outstanding performance till the fourth recovery.", "num_citations": "15\n", "authors": ["126"]}
{"title": "Vietnamese State-Owned Enterprises after Equitization: Performance, Emerging Issues, and Policy Recommendations\n", "abstract": " Equitization is the sole method of state-owned enterprise reform in Vietnam. This paper analyzes the results of a survey on the performance of equitized enterprises. Its findings clarify the causes of pre-and post-equitization differences and the impact of ownership structure on the performance of equitized enterprises, focusing on arising problems in the post-equitization period, particularly those regarding corporate governance. Based on the results of survey, the paper also provides some policy recommen-dations to speed up the equitization process and enhance post-equitization corporate governance in the years to come.", "num_citations": "15\n", "authors": ["126"]}
{"title": "Phenylalanine-based inactivator of AKT kinase: design, synthesis, and biological evaluation\n", "abstract": " Strategies to inhibit kinases by targeting the substrate binding site offer many advantages, including naturally evolved selectivity filters, but normally suffer from poor potency. In this work we propose a strategy to design and prepare covalent substrate-competitive kinase inhibitors as a method to improve potency. We have chosen AKT as the model kinase for this work. Using the AKT-GSK3β cocrystal structure and a reactive cysteine near the substrate binding site, we have identified phenylalanine (Phe) as an appropriate scaffold for the covalent inactivator portion of these inhibitors. By synthesizing compounds that incorporate cysteine-reactive electrophiles into phenylalanine and testing these compounds as AKT inhibitors, we have identified Boc-Phe-vinyl ketone as a submicromolar inactivator of AKT. We also show that Boc-Phe-vinyl ketone (1) potently inhibits AKT1 and inhibits cell growth in HCT116 and H460 …", "num_citations": "13\n", "authors": ["126"]}
{"title": "Preparation and evaluation of deconstruction analogues of 7-deoxykalafungin as AKT kinase inhibitors\n", "abstract": " The pyranonaphthoquinone (PNQ) lactone natural products, including 7-deoxykalafungin, have been reported to be potent and selective covalent inhibitors of AKT kinase. In this work we seek to identify structural features of the natural product scaffold that are essential for potency and selectivity. Using a deconstruction approach, we designed and prepared simplified analogues of 7-deoxykalafungin. Testing of the compounds for their ability to inhibit AKT and the closely related kinase PKA revealed that the 3,6-dihydro-2H-pyran ring of the PNQ lactones is required for potent and selective inhibition of AKT. We have also unexpectedly identified a new submicromolar inhibitor of PKA.", "num_citations": "13\n", "authors": ["126"]}
{"title": "Fabrication of Fe3O4/CuO@ C composite from MOF-based materials as an efficient and magnetically separable photocatalyst for degradation of ciprofloxacin antibiotic\n", "abstract": " In this work, a novel ternary Fe3O4/CuO@C composite was fabricated using iron-doped copper 1,4-benzenedicarboxylate metal-organic frameworks as a self-sacrificing template. The morphological, structural, and optical properties of the prepared composite were determined by various techniques, and its photocatalytic behavior was investigated for degradation of ciprofloxacin under visible light irradiation. The Fe3O4/CuO@C material presented a porous structure with a rough surface of about 4–20 μm, and was composed of the Fe3O4/CuO nanocomposite uniformly distributed on a carbon support. The band gap energy of the obtained composite was found to be 2.0 eV, which was nearly two times lower than that of Fe3O4@C and CuO@C. As a result, Fe3O4/CuO@C exhibited high photocatalytic activity, achieving a degradation efficiency of 98.5% after 120 min irradiation at the optimum conditions (a catalyst …", "num_citations": "11\n", "authors": ["126"]}
{"title": "Coupled large amplitude motions: the effects of two methyl internal rotations and 14N quadrupole coupling in 4, 5-dimethylthiazole investigated by microwave spectroscopy\n", "abstract": " The molecular jet Fourier-transform microwave spectrum of 4,5-dimethylthiazole has been recorded between 2.0 and 26.5 GHz, revealing torsional splittings arising from two inequivalent methyl internal rotations with relatively low hindering barriers and nitrogen quadrupole hyperfine structures. Two global fits with 1009 hyperfine components of 97 rotational transitions involving 315 torsional lines were performed using the program XIAM and BELGI-Cs-2Tops-hyperfine, an extended version of the BELGI-Cs-2Tops code which includes the effect of the 14N quadrupole coupling, giving a root-mean-square deviation of 399.8 kHz and 4.2 kHz, respectively. Compared to the monomethyl substituted thiazole derivatives, the barriers to internal rotation are drastically lower. This is also in contrast to chemical intuition which suggests high barriers due to steric hindrance. Because of the strong interaction between the methyl …", "num_citations": "10\n", "authors": ["126"]}
{"title": "Mismatched and wobble base pairs govern primary microRNA processing by human Microprocessor\n", "abstract": " MicroRNAs (miRNAs) are small RNAs that regulate gene expression. miRNAs are produced from primary miRNAs (pri-miRNAs), which are cleaved by Microprocessor. Microprocessor, therefore, plays a crucial role in determining the efficiency and precision of miRNA production, and thus the function of the final miRNA product. Here, we conducted high-throughput enzymatic assays to investigate the catalytic mechanism of Microprocessor cleaving randomized pri-miRNAs. We identified multiple mismatches and wobble base pairs in the upper stem of pri-miRNAs, which influence the efficiency and accuracy of their processing. The existence of these RNA elements helps to explain the alternative cleavage of Microprocessor for some human pri-miRNAs. We also demonstrated that miRNA biogenesis can be altered via modification of the RNA elements by RNA-editing events or single nucleotide polymorphisms (SNPs …", "num_citations": "10\n", "authors": ["126"]}
{"title": "The internal loops in the lower stem of primary microRNA transcripts facilitate single cleavage of human Microprocessor\n", "abstract": " The human Microprocessor complex cleaves primary microRNA (miRNA) transcripts (pri-miRNAs) to initiate miRNA synthesis. Microprocessor consists of DROSHA (an RNase III enzyme), and DGCR8. DROSHA contains two RNase III domains, RIIIDa and RIIIDb, which simultaneously cleave the 3p- and 5p-strands of pri-miRNAs, respectively. In this study, we show that the internal loop located in the lower stem of numerous pri-miRNAs selectively inhibits the cleavage of Microprocessor on their 3p-strand, thereby, facilitating the single cleavage on their 5p-strand. This single cleavage does not lead to the production of miRNA but instead, it downregulates miRNA expression. We also demonstrate that by manipulating the size of the internal loop in the lower stem of pri-miRNAs, we can alter the ratio of single-cut to double-cut products resulted from the catalysis of Microprocessor, thus changing miRNA …", "num_citations": "10\n", "authors": ["126"]}
{"title": "Camellia velutina (Theaceae, sect. Chrysantha), a new species from northern Vietnam\n", "abstract": " Camellia velutina VT Pham, VD Luong & Aver. found in Phu Tho province, northeastern Vietnam is described and illustrated. The comparison between the new species and closely related species is provided.", "num_citations": "10\n", "authors": ["126"]}
{"title": "Impacts of corporate governance on firm performance-Empirical studies of listed Singaporean companies\n", "abstract": " This study aims to investigate the relationship between corporate governance and financial performance of listed Singaporean companies. We collect the data from 137 listed companies for the period of four years from 2013 to 2016. In this research, corporate governance is driven by a wide range of variables, which include the dual role CEO, board size and board independence. Besides, the financial performance is measured by three different methods, which include return on asset, return on equity and Tobin’s Q. Our findings show that there is an inverse association between board size and firm performance, however, we do not find any significant relationships between board dependence, CEO duality and company financial performance.", "num_citations": "10\n", "authors": ["126"]}
{"title": "Childbirth, Maternity, and Medical Pluralism in French Colonial Vietnam, 1880-1945\n", "abstract": " This book explores the interactions between French medicine and Vietnamese childbirth traditions, examining how these interactions shaped maternal and infant health care in Vietnam. Armed with the language and expertise of modernmedicine, French physicians and administrators set out on a mission to relocate Vietnamese childbirth to a clinical setting. But as the French ventured into indigenous communities, they found themselves negotiating with a myriad of Vietnamese cultural practices relating to childbirth and infant care. Thwarted by local resistance, cultural misunderstanding, and ambiguous policy, the Western model of hospital birth neither displaced nor transformedindigenous birthing traditions in the ways the French had envisioned. Instead, as author Thuy Linh Nguyen demonstrates, the emergence of a plural system of maternity services, many of which were based on local practices and beliefs, served as a testimony to the compromises and adaptations made by both the French and Vietnamese populations. Thuy Linh Nguyen is assistant professor of history at Mount Saint Mary College in Newburgh, NY.", "num_citations": "10\n", "authors": ["126"]}
{"title": "Analysis of the single-fiber fragmentation test\n", "abstract": " An analysis of the single-fiber fragmentation test was investigated.An approximate solution for the stress fields of a fiber embedded in a polymer matrix of different elastic moduli was obtained by the Eshelby method. The fiber was modeled as a prolate spheroid. The axial stress of the fiber increases with increasing aspect ratio and fiber-matrix shear modulus ratio and decreases with increasing matrix and fiber Poisson's ratios. Using this analysis, the fracture stress of a single-fiber fragmentation specimen was derived. The applied stress at fiber fracture decreases monotonically with increasing aspect ratio of the fragmented fiber and increases with increasing fiber and matrix Poisson's ratios. This model is in qualitative agreement with published experimental data.", "num_citations": "10\n", "authors": ["126"]}
{"title": "Methodology for the Global Youth Tobacco Use Survey (GYST), Vietnam, 2014\n", "abstract": " Viet Nam is a country with the highest rate of adult male smokers in the world. In 2010, the percentage of adult male smokers was 47.4%. Each year in Viet Nam, there are 40,000 lives lost from tobacco-related diseases. The Global Tobacco Youth Survey is an international standardized survey that has been conducted in more than 140 countries. To provide evidence for tobacco control, Viet Nam already conducted two rounds of GYTS in 2003 and 2007. The GYTS in 2014 is the survey's third iteration. This paper aims to document key methodological details and socio-demographic characteristics of the respondents included in the 2014 GYTS in Viet Nam. This survey followed international protocol and was conducted in 13 provinces representative of 6 geographical regions. A total of 3,430 school children, aged 13 to 15 years used a standardized answer sheet to answer 76 questions about seven tobacco-related topics, including prevalence of tobacco use, environmental tobacco smoke, access and availability, media and advertisement, cessation, knowledge and attitudes, tobacco-related school curriculum. This GYTS provides valid and reliable data for monitoring tobacco use among youth in Vietnam and is recommended to be regularly repeated.", "num_citations": "9\n", "authors": ["126"]}
{"title": "Health-related quality of life among vietnamese breast cancer women\n", "abstract": " The aim of the study was to investigate health-related quality of life among Vietnamese breast cancer women who were treated at National Cancer Hospital, Hanoi, Vietnam, in 2018. Information about physical functioning, Role Physical, Bodily Pain, General Health, vitality, Social Functioning, Role Emotional, and Mental Health of 200 patients with breast cancer was collected through face-to-face interview, using short form-36 questionnaire. We found that the older patients (older than 50 years) had higher score of Mental Health than patients at age 50 and lower (P < .05). The patients who had better economic status had significantly higher score of Vitality (P < .05). Patients who were married and living with their partners/husband had better quality of life in General Health (P<0.05). The patients who had less than 6 months of treatment had better physical functioning score (P < .05) than the patients who had …", "num_citations": "8\n", "authors": ["126"]}
{"title": "Orientation of human microprocessor on primary microRNAs\n", "abstract": " Single-stranded microRNAs (miRNAs) regulate gene expression by triggering mRNA degradation and/or inhibiting mRNA translation. miRNAs play important roles in various critical cellular processes and are associated with numerous human diseases, including cancer and neurodegenerative diseases. miRNA sequences are embedded in the primary miRNA transcripts (pri-miRNAs) that are initially processed by the Microprocessor complex in the nucleus. Microprocessor can orient itself on pri-miRNAs in two ways: one orientation results in subsequent miRNA production, and the other leads to cleavage of the miRNA sequence. Therefore, orienting Microprocessor on pri-miRNAs is a fundamental mechanism for determining the accuracy and efficiency of pri-miRNA processing and, in turn, miRNA production. Multiple mechanisms controlling Microprocessor orientation on pri-miRNAs, involving both cis-acting RNA …", "num_citations": "8\n", "authors": ["126"]}
{"title": "Highly efficient synthesis of 4-trialkylsilyl(germyl)-1H-1,2,3-triazole-5-carbaldehydes\n", "abstract": " A combination of such important properties of the triazole ring as chemical stability, large dipole moment, heteroaromatic character, and the ability to form hydrogen bonds via donor–acceptor interactions were efficiently utilized in organic synthesis in the design of biologically active molecules and new materials [1]. Although 1, 2, 3-triazole ring is lacking in natural compounds, synthetic and biochemical studies on 1, 2, 3-triazole derivatives have gained a new impetus in recent years due to their use as bioisosters of amide group in the design of new effective and safe drugs [2].Several synthetic approaches to 1, 2, 3-triazoles are known [3], but the most practical and efficient procedure for the synthesis of 1, 4-disubstituted 1, 2, 3-triazoles is now that based on the “click chemistry” copper (I)-catalyzed reaction of azides with terminal alkynes [4]. However, this procedure is inapplicable to internal alkynes, and it does not …", "num_citations": "8\n", "authors": ["126"]}
{"title": "Object-oriented modeling of multimedia documents\n", "abstract": " This paper describes an object-oriented model for paper-based multimedia documents such as a textbook with embedded graphics. This model is the first step towards building a manageable authoring system for the Web, in which documents can be easily built, extended, truncated, reordered, assembled and disassembled on a component basis, and the document components can be reused. The model will also make accessible properties which might be significant or important to the user, especially in searching or classifying documents, such as the document title and author. The model design is explained, and the class hierarchy for the model is presented.", "num_citations": "8\n", "authors": ["126"]}
{"title": "Factors Affecting Academic Performance of First-Year University Students: A Case of a Vietnamese University.\n", "abstract": " In the higher education sector, understanding factors that underlie students’ academic achievement has, for long, been a topic of interest for educators, universities, and policymakers. For individual students, achieving academic success has essential and far-reaching impacts in personal, educational, and professional terms. It contributes to students’ self-esteem, wellbeing, motivation, and perseverance in learning and has implications on their career choice, personal income, level of success, and community participation (Durden and Ellis, 1995; Gainen,", "num_citations": "7\n", "authors": ["126"]}
{"title": "A LEA gene from a Vietnamese maize landrace can enhance the drought tolerance of transgenic maize and tobacco\n", "abstract": " Maize (Zea mays) is a major cereal crop worldwide, and there is increasing demand for maize cultivars with enhanced tolerance to desiccation. Late embryogenesis abundant (LEA) proteins group 5C is involved in plants’ responses to various osmotic stresses such as drought and salt. A putative group 5C LEA gene from Z. mays cv. Tevang 1 was isolated, named ZmLEA14tv, and cloned into a T-DNA for expression in plants. The deduced amino acid of ZmLEA14tv showed a conserved Pfam LEA_2 domain and a high proportion of hydrophobic residues, characteristic of group 5C LEA proteins. Transgenic tobacco and maize plants expressing ZmLEA14tv were generated. During drought simulation conditions, the ZmLEA14tv-expressing plants of tobacco showed improved recovery ability, while those of maize enhanced the seed germination in comparison with the non-transgenic control plants. In addition, the survival rate of ZmLEA14tv transgenic maize seedlings was twice as high as the control. These results indicated that ZmLEA14tv might be involved in the drought tolerance of plants and could be a candidate gene for developing enhanced drought-tolerant crops. View Full-Text", "num_citations": "7\n", "authors": ["126"]}
{"title": "Managing risks in the fisheries supply chain using House of Risk Framework (HOR) and Interpretive Structural Modeling (ISM)\n", "abstract": " One of the sectors which contributes importantly to the development of Vietnam economy is fishery industry. However, during recent year, it has been witnessed many difficulties on managing the performance of the fishery supply chain operations as a whole. In this paper, a framework for supply chain risk management (SCRM) is proposed. Initially, all the activities are mapped by using Supply Chain Operations Reference (SCOR) model. Next, the risk ranking is analyzed in House of Risk. Furthermore, interpretive structural modeling (ISM) is used to identify inter-relationships among supply chain risks and to visualize the risks according to their levels. For illustration, the model has been tested in several case studies with fishery companies in Can Tho, Mekong Delta. This study identifies 22 risk events and 20 risk agents through the supply chain. Also, the risk priority could be used for further House of Risk with …", "num_citations": "7\n", "authors": ["126"]}
{"title": "New dianthramide and cinnamic ester glucosides from the roots of Aconitum carmichaelii\n", "abstract": " Four new compounds N-salicyl-3-hydroxyanthranilic acid methyl ester (1), N-(2′-dehydroxysalicyl)-3-hydroxyanthranilic acid methyl ester (2), methyl-4-β-D-allopyranosyl-ferulate (3), and methyl-4-β-D-gulopyranosyl-cinnamate (4), along with six known compounds (5–10), were isolated from the roots of Aconitum carmichelii Debx. Their structures were elucidated on the basis of spectral data analysis, including 1D, 2D-NMR, and HR-ESI-MS. Compounds 1 and 2 showed the inhibition of nitric oxide (NO) production with IC50 values of 9.13 and 19.94 μM, respectively.", "num_citations": "6\n", "authors": ["126"]}
{"title": "Synthesis, structure and antimicrobial activity of novel metabolites from a marine actinomycete in Vietnam's East Sea\n", "abstract": " A naturally new ester, 2,4-dichlorophenyl 2,4-dichloro benzoate (1) and a new compound, 4,5-dihydroxy-7-methylphthalide (2), along with eight known compounds were isolated from the fermentation broth of the marine-derived actinomycete Streptomyces sp. (strain G212). The structures of these compounds were established by their spectral data analysis, including MS, and 2D-NMR. To confirm the structures of the two new compounds 1 and 2, their total syntheses were achieved. These syntheses also allow obtaining enough quantities of 1 and 2 for their biological screening. The isolated compounds and synthetic samples were evaluated for their antimicrobial activity against a panel of clinically significant microorganisms. Except for 8 and 10, the remaining compounds were active against at least one tested microbial strain with the MIC values in range of 32-256 μg/mL. Compounds 5, 6, 17 and 2a were found to …", "num_citations": "6\n", "authors": ["126"]}
{"title": "Spin equilibrium and O2-binding kinetics of Mycobacterium tuberculosis CYP51 with mutations in the histidine–threonine dyad\n", "abstract": " The acidic residues of the “acid–alcohol pair” in CYP51 enzymes are uniformly replaced with histidine. Herein, we adopt the Mycobacterium tuberculosis (mt) enzyme as a model system to investigate these residues' roles in finely tuning the heme conformation, iron spin state, and formation and decay of the oxyferrous enzyme. Properties of the mtCYP51 and the T260A, T260V, and H259A mutants were interrogated using UV–Vis and resonance Raman spectroscopies. Evidence supports that these mutations induce comprehensive changes in the heme environment. The heme iron spin states are differentially sensitive to the binding of the substrate, dihydrolanosterol (DHL). DHL and clotrimazole perturb the local environments of the heme vinyl and propionate substituents. Molecular dynamics (MD) simulations of the DHL–enzyme complexes support that the observed perturbations are attributable to changes in the …", "num_citations": "6\n", "authors": ["126"]}
{"title": "Exploiting 3D printing technology to develop robotic running foot for footwear testing: This paper describes a framework for a prosthesis that has four controlled degrees of …\n", "abstract": " Results of modern automatic footwear testing technology based on the biomechanics of the human foot have limitations due to use of the passive imitative foot. On the other hand, many studies on the humanoid walking robot, orthotic ankle, and prosthesis for amputees have been presented. However, these studies only focused on the ankle joint and walking gait. In this paper, the authors proposed a framework for developing a robotic running foot-leg for footwear testing. This prosthesis has four controlled degrees of freedom at the hip, knee, ankle and metatarsophalangeal joints. Along with two active joints (i.e. the ankle and metatarsophalangeal joints) and one passive joint (i.e. the midtarsal joint), the foot model also includes the windlass mechanism formed by the hindfoot, metatarsals and plantar fascia springs. In addition, the framework includes iteration for rapid prototyping and developing the cover of the …", "num_citations": "6\n", "authors": ["126"]}
{"title": "Alice in online and on-campus environments—how well is it received\n", "abstract": " Since its launch around 2000, Alice, an innovative tool to aid in the teaching of introductory programming, has received much publicity and great acceptance worldwide. It has however, also received a number of criticisms, and in some cases, was even removed from the curriculum. Further researches are needed to establish more precisely what works and what does not work for Alice, and in what situation. This paper reports on the outcomes of an educational empirical research project that aims to establish if there are any correlations between the level of acceptance of Alice by students and the learning environments (online versus on-campus), taking into consideration the specific characteristics of Alice as well as the personal traits, learning style, and relevant background and experiences of the students. The findings indicate that is more likely that online students like Alice than on-campus students. This deviation however, is not likely to be influenced by the learning environment or study mode per se, but rather by age, communication frequency, and English as the first language.", "num_citations": "6\n", "authors": ["126"]}
{"title": "French-educated midwives and the medicalization of childbirth in colonial Vietnam\n", "abstract": " This article explores the role of Vietnamese midwives who introduced French practices of childbirth, hygiene, and infant care to Vietnamese women and their progeny. It traces the professional and social life of colonial midwives, highlighting their difficult relationship with French doctors, their contestation of racial and gender discriminations at work, and their medical mission in rural communities, and describes how they reconciled the tension between their modernizing role and their identity as Vietnamese women. Through an investigation of these medical agents' activities, this study suggests that the midwives' commitment to professional duties might embody another way for Vietnamese women to be modern during the colonial period.", "num_citations": "6\n", "authors": ["126"]}
{"title": "PCR-based DNA markers for the WA-CMS fertility restoring gene Rf-3 in rice\n", "abstract": " CiNii 論文 - PCR-based DNA markers for the WA-CMS fertility restoring gene Rf-3 in rice CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす 大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版年 年から 年まで 検索 検索 検索 CiNii窓口業務の再開について PCR-based DNA markers for the WA-CMS fertility restoring gene Rf-3 in rice NGUYEN TL 被引用文献: 1件 著者 NGUYEN TL 収録刊行物 Rice Genet. Newsl. Rice Genet. Newsl. 15, 156-158, 1998 被引用文献: 1件中 1-1件を 表示 1 Effects of Rf-1, Rf-3 and Rf-6(t) Genes on Fertility Restoration in Rice (Oryza sativa L.) with WA- and BT-Type Cytoplasmic Male Sterility Tada Yuichi Breeding science 57(3), 223-229, 2007-09-01 参考文献34件 Tweet 各種コード NII論文ID(NAID) 10019679815 資料種別 雑誌論文 CJP/…", "num_citations": "6\n", "authors": ["126"]}
{"title": "Motivation for accounting human resources by material stimulation: The case of accounting service firms in Hanoi, Vietnam\n", "abstract": " his study is conducted for evaluating the motivation for accounting human resources by material stimulation in the accounting service firms in Hanoi. Based on literature review and the results of some interviews, dependent variable of the motivation for accounting human resources by material stimulation includes seven attributes. The study has also performed some descriptive analysis, Cronbach's Alpha, Independent T-test and ANOVA for measuring the motivation for accounting human resources by material stimulation in the accounting service firms in Hanoi. The results show that the motivation for accounting human resources by material stimulation achieved an average of 3.74 and with Cronbach's Alpha coefficient greater than 0.6. The study does not find any difference on evaluation of the motivation for accounting human resources by material stimulation in terms of gender and job experience. Based on the findings, some recommendations are given for improving the motivation for accounting human resources by material stimulation in the accounting service firms in Hanoi.", "num_citations": "5\n", "authors": ["126"]}
{"title": "Smoke-free environment policy in Vietnam: what did people see and how did they react when they visited various public places?\n", "abstract": " MethodsUsing the design of GATS (Global Adult Tobacco Survey), a nationally representative sample of 8,996 adults were approached for data collection. Logistic regression was used to examine the associated factor.ResultsThe study revealed that the prevalence of respondents exposed to secondhand smoke was much higher in bars/café/tea shops (90.07%) and restaurants (81.81%) than in any other public places, universities (36.70%), government buildings (31.12%), public transport (20.04%), healthcare facilities (17.85%) and schools (15.84%). 13.23% of respondents saw smokers violate smoke-free regulations. Among those who saw them violate smoke-free regulations, just one-third cautioned them to stop smoking. Strikingly, a higher rate of cautioning smokers to stop smoking was observed among the older, married, and better educated respondents. Respondents who were married, better educated and …", "num_citations": "5\n", "authors": ["126"]}
{"title": "One-pot three-component green synthesis of [1 H-(1, 2, 3-triazol-5-yl) methylidene] heterocycles based on element-substituted propynals\n", "abstract": " The one-pot three-component synthesis of polyfunctional bis-heterocyclic triazoles, namely, previously unknown 1H-1,2,3-triazolylmethylidenepyrimidines and -1,3-dioxanes, was performed for the first time in moderate or high yields starting from element-substituted propynals, trimethylsilyl azide, and heterocyclic CH-acids at room temperature in aqueous medium.", "num_citations": "5\n", "authors": ["126"]}
{"title": "Knowledge and attitude towards tobacco smoking among 13-15 year-old school children in Viet Nam-findings from GYTS 2014\n", "abstract": " Studies have shown that smoking is a learnt behavior, often initiated during adolescence. This paper aims to describe tobacco-related knowledge, attitude and associations among school adolescents aged 13-15 with exposure to anti-smoking information. Using data from the Global Youth Tobacco Survey (GYTS) in Viet Nam, 2014, knowledge was measured through 4 questions about tobacco use, and attitude was assessed through 3 questions on personal, social and environmental aspects. Students giving most anti-tobacco responses to all questions were considered as having correct knowledge or appropriate attitude or both. Access to anti-smoking information was determined by exposure to any media messages on tobacco control during the past 30 days and teaching in school about the danger of tobacco use during the past 12 months. A substantial percentage of students thought that being near others who smoke might be harmful to them and smoking is harmful to health (89.4% and 89.6% respectively). However, only 46.4% reported that it is definitely difficult to quit smoking and 66.9% thought that smoking for only 1 or 2 years, once stopped, is harmful to health. Slightly more than half of the respondents reported appropriate attitude that young smokers have fewer friends than others and smoking makes them less attractive and less comfortable at social events. Noticing anti-smoking messages in the media together with having lessons in school about the dangers of tobacco substantially increased the likelihood of having correct knowledge, appropriate attitude and both. Despite relatively high awareness about smoking harms, effective …", "num_citations": "5\n", "authors": ["126"]}
{"title": "Trends in second-hand tobacco smoke exposure levels at home among Viet Nam school children aged 13-15 and associated factors\n", "abstract": " Second-hand tobacco smoke (SHS) exposure at home, especially among children, is a serious issue in Viet Nam. During the past decade, much effort has been taken for tobacco control in the country, including various prgorammes aiming to reduce SHS exposure among adults and children. This article analysed trends and factors associated with SHS exposure at home among school children aged 13-15 in Viet Nam, using the Global Youth Tobacco Surveys conducted in 2007 and 2014. Descriptive and inferential statistical methods with logistic regression were applied. Overall, there was a significant reduction in the level of exposure, from 58.5%(95% CI: 57.6-59.3) in 2007 to 47.1%(95% CI: 45.4-48.8) in 2014. Of the associated factors, having one or both parents smoking was significantly associated with the highest odds of SHS exposure at home (OR= 5.0; 95% CI: 4.2-6.1). Conversely, having a mother with a college or higher education level was found to be a protective factor (OR= 0.5; 95% CI: 0.3-0.8).", "num_citations": "5\n", "authors": ["126"]}
{"title": "Response to manuscript ‘Is Opisthorchis viverrini an avian liver fluke?’\n", "abstract": " In a reaction to the paper ‘Opisthorchis viverrini-like liver fluke in birds from Vietnam: morphological variability and rDNA/mtDNA sequence confirmation’, by Dao et al.(2013), Nawa, Doanh and Thaenkham comment on the validity of the conclusions of that paper and suggest that the flukes recovered from ducks in Central Vietnam are specimens of Opisthorchis parageminus. Indeed, in the book Fauna of Vietnam. vol. 8, written in Vietnamese by Le (2000), three avian Opisthorchis spp. were reported from ducks in North Vietnam, ie O. cheelis Lal, 1939, O. longissimus Linstow, 1883 and O. parageminus Oshmarin, 1970. Consequently, we acknowledge the remark made by Nawa et al.(2013) that our observation is not the first report of an Opisthorchis sp. in birds in Vietnam. However, it is the first report of an Opisthorchis sp. in South Vietnam that is part of the greater Mekong sub-region, which is endemic for O. viverrini …", "num_citations": "5\n", "authors": ["126"]}
{"title": "Defining a minimum pharmacophore for simocyclinone D8 disruption of DNA gyrase binding to DNA\n", "abstract": " The increasing occurrence of drug-resistant bacterial infections in the clinic has created a need for new antibacterial agents. Natural products have historically been a rich source of both antibiotics and lead compounds for new antibacterial agents. The natural product simocyclinone D8 (SD8) has been reported to inhibit DNA gyrase, a validated antibacterial drug target, by a unique catalytic inhibition mechanism of action. In this work, we have used a deconstruction-reconstruction approach to prepare analogs of the coumarin subunit of SD8 and evaluated their ability to disrupt binding of the DNA gyrase enzyme to DNA in a surface plasmon resonance assay. This has led to a minimum pharmacophore required for disruption of binding.", "num_citations": "5\n", "authors": ["126"]}
{"title": "Decisive role of water in efficient noncatalyzed synthesis of polyfunctional 1 H-1, 2, 3-triazoles proceeding from γ-hydroxypropynals\n", "abstract": " A highly efficient method was developed for the synthesis of new polyfunctional 1H-1,2,3-triazoles by the reaction of γ-hydroxypropynals with trimethylsilyl azide in water at room temperature without catalyst. The addition of trimethylsilyl azide to γ-hydroxypropynals occurs regioselectively: Previously unknown hydroxyalkyl-1H-1,2,3-triazolecarbaldehydes have been isolated in 69-96% yields with the prevalence of 1,5-isomers and the content of minor 1,4-isomers equal 9-21%. In the reaction of γ-hydroxypropynals with sodium azide in DMSO the formation of 4-hydroxyalkyl-1H-1,2,3-triazole-5-carbaldehydes is accompanied by the dimerization of initial aldehydes into the corresponding 1,3-dioxolanes.", "num_citations": "5\n", "authors": ["126"]}
{"title": "Select amino acids in DGCR8 are essential for the UGU-pri-miRNA interaction and processing\n", "abstract": " Microprocessor, composed of DROSHA and DGCR8, processes primary microRNAs (pri-miRNAs) in miRNA biogenesis. Its cleavage efficiency and accuracy are enhanced because DGCR8 interacts with the apical UGU motif of pri-miRNAs. However, the mechanism and influence of DGCR8–UGU interaction on cellular miRNA expression are still elusive. In this study, we demonstrated that Rhed (ie, the RNA-binding heme domain, amino acids 285–478) of DGCR8 interacts with UGU. In addition, we identified three amino acids 461–463 in Rhed, which are critical for the UGU interaction and essential for Microprocessor to accurately and efficiently process UGU-pri-miRNAs in vitro and UGU-miRNA expression in human cells. Furthermore, we found that within the DGCR8 dimer, the amino acids 461–463 from one monomer are capable of discriminating between UGU-and noUGU-pri-miRNAs. Our findings improve …", "num_citations": "4\n", "authors": ["126"]}
{"title": "A 2.77 μW Ambient RF Energy Harvesting Using DTMOS Cross-Coupled Rectifier on 65 nm SOTB and Wide Bandwidth System Design\n", "abstract": " This paper proposes a structure of the μ W RF energy harvesting (RFEH) system that is used for scavenging RF power from an ambient environment. A cross-coupled rectifier (CCR) with floating sub-circuit structures was utilized in the application of dynamic threshold MOSFET (DTMOS) on Silicon on Thin Buried Oxide (SOTB) to obtain high drain conductance of the MOSFET. A wide bandwidth matching between antenna and rectifier was designed to receive energy from the orthogonal frequency division multiplexing (OFDM) RF signal with a bandwidth of 15 MHz at 950 MHz band. Realistic measurements with a 950 MHz LTE mobile phone signal from the ambient environment indicate that an average DC output power of 2.77 μ W is harvested with the proposed RFEH system at a level of− 19.4 dBm input power. The proposed RFEH system exhibits the best performance when compared to that of other realistic RFEH systems and is a potential candidate for battery-less Internet of Things (IoT) applications. View Full-Text", "num_citations": "4\n", "authors": ["126"]}
{"title": "Genetic diversity of groundnut rhizosphere antagonistic bacteria and biological control of groundnut wilted diseases in central Vietnam\n", "abstract": " Stem rot of groundnut caused by Sclerotium rolfsii, seriously damages groundnut production in central Vietnam. Biological control is a promising strategy for sustainable groundnut cultivation. In this study, indigenous bacteria were isolated from the rhizosphere of groundnut and tested for fungal inhibition against S. rolfsii in vitro and disease control under net house condition. Geneticdiversity of isolated bacterial population was evaluated by BOX-PCR and 16SrDNA sequences. Bacterial strains that showed high disease control in net house were evaluated under natural conditions in farmer fields. The antifungal mechanism of the best bacterial strain was identified. Results of the study showed that the antagonistic bacterial population in groundnut rhizosphere is separated in three bacterial genera including Bacillus, Pseudomonas and Burkholderia. One bacterial strain which produces 2, 4-DAPG reduced stem rot of …", "num_citations": "4\n", "authors": ["126"]}
{"title": "Impacts of corporate governance on firm performance\n", "abstract": " This study aims to investigate the relationship between corporate governance and financial performance of listed Singaporean companies. We collect the data from 137 listed companies for the period of four years from 2013 to 2016. In this research, corporate governance is driven by a wide range of variables, which include the dual role CEO, board size and board independence. Besides, the financial performance is measured by three different methods, which include return on asset, return on equity and Tobin’s Q. Our findings show that there is an inverse association between board size and firm performance, however, we do not find any significant relationships between board dependence, CEO duality and company financial performance.", "num_citations": "4\n", "authors": ["126"]}
{"title": "Access to anti-smoking information among school children and its potential impact on preventing smoking initiation: results from the global youth tobacco use survey (GYTS) 2014 …\n", "abstract": " Scientific evidence on all aspects of smoking amongst youth is very important for designing appropriate interventions to reduce smoking among this vulnerable population. This paper describes current access to anti-smoking information among school children aged 13 to 15 years in Vietnam in 2014 and examines its potential impact on preventing smoking initiation. The data used in this paper were obtained from the 2014 Global Youth Tobacco Survey (GYTS) in Vietnam. Students were asked questions about their level of awareness of anti-smoking information from various sources in the past 30 days and about lessons in school regarding the dangers of tobacco use during the last 12 months. Those who have never smoked were asked\" whether or not they thought about avoiding cigarettes because of health warnings on cigarette packages\" and answers were analyzed in combination with data on access to anti-smoking information from other sources. The prevalence of exposure to antismoking campaigns was high among school children in Viet Nam: 55.3% of current smokers reported thoughts of smoking cessation because of health warnings on cigarette packages; 60.5% of never smokers avoided initiating smoking because of the same health warnings. The potential impact of graphic health warnings to prevent school-aged children from smoking initiation would be stronger if there was concurrent access to anti-smoking programs on the dangers of tobacco use in schools. However, school education for tobacco prevention and control has not been as strong as expected. A more comprehensive school curriculum on tobacco prevention and …", "num_citations": "4\n", "authors": ["126"]}
{"title": "Culturing Chlorella in anaerobically digested piggery wastewater for biodiesel feedstock and nutrient removal\n", "abstract": " Anaerobic digestion of piggery waste generates effluents which containing high concentration of inorganic nitrogen and phosphorus can result in eutrophication of natural water bodies when discharged without adequate treatment. Microalgae can be cultured in effluent derived from the anaerobic digestion of piggery waste for nutrient removal and biodiesel feedstock production. In this study, the piggery wastewater was used as a nutrient source for culturing the green microalgae, Chlorella sp B5. The effect of dilution of the effluent on the nutrient removal efficiency of Chlorella sp. B5 was determined. During an eight day batch culture, Chlorella sp. B5 grew fastest in an diluted effluent with a initial COD concentration of about 300-400 mg/L. The maximum specific growth rate and biomass concentration of Chlorella sp. B5 were 0.306 day-1 and 0.19 g/L, respectively. The culturing system of Chlorella sp. B5 removed ammonia, total phosphorus and COD of piggery wastewater by 60–95.8%, 22–68% and 34–73.8%, respectively. The lipid content of algal biomass after 8 days were 28-30% of dry weight.", "num_citations": "4\n", "authors": ["126"]}
{"title": "Human disease-associated single nucleotide polymorphism changes the orientation of DROSHA on pri-mir-146a\n", "abstract": " The Microprocessor complex of DROSHA and DGCR8 initiates the biosynthesis of microRNAs (miRNAs) by processing primary miRNAs (pri-miRNAs). The Microprocessor can be oriented on pri-miRNAs in opposite directions to generate productive and unproductive cleavages at their basal and apical junctions, respectively. However, only the productive cleavage gives rise to miRNAs. A single nucleotide polymorphism (SNP, rs2910164) in pri-mir-146a is associated with various human diseases. Although this SNP was found to reduce the expression of miRNA, it is still not known if it affects the activity of the Microprocessor directly, and how it functions. In this study, we revealed that the SNP creates an unexpected mGHG motif at the apical junction of pri-mir-146a. This mGHG motif interacts with the double-stranded RNA-binding domain (dsRBD) of DROSHA, switching its orientation on pri-mir-146a from the basal …", "num_citations": "3\n", "authors": ["126"]}
{"title": "Physicochemical characteristics of platelet factor 4 under various conditions are relevant for heparin-induced thrombocytopenia testing\n", "abstract": " Heparin-induced thrombocytopenia (HIT), an adverse drug effect, has gained much attention. Affected patients have a high risk of new thrombotic complications. In addition, HIT is also a model to study mechanisms of immune-mediated disorders. Platelet factor 4 (PF4) is the key protein involved. It is the basis for many diagnostic tests for HIT and is used for in vitro studies and in mouse models on the pathogenesis of HIT. Purified PF4 is known to easily form aggregates, which can cause artifacts in experiments. The impact of storage buffer, storage period, lyophilization, and temperature on the size of PF4 and PF4/heparin (H) complexes was assessed by dynamic light scattering (DLS), while enzyme immunoassay (EIA) was used to test the binding of anti-PF4/H antibodies (aPF4/H Abs) to PF4/H complexes. PF4 size was more stable in Hank’s balanced salt solution (HBSS) compared to phosphate-buffered saline …", "num_citations": "3\n", "authors": ["126"]}
{"title": "Blending Quizlet and Edmodo for designing English vocabulary practices: An experimental study\n", "abstract": " In ESL learning, successful English vocabulary learning is a vital part of acquiring English. However, the current teaching and learning English vocabulary in University of Information and Communication Technology gained little success due to the traditional face-to-face instruction model and some limitations related to large class size, time constraints, students’ demotivation and ability. In this experimental study, we presents meticulously the process to design the vocabulary lessons on Quizlet and vocabulary reading practices on Edmodo website, and then experiment these vocabulary learning activities on the experimental group. The result collected from pre-test and post-test reveals that there is a significant improvement in vocabulary knowledge in experimental group in comparison with the control one. This study is a useful source of reference for those keen on applying ICT for vocabulary teaching and learning in particular and in English education in general.", "num_citations": "3\n", "authors": ["126"]}
{"title": "Affect of uncertainty avoidance on venture capital investing activities in Asian countries\n", "abstract": " This research aims to use country–level uncertainty avoidance degree to explain the variation of venture capital investing activities across different Asian countries. The analysis of venture capital activity done for 11 Asian countries in period from 2003 to 2012 shows that country-level uncertainty avoidance degree have a significant negative impact on venture capital activity. Specifically, countries with higher degree of uncertainty avoidance degree, has a less developed venture capital market (a smaller-sized market with smaller venture capital deals).", "num_citations": "3\n", "authors": ["126"]}
{"title": "Constraints to Market Participation in Agriculture in Viet Nam\n", "abstract": " It is well known that Vietnam has achieved impressive success in agricultural commercialisation, in particular in relation to rice and also cash crops. This paper draws on evidence from the Vietnam Access to Resources Household Surveys in 12 provinces in 2006, 2008 and 2010, and looks at the extent to which households are engaged in selling in agriculture, looking separately at rice and cash crops. Significant numbers of households still do not sell, or only occasionally sell rice, but this varies significantly by province; in addition poorer households are also those that sell less. Small land size is an important factor, but other factors are also important including land restrictions (which encourage cash cropping), extension, presence of local market facilities, and membership of farmers or women's groups.", "num_citations": "3\n", "authors": ["126"]}
{"title": "Apply Grey Relational Analysis to Determine the Key Factors that Influence Vietnamese Inflation.\n", "abstract": " Inflation of different levels has impacts on economy development in different extents. High level inflation can cause the reduction in all respects of the economy. Vietnam has been facing inflation in recent years. The expected inflation rate of Vietnam is over 10% in 2008. Although the inflation rate is not too much high, it has been affecting Vietnamese economy development as well as Vietnamese people's living standard. The inflation degree can be expressed by CPI. Causes of the inflation originate from inside or outside of Vietnam economy or both are non-answer questions. Determining exactly key factors that bring about inflation is very important, thence, pointing out the solution method. This investigation employed Grey Relational Analysis to objectively determine the most relational economic factors of Vietnamese CPI. Such analysis can offset the defects that subjectively determine the factors when searching …", "num_citations": "3\n", "authors": ["126"]}
{"title": "Hypermedia in education\n", "abstract": " Hypermedia in education — Monash University Skip to main navigation Skip to search Skip to main content Monash University Logo Help & FAQ Home Profiles Research Units Equipment Projects Research Output Prizes Activities Press / Media Hypermedia in education Thuy-Linh SW Nguyen, Jan Newmarch, John Baird Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Overview Original language English Title of host publication VACETS Technical International Conference Place of Publication California USA Publisher Vietnamese Association for Computing Pages 1 - 10 Number of pages 10 Publication status Published - 1997 Event Vacets Technical International Conference - San Jose, California USA Duration: 1 Jan 1997 → … Conference Conference Vacets Technical International Conference City California USA Period 1/01/97 → … Cite this APA , .…", "num_citations": "3\n", "authors": ["126"]}
{"title": "Surgical treatment of congenital cystic dilation of the biliary tract.\n", "abstract": " Cystic dilation of the biliary tract in 38 Vietnamese children is reported. Most had symptoms and signs of cholangitis and biliary obstruction. The surgical management is discussed, and for choledochal cyst resection of the cyst with hepaticojejunostomy Roux-en-Y is recommended. Postoperative cholangitis occurred in 16% of the children. The overall mortality was 18% after a median follow-up time of 28 months. Cystic dilation of the biliary tract is suggested to be a congenital entity, resulting from two pathogenetic factors--an unexplained structural anomaly of the biliary duct wall and an abnormality of the choledochopancreatic junction. A new classification is proposed, based on previous reports and the present study: A1) choledochal cyst, A2) choledochal diverticulum, A3) choledochocele, B) biliary cyst of the main hepatic ducts, C) intrahepatic and extrahepatic cyst, and D) Caroli's disease (intrahepatic biliary cysts).", "num_citations": "3\n", "authors": ["126"]}
{"title": "Cytotoxic phenolic compounds from fruit glandular trichomes of Macaranga tanarius\n", "abstract": " A new flavonoid, macatanarin D (1), together with five known stilbenes (2-6), was isolated from fruit glandular trichomes of Macaranga tanarius. Their structures were elucidated on the basis of spectroscopic methods and through comparison with data reported in the literature. All isolated compounds were evaluated for their cytotoxic activities against KB and MCF-7 cell lines. Compounds 3, 4, and 5 showed the strongest activities against both cell lines with IC50 values in the range of 0.03–0.12 μM, and compound 2 only showed a significant cytotoxicity against KB cell line (IC50 = 0.26 μM) and a moderate cytotoxicity against MCF-7 (IC50 = 10.4 μM). Compounds 1 and 6 showed weak cytotoxic activities against KB cell line with IC50 values of 29.3 and 24.7 μM, respectively.", "num_citations": "2\n", "authors": ["126"]}
{"title": "Cigarette affordability and impacts of 2014 tax reform in Vietnam\n", "abstract": " Background:Vietnam revised the Excise Tax Law in 2014 leading to an increase of the cigarette excise tax rate from 65% of ex-factory price to 70% in January 2016, and to 75% in January 2019. The government plans to make other excise tax reforms in 2018. This study explored the impacts of 2014 Excise Tax Law on cigarette retail price, affordability, sale volumes and government tax revenue for 2016 and expected impacts for 2017-2019.Methods:Relative Income Price (RIP) was used to measure the affordability of cigarettes. The retail price of three popular brands, between 1998 and 2016, was collected from government secondary data.", "num_citations": "2\n", "authors": ["126"]}
{"title": "Overpopulation, Racial Degeneracy and Birth Control in French Colonial Vietnam\n", "abstract": " This article examines the Vietnamese writings on overpopulation, racial decline and birth control that were published in Vietnamese journals in the 1930s. Navigating between different demographic and sexual discourses, both local and global, Vietnamese birth control activists took a stern and critical look at the compounding problems of overpopulation and racial decline in colonial Tonkin. They identified the Confucian pro-natalist traditions with its laissez-faire approach towards reproduction and childrearing as the roots of the overpopulation crisis in Tonkin. Rejecting the French solution of demographic balancing while stressing the linkages between reproduction and national standing, Vietnamese birth control activists called for cultural changes in the customs of marriage and family building, and a stricter surveillance over procreative and sexual behaviors. In the context of French surveillance and censorship …", "num_citations": "2\n", "authors": ["126"]}
{"title": "Evaluating the systematic position of Ehretia asperula Zoll. & Moritzi based on ITS1, matK and trnL-trnF DNA sequences\n", "abstract": " Ehretia asperula, popular as a medicinal herb that has potential on cancer treatment, has a limited research about its phylogeny relationships. With many innovative advancements in molecular biology, it is more easy and reliable to identify the taxonomic position of a species by molecular markers-DNA barcode. In this study, we used three different markers, ITS1, trnL-trnF, and matK, to evaluate E. asperula's systematic position. Based on ITS1 sequence, E. asperula belongs to clade Ehretia I and is a close relative of E. resinosa. Moreover, ITS1 was suggested to use as a suitable DNA barcode in order to identify E. asperula.", "num_citations": "2\n", "authors": ["126"]}
{"title": "Clinical Plasma Medicine\n", "abstract": " Article history: Received 4 October 2012 Accepted 24 December 2012 Available online 16 February 2013", "num_citations": "2\n", "authors": ["126"]}
{"title": "Synthesis and Biological Evaluation of Febrifugine Analogues\n", "abstract": " A series of febrifugine analogues were designed and synthesized. Antimalarial activity evaluation of the synthetic compounds indicated that these derivatives had a strong inhibition against both chloroquine-sensitive and -resistant Plasmodium falciparum parasites. Many of them were found to be more active than febrifugine hydrochloride. The tested analogues had also a significant cytotoxicity against four cancer cell lines (KB, MCF7, LU1 and HepG2). Among the synthetic analogues, two compounds 17b and 17h displayed a moderate cytotoxicity while they exhibited a remarkable antimalarial activity.", "num_citations": "2\n", "authors": ["126"]}
{"title": "Orally administered DAV131, a formulated activated charcoal, inhibits establishment of intestinal colonization by beta-lactamine resistant Klebsiella pneumoniae in mice treated …\n", "abstract": " Resistance to third generation cephalosporins (C3G) is rising dramatically worldwide in Enterobacteriaceae. It is now a major public health concern and new measures are required 1-2. Resistance may result from selection of resistant mutants or from horizontal transfer of resistance genes encoding products destroying or inactivating antibiotics. The link between antibiotic exposure and emergence of resistance is well demonstrated 3. Resistance in pathogenic bacteria can result from two different sequences. The first, known since the early use of antibiotics, is the selection of resistant mutants at a site of infection during treatment 4. More often however, antibiotics select mechanisms of resistance through selection pressure on commensal flora of treated individuals 5. This occurs in all treated patients, irrespective of the type or even of the existence of an actual infection6. Commensal ecosystems are very stable and …", "num_citations": "2\n", "authors": ["126"]}
{"title": "Mainstreaming Health Insurance for People with Disabilities: Lessons from Vietnam\n", "abstract": " Many low-and middle-income countries have introduced public health insurance schemes to increase access to health care and provide financial protection against the costs of care for disadvantaged groups. Using national health household survey data from Vietnam and an appropriate two-part model, this paper examines the targeting effectiveness of public health insurance schemes and their impact on health care utilization for persons with disabilities. Results suggest that current community-based targeting methods are not effective, and that insurance mechanisms are an unsatisfactory buffer for inpatient-related costs to which persons with disabilities are prone. A higher level of disability targeting is recommended, both in terms of eligibility and benefits", "num_citations": "2\n", "authors": ["126"]}
{"title": "Accessible formal verification for safety-critical hardware design\n", "abstract": " Formal verification is a vital aspect of safety-critical system design, not only to ensure proper functionality but also to provide formal proof of that functionality to regulators and oversight committees. However, few hardware engineers are trained in formal techniques, creating a dangerous disconnect between specification/design and verification. This paper presents ongoing work on the development of a technique to make formal verification of hardware designs more accessible to specification and design engineers by creating a library that abstracts the formal domain into a verified set of basic operations and components. Therefore, engineers can specify systems using these operations and components, which are automatically converted into the formal domain by the library for verification and design generation. Existing designs (including intellectual property (IP) blocks) can be verified against specifications …", "num_citations": "2\n", "authors": ["126"]}
{"title": "UMR 2: A Better and More Realistic Scheduling Algorithm for the Grid\n", "abstract": " Numerous studies have been targeting the problem of scheduling divisible workloads in distributed computing environments. The UMR (Uniform Multi-Round) algorithm stands out from all others by being the first close-form optimal scheduling algorithm. However, present algorithms, including the UMR, do not pay due attention to optimizing the set of workers that get selected to participate in processing workload chunks. In addition to the absence of a good resource selection policy, the UMR relies primarily in its computation on the CPU speed and overlooks the role of other key parameters such as network bandwidth. In this paper, we propose an extended version of UMR, called UMR2, that overcomes these limitations and adopts a worker selection policy that aims at minimizing the makespan. We, theoretically and experimentally, show that UMR2 is superior to UMR, specifically in a WAN computing platform such …", "num_citations": "2\n", "authors": ["126"]}
{"title": "An object-oriented data model for evolvable Web systems\n", "abstract": " This section develops an algorithm for the Life Design evolutionary process described previously. For the purpose of this algorithm, we only model class genes and life forms as object identities, not their structure. So let Old be a set of names (object identities) and let GId be a set of gene names (gene identities).", "num_citations": "2\n", "authors": ["126"]}
{"title": "Machine learning (ML) and quantitative phase imaging scoring of epithelial and mesenchymal features of cancer cells\n", "abstract": " ML is useful for classifying cells based on features derived from quantitative phase images. However, classifying cells with graded phenotype remains challenging. To address this, several ML algorithms were trained and validated on reconstructed phase images.", "num_citations": "1\n", "authors": ["126"]}
{"title": "RF Energy Harvesting using Cross-couple Rectifier and DTMOS on SOTB with Phase Effect of Paired RF Inputs\n", "abstract": " This paper presents the design and evaluations of a cross-couple rectifier (CCR) with floating sub-circuit using Dynamic Threshold MOSFET (DTMOS) for RF energy harvesting. The circuit is fabricated using 65nm SOTB CMOS technology. Measurement result shows that circuit exceeds 1000 mV DC output at -9 dBm input power. The study also indicates the effect of phase difference between the two RF input signals on the DC output voltage in CMOS CCR. The DC output voltage depends on the phase of the two RF input signals and reaches maximum at the phase difference of the two RF signals is π. Experimental results demonstrate that the output voltage changes from 950 mV to -100 mV when the phase difference varies from π to 0 at an RF input power of -10 dBm. When the rectifier receives RF signal from the environment at an input power of -35 dBm, the DC output voltage changes from 130 mV to -12 mV …", "num_citations": "1\n", "authors": ["126"]}
{"title": "Smoking susceptibility among school children aged 13–15 in Vietnam: a multilevel analysis of data from Global Youth Tobacco Use data (GYTS) 2014\n", "abstract": " BackgroundWe aim to assess the prevalence of smoking susceptibility and identify factors at school and individual levels that are associated with individual susceptibility to smoking among school children aged 13–15 years in Vietnam.MethodsData came from Vietnam Global Youth Tobacco Survey (GYTS) 2014. A 2-stage sample design and proportion to population size (PPS) technique was employed to select a representative sample of study participants. Independent variables include both individual and school-level characteristics. Both descriptive and inferential statistics were performed. Logistic multilevel models were constructed to analyze the association between independent variables and smoking susceptibility status.ResultsThe overall percentage of smoking susceptibility status was 11.2%. Boys were more susceptible to smoking than girls. The odds of smoking susceptibility were higher among students who had both of their parents smoking (adjusted odds ratio [aOR], 3.91; 95% confidence interval [CI], 2.17–7.05) and those whose best friends smoked (aOR, 4.79; 95% CI, 2.40–9.54). Knowledge on harmfulness of smoking was associated with lower odds of smoking susceptibility. Among school level factors, the schools with greater access to anti-smoking media were associated with lower susceptibility to smoking among their students (coefficient=− 0.028; standard error= 0.011, P< 0.05).ConclusionThis study highlights the importance of contextual exposure to anti-smoking media among the children. With the availability of multilevel modeling as an analytical tool, further refinements in the understanding of contextual effects on …", "num_citations": "1\n", "authors": ["126"]}
{"title": "Biological control of groundnut stem rot by Bacillus sp. strain S20D12\n", "abstract": " Stem rot caused by the soil-borne pathogen Scleoritum rolfsii Sacc. is a destructive disease which seriously causes yield loss of groundnut in Vietnam. In this study, the antagonistic bacterial strain Bacillus sp. S20D12, which was isolated from stem-base of groundnut plant in Vietnam, was evaluated for fungal inhibition in vitro and biological control of groundnut stem rot under nethouse and farmer field conditions. Results of the study showed that cell free filtrate of Bacillus sp. significantly inhibited S. rolfsii in potato dextrose broth. The Bacillus sp. S20D12 significantly reduced stem rot under nethouse condition. Subsequent field trials conducted in central Vietnam over 2 consecutive years showed that Bacillus sp. S20D12 significantly reduced stem rot disease, significantly and consistently enhanced pod yield with increases ranging from 18.3–21.2% relative to the untreated control plants.", "num_citations": "1\n", "authors": ["126"]}
{"title": "Isolation and characterization of a DREB homolog gene from a local drought-tolerant maize cultivar\n", "abstract": " Clarifying the genetic background of the drought-tolerance trait is a crucial task that may help to improve plant performance under stress by a genetic engineering approach. dehydration-responsive element-binding protein (dREB) is a transcription factor family which modulates many stress-responsive genes. In this study, we isolated a DrEB homolog gene named ZmDrEBtv from Zea mays var. Tevang-1. Using bioinformatic tools, a number of Indels and SNPs in ZmDrEBtv sequence different from the reference accession were identified. In addition, based on deduced protein sequence similarity, ZmdREBtv was assigned to transcription factor dREB2 class as featured by a conserved dNa binding domain–aP2. The ZmDrEBtv construct under thecontrol of the rd29a promoter was transformed into a drought-sensitive maize plant, K7 line. The transgenic plants were assessed with reference to molecular and phenotypic characteristics related to the drought-tolenrance trait. The results proved that the maize plants carrying ZmDrEBtv gene showed enhanced tolerance and better performance to the water-deficit environment at different stages, compared to the wild-type plants.", "num_citations": "1\n", "authors": ["126"]}
{"title": "Vietnamese Traditional Medicine: A Social History, by C. Michele Thompson\n", "abstract": " Michele Thompson’s Vietnamese Traditional Medicine provides a fascinating transnational history of Vietnamese medicine through its understanding and preventive treatment of smallpox in the first half of the nineteenth century. In this book, Thompson questions the larger scholarly assumption that Vietnamese medical traditions derived most of its theoretical underpinnings and many of its therapeutic practices from Chinese medicine during and after the nine-hundred-year Chinese occupation of northern Vietnam (p. 13). Using smallpox it as a case study, the book seeks to investigate why Chinese and Vietnamese medical practitioners came up with different conclusions on the same disease. Drawing from medical texts written in both Chinese and the Vietnamese Nôm script as well as French colonial records, Thompson walks the readers through the history of smallpox as an epidemic in both Vietnam and China …", "num_citations": "1\n", "authors": ["126"]}
{"title": "Some considerations for the construction of software capable of life-like evolution\n", "abstract": " Some considerations for the construction of software capable of life-like evolution : Research Bank Skip to content Australian Catholic University Home About People Research areas Latest Additions Search Some considerations for the construction of software capable of life-like evolution Conference item Nguyen, Thuy-Linh and Kitjongthawonkul, Somkiat. (2010) Some considerations for the construction of software capable of life-like evolution. In MB Nunes, Isaias, P., Powell, P. and Rodrigues, L.& Barbosa,P (Ed.). USA: IADIS Press. pp. 307 - 314 Authors Nguyen, Thuy-Linh and Kitjongthawonkul, Somkiat Keywords Artificial Life;--Information Processing Services (incl. Data Entry and Capture);--Electronic Information Storage and Retrieval Services;--Software Engineering;--Web Technologies (excl. Web Search) Year 2010 Journal Proceedings of the IADIS International Conference Information Systems 2010 IADIS - , …", "num_citations": "1\n", "authors": ["126"]}
{"title": "Facteurs prédictifs du syndrome de choc lié à la dengue chez les enfants à l’hôpital des enfants malades n\n", "abstract": " Le syndrome de choc lié à la dengue (SCD) est une complication sévère rencontrée chez l’enfant atteint de dengue hémorragique en Asie du Sud-Est. Une étude cas-témoin a été réalisée à l’hôpital des enfants malades n 1 (Hô-Chi-Minh ville, Vietnam) de mai à juillet 2005, pour identifier les facteurs associés à la survenue de SCD chez les patients âgés de 1 à 15 ans et atteints de dengue hémorragique.Quarante cas et quarante témoins ont été inclus. Les facteurs associés au SCD étaient l’appartenance au groupe d’âge de 7 à 12 et la notion de réinfection par le virus de la dengue. La notion de vaccination contre l’encéphalite japonaise B n’était pas significativement associée au SCD. Les signes cliniques prédictifs du SCD regroupaient la présence d’une douleur abdominale, d’une hépatomégalie, d’un état léthargique, d’un refroidissement des extrémités. Les signes biologiques associés étaient une acmé du taux d’hématocrite≥ 50% et une numération des plaquettes≤ 75 000 éléments/mm3.", "num_citations": "1\n", "authors": ["126"]}
{"title": "GEOGRAPHICAL INFORMATION SYSTEM AND REMOTE SENSING DATA BASED FOR MAPPING ECOLOGICAL UNIT IN MANAGEMENT OF COASTAL SANDY SOIL IN CENTRAL VIETNAM\n", "abstract": " The sandy soil areas span 337.768 ha, distributed across 1000 km along central Vietnam coastline (from Quang Binh to Binh Thuan provinces). 45 individual ecological units were identified and grouped into 10 main coastal sandy soil areas. The 10 main areas were further classified into 3 major eco-zones. This was achieved with the assistance of Landsat (TM) data captured in 2004, and ground-truth surveys and the integration of 29 data themes describing natural, economic and social factors, and coastal sandy soil use models.", "num_citations": "1\n", "authors": ["126"]}
{"title": "LifeWeb: An Evolvable Web\n", "abstract": " LifeWeb: An Evolvable Web — Monash University Skip to main navigation Skip to search Skip to main content Monash University Logo Help & FAQ Home Profiles Research Units Equipment Projects Research Output Prizes Activities Press / Media LifeWeb: An Evolvable Web Thuy-Linh Nguyen Research output: Book/Report › Book › Other Overview Original language English Place of Publication Clayton Vic Australia Publisher Monash University Number of pages 21 Publication status Published - 2000 Cite this APA Author BIBTEX Harvard Standard RIS Vancouver Nguyen, TL. (2000). LifeWeb: An Evolvable Web. Monash University. Nguyen, Thuy-Linh. / LifeWeb: An Evolvable Web. Clayton Vic Australia : Monash University, 2000. 21 p. Nguyen, TL 2000, LifeWeb: An Evolvable Web. Monash University, Clayton Vic Australia. LifeWeb: An Evolvable Web. / Nguyen, Thuy-Linh. Clayton Vic Australia : Monash University/…", "num_citations": "1\n", "authors": ["126"]}
{"title": "Life Web: An Object-Oriented Model for the Web\n", "abstract": " Life Web: An Object-Oriented Model for the Web — Monash University Skip to main navigation Skip to search Skip to main content Monash University Logo Help & FAQ Home Profiles Research Units Equipment Projects Research Output Prizes Activities Press / Media Life Web: An Object-Oriented Model for the Web Thuy Linh Nguyen, Xindong Wu, Sayed Sajeev Research output: Chapter in Book/Report/Conference proceeding › Conference Paper › Research › peer-review Overview Original language English Title of host publication World Multiconference on Systemics, Cybernetics and Informatics Proceedings Place of Publication Orlando USA Publisher Int. Institute of Informatics and Systemics Pages 301 - 308 Number of pages 8 ISBN (Print) 980 07 5080 0 Publication status Published - 1998 Event 4th Int. Conf. on Information Systems, Analysis and Synthesis - Orlando USA, Orlando USA Duration: 1 Jan 1998 → . …", "num_citations": "1\n", "authors": ["126"]}
{"title": "The clinical efficacy of and tolerance for lariam (mefloquine) in tropical malaria in the south of the Socialist Republic of Vietnam\n", "abstract": " The study was performed in the area of distribution of tropical malaria resistant to 4-aminoquinolines (Vietnam) on 30 patients receiving lariam (mefloquine). The results were compared to the standard therapy with quinine and fansidar. They indicate a high efficacy of and a good tolerance to the drug tested. The use of lariam leads to a more rapid (as compared to the standard treatment) elimination of parasitemia and complete eradication of the disease relapses. The findings make it possible to recommend lariam for the prevention and treatment of tropical malaria.", "num_citations": "1\n", "authors": ["126"]}
{"title": "A study on CDIO-based STEAM program design and implementation\n", "abstract": " STEAM (Science, Technology, Engineering, Art, and Mathematics) education has gained popularity in schools, colleges, universities across the United States, Europe, parts of Asia, recently raised in Vietnam. Despite its attraction and preparation for the 21st-century skills, little empirical research and good implementation exists to guide the STEAM program design process as well as effective instructional practices, and even less is known about the challenges associated with individual assessment aiming to expected learning outcomes of the modules developed in the STEAM program. This paper will present a study on the design process and implementation of a CDIO-based STEAM program. In which, the CDIO framework, standards and syllabus are embedded and aligned with the STEAM program in two aspects: in most of the stages of the continuous improvement process of program development and implementation, and in lesson syllabus structure. The research concludes with implications for educational researchers and educators to consider that it is very potential to apply CDIO principles for an integrated curriculum with a project-based method for STEAM education, especially with the CDIO-based STEAM syllabus. The initial satisfaction survey which was taken on more than a hundred students has been carried out and obtained a high score of satisfaction, revealing the suitability in both curriculum and teaching-learning activity design. The CDIO-based maker space reflects its superior advantages of supporting innovative learning environments. Therefore, good practices on CDIO implementation are recommended for further discussion …", "num_citations": "1\n", "authors": ["126"]}