{"title": "Mind as motion: Explorations in the dynamics of cognition\n", "abstract": " Mind as Motion is the first comprehensive presentation of the dynamical approach to cognition. It contains a representative sampling of original, current research on topics such as perception, motor control, speech and language, decision making, and development. Included are chapters by pioneers of the approach, as well as others applying the tools of dynamics to a wide range of new problems. Throughout, particular attention is paid to the philosophical foundations of this radical new research program. Cognitive science has traditionally been dominated by an AI-based computational paradigm in which cognition is taken to be the manipulation of internal symbols. Even as the potential of this paradigm continues to be explored, limitations are becoming increasingly apparent. Researchers throughout cognitive science have been casting around for alternative theoretical frameworks. Out of this flux has emerged the dynamical concept, according to which cognitive processes are the behavior of nonlinear dynamical systems and are best studied using the mathematics of dynamical modeling and dynamical systems theory. Mind as Motion provides a conceptual and historical overview of the dynamical approach, a tutorial introduction to dynamics for cognitive scientists, and a glossary covering the most frequently used terms. Each chapter includes an introduction by the editors, outlining its main ideas and placing it in context, and a guide to further reading. Contributors: Randall Beer, Geoffrey Bingham, Catherine Browman, Jerome Busemeyer, Claudia Carello, Fred Cummins, Jeffrey Elman, Marco Giunti, Louis Goldstein, Stephen Grossberg, Devin …", "num_citations": "1432\n", "authors": ["2092"]}
{"title": "What might cognition be, if not computation?\n", "abstract": " W hat is cognition? Contemporary orthodoxy maintains that it is computation: the mind is a special kind of computer, and cognitive processes are the rule-governed manipulation of internal symbolic representations. This broad idea has dominated the philosophy and the rhetoric of cognitive science-and even, to a large extent, its practice-ever since the field emerged from the postwar cybernetic melee. It has provided the general framework for much of the most well-developed and insightful re-search into the nature of mental operation. Yet, over the last decade or more, the computational vision has lost much of its lustre. Although work within it continues apace, a variety of difficulties and limitations have become increasingly apparent, and researchers across cognitive science and related disciplines have been casting around for other ways to understand cognitive processes. Partly as a result, there are now many …", "num_citations": "1268\n", "authors": ["2092"]}
{"title": "The dynamical hypothesis in cognitive science\n", "abstract": " According to the dominant computational approach in cognitive science, cognitive agents are digital computers; according to the alternative approach, they are dynamical systems. This target article attempts to articulate and support the dynamical hypothesis. The dynamical hypothesis has two major components: the nature hypothesis (cognitive agents are dynamical systems) and the knowledge hypothesis (cognitive agents can be understood dynamically). A wide range of objections to this hypothesis can be rebutted. The conclusion is that cognitive systems may well be dynamical systems, and only sustained empirical research in cognitive science will determine the extent to which that is true.", "num_citations": "1256\n", "authors": ["2092"]}
{"title": "It’s about time: An overview of the dynamical approach to cognition\n", "abstract": " How do we do what we do? How do we play tennis, have conversations, go shopping? At a finer grain, how do we recognize familiar objects such as bouncing balls, words, smiles, faces, jokes? Carry out actions such as returning a serve, pronouncing a word, selecting a book off the shelf? Cognitive scientists are interested in explaining how these kinds of extraordinarily sophisticated behaviors come about. They aim to describe cognition: the underlying mechanisms, states, and processes.For decades, cognitive science has been dominated by one broad approach. That approach takes cognition to be the operation of a special mental computer, located in the brain. Sensory organs deliver up to the mental computer representations of the state of its environment. The system computes a specification of an appropriate action. The body carries this action out. According to this approach, when I return a serve in tennis, what happens is roughly as follows. Light from the approaching ball strikes my retina and my brain's visual mechanisms quickly compute what is being seen (a ball) and its direction and rate of approach. This information is fed to a planning system which holds representations of my current goals (win the game, return the serve, etc.) and other background knowledge (court conditions, weaknesses of the other player, etc.). The planning system then infers what I must do: hit the ball deep into my opponent's backhand. This command is issued to the motor system. My arms and legs move as required. In its most familiar and successful applications, the computational approach makes a series of further assumptions. Representations are static …", "num_citations": "824\n", "authors": ["2092"]}
{"title": "Teaching critical thinking: Some lessons from cognitive science\n", "abstract": " This article draws six key lessons from cognitive science for teachers of critical thinking. The lessons are: acquiring expertise in critical thinking is hard; practice in critical-thinking skills themselves enhances skills; the transfer of skills must be practiced; some theoretical knowledge is required; diagramming arguments (“argument mapping”) promotes skill; and students are prone to belief preservation. The article provides some guidelines for teaching practice in light of these lessons.", "num_citations": "821\n", "authors": ["2092"]}
{"title": "Compositionality: A connectionist variation on a classical theme\n", "abstract": " Connectionism has been attacked on the grounds that it does not employ compositionally structured representations (e.g., Fodor & Pylyshyn, 1988). This article develops the response that Connectionist models can, and in fact sometimes do, employ compositionally structured representations without, thereby, simply implementing a Classical “Language of Thought.” Focusing on the mode of combination employed in constructing representations, it distinguishes concatenative compositionality, essential to the Classical approach, from a merely functional counterpart increasingly common in Connectionist research. On the basis of this distinction it is possible to demonstrate that Connectionist representations can be compositional without being Classical, and further, that Fodor and Pylyshyn's supposedly conclusive arguments in favor of the Classical approach do not in fact support that approach over the Connectionist …", "num_citations": "596\n", "authors": ["2092"]}
{"title": "Enhancing deliberation through computer supported argument visualization\n", "abstract": " As this is being written, the Governor General of Australia, Dr. Peter Hollingworth, has not resigned. Yet over the previous weeks and months he must have been thinking about it long and hard. He has been under intense pressure from various quarters, based on allegations that in previous positions of leadership he had not handled some sexual abuse incidents appropriately. In pondering what he should do, he must have been considering the many and varied arguments on both sides of the case. He must, in short, have been deliberating about his future.", "num_citations": "198\n", "authors": ["2092"]}
{"title": "The rationale for Rationale™\n", "abstract": " Complex reasoning and argumentation are central to legal practice. Software-supported argument mapping may be able to help lawyers reason and argue more effectively. This article describes Rationale™, a generic argument mapping software package, and reviews some evidence that using it can help improve reasoning, i.e. make people smarter. It then explores three different explanations for this potential benefit: usability, complementation and semi-formality. First, argument mapping software can be more usable for reasoning activities than traditional methods because it can inherit the wisdom gained through decades of research and experience into usability, can exploit a wider range of representational resources, and is designed specifically to support reasoning activities. Second, such software works by complementing the strengths and weaknesses of our natural or inbuilt cognitive capacities. Third, it …", "num_citations": "176\n", "authors": ["2092"]}
{"title": "How to improve critical thinking using educational technology\n", "abstract": " Critical thinking is highly valued but difficult to teach effectively. The Reason! project at the University of Melbourne has developed the Reason! Able software as part of a general method aimed at enhancing critical thinking skills. Students using Reason! Able appear to make dramatic gains. This paper describes the challenge involved, the theoretical basis of the Reason! project, the Reason! Able software, and results of intensive evaluation of the Reason! approach.", "num_citations": "172\n", "authors": ["2092"]}
{"title": "Cultivating expertise in informal reasoning.\n", "abstract": " People generally develop some degree of competence in general informal reasoning and argument skills, but how do they go beyond this to attain higher expertise? Ericsson has proposed that high-level expertise in a variety of domains is cultivated through a specific type of practice, referred to as\" deliberate practice.\" Applying this frame-work yields the empirical hypothesis that high-level expertise in informal reasoning is the outcome of extensive, deliberate practice. This paper reports results from two studies evaluating the hypothesis. University student participants completed 12 weeks of deliberate practice in informal reasoning. Quantity of practice was recorded by computer, and additionally assessed via self-report. The hypothesis was supported: Students in both studies showed a large improvement, and practice, as measured by computer, was related to amount of improvement in informal reasoning. These …", "num_citations": "170\n", "authors": ["2092"]}
{"title": "Argument mapping with reason! able\n", "abstract": " Reason! Able is educational software supporting argument mapping. This essay introduces computer-supported argument mapping as an alternative to prose as a medium for reasoning and argumentation, reviews the main features of Reason! Able, and discusses the use of Reason! Able in teaching reasoning skills.", "num_citations": "154\n", "authors": ["2092"]}
{"title": "What is the\" D\" in\" PDP\"? A survey of the concept of distribution\n", "abstract": " Suppose there were such a thing as the\" computational theory of mind\"(CTM); and suppose that, for whatever reason, you were dissatisfied with it. You may well be tempted to ask: What would an alternative look like? Could there be an alternative that was even remotely plausible? Is connectionism in the business of developing such an alternative?ABSTRACT", "num_citations": "144\n", "authors": ["2092"]}
{"title": "Wooden iron? Husserlian phenomenology meets cognitive science\n", "abstract": " [1] Consciousness comes in many forms. One of these is so-called time consciousness. This is not consciousness of Time itself, nor is it simply consciousness that takes place in time. Rather, to put the point somewhat cryptically, it is consciousness of temporal objects as temporal. A temporal object is anything that exists in time, or endures. Rocks, chairs, conversations, tides, tunes, and empires all endure. In this respect they contrast with, for example, numbers. Time consciousness is a special kind of awareness of temporal objects-an awareness of them as enduring. It is the difference between my thinking abstractly of Nirvana's\" Smells Like Teen Spirit,\" and my hearing it play on the radio. In the latter case, though not the former, the song actually unfolds in time and my awareness is an awareness of it as happening in time. The situation is essentially similar (though less dramatic) in the case of temporal objects such as chairs, which do not depend on change in time to be what they are.[2] A moment's reflection can generate an interesting puzzle about time consciousness. Both the song and my awareness exist in time. They are like parallel tracks in the same time frame. However, as we standardly think about time, only the present and what is in it actually exist; thus, only a momentary stage of the song, and a momentary stage of my awareness, actually exist at any given time. The other stages did exist, or will exist, but do not exist now. It seems plausible, then, that my awareness at this moment of the music must be an awareness of the song now, ie, of the current, momentary stage of the stage. The other stages do not exist, so how could I be aware …", "num_citations": "138\n", "authors": ["2092"]}
{"title": "On being systematically connectionist\n", "abstract": " In 1988 Fodor and Pylyshyn issued a challenge to the newly-popular connectionism: explain the systematicity of cognition without merely implementing a so-called classical architecture. Since that time quite a number of connectionist models have been put forward, either by their designers or by others, as in some measure demonstrating that the challenge can be met (eg, Pollack, 1988, 1990; Smolensky, 1990; Chalmers, 1990; Niklasson and Sharkey, 1992; Brousse, 1993). Unfortunately, it has generally been unclear whether these models actually do have this implication (see, for instance, the extensive philosophical debate in Smolensky, 1988; Fodor and McLaughlin, 1990; van Gelder, 1990, 1991; McLaughlin, 1993a, 1993b; Clark, 1993). Indeed, we know of no major supporter of classical orthodoxy who has felt compelled, by connectionist models and arguments, to concede in print that connectionists have in fact delivered a non-classical explanation of systematicity.Why has it been so unclear whether these models actually show that connectionism meets the challenge? Our view (apparently shared by Matthews,(forthcoming)) is that the most important reason has been obscurity in the concept of systematicity itself. In their 1988 paper Fodor and Pylyshyn discussed systematicity at length, but provided no succinct and precise characterization of it; at best, they gestured at the phenomenon with hints, analogies and anecdotal observations. They claimed that the systematicity argument in favor of the classical approach is a traditional one, but provided no references to previous occurrences, and as far as we can determine there is no occurrence …", "num_citations": "133\n", "authors": ["2092"]}
{"title": "Defining ‘distributed representation’\n", "abstract": " Distributed representation is at the heart of many practical and philosophical concerns inconnectionism, yet it has never been defined in a way that is both precise and comprehensive. This article defines distribution in terms of semantic superposition-many items represented by one representation as formalized within the mathematical framework of distributing transformations. A representation is distributed, roughly, when it can be described by means of a function which is a distributed transform of a function describing the items it is representing. Numerous paradigm examples ofdistributed representationfrom connectionism and elsewhere are shown to be subsumable, formally or informally, under this framework, which supports the idea that semantic superposition and distributing transformations are in fact the essence of distribution. Various advantages and implications of this ew definition are discussed …", "num_citations": "65\n", "authors": ["2092"]}
{"title": "Can connectionist models exhibit non-classical structure sensitivity?\n", "abstract": " Several connectionist models have been supplying non-classical explanations to the challenge of explaining systematicity, ie, structure sensitive processes, without merely being implementations of classical architectures. However, lately the challenge has been extended to include learning related issues. It has been claimed that when these issues are taken into account, only a restricted form of systematicity could be claimed by the connectionist models put forward so far. In this paper we investigate this issue further, and supply a model and results that satisfies even the revised challenge.ABSTRACT", "num_citations": "49\n", "authors": ["2092"]}
{"title": "Learning to reason: A Reason! Able approach\n", "abstract": " 1. BackgroundInformal reasoning is negotiating the webs of inferential dependence among sentences of a natural language. It contrasts with formal reasoning, of the kind found in mathematics, computer science, puzzles, and games such as chess. Informal reasoning involves activities such as distinguishing principal claims from the reasons or evidence provided in their support; supporting claims with reasons; evaluating the quality of reasons; challenging reasons, and rebutting challenges; and evaluating the overall case for a claim. Informal reasoning is closely related to informal logic (which tends to focus attention narrowly on the claim/reason relation) and argumentation (the deployment of informal reasoning in attempts to resolve disputes). Informal reasoning is a central component of critical thinking.How good are people are informal reasoning? US studies indicate that although some are quite good at it, average levels are quite poor [13, 27]. For example, in the most thorough study of this topic, Kuhn found that a majority of the population cannot reliably produce genuine evidence for their opinions, entertain counterarguments, or rebut counterarguments. I have not found comparable studies in an Australian context, but it is plausible they would give broadly similar results. This is supported by experience in teaching. For example, I gave 95 University of Melbourne undergraduates a homework exercise in which they were asked to\" analyse and evaluate the main argument\" of a particular book chapter. Almost none performed the task adequately; indeed, very few even understood what the task was.", "num_citations": "43\n", "authors": ["2092"]}
{"title": "Classicalism and cognitive architecture\n", "abstract": " This paper challenges the widely accepted claim that “classical” cognitive architectures can explain the systematicity of cognition (Fodor & Pylyshyn, 1988). There are plausible ways of rendering more precise the systematicity hypothesis (as standardly formulated) in which it is entailed by classical architectures, and other plausible ways in which it is not. Therefore, it is not a determinate issue whether systematicity is entailed, and hence explained, by classical architectures. The general argument is illustrated in a particular domain, the systematicity of deductive inference. In the case of the capacity to carry out the inference modus tollens, the systematicity hypothesis can be made precise in two ways, one entailed by classical architectures, another which is not. Further, the latter, but not the former, accurately describes the actual empirical phenomenon. Put another way, the clumps that these deductive inference …", "num_citations": "42\n", "authors": ["2092"]}
{"title": "Classical questions, radical answers: Connectionism and the structure of mental representations\n", "abstract": " The many and obvious contrasts between Connectionism and (something like) “most other work in Cognitive Science” often give rise to rather grandiose talk of scientific upheaval. Thus it is common to hear the proposal that Connectionism represents (or is the beginning of, or at least points in the general direction of) a whole new approach and perhaps even a whole new paradigm in the study of cognition, an approach which directly contests and may even be displacing (something like) the dominant symbolic view. This is an exciting prospect, especially for those philosophers and others who prefer to view such topics as artificial intelligence and cognitive psychology in terms of the grand sweep of intellectual history. Unfortunately, despite the endless tabloid observations, nobody yet seems altogether sure just what Connectionism is, in any sense going beyond the standard fare of dull details and techno …", "num_citations": "42\n", "authors": ["2092"]}
{"title": "Using argument mapping to improve critical thinking skills\n", "abstract": " The centrality of critical thinking (CT) as a goal of higher education is uncontroversial. In a recent high-profile book, Academically Adrift, Arum and Roksa report that “99 percent of college faculty say that developing students’ ability to think critically is a ‘very important’ or ‘essential’ goal of undergraduate education” (2011, 35), citing (HERI 2009).", "num_citations": "39\n", "authors": ["2092"]}
{"title": "The roles of philosophy in cognitive science\n", "abstract": " What does philosophy contribute to cognitive science? This question is addressed indirectly, by describing some of the many roles philosophers play. These include pioneer, building inspector, Zen monk, cartographer, archivist, cheerleader and gadfly. As a preparatory exercise, philosophers are characterized in terms of their primary methods: argument, conceptual analysis and historical perspective. The various roles philosophers in fact play are seen to follow naturally from this way of characterizing the philosopher.", "num_citations": "37\n", "authors": ["2092"]}
{"title": "The efficacy of undergraduate critical thinking courses: A survey in progress\n", "abstract": " Note: This report is a work-in-progress. It is presented here as a webpage for ease of distribution and updating. Please contact me with details of any studies not covered here, or to provide corrections, supplementations, or discussion. In particular, if your favorite study is not reported here, please let me know.", "num_citations": "34\n", "authors": ["2092"]}
{"title": "Distributed vs. local representation\n", "abstract": " been to define various notions of distribution in terms of represented by one and the same distributed pattern (Mur-structures of correspondence between the represented items dock 1979). For example, it is standard in feedforward and the representational resources (eg, van Gelder 1992). connectionist networks for one and the same set of synap-This approach may be misguided; the essence of this alter-tic weights to represent many associations between input native category of representation might be some other prop-and output. erty entirely. For example, Haugeland (1991) has suggested• Equipotentiality In some cases, an item is represented by", "num_citations": "34\n", "authors": ["2092"]}
{"title": "“Revisiting the dynamical hypothesis\n", "abstract": " Here are some claims about cognitive science, which, it seems to me, no sane person could deny:1. Increasingly, cognitive scientists are using dynamics to help them understand a wide range of aspects of cognition. 1 2. Dynamical systems theory and orthodox computer science are rather different disciplines; typical dynamical systems and typical digital computers are rather different kinds of things. 3. Dynamically-oriented cognitive scientists see themselves as understanding cognition very differently from their mainstream computational cousins.", "num_citations": "30\n", "authors": ["2092"]}
{"title": "Defending the dynamical hypothesis\n", "abstract": " Increasing numbers of scientists are producing dynamical models and explanations of various aspects of cognition. The central insight underlying their work is the dynamical hypothesis: cognitive agents are dynamical systems, and can be understood as such. This paper aims at philosophical articulation of the dynamical hypothesis. The hypothesis is clarified and elaborated in the process of responding to a range of standard objections raised. The conclusion is not that the dynamical hypothesis is true, but rather that it is a bold scientific conjecture, worthy of detailed empirical investigation.", "num_citations": "26\n", "authors": ["2092"]}
{"title": "Visualizing argument structure\n", "abstract": " Constructing arguments and understanding them is not easy. Visualization of argument structure has been shown to help understanding and improve critical thinking. We describe a visualization tool for understanding arguments. It utilizes a novel hi-tree based representation of the argument’s structure and provides focus based interaction techniques for visualization. We give efficient algorithms for computing these layouts.", "num_citations": "25\n", "authors": ["2092"]}
{"title": "A'Reason! able'approach to critical thinking.\n", "abstract": " The Reason! approach to critical thinking is based on the idea that practice makes perfect. The Reason! project has developed a software package called Reason!Able, which is designed to guide and scaffold students through the complex processes involved in reasoning about any topic at all. By using the software on a wide variety of problems, students develop an implicit grasp of the general concepts, procedures and skills involved in thinking critically, at least at a basic level. After a while they perform even better, even when not working in the Reason!Able practice environment. [Author abstract, ed]", "num_citations": "24\n", "authors": ["2092"]}
{"title": "Cultivating deliberation for democracy\n", "abstract": " Diamond’s Liberation Technology describes how new communication technologies can help bring about democracy, but not how they can help improve an existing democracy. One natural idea is that technologies developed specifically for improving deliberation might help improve in quantity and quality the public deliberation required for a healthy democracy. To date, this has failed to happen; deliberation technologies have not been taken up by the public to any significant degree. I suggest that this is because such technologies have taken the wrong approach, imposing too much structure on deliberative discourse. An alternative is to “cultivate” better deliberation. This approach is taken by YourView, a new kind of virtual forum, which aims to enhance democracy by providing an opportunity for citizens easily access key arguments on major issues, take a stand on those issues, and help shape the “collective wisdom”-the considered collective view. By identifying when participants exhibit “epistemic virtues,” and rewarding such behaviors, it encourages rather than imposes better-quality deliberation.", "num_citations": "22\n", "authors": ["2092"]}
{"title": "Mind as motion\n", "abstract": " T. van Gelder & Robert Port (eds.), Mind As Motion - PhilPapers Sign in | Create an account PhilPapers PhilPeople PhilArchive PhilEvents PhilJobs PhilPapers home Syntax Advanced Search Syntax Advanced Search Syntax Advanced Search Mind As Motion T. van Gelder & Robert Port (eds.) MIT Press (1995) Abstract This article has no associated abstract. (fix it) Keywords No keywords specified (fix it) Categories Dynamical Systems in Philosophy of Cognitive Science (categorize this paper) Options Edit this record Mark as duplicate Export citation Find it on Scholar Request removal from index Revision history Download options PhilArchive copy Upload a copy of this paper Check publisher's policy Papers currently archived: 52,493 External links This entry has no external links. Add one. Setup an account with your affiliations in order to access resources via your University's proxy server Configure custom proxy (…", "num_citations": "22\n", "authors": ["2092"]}
{"title": "The distinction between mind and cognition\n", "abstract": " Tim van Gelder, The distinction between mind and cognition - PhilPapers Sign in | Create an account PhilPapers PhilPeople PhilArchive PhilEvents PhilJobs PhilPapers home Syntax Advanced Search Syntax Advanced Search Syntax Advanced Search The distinction between mind and cognition Tim van Gelder In Yu-Houng H. Houng, J. Ho & YH Houng (eds.), Mind and Cognition: 1993 International Symposium. Academia Sinica (1993) Abstract This article has no associated abstract. (fix it) Keywords Cartesianism Cognition Mind Categories Embodiment and Situated Cognition in Philosophy of Cognitive Science (categorize this paper) Buy the book Find it on Amazon.com Options Edit this record Mark as duplicate Export citation Find it on Scholar Request removal from index Revision history Download options PhilArchive copy Upload a copy of this paper Check publisher's policy Papers currently archived: 59,968 …", "num_citations": "20\n", "authors": ["2092"]}
{"title": "Monism, dualism, pluralism\n", "abstract": " The traditional mind‐body debate is chronically unwell. Its problems are largely due to unwitting acceptance of four deep metaphysical assumptions. Rejecting those assumptions leads to a pluralist conception of the ontology of mind and a correspondingly complex account of the fit between mind and world.", "num_citations": "17\n", "authors": ["2092"]}
{"title": "The dynamical alternative\n", "abstract": " Introduction What is cognition? Contemporary orthodoxy maintains that it is computation: the mind is a special kind of computer, and cognitive processes are the internal manipulation of symbolic representations. This broad idea has dominated the philosophy and the rhetoric of cognitive science--and even, to a large extent, its practice—ever since the field emerged from the postwar cybernetic meleé. Many arguments have been advanced in its favor, and perhaps equally many against it. For a number of years, the situation has been one of stalemate, for generally neither computationalists nor their opponents have found each other's arguments convincing. There is no doubt, however, that for a long time computationalists maintained a strategic advan-tage, for their opponents were unable to provide an alternative conception that could match computationalism in empirical scope and theoretical well-foundedness. Computationalists could thus always fall back on what has become known as the\" what else could it be?\" argument. In recent years, however, this strategic advantage has been diminished, if not eliminated. Within cognitive science an alternative vision of the nature of cognition is emerging, a worthy challenger to computational incumbency. That alternative is not, as many have supposed, connectionism (as such), but rather the dynamical conception of cognition. In a nutshell, if cognition is not computation, it might be the behavior of dynamical systems. This chapter aims to provide an informal introduc-tion to the dynamical conception. It begins with a somewhat unusual detour, via the early industrial revolution in England, circa 1788.", "num_citations": "17\n", "authors": ["2092"]}
{"title": "Distributed representation.\n", "abstract": " Degree: Ph. D.DegreeYear: 1989Institute: University of PittsburghAn important part of the picture of mind developing with the recently resurgent connectionist paradigm in cognitive science is a radical view of mental representation. On this view, knowledge is represented in distributed form in patterns of synaptic strengths and neural activations in the brain. But what exactly is distribution? Surprisingly, this question has never been given a general and systematic answer, yet the issue is at the heart of many current debates, such as the proper characterization and relative merits of connectionist models.", "num_citations": "17\n", "authors": ["2092"]}
{"title": "Disentangling dynamics, computation, and cognition\n", "abstract": " The nature of the dynamical hypothesis in cognitive science (the DH) is further clarified in responding to various criticisms and objections raised in commentaries. Major topics addressed include the definitions of “dynamical system” and “digital computer”; the DH as Law of Qualitative Structure; the DH as an ontological claim; the multiple-realizability of dynamical models; the level at which the DH is formulated; the nature of dynamics; the role of representations in dynamical cognitive science; the falsifiability of the DH; the extent to which the DH is open; the role of temporal and implementation considerations; and the novelty or importance of the DH. The basic formulation and defense of the DH in the target article survives intact, though some refinements are recommended.", "num_citations": "16\n", "authors": ["2092"]}
{"title": "It's about time\n", "abstract": " To cite this article: Supplier update: Durable and sustainable trellis posts [online]. Australian and New Zealand Grapegrower and Winemaker, No. 633, Oct 2016: 43. Availability:< https://search. informit. com. au/documentSummary; dn= 513877158555495; res= IELHSS> ISSN: 1446-8212.[cited 12 Dec 20].", "num_citations": "16\n", "authors": ["2092"]}
{"title": "Hi-trees and their layout\n", "abstract": " We introduce hi-trees, a new visual representation for hierarchical data in which, depending on the kind of parent node, the child relationship is represented using either containment or links. We give a drawing convention for hi-trees based on the standard layered drawing convention for rooted trees, then show how to extend standard bottom-up tree layout algorithms to draw hi-trees in this convention. We also explore a number of other more compact layout styles for layout of larger hi-trees and give algorithms for computing these. Finally, we describe two applications of hi-trees: argument mapping and business decision support.", "num_citations": "15\n", "authors": ["2092"]}
{"title": "Beyond symbolic: Prolegomena to a kama-sutra of compositionality\n", "abstract": " Consider some of the obvious differences between a printed and a spoken version of the very same English sentence. Both contain the same words, but in the printed sentence they are static ink configurations, while in the utterance they are temporally extended sound patterns. In the printed case, words are combined by juxtaposition in space; in the utterance, by juxtaposition in time. The printed words are combined in a very discrete way-there is, quite literally, space between each-and all occurrences of a given word are effectively identical, whatever words happen to surround them. In the utterance, by contrast, juxtaposition is not discrete and context free; words flow into each other, and their physical shape is typically affected by their neighbors. Printed and uttered tokens of the very same sentence, then, are physically constructed or built up in quite different ways. These days, the most common technical term for building up a complex representation out of parts is composition, and so we can say that the two sentences exhibit very different kinds of compositionality, despite being syntactically and semantically identical4. This point has two very important consequences. First, compositionality itself comes in at least two, and possibly many, different kinds. Second, the very notion of compositionality can be a subject of study, quite independent of syntax and semantics. Whereas syntax and semantics focus on a language in the abstract, the study of compositionality focuses on the concrete implementations. How many kinds of compositionality are there? What are the fundamental issues? And, if our ultimate interests happen to be in cognitive science …", "num_citations": "15\n", "authors": ["2092"]}
{"title": "Reason! Able across the curriculum\n", "abstract": " The Reason! Able software helps students acquire general skills of reasoning and argument. Developed over a number of years at the University of Melbourne, the software is now widely used in schools and universities. This paper illustrates Reason! Able in use, then describes some of the underlying educational principles, results from a recent study evaluating learning in students using Reason! Able, and ways Reason! Able is being used at Melbourne Grammar School.", "num_citations": "14\n", "authors": ["2092"]}
{"title": "On being systematically connectionist\n", "abstract": " In 1988 Fodor and Pylyshyn issued a challenge to the newly-popular connectionism: explain the systematicity of cognition without merely implementing a so-called classical architecture. Since that time quite a number of connectionist models have been put forward, either by their designers or by others, as in some measure demonstrating that the challenge can be met (eg, Pollack, 1988, 1990; Smolensky, 1990; Chalmers, 1990; Niklasson and Sharkey, 1992; Brousse, 1993). Unfortu-nately, it has generally been unclear whether these models actually do have this implication (see, for instance, the extensive philosophical debate in Smolensky, 1988; Fodor and McLaughlin, 1990; van Gelder, 1990, 1991; McLaughlin, 1993a, 1993b; Clark, 1993). Indeed, we know of no major supporter of classical orthodoxy who has felt compelled, by connectionist models and argu-ments, to concede in print that connectionists have in fact delivered a non-classical explanation of systematicity", "num_citations": "13\n", "authors": ["2092"]}
{"title": "Why distributed representation is inherently non-symbolic\n", "abstract": " There are many conflicting views concerning the nature of distributed representation, its compatibility or otherwise with symbolic representation, and its importance in characterizing the nature of connectionist models and their relationship to more traditional symbolic approaches to understanding cognition. Many have simply assumed that distribution is merely an implementation issue, and that symbolic mechanisms can be designed to take advantage of the virtues of distribution if so desired. Others, meanwhile, see the use of distributed representation as marking a fundamental difference between the two approaches. One reason for this diversity of opinion is the fact that the relevant notions — especially that of distribution — are rarely adequately characterized before addressing the issues. At this level of generality, an adequate characterization is one that is sufficiently abstract to subsume most paradigm …", "num_citations": "13\n", "authors": ["2092"]}
{"title": "Using computer-assisted argument mapping to teach reasoning to students\n", "abstract": " Argument mapping is a way of diagramming the logical structure of an argument to explicitly and concisely represent reasoning. The use of argument mapping in critical thinking instruction has increased dramatically in recent decades. This paper overviews the innovation and provides a procedural approach for new teaches wanting to use argument mapping in the classroom. A brief history of argument mapping is provided at the end of this paper.", "num_citations": "12\n", "authors": ["2092"]}
{"title": "Connectionism, dynamics, and the philosophy of mind\n", "abstract": " After connectionism burst into prominence in cognitive sci-ence in mid-1980s, one of the most popular questions among philosophers of cognitive science was: what implications does it have for the philosophy of mind ‘?(See, eg, Horgan and Tienson 1991; Ramsey, Stich, and Rumelhart, 1991). Ten years later, it seems that the verdict is in. If we suppose that the term connectionism refers to some reasonably coherent research program standing as an alternative to mainstream computational cognitive science, then connectionism has no interesting implications for cognitive science. This is because there is, in fact, no such thing. There are lots of connectionist models, to be sure, but no coherent program. Much connectionist work has signiﬁcance for the philosophy of mind, but not as connectionism. The philosophical question has turned out to be the wrong one. The most signiﬁ-cant theoretical division in cognitive science is not between computationalists and connectionists. Rather, it is the related but importantly different division between computationalists and dynamicists. Both the computational and dynamical approaches to cognition do, in fact, have many interesting implications for the philosophy of mind. This paper discusses the problem with connectionism as a theoretical category, and then describes some of the most dramatic implications of the dynamical approach.", "num_citations": "12\n", "authors": ["2092"]}
{"title": "Reason: Improving informal reasoning skills\n", "abstract": " The goal of the Reason! project is to develop an effective and affordable method for improving informal reasoning. In this paper we sketch the background to the project, briefly describe the Reason! software, and report positive results from a detailed study of the first full-scale trial.", "num_citations": "11\n", "authors": ["2092"]}
{"title": "The dynamical hypothesis in cognitive science\n", "abstract": " The dynamical hypothesis is the claim that cognitive agents are dynamical systems. It stands opposed to the dominant computational hypothesis, the claim that cognitive agents are digital computers. This target article articulates the dynamical hypothesis and defends it as an open empirical alternative to the computational hypothesis. Carrying out these objectives requires extensive clarification of the conceptual terrain, with particular focus on the relation of dynamical systems to computers. Key words cognition, systems, dynamical systems, computers, computational systems, computability, modeling, time. Long Abstract The heart of the dominant computational approach in cognitive science is the hypothesis that cognitive agents are digital computers; the heart of the alternative dynamical approach is the hypothesis that cognitive agents are dynamical systems. This target article attempts to articulate the dynamical hypothesis and to defend it as an empirical alternative to the compu...", "num_citations": "11\n", "authors": ["2092"]}
{"title": "Representing aspects of language\n", "abstract": " We provide a conceptual framework for understanding similarities and di erences among various schemes of compositional representation, emphasizing problems that arise in modelling aspects of human language. We propose six abstract dimensions that suggest a space of possible compositional schemes. Temporality turns out to play a key role in de ning several of these dimensions. From studying how schemes fall into this space, it is apparent that there is no single crucial difference between AI and connectionist approaches to representation. Large regions of the space of compositional schemes remain unexplored, such as the entire class of active, dynamic models that do composition in time. These models o er the possibility of parsing real-time input into useful segments, and thus potentially into linguistic units like words and phrases.", "num_citations": "11\n", "authors": ["2092"]}
{"title": "Enhancing and augmenting human reasoning\n", "abstract": " If you ask philosophers or cognitive scientists to name the most important pioneer in the general field of computing and intelligence, they would probably pick Alan Turing, the English logician and computer scientist who arguably did more than any other single person to put disciplines such as computer science, cognitive science, and artificial intelligence on a solid theoretical footing.If you asked the same question in Silicon Valley, you might well be told of someone much less well-known in academic circles, even though his impact on the academy has been at least as pervasive. Douglas Engelbart was not a theoretician but an engineer, and his effect has been not on the ideas and debates but on the day-to-day activity of scientists and philosophers, as well as virtually every other “knowledge worker” in the ever-expanding information-based economy.", "num_citations": "10\n", "authors": ["2092"]}
{"title": "Playing Flourens to Fodor's Gall\n", "abstract": " //static.cambridge.org/content/id/urn%3Acambridge.org%3Aid%3Aarticle%3AS0140525X00033550/resource/name/firstPage-S0140525X00033550a.jpg", "num_citations": "10\n", "authors": ["2092"]}
{"title": "The role of narrative in collaborative reasoning and intelligence analysis: A case study\n", "abstract": " This paper explores the significance of narrative in collaborative reasoning using a qualitative case study of two teams of intelligence analysts who took part in an exercise using an online collaborative platform. Digital ethnographic methods were used to analyze the chat transcripts of analysts as they reasoned with evidence provided in a difficult, fictional intelligence-type problem and produced a final intelligence report. These chat transcripts provided a powerful “microscope” into the reasoning processes and interactions involved in complex, collaborative reasoning. We found that Individuals and teams used narrative to solve the kinds of complex problems organizations and intelligence agencies face daily. We observed that team members generated what we term “micro-narratives”, which provided a means for testing, assessing and weighing alternative hypotheses through mental simulation in the context of collaborative reasoning. The creation of micro-narratives assisted in the teams’ reasoning with evidence, an integral part of collaborative reasoning and intelligence analysis. Micro-narratives were combined into, and compared with, an ideal or ‘virtual’ narrative which informed the judgements the team came to in their final intelligence report. The case study developed in this paper provides evidence that narrative thought processes play an important role in complex collaborative problem-solving, reasoning with evidence and problem-solving. This is contrary to a widespread perception that narrative thinking is fundamentally distinct from formal, logical reasoning.", "num_citations": "8\n", "authors": ["2092"]}
{"title": "Enhancing our grasp of complex arguments\n", "abstract": " For the next two days, a series of individuals are going to address you, all approaching the matter of population and environment in 21st century Australia from different angles. How much of what they say will you retain? How clearly? How much overlap will there be between what any two of you retain, not to mention the whole gathering? How will you know? How much congruence will there be between the questions you ask of the different speakers? How cogent will their answers be? How will we be clear about the significance of their answers? What consensus, if any, will be generated by the conference? To what extent will such consensus be justified? How will we know? These are all questions about the cognitive process of deliberating. It is this process, not the substantive matter in hand, that I will address this morning.My main contention is simple. Using a technique called argument mapping, we can …", "num_citations": "8\n", "authors": ["2092"]}
{"title": "Beyond the mind-body problem\n", "abstract": " Wilfrid Sellars once famously described philosophy as aiming to understand how things, in the broadest possible sense of the term hang together in the broadest possible sense of the term (Sellars, 1962, p. 37). In the spirit of that suggestion, we can think of philosophy of mind as the attempt to say how minds hang together—how things fit to form minds, and how minds fit with other things. It can hardly be disputed that there are these kinds of fit; in that respect, at least, the world is a coherent place. The philosophical challenge is to understand and elucidate the nature of the fit, such as it is.The mind-body debate in contemporary Anglo-American analytic philosophy is one among many discourses addressing this challenge. The mind-body debate reduces the general problem of fit to a very specific question: What is the ontological relationship between mental entities, on the one hand, and physical entities, on the other? It has developed a range of candidate answers to this question. These are the official “isms” familiar to any student of the debate: Cartesian dualism, central-state materialism, functionalism, and so forth. A great deal of effort within the debate is taken up with detailed argument over the merits of these various positions as solutions to the problem of how mental and physical entities relate.", "num_citations": "8\n", "authors": ["2092"]}
{"title": "Systematicity and connectionist language learning\n", "abstract": " In 1988 Fodor and Pylyshyn issued a challenge to the newly-popular connectionism: explain the systematicity of cognition without merely implementing a so-called classical architecture. Since that time quite a number of connectionist models have been put forward, either by their designers or by others, as in some measure demonstrating that the challenge can be met (eg, Pollack 1988, 1990; Smolensky 1990; Chalmers 1990; Niklasson & Sharkey 1992; Brousse 1993). Unfortunately, it has generally been unclear whether these models actually do have this implication (see, for instance, the extensive philosophical debate in Smolensky 1988; Fodor & McLaughlin 1990; van Gelder 1990, 1991; McLaughlin 1993a, 1993b; Clark 1993). Indeed, we know of no major supporter of classical orthodoxy who has felt compelled, by connectionist models and arguments, to concede in print that connectionists have in fact delivered a non-classical explanation of systematicity.Why has it been so unclear whether these models actually show that connectionism meets the challenge? Our view (apparently shared by Matthews (forthcoming)) is that the most important reason has been obscurity in the concept of systematicity itself. In their 1988 paper Fodor & Pylyshyn discussed systematicity at length, but provided no succinct and precise characterization of it;", "num_citations": "8\n", "authors": ["2092"]}
{"title": "Is cognition categorization\n", "abstract": " Categorization is surely a major component of human cognition. George Lakoff was probably guilty only of mild hyperbole when he wrote:There is nothing more basic than categorization to our thought, perception, action, and speech.... Without the ability to categorize, we could not function at all, either in the physical world or in our social and intellectual lives. An understanding of how we categorize is central to any understanding of how we think and how we function, and therefore central to an understanding of what makes us human.(Lakoff, 1987, pp. 5-6).", "num_citations": "8\n", "authors": ["2092"]}
{"title": "Reason! project studies 1999–2002\n", "abstract": " The Reason! Project has been developing new methods for teaching critical thinking (CT), focusing on general informal reasoning and argument skills. The methods have been designed for use in one-semester first-year undergraduate subjects.", "num_citations": "7\n", "authors": ["2092"]}
{"title": "Modeling, connectionist and otherwise\n", "abstract": " A brief overview of the nature of modeling in science generally, and cognitive science in particular, is provided. Given some phenomenon we wish to understand, a model is another structure which is relevantly similar but better understood. Models are standardly abstract state-determined systems; these divide into two kinds, the computational and dynamical. Connectionist models are a special class of dynamical models (high-dimensional, homogeneous, neural). A useful alternative to the standard opposition between mainstream computational cognitive science and connectionism is to see cognitive scientists as either computationalist or dynamicist in general orientation. Connectionists straddle this divide even though their models are dynamical systems.", "num_citations": "6\n", "authors": ["2092"]}
{"title": "Representation and specification in the dynamics of cognition\n", "abstract": " Originally published in Contemporary Psychology: APA Review of Books, 1997, Vol 42(8), 697-699. Port and van Gelder's edited volume Mind as Motion (see record 1995-98834-000) presents evidence to bolster the view that the theory of nonlinear dynamics provides one of the most powerful tools thus far", "num_citations": "6\n", "authors": ["2092"]}
{"title": "Explorations in the dynamics of cognition\n", "abstract": " T. Van Gelder & RF Port, Explorations in the dynamics of cognition - PhilPapers Sign in | Create an account PhilPapers PhilPeople PhilArchive PhilEvents PhilJobs PhilPapers home Syntax Advanced Search Syntax Advanced Search Syntax Advanced Search Explorations in the dynamics of cognition T. Van Gelder & RF Port In T. Van Gelder & Robert Port (eds.), Mind as Motion. MIT Press (1995) Abstract This article has no associated abstract. (fix it) Keywords No keywords specified (fix it) Categories Dynamical Systems in Philosophy of Cognitive Science Embodiment and Situated Cognition in Philosophy of Cognitive Science Philosophy of Cognitive Science (categorize this paper) Buy the book Find it on Amazon.com Options Edit this record Mark as duplicate Export citation Find it on Scholar Request removal from index Revision history Download options PhilArchive copy Upload a copy of this paper Check …", "num_citations": "6\n", "authors": ["2092"]}
{"title": "Connectionism and the mind-body problem: exposing the distinction between mind and cognition\n", "abstract": " Does PDP-style connectionism imply that there are no such things as belief? Ramsey, Stich & Garson (1991) have argued that it does, but their argument depends on a particular construal of the ontology of beliefs, according to which beliefs are discrete inner causal entities. In this paper I situate their argument within the broader issues of the clash of scientific and manifest images of the world, and the ontological mind-body problem. Their way of understanding belief places them in a long tradition of philosophers who conceive of mind and cognition as the same thing, a tradition that includes people as diverse as Descartes, Fodor, Churchland, and virtually all current cognitive scientists and cognitive neuroscientists. An alternative perspective on the nature of belief was championed by Ryle and is currently exemplified by Dennett's neo-instrumentalism. I argue that PDP-style connectionism, rather than …", "num_citations": "6\n", "authors": ["2092"]}
{"title": "SWARM: Cultivating evidence-based reasoning\n", "abstract": " Smartly assembled Wiki-style ARgument Marshalling (SWARM) is an online platform supporting evidence-based reasoning. It is based on three design principles: cultivating user engagement, exploiting natural expertise, and supporting rich collaboration. This paper provides a brief system description and full explanation of the design principles and major attributes.", "num_citations": "5\n", "authors": ["2092"]}
{"title": "Augmenting expert elicitation with structured visual deliberation\n", "abstract": " Policy decisions frequently depend on quantitative judgements made by domain experts. The quality of those judgements depends in turn on the nature of the procedures used to obtain them. Procedures designed for this task are known as expert elicitation. This article explores how expert elicitation can be enhanced by supporting the deliberations of expert groups with diagrammatic methods for displaying the structure of those deliberations. It describes an elicitation exercise in which a team from the Defence Science and Technology Group estimated rates of loss of an aircraft that might be acquired for the Australian Defence Force. A structured visual deliberation method, dialogue mapping, was used to facilitate the discussions of the panel of experts in between two rounds of estimations in a Delphi‐type elicitation process. The enhanced elicitation approach worked well for the attrition estimation project, and a …", "num_citations": "5\n", "authors": ["2092"]}
{"title": "Critical thinking on the web\n", "abstract": " BackgroundThese days, online resources are a component of, or supplement to, almost every subject. There is a vast array of online resources available on the web, but they suffer from two problems:", "num_citations": "5\n", "authors": ["2092"]}
{"title": "Penicillin for the Mind?: Reason, Education and Cognitive Science\n", "abstract": " We face a crisis of reason. Average levels of reasoning ability are dismal; powerful forces are working against any improvement; and current educational strategies are failing to correct the problem. All this is happening at a time when reasoning skills are becoming more important than ever before.In the pages that follow I will add substance to these claims. More significantly, I will argue for a particular response. Dealing with the crisis will require educational innovation. Useful innovations will be obtained only through the application of insights from cognitive science as they bear on reasoning and learning. Given the economic and technological conditions of the near future, we must incorporate these insights into information technology. In short, insofar as we take the crisis of reason seriously, we must use cognitive science in the development of computer tools for aiding the acquisition of reasoning skills.", "num_citations": "5\n", "authors": ["2092"]}
{"title": "Cognitive architecture: what choice do we have?\n", "abstract": " Centrally located in some of the most fiercely contested terrain in the philosophy of cognitive science are questions of the general form of human cognitive architecture. Mainstream orthodoxy, of course, holds that the human mind is some kind of computer (Haugeland, 1978); the task of cognitive science is simply to work out, in more detail, what kind of computer it is, and in particular what its functional architecture is like (Pylyshyn, 1984). Although a wide variety of considerations favor the socalled classical approach, ranging from abstract philosophical arguments to the empirical virtues of particular cognitive models, there is also a wide variety of difficulties. However, the existence of these difficulties has failed to persuade many to abandon the computational model, and one important reason is the perceived lack of decent alternatives. In what follows, rather than try to describe any specific conception of cognitive architecture that might compete with the classical one, I will briefly sketch some of the terrain so as to reveal some of the great amount of room that there actually is for alternative conceptions. In a recent well-known description and defense of the heart of so-called\" classical\" cognitive architectures, it was maintained that mental representations must be symbolic in the sense that they have a combinatorial syntax and compositional semantics, and that mental processes must be structuresensitive in the sense that they are defined over that combinatorial structure (Fodor & Pylyshyn, 1988). These requirements do not in themselves amount to an actual specification of cognitive architecture, Pylyshyn has", "num_citations": "5\n", "authors": ["2092"]}
{"title": "Improving Analytic Reasoning via Crowdsourcing and Structured Analytic Techniques\n", "abstract": " How might analytic reasoning in intelligence reports be substantially improved? One conjecture is that this can be achieved through a combination of crowdsourcing and structured analytic techniques (SATs). To explore this conjecture, we developed a new crowdsourcing platform supporting groups in collaborative reasoning and intelligence report drafting using a novel SAT we call “Contending Analyses.” In this paper we present findings from a large study designed to assess whether groups of professional analysts working on the platform produce better-reasoned reports than those analysts produce when using methods and tools normally used in their organizations. Secondary questions were whether professional analysts working on the platform produce better reasoning than the general public working on the platform; and how usable the platform is. Our main finding is a large effect size (Cohen’s d = 1.37) in …", "num_citations": "4\n", "authors": ["2092"]}
{"title": "Being there: putting brain, body and world together again\n", "abstract": " A great deal of philosophy of mind in the modern era has been driven by an intense aversion to Cartesian dualism. In the 1950s, materialists claimed to have succeeded once and for all in exorcising the Cartesian ghost by identifying the mind with the brain. In subsequent decades, cognitive science put scientific meat on this metaphysical skeleton by explicating mental processes as digital computation implemented in the brain's hardware. The fundamental message of Andy Clark's latest book is that this orthodox materialist-computationalist framework seriously misrepresents the nature of mind. Ironically, this is because it has failed to make a sufficiently clean break with Cartesianism. The old mind-body opposition, of ontological substances, is recapitulated in a new opposition between the mental, on one hand, and the body and world, on the other. The mind is the inner realm of pure reason, while the body and …", "num_citations": "4\n", "authors": ["2092"]}
{"title": "Connectionism and Language Processing\n", "abstract": " A survey of the field of connectionist work on language reveals a somewhat daunting variety of architectures, formalisms and models. Partly this diversity just reflects the breadth of the domain: language processing embraces everything from phoneme recognition to such areas as parsing, sentence disambiguation, story understanding, and speech generation. Human language processing is a vast complex of distinguishable capacities, and connectionism has been busily chipping away at any aspect that seems to lend itself to neural processing. However, the diversity of connectionist efforts also reflects some real theoretical differences over what kinds of mechanisms one needs, in principle, to be able to generate plausible models and hence adequate explanations. It is an increasingly common observation that, at one end of the connectionist spectrum, there are those who feel that no serious account of …", "num_citations": "4\n", "authors": ["2092"]}
{"title": "Contending analyses: A new model of collaboration for intelligence analysis\n", "abstract": " This paper introduces \"contending analyses\" (CA), an approach to collaborative analysis and report generation with potential utility in intelligence work. In simplest terms contending analyses involves members of an analyst group drafting and refining several different analyses of an intelligence problem, with the group selecting the most promising to be developed into its collective report. Thus, the alternative analyses can be seen \"contending\" for selection. We contrast CA with one \"standard\" model of collaboration widely used in intelligence, based on circulating Word documents. CA has been implemented in SWARM, a new platform for collaborative intelligence work. CA has similarities to various existing practices and to some standard structured analytical techniques, but it is sufficiently different to warrant being described as a new collaborative model. The paper concludes by considering three major challenges …", "num_citations": "3\n", "authors": ["2092"]}
{"title": "Pursuing Fundamental Advances in Human Reasoning\n", "abstract": " The IARPA CREATE program’s aim to produce “fundamental advances” in human reasoning may provide a new sufficiency test for AGI and insights for the evaluation of AGI performance. The approach of one CREATE program team, the SWARM Project, is outlined.", "num_citations": "3\n", "authors": ["2092"]}
{"title": "Enhancing deliberation through computer supported argument visualization. In Visualizing Argumentation; Software tools for collaborative and educational sense-making\n", "abstract": " CiteSeerX — Enhancing deliberation through computer supported argument visualization. In Visualizing Argumentation; Software tools for collaborative and educational sense-making Documents Authors Tables Log in Sign up MetaCart DMCA Donate CiteSeerX logo Documents: Advanced Search Include Citations Authors: Advanced Search Include Citations Tables: DMCA Enhancing deliberation through computer supported argument visualization. In Visualizing Argumentation; Software tools for collaborative and educational sense-making (2003) Cached Download as a PDF Download Links [www.philosophy.unimelb.edu.au] [esdi.us] Save to List Add to Collection Correct Errors Monitor Changes by Tim Van Gelder Venue: Software Tools for Collaborative and Educational Sense-Making Citations: 29 - 0 self Summary Citations Active Bibliography Co-citation Clustered Documents Version History Share Facebook …", "num_citations": "3\n", "authors": ["2092"]}
{"title": "Bait and switch? Real time, ersatz time, and dynamical models\n", "abstract": " A defense of the Dynamical Hypothesis against the charge that one of its major supports, the argument from time, is rotten.", "num_citations": "3\n", "authors": ["2092"]}
{"title": "Critical thinking in physiology: A Reason!-able approach\n", "abstract": " To help improve their critical thinking skills, undergraduate science students used a new software package, Reason!, to assist them identify and evaluate arguments. At the outset students could not reliably identify and evaluate the reasoning in a short scientific text. Pre-and post-testing revealed a small but significant improvement in reasoning.", "num_citations": "3\n", "authors": ["2092"]}
{"title": "Compositionality and Dynamics in Neural Network Representations\n", "abstract": " This paper considers a problem that arises at the intersection of three very broad ideas. They are (1) that higher cognition needs compositionally structured representations;(2) that cognition is essentially a dynamic phenomenon; and (3) that neural networks provide the best modeling environment for the study of cognition. Each of these ideas is quite appealing, though for independent reasons. If they are all true, then, together, they pose an inevitable problem: from the perspective of dynamics, can we understand how neural networks can handle compositionally structured representations? That is, there must be, within neural network modeling, a thoroughly dynamical way of implementing compositionally structured representations. What will these representations look like? The claim that higher cognition demands compositionally structured representations is a key ingredient of mainstream orthodoxy in cognitive …", "num_citations": "3\n", "authors": ["2092"]}
{"title": "A Survey of the Concept of Distribution\n", "abstract": " Suppose there were such a thing as the “computational theory of mind”(CTM); and suppose that, for whatever reason, you were dissatisfied with it. You may well be tempted to ask: What would an alternative look like ‘? Could there be an alternative that was even remotely plausible? Is connectionism in the business of developing such an alternative?With issues such as these in vogue recently, considerable attention has been given to the preparatory task of succinctly characterizing some version of CTM to which the desired alternative can stand opposed. One point of universal consensus has been that an essential feature of CTM is the use of symbolic representations. Any theory failing to employ such representations automatically falls outside the broad CTM umbrella. This suggests an obvious approach to the questions just raised. Assuming that any remotely plausible theory of mind must be based on …", "num_citations": "3\n", "authors": ["2092"]}
{"title": "The Wise Delinquency of Decision-makers\n", "abstract": " So what’s wrong? Why do these methods not “fit” so many decision challenges? First and perhaps most obviously, in interesting “real world” problems, not every consideration can be reduced to a number or rating. Suppose, like the young man in Sartre’s “Existentialism is a Humanism”, I am wondering whether to go and fight against the Nazis with the Free French Forces, or stay to care for my mother who would otherwise be wholly alone. To neglect my mother is obviously wrong, but how wrong? What score does it get on the “filial duty” criterion? At some fundamental level, breaking the problem down like this seems obtuse, perhaps even obscene. Second, even in cases where it might make sense to assign ratings, the ratings can be matters for debate. A massive fiscal stimulus should, among other things, promote employment. A particular stimulus package is claimed to be very good on this score. But is it really …", "num_citations": "2\n", "authors": ["2092"]}
{"title": "Critical thinking: Some lessons learned\n", "abstract": " Critical thinking (CT) is one of education's most valued graduated, guided, scaffolded, and there should be lots of outcomes, but it is also very difficult to achieve. A recent..", "num_citations": "2\n", "authors": ["2092"]}
{"title": "Into the deep blue yonder\n", "abstract": " Thousands of times every day, humans pit their wits against machines. Most of the time they lose. Arcade games, bridge programs, chess machines: the phenomenon is so familiar we no longer notice it. We have grown accustomed to being outclassed by electronic gadgets in many activities we find intellectually demanding.", "num_citations": "2\n", "authors": ["2092"]}
{"title": "Computers and computation in cognitive science\n", "abstract": " Digital computers play a special role in cognitive science—they may actually be instances of the phenomenon they are being used to model. This paper surveys some of the main issues involved in understanding the relationship between digital computers and cognition. It sketches the role of digital computers within orthodox computational cognitive science, in the light of a recently emerging alternative approach based around dynamical systems.", "num_citations": "2\n", "authors": ["2092"]}
{"title": "Cognitive science\n", "abstract": " OGNITIVE science is the most eclectic of disciplines, and until recently it has been held together by the computational metaphor--the belief that cognition is computation. This belief is now under attack, and mainstream cognitive science fears that without this unifying assumption the field will fall apart. If this happens, we will at least have discovered that La Mettrie's vision in the eighteenth century of L'Hornme Machine (Man A Machine) is false, and the stage will be set for asking what kind of creatures we really are.But I do not think that the field will fall apart. For one thing, there is too much interdisciplinary research in cognitive science for this to happen, even if it does lose its central metaphor. For another, the conceptual canvass is too rich for such a simplistic outcome. The computational metaphor is under attack and this is forcing us to ask questions, not only about cognition, but about computation itself. Until …", "num_citations": "2\n", "authors": ["2092"]}
{"title": "Its about time\n", "abstract": " Rachel Steer balances vineyard, office and winery work, along with all the big responsibilities of her own young family. Daniel Whyntie tracked down the Chapel Hill viticulturist to find out more about the early stages of her career in the industry.", "num_citations": "2\n", "authors": ["2092"]}
{"title": "Can connectionist models exhibit non-classical structure sensitivity?\n", "abstract": " Department of Computer Science Philosophy Program, Research School of Social Sciences University of Skövde, S-54128, SWEDEN Australian National University, Canberra ACT 0200", "num_citations": "2\n", "authors": ["2092"]}
{"title": "Representation in connectionist models\n", "abstract": " T. van Gelder, Representation in connectionist models - PhilPapers Sign in | Create an account PhilPapers PhilPeople PhilArchive PhilEvents PhilJobs PhilPapers home Syntax Advanced Search Syntax Advanced Search Syntax Advanced Search Representation in connectionist models T. van Gelder In William Ramsey, Stephen P. Stich & DM Rumelhart (eds.), Philosophy and Connectionist Theory. Lawrence Erlbaum (1991) Abstract This article has no associated abstract. (fix it) Keywords No keywords specified (fix it) Categories Connectionism and Neural Networks in Philosophy of Cognitive Science (categorize this paper) Buy the book Find it on Amazon.com Options Edit this record Mark as duplicate Export citation Find it on Scholar Request removal from index Revision history Download options PhilArchive copy Upload a copy of this paper Check publisher's policy Papers currently archived: 59,338 External …", "num_citations": "2\n", "authors": ["2092"]}
{"title": "Studies in Critical Thinking\n", "abstract": " Critical thinking deserves both imaginative teaching and serious theoretical attention. Studies in Critical Thinking assembles an all-star cast to serve both.", "num_citations": "1\n", "authors": ["2092"]}
{"title": "What makes a team successful\n", "abstract": " The SWARM project is part of CREATE, a multi-year program launched by IARPA to develop and test online systems to improve collaborative analysis of ‘intelligence-style’problems. SWARM supports a novel approach in which people share different takes on a problem and then select and further develop the most promising ones. SWARM was tested in the ‘2018 Challenge’, a crowd-sourcing exercise in which 24 online teams tackled four difficult problems. In this paper we investigate user roles, team dynamics and their relation to performance. We find that successful teams create an interactive, supportive, resourceful and large enough environment in which the author of the final report can thrive in a very active role. Less successful teams on the other hand fail to build up the necessary support and exchange, leaving the final report author to struggle in an isolated role. The SWARM project gives an excellent opportunity to study user roles and team structures in the context of crowd-sourced intelligence-style reasoning. Based on the results we give design recommendations to improve performance.", "num_citations": "1\n", "authors": ["2092"]}
{"title": "Beyond the mind-body problem\n", "abstract": " Timothy van Gelder, Beyond the mind-body problem - PhilPapers Sign in | Create an account PhilPapers PhilPeople PhilArchive PhilEvents PhilJobs PhilPapers home Syntax Advanced Search Syntax Advanced Search Syntax Advanced Search Beyond the mind-body problem Timothy van Gelder In Christina E. Erneling (ed.), The Mind as a Scientific Object: Between Brain and Culture. Oxford University Press (2004) Abstract This article has no associated abstract. (fix it) Keywords Body Materialism Metaphysics Science Kim, J Categories Consciousness and Materialism in Philosophy of Mind Metaphysics of Mind, Misc in Philosophy of Mind Mind-Body Problem, General in Philosophy of Mind (categorize this paper) Reprint years 2005 Buy the book Find it on Amazon.com Options Edit this record Mark as duplicate Export citation Find it on Scholar Request removal from index Revision history Download options …", "num_citations": "1\n", "authors": ["2092"]}
{"title": "\" Heads I win, tails you lose\": A Foray Into the Psychology of Philosophy\n", "abstract": " One of the classic papers of Australian feminist philosophy is G. Lloyd's\" The Man of Reason\"(Lloyd, 1979). The main concern of this paper is the alleged maleness of the Man of Reason, ie, the thesis that our philosophical tradition in some deep way associates the concepts rational and male. Lloyd claims that her main goal is to bring this\" undoubted\" thesis\" into clearer focus\"(p. 18), and indeed she makes no strenuous effort to demonstrate that the to-be-clarified thesis is actually true. There are however a few places where she advances material she seems to be taking as some kind of evidence that the Man of Reason is male. One is on the second page, where she quotes from Augustine:And finally we see man, made in your image and likeness, ruling over all the irrational animals for the very reason that he was made in your image and resembles you, that is because he has the power of reason and understanding. And just as in man's soul there are two forces; on which is dominant because it deliberates and one which obeys because it is subject to such guidance, in the same way in the physical sense, woman has been made for man. In her mind and her rational intelligence she has a nature the equal of man's, but in sex she is physically subject to him in the same way as our natural impulses need to be subjected to the reasoning power of the mind, in order that the actions to which they lead may be inspired by the principles of good conduct.", "num_citations": "1\n", "authors": ["2092"]}
{"title": "Defending the dynamic hypothesis\n", "abstract": " Cognitive science has always been dominated by the idea that cognition is _computational _in a rather strong and clear sense. Within the mainstream approach, cognitive agents are taken to be what are variously known as _physical symbol_ _systems, digital computers_, _syntactic engines_, or_ symbol manipulators_. Cognitive operations are taken to consist in the shuffling of symbol tokens according to strict rules (programs). Models of cognition are themselves digital computers, implemented on general purpose electronic machines. The basic mathematical framework for understanding cognition is the theory of discrete computation, and the core theoretical tools for developing and understanding models of cognition are those of computer science", "num_citations": "1\n", "authors": ["2092"]}