{"title": "An Australasian study of reading and comprehension skills in novice programmers, using the Bloom and SOLO taxonomies\n", "abstract": " In this paper we report on a multi-institutional investigation into the reading and comprehension skills of novice programmers. This work extends previous studies (Lister 2004, McCracken 2001) by developing a question set within two key pedagogical frameworks: the Bloom and SOLO taxonomies. From this framework of analysis some interesting emergent patterns relating the cognitive level of the questions to student performance have been identified. © 2006, Australian Computer Society, Inc.", "num_citations": "270\n", "authors": ["1550"]}
{"title": "Resources for instructors of capstone courses in computing\n", "abstract": " Most computing programs now have some form of integrative or capstone course in which students undertake a significant project under supervision. There are many different models for such courses and conducting these courses is a complex task. This report is intended to assist instructors of capstone courses, particularly those new to the model of teaching and learning inherent in the capstone course. This paper discusses important issues that must be addressed when conducting capstone courses. These issues are addressed through a series of questions, with answers reflecting the way that different institutions have chosen to handle them, and commentary on the impact of these different choices. These questions include: Goals of the Course; Characteristics of Projects; Project Deliverables; Sponsors; Teams; Prerequisites and Preparation; Grading and Assessment; Administration and Supervision; and …", "num_citations": "149\n", "authors": ["1550"]}
{"title": "Engineering education research in practice: Evolving use of open ended group projects as a pedagogical strategy for developing skills in global collaboration\n", "abstract": " Globalization presents engineering educators with new challenges as they face the need for graduates who can function comfortably in an increasingly distributed team context which crosses country and cultural boundaries. Scaffolding learners to acquire professional attributes which transcend the solely technical places stress on traditional curriculum models. This paper analyses an Open Ended Group Project Framework (OEGP) situated in an action research program applied within the IT in Society course at Uppsala University. The approach results in conscious evolution of the course as an integral element of its design. It enables flexible planned educational change informed by a combination of learning theories and stakeholder input. In this paper we discuss the role of the research program in addressing the educational challenges we faced assisting students to develop global collaboration skills. The implications of combining this course with one at a partner institution in the USA and developing a global collaboration are also addressed. The paper concludes by summarizing the benefits of adopting an integrated action research and OEGP framework to support flexible course delivery in a global professional engineering context.", "num_citations": "103\n", "authors": ["1550"]}
{"title": "Research perspectives on the objects-early debate\n", "abstract": " In March 2004, SIGCSE members contributed to a mailing list discussion on the question of whether programming should be taught objects first or imperative first. We analyse that discussion, exploring how the CS community debates the issue and whether contributors' positions are supported by the research literature on novice programmers. We applied four distinct research methods to the discussion: cognitive science, rhetorical analysis in the critical tradition, phenomenography and biography. We identify the cognitive claims made in the email discussion and find there is not a consensus in the research literature as to whether the objects first approach or the imperative approach is harder to learn. From the rhetorical analysis, we find that the discussion was not so much a debate between OO-first versus imperative-first, but instead was more for and against OO-first. Our phenomenographic analysis identified and …", "num_citations": "89\n", "authors": ["1550"]}
{"title": "An introduction to program comprehension for computer science educators\n", "abstract": " The area of program comprehension comprises a vast body of literature, with numerous conflicting models having been proposed. Models are typically grounded in experimental studies mostly involving experienced programmers. The question of how to relate this material to the teaching and learning of programming for novices has proven challenging for many researchers. In this critical review from a computer science educational perspective, the authors compare and contrast the way in which different models conceptualize program comprehension. This provides new insights into learning issues such as content, sequence, learning obstacles, effective learning tasks and teaching methods, as well as into the assessment of learning", "num_citations": "87\n", "authors": ["1550"]}
{"title": "Naturally occurring data as research instrument: analyzing examination responses to study the novice programmer\n", "abstract": " In New Zealand and Australia, the BRACElet project has been investigating students' acquisition of programming skills in introductory programming courses. The project has explored students' skills in basic syntax, tracing code, understanding code, and writing code, seeking to establish the relationships between these skills. This ITiCSE working group report presents the most recent step in the BRACElet project, which includes replication of earlier analysis using a far broader pool of naturally occurring data, refinement of the SOLO taxonomy in code-explaining questions, extension of the taxonomy to code-writing questions, extension of some earlier studies on students' 'doodling' while answering exam questions, and exploration of a further theoretical basis for work that until now has been primarily empirical.", "num_citations": "77\n", "authors": ["1550"]}
{"title": "A framework for enhancing the social good in computing education: a values approach\n", "abstract": " This paper addresses two interrelated problems currently confronting computer science education, motivating students while simultaneously providing them with the skills they'll need to solve complex interconnected problems. We describe a framework for motivating computer science students by adding the context of social good to introductory computing assignments. Adding the context in this manner also goes some way to addressing the need for graduates to have skills, attributes and behaviours appropriate to contributing to social good outcomes. Accompanying this, we provide 14 concrete examples of introductory computing projects that convey and reinforce computing's social relevance and potential for positive societal impact.", "num_citations": "74\n", "authors": ["1550"]}
{"title": "Historical perspectives on the computing curriculum (report of the ITiCSE'97 working group on historical perspectives in computing education)\n", "abstract": " The working group members identified and evaluated the status and trends of the computing curriculum. Historical facts and research findings were used to delineate the negative and positive aspects of an innovation. The members of the working group engaged in a pedagogic dialog on the topics researched. They focused their thinking toward the curricular issues and arrived at a consensus toward each issue. The working group achieved its goal to produce a document that would serve as a starting point for a discussion or project that includes innovations in the computing curriculum.", "num_citations": "45\n", "authors": ["1550"]}
{"title": "Salient elements in novice solutions to code writing problems\n", "abstract": " This paper presents an approach to the evaluation of novice programmers' solutions to code writing problems. The first step was the development a framework comprised of the salient elements, or programming constructs, used in a set of student solutions to three typical code writing assessment problems. This framework was then refined to provide a code quality factor framework that was compared with an analysis using the SOLO taxonomy. We found that combining our framework with the SOLO taxonomy helped to define the SOLO categories and provided an improved approach to applying the principles of SOLO to code writing problems.", "num_citations": "44\n", "authors": ["1550"]}
{"title": "Reliably classifying novice programmer exam responses using the SOLO taxonomy\n", "abstract": " Past papers of the BRACElet project have described an approach to teaching and assessing students where the students are presented with short pieces of code, and are instructed to explain, in plain English, what the code does. The student responses to these types of questions can be analysed according to the SOLO taxonomy. Some students display an understanding of the code as a single, functional whole, while other students cannot âsee the forest for the treesâ . However, classifying student responses into the taxonomy is not always straightforward. This paper analyses the reliability of the SOLO taxonomy as a means of categorising student responses. The paper derives an augmented set of SOLO categories for application to the programming domain, and proposes a set of guidelines for researchers to use.", "num_citations": "44\n", "authors": ["1550"]}
{"title": "Multi-institutional, multi-national studies in CSEd research: Some design considerations and trade-offs\n", "abstract": " One indication of the maturation of Computer Science Education as a research-based discipline is the recent emergence of several large-scale studies spanning multiple institutions. This paper examines a\" family\" of these multi-institutional, multi-national studies, detailing core elements and points of difference in both study design and the organization of the research team, and highlighting the costs and benefits associated with the different approaches.", "num_citations": "44\n", "authors": ["1550"]}
{"title": "Exploring programming assessment instruments: A classification scheme for examination questions\n", "abstract": " This paper describes the development of a classification scheme that can be used to investigate the characteristics of introductory programming examinations. We describe the process of developing the scheme, explain its categories, and present a taste of the results of a pilot analysis of a set of CS1 exam papers. This study is part of a project that aims to investigate the nature and composition of formal examination instruments used in the summative assessment of introductory programming students, and the pedagogical intentions of the educators who construct these instruments.", "num_citations": "42\n", "authors": ["1550"]}
{"title": "The teaching of novice computer programmers: bringing the scholarly-research approach to Australia\n", "abstract": " BRACElet is a multi-institutional multi-national research study of how novice programmers comprehend and write computer programs. This paper reviews the first action research cycle of the BRACElet project and, in the process, charts a path for the upcoming second cycle. The project remains close to educational practice, with much of the data being either data collected directly from exams sat by novices, or data from think-out-loud protocols where the task undertaken by a novice or an expert is modelled on an exam question. The first action research cycle analysed data in terms of the SOLO taxonomy. From think-aloud responses, the authors found that educators tended to manifest a SOLO relational response on small reading problems, whereas students tended to manifest a multistructural response. Furthermore, those students who manifested a relational response tended to do better overall in the exam than students who manifested a multistructural response. The second action research cycle will explore the relationship between the ability to read code and the ability to write code. Apart from reporting on the BRACElet project itself, this paper serves as an invitation for institutions and individuals to join the second action research cycle of the BRACElet project.", "num_citations": "39\n", "authors": ["1550"]}
{"title": "Motivational patterns in virtual team collaboration\n", "abstract": " This paper reviews experiences from a research project into international collaborative learning, involving trials between virtual teams of students at Auckland University of Technology (AUT) and Uppsala University (UU) in Sweden. In this research-linked model of teaching, several issues have arisen, associated with motivating students to participate in a research project as an integral element of their learning. The literature on student motivation is briefly reviewed and related to observed student motivation over a two-year period of collaborative trials. Identifiable patterns of behaviour have emerged, for which some underlying causes can be discerned. While findings at this stage can be considered tentative in this complex environment, nonetheless we believe some light is shed on the process of motivation for such a model of learning. The paper concludes by outlining our proposed modifications to enhance student motivation in forthcoming collaborative trials.", "num_citations": "36\n", "authors": ["1550"]}
{"title": "How difficult are exams? A framework for assessing the complexity of introductory programming exams\n", "abstract": " Student performance on examinations is influenced by the level of difficulty of the questions. It seems reasonable to propose therefore that assessment of the difficulty of exam questions could be used to gauge the level of skills and knowledge expected at the end of a course. This paper reports the results of a study investigating the difficulty of exam questions using a subjective assessment of difficulty and a purpose-built exam question complexity classification scheme. The scheme, devised for exams in introductory programming courses, assesses the complexity of each question using six measures: external domain references, explicitness, linguistic complexity, conceptual complexity, length of code involved in the question and/or answer, and intellectual complexity (Bloom level). We apply the scheme to 20 introductory programming exam papers from five countries, and find substantial variation across the exams for all measures. Most exams include a mix of questions of low, medium, and high difficulty, although seven of the 20 have no questions of high difficulty. All of the complexity measures correlate with assessment of difficulty, indicating that the difficulty of an exam question relates to each of these more specific measures. We discuss the implications of these findings for the development of measures to assess learning standards in programming courses.", "num_citations": "34\n", "authors": ["1550"]}
{"title": "Critical enquiry in computer science education\n", "abstract": " Critical enquiry is a term for a school of somewhat controversial research methods. Although very rarely used in the computer science (CS) field, it is a rather more common research approach in other disciplines, especially in education and various fields of social science research. Yet in the computer science discipline, the core methods of research offer a rather limited repertoire for the inherently transdisciplinary endeavour of CS education research. To support this different range of research topics and goals it is necessary to extend the traditional repertoire by borrowing methods from other disciplines. Critical enquiry represents one alternative family of methods, which can be used to support different forms of enquiry in CS education research.", "num_citations": "31\n", "authors": ["1550"]}
{"title": "Developing offshore wind farm siting criteria by using an international Delphi method\n", "abstract": " Previous research on offshore wind farm (OWF) siting has been dominated by studies centred on energy resources and profitability, human activities and acceptance. Recently, studies on environmental impacts of OWFs have emerged. Few studies have been carried out to discuss the issues comprehensively. This study develops a set of comprehensive OWF siting criteria; including the profitability, social, security and environmental considerations. It solicits expert opinions from academia and industry through an international Delphi method. Contrary to the typical consensus seeking in Delphi studies, it focuses on understanding the dissensus through a comprehensive discussion. We find that profitability and social considerations are the most commonly agreed siting criteria among the experts whereas environmental and security criteria receive less agreement. As OWFs move further offshore, we are concerned …", "num_citations": "30\n", "authors": ["1550"]}
{"title": "Documentation and agile methods: striking a balance\n", "abstract": " Tony Clear have written previously about the need for students to develop discrimination as part of their preparation for professional practice during their undergraduate capstone courses. But nowhere is this need for discrimination more problematic than in the area of software documentation. Perhaps the only consolation is that professional developers are equally challenged. Yet in migrating students from the set of beliefs and practices that may have worked for them in programming-in-the-small, to those required for programming-in-the-large, sound documentation practices are critical to effective development and delivery of a professional product. Belief systems related to documentation are intriguing. Within the software development community we see what Highsmith [1] has termed the\" battle lines between proponents of agile software development ecosystems (ASDE's) and rigorous system development …", "num_citations": "29\n", "authors": ["1550"]}
{"title": "Information technology fluency in practice\n", "abstract": " Recent work has stressed the importance of fluency with information technology (IT) in the modern world. This report presents a set of context profiles that detail courses and programs to realize increased IT fluency across a small sampling of academic institutions. The goal is to provide some representative examples for other schools interested in addressing the issues associated with IT fluency.", "num_citations": "29\n", "authors": ["1550"]}
{"title": "Students analyzing their collaboration in an international Open Ended Group Project\n", "abstract": " This paper is based on a course run in the fall semester 2008 with students from Sweden and USA where they addressed an open problem in the health sector. Part of the course for the students has been to review how the collaboration actually worked and with special attention to the collaboration platform used. The background to the course and process of choosing the collaborative platform, ClockingIT, is presented. The students' review was informed by engineering education research in order to understand the role of the technology used in their collaboration. The methods adopted by the students are outlined including their application of the Collaborative Technology Fit framework as introduced in the thesis by Clear. The role of 'ClockingIT', its effectiveness in supporting collaboration and the effectiveness of 'students as researchers' as a method for insightful reflection are presented.", "num_citations": "28\n", "authors": ["1550"]}
{"title": "Surely we must learn to read before we learn to write!\n", "abstract": " While analysing students’ marks in some comparable code-reading and code-writing questions on a beginners’ programming exam, we observed that the weaker students appeared to be able to write code with markedly more success than they could read it. Examination of a second data set from a different institution failed to confirm the observation, and appropriate statistical analysis failed to find any evidence for the conclusion. We speculate on the reasons for the lack of a firm finding, and consider what we might need to do next in order to more thoroughly explore the possibility of a relationship between the codereading and code-writing abilities of novice programming students..", "num_citations": "27\n", "authors": ["1550"]}
{"title": "A cyber-icebreaker for an effective virtual group?\n", "abstract": " This paper reports selected results from the most recent of a series of international collaborative trials between students at Auckland University of Technology and Uppsala University. The trials require students to work together in virtual groups, comprising students from each institution, to perform a common task. The topic of this paper is how to form and sustain more effective virtual groups. In this trial a cyber-icebreaker task has been introduced and its contribution to group effectiveness is explored. Some conclusions are drawn pinpointing the strengths and weaknesses of this trial design, and some insights into effective design of electronic collaborative learning groups are gained.", "num_citations": "27\n", "authors": ["1550"]}
{"title": "A course in collaborative computing: collaborative learning and research with a global perspective\n", "abstract": " Recent calls for a new discipline of'web science'have proposed extending computer science to incorporate the social dimensions of computing. In this paper we outline a Masters course in Collaborative Computing, which employs a combination of collaborative pedagogy, collaborative technologies, and a corpus of research data from Global Virtual Teams to blend the technology and the social dimensions within a research linked course context. We review the effectiveness of this model of learning and the conduct of the course over the five years since its inception.", "num_citations": "25\n", "authors": ["1550"]}
{"title": "Dimensions of distance learning for computer education\n", "abstract": " In this paper, we explore what is variously termed distance learning (DL), asynchronous, online, Web-based, and Web-supported learning in terms of how it can support and perhaps even improve the fields of education involving computing. We use the term distributed education to cover all mentioned topics. We describe how the incorporation of these methods can benefit computer education. These benefits arise because of the nature of the computing field, the profound requirements for students to understand concepts and acquire skills as opposed to mere exposure to facts, and our assessment that distributed education has the potential to address many of the challenges identified. We conclude with suggestions on the incorporation of distributed methods into computer education.", "num_citations": "25\n", "authors": ["1550"]}
{"title": "Introductory programming: examining the exams\n", "abstract": " This paper describes a classification scheme that can be used to investigate the characteristics of introductory programming examinations. The scheme itself is described and its categories explained. We describe in detail the process of determining the level of agreement among classifiers, that is, the inter-rater reliability of the scheme, and we report the results of applying the classification scheme to 20 introductory programming examinations. We find that introductory programming examinations vary greatly in the coverage of topics, question styles, skill required to answer questions and the level of difficulty of questions. This study is part of a project that aims to investigate the nature and composition of formal examination instruments used in the summative assessment of introductory programming students, and the pedagogical intentions of the educators who construct these instruments..", "num_citations": "24\n", "authors": ["1550"]}
{"title": "Report on the final BRACElet workshop: Auckland University of Technology, September 2010\n", "abstract": " This paper reports on the thirteenth and final BRACElet workshop. In this paper we provide a brief retrospective review of the workshops and the findings that have resulted from this multi-institutional multinational investigation into the teaching and learning of novice programmers. Subsequently we report on the work undertaken during the final workshop and then discuss future avenues for research that have evolved as a result of the BRACElet project.", "num_citations": "24\n", "authors": ["1550"]}
{"title": "Spreadsheets as collaborative technologies in global requirements change management\n", "abstract": " Globally distributed stakeholders employ various collaborative technologies to manage requirements. While these technologies facilitate requirements collaboration, their perceived purpose, use and structure co-evolve over time. In this paper we report the results of a study in two global software development settings involving client-vendor relationships. In both cases we noted that the vendor and client sites appropriated spreadsheet technology in quite specific ways, for use locally and for bridging across sites. Yet these spreadsheet files were embedded within different collaborative technologies. Through close study we note how team members practices co-evolved with the spreadsheet artefacts involved in the process of managing requirements change. We note how through a single spreadsheet cell, we may see a world as in William Blake's \"grain of sand\". Through the evolution of a spreadsheet's structure or …", "num_citations": "21\n", "authors": ["1550"]}
{"title": "Supporting the work of global virtual teams: The role of technology-use mediation\n", "abstract": " This thesis investigates the role of technology-use mediation in supporting the work of global virtual teams.   The work is set in the context of a longer term action research programme into collaborative computing and global virtual teams, initiated by Auckland University of Technology in New Zealand and Uppsala University in Sweden.  Over the period since 1998, global virtual collaborations involving teams of students from both universities have been conducted annually.  This thesis investigates the 2004 collaboration cycle, in which participants from St Louis University Missouri joined the collaboration.  This was the first triadic collaboration, and covered Northern, Southern and Western aspects of the globe while traversing three widely divergent time-zones.  In spite of the extensive experience in collaboration possessed by the coordinators at all three sites, the results of the global virtual trial were at best mixed.  This repeated experience of dissatisfaction in our global virtual collaborations, in spite of the technology being in place has been a primary motivator for this work.  Why is global virtual collaboration difficult?  What roles and activities are critical?  How can we do it better? These are not issues solely to do with the student actors in the global virtual teams, but more to do with the supporting cast, engaged in “activities which involve the shaping of other users activities of [technology] use” (Orlikowski et al., 1995, p.425).  Thus came about my interest in exploring the topic of technology-use mediation. This thesis applies a research framework adapted from DeSanctis & Poole’s “Adaptive Structuration Theory” (1994) by the author.  Initially …", "num_citations": "21\n", "authors": ["1550"]}
{"title": "Using groupware for international collaborative learning\n", "abstract": " The paper reports the lessons learned from a two year collaborative learning trial between students at Auckland University of Technology (AUT) and Uppsala University. The trials took place using a combination of email and a custom developed Lotus Notes/sup TM/ database. The first trial involved a case study in which students performed different roles in designing a software solution for an Auckland based nailcare distributor. The second trial built upon the knowledge base of the earlier trial, and required students to evaluate and rank the previous design proposals. A theoretical model developed from the group support systems literature guided some of the changes in the second trial. The software, the collaboration process and the evaluation methods evolved over the course of these trials. The challenges of creating global student communities within a short collaboration window in existing courses of study are …", "num_citations": "21\n", "authors": ["1550"]}
{"title": "Preparing the global software engineer\n", "abstract": " With a goal of preparing software engineering students for practice in today's global settings, Uppsala University has for some years run courses involving global collaboration. The \"IT in Society\" course is one such course which applies an 'Open Ended Group Project' model, in partnership with a local health sector client and global educational partners. Within each iteration of the course, students across the partnering institutions are given a brief around an open-ended problem. They work in collaboration with their client and stakeholders to investigate options and produce a report with their findings and recommendations, informed by global perspectives. The report may or may not be supported by working software prototypes. We analyze student evaluations & reflections on the course to unpack their perceptions of software engineering, the perceived relevance of a global learning experience and its role in …", "num_citations": "20\n", "authors": ["1550"]}
{"title": "Collaborative technologies in global engineering: new competencies and challenges\n", "abstract": " Educational institutions face many challenges in closing the gap between what is currently offered through academic engineering curricula and what is expected by society in general and industry in particular. There are many aspects to these challenges and here we address needs that are specific to global professionals by investigating the knowledge, skills and abilities needed for mediating and using Collaborative Technologies (CT) in an Open Ended Group Project (OEGP) within a global setting. We discuss these needs as framed by relevant theoretical frameworks for collaboration and learning (including Collaborative knowledge building and Collaborative Technology Fit), mapped using empirical data from a course setting involving global collaboration between two universities (one in the United States and one in Sweden). The paper concludes with a commentary on competencies beyond discipline specific technical skills and presents recommendations, based upon this research, for developing students’ proficiency in both mediating and using CTs in OEGP courses. These recommendations are followed by an outline of key areas for future research.", "num_citations": "20\n", "authors": ["1550"]}
{"title": "The many ways of the BRACElet project\n", "abstract": " This paper provides a retrospective snapshot of the first two years of a multi-institutional multi-national study (MIMN) in Computer Science Education called the BRACElet Project. This study has been inquiring into how novice programmers comprehend and write computer programs. The context for the study is outlined, together with details of how it has evolved and those who have participated. Some challenges encountered during the project are highlighted and pointers for the successful conduct of such a study are provided. The paper concludes by noting pitfalls to be avoided, some open research questions, and current plans for furthering the project.", "num_citations": "19\n", "authors": ["1550"]}
{"title": "Valuing computer science education research?\n", "abstract": " This paper critically enquires into the value systems which rule the activities of teaching and research. This critique is intended to demonstrate the application of critical enquiry in Computer Science Education Research and therefore uses critical theory as a method of analysis.", "num_citations": "19\n", "authors": ["1550"]}
{"title": "Research paradigms and the nature of meaning and truth\n", "abstract": " Research Paradigms and the Nature of Meaning and Truth Page 1 Research Paradigms and the Nature of Meaning and Truth Tony Clear Faculty of Business Auckland University of Technology, Private Bag 92006, Auckland 1020, New Zealand <Tony.Clear @ aut.ac.nz> C omputer science educators commonly have a strong background in mathematics, the physical sciences, and the use of quantitative methods. This very education process, the perspective of computer science as a scientific discipline and the concomitant training to value rigour and objectivity in research, create a strong bias in beliefs about the correct way to undertake research and the appropriate way to determine truth. The belief system may be evidenced in statements such as: Oh I far prefer to deal with facts, rather than all that woolly stuff. One means of classifying the computing disciplines is to think of them as secondary disciplines (in the case …", "num_citations": "19\n", "authors": ["1550"]}
{"title": "Thinking issues meeting employers expectations of devops roles: can dispositions be taught?\n", "abstract": " In the education and teacher education fields there has been much debate about where the balance of good teaching should lie, and how much the focus should be on imparting ‘content knowledge’as opposed to fostering specific ‘dispositions’ toward learning [10, 11]. In science teaching,‘essential’dispositions have been noted as,“professionalism, a passion for science and teaching, and a dedication to student learning.”[9] In mathematics education, Gresalfi and Cobb [7] argued that cultivating dispositions in discipline specific contexts can be a key strategy towards more equitable forms of pedagogy. In nursing education, Profetto-McGrath [14] has applied a set of instruments to measure the vital role of not only ‘critical thinking skills’ for practicing nurses but ‘critical thinking dispositions,’which means those acquired skills are then likely to be used in practice. This column reflects upon the critical dispositions that …", "num_citations": "18\n", "authors": ["1550"]}
{"title": "2D and 3D introductory processes in virtual groups\n", "abstract": " This paper reports upon a collaborative learning trial conducted in 2002 between students at Auckland University of Technology New Zealand and Uppsala University Sweden. The trial design included an initial phase in which virtual groups became acquainted, using different modes of cyber-icebreaker, and a subsequent phase with a common task involving group decision making-evaluating and ranking the different icebreaker experiences. The software used in the trial comprised 1) a custom developed web-based groupware database, and 2) a Java 3D application, employing configurable avatars, which could be manipulated in a virtual world. Each of these applications supported icebreaking activities intended to establish trust between virtual group members, the latter in 3D mode, and the former in 2D mode. The trial process and the software are initially outlined. The evaluation strategy, and approaches to …", "num_citations": "18\n", "authors": ["1550"]}
{"title": "E-learning: A vehicle for e-transformation or Trojan horse for enterprise?–revisiting the role of public higher education institutions\n", "abstract": " This paper urges a rather more critical view of e-learning than that taken to date. It is argued that while Information Technology may enable transformation in the ways in which learning occurs, strong forces are converging to redefine education as a commercial rather than public activity, of which e-learning is one element. Inherently different perceptions of the teaching and learning process, based upon a commercial rather than a public model, combined with a certain amount of naïve technological progressivism are challenging the role of higher education. Poor implementations based upon flawed assumptions are also likely to lead to an e-learning bust in the higher education sector, in much the same way as the dot com phenomenon has collapsed under the weight of its own hype. The case is argued for diverse and informed models of education (including e-learning approaches and partnerships) that nurture …", "num_citations": "17\n", "authors": ["1550"]}
{"title": "A collaborative learning trial between New Zealand and Sweden-using Lotus Notes Domino in teaching the concepts of human computer interaction\n", "abstract": " This paper reports the results of a collaborative learning exercise between students at Auckland Institute of Technology and Uppsala University. The exercise was conducted using both a Lotus Notes Domino™ collaborative database and electronic mail to support students working in remote groups to perform a common task. Issues concerning the logistics of such an exercise, student participation and evaluations of the process, ethical considerations and the quality of the learning process are discussed. Some conclusions are drawn concerning the value of Group Ware technology to support this form of collaborative learning, and suggestions are made for future developments.", "num_citations": "17\n", "authors": ["1550"]}
{"title": "Illustration of paradigm pluralism in computing education research\n", "abstract": " This paper argues for paradigm pluralism in computing education research. The value of mixing paradigms, and the choice of methodological eclecticism and mixed methods is explored using pragmatic knowledge claims. A research study, which focused on the design of an introductory object-oriented programming (OOP) course for undergraduate students, is introduced as an illustration of paradigm pluralism. The study demonstrates methodological eclecticism and use of mixed methods for data collection and analysis. Meaningful outcomes resulting from the choice of the research design are described. A framework that focuses on the research problem and research questions to guide research design is presented as the outcome of the study. Through the discussion and demonstration of paradigm pluralism, this paper contributes to increased awareness of theoretically anchored research in computer science..", "num_citations": "16\n", "authors": ["1550"]}
{"title": "Cooperative education in information technology\n", "abstract": " Cooperative education in information technology - Kent Academic Repository Skip to main content kent-logo Logo Login Admin Dashboards Help Simple search | Advanced search Home Browse Latest additions Policies Accessibility Statement Cooperative education in information technology Fincher, Sally and Clear, Tony and Petrova, Krassie and Hoskyn, Katharine and Birch, Roanne and Claxton, Gwyn and Wieck, Malcolm (2004) Cooperative education in information technology. In: Coll, Richard and Eames, Chris, eds. International Handbook for Cooperative Education. WACE, pp. 111-123. ISBN 0-9753564-0-2. (The full text of this publication is not currently available from this repository. You may be able to access a copy if URLs are provided) (KAR id:14163) The full text of this publication is not currently available from this repository. You may be able to access a copy if URLs are provided. (Contact us about this …", "num_citations": "16\n", "authors": ["1550"]}
{"title": "GRCM: a model for global requirements change management\n", "abstract": " [Context and motivation] In the delivery driven context of contract software production, efficient and effective requirements change management (RCM) remains a challenge for global software development (GSD). [Question/problem] New RCM models need to be devised for GSD settings, to reduce confusion and improve the efficiency of managing requirements change and the resulting impacts. [Princi-pal ideas/results] We present a model drawn from a case study which evaluated RCM practices in a GSD organization, with sites based in USA and Pakistan. [Contribution] We extend the observed practices by developing a theoretically informed process model to improve RCM efficiency and effectiveness by using a baseline requirements artifact and tool supported collaboration process.", "num_citations": "15\n", "authors": ["1550"]}
{"title": "Exploring the notion of'cultural fit'in global virtual collaborations\n", "abstract": " Working in global virtual teams (GVTs), raises a number of issues variously relating to technology, tasks and people working in their different locations and institutional contexts. Achieving alignment across these elements can be challenging. Collaborative Technologies inherently require the participants to work in collaboration and globally distributed settings can place strain on these arrangements. An added complication comes from the need to work not only across boundaries of time and place but also across cultures. This paper reports the findings from a study of a global virtual collaboration between three universities in New Zealand, Sweden and USA. It discusses the complex and multi-layered concept of 'culture' and presents a means of mapping \"cultural fit\" across a global virtual team context.", "num_citations": "15\n", "authors": ["1550"]}
{"title": "Introducing an external mentor in an international Open Ended Group Project\n", "abstract": " An International Open Ended Group Project collaboration has been running for several years and the very nature of the setting inspires constant reflection and adjustments. These are based on active involvement in education research, and especially theories of learning. Open Ended Group Projects (OEGPs) are based on students taking an active role in both choosing what to do and how to do it. This might however prove too difficult for some students and a need for scaffolding has been noted. Introduction of an external mentor is described and analyzed in this paper as is the effect of introducing relevant research frameworks, to support the project leaders in the offering of the course during the fall semester 2008. The paper reviews a pioneering use of the Collaborative Technology Fit framework. This research tool aimed to highlight aspects of leadership and technology, and to help the students to run the project …", "num_citations": "15\n", "authors": ["1550"]}
{"title": "A practical mechanism for ethical risk assessment—A SoDIS inspection\n", "abstract": " The availability of high-quality software is critical for the effective use of information technology in organizations.Although the need for high-quality software is obvious to all and despite efforts to achieve such quality, information systems are frequently plagued by problems (Ravichandran, 2000). These continued problems occur in spite of a considerable amount of attention to the development and applications of certain forms of risk assessment (which will be discussed in Section 18.2). The narrow form of risk analysis and its limited understanding of the scope of a software project and information systems has contributed to significant software failures. Section 18.3 will introduce an expanded risk analysis process that expands the concept of information system risk to include social, professional, and ethical risks that lead to software failure. Using an expanded risk analysis will enlarge the project scope considered by software developers. This process is further refined by incorporating it into an inspection model and illustrated by its application to a national information system. A tool to develop Software Development Impact Statements (SoDIS) is also discussed. Informaticians have been evolving and refining techniques to mediate risks of developing software products that meet the needs of their clients. The risks focused on include missed schedule, over budget, and failing to meet the system s specified requirements (Boehm, 2006; Hall, 1998; Jones, 1994). This focus was later expanded to address software security as the highest risk (Stoneburner et al., 2002). In spite of this attention to risks, a high percentage of software systems", "num_citations": "15\n", "authors": ["1550"]}
{"title": "Fluency in information technology-FITNZ: an ICT curriculum meta-framework for New Zealand high schools\n", "abstract": " This paper proposes an Information and Communications Technology (ICT) Curriculum Meta-Framework to operate at the senior secondary school level in New Zealand. This meta-framework arises from the Fluency in Information Technology (“FITNZ”) Project, a collaborative venture between tertiary and secondary sector educators, government and industry. The initiative is intended to address the poor alignment between tertiary education and the Information Technology needs of the industry sector. The confused perceptions of ICT and the fragmented and uneven state of computing education at the secondary level have contributed to the disparity between tertiary education and industry needs. The paper draws on previous work on IT fluency. It also positions the computing disciplines within the Association of Computing Machinery (ACM) computing curricula 2005 document in order to propose a soundly based set of graduate outcomes.", "num_citations": "15\n", "authors": ["1550"]}
{"title": "Student reflections on collaborative technology in a globally distributed student project\n", "abstract": " Collaborative Technology (CT) plays an important role in overcoming the challenges of globally distributed projects. It enables collaboration, but the specific choice of technology also imposes constraints on how projects are conducted. Over the past decade, we have engaged in an action research programme to develop an Open-Ended Group Project situated in an educational framework in which international collaboration, including interaction with a real world client, is an essential component. This paper investigates the manner in which students reflected on their patterns of CT use within the collaborative setting. In general, these reflections were found to be superficial and descriptive, exhibiting a reductive view of CT as a set of technological features, which acted as a neutral medium for communication and participation. One consequence of this was a lack of awareness of the ways in which the technology …", "num_citations": "14\n", "authors": ["1550"]}
{"title": "Thinking ISsues: the three p's of capstone project performance\n", "abstract": " Assessment of student performance on capstone projects raises a number of issues, which are well addressed in the excellent book by Fincher and colleagues [1]. Yet some issues still remain to be discussed. The artifacts frequently selected for project assessment tend to place a primary emphasis on result of the project work, the outcome or the “product”.Of course in a professional context that is the key factor, namely that the project delivers it’s intended outcome in terms of a working system for instance. Yet how good is that delivered ‘working system’, and for how long will it remain so, are further hidden ‘product’criteria? It is all too easy for software professionals under pressure of deadlines to cut corners on design or code quality. So the system supposedly delivered on time and on budget will actually balloon out in cost over its full lifetime of use, as maintenance proves costly and risky simply to introduce the most …", "num_citations": "14\n", "authors": ["1550"]}
{"title": "Managing requirements in globally distributed COTS customization\n", "abstract": " In today's world of internationally connected software labor and consumer markets, globally distributed software development (GSD) is common. It is well documented that global requirements engineering (GRE) activities are challenging. However, there is no silver bullet to address these challenges and in practice GRE methods are generally contextualized to suit project characteristics. An important context that has received little attention from researchers is the increasingly popular Commercial Off-The-Shelf (COTS) product customization. This paper offers insights into GRE in the context of a COTS customization with globally distributed client and vendor teams. An exploratory case study approach is taken to understand the GRE activities in this situation. A detailed process model is developed from analyses of interview data and relevant artifacts. Insights and challenges particular to the global and COTS aspects of …", "num_citations": "13\n", "authors": ["1550"]}
{"title": "Using SoDIS™ as a risk analysis process: A teaching perspective\n", "abstract": " There are several difficulties we face when showing our students key processes and techniques for software development. In this paper, issues related to teaching students how to manage risks in software projects are profiled. The concepts and process for implementing Software Development Impact Statements (SoDIS) are outlined; with its supporting CASE tool the “SoDIS Project Auditor” being described. Different ways of applying the SoDIS process and the CASE tool are demonstrated, through some brief illustrative case studies. The paper suggests ways of using the process and the tool to enhance teaching in computing courses including software development projects, software engineering, project management, ethics and professionalism. This work occurs under the umbrella of the SoDIS SEPIA collaborative research programme which aims to promulgate use of the SoDIS process, in both industrial and educational computing spheres.", "num_citations": "13\n", "authors": ["1550"]}
{"title": "Computing the profession: Crossing the chasm with a new Master’s degree in information technology\n", "abstract": " Successive ACM national and international curriculum efforts have addressed the evolving nature of the computer science curriculum. The academic discipline of computer science has been subjected to critical questioning in terms of the preparedness of graduates to meet the continuing demand for well educated and effective computing professionals. An increasing trend sees educators in cognate computing disciplines grouped in schools of Information Technology (IT). This paper reports on a new curriculum initiative to create a Masters degree in Information Technology aimed at supporting IT professionals in their personal and career growth. The paper will cover the rationale, mechanisms for stakeholder involvement, aims, structure and content of the programme, and strategies for delivery.", "num_citations": "13\n", "authors": ["1550"]}
{"title": "International Collaborative Learning–The Facilitation Process\n", "abstract": " International collaborative learning is becoming more viable through a variety of Internet enabled software products. Group Support Systems appear to offer promise. But how to facilitate the teaching and learning process in electronic environments is not well understood. If education is to involve an interactive process of collaborative inquiry and dialogue between remote groups of learners, then how to design meaningful learning experiences presents challenges in logistics, technology support, software design, and pedagogy. To better model the facilitation process in such environments, a theoretical framework based upon an extension of Adaptive Structuration Theory is suggested. This framework is then related to experiences with custom application software development using Lotus Notes Domino™, internal trials and a limited scale collaborative learning exercise between students at Auckland Institute of …", "num_citations": "13\n", "authors": ["1550"]}
{"title": "In-flow peer review\n", "abstract": " Peer-review is a valuable tool that helps both the reviewee, who receives feedback about his work, and the reviewer, who sees different potential solutions and improves her ability to critique work. In-flow peer-review (IFPR) is peer-review done while an assignment is in progress. Peer-review done during this time is likely to result in greater motivation for both reviewer and reviewee. This workinggroup report summarizes IFPR and discusses numerous dimensions of the process, each of which alleviates some problems while raising associated concerns.", "num_citations": "12\n", "authors": ["1550"]}
{"title": "Enhancing product and service capability through scaling agility in a global software vendor environment\n", "abstract": " Agile software development has become increasingly common in software vendor organisations, and their impact on practices and roles is now extending beyond the project level across the entire organisation. In this study, we investigate how a major Australia-based multi-site global software vendor transitioned from a structured to a Scaled Agile approach.", "num_citations": "11\n", "authors": ["1550"]}
{"title": "SoDIS SEPIA-Collaborative partnerships in software engineering research\n", "abstract": " The Centre for Information Technology Research (CITRUS) launched in 2002 had the goal of encouraging collaborative research that is industry and community linked, at regional and national levels within the NACCQ sector. The research programme into Software Development Impact Statements being conducted by the Software Engineering Practice Improvement Alliance, (SoDIS SEPIA) represents one model towards achieving this goal. Initiated in 2001, this programme of research has developed increasing momentum from small beginnings, and is beginning to attract funding and a growing body of research partners committed to its goals. Bootstrapping a research programme from scratch is nonetheless a difficult undertaking. This paper outlines the goals of the programme; the strategies applied to build a collaborative network of researchers in educational and commercial organizations in New Zealand, Australia and the United States; reviews the successes and failures in the process so far; and makes some recommendations for developing successful research partnerships.", "num_citations": "11\n", "authors": ["1550"]}
{"title": "The waterfall is dead.. long live the waterfall!!\n", "abstract": " Tony Clear find myself now in the throes of rewriting the guide I provide to our students undertaking their capstone software development projects. Like many such artifacts it has evolved over time and is an amalgam of my own and prior colleagues’ thoughts, informed by numerous sources from the literature. However, we are now at some form of watershed, experiencing an increasing level of discomfort with the existing guide and the schedule we have applied for assessing students’ work. In our capstone software development project, students undertake projects under three broad headings:(1) commercial software development for live client to deliver a working application,(2) R& D project for commercial client to undertake a technology evaluation and deliver a proof-of-concept application, and (3) a more theoretical research project developing software within a research team or for a research sponsor. The items …", "num_citations": "11\n", "authors": ["1550"]}
{"title": "Avatars in cyberspace: a Java 3D application to support formation of virtual groups\n", "abstract": " In the conduct of international collaborative learning trials, the introductory phase for virtual groups is important for building group understanding and cohesion. One technique previously reported [1] has been use of a cyber-icebreaker task. However collaboration using text and graphics alone has limitations. It has been proposed that more active engagement [2] by using avatars to represent oneself in cyberspace, has the potential to improve the functioning of virtual teams.", "num_citations": "11\n", "authors": ["1550"]}
{"title": "He ara hou ka tū mai: New Zealand institutions of higher learning unpacking demands and facilitating change\n", "abstract": " The Virtual Worlds Working Group began with the DEHub research consortium in November 2009. In December 2010, New Zealand joined the VWWG. This paper highlights the current work of the NZ based members of the group and presents the work of 23 authors at 11 institutes of higher education in New Zealand. The scope of the work covered is diverse, and a number of platforms have been used. Virtual worlds enable educators to provide realistic simulations, engaging role-plays, immersive and genuine tasks, and social interaction that encourages group collaboration, and highlights the ability that virtual worlds have to transform both teaching and learning.", "num_citations": "10\n", "authors": ["1550"]}
{"title": "Introductory programming and educational performance indicators-a mismatch\n", "abstract": " Introductory programming courses are known worldwide to pose challenges for both students and educators. A recent meta-review of research in the area has indicated something in the order of a sixty six percent pass rate globally. Yet the New Zealand Government has asked institutions to set high and increasing targets as a goal for student pass rates in its educational performance indicators. Increasingly these metrics are being used to shape the behaviour and educational outcomes sought from educational institutions, with the threat of penalties by way of loss of funding for supposedly “poorly performing courses”. Yet while focused at the institutional level, how do these indicators really meet the needs of all the stakeholders in the tertiary education system? To what extent do they distort and create incentives for perverse behaviours? This review assesses the dilemmas such measurement systems pose to educators using the case of introductory programming as an example.", "num_citations": "9\n", "authors": ["1550"]}
{"title": "Categorizing how students use Collaborative Technologies in a globally distributed project\n", "abstract": " Possibilities for collaboration in globally distributed projects have radically changed with the introduction of new Collaborative Technologies (CTs) in the Web 2.0 era. The use of such technologies in the context of students collaborating in a globally distributed project is little explored in research. A better understanding would provide opportunities for improving the collaboration, and more importantly is that a better understanding would improve the possibility of scaffolding, and student learning in general. In this paper we present results from a study of students' use of CTs in a globally distributed project with a focus on the challenges encountered in trying to collaborate using this technology. The study is focused on a few aspects of how a combination of CTs could be utilized and issues associated with their set up and adaption for use. We discuss potential reasons for the observed patterns of technology use and …", "num_citations": "9\n", "authors": ["1550"]}
{"title": "A place for learning agreements in capstone computing courses?\n", "abstract": " Inherent in this model is the notion of a “learning contract”[2]. We prefer the term “learning agreement” to avoid misrepresenting a joint undertaking for learning as a hard and fast ‘legal contract’. The agreement is defined from the outset when scoping the activities to be carried out on the worksite. This ensures that there is a clear threeway communication of understandings about the learning focus of the assignment. Student, workplace supervisor, and academic supervisor must all be committed to the work activities and the learning elements of the placement.The agreement includes elements related to duration, location of the site, and resources to be provided for the workplace assignment. Yet more critical to framing the learning are the five key elements which must be developed by the student in negotiation between the three parties. These five elements include: 1. The work assignment 2. Relating theory to …", "num_citations": "9\n", "authors": ["1550"]}
{"title": "Global collaboration in course delivery: Are we there yet?\n", "abstract": " Some recent experiences with Global Educational Collaborations have given me occasion to reflect on how sustainable such initiatives are, and whether they will over time become embedded in the fabric of modern University education, especially for courses such as Global Software Engineering. Swigger and colleagues argue to the contrary at least for now, observing that \"technical barriers such as unreliable software and institutional regulations discourage most teachers from exploring distributed learning\" [1]. But does this pessimistic view truly recognize the realities of the age? For Giddens \"one of the dominant characteristics of modernity is the separation of time from space made possible by the standardization of time across the world\", with \"human efforts to standardize temporal frameworks inscribed in official time zones\" [2]. Is a Global Collaboration then, inherently a product of the trend towards universal …", "num_citations": "9\n", "authors": ["1550"]}
{"title": "Comprehending large code bases-the skills required for working in a\" brown fields\" environment\n", "abstract": " In the search for answers to the effective teaching of programming at the beginner level, we are now seeing broader programs of research investigate the distinctions between reading, comprehending and writing small programs [1], [2]. In New Zealand we have joined this work with the \"Bracelet\" project, in which multiple institutions will investigate how students comprehend small computer programs. We hope this may help answer critical teaching and assessment questions.", "num_citations": "9\n", "authors": ["1550"]}
{"title": "Met a researcher? Research paradigms among those new to research\n", "abstract": " This paper reports some insights into the understandings about research of computing educators and novice researchers in the NACCQ sector. These insights arise from a self-assessment of their approaches to teaching and research, undertaken at NACCQ sponsored \"Getting Started in Research Workshops\". The self-assessment was intended to assist workshop participants to become aware of and reflect upon their predominant teaching and research paradigms. It also served as a means of actively modelling use of the critical method in research. Three paradigms – Functional, Transactional and Critical were used in the assessment process, and attendees were asked to indicate which paradigm best applied to their practice and beliefs in their teaching and research respectively. This paper will discuss the settings, the instrument used, review the findings from data gathered to date, and indicate future directions for this research.", "num_citations": "9\n", "authors": ["1550"]}
{"title": "The nature of cognition and action\n", "abstract": " U\" nderlying the established paradigm of computer science, is a very strong set of dualisms-the dualism between now and the future, between thought and deed, between decision and action. The strong emphasis on processes of abstraction and the need for generic structures and rigor arise from this. Algorithms, for instance, are seen as optimal ways of performing certain calculations, or tasks which are planned to recur frequently in the future.However as researchers, and educators engaged in preparing tomorrow's practitioners, is it time to reconsider our deductive approach to pedagogy and practice. Is there a need to adopt more inductive, exploratory and interactive teaching and development models, which may inherently be seen to lack the traditional rigor. Is it time to rethink the nature of what we mean by the term programming. This could require us to revisit some long, and firmly cherished, beliefs about how …", "num_citations": "9\n", "authors": ["1550"]}
{"title": "Coupling and cohesion among disciplines: some curriculum paradigms\n", "abstract": " T his column offers an information systems perspective on the discipline of computing. I do not claim to be a loyal disciple of any discipline. For instance, in this issue I suggest how we might adopt more multi-disciplinary approaches to developing and offering computing curricula. After a career spent mostly in software development, with a recent return to teaching at our Institute in 1993, I feel like a relative newcomer to the academic world. I hope in this column, by linking the teaching, theory and current commercial practice of software development, to give thought to a number of issues related to the overall computing discipline and its pedagogy that seem important to me, and hopefully also to readers of the column.Firstly then, we define the discipline of computing very broadly. Readers are referred to [6], which reflects an intense but immensely enjoyable week's work debating the scope of the computing discipline …", "num_citations": "9\n", "authors": ["1550"]}
{"title": "Topics and Treatments in Global Software Engineering Research: A Systematic Snapshot\n", "abstract": " This study presents an analysis of the most recent literature addressing global software engineering (GSE). We examine the current state of GSE research using a new Systematic Snapshot Mapping (SSM) technique. We analysed 275 papers published between January 2011 and June 2012 in peer-reviewed conferences, journals and workshops. Our results provide a coarse-grained overview of the very recent literature addressing GSE, by classifying studies into predefined categories. We also follow and extend several prior classifications to support our synthesis of the data. Our results reveal that currently GSE studies are focused on Management and Infrastructure related factors. Most of the studies are conducted at the organizational level using methods such as interviews, surveys, field studies and case studies. We use inter-country network analysis to confirm that the USA and India are major players in GSE, with USA-India collaborations being the most frequently studied, followed by USA-China. Specific groups of countries have dominated the reported GSE project locations. In contrast, regions including Central Asia, South Asia (except India), Africa and South East Asia have not been covered in these studies. While a considerable number of GSE-related studies have been published they are currently quite narrowly focused on exploratory research and explanatory theories. The critical research paradigm has been untouched, perhaps due to a lack of criteria and principles for carrying out such research in GSE. An absence of formulative research, experimentation and simulation, and a comparative focus on evaluative approaches, all …", "num_citations": "8\n", "authors": ["1550"]}
{"title": "Designing Computer Science Competency Statements: A Process and Curriculum Model for the 21st Century\n", "abstract": " The broadly influential document Computing Curricula 2005 (CC2005) is in the process of being updated through a project called Computing Curricula 2020 (CC2020). CC2020 provides a vision for the future of computing education, including a comprehensive report that contrasts curricular guidelines, and contextualizing those guidelines within the broader landscape of computing education. In the process, a framework of competency-based educational principles has been developed which is closely aligned with other skills and qualifications frameworks. This working group report demonstrates one way in which the transition from current learning-outcomes-based practices to the competency-based practices can be approached. Further, the paper discusses the challenges and insights that have emerged as the learning outcomes for various Knowledge Areas in the CS2013 report were re-expressed in terms of …", "num_citations": "8\n", "authors": ["1550"]}
{"title": "Scaling agile at the program level in an australian software vendor environment: A case study\n", "abstract": " Japanese ICT investment trailed the developed world for many decades, contributing to low productivity growth. A potential root cause is the influence of Japanese culture over the strategic use of and investment in ICT (SUIICT). Empirical research on cultural aspects of SUIICT in Japan is lacking. This study will examine national culture and its association with SUIICT in organisations in Japan compared to Australia. A quantitative survey of ICT decision makers in Japanese and Australian organisations will be fielded based on questions synthesized from McFarlan, McKenney and Pyburn (The Strategic Grid), and Hofstede and Minkov (Cultural Dimensions Model). A contribution to theory will be the development and testing of an empirical model and practical instrument for determining the association between national culture and SUIICT. A practical contribution will be an increase in understanding of both markets allowing for more effective market segmentation and development of ICT offerings for both countries.", "num_citations": "8\n", "authors": ["1550"]}
{"title": "Replicating an'Onshore'Capstone Computing Project in a'Farshore'Setting--An Experience Report\n", "abstract": " The internationalization of tertiary education is giving rise to a number of 'export education' models, but cross-cultural collaborative educational programmes pose several challenges. Most undergraduate computing degrees include a capstone project as a means of consolidating student learning within an integrative final learning experience, which aims to prepare them for further study or varying forms of professional practice. Typically these projects are coordinated and conducted in an 'onshore' setting, although notable exceptions do exist. We report our early experiences and the key decisions taken in replicating an 'onshore' capstone course from a New Zealand setting, to a full student cohort studying our Bachelor of Computer and Information Sciences in a 'farshore' context in Vietnam. We explore the myriad of issues relating to the oversight, design and structuring of the course, when tailoring an inherently …", "num_citations": "8\n", "authors": ["1550"]}
{"title": "Global virtual teams and 3D collaborative virtual environments\n", "abstract": " Collaborative virtual environments for desktop PCs. are inherently interesting to use and to develop, and provide motivating and challenging capstone projects for capable students to undertake. From an educational perspective, collaboration in virtual three-dimensional spaces using avatars also adds some interesting dimensions to student learning. This paper reports upon a series of developments, in which collaborative virtual environments have been applied since 2001 to support research into global virtual teams. Specific insights relevant to educators and developers have been gained through a series of local and international collaborative trials, using these 3D environments.", "num_citations": "8\n", "authors": ["1550"]}
{"title": "Managing software requirements risks with software development impact statements\n", "abstract": " “Defining requirements is a complex and difficult process, and defects in the process often lead to costly project failures. There is no complete and well defined set of requirements ready to be discovered in system development (Boehm et al., 2001).Software development begins with an attempt to understand the nature of the desired product. Difficulties in getting good requirements have long been recognized and have led to a variety of attempted solutions: rapid prototyping, formal methods, special requirements notation, etc. Boehm and colleagues (2001) describe a requirements negotiation", "num_citations": "8\n", "authors": ["1550"]}
{"title": "Unpacking Dispositions in the CC2020 Computing Curriculum Overview Report\n", "abstract": " Computing Curriculum models have been historically framed from a cognitive perspective. Typically, the focus has been on bodies of knowledge and increasingly the notion of supporting skills and abilities. More recent curriculum documents such as the IT2017 curriculum have moved towards a professional competency approach and have included the further important notion of dispositions.While these dispositions are seen as complementing and supporting the traditional elements of knowledge and skills, exactly how they are conceptualised and operationalised is still being developed. The ACM/IEEE-CS Computing Curriculum 2020 Overview Project (CC2020) has been working towards this goal, in part driven by the very practical purpose of enabling visualisation of the multiple components of the existing and differing curriculum reports, incorporating the notion of dispositions and enabling them to be mapped …", "num_citations": "7\n", "authors": ["1550"]}
{"title": "A framework for writing learning agreements\n", "abstract": " Active learning is a popular concept for motivating learning. Learning agreements are one strategy towards this goal. They can be used to aid the students to take ownership of their learning and in becoming more active in a course. Learning Agreements are especially useful tools for scaffolding learning in courses with a focus on developing the professional competencies of students, such as in Open Ended Group Projects, Work Integrated Learning or other authentic learning contexts. Such educational contexts are complex and we have found it necessary to scaffold student learning using agreements based on professional competencies. This has led to a pedagogical framework, which has found successful application in a number of contexts. This framework has been built based on discussions with students, and has involved the development of a supporting wiki which contains descriptions of the different …", "num_citations": "7\n", "authors": ["1550"]}
{"title": "THINKING ISSUES Managing mid-project progress reviews: a model for formative group assessment in capstone projects\n", "abstract": " This dashboard shows a team of three fictitious members, the first of which has produced a moderate amount of product, appears slightly less effective on process but in combination has evidenced a moderate level of learning progression. The second member in contrast has produced little, has evidenced minimal process and consequently demonstrates barely any progression in learning. The third member appears to be a strong producer, but with limited consideration for process which has resulted in a lesser level of learning progression.This simple depiction enables a powerful dialogue to take place about team dynamics in the session. It exposes team members unable to evidence any noticeable contribution to the project. That may simply be a result of a poorly evidenced portfolio or may be a realistic indicator of limited contribution to the team’s efforts. In the former case, discussion may focus on how to better …", "num_citations": "7\n", "authors": ["1550"]}
{"title": "Global virtual teams: Moderating behaviour in 3D collaborative virtual environments\n", "abstract": " Collaboration in virtual three-dimensional spaces using avatars adds some interesting dimensions to student learning. In this paper a disconcerting incident is explored. The incident occurred during an international collaborative learning trial between global virtual teams from Sweden and New Zealand, using an experimental collaborative environment. A set of protocols has been developed in response, applicable to global collaboration in 3D virtual environments. These are proposed as guidelines for educators, both to stipulate clearly the'netiquette'rules for such environments and to provide practical mechanisms for moderating the behaviour of students' avatars.", "num_citations": "7\n", "authors": ["1550"]}
{"title": "Developing and Implementing a Groupware Application to Support International Collaborative Learning\n", "abstract": " This thesis reviews the work of the author in investigating the effectiveness of web-based groupware technology to support international collaborative learning. The primary project reviewed here represents one action cycle in an ongoing programme of research and development involving trials of Lotus Notes™ and Domino™ technology and of collaborative pedagogy.This action cycle was a collaborative trial which took place in semester two 1999, and involved a class of approximately twenty students at Auckland University of Technology (AUT) collaborating in groups with a class of some seventy computer science students at Uppsala University in Sweden. The nature of the learning experience was intended to add to, rather than replace, the existing course of study for these students, and constituted an investigation into methods of transforming the teaching and learning process. This multidisciplinary study investigates how Group Support Systems (GSS) may be implemented in order to transform activities in a particular domain, and the counter forces which dictate how they may be appropriated. In this case the domain is an educational one, but it is believed that some of the frameworks proposed and insights gained have relevance to further domains of use.", "num_citations": "7\n", "authors": ["1550"]}
{"title": "Shaping Behaviours Through Space and Place in Gamified Virtual Learning Environments\n", "abstract": " A critical incident of avatar harassment which occurred in our early gamified virtual learning environment is re-examined in this chapter. Lessons learned subsequently lead us explore understanding and shaping people’s behaviours in gamified virtual environments (VEs). In this study, we develop a theoretical model for elaborating people’s behaviours within VEs through the notions of ‘space’ and ‘place’, then proceed to build a coherent set of policies to govern the VEs and produce a framework for incorporating gamified designs into VEs, based on the model.", "num_citations": "6\n", "authors": ["1550"]}
{"title": "Systematic literature reviews and undergraduate research\n", "abstract": " sideration as a candidate project. Good candidates for a literature review are well thought through, address one or more clear research questions and are soundly framed. Possible extensions to this model involving a more practical component, could involve undertaking simulation experiments or replications of prior studies for which the data or software could be readily obtained. As with any capstone project, proposed literature review projects need to gain approval through our normal project vetting process. A thoroughly conducted systematic review can be time consuming and challenging, even for more senior students and researchers. Therefore, an active level of supervisory guidance must be provided for undergraduate students to help scaffold the learning. In practice the systematic review will often take on the broader survey-like aspects of a systematic mapping study [3, 4], through classifying and …", "num_citations": "6\n", "authors": ["1550"]}
{"title": "Diagnosing your teaching style: How interactive are you?\n", "abstract": " In the higher education context within which computing educators now teach, an increasing range of forces are conspiring against innovative teaching practice. Pressures of academic workload, pressures from consumerist students and regular course evaluations, pressures from increasingly managerial policies and practices, from so-called 'quality assurance systems', pressures to continually expand research output, all lead towards stifling conformity and a natural conservatism in teaching practice. The increasing focus on consistency in a mass production model of teaching militates heavily against innovation. This paper presents an instrument used by the author to diagnose the student perceptions of the pedagogy of his course, by mapping it against Reeve's fourteen dimensions of an interactive learning system [12]. The outcomes demonstrated significant differences in style between this course and the overall …", "num_citations": "6\n", "authors": ["1550"]}
{"title": "Dimensions of Collaboration in Global Software Engineering Teams: Explorations of'Collaborative Technology Fit'\n", "abstract": " Working in global software engineering teams (GSETs), presents a plethora of challenges. In addition to the global developers working directly within their teams, a number of further actors perform support roles through a set of dasiabackstagepsila activities which underpin the degree of ldquoCollaborative Technology Fitrdquo between the sites. While crucial to the success of GSETs, the work of these actors in establishing and maintaining alignment between the sites has been little researched. A novel ldquoTheory of Collaborative Technology Fit (CTF)rdquo incorporates these ldquotechnology-use mediationrdquo activities in a multidimensional model and provides both a theorization and a diagnostic tool for potential use by a variety of Global Virtual Teams. Three field work studies that have utilized the model in various ways are reported in this presentation.", "num_citations": "6\n", "authors": ["1550"]}
{"title": "Researching collaborative technologies in global virtual teams: empirical studies from an interpretive perspective\n", "abstract": " Researching global software engineering teams (GSETs), presents several phenomena of interest, and raises several issues relating to choice of method. Given the important function of both time and space when studying GSETs in field settings, dasiasnapshotpsila research methods (such as the use of questionnaires, and even interviews), tend to fall short in capturing some of the innate complexities. Researchers from the Information Systems discipline have recommended the use of such research methods as qualitative case studies and action research, but for software engineering researchers such methods appear uncommon. Action Research in particular, where the researcher is an active participant and even change agent challenges the notion of dasiaobjectivepsila science. This paper focuses on the design and conduct of empirical software engineering research from an interpretive viewpoint, and …", "num_citations": "6\n", "authors": ["1550"]}
{"title": "An IT support capstone: Just another brick in the wall\n", "abstract": " The current diploma resulted from the restructuring of the 3 year National Diploma in Business Computing (NDBC). At AUT the NDBC offered three distinct study pathways: software support, networking, and software development. Students doing the software development pathway were required to complete a real-world project in their final year. This capstone project was an attempt at bridging the gap between academia and industry. Since 1999, continuing curriculum development at AUT has led to migration from the national NACCQ curriculum to the implementation of a local degree, the Bachelor of Information Technology. This degree encompassed the former NACCQ software development study pathway. At the same time, the two year AUT Diploma in Information Technology was developed to cater for students pursuing the other two pathways: software support and networking.", "num_citations": "6\n", "authors": ["1550"]}
{"title": "TEAC research funding proposals considered harmful: ICT research at risk\n", "abstract": " As Information Technology (IT) educators, whether career academics or former practitioners, it seems exceedingly rare to find environments in which IT is understood, appropriately managed or nurtured.  To expect enlightened goverment policy therefore is perhaps over-optimistic.  Yet our Prime Minister has identified the Information & Communications Technology (ICT) sector as a priority.  Therefore it seems doubly ironic that the elitist policy now proposed for funding research in the higher education sector promises to further undermine the ability of the IT-related disciplines to prosper in our higher education institutions.  Rather then strengthen ICT as a priority sector, current policy directions promise to diminish higher education's contibution to ICT capability building within the nation's innovation framework.  This paper reviews the proposed directions and critiques their impact for IT education within the NZ higher eduction sector.", "num_citations": "6\n", "authors": ["1550"]}
{"title": "A diagnostic technique for addressing group performance in capstone projects\n", "abstract": " \" Students' awareness of their own group processes can be poor (or Absent)\"[1]. Yet professional software development situates much work within groups, and capstone courses are often designed to develop capabilities, such as effective teamwork. Supervising group processes can be challenging, and encouraging students to reflect upon group functioning can be a delicate exercise. A technique is outlined below, for group performance review and diagnosis of issues preventing teams functioning effectively.", "num_citations": "6\n", "authors": ["1550"]}
{"title": "A generic collaborative database—part of a strategy to internationalise the curriculum and develop teamwork and communication capabilities (poster)\n", "abstract": " This presentation reports on progress in using Groupware concepts, to assist collaborative learning across boundaries of time and space, to broaden the student learning experience and develop capabilities in the use of IT for cross cultural communication.", "num_citations": "6\n", "authors": ["1550"]}
{"title": "'Follow the moon'development: writing a systematic literature review on global software engineering education\n", "abstract": " This presentation reflects on method and practice in Computer Science Education Research, through introducing the process of conducting a Systematic Literature Review. While Systematic Literature Reviews are an established research method within the Software Engineering discipline, they are a relatively unfamiliar research approach within Computer Science Education. Yet research disciplines can be strengthened by borrowing and adapting methods from other fields. I reflect on the rationale and underlying philosophy behind Systematic Reviews, and the implications for conducting a rigorous study and the quality of the resulting outputs. This chronicle of the journey of an ITiCSE working group, outlines the process we adopted and reflects on the methodological and logistical challenges we had to overcome in producing a review titled Challenges and Recommendations for the Design and Conduct of Global …", "num_citations": "5\n", "authors": ["1550"]}
{"title": "The hermeneutics of program comprehension: a'holey quilt'theory\n", "abstract": " 2012 June• Vol. 3• No. 2 acm Inroads 7 may be short and comprehension rapid, for others time on task may be lengthy and the comprehension process painfully slow. But it may be in the latter case that the time on task is concentrated in one or two cells only, for instance considerable time spent at the atom level of text surface and control structure is unlikely to build much other than one deepening corner of a quilt. It is argued that a more hermeneutic perspective must be acquired, which traverses all the cells and zooms in and out to build depth within particular cells and across companion domain and structural elements. The program comprehension literature canvassed in [3] notes the importance for professional programmers of drawing the relational and macro level links between the program domain and the code.", "num_citations": "5\n", "authors": ["1550"]}
{"title": "Design and usability in security systems: daily life as a context of use?\n", "abstract": " SIGCSE Bulletin 14 Vol 34, No. 4, 2002 December able. To simply cope with the burden of tracking and remembering all these unconnected discrete pieces of information, we develop strategies such as keeping a central record of all our security information, and use wherever possible of the same pin or password. Hooray for user-selected PIN and password options in security system designs!! In the internet context, how many times have users lost track of their passwords, and given up their attempts at online shopping or service access? What is the cost of this lost business? With concepts such as “portals”, and “single sign-on” we are seeing some recognition of the issues, and the need to reduce complexity in security management, to provide more secure environments. The great irony of security is that the more rigid it becomes the weaker it becomes, because users either opt for other more accessible services or …", "num_citations": "5\n", "authors": ["1550"]}
{"title": "\" Programming in the Large\" and the need for professional discrimination\n", "abstract": " Tony. Clear@ aut. ac. nz common goal in teaching capone project and software engieering type courses is to develop in students the capabilities required of a professional software developer. Unfortunately, their prior educational experiences in the computing discipline may have done anything but prepare them for professional practice. Although the situation may vary considerably from country to country and institution to institution, there are several common deficiencies to address. Often the introductory\" programming in-the-small\" courses may have consisted of several small exercises and assignments completed by the students acting as individuals. This does little to prepare them to function effectively as a member of a team, as commonly demanded by\" programming in the large\" in a professional context. Likewise, earlier courses are typically oversimplified to enable students to engage in manageable, while …", "num_citations": "5\n", "authors": ["1550"]}
{"title": "Practitioner education—degrees of difference?\n", "abstract": " O ur institution, until this year, has been part of the New Zealand Polytechnic sector, a sector with a particular mission to provide applied learning and vocational education preparing tomorrow's practitioners, or upskilling those currently in the workforce. In the New Zealand education environment, one of the more significant changes of the 1990's has been the granting of degree awarding authority to institutions in the polytechnic sector [2]. Our own institute has been active in developing over thirty new degree programmes in a period of less than a decade. The growing maturity of the institute has led to its achieving\" university\" status from January of this year, a millennial concession from an outgoing minister of education. For some years now we have taught a three year National Diploma, during which students were prepared for careers as practitioners in the IT industry. This programme contains a capstone course …", "num_citations": "5\n", "authors": ["1550"]}
{"title": "Developing a new course for the software development pathway on the AUT bachelor of applied science programme\n", "abstract": " Within the Bachelor of Applied Science (Software Development Pathway)-a new course of study at AUT aimed at producing capable software developers, we have included a course on Networking and Telecommunications. This paper describes the whole process of designing a new module entitled “Networking & Telecommunications”, for the software development pathway (the Pathway). The aim of this module is to enable students to develop an indepth knowledge of data communications and networking requirements including networking and telecommunications technologies, hardware and software. Emphasis is upon the analysis and design of networking applications in organisations, so that software developers can better understand the features of the technology environment in which their applications may be developed. The paper begins with a justification-why the course is needed? We then describe the course philosophy and approval process, learning outcomes, topics, and approaches to teaching & learning.", "num_citations": "5\n", "authors": ["1550"]}
{"title": "Online education—but is it education?\n", "abstract": " Faculty of Commerce Auckland Institute of Technology, Private Bag 92006, Auckland 1020, New Zealand Tony. Clear@ aitac. nz-t has been rather _cynically suggested that the\" real function of education is to sort and certify people; imparting skills and knowledge is not really that important.\"[1] With the advent of cyber-learning models of education, perhaps this perspective has to be taken more seriously. In the ability to certify may lie the only true competitive advantage of the university. At the ITiCSE conference m Cracow, Herbert Grosch proposed a scenario that future University administrators seeking to cut costs of educational delivery would look to online delivery models, with large corporate providers providing outsourcing services. This would enable them to cut expensive faculty and offer more\" education\" to more students at lower cost. Such a scenario seems sadly plausible given the rise of managelrialism in …", "num_citations": "5\n", "authors": ["1550"]}
{"title": "Competencies for paradigm shift “survival”\n", "abstract": " The rapid development in the IT area brings a series of shifts, in underlying theories, technology and work practices. In the normal course of events, most changes are evolutionary, with small, incremental improvements being made to theoretical understanding or practical application. Occasionally, however, changes occur of such magnitude that they do not just alter current operational practice but require a thorough reappraisal of the underlying assumptions on which that practice is based. In short, they require a review of the dominant way of thinking, or paradigm. Ability to adapt to evolving circumstances is critical, not only for industrial and commercial organisations, but also for individual employees, to survive and remain successful during paradigm shifts. How can we prepare our students so they can survive in a working life characterized by frequent paradigm shifts? It is important that CS and IT education …", "num_citations": "4\n", "authors": ["1550"]}
{"title": "Doctoral work in computing education research: beyond experimental designs\n", "abstract": " Having recently participated in the Doctoral Consortium of the Australasian Computing Education Conference, I was struck by the core methodological challenges faced by students. Initial proposals seemed to be along the lines of,“well, I will need a control group and a comparison group to evaluate x or y condition or intervention.” The corollary to this thinking then became “well, how many students will be enough?” presumably so the findings could be generalisable in some manner. Yet, do methods drawn from the natural sciences really furnish the most appropriate approaches for computing education research (CER), with its hybrid concerns of technology and people? If not, then which methods would be more suitable and how can students be guided towards their adoption? I suppose the typical preparation of computing students is a fairly technical one and the more obvious scientific research methods to which …", "num_citations": "4\n", "authors": ["1550"]}
{"title": "GLOBAL INTERCULTURAL COLLABORATION Preface\n", "abstract": " One cannot engage in global collaborations in higher education without recognising the significance of culture as a pervasive element in such collaborations. Which of necessity raises the question, what is culture? One definition notes that culture is not static and museum like but\" contested temporal and emergent\"(Myers & Tan, 2002). This very dynamism makes culture a difficult object of study. This workshop has originated from two computing departments as a result of our interest in making Global Virtual Collaboration an element of the educational experience for our students.Yet we freely acknowledge the limitations in our own knowledge and in that provided by the computing and computing education research disciplines in addressing the question of culture. Therefore we have chosen to run a joint workshop with other disciplines whose views of culture as a phenomenon may be widely divergent. We hope by this means to engage in a wider conversation by sharing perspectives, and opening up potential for research in the in-between spaces of disciplines where new insights may be gained. The increasing use of Information Technology in supporting global collaboration brings new questions relating to culture in the online or virtual spaces that are now being inhabited. These serve to extend the scope of enquiry for the noncomputing disciplines into these augmented roles and meanings of ‘culture’. Thus we have a common interest in these questions, even if we tackle them from different perspectives.", "num_citations": "4\n", "authors": ["1550"]}
{"title": "Understanding student performance on an algorithm simulation task: implications for guided learning\n", "abstract": " This paper extends the work of the BRACElet project [17] by assessing the program comprehension skills of intermediate level students. Student performance on a pathfinder algorithm simulation task is reviewed to assess the students' comprehension levels, as categorized according to the SOLO educational taxonomy. The paper describes the nature of student responses, and the variety of representations provided, illustrating the role of discovery in effective student learning.", "num_citations": "4\n", "authors": ["1550"]}
{"title": "A global software project: Developing a Tablet PC capture platform for explanograms\n", "abstract": " Explanograms provide\" a sketch or diagram that students can play\"[10]. They are a directly recorded multi-media resource that can be viewed dynamically. Often they are used in teaching situations to provide animated explanations of concepts or processes. Explanograms were initially based upon proprietary paper and digital pen technology. The project outlined here augments that design by using a tablet PC as a mobile, general purpose capture platform which will interoperate with the existing server based system developed in Sweden. The design of this platform is intended to achieve both learning and research outcomes, in a research linked learning model for global software development. The project has completed an initial development phase during which a prototype has been built, and a consolidation, extension and evaluation phase is now underway. The origins and goals of the research, the …", "num_citations": "4\n", "authors": ["1550"]}
{"title": "Computing capstone projects and the role of failure in education\n", "abstract": " We held our end of semester capstone project presentations just the other day. Always an interesting experience, for students, audience and for me in particular as coordinator of our capstone project experience. Our Bachelor of Computer & Information Sciences degree has broadened recently to include several new majors. So now in addition to our traditional software development majors, we have seen a variety of project presentations from students majoring in IT Security, Information Services, Net Centric-computing and a student studying a conjoint degree majoring in accounting and software development. Several teams had a combination of students from these different majors. This of course raises challenges for us in sourcing, coordination and assigning of projects, as well as for supervisors in overseeing the more multi-disciplinary model of learning that these projects bring forth.", "num_citations": "4\n", "authors": ["1550"]}
{"title": "FITNZ-Graduate profiles for ICT education at senior secondary level\n", "abstract": " This paper proposes a set of curriculum models for ICT education at the senior secondary school level in New Zealand. These models arise from the Fluency in IT (“FITNZ Project”), a collaborative venture between tertiary and secondary sector educators, government and industry. The initiative is intended to address the poor alignment between tertiary education and the IT needs of the industry sector. The confused perceptions of ICT and the fragmented and uneven state of computing education at the secondary level have contributed to the disparity between tertiary education and industry needs. The paper draws on previous work on IT fluency by Larry Snyder. It also positions the computing disciplines within the ACM computing curricula 2004 document in order to propose a soundly based set of graduate outcomes.", "num_citations": "4\n", "authors": ["1550"]}
{"title": "Nga Iwi o Ngapuhi membership system: Relationship management and relational design\n", "abstract": " This paper reviews a capstone project undertaken by Auckland University of Technology (AUT) students to develop a tribal membership register for Te Runanga a Iwi o Ngapuhi. The initial scope of the project incorporated a database to record details of people, land, and their common history. As the project unfolded complex issues related to land, genealogical and historical relationships had to be addressed. The paper discusses the relationship between the clients and developers and the partnership model that was adopted. Research conducted to develop a suitable data model uncovered the GENTECH genealogical data model originated by genealogists in Texas. This model was adapted for this project to suit the unique needs of Maori. The paper describes the initial implementation of an online membership register and concludes with a critique of this model proposing further extensions to address the interactions between people, land and history.", "num_citations": "4\n", "authors": ["1550"]}
{"title": "Knowledge Skills and Abilities demanded of graduates in the new learning environment\n", "abstract": " Changes in technology and employer demands require that we regularly survey our stakeholder communities to ensure the relevance and currency of what we are teaching, and the qualifications we offer to prepare our students for practice. At a presentation to an IT breakfast of the NZCS Auckland Branch in October 1998, the audience were surveyed in order to gauge how well we were doing in developing tomorrow's practitioners. Topics surveyed were: the relative importance of different technical skills required by employers, the key trends that we need to prepare graduates for, the impact of the Internet on skills required, the most urgent up skilling requirements of employees and the relative value of vendor vs. formal Polytechnic qualifications. The results of the survey are reported, the key findings analysed and some strategies are suggested which address the identified gaps.", "num_citations": "4\n", "authors": ["1550"]}
{"title": "Developing Competency Statements for Computer Science Curricula: The Way Ahead\n", "abstract": " This Working Group aims to take the current approved Computer Science curricula document, CS2013, and redevelop it into competency statements. The CC2020 project has designed and built a prototype of a visualization tool to compare and contrast current computing curricula. Three basic approaches were taken to portray the base data that will be used for the tool: the first being expert-defined competencies, the second based on mining, and the third based on expert-defined knowledge areas. The visualization tool takes competency statements from each of the current approved computing curricula and visually represents them. Using competency to frame curricula and describe educational outcomes in computing is not new. Since the CC2005 report was published several additional curricula have appeared and the information technology, information systems, and software engineering communities have …", "num_citations": "3\n", "authors": ["1550"]}
{"title": "Everybody must cut code! educational imperative, fad or fantasy? D5 charter\n", "abstract": " POLITICAL MOMENTUM now seems to be growing towards ensuring the availability of computing education curricula in several countries, not only at the high school level but at even earlier stages of education. But what are the chances of these initiatives being successful? This column discusses recent developments in the context of earlier computing curricula implementations in a selected group of mostly western countries at the pre-university level. The challenges to be surmounted and the seeming lack of concern for the potentially negative side effects of hasty curriculum implementations are presented, then complemented with a critical projection of the likely eventual outcomes. In one example of such a development, recently the New Zealand Government became a signatory of the D5 Charter. Under the charter the D5 purports to represent “a group of the most digitally advanced governments in the world. The …", "num_citations": "3\n", "authors": ["1550"]}
{"title": "Supervision for critical thinking: challenges and strategies\n", "abstract": " INSIGHTS structured abstract does help in directing the course of a paper, and providing a brief initial summation that can be subjected to constructive critique. In the course of drafting their abstracts Daniela neatly rephrased this structure and broke the essence of a research article down to the elements shown in Figure 1. There is nonetheless a significant challenge posed by each of these short words, which seem to demand different degrees of critical thinking ability. A clear statement of objectives often seems to pose a challenge, as does the process of elaborating the methodological aspects of a study. While explaining the research context would appear straightforward, answering the why question and clearly outlining the rationale can often be a stumbling block. Most challenging of course is answering the ‘So what’question. Here the interpretation and teasing out the meaning of a paper has to be addressed …", "num_citations": "3\n", "authors": ["1550"]}
{"title": "PBRF 2012 and the Nature of Degree Teaching\n", "abstract": " For the Performance Based Research Funding Exercise of 2012, two principles for eligibility were enunciated by the New Zealand Tertiary Education Commission, whereby those submitted were firstly  expected to contribute to the learning environment at the degree level  and/or secondly  make a substantive contribution to research activity.   The accompanying eligibility guidelines defined how these principles were to be realized by participating Tertiary Education Organizations.  However the interpretation of the  teaching eligibility  guidelines appears to have been widely inconsistent between institutions.  This has raised  considerable debate relating to inclusion/exclusion of researchers and reporting of quality scores.  For the non University participants it also raises concerns for equity of treatment, and significant questions around the definition of degree level teaching.", "num_citations": "3\n", "authors": ["1550"]}
{"title": "Affective dimensions of computing education: an'education as drama'approach?\n", "abstract": " 2011 December• Vol. 2• No. 4 acm Inroads 13 is consistent with both the ‘development perspective’of [5] and the ‘transformative’perspective of [1]. The transformation outlined in the above quote moreover, echoes strongly Kuhn’s notion of a ‘paradigm’[3], or exposure to a set of core scientific practices by which novices are inculcated into a discipline. Such a perspective means that education is an inherently challenging and confronting experience for the student. In his keynote speech to the International Computing Education Research Conference (ICER 2011), Eric Mazur highlighted the importance of ‘confusion’to the student process of learning. This reflects the reality of learning being a messy and confronting process in which students actively need to engage, as opposed to mere teaching as a process that academics deliver. While the process of the adept supporting the journey of the apprentice is inherent, both …", "num_citations": "3\n", "authors": ["1550"]}
{"title": "THINKING ISSUES A'potted guide'to quality assurance for computing capstone projects\n", "abstract": " 2011 June• Vol. 2• No. 2 acm Inroads 15 in the latter case it does provide a global basis for measurement of consistency. A set of metrics typically accompany such standards, as a yardstick by which conformance to the standard can be demonstrated or a lack of conformance can be highlighted. For students, standards for coding and document formatting, or for recording meeting minutes may be relevant examples, where compliance with the quality standard can be objectively demonstrated. The typical notion that students begin with when considering QA is the idea of testing. However testing, while part of the QA armoury, is more properly classified as a quality control activity (QC) rather than QA. Rather than acting in an overarching role to help ensure quality–it is inherently part of the production function, but as a control check added on at the end. Testing is not adequate if used as the sole mechanism to assure …", "num_citations": "3\n", "authors": ["1550"]}
{"title": "Report on the eighth BRACElet workshop: BRACElet Technical Report, 01/08 AUT University, Auckland\n", "abstract": " This paper reports on the activities of the Eighth BRACElet workshop held 4 July 2008 concurrent with the NACCQ Conference at AUT University. The BRACElet project is a longitudinal multi-institutional multinational investigation into the code reading, code comprehension and code writing skills of novice programmers.", "num_citations": "3\n", "authors": ["1550"]}
{"title": "Thinking issues: assessment in computing education: measuring performance or conformance?\n", "abstract": " Critiquing the negative consequences of journal impact factor measurement on software engineering researchers, Offut has noted the amount of time many of us spend measuring and observed that \"measurement is very difficult\" [1]. Then proceeding to critique our measurements in the teaching context he asserted, \"We assign students grades in classes (a process once described as 'an inadequate report of an inaccurate judgment by a biased and variable judge of the extent to which a student has attained an undefined level of mastery of an unknown proportion of an indefinite amount of material')\" [1]. This paints a rather dismal picture of the grading process? Yet as computing educators can we really refute this argument?", "num_citations": "3\n", "authors": ["1550"]}
{"title": "An exploratory study into the impact of NACCQ research\n", "abstract": " This paper reports the findings of a preliminary investigation into the impact of research within the New Zealand National Advisory Committee on Computing Qualifications (NACCQ) sector. Using a strategy based predominantly upon keyword search of academic reference databases, the study found that NACCQ projects and publications are beginning to be cited in diverse outlets, and are now making a contribution to the international literature in the computing disciplines. The study and its findings are briefly reviewed and the outlets in which NACCQ research has been cited are tabulated. This paper establishes the first profile of international citations for NACCQ research and provides a replicable baseline for subsequent studies into the impact of research originating in the sector.", "num_citations": "3\n", "authors": ["1550"]}
{"title": "Developing Software in Bicultural Context: The Role of a SoDIS Inspection\n", "abstract": " This article introduces the SoDIS process to identify ethical and social risks from software development in the context of designing software for the New Zealand Maori culture. In reviewing the SoDIS analysis for this project, the tensions between two cultures are explored with emphasis on the (in) compatibility between a Maori worldview and the values embedded in the SoDIS process. The article concludes with some reflections upon the key principles informing the professional development of software and ways in which cultural values are embedded in supposedly neutral technologies, and reviews the lessons learned about avoiding colonization while working on a bicultural project.", "num_citations": "3\n", "authors": ["1550"]}
{"title": "Refining the SoDIS® Process in the field: A COTS Project as a context for Risk Analysis\n", "abstract": " In this paper we review the findings from an Industry collaborative research project. Software Development Impact Statements (SoDIS) have been applied to risk reduction and quality improvement in a software project using commercial off-theshelf software (COTS). The paper demonstrates how through two different applications of SoDIS inspections in the field, a “better practice” model for SoDIS inspections has resulted. Use of the SoDIS process has served to highlight critical risk management issues for consideration by both project managers and clients, even when implementing established commercial software. The metrics gathered demonstrate the viability of the SoDIS Inspection process as a risk assessment and quality improvement strategy even for COTS projects.", "num_citations": "3\n", "authors": ["1550"]}
{"title": "E-learning or e-Lemmings? Who pipes the tune?\n", "abstract": " This paper urges a rather more critical view of e-learning than that taken to date. It is argued that strong forces are converging to redefine education as a commercial rather than public activity, of which e-learning is one element. Inherently different perceptions of the teaching and learning process, based upon a commercial rather than a public model, combined with a certain amount of naïve technological progressivism are challenging the role of higher education. Poor implementations based upon flawed assumptions are also likely to lead to an e-learning bust in much the same way as the dot com phenomenon has collapsed under the weight of its own hype. The case is argued for diverse and informed models of education (including e-learning approaches) that nurture local cultures and values, and produce socialized, adaptable and capable citizens rather than captive globalised consumers, colonized by monoculture online.", "num_citations": "3\n", "authors": ["1550"]}
{"title": "Elearning to whose agenda? The discourse of enterprise v the discourse of community\n", "abstract": " One way of thinking of this interplay of competing values in higher education is through the concept of a “discourse”. A discourse operates as a mechanism in society to define social interaction, prescribe certain rules for that interaction, specify the boundaries of what can be said in a given context and prescribe which actors may legitimately speak or act. In a society we inhabit “discourse webs” in which different cultural perceptions and agendas are advanced. It is like a contest between different stories, either jousting to be told, or to define the rules dictating which stories are permitted to be told.In the E-Learning environment several discourses contest for space. One key dichotomy for higher education is that between the “discourse of enterprise” and the “discourse of community”. The discourse of enterprise comes from a neo-liberal interpretation of society, in which the economically rational or self-interested human being is primary. The cumulative result of each individual maximising self-interest, is held to generate maximal good for the whole.", "num_citations": "3\n", "authors": ["1550"]}
{"title": "Developing novice researchers understandings of research\n", "abstract": " This paper reports progress from an action research programme to develop an active research community amongst New Zealand computing educators. Since 1998 the National Advisory Committee on Computing Qualifications (NACCQ) has sponsored a number of \"Getting Started in Research Workshops\". Topics addressed in the workshops have included definitions of research, the maturity profiles of researchers and the nature of research conducted under different research paradigms. The workshops have developed from an initial educative and developmental focus for novice researchers, to one that now embodies more of a critical perspective, in which participants reflect upon and collectively discuss their own beliefs and understandings as educators and researchers within the NACCQ sector. This has required the development of specific self-assessment instruments. These include an instrument for assessing researcher maturity and a further instrument for self-assessment of paradigm preferences in curriculum development and research. Preliminary results from these self-assessments have been reported (Clear & Young, 2001) which give some insights into the understandings about research of computing educators and novice researchers in the sector. But developing and refining these self-assessment instruments is a continuing process. Since this self-assessment process has been undertaken as a means of actively modelling use of the critical method in research, determining forms of analysis that are consonant with this paradigm is a current issue for the authors. This paper will discuss the context, the instruments developed, review …", "num_citations": "3\n", "authors": ["1550"]}
{"title": "\" Eeating Our Seed Corn\" or restricting crop diversity?\n", "abstract": " Faculty of Commerce Auckland Institute of Technology, Private Bag 92006, Auckland 1020, New Zealand Tony. Clear@ ait. ac. nz~ he US phenome• non of postgraduate students being poached by industry before they have completed their studies, has been termed by Peter Denning as\" eating our seed com.\"[2] Meeting today's demands for industry may rob academic institutions of capable and qualified staff to teach computing tomorrow, or even today. This in turn may have local and global societal impacts.", "num_citations": "3\n", "authors": ["1550"]}
{"title": "THINKING ISSUES Software ecosystems: what do we need to know?\n", "abstract": " In my last column I discussed the educa-tional and curriculum challenges posed by scaled agile software development approaches [3]. These continue to arise as the discipline and the profession increasingly encompass broader global and business focused dimensions. Extending that line of argument, this column turns to the phenomenon of software ecosystems. What are software ecosystems, and what implications do they have for our students? What will they need to learn and how may they practice as future developers of software within a software ecosystem? We can think generally of a software ecosystem as an entity where an ecosystem owner provides not simply a software product but an underpinning platform. This platform offers a set of APIs through which external developers can connect and build applications. Common examples can be seen in “App Marketplaces,” such as those provided by Apple …", "num_citations": "2\n", "authors": ["1550"]}
{"title": "Developing a Holistic Understanding of Systems and Algorithms through Research Papers\n", "abstract": " Even though a computer science degree is unavoidably broken into semesters and courses, we always hope that our students form a holistic picture of the discipline by the time they graduate. Yet as educators, we do not have too many opportunities to make this point front and center for an extended period of time. This report es a well-defined portion of this problem: revealing conceptual connections between algorithmic courses (such as Discrete Math, Data Structures, Algorithms) and systems oriented courses (such as Organization, Computer Networks, Operating Systems, and Hardware) through the use of research papers. In particular, we provide a pedagogical framework as well as a set of carefully selected papers to crosscut our disciplinary space in a way that is orthogonal to conventional course design. This framework includes a paper taxonomy, strategies for covering topics that students are yet to …", "num_citations": "2\n", "authors": ["1550"]}
{"title": "THINKING ISSUES What's driving uber? values in computing and the'sharing economy'\n", "abstract": " The strongly technical focus of com-puter science as a discipline means that the underlying values behind the development and use of technology often become obscured. Hidden biases inherent in systems, based on AI and algorithmic processes, making important decisions affecting people’s lives [16] illustrate the need to more openly reveal these values. Debates such as the recent spat between Elon Musk and Mark Zuckerberg, around AI and the need to regulate software systems which critically influence the lives of many [18], will only intensify, and our students will need to be better prepared to address the issues involved.A critical question then is, can we reveal what values are driving our technology and the businesses based upon it? Disruptive new business models created by tech ventures and aggressive Silicon Valley start-ups are driving the so called ‘gig economy’[23] and new forms of ‘platform …", "num_citations": "2\n", "authors": ["1550"]}
{"title": "THINKING ISSUES Evaluating research impact in computing: a slippery slope?\n", "abstract": " This article draws on recent expe-rience of approaches to research measurement in an Australian and New Zealand University context, where governments and policy makers are actively experimenting with ways of measuring research impact. Perhaps, as governments grant substantial support to university research, that “leads to a natural concern for value for money on this ‘investment’”[11], and in a competitive research setting with demand outstripping funds available, valid mechanisms are sought for comparing the relative merits of research proposals [6]. Thus, evaluating the impact of research is an active theme within a wider research accountability agenda permeating UK and the Commonwealth countries. A comparable approach in the US context arising from the America COMPETES Reauthorization Act of 2010 [20] can be seen in the National Science Foundation’s inclusion of a broader impacts criterion …", "num_citations": "2\n", "authors": ["1550"]}
{"title": "IT industry employers expectations: our graduates deserve better!\n", "abstract": " INSIGHTS right things, without recruiters filtering on narrow product sets of the day? This mutually confusing state of affairs was reinforced to me in a recent publication [2], citing the comments of the President of the New Zealand Institute of IT Professionals about skill shortages as part of a systemic problem under a heading where IT was profiled as “the most misunderstood profession?” The article is full of inconsistencies and demonstrates the confused perspective of employers and industry analysts about highly specific and perishable product skills, versus broader skills sets demanded for more senior roles. On the one hand the comments of the author, Coulson, include statements such as “an increased demand for positions with emerging technologies” and “a potential skill gap for workers with web development, mobile applications and cloud computing experience in the future.” And,“the employment of highly …", "num_citations": "2\n", "authors": ["1550"]}
{"title": "The fate of computing in research performance evaluation schemes–ERA vs PBRF\n", "abstract": " The prevailing ‘audit culture’ in national governments has seen a global proliferation of research performance evaluation schemes. Most recently the Excellence in Research for Australia (ERA) results have been published. The results from this bibliometrically based ranking exercise provide an interesting comparison with the earlier results from New Zealand’s Performance Based Research Fund (PBRF) exercise. With a focus on the computing disciplines this paper sets these developments in the global context; compares the outcomes under each scheme; the extent to which the prevailing publication cultures have been supported or undermined; the scope for such schemes to render whole sub-disciplines invisible and the potential impacts for the computing disciplines from such exercises.", "num_citations": "2\n", "authors": ["1550"]}
{"title": "PBRF 2006 Results: How did the NACCQ sector fare\n", "abstract": " The recent release of the 2006 Performance Based Research Fund (PBRF) results represents the second time the PBRF assessment has been conducted in New Zealand, with the normal period between rounds planned for every six years. The first assessment took place in 2003, a round in which most ITP’s (except Wintec and Unitec) decided not to participate, given the decided skew of the exercise towards the established research intensive universities with medical schools. This intermediate round was intended to enable institutions to address any anomalies and issues identified in the first round. For institutions newer to the research endeavour it also offered an opportunity for emerging researchers to be submitted for assessment. In the 2006 round a further eight ITP’s participated, aiming to win back at least some proportion of the funds lost to their institutions, although some still boycotted the exercise..", "num_citations": "2\n", "authors": ["1550"]}
{"title": "On the necessity of removing\" cruelty\" from the teaching of computing\n", "abstract": " In his famous article [1] Edsger Dijkstra reflected upon how cruel it would be truly to teach computer science. For some reason the CS community over the years have taken the sadistic element of his entreaties to heart. Why is this so? Does it have intuitive appeal to those CS educators who believe in the \"hard man\" school of computer science and the \"real programmers don't eat quiche\" model of education?", "num_citations": "2\n", "authors": ["1550"]}
{"title": "Virtual Groups, Collaborative Trials and Tribulations\n", "abstract": " This paper reports lessons learnt from an international collaborative trial held in semester 2 2001; one in a series of collaborative learning trials which have been conducted between virtual groups of students at Auckland University of Technology and Uppsala University in Sweden. Trials have used a custom developed groupware application, incorporating a cybericebreaker phase, which students complete, preparatory to collaboration on a common task. Outcomes of the trial are analysed and issues contributing to its partial success are explored, which leads to insights into the role of technology use mediation in virtual group and web-based groupware contexts.", "num_citations": "2\n", "authors": ["1550"]}
{"title": "Using IT for active student feedback in the learning environment\n", "abstract": " This paper describes the use of a web-based groupware product (specifically a Lotus NotesTM & DominoTM discussion database), as a means of gaining direct and regular feedback from students on the progress of a course. Some of the pitfalls and issues are discussed, including motivation for use, barriers to effective feedback, the value of anonymity and appropriate netiquette. Some recommendations are made for others wishing to use such a feedback mechanism, and for those who do not have Lotus Notes installed, how a feedback system such as this might be implemented in some other web based product.", "num_citations": "2\n", "authors": ["1550"]}
{"title": "Client Relationships–A Proven Approach\n", "abstract": " CONCLUSIONOverall, using the Feature-Driven Development methodology has improved the relationship between our client and us, by allowing the client to consider priorities and goals when planning each release, and accordingly change their requirements specifications as the business evolves. The delivery of functionality constantly throughout the project time frame is another advantage. It also allowed us, as developers, to better estimate the time cost of each feature, allow for project creep, and to therefore have better control over the project as a whole.", "num_citations": "2\n", "authors": ["1550"]}
{"title": "The Contradiction of Agile Measures: Customer as Focus, but Process as Measured?\n", "abstract": " Performance measures are being used in the agile approach as a powerful tool to understand the customer's impact of a software delivery. However, it is common to find measures related to the process instead of the customer, which would cause the team to forget the customer value delivery.  This research study adopts a systematic mapping process to understand which agile approach is related to performance measures, what kind of measures are being used, and if the papers are focused on product measures or process measures.  The analyzed articles showed that Scrum is the most frequently referenced agile approach that mentions measures. However, the review shows that the focus was on process measurements, while, despite the rhetoric about customer focus and agility, product measurements appear less important.  This result opens the way for future research to explore the consequences of adopting performance measures that are related to this high emphasis on the process.", "num_citations": "1\n", "authors": ["1550"]}
{"title": "THINKING ISSUES Global software engineering and scaled agile: pushing the boundaries of the discipline?\n", "abstract": " Working with my colleague Ramesh Lal recently—researching developments in global software engineering (GSE) supported by scaled agile development methods [10, 11]—has raised questions for me about the tunnel vision of our curricula. We need a broader roadmap! In this column, the needs of software professionals working in large scale agile settings are compared to two ACM curriculum models, gaps are identified, and new areas of focus highlighted. This is driven by the arguable premise that most graduates of computer science and software engineering programs are likely to be working in software intensive roles and industries. So how well are we preparing them for those roles?The reality of modern software engineering practice is that developers increasingly work in global settings and distributed teams [3, 4]. Lean and agile practices are becoming more prevalent in both local and global contexts [7 …", "num_citations": "1\n", "authors": ["1550"]}
{"title": "Motivation, Optimal Experience and Flow in First Year Computing Science\n", "abstract": " We examine the concept of motivation from the perspective of Self Determination Theory and give a brief overview of relevant results. We also consider the optimal state known as\" Flow\" and give an account of its conceptualisation in the theory due to Csikszentmihalyi. After discussion of ways in which these concepts can be measured, we describe a set of preliminary studies that investigate motivation and flow in the context of a first year computing class. We analyse student responses to enquiries about perceptions of motivation and flow experiences and look at links between them. We also discuss intrinsic motivation within the subject.", "num_citations": "1\n", "authors": ["1550"]}
{"title": "A foundation programme preparing students for future study in Computing and Engineering Degrees\n", "abstract": " This paper presents the Certificate of Science and Technology (CertScT) a pre-degree programme at Auckland University of Technology in New Zealand, developed with the aim of preparing students to undertake degree level study in Science, Technology, Engineering and Mathematics (STEM) subjects. The history, context and rationale for the programme is outlined together with its structure and content, and pedagogical and programme level strategies that have been adopted to encourage student success. The authors reflect on the success of the programme to date in achieving its aims, based upon observation, reflections and data from internal evaluations of the programme. The paper notes the challenges for the programme posed by external metrics which the New Zealand Government has adopted. The paper concludes with a commentary on the success of the programme in achieving its goals, and the …", "num_citations": "1\n", "authors": ["1550"]}
{"title": "Framing a research study\n", "abstract": " FOR STUDENTS INEXPERIENCED IN undertaking a research study the whole process can be something of a mystery. Framing a research study also poses a challenge for educators, who must find quick and simple ways to scaffold learning to help students understand the research process. This is especially true when the aim is to complete a shorter study within a postgraduate or senior undergraduate course. Some postgraduate programs will have a specialized research methods [5] course as part of the curriculum, which may ease the task. However, in many cases, students quite new to research may be required to undertake a research study lacking any clear notion of process or method. So often some form of apprenticeship model is operated where the research design is laid out by the educator for the student to follow (eg, a given experimental design or a set of predefined simulation scenarios to run). Yet …", "num_citations": "1\n", "authors": ["1550"]}
{"title": "A reflection on the first run of the Runestone Project at Tongji University: Observations on cross cultural distributed teams vs face to face teams\n", "abstract": " China has long been an education import nation, so non-commercial and mutually beneficial collaborations between Chinese and Western universities are rare. Nevertheless, the School of Software Engineering at Tongji University in China has developed mutually beneficial collaboration with several Western universities, among them the most important partner is Uppsala University. In spite of the great challenges encountered by both sides during developing and conducting the collaboration due to their sharply contrasting cultural backgrounds and different educational and political systems, the collaboration between the institutions has been deepening and widening steadily and continuously. Following successful student and teacher exchange programs, the Rune stone project was launched between Uppsala and Tongji Universities in 2009. It was taken as a triumph that the Sino-Swedish globally distributed …", "num_citations": "1\n", "authors": ["1550"]}
{"title": "Google™-\" do no evil\" yeah right!\n", "abstract": " I suppose any company with a motto of \"do no evil\", sets a pretty unachievable standard. But for \"Google™ the good', the corporate image is rapidly becoming more tarnished. Quite apart from the controversial debates about supporting censorship in China, we are seeing the increasing tensions between Google as the liberal promoter of scientific neutrality, and Google as the global, corporate juggernaut. What is becoming apparent is the need for online search engines to adopt a moral and ethical code relating to the use of information as both a raw material and a fertile mine collated from other sources.", "num_citations": "1\n", "authors": ["1550"]}
{"title": "Students becoming political and\" incorrect\" through agile methods\n", "abstract": " At the risk of being condemned as a software engineering heretic, it seems to me that notions of accuracy and correctness of software have intuitive appeal, but are difficult if not impossible to achieve in practice. The search for this chimera of\" correctness\" has misled many highly intelligent and technically capable developers into the quest for rigour in design, rather than rigour in requirements. But what does rigour in requirements mean? If we believe, with Boehm and colleagues [1] that\" There is no complete and well defined set of requirements ready to be discovered in system development\", what then is the requirements correctness criterion? And furthermore what is the correctness criterion for an implemented software system.", "num_citations": "1\n", "authors": ["1550"]}
{"title": "Software engineering and the academy: Uncomfortable bedfellows?\n", "abstract": " With software engineering (S. E.) now beginning to emerge as a distinct discipline, through initiatives such as the SWEBOK [1], the growth of undergraduate programmes in the U.S. [2] and collaborative efforts to offer programmes with breadth and depth [3], the challenges for the academy in balancing rigour and relevance can only become more intense. For some reason the contrast between the academic and the professional perspectives within the software engineering community is quite marked.", "num_citations": "1\n", "authors": ["1550"]}
{"title": "Genre structuring in a web-based groupware medium: the evolution of a project progress report\n", "abstract": " Information Technology supported teaching and learning typically borrows many teaching practices and instruments from previous contexts. These typical practices or instruments can be classified into recognizable types or \"genres\". There are different ways in which these genres cross the boundaries of action, voice or paper based techniques to their electronically provided alternates. This study applies the framework of \"genre structuring\" to explore the evolution of a project progressreporting mechanism, re-implemented in a web-based groupware application, and used in several different Information Technology courses over the last three years.", "num_citations": "1\n", "authors": ["1550"]}
{"title": "Programming in context—the next step\n", "abstract": " I n the last column I argued that\" what we call information systems are really only a part of human memfing systems\"[4]. Much of the emphasis for information systems then should relate to questions of meaning and use rather than of structure and coding as discussed in the frmnework outlined in the previous coIumn. But traditionally, most of the emphasis in our teaching of computing has been at the syntactic or structural level.Commonly in the teaching of computing the primary focus is on the topic of programming.\" So what do we actually do when we program?\" Naur [5] suggested that it involves a process of theory building, whereby the programmer comes to possess a theory of the program which relates to the affairs of the world that it helps to handle. Effectively, the programmer abstracts the cultural context being addressed, and maps that into the program text which freezes those behaviours into software …", "num_citations": "1\n", "authors": ["1550"]}