{"title": "Einführung in die Wissensrepräsentation: netzartige und schema-basierte Repräsentationsformate\n", "abstract": " Das vorliegende Buch ist aus Vorlesungen, die ich zu diesem Thema an der Universität Konstanz gehalten habe, entstanden. Es gibt eine Einführung in die Wissensrepräsentation, bei der netzartige und schema-basierte Repräsentationsformate, also semantische Netze, Frames und Scripts, im Vordergrund stehen. Daneben wird auch auf Logik, Produktionsregeln und analoge Repräsentationsformate eingegangen, um den Vergleich zwischen den Repräsentationsformaten zu ermöglichen und um die thematische Vollständigkeit sicherzustellen. Für alle Formate wird gezeigt, wie sie zur Repräsentation von Wissen verschiedener Art eingesetzt werden können. Sie werden dabei jeweils anhand der in der Einleitung vorgestellten Wissensarten diskutiert. Im Vergleich werden so ihre Stärken und Schwächen deutlich (siehe die Tabelle auf Seite 27). Als Lehrbuch konzipiert enthält das Buch Übungsaufgaben und zugehörige Lösungen.Ein besonderes Anliegen des Buches besteht darin, die häufig anzutreffende Vermischung verschiedener Betrachtungsebenen (Wissensarten, Repräsentationsformate, Repräsentationssprachen) zu vermeiden, durch ihre explizite Unterscheidung diese dem Leser nahe zu bringen und eine entsprechend strukturierte Sicht auf das Gebiet der Wissensrepräsentation zu ermöglichen. Dazu werden im Einleitungskapitel losgelöst von der Behandlung der verschiedenen Repräsentationsformate (Kapitel 2 bis 4) die im Buch betrachteten Wissensarten eingeführt.", "num_citations": "146\n", "authors": ["593"]}
{"title": "On-To-knowledge: semantic web-enabled knowledge management\n", "abstract": " On-To-Knowledge builds an ontology-based tool environment to improve knowledge management, dealing with large numbers of heterogeneous, distributed, and semistructured documents typically found in large company intranets and the World-Wide Web. The project’s target results are: (i) a toolset for semantic information processing and user access; (ii) OIL, an ontology-based inference layer for the World-Wide Web; and (iii) an associated methodology and validation by industrial case studies. This chapter offers an overview of the On-To-Knowledge approach to knowledge management.", "num_citations": "74\n", "authors": ["593"]}
{"title": "Text condensation as knowledge base abstraction\n", "abstract": " A model of knowledge-based text condensation is presented which has been implemented as part of the text information system TOPIC. Two major processes are considered in detail, text parsing and text condensation with emphasis on the latter. Based on principles of semantic parsing, the text parser serves the purpose to augment the initial domain knowledge base with the knowledge encoded in a text, thus generating a specific text knowledge base. A condensation process then transforms these text representation structures into a more abstract thematic description of what the text is about, filtering out irrelevant knowledge structures and preserving only the most significant concepts. Finally, a hierarchical representation of the thematic units of the text is generated in terms of a text graph which supports variable degrees of abstraction for text summarization as well as content-oriented retrieval of text knowledge.", "num_citations": "71\n", "authors": ["593"]}
{"title": "Eule: a knowledge-based system to support business processes\n", "abstract": " Office tasks related to the processing of contracts in the insurance business are complex and highly dependent on legal and company-specific regulations. Furthermore, due to increasing competition on the market there is a strong pressure to increase the efficiency and quality of office task performance. The only way to meet these manifold requirements is to provide a computer-based guidance and interactive support for office workers. At Swiss Life, we have developed the EULE system that fulfills these requirements. EULE's functionality is in the triangle of Knowledge Representation, Business Process Modeling, and Knowledge Management — the latter because EULE encodes and stores knowledge which is crucial for the company. The system relies on a knowledge representation language which covers data and process aspects as well as the relevant legislation and company regulations.", "num_citations": "68\n", "authors": ["593"]}
{"title": "Knowledge integration for building organizational memories\n", "abstract": " The paper starts with a discussion of the roles an organizational memory (OM) should play and what kind of knowledge should go into it. We then identify two kinds of integration problems. The rst one is concerned with integrating the knowledge bases of di erent knowledge-based systems employed in an organization into one physically or virtually uni ed knowledge base which is to be considered as part of the organization's OM. The second problem concerns the integration of several representations of the same knowledge with di erent degrees of formalization, ranging from formally represented knowledge via semi-structured text to plain text. It is argued to solve the two integration problems by making use of a high-level language whose representation ontology is explicitly de ned. Such a language is rather comprehensive, but only parts of it are used at a time and actual inferencing is done in optimized, low-level formalisms to which this language is compiled.", "num_citations": "53\n", "authors": ["593"]}
{"title": "On-To-Knowledge: ontology-based tools for knowledge management\n", "abstract": " On-To-Knowledge, the European EU-IST project No. 10132, builds an ontology-based tool environment to speed up knowledge management, dealing with the large numbers of heterogeneous, distributed, and semi-structured documents typically found in large company intranets and the World-Wide Web. Results aimed for by the project are:(1) a toolset for semantic information processing and user access;(2) OIL, an ontologybased inference layer on top of the World-Wide Web;(3) an associated methodology;(4) validation by industrial case studies. This paper gives an overview of the On-To-Knowledge approach to knowledge management.", "num_citations": "43\n", "authors": ["593"]}
{"title": "Fundamental conceptual modeling languages in OMiLAB\n", "abstract": " Regardless of the application domain, both the analysis of existing systems and the creation of new systems benefit extensively from having the system modeled from a conceptual point of view in order to capture its behavioral, structural or semantic characteristics, while abstracting away irrelevant details. Depending on which relevant details are assimilated in the modeling language, modeling tools may support different degrees of domain-specificity. The boundaries of what domain-specific means are as ambiguous as the definition of a domain—it may be a business sector, a paradigm, or a narrow application area. However, some patterns and invariants are recurring across domains and this has led to the emergence of commonly used modeling languages that incorporate such fundamental concepts. This chapter focuses on the metamodeling approach for the hybridization of BPMN, ER, EPC, UML and …", "num_citations": "40\n", "authors": ["593"]}
{"title": "Organizational memory supported workflow management\n", "abstract": " Business processes are by nature information-intensive and require IT support. Database systems solve the basic need for secure and efficient data storage and access. As such they are well-understood and widely applied. Workflow management systems, currently being added to support and optimize formal business processes, distribute jobs among employees. Recently, researchers and practioners started to promote the idea to explicitly represent the knowledge of the enterprise as so-called “Organizational Memory”.           Such knowledge includes the goals of the enterprise, its tasks, its rules and its resources. This article investigates the interrelationship and interplay of organizational memory systems with workflow management systems. We describe experiences gained from a concrete integration project at Swiss Life, an insurance company mainly engaged in the private life insurance and pension …", "num_citations": "33\n", "authors": ["593"]}
{"title": "Topic essentials\n", "abstract": " An overview of TOPIC is provided, a knowledge-based text information system for the analysis of Germanlanguage texts. TOPIC supplies text condensates (summaries) on variable degrees of generality and makes available facts acquired from the texts. The presentation focuses on the major methodological principles underlying the design of TOPIC: a frame representation model that incorporates various integrity constraints, text parsing with focus on text cohesion and text coherence properties of expository texts, a lexlcally distributed semantic text grammar in the format of word experts, a model of partial text parsing, and text graphs as appropriate representation structures for text condensates.", "num_citations": "32\n", "authors": ["593"]}
{"title": "Ontology-based skills management: goals, opportunities and challenges\n", "abstract": " Establishing electronically accessible repositories of people’s capabilities, experiences, and key knowledge areas is key in setting up Enterprise Knowledge Management. A skills repository can be used for eg finding people, staffing, skills gap analysis, and professional development. The ontology based skills management system developed at Swiss Life uses RDF schema for storing ontologies. Its query interface is based on a combined RQL and HTML query engine.", "num_citations": "31\n", "authors": ["593"]}
{"title": "FRM: ein Frame-Repräsentationsmodell und seine formale Semantik: zur Integration von Datenbank-und Wissensrepräsentationsansätzen\n", "abstract": " Das Buch stellt FRM vor, ein Frame-basiertes Modell zur Repräsentation von Wissen. Der Schwerpunkt liegt dabei auf der Ausarbeitung der Semantik seiner Repräsentationskonstrukte. Zur formalen Spezifikation dieser Semantik werden Integritätsbedingungen formuliert, die unzulässige, in jedem Fall bedeutungslose Repräsentationsstrukturen ausschließen. Damit wird die Basis gelegt für ein Wissensverwaltungssystem, das die Einhaltung dieser Integritätsbedingungen überwacht und somit die Gewährleistung der Validität einer Wissensbasis zu einem beträchtlichen Teil übernehmen kann. Ein (e) Wissensingenieur (in), der/die insbesondere beim Aufbau großer, vernetzter Wissensbasen Schwierigkeiten hat, die Übersicht zu bewahren, kann dadurch erheblich entlastet werden, und es wird somit ein Beitrag geleistet, die bei der Erstellung großer Wissensbasen entstehende Komplexitätsbarriere aufzubrechen. Neben der Spezifikation der Repräsentationsstrukturen von FRM werden auch Anfrage-und integritätserhaltende Änderungsoperationen diskutiert, womit ein häufig in Wissensrepräsentationssprachen anzutreffendes Defizit vermieden wird. Die Darstellung schlägt eine Brücke zwischen Ansätzen aus dem Datenbankbereich und dem Bereich der Künstlichen Intelligenz (KI). So ist der Gegenstand eines Frame-Repräsentationsmodells mit seinen mächtigen Modellierungsmöglichkeiten eindeutig ein KI-Thema, während die Aspekte der Integritätserhaltung, die sich aus dem Bedarf nach einer Unterstützung großer Datenmengen ableiten, eher typisch für die Betrachtungsweise im Datenbankbereich sind. Entsprechend werden Bezüge …", "num_citations": "30\n", "authors": ["593"]}
{"title": "Automatic generation of hypertext knowledge bases\n", "abstract": " A model of knowledge-based text condensation is presented which has been implemented as part of the text analysis system TOPIC. The condensation process transforms the text representation structures resulting from the text parse into a more abstract thematic description of what the text is about, filtering out irrelevant knowledge structures and preserving only the most salient concepts. The topical structure of a text, finally, is represented in a hierarchical text graph which supports variable degrees of abstraction for text summarization as well as content-oriented retrieval of text knowledge. Due to their non-linear organization, text graphs share a lot of similarities with hypertexts. Their contribution to this field incorporates a methodology for the automatic generation of hypertexts from given full-text files, a close coupling of basic hypertext notions (links, nodes) to the formal specifications of a frame representation …", "num_citations": "28\n", "authors": ["593"]}
{"title": "A Data Mining Support Environment and its Application on Insurance Data.\n", "abstract": " Huge masses of digital data about products, customers and competitors have become available for companies in the services sector. In order to exploit its inherent (and often hidden) knowledge for improving business processes the application of data mining technology is the only way for reaching good and efficient results, as opposed to purely manual and interactive data exploration. This paper reports on a project initiated at Swiss Life for mining its data resources from the life insurance business. Based on the Data Warehouse MASY collecting all relevant data from the OLTP systems for the processing of private life insurance contracts, a Data Mining environment is set up which integrates a palette of tools for automatic data analysis, in particular machine learning approaches. Special emphasis lies on establishing comfortable data preprocessing support for normalised relational databases and on the management of meta data.", "num_citations": "26\n", "authors": ["593"]}
{"title": "EULE2: A knowledge-based system for supporting office work\n", "abstract": " At Swiss Life, as in many other companies, office workers for customer support are no longer specialists dealing with certain kinds of office tasks only, but are becoming generalists who must deal with all kinds of tasks. There are many laws and company regulations which take influence on how a certain task is to be performed properly. As a consequence, the work of this new generation of office workers is quite demanding and urgently calls for a better support. For this purpose, the Information Systems Research Group of Swiss Life has developed a knowledge-based system, called EULE2, that aims at providing a user with a maximal guidance in performing office tasks he may not be familiar with. A research prototype is completed and we are now in the phase of developing the first official version which is intended to become deployed.In the following, Section 2 characterizes EULE2 as a user sees the system …", "num_citations": "25\n", "authors": ["593"]}
{"title": "A formal model of text summarization based on condensation operators of a terminological logic\n", "abstract": " We present an approachto text summanzatlon that m entirely rooted m the formal descnptlon of a classtficatmn-based model of termmologlcal knowledge representahon and reasoning Text summarization m conmdered an operator-based transformation process by which knowledge representation structures, as generated by the text understander, are mapped to conceptually condensed representahon structures forming a text summary at the representation level. The framework we propose offers a variety of subtle parameters on which scalable text summarlzahon can be based", "num_citations": "25\n", "authors": ["593"]}
{"title": "Ontology‐based knowledge management at work: the Swiss Life case studies\n", "abstract": " This chapter contains sections titled:   Introduction   Skills Management   Automatically Extracting a ‘Lightweight Ontology’ from Text   Conclusions", "num_citations": "23\n", "authors": ["593"]}
{"title": "Semantic parsing and summarizing of technical texts in the TOPIC system\n", "abstract": " An overview of TOPIC is provided, a knowledge–based text information system for the analysis of German–language texts. TOPIC supplies text condensates (summaries) on variable degrees of generality and makes available facts acquired from the texts. The paper focuses on the major methodological principles underlying the design of TOPIC: a frame representation model that incorporates various integrity constraints, text parsing with focus on text cohesion and text coherence properties of expository texts, a lexically distributed semantic text grammar in the format of word experts, a model of partial text parsing, and text condensation procedures which finally yield a text graph as an appropriate representation structure for a text condensate.", "num_citations": "20\n", "authors": ["593"]}
{"title": "A representation construct for roles\n", "abstract": " This paper introduces a construct for representing concepts together with the roles they can play. Its definition is based on facilities for representing generalization (is-a), classification (instance-of), property domains and actual properties. Although for illustation purposes a frame data model is used as a formal basis, the role construct can be adopted by any other data model (or knowledge representation model) which supports these facilities. The semantics of the role construct is specified by integrity constraints which cover, besides other aspects, a facility for sharing properties among roles. Operational characteristics are described with respect to the most relevant modification operations. A comparison with the various intuitive notions of roles which currently exist shows that they all can be reinterpreted in terms of the role construct and their meaning thus be made explicit.", "num_citations": "19\n", "authors": ["593"]}
{"title": "Cooperative support for office work in the insurance business\n", "abstract": " Office tasks related to processing of contracts in the insurance business are complex and highly dependent on legal and company-specific formal regulations. On the other hand, the increasing competition strongly influences efficiency as well as quality requirements and makes such activities very dealing with critical for the company success. This paper describes the main ideas behind the EULE system implemented at Swiss Life to provide computer based guidance and interactive support for typical office tasks dealing with private life insurance. The system relies on a knowledge representation language which covers data and process aspects including encoding of the relevant regulation contexts. Based on specifications in this language a compiler enables the automatic generation of executable systems. Furthermore, we sketch the embedding of EULE into a general advanced software architecture, in particular …", "num_citations": "18\n", "authors": ["593"]}
{"title": "Frames, Objects and Relations: Three Semantic Levels for Knowledge Base Systems.\n", "abstract": " We propose an architecture for large-scale knowledge base systems based on database technologies and the three levels of semantic construct-frames, objects and relations. The intermediate object level retains the structural semantics of the frame level and is therefore bene cial in bridging the semantic gap between the frame and relational levels and enabling the use of semantic information in query optimisation. Speci cally, we outline how this approach has been adopted in the hybrid knowledge base system, HYWIBAS.", "num_citations": "17\n", "authors": ["593"]}
{"title": "Automatic acquisition of terminological knowledge from texts\n", "abstract": " Automatic acquisition of terminological knowledge from texts | Proceedings of the 9th European Conference on Artificial Intelligence ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleProceedingsECAI'90Automatic acquisition of terminological knowledge from texts Article Automatic acquisition of terminological knowledge from texts Share on Author: Ulrich Reimer View Profile Authors Info & Affiliations Publication: ECAI'90: Proceedings of the 9th European Conference on Artificial IntelligenceJanuary 1990 Pages 547–549 0citation 0 Downloads Metrics Total Citations0 Total Downloads0 Last 12 Months0 Last 6 weeks0 Get Citation Alerts …", "num_citations": "17\n", "authors": ["593"]}
{"title": "Recognizing Sleep Stages with Wearable Sensors in Everyday Settings.\n", "abstract": " The paper presents results from the SmartSleep project which aims at developing a smartphone app that gives users individual advice on how to change their behaviour to improve their sleep. The advice is generated by identifying correlations between behaviour during the day and sleep architecture. To this end, the project addresses two sub-tasks: detecting a user’s daytime behaviour and recognising sleep stages in an everyday setting. The focus of the paper is on the second task. Various sensor devices from the consumer market were used in addition to the usual PSG sensors in a sleep lab. An expert assigned a sleep stage for every 30 seconds. Subsequently, a sleep stage classifier was learned from the resulting sensor data streams segmented into labelled sleep stages of 30 seconds each. Apart from handcrafted features we also experimented with unsupervised feature learning based on the deep learning paradigm. Our best results for correctly classified sleep stages are in the range of 90 to 91% for Wake, REM and N3, while the best recognition rate for N2 is 83%. The classification results for N1 turned out to be much worse, N1 being mostly confused with N2.", "num_citations": "16\n", "authors": ["593"]}
{"title": "Heuristic text parsing in TOPIC: methodological issues in a knowledge based text condensation system\n", "abstract": " Heuristic text parsing in TOPIC Methodological issues in a knowledge-based text condensation system - OpenGrey fra | eng OpenGrey Open System for Information on Grey literature in Europe Home Search Subjects Partners Export Help Search XML To cite or link to this reference: http://hdl.handle.net/10068/148683 Title : Heuristic text parsing in TOPIC Methodological issues in a knowledge-based text condensation system Authors : Hahn, U. ; Reimer, U. ; Corporate author : Konstanz Univ. (Germany). Lehrstuhl fuer Informationswissenschaft. ; Bundesministerium fuer Forschung und Technologie (BMFT), Bonn (Germany) ; Publication year : 1983 Language : English ; Pagination/Size : 22 p. ; SIGLE classification : 09H - Computer software, programming ; Document type : I - Miscellaneous ; Gov't Doc # : PT 200.08 ; Other identifier : DE ; DE_ 1987:82100 ; handle : http://hdl.handle.net/10068/148683 Edition : 2. ed. ; …", "num_citations": "16\n", "authors": ["593"]}
{"title": "Process support for increasing participation in eParticipation\n", "abstract": " The lack of user acceptance of e-participation initiatives has been attributed to several factors, among them lack of motivation, poor transparency of process and lack of traceability of contributions. These deficits cannot be overcome by compliance with usability and accessibility guidelines. To increase user participation it is suggested to align such initiatives with the requirements of civil society groups who are more successful in mobilising public engagement and less with government requests. To enable and empower such groups to set up and maintain e-participation initiatives, a functional navigator for guiding users in configuring a platform as well as process support components are required. The latter focus on the transitions between different phases. The paper outlines how such an approach can be implemented to achieve a transparent circular flow of information and opinion between citizens and policy-makers in a collaborative environment which supports formal and informal political actors to work in partnership.", "num_citations": "15\n", "authors": ["593"]}
{"title": "Automatic knowledge acquisition from texts: Learning terminological knowledge via text understanding and inductive generalization\n", "abstract": " CiNii 論文 - Automatic Knowledge Acquisition from Texts: Learning Terminological Knowledge via Text Understanding and Inductive Generalization CiNii 国立情報学研究所 学術情報ナビゲータ [サイニィ] 日本の論文をさがす 大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考文献 出版年 年から 年まで 検索 検索 検索 CiNiiのサービスに関する アンケートを実施中です（11/11(水)-12/23(水)） CiNii Researchプレ版の公開について Automatic Knowledge Acquisition from Texts: Learning Terminological Knowledge via Text Understanding and Inductive Generalization REIMER U. 被引用文献: 1件 著者 REIMER U. 収録刊行物 Proc. 5th Banff Workshop on Knowledge Acquisition for Knowledge-Based Systems Proc. 5th Banff Workshop on Knowledge Acquisition for Knowledge-Based Systems, 1990 被引用…", "num_citations": "15\n", "authors": ["593"]}
{"title": "Mobile stress recognition and relaxation support with smartcoping: User-adaptive interpretation of physiological stress parameters\n", "abstract": " The paper describes a mobile solution for the early recognition and management of stress based on continuous monitoring of heart rate variability (HRV) and contextual data (activity, location, etc.). A central contribution is the automatic calibration of measured HRV values to perceived stress levels during an initial learning phase where the user provides feedback when prompted by the system. This is crucial as HRV varies greatly among people. A data mining component identifies recurrent stress situations so that people can develop appropriate stress avoidance and coping strategies. A biofeedback component based on breathing exercises helps users relax. The solution is being tested by healthy volunteers before conducting a clinical study with patients after alcohol detoxification.", "num_citations": "14\n", "authors": ["593"]}
{"title": "On-to-knowledge: Semantic web enabled knowledge management\n", "abstract": " On-To-Knowledge builds an ontology-based tool environment to speed up knowledge management, dealing with large numbers of heterogeneous, distributed, and semi-structured documents typically found in large company intranets and the World Wide Web. The project’s target results are:(1) a toolset for semantic information processing and user access;(2) OIL, an ontology-based inference layer on top of the World Wide Web;(3) an associated methodology and validation by industrial case studies. This paper offers an overview of the On-To-Knowledge approach to knowledge management.", "num_citations": "14\n", "authors": ["593"]}
{"title": "On-to-knowledge in a nutshell\n", "abstract": " The World Wide Web (WWW) has drastically changed the availability of electronically available information. Currently, there are around 3 billion documents in the WWW, which are used by more than 500 million users internationally. And that number is growing fast. However, this success and exponential growth makes it increasingly difficult to find, to access, to present, and to maintain the information required by a wide variety of users. Ontologies and semantic web technology will improve this situation [Fensel, 2001]. On-To-Knowledge builds an ontology-based tool environment to speed up knowledge management, dealing with large numbers of heterogeneous, distributed, and semi-structured documents typically found in large company intranets and the World Wide Web. The project’s target results are:(1) a toolset for semantic information processing and user access;(2) OIL, an ontology-based inference layer on top of the World Wide Web;(3) an associated methodology and validation by industrial case studies. This paper offers an overview of the On-To-Knowledge approach to knowledge management.", "num_citations": "14\n", "authors": ["593"]}
{"title": "Mining insurance data at swiss life\n", "abstract": " Huge masses of digital data about products, customers and competitors have become available for companies in the services sector. In order to exploit its inherent (and often hidden) knowledge for improving business processes the application of data mining technology is the only way for reaching good and efcient results, as opposed to purely manual and interactive data exploration. This paper reports the rst steps of a project initiated at Swiss Life for mining its data resources from the life insurance business. Based on the Data Warehouse MASY collecting all relevant data from the OLTP systems for the processing of private life insurance contracts, a Data Mining environment is set up which integrates a palette of tools for automatic data analysis, in particular machine learning approaches.", "num_citations": "14\n", "authors": ["593"]}
{"title": "A Formal Approach to the Semantics of a Frame Data Model.\n", "abstract": " Standard knowledge representation languages are seriously lacking an explicit formal semantic specification. This may cause considerable trouble when applied to large amounts of rapidly changing data.Based on an abstract data type view of knowledge representation languages a formal definition of a frame data model is presented in terms of a denotational semantics approach using a subset of META-IV. After introducing some basic concepts of the model several semantic integrity constraints are outlined which ultimately lead to the formulation of a set of operations in the frame data model.", "num_citations": "14\n", "authors": ["593"]}
{"title": "A knowledge-based approach to support business processes\n", "abstract": " Office tasks related to the processing of contracts in the insurance business are complex and highly dependent on legal and company-specific regulations. Furthermore, due to increasing competition on the market there is a strong pressure to increase efficiency and quality of office task performance. The only way to meet these manifold requirements is to provide a computer-based guidance and interactive support for office workers. At Swiss Life, we have developed the EULE system which fulfills these requirements. EULE’s functionality is in the triangle of Knowledge Representation, Business Process Modeling, and Knowledge Management-the latter because EULE encodes and stores knowledge which is crucial for the company. The system relies on a knowledge representation language which covers data and process aspects as well as the relevant legislation and company regulations.", "num_citations": "13\n", "authors": ["593"]}
{"title": "Computing text constituency: An algorithmic approach to the generation of text graphs\n", "abstract": " An algorithm for text summarization (automatic abstracting) is presented which constitutes the text condensation component of TOPIC, a knowledge-based text information system. Based on the results of text parsing knowledge representation structures of text segments are evaluated in order to determine dominant concepts. By means of an interpretation schema dominant concepts are related in terms of thematic units indicative of the topic (s) of the text segment under consideration. The mutual compatibility of topics of adjacent text segments is determined and corresponding text constituents are constructed. Finally, a text graph is generated linking appropriate text constituents on various levels of text constituency. Accordingly, facilities for text-oriented information retrieval will be based on the manipulation of these text graphs.", "num_citations": "13\n", "authors": ["593"]}
{"title": "B 9 Empfehlungssysteme\n", "abstract": " Unter einem Empfehlungssystem versteht man ein System, das einem Benutzer in einem gegebenen Kontext aus einer gegebenen Menge von Empfehlungsobjekten eine Teilmenge als nützlich empfiehlt. Dadurch werden Benutzer auf besonders relevante Objekte aufmerksam gemacht, die sie möglicherweise sonst nie gefunden hätten, weil sie nicht danach gesucht hätten oder weil sie in der schieren Menge an insgesamt relevanter Information untergegangen wären.", "num_citations": "12\n", "authors": ["593"]}
{"title": "Learning a lightweight ontology for semantic retrieval in patient-centered information systems\n", "abstract": " The paper introduces a web-based eHealth platform currently being developed that will assist patients with certain chronic diseases. The ultimate aim is behavioral change. This is supported by online assessment and feedback which visualizes actual behavior in relation to target behavior. Disease-specific information is provided through an information portal that utilizes lightweight ontologies (associative networks) in combination with text mining. The paper argues that classical word-based information retrieval is often not sufficient for providing patients with relevant information, but that their information needs are better addressed by concept-based retrieval. The focus of the paper is on the semantic retrieval component and the learning of a lightweight ontology from text documents, which is achieved by using a biologically inspired neural network. The paper concludes with preliminary results of the evaluation of …", "num_citations": "12\n", "authors": ["593"]}
{"title": "Terminological reasoning by query evaluation: A formal mapping of a terminological logic to an object data model\n", "abstract": " The paper starts by giving concise introductions into the terminological logic FRM and the object data model COCOON. It then brie y outlines a semantic-preserving mapping from FRM class descriptions to COCOON types and classes and shows how the terminological inference of classi cation is mapped to a set of equivalent COCOON queries. Since these queries can (mostly) be submitted as a whole to the underlying database system we can take full advantage of all the results on query optimisation, on providing e cient physical access structures, as well as on parallelisation that are available in the database area to make terminological inferences more efcient. This will play a crucial role in realising knowledge base systems capable of dealing with very large knowledge bases.", "num_citations": "12\n", "authors": ["593"]}
{"title": "A frame-based knowledge representation model and its mapping to nested relations\n", "abstract": " The first part of this paper introduces the basic constructs of a frame representation model and gives a formal definition for them. Subsequently the nested relational model (NF2) is described as an extension of the classical relational model to support relation-valued attributes. In the second part of this paper both models are compared with each other and a mapping of frame representation structures to NF2 structures is specified. The structural similarities between frames and NF2 relations are made clear and it is shown that their main difference is due to the type polymorphism introduced by the concept hierarchy of the frame model. This causes type collisions to occur in the strictly typed NF2 model when frames are directly mapped to NF2 structures. Two solutions to this problem are suggested and compared. The paper concludes with a reformulation of query operations of the frame model in terms of NF2 algebra …", "num_citations": "12\n", "authors": ["593"]}
{"title": "Practical aspects of knowledge management\n", "abstract": " The biennial PAKM Conference Series offers a communication platform and meeting ground for practitioners and researchers involved in developing and deploying advanced business solutions for the management of knowledge in organizations. PAKM is a forum for people to share their views, exchange ideas, develop new insights, and envision completely new kinds of knowledge management solutions.PAKM 2006, the Sixth International Conference on Practical Aspects of Knowledge Management, was held again in Vienna. It was a milestone for two reasons: First, it marked an anniversary–10 years of PAKM conferences. The first conference was held in Basel, Switzerland, in 1996, followed by the conferences in 1998 and 2000, in Basel as well. After that PAKM moved to Vienna where it was held in 2002, 2004, and 2006. Secondly, from now on PAKM will be “on tour”: It will be organized by different people …", "num_citations": "11\n", "authors": ["593"]}
{"title": "A mobile solution for stress recognition and prevention\n", "abstract": " The paper describes the development of a mobile solution based on smartphones and sensors for the early recognition of stress. The solution is based on real-time capture and analysis of vital data such as heart rate variability as well as activity and contextual data such as location and time of day. Individual recognition patterns for stress are derived from combining vital and contextual data by using subjective stress assessments via mood maps as additional input during an initial learning phase. The reliability of stress alerts and therapeutic impact will be tested in a clinic specialised on the treatment of alcoholics since stress tends to cause craving and therefore trigger relapses.", "num_citations": "10\n", "authors": ["593"]}
{"title": "SEMPER: A Web-Based Support System for Patient Self-Management.\n", "abstract": " The paper discusses an eHealth project which is currently developing an interactive web-based platform that assists patients to self-manage work-related disorders and alcoholism. The focus is on motivating long-term behaviour change. This is supported by an online assessment component based on the technique of motivational interviewing and a feedback component which visualizes actual behaviour in relation to intended behaviour. Disease-specific information is provided through an information portal that utilizes lightweight ontologies (associative networks) in combination with text mining. Emotional support is provided via virtual communities. The paper discusses the design rationales underlying the approach taken and outlines some implementational aspects. The paper also briefly outlines how the effectiveness of the self-management tool will be measured based on an outcome model particularly suited for health promotion.", "num_citations": "10\n", "authors": ["593"]}
{"title": "Inhaltsorientierte Navigation in automatisch generierten Hypertext-Basen\n", "abstract": " Der automatische Aufbau von Hypertexten aus Kollektionen linearer Texte erfordert Verfahren zur Analyse und Segmentierung von Texten, sowie zur Generierung von Hypertext-Kanten. In diesem Beitrag werden Theorien zur Beschreibung der thematischen Struktur von Texten aufgegriffen und zur Entwicklung von Kriterien genutzt, die es erlauben, inhaltlich begründete Kanten zwischen Textfragmenten zu erzeugen. Textgraphen resultieren als netzwerkartige Repräsentationen von Texten und dienen einem auf objektorientierter Interaktion basierenden Dialogmodell als Ausgangsbasis zur semantisch kontrollierten Exploration der Hypertext-Basis.", "num_citations": "10\n", "authors": ["593"]}
{"title": "DSML4PTM-A Domain-Specific Modelling Language for Patient Transferal Management.\n", "abstract": " This paper presents a domain-specific modelling language for patient transferal management (DSML4PTM). To foster reusability within the modelling community, existing modelling languages were taken into account as far as possible and then extended as was needed by the application domain. The language was developed through iteration following the design science research methodology. For requirements elicitation purposes domain expertise and healthcare standards were taken into account. The new modelling language was evaluated first with respect to the elicited requirements and then through the creation of two models reflecting a reference process and an application scenario. Next, an evaluation on the perceived usefulness and cognitive effort of the language was performed using a focus group with modelling and domain experts.", "num_citations": "9\n", "authors": ["593"]}
{"title": "ADLER: An Environment for Mining Insurance Data.\n", "abstract": " The rapid technical progress of hardware and data recording technology makes huge masses of digital data about products, clients and competitors available even for companies in the services sector. Data homogenization and information extraction are the crucial tasks when trying to exploit its inherent (and often hidden) knowledge for improvements of business processes. This paper reports the current activities at Swiss Life tackling both problems. In particular, we sketch the design of a data analysis environment that applies Knowledge Representation and Machine Learning technology to obtain information from relational data. The main focus lies on explaining the usage and representation of meta data within this environment.", "num_citations": "9\n", "authors": ["593"]}
{"title": "An Application Framework for Personalised and Adaptive Behavioural Change Support Systems.\n", "abstract": " The paper analyzes current weaknesses of behavioural change support systems (BCSS) such as the failure of adequately taking into account the heterogeneity of target users. Based on this analysis the paper presents an application framework that comprises various components to accommodate user preferences and to adapt system interventions to individual users. Among these components is a goal hierarchy which can be set up to represent the goals a user wants to achieve. The higher-level goals can be broken down into more specific goals that can be measured and associated with appropriate activities. Furthermore, our BCSS framework includes components for adapting its interactions according to a user’s observed behavioural preferences as well as his or her previous reactions to system interventions. User adaptation also takes into account the preferences of similar users by employing a collaborative filtering approach. Thus, overall user acceptance should be improved and motivation for behavioural change sustained. The framework is currently being implemented and will subsequently be evaluated.", "num_citations": "8\n", "authors": ["593"]}
{"title": "A system-controlled multi-type specialization hierarchy\n", "abstract": " A system-controlled multi-type specialization hierarchy | Proceedings from the first international workshop on Expert database systems ACM Digital Library home ACM home Google, Inc. (search) Advanced Search Browse About Sign in Register Advanced Search Journals Magazines Proceedings Books SIGs Conferences People More Search ACM Digital Library SearchSearch Advanced Search Browse Browse Digital Library Collections More HomeBrowse by TitleProceedingsProceedings from the first international workshop on Expert database systemsA system-controlled multi-type specialization hierarchy ARTICLE A system-controlled multi-type specialization hierarchy Share on Author: U Reimer profile image U Reimer View Profile Authors Info & Affiliations Publication: Proceedings from the first international workshop on Expert database systemsJanuary 1986 Pages 173–187 4citation 0 Downloads Metrics …", "num_citations": "8\n", "authors": ["593"]}
{"title": "Collaboration-Oriented Knowledge Management Using Interaction Patterns\n", "abstract": " The paper starts with analysing the requirements of supporting largely unstructured, collaboration-oriented processes as opposed to highly structured, workflow-based processes. The approach derived from those requirements utilizes the concept of interaction patterns to impose some control and guidance on a collaboration process without reducing the needed flexibility. This not only causes a much greater process transparency but also allows to provide and capture knowledge within the collaboration interactions. The application-specific instantiation of the interaction patterns and their enrichment with integrity constraints is done using a model-driven approach. The resulting application model is also a knowledge artefact which represents an important fragment of domain knowledge.", "num_citations": "7\n", "authors": ["593"]}
{"title": "Micro-Modeling of Business Processes for Just-in-Time Knowledge Delivery\n", "abstract": " The paper deals with the local support of business processes as seen from the perspective of an individual office worker. We call business activities viewed on such a more microscopic level “office tasks”. Office tasks related to processing of contracts in the insurance business are complex and highly dependent on legislation and company-specific regulations. On the other hand, the increasing competition strongly calls for higher efficiency as well as higher quality standards. The EULE system developed at Swiss Life meets these demands by providing computer-based guidance and interactive support for office tasks dealing with private life insurances. Realized as a knowledge-based system EULE consists of a shell and a knowledge representation language to construct the models of the actual office tasks. It is therefore independent of the actual application domain and can be employed for other kinds of …", "num_citations": "7\n", "authors": ["593"]}
{"title": "Experience-the neglected success factor in enterprises?\n", "abstract": " The effective use of experience as a valuable resource can give companies a competitive edge in a world characterised by an ageing workforce and globalisation. An online survey was conducted in Austria, Germany and Switzerland to nd out managers' attitudes towards experience and if and how they capture, use and disseminate it. The results show that the majority consider experience an important asset, but do not actually support it in any systematic way. Company size and position rather than age or gender play a role when it comes to preferences, attitudes or practices. The survey shows great discrepancies between methods considered useful vs. those in regular use. Besides, there is a preference for classical people-oriented methods rather than modern IT-supported methods. Integrating experience management into project and process management practice may help overcome current barriers and reservations.", "num_citations": "6\n", "authors": ["593"]}
{"title": "Practical aspects of knowledge management\n", "abstract": " This book contains the papers presented at the 5th International Conference on Practical Aspects of Knowledge Management organized by the Department of Knowledge Management, Institute of Computer Science and Business Informatics, University of Vienna. The event took place on December 02–03, 2004 in Vienna. The PAKM conference series offers a communication forum and meeting ground for practitioners and researchers engaged in developing and deploying advanced business solutions for the management of knowledge and intellectual capital. Contributions pursuing integrated approaches which consider organizational, technological and cultural issues of knowledge management have been elected for presentation. PAKM is a forum for people to share their views, to exchange ideas, to develop new insights, and to envision completely new kinds of solutions for knowledge management problems …", "num_citations": "6\n", "authors": ["593"]}
{"title": "PAKM-98: Practical Aspects of Knowledge Management\n", "abstract": " CEUR-WS.org/Vol-13 [CEUR Workshop Proceedings] Vol-13 © 1998 for the individual papers by the papers' authors. Copying permitted for private and scientific purposes. Re-publication of material on this page requires permission by the copyright owners. PAKM 98 Practical Aspects of Knowledge Management Proceedings of the Second International Conference Basel, Switzerland, October 29-30, 1998 Edited by Ulrich Reimer Swiss Life Information Systems Research PO Box, 8022 Zurich, Switzerland The workshop is sponsored by UBS, Switzerland and Swiss Life, Switzerland. A hard copy of these proceedings is available on demand from sinfo@access.ch. Table of Contents Extended Abstracts of Invited Talks: Building an Intellectual Capital Strategy at the Corporate Level P. Seemann Experience-Based Knowledge Management: How to Capitalize on Failures and Missed Opportunities M. Jarke Regular Papers…", "num_citations": "6\n", "authors": ["593"]}
{"title": "Knowledge-Based Systems for Knowledge Management in Enterprises\n", "abstract": " This work may not be copied or reproduced in whole or part for any commercial purpose. Permission to copy in whole or part without payment of fee is granted for nonprofit educational and research purposes provided that all such whole or partial copies include the following: a notice that such copying is by permission of the Deutsche Forschungszentrum für Künstliche Intelligenz, Kaiserslautern, Federal Republic of Germany; an acknowledgement of the authors and individual contributors to the work; all applicable portions of this copyright notice. Copying, reproducing, or republishing for any other purpose shall require a licence with payment of fee to Deutsches Forschungszentrum für Künstliche Intelligenz. ISSN 0946-0098", "num_citations": "6\n", "authors": ["593"]}
{"title": "SmartCoping: A mobile solution for recognizing stress and coping with it\n", "abstract": " The paper describes the design rationales and algorithms underlying SmartCoping, a mobile solution for recognizing stress based on the continuous monitoring of heart rate variability (HRV). A central contribution is the calibration of HRV values to each user of the SmartCoping app. Calibration is crucial since HRV varies greatly among people and must be interpreted individually. Calibration is implemented in two variants, one which requires user feedbacks on perceived stress levels during an initial learning phase and one where no feedback is needed, and a user’s maximal and minimal HRV values are determined during an initial usage phase. The variant with user feedbacks results in stress warnings which better reflect a user’s stress perception. The app can be used to trigger stress warnings, identify recurrent stress situations from the history data, and give relaxation support via a biofeedback …", "num_citations": "5\n", "authors": ["593"]}
{"title": "Towards an agile and ontology-aided modeling environment for DSML adaptation\n", "abstract": " The advent of digitalization exposes enterprises to an ongoing transformation with the challenge to quickly capture relevant aspects of changes. This brings the demand to create or adapt domain-specific modeling languages (DSMLs) efficiently and in a timely manner, which, on the contrary, is a complex and time-consuming engineering task. This is not just due to the required high expertise in both knowledge engineering and targeted domain. It is also due to the sequential approach that still characterizes the accommodation of new requirements in modeling language engineering. In this paper we present a DSML adaptation approach where agility is fostered by merging engineering phases in a single modeling environment. This is supported by ontology concepts, which are tightly coupled with DSML constructs. Hence, a modeling environment is being developed that enables a modeling language to be …", "num_citations": "5\n", "authors": ["593"]}
{"title": "Digital Change—New Opportunities and Challenges for Tapping Experience and Lessons Learned for Organisational Value Creation\n", "abstract": " Digital change and Industry 4.0 do not erase the need for human insight or experience. This has been shown by a recent survey conducted among managers in the German-speaking world who still consider experience a highly valuable asset. Digital change, however, has shifted the focus from products to customers and implies new roles for employees such as supervising machines and processes, and assessing data analysis results. At the same time, new digital trends and tools open up new opportunities for automatically capturing, exchanging and preserving lessons learned, and offer support that is both context-aware and situation-specific. Since they should not require any additional effort, digital trends and tools may also help remove a key obstacle to innovation, i.e. the failure to learn from mistakes.", "num_citations": "5\n", "authors": ["593"]}
{"title": "Creating and maintaining a collaboration platform via domain-specific reference modelling\n", "abstract": " We present a model-driven approach to create and maintain a collaboration platform for supporting the collaboration between acute hospitals and rehabilitation clinics to optimize transferal management. The model-driven approach makes the platform highly configurable to accommodate new clinical pathways and be easily extendable to include additional functions to meet future needs. All domain-specific aspects are described declaratively in an application model. The elements in the application model are mapped to corresponding elements in an application framework to obtain the executable collaboration platform. Attaching the mappings to the constructs of an underlying domain-specific language ensures that executable code can be derived from all application models. Furthermore, our framework includes reference models which serve as blueprints and will make it easier to create and adapt application …", "num_citations": "5\n", "authors": ["593"]}
{"title": "Text Summarization Based on Terminological Logics.\n", "abstract": " We present an approach to text summarization that is entirely rooted in the formal description of a classification-based model of terminological knowledge representation and reasoning. Text summarization is considered an operator-based transformation process by which knowledge representation structures, as generated by the text understander, are mapped to condensed representation structures forming a text summary at the representational level. The framework we propose offers a variety of parameters on which scalable text summarization can be based.", "num_citations": "5\n", "authors": ["593"]}
{"title": "Integrating Terminological and Deductive Reasoning\n", "abstract": " We present a data model which supports two kinds of reasoning. Firstly, it supports terminological reasoning in the style of KL-ONE, mainly subsumption of concepts (types) and instantiation of objects, a kind of type inference for objects. Secondly, it also supports deductive inferencing and integrity checking in the style of logic programming languages and deductive databases. This data model may also be considered as a typed deductive database with type inferences. In order to get a common semantics for both features of our data model, we map the terminological inferences to a logic program. The data model has been implemented as a prototype in Prolog.", "num_citations": "5\n", "authors": ["593"]}
{"title": "Preface of the First Workshop Models in AI.\n", "abstract": " With the increasing availability of large amounts of data in practically all application areas, the field of artificial intelligence (AI) has been attracting increasing attention for some time now. Earlier approaches to AI were primarily associated with the knowledge-based paradigm where systems include domain-specific knowledge bases that provide the required (background) knowledge. The construction and maintenance of such domain models has to be done largely manually and therefore requires a great deal of time and money, which is why these approaches scale up poorly.The new paradigm of data-driven AI, ie learning domain models and keeping them up-to-date by using data mining techniques, can help overcome these disadvantages. The models learned may be either symbolic (eg rules, decision trees) or sub-symbolic (neural networks). Classical data mining, however, also implies considerable manual effort, in particular for feature engineering. The rise of deep learning approaches, which embed the identification of relevant features into the learning processes themselves, may well contribute further to automating the creation of AI systems. In these cases, the generated models are of a sub-symbolic nature.", "num_citations": "4\n", "authors": ["593"]}
{"title": "Automatic user adaptation for behavior change support\n", "abstract": " User adaptation is crucial to account for the heterogeneity of target user groups and thus to increase the effectiveness of a system aimed at encouraging behavioral change. The paper first introduces an application framework that comprises various components which allow to accommodate user preferences. It then describes in detail the algorithms for user adaptation. To this end, approaches from user modeling as well as from collaborative filtering are employed. The result is a self-learning application that changes in line with a user’s progress, which is expected to enhance user acceptance as well as increase and sustain the motivation for behavioral change. The framework is currently being implemented in a mobile health app and will subsequently be evaluated.", "num_citations": "4\n", "authors": ["593"]}
{"title": "Smart Coping with Stress: Biofeedback via Smart Phone for Stress Reduction and Relapse Prevention in Alcohol Dependent Subjects.\n", "abstract": " The paper presents the design plan for a mobile solution aimed at stress reduction. The solution will be developed by a team of medics, psychotherapists, HCI experts and knowledge engineers and will provide continuous data sensing and feedback about personal stress levels. At the same time contextual and activity information will be captured. Stress management is particularly important for high-risk populations such as former alcoholics to reduce the risk of relapse; they will therefore test and validate the solution. By combining and correlating psycho-physiological data with data on activities (eg walking or social interactions) and environment/location (eg ambient light) it is expected that sources of stress can be recognised which in turn will allow individuals to either avoid stress-inducing factors or develop appropriate coping strategies. To make sense of the data captured, it is proposed to use intelligent …", "num_citations": "4\n", "authors": ["593"]}
{"title": "Making knowledge-based systems more manageable: a hybrid integration approach to knowledge about actions and their legality\n", "abstract": " In more and more companies knowledge-based systems are being considered an adequate means for building systems to support office work in order to increase its quality and efficiency. Such systems need various kinds of knowledge, like knowledge about the terminology underlying the corresponding domain of discourse, and knowledge about what kinds of events and actions can occur in the office work and what changes they cause. As many office tasks underlie organizational regulations as well as federal law, the value of systems for supporting office work is drastically increased if they know about these regulations, thus becoming able to ensure their obedience, or to explain them to the user (this insight already motivated the early LEGOL project [18]). One of the key problems of building such systems is how to properly integrate the various kinds of knowledge: On the one hand, we need a resulting …", "num_citations": "4\n", "authors": ["593"]}
{"title": "A hybrid knowledge representation approach to reusability of legal knowledge bases\n", "abstract": " Io this paper, we argue that a representation of legal knowledge should remain completely independent from aspects of the application systems that employ it. This makes it possible to provide isomorphic representations, makes maintenance of the knowledge bases much easier and less error-prone, and is a prerequisite for reusing and sharing the legal knowledge among several knowledge-based systems. We suggest a hybrid knowledge representation approach which integrates a legal representation component with the representation component of an application system by coupling them via their common terminology. This is always possible because the domains of discourse of both representation components necessarily overlap. Sometimes, such an integration does not comply with the control flow requirements of the application system. We propose a solution to this problem, too, which introduces a one …", "num_citations": "4\n", "authors": ["593"]}
{"title": "An overview of the text understanding system TOPIC\n", "abstract": " The routine application of word processors as well as electronic mail and message services in office environments has led to the proliferation of large data bases of source texts (full–texts) such as letters, memos, minutes. As this kind of electronic text production and distribution technology is rapidly spreading, a lot of enthusiasm has been expressed with regard to the availability, ease of access, and dissemination of information contained in these text files. However, adequate methods for treating the contents of these documents are still lacking and require basic research in this area. We therefore started developing the full–text condensation system TOPIC, trying to combine in an integrated information system architecture the methodology of knowledge–based text understanding systems with advanced functional requirements arising from an information retrieval perspective in electronic text environments. The current range of TOPIC's functionality covers a variety of text condensation modes and supports according retrieval options:", "num_citations": "4\n", "authors": ["593"]}
{"title": "Wortexperten-Parsing: Text-Parsing mit einer verteilten lexikalischen Grammatik im Rahmen des automatischen Textkondensierungssystems TOPIC in Linguistik und künstliche …\n", "abstract": " Sauf mention contraire ci-dessus, le contenu de cette notice bibliographique peut être utilisé dans le cadre d’une licence CC BY 4.0 Inist-CNRS/Unless otherwise stated above, the content of this bibliographic record may be used under a CC BY 4.0 licence by Inist-CNRS/A menos que se haya señalado antes, el contenido de este registro bibliográfico puede ser utilizado al amparo de una licencia CC BY 4.0 Inist-CNRS", "num_citations": "4\n", "authors": ["593"]}
{"title": "Going Beyond Explainability in Medical AI Systems.\n", "abstract": " Despite the promises of artificial intelligence (AI) technology, its adoption in medicine has met with formidable obstacles due to the inherent opaqueness of the internal decision processes that are based on models which are difficult or even impossible to understand. In particular, the increasing usage of (deep) neural nets and the resulting black-box algorithms has led to wide-spread demands for explainability. Apart from discussing how explainability might be achieved, the paper also looks at other approaches at building trust such as certification or controlling bias. Trust is a crucial prerequisite for the use and acceptance of AI systems in the medical domain.", "num_citations": "3\n", "authors": ["593"]}
{"title": "A Self-learning Application Framework for Behavioral Change Support\n", "abstract": " The paper analyzes current weaknesses of behavioral change support systems such as the lack of adequately taking into account the heterogeneity of target users. Based on this analysis the paper presents an application framework that comprises various components to accommodate user preferences and to adapt system interventions to individual users: a goal hierarchy which users can tailor to their needs, dividing nudges into different types that correspond to speech acts, rules for context-specific triggering of nudges. User adaptation is realized with approaches from user modeling and collaborative filtering. The result is a self-learning application that changes in line with a user’s progress, which is expected to enhance user acceptance and increase and sustain people’s motivation for behavioral change. The application framework will be evaluated by comparing a mobile health app using the framework …", "num_citations": "3\n", "authors": ["593"]}
{"title": "Towards cross-organisational e-Government: an integrated approach\n", "abstract": " One of the most challenging issues in current e-Government initiatives is the seamless exchange of information and the efficient collaboration between public administrations, companies and the private sector. Either from an intra-or cross-organisational point of view spanning processes across multiple authorities leads to a collaboration of autonomous units under consideration of law and regulations. Despite the organisational dimension current approaches are mainly technical solutions–eg interoperability frameworks. Within this paper we present an integrated approach which incorporates organisational aspects of the public sector and which supports the correspondent implementation of solutions for cross-organisational e-Government by adopting Model-Driven-Development practices.", "num_citations": "3\n", "authors": ["593"]}
{"title": "WM 2003: Professionelles Wissesmanagement–Erfahrungen und Visionen, Beiträge der 2. Konferenz Professionelles Wissensmanagement\n", "abstract": " WM 2003: Professionelles Wissesmanagement – Erfahrungen und Visionen, Beiträge der 2. Konferenz Professionelles Wissensmanagement - Digitale Bibliothek - Gesellschaft für Informatik eV GI Logo GI Logo Anmelden Digitale Bibliothek Gesamter Bestand Bereiche & Sammlungen Titel Autor Erscheinungsdatum Schlagwort Diese Sammlung Titel Autor Erscheinungsdatum Schlagwort Toggle navigation Digital Bibliothek der Gesellschaft für Informatik eV GI-DL English Deutsch Deutsch English Deutsch Dokumentanzeige Startseite Lecture Notes in Informatics Proceedings P028 - WM 2003: Professionelles Wissensmanagement – Erfahrungen und Visionen, Beiträge der 2. Konferenz Professionelles Wissensmanagement Dokumentanzeige Startseite Lecture Notes in Informatics Proceedings P028 - WM 2003: Professionelles Wissensmanagement – Erfahrungen und Visionen, Beiträge der 2. Konferenz …", "num_citations": "3\n", "authors": ["593"]}
{"title": "Organizational memory–evaluation of case study prototypes\n", "abstract": " This document describes the first phase of Swiss Life's case study within the OnToKnowledge project. This overall case study can actually be subdivided into two smaller case studies situated in different application areas and with quite different objectives, but both aiming at exploring the possibilities for utilizing ontologies for knowledge management within a company.The case study on IAS utilizes a light-weight ontology to support the querying of a huge document about IAS (International Accounting Standard) on the extranet (over 1000 pages). The ontology consists of words with weighted semantic associations between them. The most interesting aspect in this case study is the automatic acquisition of the ontology from the IAS document.", "num_citations": "3\n", "authors": ["593"]}
{"title": "The TOPIC project: text oriented procedures for information management and condensation of expository texts; final report\n", "abstract": " The TOPIC project: text-oriented procedures for information management and condensation of expository texts Final report - OpenGrey fra | eng OpenGrey Open System for Information on Grey literature in Europe Home Search Subjects Partners Export Help Search XML To cite or link to this reference: http://hdl.handle.net/10068/148026 Title : The TOPIC project: text-oriented procedures for information management and condensation of expository texts Final report Authors : Hahn, U. ; Reimer, U. ; Corporate author : Konstanz Univ. (Germany). Lehrstuhl fuer Informationswissenschaft. ; Gesellschaft fuer Information und Dokumentation mbH (GID), Frankfurt am Main (Germany) ; Publication year : 1985 Language : English ; Pagination/Size : 114 p. ; SIGLE classification : 090 - Electronics and electrical engineering, computer science, general ; Document type : I - Miscellaneous ; Gov't Doc # : PT 200.08 ; Other identifier : …", "num_citations": "3\n", "authors": ["593"]}
{"title": "WM2003: Professionelles Wissensmanagement–Erfahrungen und Visionen\n", "abstract": " Der Beitrag behandelt die denkmöglichen Auswirkungen des Einsatzes von Kompetenzmanagementsystemen (KMS) auf die Motivation von Akteuren in Unternehmen. Der Erfolg eines solchen Systems hängt dabei wesentlich von der Akzeptanz der Akteure und der Integration in deren Arbeitsabläufe ab. Insbesondere wird untersucht, inwieweit KMS, die auf Ontologien basieren, vorteilhafter erscheinen als konventionelle KMS.", "num_citations": "2\n", "authors": ["593"]}
{"title": "Entwurfsprinzipien und Architektur des Textkondensierungssystems TOPIC\n", "abstract": " Ausgehend von einer informationswissenschaftlichen Motivation für die Volltextverarbeitung in Informationssystemen wird zunächst ein Überblick über die konzeptionellen Grundlagen des Textkondensierungssystems TOPIC gegeben: partielles Textverstehen als für das indikative Abstracting funktional adäquate Parsing-Strategie, Integrität der auf einem formal spezifizierten Frame-Repräsentationsmodell basierenden Wissensbasis, Erkennung von Textkohäsionsund Textkohärenzmustern in Fachtexten durch einen entsprechend ausgerichteten Text-Parser sowie unterschiedliche thematische Aggregationsgrade der erzeugten Textkondensate (Textzusammenfassungen). Anschließend wird eine strukturierte Beschreibung des gesamten TOPIC-Systems gegeben, das sich aus drei Hauptprozessen zusammensetzt: Text-Parsing auf der Basis extensiver Interaktionen zwischen Frame-Wissensbasis und …", "num_citations": "2\n", "authors": ["593"]}
{"title": "WM 2003\n", "abstract": " Der Beitrag behandelt die denkmöglichen Auswirkungen des Einsatzes von Kompetenzmanagementsystemen (KMS) auf die Motivation von Akteuren in Untemehmen. Der Erfolg eines solchen Systems hängt dabei wesentlich von der Akzeptanz der Akteure und der Integration in deren Arbeitsabläufe ab. Insbesonde-re wird untersucht, inwieweit KMS, die auf Ontologien basieren, vorteilhafter erscheinen als konventionelle KMS.-", "num_citations": "2\n", "authors": ["593"]}
{"title": "How to Induce Trust in Medical AI Systems\n", "abstract": " Trust is an important prerequisite for the acceptance of an Artificial Intelligence (AI) system, in particular in the medical domain. Explainability is currently discussed as the key approach to induce trust. Since a medical AI system is considered a medical device, it also has to be formally certified by an officially recognised agency. The paper argues that neither explainability nor certification suffice to tackle the trust problem. Instead, we propose an alternative approach aimed at showing the physician how well a patient is represented in the original training data set. We operationalize this approach by developing formal indicators and illustrate their usefulness with a real-world medical data set.", "num_citations": "1\n", "authors": ["593"]}
{"title": "The Myth of 10, 000 Steps: A New Approach to Smartphone-based Health Apps for Supporting Physical Activity.\n", "abstract": " This paper introduces an alternative approach to conventional pedometer apps which measure the wide-spread goal of 10,000 steps a day. Instead we focus on the intensity of physical activity, which is in line with recent recommendations of renowned health institutions such as the WHO. These promote a minimum of moderate to vigorous physically active time per week to achieve the desired health benefits. The paper discusses how the guidelines have been implemented. It also outlines how we help maintain user motivation over time (eg by integrating and personalising\" nudges\") and how we intend to solve the challenges posed by different fitness levels and personal lifestyles.", "num_citations": "1\n", "authors": ["593"]}
{"title": "From a data-driven towards a knowledge-driven society: making sense of data\n", "abstract": " In our four-part workshop, we will focus on data as a primary resource for our society and, with methods from soft computing, sense-making of raw data to augment human conditions for example expanding the smart city concept to a concept of cognitive cities that, in a humanistic sense, gears to human-centered computing. With this in mind, in the first part, we focus on deep learning to generate natural language descriptions of data mining results. In the second part, we concentrate on granular computing as a forceful toolbox for representing and reasoning with different types and levels of data abstraction. In part three, we demonstrate, how the previous parts are critical elements to overcome the concept of smart cities towards cognitive cities, in which opposed to many of todays smart city concepts humans are the center of development. In the fourth and last part of our workshop, we will collectively develop solutions …", "num_citations": "1\n", "authors": ["593"]}
{"title": "Smart Coping with Stress: Biofeedback via Smart Phone for Stress Reduction and\n", "abstract": " The paper presents the design plan for a mobile solution aimed at stress reduction. The solution will be developed by a team of medics, psychotherapists, HCI experts and knowledge engineers and will provide continuous data sensing and feedback about personal stress levels. At the same time contextual and activity information will be captured. Stress management is particularly important for high-risk populations such as former alcoholics to reduce the risk of relapse; they will therefore test and validate the solution. By combining and correlating psycho-physiological data with data on activities (eg walking or social interactions) and environment/location (eg ambient light) it is expected that sources of stress can be recognised which in turn will allow individuals to either avoid stress-inducing factors or develop appropriate coping strategies. To make sense of the data captured, it is proposed to use intelligent algorithms to recognise patterns in the data streams and semantic technologies to interpret the text messages of users. People with other stress-related health problems such as burn-out, smoking, depression or sleeping problems will also benefit from our research.", "num_citations": "1\n", "authors": ["593"]}
{"title": "Access to heterogeneous data sources for supporting business process execution\n", "abstract": " ABSTRACT¢¡¤£¦¥ § ©¤£ § \"!¤# $%£ $% $'&¤() § 10£ 2$% $%£ $4 35 6© 8 7)¡£ 9$@ 7)£ 2& AB $%£¦()£ 2C D£¥£ 2 7E § F 02£ 2 (% 7G3 HI (G3¥£ 17) $ P AB 7)¡ Q ()£ $% &R£ 027S 7) § T 3#¤ 7) § ¥ S357) § U &V () § U¥ $%£ $ S 7)¡£¦© V£ WX£ § U&¤ Y § 5\"V a § 5 ()¥ S357) § U b $@ cV $@ 7)£¥ $ P 7)¡ 357d! R£ 27% C 7)£ e (E $) 3f7)$@ IcY 7)¡£ S!¤# $%£ $% $ g 3© T# $%£ e (g ()£ ih1#¤()£ 2¥£ 17) $ g 35 6© Y 35$% § D7! R£ e7% 7)£ 2 (P 17) § 4 7)¡£ d 3 p ()£ i3© Vc£ 2qV $@ 7)¦ $@ cV $@ 7)£¥ r£ W () § ¥£ 17ist¢¡¤£ u¢ vxwyQ $@ cV $@ 7)£¥¥ &¤£¥£ 17)£ i© Y 3f7'AB $% $ S pa£'$ S 3t¥ § © V£ pC! 3$%£ i©£ eq¤£ 20#¤ 7) § U£ W () § ¥£ 17 § (!#¤ $%£ $% $\" 35027) WV p7)£ $\"()#¤ d § UT 3$%¤ U£ PA¢ § 5 () V&¤30£ UsP 7) $ F¥ § ©¤£ 2'3# 635 U£()£ 2£ $\" § Y 3 § ! V£ 027% C § ()£ 17)£ i©(G35¥£()£ 2&¤()£ $%£ 17G3f7)§ d § (B©¤ 357G3 3© S¡¤£ 2 (G35 () 0G¡ pC 0 3 5 (G3&¡¤ $ § (&V () § 10£ $% $3 …", "num_citations": "1\n", "authors": ["593"]}
{"title": "EULE2: A prototypical knowledge-based decision support system for the performance of office tasks\n", "abstract": " In Swiss Life, as in many other companies, officeworkers for customer support are no longer specialists, each one dealing with a restricted number of office tasks only, but are becoming generalists who must deal with all kinds of tasks. Office tasks underlie organisational regulations and federal law which are quite often rather complex. Therefore a decision support system which knows about the regulations and the law and which can guide a user through an office task would considerably increase quality and quantity of the office work being done 1. The knowledge-based decision support system EULE2 (cf.[RM95]) developped at Rentenanstalt/Swiss Life meets this goal. The system is still prototypical but is intended to become productive and to be used by about 150 office workers.In Section 2 we describe how EULE2 is used to perform an office task. We will identify three different kinds of knowledge that is needed …", "num_citations": "1\n", "authors": ["593"]}