{"title": "Achieving a 100% renewable grid: Operating electric power systems with extremely high levels of variable renewable energy\n", "abstract": " What does it mean to achieve a 100% renewable grid? Several countries already meet or come close to achieving this goal. Iceland, for example, supplies 100% of its electricity needs with either geothermal or hydropower. Other countries that have electric grids with high fractions of renewables based on hydropower include Norway (97%), Costa Rica (93%), Brazil (76%), and Canada (62%). Hydropower plants have been used for decades to create a relatively inexpensive, renewable form of energy, but these systems are limited by natural rainfall and geographic topology. Around the world, most good sites for large hydropower resources have already been developed. So how do other areas achieve 100% renewable grids? Variable renewable energy (VRE), such as wind and solar photovoltaic (PV) systems, will be a major contributor, and with the reduction in costs for these technologies during the last five years …", "num_citations": "648\n", "authors": ["1051"]}
{"title": "A peak power tracker for small wind turbines in battery charging applications\n", "abstract": " This paper describes the design, implementation and testing of a prototype version of a peak power tracking system for small wind turbines in battery charging applications. The causes for the poor performance of small wind turbines in battery charging applications are explained and previously proposed configurations to increase the power output of the wind turbines are discussed. Through computer modeling of the steady-state operation the potential performance gain of the proposed system in comparison with existing systems is calculated. It is shown that one configuration consisting of reactive compensation by capacitors and a DC/DC converter is able to optimally load the wind turbine and thus obtain maximum energy capture over the whole range of wind speeds. A proof of concept of the peak power tracking system is provided by building and testing a prototype version. The peak power tracking system is …", "num_citations": "314\n", "authors": ["1051"]}
{"title": "Understanding inertial and frequency response of wind power plants\n", "abstract": " The objective of this paper is to analyze and quantify the inertia and frequency responses of wind power plants with different wind turbine technologies (particularly those of fixed speed, variable slip with rotor-resistance controls, and variable speed with vector controls). The fundamental theory, the operating range, and the modifications needed for the wind turbine to contribute to the inertial and primary frequency response during the frequency drop will be presented in this paper. We will demonstrate practical approaches to allow variable slip and speed wind turbines to contribute inertia to the host power system grid. The approaches are based on the inclusion of frequency error and the rate of change of frequency signals in the torque control loop and pitch control actions for wind speeds below and above its rated value. Detailed simulation models in the time domain will be conducted to demonstrate the efficacy of …", "num_citations": "225\n", "authors": ["1051"]}
{"title": "Investigating the impacts of wind generation participation in interconnection frequency response\n", "abstract": " The electrical frequency of an interconnection must be maintained very close to its nominal level at all times. Excessive frequency deviations can lead to load shedding, instability, machine damage, and even blackouts. There is rising concern in the power industry in recent years about the declining amount of inertia and primary frequency response (PFR) in many interconnections. This decline may continue due to increasing penetrations of inverter-coupled generation and the planned retirements of conventional thermal plants. Inverter-coupled variable wind generation is capable of contributing to PFR and inertia; however, wind generation PFR and inertia responses differ from those of conventional generators, and it is not entirely understood how this will affect the system at different wind power penetration levels. The simulation work presented in this paper evaluates the impact of the wind generation provision of …", "num_citations": "213\n", "authors": ["1051"]}
{"title": "Market designs for the primary frequency response ancillary service—Part I: Motivation and design\n", "abstract": " The first part of this two-paper series discusses the motivation of implementing a primary frequency response (PFR) market in restructured pool-based power markets, as well as the market design that would create the right incentives to provide the response reliably. PFR is the immediate, autonomous response of generation and demand to system frequency deviations. It is the critical response required to avoid triggering under- and over- frequency relays or instability that could lead to machine damage, load-shedding, and in the extreme case, blackouts. Currently, in many restructured power systems throughout the world, ancillary services markets have been developed to incent technologies to provide the services to support power system reliability. However, few ancillary services markets include a market explicitly incentivizing the provision of PFR. Historically, PFR was an inherent feature available in …", "num_citations": "177\n", "authors": ["1051"]}
{"title": "Short circuit current contribution for different wind turbine generator types\n", "abstract": " An important aspect of wind power plant (WPP) impact studies is to evaluate the short circuit (SC) current contribution of the plant into the transmission network under different fault conditions. This task can be challenging to protection engineers due to the topology differences between different types of wind turbine generators (WTGs) and the conventional generating units. This paper presents simulation results for SC current contribution for different types of WTGs obtained through transient analysis using generic WTG models. The obtained waveforms are analyzed to explain the behavior, such as peak values and rate of decay, of the WTG. The effect of fault types and location, and the effect of the control algorithms of power converters on SC current contribution are also investigated. We show that the response of the WPP to faults will vary based on the type of the installed WTGs. While in Type 1 and Type 2 WTGs …", "num_citations": "143\n", "authors": ["1051"]}
{"title": "Power electronics for renewable and distributed energy systems\n", "abstract": " Although the cost of electricity has significantly decreased since the 1930s, it is still not readily available to the disadvantaged in countries and regions of poverty. One of the single most ways to reduce poverty is to find ways to reduce the cost of energy. Renewable resources can play a significant role to reduce these costs. Electricity across our world is primarily produced from fossil fueled resources. There is significant debate about the energy sources on today’s fossil-fueled power plants and the affects they may be having on climate. A primary product of combustion of fossil generation is carbon dioxide, CO2. Many of today’s computer simulations suggest that as the atmospheric concentration of CO2 increase, the earth’s average temperature will continue to increase. The earth is made up of countless ecosystems. Laboratory and field studies show that most ecosystems will collapse when subjected to fast …", "num_citations": "126\n", "authors": ["1051"]}
{"title": "Active power controls from wind power: Bridging the gaps\n", "abstract": " This paper details a comprehensive study undertaken by the National Renewable Energy Laboratory, Electric Power Research Institute, and the University of Colorado to understand how the contribution of wind power providing active power control (APC) can benefit the total power system economics, increase revenue streams, improve the reliability and security of the power system, and provide superior and efficient response while reducing any structural and loading impacts that may reduce the life of the wind turbine or its components. The study includes power system simulations, control simulations, and actual field tests using turbines at NREL's National Wind Technology Center (NWTC). The study focuses on synthetic inertial control, primary frequency control, and automatic generation control, and analyzes timeframes ranging from milliseconds to minutes to the lifetime of wind turbines, locational scope ranging from components of turbines to large wind plants to entire synchronous interconnections, and additional topics ranging from economics to power system engineering to control design.", "num_citations": "108\n", "authors": ["1051"]}
{"title": "Review of PREPA technical requirements for interconnecting wind and solar generation\n", "abstract": " The Puerto Rico Electric Power Authority developed the minimum technical requirements for interconnection of wind turbine generation and photovoltaic power plants. NREL has conducted a review of these requirements based on generic technical aspects and electrical characteristics of wind and photovoltaic power plants, and on existing requirements from other utilities (both US and European).", "num_citations": "102\n", "authors": ["1051"]}
{"title": "Market designs for the primary frequency response ancillary service—Part II: Case studies\n", "abstract": " The second part of this two-paper series analyzes the primary frequency response (PFR) market design developed in its companion paper with several case studies. The simulations will show how the scheduling and pricing change depending on whether requirements for PFR are included as well as how the requirements are defined. We first perform simulations on the base case IEEE RTS and show differences in production costs, prices, and amount of PFR when incorporating the PFR constraints. We show how new market designs can affect other linked markets when performing co-optimization. We then test a system with a significant amount of wind power, which does not provide PFR or synchronous inertia, to see how the incorporation of PFR constraints may become more critical on future systems. We then show how pricing can reduce make-whole payments and ensure resources needed for reliability …", "num_citations": "85\n", "authors": ["1051"]}
{"title": "Different factors affecting short circuit behavior of a wind power plant\n", "abstract": " A wind power plant (WPP) consists of a large number of turbines interconnected by underground cable. A pad-mounted transformer at each turbine steps up the voltage from a generating voltage (690 V) to a medium voltage (34.5 kV). All turbines in the plant are connected to the substation transformer, where the voltage is stepped up to the transmission level. An important aspect of WPP impact studies is to evaluate the short-circuit (SC) current contribution of the plant into the transmission network under different fault conditions. This task can be challenging to protection engineers due to the topology differences between different types of wind turbine generators and the conventional generating units. This paper investigates the SC behavior of a WPP for different types of faults. The impact of wind turbine types, the transformer configuration, and the reactive compensation capacitor will be investigated. The voltage …", "num_citations": "83\n", "authors": ["1051"]}
{"title": "Interarea oscillation damping controls for wind power plants\n", "abstract": " This paper investigates the potential for wind power plants (WPPs) to damp interarea modes. Interarea modes may be the result of a single or a group of generators oscillating against another group of generators across a weak transmission link. If poorly damped, these power system oscillations can cause system instability and potentially lead to blackouts. Power conversion devices, particularly, megawatt-scale converters that connect wind turbines and photovoltaic power plants to the grid, could be used to damp these oscillations by injecting power into the system out of phase with the potentially unstable mode. In our model, this power may be provided by a WPP. Over time, the net energy injection is near zero; therefore, providing this static damping capability is not expected to affect the energy production of a WPP. This is a measurement-based investigation that employs simulated measurement data. It is not a …", "num_citations": "81\n", "authors": ["1051"]}
{"title": "Simulation for wind turbine generators--with FAST and MATLAB-simulink modules\n", "abstract": " This report presents the work done to develop generator and gearbox models in the Matrix Laboratory (MATLAB) environment and couple them to the National Renewable Energy Laboratory's Fatigue, Aerodynamics, Structures, and Turbulence (FAST) program. The goal of this project was to interface the superior aerodynamic and mechanical models of FAST to the excellent electrical generator models found in various Simulink libraries and applications. The scope was limited to Type 1, Type 2, and Type 3 generators and fairly basic gear-train models. Future work will include models of Type 4 generators and more-advanced gear-train models with increased degrees of freedom. As described in this study, implementation of the developed drivetrain model enables the software tool to be used in many ways. Several case studies are presented as examples of the many types of studies that can be performed using this tool.", "num_citations": "70\n", "authors": ["1051"]}
{"title": "Analysis of permanent magnet generator for wind power battery charging\n", "abstract": " One type of wind-powered battery charging is explored in this paper. It consists of a wind turbine driving a permanent magnet alternator and operates at variable speed. The alternator is connected to a battery bank via a rectifier. The characteristic of the system depends on the wind turbine, the alternator, and the system configuration. If the electrical load does not match the wind turbine, the performance of the system will be degraded. By matching the electrical load to the wind turbine, the system can be improved significantly. This paper analyzes the properties of the system components. The effects of parameter variation and the system configuration on the system performance are investigated. Two basic methods of shaping the torque-speed characteristic of the generator are presented. The uncompensated as well as the compensated systems are discussed. Control strategies to improve the system performance …", "num_citations": "68\n", "authors": ["1051"]}
{"title": "Short-circuit modeling of a wind power plant\n", "abstract": " An important aspect of wind power plant (WPP) impact studies is to evaluate short-circuit current (SCC) contribution of the plant into the transmission network under different fault conditions. This information is needed to size the circuit breakers, to establish the proper system protection, and to choose the transient suppressor in the circuits within the WPP. This task can be challenging to protection engineers due to the topology differences between different types of wind turbine generators (WTGs) and the conventional generating units. This paper investigates the short-circuit behavior of a WPP for different types of wind turbines. The short-circuit behavior will be presented. Both the simplified models and detailed models are used in the simulations and both symmetrical faults and unsymmetrical faults are discussed.", "num_citations": "67\n", "authors": ["1051"]}
{"title": "Demonstration of essential reliability services by a 300-MW solar photovoltaic power plant\n", "abstract": " The California Independent System Operator (CAISO), First Solar, and the National Renewable Energy Laboratory (NREL) conducted a demonstration project on a large utility-scale photovoltaic (PV) power plant in California to test its ability to provide essential ancillary services to the electric grid. With increasing shares of solar-and wind-generated energy on the electric grid, traditional generation resources equipped with automatic governor control (AGC) and automatic voltage regulation controls--specifically, fossil thermal--are being displaced. The deployment of utility-scale, grid-friendly PV power plants that incorporate advanced capabilities to support grid stability and reliability is essential for the large-scale integration of PV generation into the electric power grid, among other technical requirements. A typical PV power plant consists of multiple power electronic inverters and can contribute to grid stability and reliability through sophisticated'grid-friendly'controls. In this way, PV power plants can be used to mitigate the impact of variability on the grid, a role typically reserved for conventional generators. In August 2016, testing was completed on First Solar's 300-MW PV power plant, and a large amount of test data was produced and analyzed that demonstrates the ability of PV power plants to use grid-friendly controls to provide essential reliability more»", "num_citations": "60\n", "authors": ["1051"]}
{"title": "Advanced grid-friendly controls demonstration project for utility-scale PV power plants\n", "abstract": " A typical photovoltaic (PV) power plant consists of multiple power electronic inverters and can contribute to grid stability and reliability through sophisticated'grid-friendly'controls. The availability and dissemination of actual test data showing the viability of advanced utility-scale PV controls among all industry stakeholders can leverage PV's value from being simply an energy resource to providing additional ancillary services that range from variability smoothing and frequency regulation to power quality. Strategically partnering with a selected utility and/or PV power plant operator is a key condition for a successful demonstration project. The US Department of Energy's (DOE's) Solar Energy Technologies Office selected the National Renewable Energy Laboratory (NREL) to be a principal investigator in a two-year project with goals to (1) identify a potential partner (s),(2) develop a detailed scope of work and test plan for a field project to demonstrate the gird-friendly capabilities of utility-scale PV power plants,(3) facilitate conducting actual demonstration tests, and (4) disseminate test results among industry stakeholders via a joint NREL/DOE publication and participation in relevant technical conferences. The project implementation took place in FY 2014 and FY 2015. In FY14, NREL established collaborations with AES and First Solar Electric, LLC, to conduct demonstration testing more»", "num_citations": "54\n", "authors": ["1051"]}
{"title": "A spatial-economic cost-reduction pathway analysis for US offshore wind energy development from 2015–2030\n", "abstract": " This report describes a comprehensive effort undertaken by the National Renewable Energy Laboratory (NREL) to understand the cost of offshore wind energy for markets in the United States. The study models the cost impacts of a range of offshore wind locational cost variables for more than 7,000 potential coastal sites in US offshore wind resource areas. It also assesses the impact of more than 50 technology innovations on potential future costs for both fixed-bottom and floating wind systems. Comparing these costs to an initial site-specific assessment of local avoided generating costs, the analysis provides a framework for estimating the economic potential for offshore wind. The analysis is intended to inform a broad set of stakeholders and enable an assessment of offshore wind as part of energy development and energy portfolio planning. It provides information that federal and state agencies and planning commissions could use to inform initial strategic decisions about offshore wind developments in the United States.", "num_citations": "53\n", "authors": ["1051"]}
{"title": "Optimizing small wind turbine performance in battery charging applications\n", "abstract": " Many small wind turbine generators (10 kW or less) consist of a variable speed rotor driving a permanent magnet synchronous generator (alternator). One application of such wind turbines is battery charging, in which the generator is connected through a rectifier to a battery bank. The wind turbine electrical interface is essentially the same whether the turbine is part of a remote power supply for telecommunications, a standalone residential power system, or a hybrid village power system, in short, any system in which the wind generator output is rectified and fed into a DC bus. Field experience with such applications has shown that both the peak power output and the total energy capture of the wind turbine often fall short of expectations based on rotor size and generator rating. In this paper, the authors present a simple analytical model of the typical wind generator battery charging system that allows one to calculate actual power curves if the generator and rotor properties are known. The model clearly illustrates how the load characteristics affect the generator output. In the second part of this paper, the authors present four approaches to maximizing energy capture from wind turbines in battery charging applications. The first of more»", "num_citations": "49\n", "authors": ["1051"]}
{"title": "2018 offshore wind technologies market report\n", "abstract": " Offshore wind energy is a rapidly growing global industry that creates electricity from wind turbines installed in coastal waters on either rigid or floating substructures anchored to the seabed or lake bottom. The 2018 Offshore Wind Technologies Market Report was developed by the National Renewable Energy Laboratory (NREL) with support from the US Department of Energy (DOE) and is intended to provide offshore wind policymakers, regulators, developers, researchers, engineers, financiers, supply chain participants, and other stakeholders with up-to-date quantitative information about the offshore wind market, technology, and cost trends in the United States and worldwide. This report provides detailed information on the domestic offshore wind industry to contextualize the US market and help policymakers, researchers, and the general public understand technical and market barriers and opportunities. Globally, the scope of the report covers the status of the 176 operating offshore wind projects through December 31, 2018, and provides the status of, and analysis on, a broader global pipeline of 838 projects in various stages of development. To provide the most up-to-date discussion of this dynamically evolving industry, this report also tracks the most significant domestic developments and events from January 1, 2018, through March 31, 2019. The following is a more»", "num_citations": "48\n", "authors": ["1051"]}
{"title": "Modeling and analysis of value of advanced pumped storage hydropower in the United States\n", "abstract": " This report is the last of seven reports developed during the US Department of Energy (DOE) study on the “Modeling and Analysis of Value of Advanced Pumped Storage Hydropower in the United States.” This report is the Final Project Report and provides an overview of all activities and work performed by the project team, as well the key results and findings of the various analyses performed during the study. The study was led by Argonne National Laboratory in collaboration with Siemens PTI, Inc., Energy Exemplar, LLC, MWH Americas, Inc., and the National Renewable Energy Laboratory (NREL). Funding for the study was provided by DOE’s Office of Energy Efficiency and Renewable Energy (EERE) through a program managed by the EERE’s Wind and Water Power Technologies Office (WWPTO).The scope of work for the study contained two main components:(1) development of vendorneutral dynamic simulation models for advanced pumped storage hydropower (PSH) technologies, and (2) production cost and revenue analyses to assess the value of advanced PSH in the power system. Throughout the study, the project team was supported and guided by an Advisory Working Group (AWG) consisting of more than 30 experts from a diverse group of organizations within the hydropower industry, including equipment manufacturers, electric power utilities, regional electricity market operators, hydro engineering and consulting companies, national laboratories, universities and research institutions, hydropower industry associations, and government and regulatory agencies.", "num_citations": "48\n", "authors": ["1051"]}
{"title": "Dynamic modeling of adjustable-speed pumped storage hydropower plant\n", "abstract": " Hydropower is the largest producer of renewable energy in the U.S. More than 60% of the total renewable generation comes from hydropower. There is also approximately 22 GW of pumped storage hydropower (PSH). Conventional PSH uses a synchronous generator, and thus the rotational speed is constant at synchronous speed. This work details a hydrodynamic model and generator/power converter dynamic model. The optimization of the hydrodynamic model is executed by the hydro-turbine controller, and the electrical output real/reactive power is controlled by the power converter. All essential controllers to perform grid-interface functions and provide ancillary services are included in the model.", "num_citations": "46\n", "authors": ["1051"]}
{"title": "Doubly fed induction generator in an offshore wind power plant operated at rated V/Hz\n", "abstract": " This paper introduces the concept of constant volt/hertz operation of offshore wind power plants (WPPs). The deployment of offshore WPPs requires power transmission from the plant to the load center inland. Because this power transmission requires submarine cables, there is a need to use high-voltage direct current (HVDC) transmission, which is economical for distances greater than 50 km. In the concept presented here, the onshore substation was operated at 60 Hz synced with the grid, and the offshore substation was operated at variable frequency and voltage, allowing the WPP to be operated at constant volt/hertz. In this paper, a variable frequency at rated volt/hertz operation was applied to a Type 3 doubly fed induction generator (DFIG) wind turbine generator. The size of the power converter at the turbine can be significantly reduced from 30 % of the rated power output in a conventional Type 3 turbine to 5 …", "num_citations": "44\n", "authors": ["1051"]}
{"title": "Effects of power reserve control on wind turbine structural loading\n", "abstract": " As the penetration of wind energy in worldwide electrical utility grids increases, there is a growing interest in the provision of active power control (APC) services from wind turbines and power plants to aid in maintaining grid stability. Recent research has focused on the design of active power controllers for wind turbines that can provide a range of APC services including inertial, primary frequency and secondary frequency control. An important consideration for implementing these controllers in practice is assessing their impact on the lifetime of wind turbine components. In this paper, the impact on the structural loads of a wind turbine providing a power reserve is explored by performing a load suite analysis for several torque‐based control strategies. Power reserve is required for providing those APC services that require the ability of the wind turbine to supply an increase in power. To study this, we performed a …", "num_citations": "43\n", "authors": ["1051"]}
{"title": "Analysis of wind power for battery charging\n", "abstract": " One type of wind-powered battery charging will be explored in this paper. It consists of a wind turbine driving a permanent magnet alternator and operates at variable speed. The alternator is connected to a battery bank via a rectifier. The characteristic of the system depends on the wind turbine, the alternator, and the system configuration. If the electrical load does not match the wind turbine, the performance of the system will be degraded. By matching the electrical load to the wind turbine, the system can be improved significantly. This paper analyzes the properties of the system components. The effects of parameter variation and the system configuration on the system performance are investigated. Two basic methods of shaping the torque-speed characteristic of the generator are presented. The uncompensated as well as the compensated systems will be discussed. Control strategies to improve the system performance will be explored. Finally, a summary of the paper will be presented in the last section.", "num_citations": "43\n", "authors": ["1051"]}
{"title": "User guide for PV dynamic model simulation written on PSCAD platform\n", "abstract": " This document describes the dynamic photovoltaic model developed by the National Renewable Energy Laboratory and is intended as a guide for users of these models.", "num_citations": "42\n", "authors": ["1051"]}
{"title": "Wind power plant short circuit current contribution for different fault and wind turbine topologies\n", "abstract": " This paper presents simulation results for SC current contribution for different types of WTGs obtained through transient and steady-state computer simulation software.", "num_citations": "41\n", "authors": ["1051"]}
{"title": "Grid-level application of electrical energy storage: Example use cases in the United States and China\n", "abstract": " Electrical energy storage (EES) systems are expected to play an increasing role in helping the United States and China-the world's largest economies with the two largest power systems-meet the challenges of integrating more variable renewable resources and enhancing the reliability of power systems by improving the operating capabilities of the electric grid. EES systems are becoming integral components of a resilient and efficient grid through a diverse set of applications that include energy management, load shifting, frequency regulation, grid stabilization, and voltage support.", "num_citations": "37\n", "authors": ["1051"]}
{"title": "A global real-time superlab: Enabling high penetration of power electronics in the electric grid\n", "abstract": " The Global Real-Time Superlaboratory (Global RT Superlab) represents a vendor-neutral distributed platform based on the virtual interconnection of digital real-time simulators (DRTSs) and hardware-in-the-loop (HIL) setups hosted at eight geographically distributed laboratories in the United States and Europe (Figure 1). This article describes the efforts toward the realization of this largescale virtual infrastructure and explains a demonstration of the multilab setup for simulation and testing of next-generation global power grids.", "num_citations": "36\n", "authors": ["1051"]}
{"title": "Renewables for sustainable village power\n", "abstract": " It is estimated that two billion people live without electricity and its services. In addition, there is a sizeable number of rural villages that have limited electrical service, with either part-day operation by diesel gen-sets or partial electrification (local school or community center and several nearby houses). For many villages connected to the grid, power is often sporadically available and of poor quality. The US National Renewable Energy Laboratory (NREL) in Golden, Colorado, has initiated a program to address these potential electricity opportunities in rural villages through the application of renewable energy (RE) technologies. The objective of this program is to develop and implement applications that demonstrate the technical performance, economic competitiveness, operational viability, and environmental benefits of renewable rural electric solutions, compared to the conventional options of line extension and isolated diesel mini-grids. These four attributes foster sustainability; therefore, the program is entitled Renewables for Sustainable Village Power (RSVP). The RSVP program is a multi-technology, multi-application program composed of six activities, including village applications development, computer model development, systems analysis, pilot project development, technical assistance, and Internet-based village power project data base. While the current program emphasizes wind, photovoltaics (PV), and their hybrids with diesel gen-sets, micro-hydro and micro-biomass more»", "num_citations": "35\n", "authors": ["1051"]}
{"title": "PSCAD modules representing PV generator\n", "abstract": " Photovoltaic power plants (PVPs) have been growing in size, and the installation time is very short. With the cost of photovoltaic (PV) panels dropping in recent years, it can be predicted that in the next 10 years the contribution of PVPs to the total number of renewable energy power plants will grow significantly. In this project, the National Renewable Energy Laboratory (NREL) developed a dynamic modeling of the modules to be used as building blocks to develop simulation models of single PV arrays, expanded to include Maximum Power Point Tracker (MPPT), expanded to include PV inverter, or expanded to cover an entire PVP. The focus of the investigation and complexity of the simulation determines the components that must be included in the simulation. The development of the PV inverter was covered in detail, including the control diagrams. Both the current-regulated voltage source inverter and the current-regulated current source inverter were developed in PSCAD. Various operations of the PV inverters were simulated under normal and abnormal conditions. Symmetrical and unsymmetrical faults were simulated, presented, and discussed. Both the three-phase analysis and the symmetrical component analysis were included to clarify the understanding of unsymmetrical faults. The dynamic model validation was based on more»", "num_citations": "34\n", "authors": ["1051"]}
{"title": "Improved inertial control for permanent magnet synchronous generator wind turbine generators\n", "abstract": " With increasing integrations of large-scale systems based on permanent magnet synchronous generator wind turbine generators (PMSG-WTGs), the overall inertial response of a power system will tend to deteriorate as a result of the decoupling of rotor speed and grid frequency through the power converter as well as the scheduled retirement of conventional synchronous generators. Thus, PMSG-WTGs can provide value to an electric grid by contributing to the system's inertial response through the inherent kinetic energy stored in their rotating masses and fast power converter control. In this study, an improved inertial control method based on the maximum power point tracking operation curve is introduced to enhance the overall frequency support capability of PMSG-WTGs in the case of large supply-demand imbalances. Moreover, this method is implemented in the CART2-PMSG integrated model in MATLAB …", "num_citations": "33\n", "authors": ["1051"]}
{"title": "Fixed-speed and variable-slip wind turbines providing spinning reserves to the grid\n", "abstract": " As the level of wind penetration increases, wind turbine technology must move from merely generating power from wind to taking a role in supporting the bulk power system. Wind turbines should have the capability to provide inertial response and primary frequency (governor) response. Wind turbine generators with this capability can support the frequency stability of the grid. To provide governor response, wind turbines should be able to generate less power than the available wind power and hold the rest in reserve, ready to be accessed as needed. In this paper, we explore several ways to control wind turbine output to enable reserve-holding capability. The focus of this paper is on fixed-speed (also known as Type 1) and variable-slip (also known as Type 2) wind turbines.", "num_citations": "33\n", "authors": ["1051"]}
{"title": "Variable frequency operations of an offshore wind power plant with HVDC-VSC\n", "abstract": " In this paper, a constant Volt/Hz operation applied to the Type 1 wind turbine generator. Various control aspects of Type 1 generators at the plant level and at the turbine level will be investigated.", "num_citations": "32\n", "authors": ["1051"]}
{"title": "Role of wind power in primary frequency response of an interconnection\n", "abstract": " The electrical frequency of an interconnection must be maintained very close to its nominal level at all times. Large frequency deviations can lead to unintended consequences such as load shedding, instability, and machine damage, among others. Turbine governors of conventional generating units provide primary frequency response (PFR) to ensure that frequency deviations are not significant duringlarge transient events. Increasing penetrations of variable renewable generation, such as wind and solar power, and planned retirements of conventional thermal plants-and thus a reduction in the amount of suppliers with PFR capabilities-causes concerns about a decline of PFR and system inertia in North America. The capability of inverter-coupled wind generation technologies to contribute toPFR and inertia, if appropriately equipped with the necessary control features, can help alleviate concerns. However, these responses differ from those supplied by conventional generation and inertia, and it is not entirely understood how variable renewable generation will affect the system response at different penetration levels. This paper evaluates the impact of wind generation providing PFRand synthetic inertial response on a large interconnection.", "num_citations": "30\n", "authors": ["1051"]}
{"title": "Real-time co-simulation of adjustable-speed pumped storage hydro for transient stability analysis\n", "abstract": " Pumped storage hydro (PSH) based generation of electricity is a proven grid level storage technique. A new configuration i.e., adjustable speed PSH (AS-PSH) power plant is modeled and discussed in this paper. Hydrodynamic models are created using partial differential equations and the governor topology adopted from an existing, operational AS-PSH unit. Physics-based simulation of both hydrodynamics and power system dynamics has been studied individually in the past. This paper demonstrates a co-simulation of an AS-PSH unit between penstock hydrodynamics and power system events in a real-time environment. Co-simulation provides an insight into the dynamic and transient operation of AS-PSH connected to a bulk power system network. The two modes of AS-PSH operation presented in this paper are turbine and pump modes. A general philosophy of operating in turbine mode is prevalent in the …", "num_citations": "29\n", "authors": ["1051"]}
{"title": "Dynamic capabilities of an energy storage-embedded DFIG system\n", "abstract": " Power electronic-based wind turbine generators (WTGs) are capable of providing inertial response to the grid by releasing kinetic energy from the turbine blade; thus, as conventional power plants are retired, the reduction of online inertia can be compensated by designing frequency controls for the WTGs. Deployment of energy storage technology for renewable generations has been increased to have the renewables centralized with a system operator as an independent power supply by making up for their nature of generation. In addition, the cost of energy storage has dropped over time and global research activities on energy storage have been funded by private industries and governments. This paper investigates the opportunity of deploying an energy storage on a doubly fed induction generator (DFIG)-based WTG to respond to the system frequency, and then explores dynamic capabilities of the energy …", "num_citations": "27\n", "authors": ["1051"]}
{"title": "Harmonics in a wind power plant\n", "abstract": " Wind power generation has been growing at a very fast pace for the past decade, and its influence and impact on the electric power grid is significant. As in a conventional power plant, a wind power plant (WPP) must ensure that the quality of the power being delivered to the grid is excellent. At the same time, the wind turbine should be able to operate immune to small disturbances coming from the grid. Harmonics are one of the more common power quality issues presented by large WPPs because of the high switching frequency of the power converters and the possible non-linear behavior from electric machines (generator, transformer, reactors) within a power plant. This paper presents a summary of the most important issues related to harmonics in WPPs and discusses practical experiences with actual Type 1 and Type 3 wind turbines in two WPPs.", "num_citations": "27\n", "authors": ["1051"]}
{"title": "Dynamic model validation of PV inverters under short-circuit conditions\n", "abstract": " Photovoltaic (PV) modules have dramatically decreased in price in the past few years, spurring the expansion of PV deployment. Residential and commercial rooftop installations are connected to the distribution network; largescale installation PV power plants have benefited from tax incentives and the low cost of PV modules. As the penetration of PV generation increases, the impact on power system reliability will also be greater. Utility power system planners must consider the role of PV generation in power systems more realistically by representing PV generation in dynamic stability analyses. Dynamic models of PV inverters have been developed in the positive sequence representation. We developed a PV inverter dynamic model in PSCAD /EMTDC. This paper validates the dynamic model with an actual hardware bench test conducted by Southern California Edison's Distributed Energy Resources laboratory …", "num_citations": "27\n", "authors": ["1051"]}
{"title": "Understanding dynamic model validation of a wind turbine generator and a wind power plant\n", "abstract": " Regional reliability organizations require power plants to validate the dynamic models that represent them to ensure that power systems studies are performed to the best representation of the components installed. In the process of validating a wind power plant (WPP), one must be cognizant of the parameter settings of the wind turbine generators (WTGs) and the operational settings of the WPP. Validating the dynamic model of a WPP is required to be performed periodically. This is because the control parameters of the WTGs and the other supporting components within a WPP may be modified to comply with new grid codes or upgrades to the WTG controller with new capabilities developed by the turbine manufacturers or requested by the plant owners or operators. The diversity within a WPP affects the way we represent it in a model. Diversity within a WPP may be found in the way the WTGs are controlled, the …", "num_citations": "26\n", "authors": ["1051"]}
{"title": "Modeling, testing and economic analysis of a wind-electric battery charging station\n", "abstract": " Battery charging systems are very important in many developing countries where rural families cannot afford a solar-battery home system or other electricity options, but they can afford to own a battery (in some cases more than one battery) and can pay for it to be charged on a regular basis. Because the typical households that use batteries are located far from the grid, small wind battery charging stations can be a cost-competitive options for charging batteries. However, the technical aspects of charging numerous 12-volt batteries on one DC bus with a small permanent magnet alternator wind turbine suggest that a special battery charging station be developed. NREL conducted research on two different types of wind battery charging stations: a system that uses one charge controller for the entire DC bus and charges batteries in parallel strings of four batteries each, and one that uses individual charge controllers for each battery. The authors present test results for both system configurations. In addition, modeling results of steady-state time series simulations of both systems are compared. Although the system with the single charge controller for the entire bus is less expensive, it results in less efficient battery charging. The authors also include in more»", "num_citations": "26\n", "authors": ["1051"]}
{"title": "Large-signal impedance-based modeling and mitigation of resonance of converter-grid systems\n", "abstract": " Large-signal impedance of grid-connected converters can be used to predict resonance-generated distortions in converter-grid systems. Note that the large-signal impedance of a network represents its impedance response for different magnitudes of perturbation injected at its terminals. This paper presents large-signal impedance-based modeling and mitigation of resonance of grid-connected voltage source converters. Challenges of large-signal modeling because of the inapplicability of the small-signal approximation are addressed by leveraging the dominating influence of hard nonlinearities (such as pulsewidth modulation saturation and limiters) over soft nonlinearities (such as Park's transformations and phase-locked loop (PLL)) in shaping the large-signal behavior of the converter. The paper develops large-signal gains of hard nonlinearities using different types of describing functions. The paper shows that …", "num_citations": "25\n", "authors": ["1051"]}
{"title": "Energy storage, renewable power generation, and the grid: NREL capabilities help to develop and test energy-storage technologies\n", "abstract": " Continued growth of renewable power generation could lead to a sustainable energy future with lower greenhouse gas emissions. A recent trend highlighting this growth is the installation of solar and wind power generation exceeding that of new conventional power generation from coal and nuclear power plants. Furthermore, the cost of electricity generation by solar and wind is rapidly approaching grid parity in many regions of the world.", "num_citations": "25\n", "authors": ["1051"]}
{"title": "Hawaiian electric advanced inverter grid support function laboratory validation and analysis\n", "abstract": " The objective for this test plan was to better understand how to utilize the performance capabilities of advanced inverter functions to allow the interconnection of distributed energy resource (DER) systems to support the new Customer Self-Supply, Customer Grid-Supply, and other future DER programs. The purpose of this project was: 1) to characterize how the tested grid supportive inverters performed the functions of interest, 2) to evaluate the grid supportive inverters in an environment that emulates the dynamics of O'ahu's electrical distribution system, and 3) to gain insight into the benefits of the grid support functions on selected O'ahu island distribution feeders. These goals were achieved through laboratory testing of photovoltaic inverters, including power hardware-in-the-loop testing.", "num_citations": "24\n", "authors": ["1051"]}
{"title": "Stability assessment of a system comprising a single machine and inverter with scalable ratings\n", "abstract": " Synchronous machines have traditionally acted as the foundation of large-scale electrical infrastructures and their physical properties have formed the cornerstone of system operations. However, with the increased integration of distributed renewable resources and energy-storage technologies, there is a need to systematically acknowledge the dynamics of power-electronics inverters - the primary energy-conversion interface in such systems - in all aspects of modeling, analysis, and control of the bulk power network. In this paper, we assess the properties of coupled machine-inverter systems by studying an elementary system comprised of a synchronous generator, three-phase inverter, and a load. The inverter model is formulated such that its power rating can be scaled continuously across power levels while preserving its closed-loop response. Accordingly, the properties of the machine-inverter system can be …", "num_citations": "23\n", "authors": ["1051"]}
{"title": "The frequency-watt function: simulation and testing for the Hawaiian electric companies\n", "abstract": " This interim report describes research related to frequency-watt control of solar photovoltaic (PV) inverters conducted under the US Department of Energy's Grid Modernization Laboratory Consortium (GMLC) by a regional partnership for Hawaii. The purpose of this report is to inform an ongoing discussion around frequency-watt control activation in Hawaii.", "num_citations": "23\n", "authors": ["1051"]}
{"title": "Impact of wind active power control strategies on frequency response of an interconnection\n", "abstract": " High penetrations of variable generation presents challenges for reliable operation of the power system. Ensuring adequate primary frequency response is one such concern as the generation mix changes with increasing penetration of variable generation and planned retirements of fossil-fired generation. However, inverter-coupled wind generation is capable of contributing to primary frequency response. The focus of the simulation work presented in this paper is to assess the impact of active power control strategies of wind generation on the primary frequency response of an interconnection. All simulations were conducted using the General Electric (GE) PSLF ®  simulation tool. The base case utilized was developed from the Western Electricity Coordinating Council (WECC) Transmission Expansion Planning Policy Committee (TEPPC) 2022 case with light spring load conditions with approximately 15% wind …", "num_citations": "23\n", "authors": ["1051"]}
{"title": "Synchronous condenser allocation for improving system short circuit ratio\n", "abstract": " With converter-based renewable energy sources increasingly integrated into power systems and conventional power plants gradually phased out, future power systems will experience reduced short circuit strength. The deployment of synchronous condensers can serve as a potential solution. This paper presents an optimal synchronous condenser allocation method for improving system short circuit ratio at converter point of common coupling using a modified short circuit analysis approach. The total cost of installing new synchronous condensers is minimized while the system short circuit ratios are maintained above a certain level. The presented method is implemented on the simplified western Danish power system for a future scenario.", "num_citations": "21\n", "authors": ["1051"]}
{"title": "Small wind turbine testing and applications development\n", "abstract": " Small wind turbines offer a promising alternative for many remote electrical uses where there is a good wind resource. The National Wind Technology Center (NWTC) of the National Renewable Energy Laboratory helps further the role that small turbines can play in supplying remote power needs. The NWTC tests and develops new applications for small turbines. The NWTC also develops components used in conjunction with wind turbines for various applications. This paper describes wind energy research at the NWTC for applications including battery charging stations, water desalination/purification, and health clinics. Development of data acquisition systems and tests on small turbines are also described.", "num_citations": "21\n", "authors": ["1051"]}
{"title": "Ramping performance analysis of the Kahuku wind-energy battery storage system\n", "abstract": " High penetrations of wind power on the electrical grid can introduce technical challenges caused by resource variability. Such variability can have undesirable effects on the frequency, voltage, and transient stability of the grid. Energy storage devices can be an effective tool in reducing variability impacts on the power grid in the form of power smoothing and ramp control. Integrating anenergy storage system with a wind power plant can help smooth the variable power produced from wind. This paper explores the fast-response, megawatt-scale, wind-energy battery storage systems that were recently deployed throughout the Hawaiian islands to support wind and solar projects.", "num_citations": "20\n", "authors": ["1051"]}
{"title": "Variable-speed wind power plant operating with reserve power capability\n", "abstract": " As the level of wind penetration increases, wind turbine technology must move from merely generating power from wind to taking a role in supporting the bulk power system. Wind turbines should have the capability to provide inertial response and primary frequency (governor) response. Wind turbine generators with this capability can support the frequency stability of the grid. To provide governor response, wind turbines should be able to generate less power than the available wind power and hold the rest in reserves, ready to be accessed as needed. In this paper, we explore several ways to control wind turbine output to enable reserve-holding capability. The focus of this paper is on doubly-fed induction generator (also known as Type 3) and full-converter (also known as Type 4) wind turbines.", "num_citations": "19\n", "authors": ["1051"]}
{"title": "Investigation on the combined effect of VSC-based sources and synchronous condensers under grid unbalanced faults\n", "abstract": " The short circuit response of voltage source converters (VSCs) could be significantly different from that of synchronous condensers (SCs) under unbalanced faults. This paper investigates the combined effect of VSC-based sources and synchronous condensers under grid unbalanced faults considering two groups of VSC fault-ride-through control strategies. It aims to provide an evaluation of typical control strategies and to explore the impact of equipping a synchronous condenser at the point of common coupling (PCC). By examining the combined short-circuit currents, PCC voltages, DC-side voltages, and system frequency responses, this study points out the merits and demerits of the examined control strategies, illustrates the benefits of synchronous condensers on mitigating the disadvantages of certain control strategies, and provides suggestions on selecting the control strategies for the VSC when …", "num_citations": "18\n", "authors": ["1051"]}
{"title": "Implementations and evaluations of wind turbine inertial controls with FAST and digital real-time simulations\n", "abstract": " This paper presents a novel simulation approach to evaluate new ancillary service controls in the context of large-scale wind power integration. We adopt and compare different types of turbine inertial control methods with the proposed modifications to cope with realistic wind conditions in the field. The simulation procedure is started with the software-based simulation, in which we employ the high-fidelity wind turbine simulator FAST that models a real three-bladed controls advanced research turbine (CART3). The advantages of using FAST are that it can provide convincing simulation results and address the interactions between turbine electrical and mechanical systems. The developed controller model is then rapidly prototyped for the real-time simulation with the hardware-in-the-loop scheme. CART3 will respond to a virtual frequency event triggered in the emulated electric grid modeled in a digital real-time …", "num_citations": "17\n", "authors": ["1051"]}
{"title": "Evaluation of different inertial control methods for variable‐speed wind turbines simulated by fatigue, aerodynamic, structures and turbulence (FAST)\n", "abstract": " To mitigate the degraded power system inertia and undesirable primary frequency response caused by large‐scale wind power integration, the frequency support capabilities of variable‐speed wind turbines is studied in this work. This is made possible by controlled inertial response, which is demonstrated on a research turbine – controls advanced research turbine, 3‐bladed (CART3). Two distinct inertial control (IC) methods are analysed in terms of their impacts on the grids and the response of the turbine itself. The released kinetic energy in the IC methods are determined by the frequency measurement or shaped active power reference in the turbine speed–power plane. The wind turbine model is based on the high‐fidelity turbine simulator fatigue, aerodynamic, structures and turbulence, which constitutes the aggregated wind power plant model with the simplified power converter model. The IC methods are …", "num_citations": "16\n", "authors": ["1051"]}
{"title": "Capability-coordinated frequency control scheme of a virtual power plant with renewable energy sources\n", "abstract": " Growing trends in the deployment of inverter-based renewable energy will decrease the inertia and frequency control capability of electric power systems by replacing conventional power plants; thus, the frequency of future power systems might be dynamic. This study proposes a capability-coordinated frequency control (CCFC) scheme of a virtual power plant (VPP) including adjustable-speed pumped storage hydropower (AS-PSH), a wind power plant (WPP), and an energy storage system to support the frequency nadir and reduce the steady-state error of system frequency. The CCFC scheme is based on a hierarchical-control structure in which a CCFC organises the output of local frequency control units. To support the frequency nadir, the CCFC dispatches weighted frequency errors that are proportional to the available headroom of the units; thus, the errors are forwarded separately with a system frequency …", "num_citations": "15\n", "authors": ["1051"]}
{"title": "Advanced grid simulator for multi-megawatt power converter testing and certification\n", "abstract": " Grid integration testing of inverter-coupled renewable energy technologies is an essential step in the qualification of renewable energy and energy storage systems to ensure the stability of the power system. New types of devices must be thoroughly tested and validated for compliance with relevant grid codes and interconnection requirements. For this purpose, highly specialized custom-made testing equipment is needed to emulate various types of realistic grid conditions that are required by certification bodies or for research purposes. For testing multi-megawatt converters, a high power grid simulator capable of creating controlled grid conditions and meeting both power quality and dynamic characteristics is needed. This paper describes the new grid simulator concept based on ABB's medium voltage ACS6000 drive technology that utilizes advanced modulation and control techniques to create an unique testing …", "num_citations": "15\n", "authors": ["1051"]}
{"title": "Wind power plant enhancement with a fault current limiter\n", "abstract": " An important aspect of wind power plant (WPP) impact studies is to evaluate the short-circuit (SC) current contribution of the plant into the transmission network under different fault conditions. This task can be challenging to protection engineers due to the topology differences between different types of wind turbine generators (WTGs) and the conventional generating units. While it is important to size the circuit breaker to accommodate the available SC current, the available rating of a circuit breaker is limited. A fault current limiter (FCL) has the capability to limit the SC current, and in some cases, may be necessary to limit the SC current from a WPP to defer the replacement of a circuit breaker currently installed in the transmission line. This paper investigates the capability of a saturable core FCL to limit the SC current of different types of WTGs. Different faults are simulated to investigate the effectiveness of the FCL to …", "num_citations": "15\n", "authors": ["1051"]}
{"title": "The impact of the output power fluctuation of a wind farm on a power grid\n", "abstract": " In an offshore wind farm, a large number of wind turbines feed power into the power grid at the point of common coupling. The power fluctuation at each wind turbine is affected by the type of turbine, the control algorithm, the wind speed fluctuation, and the tower shadow effect. The power measurement from a single wind turbine usually shows a large fluctuation of output power. Because many turbines are connected in a wind farm, the power fluctuation from one turbine may cancel the power fluctuation of another turbine, effectively rectifying the power fluctuation of the overall wind farm. As wind energy technologies progress, wind turbines are getting larger. Wind turbine manufacturers are currently producing multimegawatt wind turbines. As wind turbines get larger, fewer turbines are needed to deliver the same power. Thus, the power fluctuation of an individual wind turbine will have a greater impact on the power network. The impact will be even greater on a weak grid. This paper explores the effects of wind farm power fluctuations on the power network. Utility companies are concerned about the effects of the power generated by a wind farm. Utilities need to ensure that the voltage variation, current harmonics, and voltage flicker stay within acceptable limits. Current harmonics issues will not be discussed in this paper, as present converters generate a very sinusoidal output current. A dynamic simulation of a wind farm is performed and the spatial distribution of the wind turbines is considered. The effect of power fluctuations is quantified by measuring the flicker and the voltage variation for different case studies. Taking a conservative approach …", "num_citations": "15\n", "authors": ["1051"]}
{"title": "Small-signal modeling and design of phase-locked loops using harmonic signal-flow graphs\n", "abstract": " This article introduces signal-flow graphs for linear time-periodic systems to streamline and visually describe the frequency-domain modeling of complex phase-locked loop (PLL) systems used in grid-connected converters. Small-signal modeling using the proposed graphs is demonstrated for two commonly used single-phase PLL structures: SOGI-PLL and Park-PLL. Loop-gain models are developed for these PLLs to evaluate how an orthogonal signal generator (OSG), which is required in single-phase PLLs using the synchronous reference frame (SRF) architecture, modifies the PLL loop gain compared to that of a three-phase SRF-PLL, which does not require an OSG. It is shown that the OSG in the SOGI-PLL and Park-PLL introduces a significant phase lag in the PLL loop gain, limiting the maximum bandwidth for which either PLL can be designed. Slow-frequency adaptation (SFA) of OSG is proposed to …", "num_citations": "14\n", "authors": ["1051"]}
{"title": "Supercapacitor to provide ancillary services\n", "abstract": " Supercapacitor technology has reached a level of maturity as a viable energy storage option available to support a modern electric power system grid; however, its application is still limited because of its energy capacity and the cost of the commercial product. In this paper, we demonstrate transient models of supercapacitor energy storage plants operating in coordination with run-of-the-river (ROR), doubly-fed induction generator hydropower plants (HPP) using a conceptual system control architecture. A detailed transient model of a supercapacitor energy storage device is coupled with the grid via a three-phase inverter/rectifier and bidirectional DC-DC converter. In addition, we use a version of a 14-bus IEEE test case that includes the models of the supercapacitor energy storage device, ROR HPPs, and synchronous condensers that use the rotating synchronous generators of retired coal-powered plants. In this …", "num_citations": "14\n", "authors": ["1051"]}
{"title": "Symmetrical and unsymmetrical fault currents of a wind power plant\n", "abstract": " The size of wind power plants (WPPs) keeps getting bigger and bigger. The number of wind plants in the U.S. has increased very rapidly in the past 10 years. It is projected that in the U.S., the total wind power generation will reach 330 GW by 2030. As the importance of WPPs increases, planning engineers must perform impact studies used to evaluate short-circuit current (SCC) contribution of the plant into the transmission network under different fault conditions. This information is needed to size the circuit breakers, to establish the proper system protection, and to choose the transient suppressor in the circuits within the WPP. This task can be challenging to protection engineers due to the topology differences between different types of wind turbine generators (WTGs) and the conventional generating units. This paper investigates the short-circuit behavior of a WPP for different types of wind turbines. Both …", "num_citations": "14\n", "authors": ["1051"]}
{"title": "Supercapacitor to provide ancillary services with control coordination\n", "abstract": " This paper proposes a dynamic frequency support scheme of a supercapacitor energy storage system (SCESS) in coordination with run-of-the-river-based pumped storage hydropower (PSH) to enhance the short-term frequency stability in a power system that has a high penetration of renewable energy. To achieve this, the proposed coordinated frequency controller (CFC) enables the SCESS and PSH plant to provide the frequency response. The CFC scheme employs a dynamic droop characteristic in parallel with an integral controller and a distribution function. The dynamic droop characteristic determines the power production for frequency regulation employing a variable gain, which varies with the total capacity of the frequency control units and magnitude of the system frequency error with time; the gain increases with the frequency error, and thereby, arresting the frequency nadir at a higher level than in the …", "num_citations": "13\n", "authors": ["1051"]}
{"title": "Inertial response of wind power plants: A comparison of frequency-based inertial control and stepwise inertial control\n", "abstract": " The frequency regulation capability of a wind power plant plays an important role in enhancing frequency reliability especially in an isolated power system with high wind power penetration levels. A comparison of two types of inertial control methods, namely frequency-based inertial control (FBIC) and stepwise inertial control (SIC), is presented in this paper. Comprehensive case studies are carried out to reveal features of the different inertial control methods, simulated in a modified Western System Coordination Council (WSCC) nine-bus power grid using real-time digital simulator (RTDS) platform. The simulation results provide an insight into the inertial control methods under various scenarios.", "num_citations": "13\n", "authors": ["1051"]}
{"title": "Oscillation damping: A comparison of wind and photovoltaic power plant capabilities\n", "abstract": " This paper investigates the potential for wind power plants (WPPs) and photovoltaic power plants (PVPs) to damp inter-area oscillations. Inter-area oscillations may be the result of a single or a group of generators oscillating against another group of generators across a weak transmission link. If poorly damped, these power system oscillations can cause system instability and potentially lead to blackouts. Power conversion devices, particularly megawatt-scale converters that connect wind turbines and photovoltaic power plants to the grid, could be used to damp these oscillations by injecting power into the system out of phase with the potentially unstable mode. Over time, the net energy injection is near zero; therefore, providing this “static damping” capability is not expected to affect annual energy production. However, WPPs and PVPs have different capabilities due to the inherent physical nature of these plants …", "num_citations": "13\n", "authors": ["1051"]}
{"title": "Electrical power conversion of river and tidal power generator\n", "abstract": " As renewable generation has become less expensive during recent decades, and it becomes more accepted by the global population, the focus on renewable generation has expanded to include new types with promising future applications, such as river and tidal generation. Although the utilization of power electronics and electric machines in industry is phenomenal, the emphasis on system design is different for various sectors of industry. In precision control, robotics, and weaponry, the design emphasis is on accuracy and reliability with less concern for the cost of the final product. In energy generation, the cost of energy is the prime concern; thus, capital expenditures (CAPEX) and operations and maintenance expenditures (OPEX) are the major design objectives. This paper describes the electrical power conversion aspects of river and tidal generation. Although modern power converter control is available to …", "num_citations": "12\n", "authors": ["1051"]}
{"title": "Highly Accurate Method for Real-Time Active Power Reserve Estimation for Utility-Scale Photovoltaic Power Plants\n", "abstract": " This paper applies a robust technique for determining the available power from a curtailed utility-scale photovoltaic (PV) power plant. The proposed technique does not require deploying any additional equipment or sensors and is based only on the addition of new control logic to the existing power plant controller. Also, the proposed method is universally applicable to PV plants with any type of smart inverters and PV modules. Accurate determination of available power is important for using curtailed PV generation as a resource for various types of active power controls, such as spinning reserves and primary and secondary frequency control. For PV plants to be able to maintain the desired regulation range, the plant controller must be able to estimate the available aggregate peak power that all the plant's inverters can produce at any point in time and ensure that the control error stays within the tolerance band at all times. In this paper, we explore a highly accurate control method that uses dedicated inverters within the plant as reference units and evaluates the available aggregate peak power for the whole plant under different cloud variability conditions.", "num_citations": "11\n", "authors": ["1051"]}
{"title": "Multi-megawatt-scale fower-hardware-in-the-loop interface for testing ancillary grid services by converter-coupled generation\n", "abstract": " Power-hardware-in-the-loop (PHIL) is a simulation tool that can support electrical systems engineers in the development and experimental validation of novel, advanced control schemes that ensure the robustness and resiliency of electrical grids that have high penetrations of low-inertia variable renewable resources. With PHIL, the impact of the device under test on a generation or distribution system can be analyzed using a real-time simulator (RTS). PHIL allows for the interconnection of the RTS with a 7 megavolt ampere (MVA) power amplifier to test multi-megawatt renewable assets available at the National Wind Technology Center (NWTC). This paper addresses issues related to the development of a PHIL interface that allows testing hardware devices at actual scale. In particular, the novel PHIL interface algorithm and high-speed digital interface, which minimize the critical loop delay, are discussed.", "num_citations": "11\n", "authors": ["1051"]}
{"title": "Controllable grid interface for testing ancillary service controls and fault performance of utility-scale wind power generation\n", "abstract": " The rapid expansion of wind power has led many transmission system operators to demand modern wind power plants to comply with strict interconnection requirements. Such requirements involve various aspects of wind power plant operation, including fault ride-through and power quality performance as well as the provision of ancillary services to enhance grid reliability. During recent years, the National Renewable Energy Laboratory (NREL) of the US Department of Energy has developed a new, groundbreaking testing apparatus and methodology to test and demonstrate many existing and future advanced controls for wind generation (and other renewable generation technologies) on the multimegawatt scale and medium-voltage levels. This paper describes the capabilities and control features of NREL's 7-MVA power electronic grid simulator (also called a controllable grid interface, or CGI) that enables testing many active and reactive power control features of modern wind turbine generators--including inertial response, primary and secondary frequency responses, and voltage regulation--under a controlled, medium-voltage grid environment. In particular, this paper focuses on the specifics of testing the balanced and unbalanced fault ride-through characteristics of wind turbine generators under simulated strong and weak medium-voltage grid conditions. In addition, this paper provides insights on the power hardware-in-the-loop feature implemented more»", "num_citations": "11\n", "authors": ["1051"]}
{"title": "Wind-diesel hybrid systems for Russia's northern territories\n", "abstract": " This paper will summarize the DOE/Russian Ministry of Fuel and Energy (MF and E) activities in Russia's Northern Territories in the field of hybrid wind-diesel power systems over the last three years (1997-1999). The National Renewable Energy Laboratory (NREL) supplied technical assistance to the project, including resource assessment, system design, site identification, training and system monitoring. As a result, several wind-diesel systems have been installed and are operating in the Arkhangelsk/Murmansk regions and in Chukotka. NREL designed and provided sets of data acquisition equipment to monitor several of the first pilot wind-diesel systems. NREL's computer simulation models are being used for performance data analysis and optimizing of future system configurations.", "num_citations": "11\n", "authors": ["1051"]}
{"title": "Impact of frequency-watt control on the dynamics of a high DER penetration power system\n", "abstract": " Inverter-coupled generation is slowly displacing synchronous generators in the power system, resulting in reduced system inertia and primary frequency response, which makes the system susceptible to larger frequency deviations. Such deviations may result in load shedding or tripping of inverters, thus reducing the reliability. Frequency-watt control of inverters is an autonomous approach to support grid frequency at a fast timescale by adjusting the inverter output with changes in frequency. This study investigates the dynamics of a power system with a high penetration of distributed PV generation with frequency-watt droop control enabled. A simple aggregated reduced-order two-source model of the O'ahu Island (Hawaii) power system is developed and validated against a full dynamic model, and the small-signal stability of the reduced model is then examined the under various PV penetrations. The impact of …", "num_citations": "10\n", "authors": ["1051"]}
{"title": "Utilisation of real‐scale renewable energy test facility for validation of generic wind turbine and wind power plant controller models\n", "abstract": " This article presents an example of application of a modern test facility conceived for experiments regarding the integration of renewable energy in the power system. The capabilities of the test facility are used to validate dynamic simulation models of wind power plants and their controllers. The models are based on standard and generic blocks. The successful validation of events related to the control of active power (control phenomena in <10 Hz range, including frequency control and power oscillation damping) is described, demonstrating the capabilities of the test facility and drawing the track for future work and improvements.", "num_citations": "10\n", "authors": ["1051"]}
{"title": "Power generation for river and tidal generators\n", "abstract": " Renewable energy sources are the second largest contributor to global electricity production, after fossil fuels. The integration of renewable energy continued to grow in 2014 against a backdrop of increasing global energy consumption and a dramatic decline in oil prices during the second half of the year. As renewable generation has become less expensive during recent decades, and it becomes more accepted by the global population, the focus on renewable generation has expanded from primarily wind and solar to include new types with promising future applications, such as hydropower generation, including river and tidal generation. Today, hydropower is considered one of the most important renewable energy sources. In river and tidal generation, the input resource flow is slower but also steadier than it is in wind or solar generation, yet the level of water turbulent flow may vary from one place to another. This report focuses on hydrokinetic power conversion.", "num_citations": "10\n", "authors": ["1051"]}
{"title": "Impedance measurement of wind turbines using a multimegawatt grid simulator\n", "abstract": " This paper presents the impedance measurements of a 4 MW wind turbine conducted using a multimegawatt grid simulator at the National Renewable Energy Laboratory in Colorado, United States. This paper describes different systems, including a 7 MVA grid simulator, a 5 MW dynamometer, a medium-voltage measurement system, and a real-time control system used for the automated impedance measurement of a utility-scale wind turbine. Different aspects of impedance measurement are discussed, including the selection of the magnitude of injected perturbation, measurement of frequency cross-coupling between the sequence impedance responses, and the alignment of the reference frame for sequence impedance measurement. The paper also demonstrates high-fidelity validation of an EMT simulation model of the wind turbine using impedance measurements.", "num_citations": "9\n", "authors": ["1051"]}
{"title": "Hardware-in-the-loop testing of utility-scale wind turbine generators\n", "abstract": " Historically, wind turbine prototypes were tested in the field, which was--and continues to be--a slow and expensive process. As a result, wind turbine dynamometer facilities were developed to provide a more cost-effective alternative to field testing. New turbine designs were tested and the design models were validated using dynamometers to drive the turbines in a controlled environment. Over the years, both wind turbine dynamometer testing and computer technology have matured and improved, and the two are now being joined to provide hardware-in-the-loop (HIL) testing. This type of testing uses a computer to simulate the items that are missing from a dynamometer test, such as grid stiffness, voltage, frequency, rotor, and hub. Furthermore, wind input and changing electric grid conditions can now be simulated in real time. This recent advance has greatly increased the utility of dynamometer testing for the development of wind turbine systems.", "num_citations": "9\n", "authors": ["1051"]}
{"title": "The challenges of achieving a 100% renewable electricity system in the United States\n", "abstract": " Understanding the technical and economic challenges of achieving 100% renewable energy (RE) electric power systems is critical, given the increasing number of United States regional and state commitments toward this goal. Although no detailed study of a major utility of large interconnection under 100% RE system has been published, considerable literature explores the potential to greatly increase RE penetration. This literature, combined with real-world experience with increased RE deployment, points to two main challenges associated with achieving 100% RE across all timescales: (1) economically maintaining a balance of supply and demand and (2) designing technically reliable grids using largely inverter-based resources. The first challenge results in a highly nonlinear increase in costs as the system approaches 100% RE, in large part because of seasonal mismatches. The second challenge might …", "num_citations": "8\n", "authors": ["1051"]}
{"title": "Data-driven optimal control strategy for virtual synchronous generator via deep reinforcement learning approach\n", "abstract": " This paper aims at developing a data-driven optimal control strategy for virtual synchronous generator (VSG) in the scenario where no expert knowledge or requirement for system model is available. Firstly, the optimal and adaptive control problem for VSG is transformed into a reinforcement learning task. Specifically, the control variables, i.e., virtual inertia and damping factor, are defined as the actions. Meanwhile, the active power output, angular frequency and its derivative are considered as the observations. Moreover, the reward mechanism is designed based on three preset characteristic functions to quantify the control targets: (1) maintaining the deviation of angular frequency within special limits; (2) preserving well-damped oscillations for both the angular frequency and active power output; (3) obtaining slow frequency drop in the transient process. Next, to maximize the cumulative rewards, a decentralized …", "num_citations": "8\n", "authors": ["1051"]}
{"title": "Electro-mechanical Modeling of Wind Turbine and Energy Storage Systems with Enhanced Inertial Response\n", "abstract": " In this paper, a coordinated control scheme for wind turbine generator (WTG) and supercapacitor energy storage system (ESS) is proposed for temporary frequency supports. Inertial control is designed by using generator torque limit considering the security of WTG system, while ESS releases its energy to compensate the sudden active power deficit during the recovery process of turbine rotor. WTG is modeled using the fatigue, aerodynamic, structure, turbulence (FAST) code, which identifies the mechanical loadings of the turbine and addresses electro-mechanical interactions in the wind energy system. A damping controller is augmented to the inertial control to suppress severe mechanical oscillations in the shaft and tower of the turbine during frequency supports. Furthermore, the result of small-signal stability analysis shows that the WTG-ESS tends to improve the stability of the whole multi-energy power grid …", "num_citations": "8\n", "authors": ["1051"]}
{"title": "Impedance-based prediction of SSR-generated harmonics in doubly-fed induction generators\n", "abstract": " Doubly-fed induction generators (DFIGs) are prone to subsynchronous resonance (SSR) with series-compensated transmission lines and experiencing SSR-generated harmonics of wide-ranging magnitudes. This paper presents a large-signal impedance-based approach for the prediction of the magnitude of SSR-generated harmonics in DFIGs. Note that the large-signal impedance of a network shows variation in its impedance response with the magnitude of perturbation at its terminals. It is discovered in this paper that the impedance of a series-compen- sated transmission line starts changing with the magnitude of SSR because of the metal-oxide varistor-based protection of series capacitors in the line. The changing line impedance halts the growth of the SSR beyond a certain point, where the DFIG forms a limit-cycle mode and emits harmonics at the SSR frequency. The discovered role of the protection of …", "num_citations": "8\n", "authors": ["1051"]}
{"title": "Large-signal impedance modeling of three-phase voltage source converters\n", "abstract": " Resonance problems have become a major hurdle in the large-scale grid integration of renewable energy. It is important to be able to predict the amplitude of resonance-induced distortions for the protection and control design of power electronic converters. We recently presented an impedance-based approach for the prediction of resonance amplitude. It was shown that the impedance response of a converter starts changing with the amplitude of resonance; this blocks the amplitude growth beyond a certain point where the converter forms a limit cycle mode of sustained oscillations. The large-signal impedance of a converter captures the change in its impedance response with the resonance amplitude, and it can be used to predict the resonance amplitude under different operation conditions. This paper presents large-signal sequence impedance modeling for three-phase voltage source converters (VSC) with dq …", "num_citations": "8\n", "authors": ["1051"]}
{"title": "Development of dynamic model of a ternary pumped storage hydropower plant\n", "abstract": " Hydropower is the largest source of renewable energy in the United States. Pumped storage hydropower (PSH) is a hydropower plant that can generate power when it operates as a hydro turbine, and it can absorb power from the electric grid when it is pumping water from the lower reservoir to the upper reservoir. The conventional role of PSH is as an energy arbitrage: it sells power when the price of electricity is high (i.e., during peak hours of energy demand), and it is operated as a pump during times when the price of electricity is low (e.g., midnight to dawn). PSH is an important part in hydropower generation. Currently, the total installed capacity is approximately 22 GW. Recently, a new type of PSH was developed, called ternary PSH (T-PSH). T-PSH is a type of advanced PSH that is different from conventional PSH and adjusted-speed PSH. T-PSH uses a single generator rotating in one direction with two …", "num_citations": "8\n", "authors": ["1051"]}
{"title": "Opportunities for Research and Development of Hybrid Power Plants\n", "abstract": " Hybrid power plants show promise to provide significant value to the electric grid system especially as shares of renewable energy in systems increase from 10% to 20% or more. Many manufacturers and developers are proactively developing hybrid power plant strategies to ensure plant profitability in markets where it’s important to provide energy that is more predictable and controllable, with higher capacity values, as well as various ancillary services to the grid system. However, there still are many questions around if and when hybrid power plants make sense versus leaving it to the larger grid system to ensure low cost and reliable supply by engaging directly with all individual assets. This report summarizes literature on the state-of-the-art in research concerning hybrid power plants from multiple perspectives including: 1) resource and market opportunities, 2) technology selection and sizing, 3) physical design, and 4) operation and control. The emphasis was placed on wind and solar hybrid power plants (with or without storage) but additional technologies were briefly considered and merit further investigation.", "num_citations": "7\n", "authors": ["1051"]}
{"title": "Grid-Friendly Renewable Energy: Solar and Wind Participation in Automatic Generation Control Systems\n", "abstract": " This paper focuses on emerging technological and regulatory considerations of using solar and wind generators to provide essential reliability services through participation in area-wide automatic generation control (AGC) systems. AGC systems enable a grid operator to centrally and automatically manage the output of interconnected generators, storage devices, and controllable loads to maintain reliable and safe system operations. The paper highlights recent experiences of solar and wind on AGC, as well as recent developments that may enable VRE to participate in AGC in the near future.", "num_citations": "7\n", "authors": ["1051"]}
{"title": "Validating performance models for hybrid power plant control assessment\n", "abstract": " The need for simple, but accurate performance models of wind turbine generators (WTGs), photovoltaic (PV) plants, and battery energy storage systems (BESS) for various hybrid power plant (HPP) studies motivates the present work. Particularly, the development and verification stage of HPP controls requires reduced-order models to minimize the complexity and computation effort of simulation platforms. In this paper, such models are proposed, and the most essential parts of the models are validated through field measurements. The models target power system integration studies involving active and reactive power, as well as frequency and voltage regulation where detailed models, as proposed in the standards, can be cumbersome. Field measurements of two Vestas WTGs, one 1-MW PV plant, and one 1-MW/1-MWh BESS are used for model validation. The results show that the WTG and PV performance models correctly estimate the power generation variability according to fluctuations in wind speed and solar irradiance. The BESS performance model provides satisfactory results related to grid-forming control performance and estimation of state-of-charge. The presented validation work enables using the proposed performance models for power system studies and HPP control design in all model-based design stages, that is, preliminary analysis, design, verification, and validation with a high level of confidence. View Full-Text", "num_citations": "7\n", "authors": ["1051"]}
{"title": "Evaluation of the inertial response of variable-speed wind turbines using advanced simulation\n", "abstract": " In this paper, we focus on the temporary frequency support effect provided by wind turbine generators (WTGs) through the inertial response. With the implemented inertial control methods, the WTG is capable of increasing its active power output by releasing parts of the stored kinetic energy when the frequency excursion occurs. The active power can be boosted temporarily above the maximum power points, but the rotor speed deceleration follows and an active power output deficiency occurs during the restoration of rotor kinetic energy. We evaluate and compare the inertial response induced by two distinct inertial control methods using advanced simulation. In the first stage, the proposed inertial control methods are analyzed in offline simulation. Using an advanced wind turbine simulation program, FAST with TurbSim, the response of the researched wind turbine is comprehensively evaluated under turbulent wind …", "num_citations": "7\n", "authors": ["1051"]}
{"title": "Investigating power system primary and secondary reserve interaction under high wind power penetration using frequency response model\n", "abstract": " Power system frequency needs to be maintained close to its nominal value at all times to avoid machine damage, under-frequency load-shedding and even blackouts. Adequate primary frequency response and secondary frequency response are the primary forces to correct an energy imbalance at the second to minute level. As wind energy becomes a larger portion of the world’s energy portfolio, there are greater oppotunities for wind to provide frequency response services. This paper addresses one area of frequency control that has been missing in previous work–the reliabilty impacts and interactions between primary and secondary frequency control. The lack of a commercially available tools to simulate the interaction of these two responses has limited the energy industry’s understanding of when the depletion of primary control reserve will impact the performance of secondary conrol response or vice versa. To investigate this issue, in this paper we develop a multi-area frequency response integration model with combined primary and secondary frequency control capabilities.", "num_citations": "7\n", "authors": ["1051"]}
{"title": "Modeling ternary pumped storage units\n", "abstract": " This report is one of several reports developed during the US Department of Energy (DOE) study on the Modeling and Analysis of Value of Advanced Pumped Storage Hydropower in the United States. The study is led by Argonne National Laboratory in collaboration with Siemens PTI, Energy Exemplar, MWH Americas, and the National Renewable Energy Laboratory. Funding for the study was provided by DOE’s Office of Energy Efficiency and Renewable Energy (EERE) through a program managed by the EERE’s Wind and Water Power Technologies Office (WWPTO).The scope of work for the study has two main components:(1) development of vendorneutral dynamic simulation models for advanced pumped storage hydro (PSH) technologies and (2) production cost and revenue analyses to assess the value of PSH in the power system. Throughout the study, the project team was supported and guided by an Advisory Working Group (AWG) consisting of more than 30 experts from a diverse group of organizations including the hydropower industry and equipment manufacturers, electric power utilities and regional electricity market operators, hydro engineering and consulting companies, national laboratories, universities and research institutions, hydropower industry associations, and government and regulatory agencies.", "num_citations": "7\n", "authors": ["1051"]}
{"title": "Testing dynamic simulation models for different types of advanced pumped storage hydro units\n", "abstract": " This report is one of several reports developed during the US Department of Energy (DOE) study on the Modeling and Analysis of Value of Advanced Pumped Storage Hydropower in the United States. The study was led by Argonne National Laboratory in collaboration with Siemens PTI, Energy Exemplar, MWH Americas, and the National Renewable Energy Laboratory. Funding for the study was provided by DOE’s Office of Energy Efficiency and Renewable Energy (EERE) through a program managed by the EERE’s Wind and Water Power Technologies Office (WWPTO).The scope of work for the study has two main components:(1) development of vendorneutral dynamic simulation models for advanced pumped storage hydro (PSH) technologies, and (2) production cost and revenue analyses to assess the value of PSH in the power system. Throughout the study, the project team was supported and guided by an Advisory Working Group (AWG) consisting of more than thirty experts from a diverse group of organizations including the hydropower industry and equipment manufacturers, electric power utilities and regional electricity market operators, hydro engineering and consulting companies, national laboratories, universities and research institutions, hydropower industry associations, and government and regulatory agencies.", "num_citations": "7\n", "authors": ["1051"]}
{"title": "Integrating renewable energy into the transmission and distribution system of the us virgin islands\n", "abstract": " This report focuses on the economic and technical feasibility of integrating renewable energy technologies into the U.S. Virgin Islands transmission and distribution systems. The report includes three main areas of analysis: 1) the economics of deploying utility-scale renewable energy technologies on St. Thomas/St. John and St. Croix; 2) potential sites for installing roof- and ground-mount PVsystems and wind turbines and the impact renewable generation will have on the electrical subtransmission and distribution infrastructure, and 3) the feasibility of a 100- to 200-megawatt power interconnection of the Puerto Rico Electric Power Authority (PREPA), Virgin Islands Water and Power Authority (WAPA), and British Virgin Islands (BVI) grids via a submarine cable system.", "num_citations": "7\n", "authors": ["1051"]}
{"title": "Blackstart of power grids with inverter-based resources\n", "abstract": " This paper presents the findings of our investigation into inverter-based resource-(IBR-) driven blackstart of electric grids. Four potential black-start configurations with different setups are presented. To evaluate the technical feasibility of IBR-driven black start in the four configurations, a behavioral model of inverters that mimics current-limited inverter operation is developed using variable resistors in the MATLAB Simulink/Simscape environment. The inverter model is connected to an induction motor through transformers and a transmission line to simulate its startup. Simulation results show that even with the limited current supply capability of inverters because of their physical constraints, IBRs can black-start a motor under certain conditions. Results also show that by using soft-start techniques, such as ramped supply voltage, inrush currents can be reduced, thereby expanding the conditions under which IBRs can …", "num_citations": "6\n", "authors": ["1051"]}
{"title": "Impedance characterization of utility-scale renewable energy and storage systems\n", "abstract": " This paper presents the impedance characterization of utility-scale wind turbines and PV/storage inverters using a multimegawatt grid simulator-based grid integration testbed. The paper describes the testbed components including a 7 MVA grid simulator, 5 MW dynamometer, medium-voltage measurement system, and a real-time control system used for automated impedance characterization of wind turbines and inverters. Different aspects of impedance measurement are discussed, including the selection of the magnitude and type of perturbation, measurement of frequency cross-coupling between sequence impedance responses, and the alignment of the reference frame for sequence impedance measurement. The paper also demonstrates high-fidelity validation of EMT simulation models from turbine manufacturers and characterization of grid-forming inverters using impedance measurements.", "num_citations": "6\n", "authors": ["1051"]}
{"title": "Distributed real-time simulation and its applications to wind energy research\n", "abstract": " This paper presents a novel approach - distributed Real-Time Simulations (RTS) - for innovative wind energy and grid integration research. Distributed RTS is performed with Digital Real-Time Simulators (DRTS) in different geographical locations and connected over the Internet. Geographically distributed RTS supports - higher computation capability for RTS, leveraging distributed assets, novel testing techniques and hybridized smart grid testbeds. This paper discusses some of the basic aspects of distributed RTS with the communication delay as a probabilistic variable. To leverage hardware resources and enable flexible collaboration of national laboratories, the distributed RTS connection between the simulators at Idaho National Laboratory (INL) and National Wind Test Center (NWTC) at National Renewable Energy Laboratory (NREL) is established. The main objective of this distributed lab setup is to perform …", "num_citations": "6\n", "authors": ["1051"]}
{"title": "Flywheel Energy Storage-Dynamic Modeling\n", "abstract": " A flywheel energy storage systems (FESS) is suitable for high-power, low-energy content to deliver or absorb power in surges. This type of application is very suitable for frequency regulation in an electric grid. In addition, a modern FESS is built as a high-efficiency, high-speed motor/generator drive system that employs modern power electronics, therefore, the power quality of the grid-connected output is excellent. In addition, a FESS is very valuable to delivering ancillary services to the grid, and it can contribute reactive power compensation. Thus, a FESS can maintain high reliability in power systems by providing ride-through capability to the power system area while the rest of the generating fleet, which has a slower response in the power system, performs primary and secondary frequency response to the grid. A FESS has several advantages compared to a chemical-based energy storage (CBES) system …", "num_citations": "6\n", "authors": ["1051"]}
{"title": "Energy storage opportunities and capabilities of a type 3 wind turbine generator\n", "abstract": " Wind power plants and other renewable power plants with power electronic interfaces are capable of delivering frequency response (both governor and/or inertial response) to the grid by a control action; thus, the reduction of available online inertia as conventional power plants are retired can be compensated by designing renewable power plant controls to include frequency response. The source of energy to be delivered as inertial response is determined by the type of generation and control strategy chosen. The cost of energy storage drops over time, and global research activities on energy storage are very active, funded both by the private industry and governments. Different industry sectors (e.g., transportation, energy) are the major drivers of the recent storage research and development. This work investigates the opportunities and capabilities of deploying energy storage in renewable power plants. In …", "num_citations": "6\n", "authors": ["1051"]}
{"title": "Renewable Energy and Inter-island Power Transmission\n", "abstract": " Renewable Energy and Inter-island Power Transmission Page 1 Renewable Energy and Inter-island Power Transmission Vahan Gevorgian National Renewable Energy Laboratory CIEMADeS IV International Conference Univ. of Turabo Gurabo PuertoRico Gurabo, Puerto Rico May 06, 2011 NREL is a national laboratory of the US Department of Energy, Office of Energy Efficiency and Renewable Energy, operated by the Alliance for Sustainable Energy, LLC. NREL/PR-5500-51819 Composite photo created by NREL Page 2 NREL’s Role in Variable Renewable Energy Integration • Integration studies and operational impacts; • Wind/solar plant modeling and interconnection; p g ; • Transmission planning and analysis; • Resource assessment and forecasting. Energy Development for Island Nations (EDIN) • US Virgin Islands (reduce dependency on fossil fuel by 60% by 2025). • Iceland and Dominica collaboration. • …", "num_citations": "6\n", "authors": ["1051"]}
{"title": "Development and testing of commercial prototype wind-electric battery charging station\n", "abstract": " The technical aspects of charging 12-volt (V) batteries with a small permanent magnet wind-turbine generator suggested that a special battery-charging station be developed. Scientists at the National Renewable Energy Laboratory (NREL) conducted research on several possible configurations of wind-electric battery-charging stations. Based on preliminary modeling and test results, the optimal system for this application was the one with individual charge controllers. This paper presents the development efforts and test results of a commercial prototype wind-electric battery-charging station designed and manufactured by Ascension Technology, a Division of Applied Power Corporation (APC). The system, which is powered by a 3-kilowatt (kW) wind turbine, was tested at the National Wind Technology Center (NWTC). The paper discusses control strategies to improve system performance, and includes recommendations for system integrators based on the testing experience accumulated at the NWTC.", "num_citations": "6\n", "authors": ["1051"]}
{"title": "Impedance Methods for Analyzing Stability Impacts of Inverter-Based Resources: Stability Analysis Tools for Modern Power Systems\n", "abstract": " Power systems around the world are undergoing a major transformation because of the increasing shares of renewable energy, growing deployment of energy storage systems, proliferation of distributed energy resources, electrification of other sectors, and so on. In the United States, wind and solar provided almost 10% of electricity in 2019. The U.S. Energy Information Administration, in its 2020 Annual Energy Outlook, forecasted that the share of electricity from renewables will reach 38% by 2050, of which more than 80% will come from wind and solar. Wind and solar, along with battery energy storage systems, interface with the grid using power electronic inverters; hence, they are collectively referred to as inverter-based resources (IBRs). The increasing annual share of electricity from IBRs in a power system means that during more times of the year, the system will operate at a much higher concentration of IBRs …", "num_citations": "5\n", "authors": ["1051"]}
{"title": "Impedance-based characterization of power system frequency response\n", "abstract": " This paper presents an impedance-based noninvasive method for the characterization of power system frequency response in real time in the absence of a transient event. The proposed method measures transfer function from the injected active power to the frequency at the point of interconnection for the estimation of system inertia, primary frequency response, and the speed of the primary frequency control of the system. The so-called frequency response transfer function FR(s) is measured by injecting perturbations in the active power output of a battery energy storage system. The measured response of FR(s) can also predict the frequency nadir and ROCOF following a transient event. The relationship between FR(s) and the system impedance response as seen from the point of interconnection is also derived in this paper; it can be used for the control design of frequency support services by inverter-coupled …", "num_citations": "5\n", "authors": ["1051"]}
{"title": "Interconnection Requirements for Renewable Generation and Energy Storage in Island Systems: Puerto Rico Example\n", "abstract": " On September 20, 2017, Hurricane Maria made landfall in Puerto Rico, incapacitating the central power system and leaving the entire island without power. To ensure the long-term recovery of Puerto Rico's electric power grid in the most secure and resilient way, the US Department of Energy funded research to develop recommendations for a cohesive new framework of interconnection standards for utility-scale renewable electrical generation and energy storage that ensure cross-technology compatibility and enable high deployment levels without compromising grid reliably, safety, or security. This paper provides a summary of work conducted by the National Renewable Energy Laboratory to analyze and address many shortcomings and areas of improvement to help the Puerto Rico Electric Power Authority (PREPA) establish minimum technical requirements for interconnecting single-technology and hybrid renewable generation because of their importance for PREPA system security and impacts on future integrated resource planning scenarios. Results and findings presented in this paper are important for any island power system.", "num_citations": "5\n", "authors": ["1051"]}
{"title": "Demonstration of active power controls by utility-scale PV power plant in an island grid\n", "abstract": " The National Renewable Energy Laboratory (NREL), AES, and the Puerto Rico Electric Power Authority conducted a demonstration project on a utility-scale photovoltaic (PV) plant to test the viability of providing important ancillary services from this facility. As solar generation increases globally, there is a need for innovation and increased operational flexibility. A typical PV power plant consists of multiple power electronic inverters and can contribute to grid stability and reliability through sophisticated'grid-friendly'controls. In this way, it may mitigate the impact of its variability on the grid and contribute to important system requirements more like traditional generators. In 2015, testing was completed on a 20-MW AES plant in Puerto Rico, and a large amount of test data was produced and analyzed that demonstrates the ability of PV power plants to provide various types of new grid-friendly controls. This data showed how active power controls can leverage PV's value from being simply an intermittent energy resource to providing additional ancillary services for an isolated island grid. Specifically, the tests conducted included PV plant participation in automatic generation control, provision of droop response, and fast frequency response.", "num_citations": "5\n", "authors": ["1051"]}
{"title": "Test cases for wind power plant dynamic models on real-time digital simulator\n", "abstract": " The objective of this paper is to present test cases for wind turbine generator and wind power plant models commonly used during commissioning of wind power plants to ensure grid integration compatibility. In this paper, different types of wind power plant models based on the Western Electricity Coordinating Council Wind Generator Modeling Group's standardization efforts are implemented on a real-time digital simulator, and different test cases are used to gauge their grid integration capability. The low-voltage ride through and reactive power support capability and limitations of wind turbine generators under different grid conditions are explored. Several types of transient events (e.g., symmetrical and unsymmetrical faults, frequency dips) are included in the test cases. The differences in responses from different types of wind turbine are discussed in detail.", "num_citations": "5\n", "authors": ["1051"]}
{"title": "Wind-electric ice making investigation\n", "abstract": " The village power group at the National Renewable Energy Laboratory (NREL) has been researching the most practical and cost-effective means for producing ice from off-grid wind-electric power systems since 1993. The first phase of the project demonstrated that commercial vapor-compression ice makers could operate effectively when powered by a variable speed permanent magnet wind generator. In the second phase of the project, steady-state and dynamic numerical models of these systems were developed and experimentally validated. The third phase of the project was thorough steady-state and dynamic testing of a commercial 1.1 ton ice maker unit powered by a commercial 12 kW wind turbine alternator on an NREL dynamometer test stand. With the data from phases 1--3 an economic feasibility analysis was performed. It is hoped that continued development, and eventually commercialization, of this concept will take place in the private sector in the form of small business partnerships.", "num_citations": "5\n", "authors": ["1051"]}
{"title": "Island power systems with high levels of inverter-based resources: Stability and reliability challenges\n", "abstract": " As many island power systems seek to integrate high levels of renewable energy, they face new challenges on top of the existing difficulties of operating an isolated grid. With their drastically declining cost, variable renewables, such as wind and photovoltaics (PVs), are increasingly being integrated into island grids to reduce the use of imported fuels. These deployments of renewable energy are dominated by PV and wind generators, which bring unique challenges of their own. While the integration issues span numerous timescales (from microseconds to many months), this article focuses on reliability and stability challenges on short timescales (microseconds to seconds). In other words, we seek to answer (to the extent that it is currently known) how to ensure the frequency and voltage stability in an island power system with very high instantaneous levels of wind and PVs. And because island power systems are …", "num_citations": "4\n", "authors": ["1051"]}
{"title": "Enhancing the flexibility of generation of run-of-the-river hydro power plants\n", "abstract": " Run-of-the-River Hydro Power Plants (ROR HPPs) output can be characterized as fixed and predictable output with low cost of both installation and operation. ROR HPP generation is proportional to the water flow and cannot be adjusted to provide inertia to the grid, which is critical to power systems stability. Hence ROR HPP can only participate in low profit energy markets and not in the high profit ancillary service market. With the advances in energy storage, they can help build a synthetic energy reservoir. The combined operation of ROR HPPs and energy storage are capable of both ramping and variable power output, allowing participation in the ancillary service markets. However, energy storage technologies such as supercapacitors and flywheels, which are power dense can quickly charge/discharge within a short duration. Energy dense storage technologies such as batteries can provide long duration energy injection while the maximum ramping rate is much lower than power dense energy storage. In order to provide long duration fast ramping capability, Hybrid Energy Storage Systems (HESSs) including both power and energy dense energy storage are proposed to be integrated to enable the flexible operation of ROR HPP. Power dense energy storage with quick burst of energy can assist more»", "num_citations": "4\n", "authors": ["1051"]}
{"title": "Wind generation participation in power system frequency response\n", "abstract": " The electrical frequency of an interconnected power system must be maintained close its nominal level at all times. Excessive under-and overfrequency excursions can lead to load shedding, instability, machine damage, and even blackouts. There is a rising concern in the electric power industry in recent years about the declining amount of inertia and primary frequency response (PFR) in many interconnections. This decline may continue due to increasing penetrations of inverter-coupled generation and the planned retirements of conventional thermal plants. Inverter-coupled variable wind generation is capable of contributing to PFR and inertia with a response that is different from that of conventional generation. It is not yet entirely understood how such a response will affect the system at different wind power penetration levels. The modeling work presented in this paper evaluates the impact of wind generation's provision of these active power control strategies on a large, synchronous interconnection. All simulations were conducted on the US Western Interconnection with different levels of instantaneous wind power penetrations (up to 80%). The ability of wind power plants to provide PFR-and a combination of synthetic inertial response and PFR-significantly improved the frequency response performance of the system.", "num_citations": "4\n", "authors": ["1051"]}
{"title": "Investigating power system primary and secondary reserve interaction under high wind power penetration\n", "abstract": " Power system frequency needs to be maintained close to its nominal value at all times to successfully balance load and generation and maintain system reliability. Adequate primary frequency response and secondary frequency response are the primary forces to correct an energy imbalance at the second-to-minute level. As wind energy becomes a larger portion of the world's energy portfolio, there is an increased need for wind to provide frequency response. This paper addresses one of the major concerns about using wind for frequency regulation: the unknown factor of the interaction between primary and secondary reserves. The lack of a commercially available tool to model this has limited the energy industry's understanding of when the depletion of primary reserves will impact the performance of secondary response or vice versa. This paper investigates the issue by developing a multi-area frequency response integration tool with combined primary and secondary capabilities. The simulation is conducted in close coordination with economical energy scheduling scenarios to ensure credible simulation results.", "num_citations": "4\n", "authors": ["1051"]}
{"title": "Assessment of system frequency support effect of PMSG-WTG using torque-limit-based inertial control\n", "abstract": " To release the “hidden inertia” of variable-speed wind turbines for temporary frequency support, a method of torque-limit based inertial control is proposed in this paper. This method aims to improve the frequency support capability considering the maximum torque restriction of a permanent magnet synchronous generator. The advantages of the proposed method are improved frequency nadir (FN) in the event of an under-frequency disturbance; and avoidance of over-deceleration and a second frequency dip during the inertial response. The system frequency response is different, with different slope values in the power-speed plane when the inertial response is performed. The proposed method is evaluated in a modified three-machine, nine-bus system. The simulation results show that there is a trade-off between the recovery time and FN, such that a gradual slope tends to improve the FN and restrict the rate of …", "num_citations": "4\n", "authors": ["1051"]}
{"title": "Sizing SiC storage inverters for fast grid frequency support\n", "abstract": " As wind and solar displace synchronous generators whose inertia stabilizes the AC grid frequency on fast time scales, it has been proposed to use energy storage systems (ESSs) to mitigate frequency transient events. Such events require a rapid surge of power from the ESS, but they occur only rarely. The high temperature tolerance of SiC MOSFETs and diodes presents an opportunity for innovative ESS inverter designs. Herein we investigate a SiC ESS inverter design such that the SiC device ratings are obeyed during mild frequency events but are exceeded during rare, major events, for a potentially more economical inverter design. In support of this proposal we present: 1. An analysis of four years of grid frequency events in the U.S. Western Interconnection. 2. A switch-level ESS inverter simulation using SiC devices with detailed loss estimates. 3. Thermal analysis of the SiC power modules during a worst …", "num_citations": "4\n", "authors": ["1051"]}
{"title": "Characterization of a power electronic grid simulator for wind turbine generator compliance testing\n", "abstract": " This paper presents the commissioning results and testing capabilities of a multi-megawatt power electronic grid simulator situated in National Renewable Energy Laboratory’s (NREL’s) new testing facility. The commissioning is done using a commercial type 4 multi-megawatt sized wind turbine generator (WTG) installed in NREL’s new 5 MW dynamometer and a kilowatt sized type 1 WTG connected to the existing 2.5 MW dynamometer at NREL.", "num_citations": "4\n", "authors": ["1051"]}
{"title": "Impacts of providing inertial response on dynamic loads of wind turbine drivetrains\n", "abstract": " There has been a growing demand from the power industry for wind power plants to support the power system operation. One of such requirement is for wind turbine to provide ancillary service in the form of inertial response. Such service requires wind turbine generators (WTGs) to inject additional energy to the grid when the grid frequency drops to help arrest the frequency decline. Inertial response will understandably impose additional dynamic loads on the wind turbine drivetrain, which have not been given much attention so far. To bridge this gap, this paper utilizes holistic models of both fixed-speed and variable-speed WTGs that integrate the aero-elastic wind turbine model in FAST, developed by the National Renewable Energy Laboratory, with a detailed electro-mechanical drivetrain model developed in SimDriveline and SimPowerSystems. These models allow quantification of drivetrain loads at the gear …", "num_citations": "4\n", "authors": ["1051"]}
{"title": "Impedance analysis and phil Demonstration of reactive power oscillations in a wind power plant using a 4-mw wind turbine\n", "abstract": " This paper presents impedance-based analysis, mitigation, and power-hardware-in-the-loop (PHIL) demonstration of reactive power oscillations in a wind power plant using a 4-MW Type III wind turbine. Because such oscillations result from interactions among slower control loops of wind turbines regulating the phasor quantities—such as active power, reactive power, and the magnitude of voltages at the point of interconnection (POI)—we propose a new type of admittance called power-domain admittance for the analysis. The power-domain admittance of a wind turbine gives the transfer function from the frequency and magnitude of the voltages at the POI to the active and reactive power outputs of the turbine. The power-domain admittance responses of the 4-MW wind turbine are measured using a 13.8-kV/7-MVA grid simulator to identify the source of the reactive power oscillations. The power-domain impedance analysis and PHIL experiments are performed to explain how a resonant mode inside the wind turbine manifests as turbine-to-turbine and plant-to-grid reactive power oscillations. It is discovered that higher grid impedance during weak grid conditions improves damping of reactive power oscillations between a wind power plant and the grid; however, a higher grid impedance also increases coupling among wind turbines and the risk of turbine-to-turbine reactive power oscillations. The efficacy of a simple droop-based solution in mitigating reactive power oscillations is demonstrated using power-domain impedance measurements and PHIL experiments. The paper presents power-domain impedance measurement as a powerful tool for …", "num_citations": "3\n", "authors": ["1051"]}
{"title": "Wgrid-49 GMLC project report: Understanding the role of short-term energy storage and large motor loads for active power controls by wind power\n", "abstract": " This project validates advanced controls for active power from wind generation, short-term energy storage, and large industrial motor drives for various types of ancillary grid services. It also evaluates wind turbine loading impacts such as drivetrain loads. The National Renewable Energy Laboratory (NREL), in collaboration with the Electric Power Research Institute (EPRI) and the University of Colorado, demonstrated active power controls (APC) by wind power during a 2013-2016 DOE research project [1]. This 3-year project (FY 2016-2018) was aimed at conducting a full-scale demonstration of advanced coordinated grid controls by utilizing the existing DOE assets at NREL in collaboration with Idaho National Laboratory (INL), Clemson University, and GE. This project addressed DOE goals in the area of Devices and Integrated Systems within the GMLC Foundational Topics 1-4, specifically by demonstrating how wind power can be tied to other technologies (energy storage and responsive regenerative loads in this case) for enhanced services and optimized wind O&M costs. This work utilized the $30 million, multiyear DOE investments and unique characteristics of NREL's existing NWTC grid-integration site, including a combination of multi-MW utility-scale wind turbine generators, 1-MW/1-MWh battery energy storage system (BESS), industrial variable-frequency motor drives (VFD), 1-MW solar PV array, and 7-MVA more»", "num_citations": "3\n", "authors": ["1051"]}
{"title": "Equivalent Test Bed in PSCAD and PSLF for Studying Advanced Power Systems Controller Performance\n", "abstract": " With increasing popularity of sustainable energy resources, research on power electronic-based renewable generation modeling is gaining impetus to enhance reliability of electric grids with high penetrations of renewable energy. A set of generic and public models for renewable energy are available in commercial positive sequence power system simulation software. However, advanced controller models applicable for renewable resources are typically not included in these tools. To ensure the integrity of the newly developed controller models for renewables in positive sequence simulators for large power systems, it is necessary to validate the dynamic performance of the proposed model with detailed electromagnetic models. This paper creates an equivalent test bed in PSCAD and PSLF for validating the performance of advanced controllers associated with renewable energy sources. To demonstrate the …", "num_citations": "3\n", "authors": ["1051"]}
{"title": "2017 offshore wind technologies market update\n", "abstract": " The 2017 Offshore Wind Technologies Market Update was developed by NREL for DOE's Office of Energy Efficiency and Renewable Energy, Wind Energy Technologies Office. This update complements the biennial Offshore Wind Technologies Market Report (Musial et al. 2017), which includes a more detailed discussion of the key trends and statistics included in this update. This work provides decision-makers, regulators, developers, financiers, and supply chain participants with quantitative information about the offshore wind market, technology, and cost status worldwide and in the United States.", "num_citations": "3\n", "authors": ["1051"]}
{"title": "Phase 1 integrated systems test and characterization report for the 5-Megawatt dynamometer and controllable grid interface\n", "abstract": " This report details the commissioning of the 5-MW dynamometer and Controllable Grid Interface (CGI) at the National Wind Technology Center (NWTC) at the National Renewable Energy Laboratory (NREL). The purpose of these characterization tests was to verify the dynamometers performance over the widest possible range of operating conditions, verify interconnection with and fault generation capability of the CGI, gain insight into system-level behavior, and establish confidence in measurement data.", "num_citations": "3\n", "authors": ["1051"]}
{"title": "Short-term forecasting of inertial response from a wind power plant\n", "abstract": " The total inertia stored in all rotating masses (synchronous generators, induction motors, etc.) connected to a power system grid is an essential force that keeps the system stable after disturbances. Power systems have been experiencing reduced inertia during the past few decades. This trend will continue as the level of renewable generation (e.g., wind and solar) increases. Wind power plants (WPPs) and other renewable power plants with power electronic interfaces are capable of delivering frequency response (both droop and/or inertial response) by a control action; thus, the reduction in available online inertia can be compensated by designing the plant control to include frequency response. The source of energy to be delivered as inertial response is determined by the type of generation (wind, photovoltaic, concentrating solar power, etc.) and the control strategy chosen. The importance of providing ancillary …", "num_citations": "3\n", "authors": ["1051"]}
{"title": "NREL Controllable Grid Interface for Testing of Renewable Energy Technologies\n", "abstract": " This presentation provides a high-level overview of NREL's multi-megawatt testing facilities and capabilities for the grid integration of renewable technologies.", "num_citations": "3\n", "authors": ["1051"]}
{"title": "Market designs for the primary frequency response ancillary service\n", "abstract": " Summary form only given. The first part of this two-paper series discusses the motivation of implementing a primary frequency response (PFR) market in restructured pool-based power markets, as well as the market design that would create the right incentives to provide the response reliably. PFR is the immediate, autonomous response of generation and demand to system frequency deviations. It is the critical response required to avoid triggering under- and over-frequency relays or instability that could lead to machine damage, load-shedding, and in the extreme case, blackouts. Currently, in many restructured power systems throughout the world, ancillary services markets have been developed to incent technologies to provide the services to support power system reliability. However, few ancillary services markets include a market explicitly incentivizing the provision of PFR. Historically, PFR was an inherent …", "num_citations": "3\n", "authors": ["1051"]}
{"title": "Wind power opportunities in St. Thomas, USVI: a site-specific evaluation and analysis\n", "abstract": " This NREL technical report utilizes a development framework originated by NREL and known by the acronym SROPTTC to assist the US Virgin Islands in identifying and understanding concrete opportunities for wind power development in the territory. The report covers each of the seven components of the SROPTTC framework: Site, Resource, Off-take, Permitting, Technology, Team, and Capital as theyapply to wind power in the USVI and specifically to a site in Bovoni, St. Thomas. The report concludes that Bovoni peninsula is a strong candidate for utility-scale wind generation in the territory. It represents a reasonable compromise in terms of wind resource, distance from residences, and developable terrain. Hurricane risk and variable terrain on the peninsula and on potential equipmenttransport routes add technical and logistical challenges but do not appear to represent insurmountable barriers. In addition, integration of wind power into the St. Thomas power system will present operational challenges, but based on experience in other islanded power systems, there are reasonable solutions for addressing these challenges.", "num_citations": "3\n", "authors": ["1051"]}
{"title": "Wind turbine generator system power quality test report for the Gaia wind 11-kW wind turbine\n", "abstract": " This report details the power quality test on the Gaia Wind 11-kW Wind Turbine as part of the US Department of Energy's Independent Testing Project. In total five turbines are being tested as part of the project. Power quality testing is one of up to five test that may be performed on the turbines including power performance, safety and function, noise, and duration tests. The results of thetesting provide manufacturers with reports that may be used for small wind turbine certification.", "num_citations": "3\n", "authors": ["1051"]}
{"title": "Sequence impedance measurement of utility-scale wind turbines and inverters reference frame, frequency coupling, and MIMO/SISO forms\n", "abstract": " Sequence impedance responses are increasingly used for the stability analysis of converter-grid systems; however, many aspects of the sequence impedance measurement process, particularly those resulting from the frequency coupling between the positive- and negative-sequence impedances, are not yet fully explored. Existing methods for measuring sequence impedance with frequency coupling are complicated, not suitable for large wind turbines and inverters, and they can measure the sequence impedance in only one of the MIMO and SISO forms. This paper shows that the sequence impedance has a reference frame similar to the dq impedance and presents a method for measuring the sequence impedance with frequency coupling. The proposed method aligns the sequence impedance reference frame based on the estimation of the grid voltage angle and obtains the impedance response in both MIMO …", "num_citations": "2\n", "authors": ["1051"]}
{"title": "Provision of grid services by PV plants with integrated battery energy storage system\n", "abstract": " Battery energy storage systems (BESS), due to their tremendous range of uses and configurations, may assist PV integration in any number of ways by increasing power system flexibility. In this paper we describe results of a research project conducted by NREL and First Solar for developing controls and demonstrating many use cases for PV-BESS systems including (1) matching generation to loads through time shifting, reducing PV curtailment,;(2) promoting higher levels of PV penetrations by balancing the grid through ancillary services;(3) use of PV-BESS systems to provide wide-area stability services in the form of oscillations damping controls; and (r) use of gird forming BESS for enabling black start and islanded applications for PV-BESS systems. In the paper we will also describe the unique multi-MW test and validation platform developed at NREL for conducting research on fielded utility-scale PV-BESS systems. The platform consists of First Solar 0.43 MW PV power plant, NREL’s 1MW/1MW BESS, 2MW PV power supplies and 7MVA power electronic grid simulator interfaced with industrial plant controllers and power-hardware-in-the-loop (PHIL) capability.", "num_citations": "2\n", "authors": ["1051"]}
{"title": "2019 offshore wind technology data update\n", "abstract": " The 2019 Offshore Wind Technology Data Update compiles information from peer-reviewed literature, market reports, press releases, industry news reports, manufacturer specification sheets, and offshore wind project announcements to provide a comprehensive snapshot of the state of the global wind industry in 2019. These data, including capacity projections, project characteristics, technology trends, and cost estimates, are categorized, tabulated, and plotted to provide easily recognizable and understandable summaries. A particular focus is given to the United States offshore wind project pipeline, including project announcements, state procurements, deployment timelines, infrastructure investments, grid interconnections, and other related developments. The update is intended to be used as a reference document by researchers, analysts, industry practitioners, and government officials.", "num_citations": "2\n", "authors": ["1051"]}
{"title": "Power-domain impedance theory for the analysis and mitigation of interarea oscillations\n", "abstract": " This paper presents an impedance-based theory for the analysis and mitigation of interarea oscillations in power systems. Because low-frequency power system oscillations primarily manifest in phasor quantities, including active and reactive power flows, and the magnitude and frequency of bus voltages, a new-type of impedance, called power-domain impedance, is defined in terms of these phasor quantities. The power-domain impedance provides an intuitive framework for the analysis of interarea oscillations without requiring internal details of generators, and it is ideally suited for developing oscillation damping controls in inverter-based resources. The power-domain impedance theory is demonstrated in this paper using PSCAD simulations of a two-area system. The theory is also used for designing damping control in synchronous generators and a wind power plant in the two-area system.", "num_citations": "2\n", "authors": ["1051"]}
{"title": "Impedance methods for analyzing stability impacts of inverter-based resources\n", "abstract": " This presentation provides an overview of impedance methods for analyzing stability impacts of inverter-based resources.", "num_citations": "2\n", "authors": ["1051"]}
{"title": "Ultra-Fast Frequency Response of Converter-Dominant Grids Using PMUs\n", "abstract": " The incorporation of converter-based power sources can act as a substitute for synchronous machine-based generators in an electric power grid. Because power converters are not intrinsically sensitive to frequency transients, the frequency response of these grids might deteriorate. To lessen large frequency excursions, this paper proposes a method to counteract load-generation imbalances by commanding ultra-fast frequency-responding converter-based assets such as wind and battery energy storage. The set points derive from the amount of the imbalance, which is estimated using phasor measurement units (PMUs). Because the proposed technique depends on communications networks, local converter frequency control using an aggressive frequency droop function is also proposed to mitigate negative impacts by communications failures and/or cyberattacks. The benefits of the technique are demonstrated on a modified version of the IEEE 39-bus test power system, which incorporates optimally located PMUs as well as wind, solar, and battery energy storage assets. The paper showcases that the proposed developments are instrumental to maintaining frequency close to nominal during relatively large load-generation imbalances and cyberattacks.", "num_citations": "2\n", "authors": ["1051"]}
{"title": "Validation and Testing of Advanced Grid Services by Inverter-Coupled Resources\n", "abstract": " This presentation provides an overview of validation and testing of advanced grid services by inverter-coupled resources.", "num_citations": "2\n", "authors": ["1051"]}
{"title": "NREL Controllable Grid Interface (CGI): Overview of Progress and Projects\n", "abstract": " • Energy shifiting• Flexibility• Scalability• All essential reliability services• Advanced reliability services• All forms of APC and RPC• Short circuit currents• Grid strength reinforcement• Real and synthetic inertias• Synchronizing torque• Grid forming/black start• Fast response, ultra-wide dynamic ranges• Resiliency, robustness• Grid-connected and islanded operation", "num_citations": "2\n", "authors": ["1051"]}
{"title": "Real-time digital simulation of inertial response with hardware-in-the-loop implementation on the CART3 wind turbine at the national wind technology center\n", "abstract": " With increasing penetrations of wind power on electric grids, the stability and reliability of interconnected power systems may be impacted. In some countries that have developed renewable energy sources and systems, grid codes have been revised to require wind power plants (WPPs) to provide ancillary services to support the power system frequency in case of severe grid events. To do this, wind turbine generators (WTGs) should be deloaded to reserve a certain amount of active power for primary frequency response; however, deloading curtails annual energy production, and the market for this type of service needs to be further developed. In this report, we focus on the temporary frequency support provided by WTGs through inertial response. WTGs have potential to provide inertial response, but appropriate control methods should be implemented. With the implemented inertial control methods, wind turbines are capable of increasing their active power output by releasing some of their stored kinetic energy when a frequency excursion occurs. Active power can be temporarily boosted above the maximum power points, after which the rotor speed decelerates, and subsequently an active power output reduction restores the kinetic energy. In this report, we develop two types of models for wind power systems: the more»", "num_citations": "2\n", "authors": ["1051"]}
{"title": "International requirements for large integration of renewable energy sources\n", "abstract": " Most European countries have concerns about the integration of large amounts of renewable energy sources (RES) into electric power systems, and this is currently a topic of growing interest. In January 2008, the European Commission published the 2020 package, which proposes committing the European Union to a 20% reduction in greenhouse gas emissions, to achieve a target of deriving 20% of the European Union’s final energy consumption from renewable sources, and to achieve 20% improvement in energy efficiency both by the year 2020 [1]. Member states have different individual goals to meet these overall objectives, and they each need to provide a detailed roadmap describing how they will meet these legally binding targets [2]. At this time, RES are an indispensable part of the global energy mix, which has been partially motivated by the continuous increases in hydropower as well as the rapid expansion of wind and solar photovoltaic (PV). The International Energy Agency’s 2012 edition of the World Energy Outlook stated that the rapid increases in RES integration are underpinned by falling technology costs as well as rising fossil-fuel prices and carbon pricing, but RES integration is also encouraged by continued subsidies: from $88 billion globally in 2011 (compared to $523 billion in fossil-fuel subsidies in 2012 [3], with a share of $131 billion for electricity generation) to an estimated $240 billion in 2035 [4]. According to [3], in 2015 RES accounted for 22% of electricity generation, which was approximately the same level as gas and about one-half the level of coal. Projecting into the future, it is estimated that by 2035 RES will …", "num_citations": "2\n", "authors": ["1051"]}
{"title": "Frequency support of PMSG-WTG based on improved inertial control\n", "abstract": " With increasing integrations of large-scale systems based on permanent magnet synchronous generator wind turbine generators (PMSG-WTGs), the overall inertial response of a power system will tend to deteriorate as a result of the decoupling of rotor speed and grid frequency through the power converter as well as the scheduled retirement of conventional synchronous generators. Thus, PMSG-WTGs can provide value to an electric grid by contributing to the system's inertial response by utilizing the inherent kinetic energy stored in their rotating masses and fast power control. In this work, an improved inertial control method based on the maximum power point tracking operation curve is introduced to enhance the overall frequency support capability of PMSG-WTGs in the case of large supply-demand imbalances. Moreover, this method is implemented in the CART2-PMSG integrated model in MATLAB/Simulink to …", "num_citations": "2\n", "authors": ["1051"]}
{"title": "PV Controls Utility-Scale Demonstration Project\n", "abstract": " This presentation provides a high-level overview of the utility-scale PV controls demonstration project.", "num_citations": "2\n", "authors": ["1051"]}
{"title": "Measurement-based performance analysis of wind energy systems\n", "abstract": " Wind measurements for identifying and characterizing wind resources require instrumentation and analysis techniques for defining signal processing features for gusts, turbulence, and inflow winds. This paper describes the importance of those features for determining responses of wind turbines. In addition, when the system is deployed, the instrumentation that must be coordinated to manage the utility connection requirements, such as assessing reactive power supply, fault ride-through, and power quality monitoring, is also discussed. The control schemes for wind energy generation systems are discussed and associated with the system signal processing required to control active power generation.", "num_citations": "2\n", "authors": ["1051"]}
{"title": "Synchrophasor applications for wind power generation\n", "abstract": " The US power industry is undertaking several initiatives that will improve the operations of the electric power grid. One of those is the implementation of wide-area measurements using phasor measurement units to dynamically monitor the operations and status of the network and provide advanced situational awareness and stability assessment. The overviews of synchrophasors and stability analyses in this report are intended to present the potential future applications of synchrophasors for power system operations under high penetrations of wind and other renewable energy sources.", "num_citations": "2\n", "authors": ["1051"]}
{"title": "First international workshop on grid simulator testing of wind turbine drivetrains: Workshop proceedings\n", "abstract": " This report summarizes the proceedings of the First International Workshop on Grid Simulator Testing of Wind Turbine Drivetrains, held from June 13 to 14, 2013, at the National Renewable Energy Laboratory's National Wind Technology Center, located south of Boulder, Colorado. The workshop was sponsored by the US Department of Energy and cohosted by the National Renewable Energy Laboratory and Clemson University under ongoing collaboration via a cooperative research and development agreement. The purpose of the workshop was to provide a forum to discuss the research, testing needs, and state-of-the-art apparatuses involved in grid compliance testing of utility-scale wind turbine generators. This includes both dynamometer testing of wind turbine drivetrains ('ground testing') and field testing grid-connected wind turbines. Four sessions followed by discussions in which all attendees of the workshop were encouraged to participate comprised the workshop.", "num_citations": "2\n", "authors": ["1051"]}
{"title": "Wind power generation\n", "abstract": " Wind power is a fast growing source of renewable energy. In this chapter, the process of conversion of the kinetic energy inherent in the wind to electrical energy is described. Numerous technologies exist and compete in order to achieve this objective, but in general, wind turbines and wind power plants (WPPs) rely on electrical machinery and power converters working together to achieve this purpose in an optimal and stable fashion. In this chapter, prevailing generator and converter types are discussed, as are some designs which may be seen in future turbines. Turbine and plant level control is also discussed.", "num_citations": "2\n", "authors": ["1051"]}
{"title": "Grid Simulator for Testing a Wind Turbine on Offshore Floating Platform\n", "abstract": " An important aspect of such offshore testing of a wind turbine floating platform is electrical loading of the wind turbine generator. An option of interconnecting the floating wind turbine with the onshore grid via submarine power cable is limited by many factors such as costs and associated environmental aspects (ie, an expensive and lengthy sea floor study is needed for cable routing, burial, etc). It appears to be a more cost effective solution to implement a standalone grid simulator on a floating platform itself for electrical loading of the test wind turbine. Such a grid simulator must create a stable fault-resilient voltage and frequency bus (a micro grid) for continuous operation of the test wind turbine. In this report, several electrical topologies for an offshore gridsimulator were analyzed and modeled.", "num_citations": "2\n", "authors": ["1051"]}
{"title": "Generic characterization of electrical test benches for AC-and HVDC-connected wind power plants\n", "abstract": " The electrical test and assessment of wind turbines go hand in hand with standards and network connection requirements. In this paper, the generic structure of advanced electrical test benches, including grid emulator or controllable grid interface, wind torque emulator, and device under test, is proposed to harmonize state-of-the-art test sites. On the other hand, modern wind turbines are under development towards new features, concerning grid-forming, black-start, and frequency support capabilities as well as harmonic stability and control interaction considerations, to secure the robustness and stability of renewable-energy-based power systems. Therefore, it is necessary to develop new and revised test standards and methodologies to address the new features of wind turbines. This paper proposes a generic test structure within two main groups, including open-loop and closed-loop tests. The open-loop tests include the IEC 61400-21-1 standard tests as well as the additional proposed test options for the new capabilities of wind turbines, which replicate grid connection compliance tests using open-loop references for the grid emulator. In addition, the closed-loop tests evaluate the device under test as part of a virtual wind power plant and perform real-time simulations considering the grid dynamics. The closed-loop tests concern grid connection topologies consisting of AC and HVDC, as well as different electrical characteristics, including impedance, short-circuit ratio, inertia, and background harmonics. The proposed tests can be implemented using available advanced test benches by adjusting their control systems. The characteristics of a …", "num_citations": "1\n", "authors": ["1051"]}
{"title": "Energy Transition and Reliability Challenges in Modern Power Grids\n", "abstract": " This presentation provides an overview of energy transition and reliability challenges in modern electric power grids.", "num_citations": "1\n", "authors": ["1051"]}
{"title": "CGI for Impedance Characterization of Inverter-Coupled Generation\n", "abstract": " This presentation provides an overview of impedance characterization of inverter-coupled generation using the 7 MVA/13.2 kV grid simulator (controllable grid interface) at the National Wind Technology Center of NREL. The presentation shows how sequence impedance responses of multi-megawatt inverters and wind turbines are measured using the grid simulator. Applications of the measured impedance responses for the evaluation of dynamic interactions and high-fidelity model validation are demonstrated. The presentation also shows application of large-signal impedance theory for the prediction of harmonics generated by subsynchronous resonance (SSR) of DFIG-based Type-III wind turbines with series-compensated transmission lines. Finally, a new method for impedance-based characterization of power system frequency response is presented to enable real-time estimation of system inertia and primary frequency response (PFR), and to support control design for frequency support by inverter-coupled generation.", "num_citations": "1\n", "authors": ["1051"]}
{"title": "Coordinated Voltage Control Scheme of an Adjustable-Speed Pumped Storage Hydropower and a Wind Power Plant\n", "abstract": " As a type of inverter-based generation, an adjustable-speed pumped storage hydropower (AS-PSH) plant is a functional extension of conventional PSH plants and can provide more flexible and faster responses to provide ancillary services than conventional synchronous generators, thereby making a positive impact on power system voltage stability. This paper proposes a coordinated voltage control scheme of an AS-PSH plant with a wind power plant (WPP). The coordinated controller dispatches partial voltage set points, which are determined in proportion to the reactive current capability of each unit; thus, the controller enables the unit with a larger capability to receive a larger voltage set point so that the coordinating controller enhances the voltage controllability of the units. In addition, to stabilize the voltage at the point of interconnection after a fault clearance, reactive current initialization schemes are …", "num_citations": "1\n", "authors": ["1051"]}
{"title": "Grid Frequency Extreme Event Analysis and Modeling\n", "abstract": " Sudden losses of generation or load can lead to instantaneous changes in electric grid frequency and voltage. Extreme frequency events pose a major threat to grid stability. As renewable energy sources supply power to grids in increasing proportions, it becomes increasingly important to examine when and why extreme events occur to prevent destabilization of the grid. To better understand frequency events, including extrema, historic data were analyzed to fit probability distribution functions to various frequency metrics. Results showed that a standard Cauchy distribution fit the difference between the frequency nadir and prefault frequency (f_ (CA)) metric well, a standard Cauchy distribution fit the settling frequency (f_B) metric well, and a standard normal distribution fit the difference between the settling frequency and frequency nadir (f_ (BC)) metric very well. Results were inconclusive for the frequency nadir (f_C) metric, meaning it likely has a more complex distribution than those tested. This probabilistic modeling should facilitate more realistic modeling of grid faults.", "num_citations": "1\n", "authors": ["1051"]}
{"title": "Stability assessment of a system comprising a single machine and inverter with scalable ratings\n", "abstract": " From the inception of power systems, synchronous machines have acted as the foundation of large-scale electrical infrastructures and their physical properties have formed the cornerstone of system operations. However, power electronics interfaces are playing a growing role as they are the primary interface for several types of renewable energy sources and storage technologies. As the role of power electronics in systems continues to grow, it is crucial to investigate the properties of bulk power systems in low inertia settings. In this paper, we assess the properties of coupled machine-inverter systems by studying an elementary system comprised of a synchronous generator, three-phase inverter, and a load. Furthermore, the inverter model is formulated such that its power rating can be scaled continuously across power levels while preserving its closed-loop response. Accordingly, the properties of the machine-inverter system can be assessed for varying ratios of machine-to-inverter power ratings and, hence, differing levels of inertia. After linearizing the model and assessing its eigenvalues, we show that system stability is highly dependent on the interaction between the inverter current controller and machine exciter, thus uncovering a key concern with mixed machine-inverter systems and motivating the need for next-generation grid-stabilizing inverter controls.", "num_citations": "1\n", "authors": ["1051"]}
{"title": "Novel Control Strategy for Multiple Run-of-the-River Hydro Power Plants to Provide Grid Ancillary Services\n", "abstract": " Electricity generated by Hydropower Plants (HPPs) contributes a considerable portion of bulk electricity generation and delivers it with a low carbon footprint. In fact, HPP electricity generation provides the largest share from renewable energy resources, which includes solar and wind energy. The increasing penetration of wind and solar penetration leads to a lowered inertia in the grid and hence poses stability challenges. In recent years, breakthrough in energy storage technologies have demonstrated the economic and technical feasibility of extensive deployments in power grids. Multiple ROR HPPs if integrated with scalable, multi time-step energy storage so that the total output can be controlled. Although, the size of a single energy storage is far smaller than that of a typical reservoir, cohesively managing multiple sets of energy storage distributed in different locations is proposed. The ratings of storages and multiple ROR HPPs approximately equals the rating of a large, conventional HPP. The challenges associated with the system architecture and operation are described. Energy storage technologies such as supercapacitors, flywheels, batteries etc. can function as a dispatchable synthetic reservoir with a scalable size of energy storage will be integrated. Supercapacitors, flywheels, and battery are chosen to provide fast, medium, and slow responses to more»", "num_citations": "1\n", "authors": ["1051"]}
{"title": "Distributed real-time simulations for electric power engineering\n", "abstract": " Real-Time Simulations (RTS) are increasingly being used to understand the complex device and system level interactions in power grids. RTS provides the capability to create detailed, highly accurate, and diverse set of power and control system components at low time steps (order of microseconds) that are based on “real-world clock-time.” RT simulator is a unique architecture with specialized processors and communication boards that allow time synchronization of simulations and the clocktime. Lean operating systems, specialized processors, faster communications, etc. are the typical attributes of RT simulators. RT simulators provide a unique capability of interfacing with power and control components via analog and digital interfaces. However, RT simulators have limited computational capability that constrains the size of power and control systems that can be simulated. Multiple simulators connected locally is typically used to increase the computation capability, however this is not always economical. Additionally, RT simulators are used at facilities with unique test infrastructure in the form of grid emulators, inverters, photovoltaic, wind turbine, microgrids, etc. Performing distributed RTS via Internet can augment simulation capacity and leverage unique infrastructure that is dispersed in academia and research laboratories. Research related to distributed RTS and its application in electric power engineering is discussed in this chapter.", "num_citations": "1\n", "authors": ["1051"]}
{"title": "Inertial response of an offshore wind power plant with HVDC-Vsc\n", "abstract": " This paper analyzes the inertial response of an offshore wind power plant (WPP) to provide ancillary services to the power system grid. The WPP is connected to a high-voltage direct-current voltage source converter HVDC-VSC to deliver the power to the onshore substation. The wind turbine generator (WTG) used is a doubly-fed induction generator (Type 3 WTG). In this paper we analyze a control method for the WTGs in an offshore WPP to support the grid and contribute ancillary services to the power system network. Detailed time domain simulations will be conducted to show the transient behavior of the inertial response of an offshore WPP.", "num_citations": "1\n", "authors": ["1051"]}
{"title": "Dynamic braking system of a tidal generator\n", "abstract": " Renewable energy generation has experienced significant cost reductions during the past decades, and it has become more accepted by the global population. In the beginning, wind generation dominated the development and deployment of renewable energy; however, during recent decades, photovoltaic (PV) generation has grown at a very significant pace due to the tremendous decrease in the cost of PV modules. The focus on renewable energy generation has now expanded to include new types with promising future applications, such as river and tidal generation. The input water flow to these types of resources is more predictable than wind or solar generation. The data used in this paper is representative of a typical river or tidal generator. The analysis is based on a generator with a power rating of 40 kW. The tidal generator under consideration is driven by two sets of helical turbines connected to each …", "num_citations": "1\n", "authors": ["1051"]}
{"title": "Estimating the Economic Potential of Offshore Wind in the United States\n", "abstract": " The potential for cost reduction and market deployment for offshore wind varies considerably within the United States. This analysis estimates the future economic viability of offshore wind at more than 7,000 sites under a variety of electric sector and cost reduction scenarios. Identifying the economic potential of offshore wind at a high geospatial resolution can capture the significant variation in local offshore resource quality, costs, and revenue potential. In estimating economic potential, this article applies a method initially developed in Brown et al.(2015) to offshore wind and estimates the sensitivity of results under a variety of most likely electric sector scenarios. For the purposes of this analysis, a theoretical framework is developed introducing a novel offshore resource classification system that is analogous to established resource classifications from the oil and gas sector. Analyzing economic potential within this framework can help establish a refined understanding across industries of the technology and site-specific risks and opportunities associated with future offshore wind development. The results of this analysis are intended to inform the development of the US Department of Energy's offshore wind strategy.", "num_citations": "1\n", "authors": ["1051"]}
{"title": "Investigating Power System Primary and Secondary Reserve Interaction under High Wind Penetration Using Frequency Response Model\n", "abstract": " Power system frequency needs to be maintained close to its nominal value at all times to avoid machine damage, under-frequency load-shedding and even blackouts. Adequate primary frequency response and secondary frequency response are the primary forces to correct an energy imbalance at the second to minute level. As wind energy becomes a larger portion of the world's energy portfolio, there are greater oppotunities for wind to provide frequency response services. This paper addresses one area of frequency control that has been missing in previous work-the reliabilty impacts and interactions between primary and secondary frequency control. The lack of a commercially available tools to simulate the interaction of these two responses has limited the energy industry's understanding of when the depletion of primary control reserve will impact the performance of secondary conrol response or vice versa. To investigate this issue, in this paper we develop a multi-area frequency response integration model with combined primary and secondary frequency control capabilities.", "num_citations": "1\n", "authors": ["1051"]}
{"title": "Simulation tool to assess mechanical and electrical stresses on wind turbine generators\n", "abstract": " Wind turbine generators (WTGs) consist of many different components to convert kinetic energy of the wind into electrical energy for end users. Wind energy is accessed to provide mechanical torque for driving the shaft of the electrical generator. The conversion from wind power to mechanical power is governed by the aerodynamic conversion. The aerodynamic-electrical-conversion efficiency of a WTG is influenced by the efficiency of the blades, the gearbox, the generator, and the power converter. This paper describes the use of MATLAB/Simulink to simulate the electrical and grid-related aspects of a WTG coupled with the FAST aeroelastic wind turbine computer-aided engineering tool to simulate the aerodynamic and mechanical aspects of a WTG. The combination of the two enables studies involving both electrical and mechanical aspects of a WTG. For example, mechanical engineers can formulate generator …", "num_citations": "1\n", "authors": ["1051"]}
{"title": "Market designs for the primary frequency response ancillary service\n", "abstract": " The first part of this two-paper series discusses the motivation of implementing a primary frequency response (PFR) market in restructured pool-based power markets, as well as the market design that would create the right incentives to provide the response reliably. PFR is the immediate, autonomous response of generation and demand to system frequency deviations. It is the critical response required to avoid triggering under- and over-frequency relays or instability that could lead to machine damage, load-shedding, and in the extreme case, blackouts. Currently, in many restructured power systems throughout the world, ancillary services markets have been developed to incent technologies to provide the services to support power system reliability. However, few ancillary services markets include a market explicitly incentivizing the provision of PFR. Historically, PFR was an inherent feature available in conventional generating technologies, and in most systems, more was available than needed. Yet, recent trends in declining frequency response, the introduction of emerging technologies, and market behavior may soon require innovative market designs to incent resources to provide this valuable service.", "num_citations": "1\n", "authors": ["1051"]}