{"title": "Final results of the EDELWEISS-II WIMP search using a 4-kg array of cryogenic germanium detectors with interleaved electrodes\n", "abstract": " Abstract The EDELWEISS-II Collaboration has completed a direct search for WIMP dark matter with an array of ten 400-g cryogenic germanium detectors in operation at the Laboratoire Souterrain de Modane. The combined use of thermal phonon sensors and charge collection electrodes with an interleaved geometry enables the efficient rejection of γ-induced radioactivity as well as near-surface interactions. A total effective exposure of 384 kg d has been achieved, mostly coming from fourteen months of continuous operation. Five nuclear recoil candidates are observed above 20 keV, while the estimated background is 3.0 events. The result is interpreted in terms of limits on the cross-section of spin-independent interactions of WIMPs and nucleons. A cross-section of 4.4× 10− 8 pb is excluded at 90% CL for a WIMP mass of 85 GeV. New constraints are also set on models where the WIMP-nucleon scattering is …", "num_citations": "330\n", "authors": ["1931"]}
{"title": "Search for low-mass WIMPs with EDELWEISS-II heat-and-ionization detectors\n", "abstract": " We report on a search for low-energy (E< 20 keV) WIMP-induced nuclear recoils using data collected in 2009–2010 by EDELWEISS from four germanium detectors equipped with thermal sensors and an electrode design (ID) which allows to efficiently reject several sources of background. The data indicate no evidence for an exponential distribution of low-energy nuclear recoils that could be attributed to WIMP elastic scattering after an exposure of 113 kg· d. For weakly interacting massive particles (WIMPs) of mass 10 GeV, the observation of one event in the WIMP search region results in a 90% CL limit of 1.0× 10− 5 pb on the spin-independent WIMP-nucleon scattering cross-section, which constrains the parameter space associated with the findings reported by the CoGeNT, DAMA and CRESST experiments.", "num_citations": "202\n", "authors": ["1931"]}
{"title": "Axion searches with the EDELWEISS-II experiment\n", "abstract": " We present new constraints on the couplings of axions and more generic axion-like particles using data from the EDELWEISS-II experiment. The EDELWEISS experiment, located at the Underground Laboratory of Modane, primarily aims at the direct detection of WIMPs using germanium bolometers. It is also sensitive to the low-energy electron recoils that would be induced by solar or dark matter axions. Using a total exposure of up to 448 kg. d, we searched for axion-induced electron recoils down to 2.5 keV within four scenarios involving different hypotheses on the origin and couplings of axions. We set a 95% CL limit on the coupling to photons g Aγ< 2.15× 10− 9 GeV− 1 in a mass range not fully covered by axion helioscopes. We also constrain the coupling to electrons, g Ae< 2.59× 10− 11, similar to the more indirect solar neutrino bound. Finally we place a limit on g Ae× g AN eff< 4.82× 10− 17, where g AN eff is …", "num_citations": "126\n", "authors": ["1931"]}
{"title": "A new high-background-rejection dark matter Ge cryogenic detector\n", "abstract": " A new design of a cryogenic germanium detector for dark matter search is presented, taking advantage of the coplanar grid technique of event localisation for improved background discrimination. Experiments performed with prototype devices in the EDELWEISS II setup at the Modane underground facility demonstrate the remarkably high efficiency of these devices for the rejection of low-energy β, approaching 10 5. This opens the road to investigate the range beyond 10− 8 pb in the WIMP–nucleon collision cross-sections, as proposed in the EURECA project of a one-ton cryogenic detector mass.", "num_citations": "115\n", "authors": ["1931"]}
{"title": "Combined limits on WIMPs from the CDMS and EDELWEISS experiments\n", "abstract": " The CDMS and EDELWEISS collaborations have combined the results of their direct searches for dark matter using cryogenic germanium detectors. The total data set represents 614 kg· days equivalent exposure. A straightforward method of combination was chosen for its simplicity before data were exchanged between experiments. The results are interpreted in terms of limits on spin-independent weakly interacting, massive particle (WIMP)-nucleon cross section. For a WIMP mass of 90 GeV/c 2, where this analysis is most sensitive, a cross section of 3.3× 10− 44 cm 2 is excluded at 90% CL At higher WIMP masses, the combination improves the individual limits, by a factor 1.6 above 700 GeV/c 2. Alternative methods of combining the data provide stronger constraints for some ranges of WIMP masses and weaker constraints for others.", "num_citations": "109\n", "authors": ["1931"]}
{"title": "First results of the EDELWEISS-II WIMP search using Ge cryogenic detectors with interleaved electrodes\n", "abstract": " Abstract The EDELWEISS-II Collaboration has performed a direct search for WIMP dark matter with an array of ten 400 g heat-and-ionization cryogenic detectors equipped with interleaved electrodes for the rejection of near-surface events. Six months of continuous operation at the Laboratoire Souterrain de Modane have been achieved. The observation of one nuclear recoil candidate above 20 keV in an effective exposure of 144 kg d is interpreted in terms of limits on the cross-section of spin-independent interactions of WIMPs and nucleons. A cross-section of 1.0× 10− 7 pb is excluded at 90% CL for a WIMP mass of 80 GeV/c 2. This result demonstrates for the first time the very high background rejection capabilities of these simple and robust detectors in an actual WIMP search experiment.", "num_citations": "109\n", "authors": ["1931"]}
{"title": "Development of -containing scintillating bolometers for a high-sensitivity neutrinoless double-beta decay search\n", "abstract": " This paper reports on the development of a technology involving -enriched scintillating bolometers, compatible with the goals of CUPID, a proposed next-generation bolometric experiment to search for neutrinoless double-beta decay. Large mass (), high optical quality, radiopure -containing zinc and lithium molybdate crystals have been produced and used to develop high performance single detector modules based on 0.2–0.4 kg scintillating bolometers. In particular, the energy resolution of the lithium molybdate detectors near the Q-value of the double-beta transition of  (3034 keV) is 4–6 keV FWHM. The rejection of the -induced dominant background above 2.6 MeV is better than . Less than  activity of  and  in the crystals is ensured by boule recrystallization. The potential of -enriched scintillating bolometers to perform high sensitivity double-beta decay searches has been …", "num_citations": "99\n", "authors": ["1931"]}
{"title": "Constraints on low-mass WIMPs from the EDELWEISS-III dark matter search\n", "abstract": " We present the results of a search for elastic scattering from galactic dark matter in the form of Weakly Interacting Massive Particles (WIMPs) in the 4–30 GeV/c 2 mass range. We make use of a 582 kg-day fiducial exposure from an array of 800 g Germanium bolometers equipped with a set of interleaved electrodes with full surface coverage. We searched specifically for~ 2.5–20 keV nuclear recoils inside the detector fiducial volume. As an illustration the number of observed events in the search for 5 (resp. 20) GeV/c 2 WIMPs are 9 (resp. 4), compared to an expected background of 6.1 (resp. 1.4). A 90% CL limit of 4.3× 10− 40 cm 2 (resp. 9.4× 10− 44 cm 2) is set on the spin-independent WIMP-nucleon scattering cross-section for 5 (resp. 20) GeV/c 2 WIMPs. This result represents a 41-fold improvement with respect to the previous EDELWEISS-II low-mass WIMP search for 7 GeV/c 2 WIMPs. The derived constraint is in …", "num_citations": "93\n", "authors": ["1931"]}
{"title": "Improved EDELWEISS-III sensitivity for low-mass WIMPs using a profile likelihood approach\n", "abstract": " We report on a dark matter search for a Weakly Interacting Massive Particle (WIMP) in the mass range  with the EDELWEISS-III experiment. A 2D profile likelihood analysis is performed on data from eight selected detectors with the lowest energy thresholds leading to a combined fiducial exposure of 496 kg-days. External backgrounds from - and -radiation, recoils from  and neutrons as well as detector intrinsic backgrounds were modelled from data outside the region of interest and constrained in the analysis. The basic data selection and most of the background models are the same as those used in a previously published analysis based on boosted decision trees (BDT) [1]. For the likelihood approach applied in the analysis presented here, a larger signal efficiency and a subtraction of the expected background lead to a higher sensitivity, especially for the lowest WIMP masses probed. No …", "num_citations": "87\n", "authors": ["1931"]}
{"title": "Performance of the EDELWEISS-III experiment for direct dark matter searches\n", "abstract": " We present the results of measurements demonstrating the efficiency of the EDELWEISS-III array of cryogenic germanium detectors for direct dark matter searches. The experimental setup and the FID (Fully Inter-Digitized) detector array is described, as well as the efficiency of the double measurement of heat and ionization signals in background rejection. For the whole set of 24 FID detectors used for coincidence studies, the baseline resolutions for the fiducial ionization energy are mainly below 0.7 keV ee (FHWM) whereas the baseline resolutions for heat energies are mainly below 1.5 keV ee (FWHM). The response to nuclear recoils as well as the very good discrimination capability of the FID design has been measured with an AmBe source. The surface β-and α-decay rejection power of R surf< 4× 10− 5 per α at 90% CL has been determined with a 210 Pb source, the rejection of bulk γ-ray events has been …", "num_citations": "73\n", "authors": ["1931"]}
{"title": "Background studies for the EDELWEISS dark matter experiment\n", "abstract": " The EDELWEISS-II collaboration has completed a direct search for WIMP dark matter using cryogenic Ge detectors (400 g each) and 384 kg× days of effective exposure. A cross-section of 4.4× 10-8 pb is excluded at 90% CL for a WIMP mass of 85 GeV. The next phase, EDELWEISS-III, aims to probe spin-independent WIMP-nucleon cross-sections down to a few× 10-9 pb. We present here the study of gamma and neutron background coming from radioactive decays in the set-up and shielding materials. We have carried out Monte Carlo simulations for the completed EDELWEISS-II setup with GEANT4 and normalised the expected background rates to the measured radioactivity levels (or their upper limits) of all materials and components. The expected gamma-ray event rate in EDELWEISS-II at 20–200 keV agrees with the observed rate of 82 events/kg/day within the uncertainties in the measured concentrations …", "num_citations": "72\n", "authors": ["1931"]}
{"title": "WITCH: a recoil spectrometer for weak interaction and nuclear physics studies\n", "abstract": " An experimental set-up is described for the precise measurement of the recoil energy spectrum of the daughter ions from nuclear beta decay. The experiment is called WITCH, short for Weak Interaction Trap for CHarged particles, and is set up at the ISOLDE facility at CERN. The principle of the experiment and its realization are explained as well as the main physics goal. A cloud of radioactive ions stored in a Penning trap serves as the source for the WITCH experiment, leading to the minimization of scattering and energy loss of the decay products. The energy spectrum of the recoiling daughter ions from the β-decays in this ion cloud will be measured with a retardation spectrometer. The principal aim of the WITCH experiment is to study the electroweak interaction by determining the beta-neutrino angular correlation in nuclear β-decay from the shape of this recoil energy spectrum. This will be the first time that the …", "num_citations": "69\n", "authors": ["1931"]}
{"title": "Muon-induced background in the EDELWEISS dark matter search\n", "abstract": " A dedicated analysis of the muon-induced background in the EDELWEISS dark matter search has been performed on a data set acquired in 2009 and 2010. The total muon flux underground in the Laboratoire Souterrain de Modane (LSM) was measured to be Φ μ=(5.4±0.2-0.9+ 0.5) muons/m 2/d. The modular design of the μ-veto system allows the reconstruction of the muon trajectory and hence the determination of the angular dependent muon flux in LSM. The results are in good agreement with both MC simulations and earlier measurements. Synchronization of the μ-veto system with the phonon and ionization signals of the Ge detector array allowed identification of muon-induced events. Rates for all muon-induced events Γ μ=(0.172±0.012) evts/(kg d) and of WIMP-like events Γ μ–n= 0.008-0.004+ 0.005 evts/(kg d) were extracted. After vetoing, the remaining rate of accepted muon-induced neutrons in the …", "num_citations": "64\n", "authors": ["1931"]}
{"title": "Searches for electron interactions induced by new physics in the EDELWEISS-III germanium bolometers\n", "abstract": " We make use of the EDELWEISS-III array of germanium bolometers to search for electron interactions at the keV scale induced by phenomena beyond the Standard Model. A 90% CL lower limit is set on the electron lifetime decaying to invisibles, τ> 1.2× 10 24 years. We investigate the emission of axions or axionlike particles (ALPs) by the Sun, constraining the coupling parameters g a e< 1.1× 10− 11 and g a e× g a N eff< 3.5× 10− 17 at 90% CL in the massless limit. We also directly search for the absorption of bosonic dark matter particles that would constitute our local galactic halo. Limits are placed on the couplings of ALPs or hidden photon dark matter in the mass range 0.8–500 keV/c 2. Prospects for searching for dark matter particles with masses down to 150 eV/c 2 using improved detectors are presented.", "num_citations": "62\n", "authors": ["1931"]}
{"title": "Precision measurements of the^{60} Co β-asymmetry parameter in search for tensor currents in weak interactions\n", "abstract": " The β-asymmetry parameter Ã for the Gamow-Teller decay of Co 60 was measured by polarizing the radioactive nuclei with the brute-force low-temperature nuclear-orientation method. The Co 60 activity was cooled down to milliKelvin temperatures in a He 3-He 4 dilution refrigerator in an external 13-T magnetic field. The β particles were observed by a 500-μ m-thick Si PIN diode operating at a temperature of about 10 K in a magnetic field of 0. 6 T. Extensive geant4 Monte Carlo simulations were performed to gain control over the systematic effects. Our result, Ã=− 1. 014 (12) stat (16) syst, is in agreement with the standard-model value of− 0. 987 (9), which includes recoil-order corrections that were addressed for the first time for this isotope. Further, it enables limits to be placed on possible tensor-type charged weak currents, as well as other physics beyond the standard model.", "num_citations": "42\n", "authors": ["1931"]}
{"title": "The upper limit of the branching ratio for radiative beta decay of free neutrons\n", "abstract": " We conducted an experiment on radiative neutron beta decay on an intensive cold-neutron beam at ILL during April and May 2002. This work is dedicated to the analysis of the methodology and the results of the study. The main outcome of this experiment is the branching ratio (BR) for the rare neutron-decay mode in the gamma-ray quanta energy region from 35 to 100 keV. The limit obtained is BR<6.9×10−3 (90% C.L.), which is only a few permilles greater than the theoretical BR value calculated within the standard weak-interactions model.", "num_citations": "42\n", "authors": ["1931"]}
{"title": "Development and underground test of radiopure ZnMoO4 scintillating bolometers for the LUMINEU 0ν2β project\n", "abstract": " The LUMINEU (Luminescent Underground Molybdenum Investigation for NEUtrino mass and nature) project envisages a high-sensitivity search for neutrinoless double beta (0ν 2β) decay of 100 Mo with the help of scintillating bolometers based on zinc molybdate (ZnMoO 4) crystals. One of the crucial points for the successful performance of this experiment is the development of a protocol for producing high quality large mass ZnMoO 4 crystal scintillators with extremely high internal radiopurity. Here we report a significant progress in the development of large volume ZnMoO 4 crystalline boules (with mass up to 1 kg) from deeply purified materials. We present and discuss the results achieved with two ZnMoO 4 samples (with mass of about 0.3 kg each): one is a precursor of the LUMINEU project, while the other one was produced in the framework of LUMINEU with an improved purification/crystallization procedure …", "num_citations": "41\n", "authors": ["1931"]}
{"title": "Microchannel plate response to high-intensity ion bunches\n", "abstract": " In this paper, we discuss the response of microchannel plate detectors (MCPs) to high-intensity bunches of ions with typical lengths of a few hundred microseconds. A dedicated experimental setup was developed to measure this behavior. The MCP operating voltage and the ion beam intensity appear to be important factors in the saturation behavior of the detector. The results of the measurements are extended to the more realistic situation of TOF spectrum measurements for beam diagnostics purposes by using two consecutive pulses impinging on the detector in a time interval much shorter than the recovery time of the detector. A new method for measuring the recovery time of the MCP detector is proposed and results are compared to simple estimates from an RC model approach. Finally the results of the measurements are compared to Monte-Carlo simulations which use a reservoir model to simulate the MCPs …", "num_citations": "41\n", "authors": ["1931"]}
{"title": "Optimizing EDELWEISS detectors for low-mass WIMP searches\n", "abstract": " The physics potential of EDELWEISS detectors for the search of low-mass weakly interacting massive particles (WIMPs) is studied. Using a data-driven background model, projected exclusion limits are computed using frequentist and multivariate analysis approaches, namely, profile likelihood and boosted decision tree. Both current and achievable experimental performances are considered. The optimal strategy for detector optimization depends critically on whether the emphasis is put on WIMP masses below or above∼ 5 GeV/c 2. The projected sensitivity for the next phase of the EDELWEISS-III experiment at the Modane Underground Laboratory (LSM) for low-mass WIMP search is presented. By 2018 an upper limit on the spin-independent WIMP-nucleon cross section of σ SI= 7× 10− 42 cm 2 is expected for a WIMP mass in the range 2–5 GeV/c 2. The requirements for a future hundred-kilogram-scale …", "num_citations": "40\n", "authors": ["1931"]}