{"title": "VIVACE: A framework for the systematic evaluation of variability support in process-aware information systems\n", "abstract": " ContextThe increasing adoption of process-aware information systems (PAISs) such as workflow management systems, enterprise resource planning systems, or case management systems, together with the high variability in business processes (e.g., sales processes may vary depending on the respective products and countries), has resulted in large industrial process model repositories. To cope with this business process variability, the proper management of process variants along the entire process lifecycle becomes crucial.ObjectiveThe goal of this paper is to develop a fundamental understanding of business process variability. In particular, the paper will provide a framework for assessing and comparing process variability approaches and the support they provide for the different phases of the business process lifecycle (i.e., process analysis and design, configuration, enactment, diagnosis, and evolution …", "num_citations": "85\n", "authors": ["1509"]}
{"title": "Elucidating the mashup hype: Definition, challenges, methodical guide and tools for mashups\n", "abstract": " Mashups are a current hype that is attracting high interest by academia and industry now and in the next years. The idea behind a mashup is to create new content by reusing and combining existing content from heterogeneous sources. Advantages of mashups are that even people with no knowledge of programming languages can easily build new Web applications and create new forms of visualizations. To support the mashup construction process several tools have been proposed with easy-to-use functionalities. However, from the research perspective it is dissatisfying that neither a clear definition and classification model for mashups nor a separation between mashups and other forms of application integrations exist. The aim of this paper is to elucidate the mashup hype by providing a definition and classification model for mashups and to sketch a methodical engineering guide for mashups. Additionally, an overview of tools and languages supporting the mashup creation is presented.", "num_citations": "81\n", "authors": ["1509"]}
{"title": "Developing Mobile Workflow Support in the Internet of Things.\n", "abstract": " La aparición de dispositivos móviles dotados de diferentes tipos de sensores ha permitido reducir la brecha existente entre el mundo real y el mundo virtual de los sistemas de información. Los sistemas móviles actuales son conscientes del entorno físico en el que están siendo usados y adaptar adecuadamente los servicios que ofrecen. Por ejemplo, tocando un libro con un dispositivo móvil podemos obtener información sobre su autor o tomarlo prestado sin necesidad de hacer colas. La visión de la computación dónde los elementos físicos como un libro o un producto en un supermercado están conectados con servicios digitales es lo que se conoce cómo el Internet de las Cosas [1]. Tecnologías del ámbito de los Sistemas Pervasivos cómo RFID, NFC o códigos de barras bidimensionales permiten convertir la visión de la Internet de las Cosas en realidad. Estas tecnologías dotan a los objetos físicos de una identidad digital que puede ser reconocida automáticamente. El artículo presentado en éste trabajo “Developing Mobile Workflow support in The Internet of Things”[2] se enmarca en el ámbito del Internet de las Cosas. En las siguientes secciones se aporta más información sobre el trabajo y el proceso de publicación.", "num_citations": "69\n", "authors": ["1509"]}
{"title": "A survey of requirements specification in model-driven development of web applications\n", "abstract": " Model-driven development has become more and more important in the last few years. In the context of web application development, many web Engineering methods that propose model-driven development processes have appeared. However, earlier stages of these processes are seldom considered and few of these methods rigorously face the problems of specifying web application requirements and translating them into the proper conceptual model. However, it is widely recognized that requirements engineering activities are essential to obtain quality software products. This article surveys Model-driven web engineering methods in a comparative study and analyzes the techniques proposed for specifying functional, data and navigational requirements as well as the mechanisms provided for automatically translating these requirements into conceptual models. Our main goal is to provide a critical view of the …", "num_citations": "65\n", "authors": ["1509"]}
{"title": "Test-driven development of model transformations\n", "abstract": " Model transformations enable the automated development paradigm proposed by Model Driven Engineering. However, since the requirements for building a model transformation are usually expressed informally, requirements descriptions are difficult to keep updated and synchronized with their corresponding implementations. Therefore, human effort is usually required for validating model transformations. The present work defines a test-driven method for the development process of model-to-model transformations. This method is focused on the capture of requirements for transformations in such a way that guides the development and the documentation of model transformations. Requirements are expressed by means of test cases that can be automatically validated. The proposal has been applied to the MOSKitt open source CASE tool in an industrial scenario.", "num_citations": "54\n", "authors": ["1509"]}
{"title": "Context-aware autonomous web services in software product lines\n", "abstract": " Web services run in complex environments where it is desirable to be able to count on mechanisms to adapt them according to contextual changes. Manual adaptations are unfeasible in intricate service compositions that are built with highly dynamic Web services. However, the principles of Autonomic Computing could support their self-adaptation. In this paper, we propose a method for designing and implementing context-aware autonomous Web services in system families. It is based on Software Product Line (SPL) engineering to support their systematic reuse in mass production environments. Autonomic behavior is achieved by our Model-based Reconfiguration Engine for Web services (MoRE-WS). MoRE-WS leverages variability models at runtime as easy-to-understand and semantically rich adaptation policies for decision-making while the architecture of a Dynamic SPL (DSPL) allows a flexible service …", "num_citations": "51\n", "authors": ["1509"]}
{"title": "Building business process driven web applications\n", "abstract": " The Internet has turned to be one the most common platform for the development of applications. In addition, sometimes the specification of these applications is given to web developers in the form of Business Processes (BP), and from this specification they are asked to develop the corresponding Web Application. In this situation, Web Engineering Methods should provide a way in which these specifications could be taken and be transformed into a Web Application that gives support to the process execution. Furthermore, when we are talking about B2B applications, we have to take into account that these BP usually involve the use of distributed functionality where different partners collaborate to accomplish an agreed goal. Therefore, in this work we provide a method for the automatic generation of Web Applications that give support to BP specifications. For this purpose, we generate from a BP definition …", "num_citations": "51\n", "authors": ["1509"]}
{"title": "Reverse engineering of web pages based on derivations and transformations\n", "abstract": " The final user interface of an information system could be reverse engineered according to a model-driven engineering perspective to multiple levels of abstraction, either independently of each other or simultaneously depending on the designer's goals: concrete user interface (which is independent of the user interface toolkit), abstract user interface (which is independent of any interaction modality), and \"task and concepts\" (which is independent of any particular implementation). To support the user interface reverse engineering from the code level to any model level, a set of derivation rules have been implemented in ReversiXML. To support the user interface reverse engineering from any model to any other level, graph grammars have been implemented in TransformiXML. A graph grammar consists of graph transformation rules, called productions, that accept as input a graph representation of the user interface …", "num_citations": "50\n", "authors": ["1509"]}
{"title": "Building Tools for Model Driven Development. Comparing Microsoft DSL Tools and Eclipse Modeling Plug-ins.\n", "abstract": " Department of Information Systems and Computation Technical University of Valencia Camí de Vera S/N 46022 Valencia, Spain e-mail:{pele, malbert, jmunoz, ccetina}@ dsic. upv. es, web: http://oomethod. dsic. upv. es", "num_citations": "48\n", "authors": ["1509"]}
{"title": "Towards run-time flexibility for process families: open issues and research challenges\n", "abstract": " The increasing adoption of process-aware information systems and the high variability of business processes in practice have resulted in process model repositories with large collections of related process variants (i.e., process families). Existing approaches for variability management focus on the modeling and configuration of process variants. However, case studies have shown that run-time configuration and re-configuration as well as the evolution of process variants are essential as well. Effectively handling process variants in these lifecycle phases requires deferring certain configuration decisions to the run-time, dynamically re-configuring process variants in response to contextual changes, adapting process variants to emerging needs, and evolving process families over time. In this paper, we characterize these flexibility needs for process families, discuss fundamental challenges to be tackled, and …", "num_citations": "44\n", "authors": ["1509"]}
{"title": "Building a software factory for pervasive systems development\n", "abstract": " The rise of the number and complexity of pervasive systems is a fact. Pervasive systems developers need advanced development methods in order to build better systems in an easy way. Software Factories and the Model Driven Architecture (MDA) are two important trends in the software engineering field. This paper applies the guidelines and strategies described by these proposals in order to build a methodological approach for pervasive systems development. Software Factories are based on the definition of software families supported by frameworks. Individual systems requirements are specified by means of domain specific languages. Following this strategy, our approach defines a framework and a domain specific language for pervasive systems. We use the MDA guidelines to support the development of our domain specific language and the automatic generation of the specific source code of a …", "num_citations": "42\n", "authors": ["1509"]}
{"title": "Introducing requirements traceability support in model-driven development of web applications\n", "abstract": " In this work, we present an approach that introduces requirements traceability capabilities in the context of model-driven development of Web applications. This aspect allows us to define model-to-model transformations that not only provide a software artifact of lower abstraction (as model-to-model transformations usually do) but also to provide feedback about how they are applied. This feedback helps us to validate whether transformations are correctly applied. In particular, we present a model-to-model transformation that allows us to obtain navigational models of the Web engineering method OOWS from a requirements model. This transformation is defined as a set of mappings between these two models that have been implemented by means of graph transformations. The use of graph transformations allows us to develop a tool-supported strategy for applying mappings automatically. In addition, mechanisms …", "num_citations": "40\n", "authors": ["1509"]}
{"title": "Strategies for variability transformation at run-time\n", "abstract": " More and more approaches propose to use Software Product Lines (SPLs) modelling techniques to implement dynamic adaptive systems. The resulting Dynamic Software Product Lines (DSPLs) present new challenges since the variability transformations used to derive alternative configurations have to be intensively used at runtime. This paper proposes to use the Common Variability Language (CVL) for modelling runtime variability and evaluates a set of alternative strategies for implementing the associated variability transformations. All the proposed strategies have been implemented and evaluated on the case-study of a smart-home system. Results show that the proposed strategies provide the same reconfiguration service with significant differences in quality-of-service.", "num_citations": "39\n", "authors": ["1509"]}
{"title": "Applying CVL to business process variability management\n", "abstract": " Business Processes (BP) exist in many variants depending on the application context. The use of variability mechanisms in BPs becomes essential for organizations to reduce development and maintenance efforts. However, such mechanisms entail big challenges. At design time, poor model specifications can turn process variants into difficult-to-maintain and understand artifacts. At runtime, process variants require continuous adaptations to achieve business goals in highly dynamic execution contexts. In order to address these challenges, in this paper we present a proposal to manage process variants at design time and runtime. At design time, process variants are modeled by combining a BP modeling language with the Common Variability Language. Then, at runtime, based on the created models and on the current context, process variants are adapted by means of MoRE-BP, a reconfiguration engine that is …", "num_citations": "38\n", "authors": ["1509"]}
{"title": "Personalization for unobtrusive service interaction\n", "abstract": " Increasingly, mobile devices play a key role in the communication between users and the services embedded in their environment. With ever greater number of services added to our surroundings, there is a need to personalize services according to the user needs and environmental context avoiding service behavior from becoming overwhelming. In order to prevent this information overload, we present a method for the development of mobile services that can be personalized in terms of obtrusiveness (the degree in which each service intrudes the user’s mind) according to the user needs and preferences. That is, services can be developed to provide their functionality at different obtrusiveness levels depending on the user by minimizing the duplication of efforts. On the one hand, we provide mechanisms for describing the obtrusiveness degree required for a service. On the other hand, we make use of …", "num_citations": "37\n", "authors": ["1509"]}
{"title": "A transformational approach to produce web application prototypes from a web requirements model\n", "abstract": " There are a significant number of proposals for modelling and developing web applications, but very few of them rigorously deal with how to elicit and represent requirements, and how to go from the Requirements Model to the Conceptual Model with a sound methodological basis. This work presents an approach to capture web application requirements. The main goal of this approach is to provide analysts with techniques that allow them to specify not only the functional and data requirements of a web application but also the navigational ones at early stages. These techniques make it possible to identify, specify and describe every task that must be achieved by web application users. In addition, we introduce a strategy based on graph transformations that allow us to automate the derivation of the navigational model of the OOWS method from early requirements specifications. Finally, by using the OOWS automatic …", "num_citations": "36\n", "authors": ["1509"]}
{"title": "Implementing a Pervasive Meeting Room: A Model Driven Approach.\n", "abstract": " Current pervasive systems are developed ad-hoc or using implementation frameworks. These approaches could be not enough when dealing with large and complex pervasive systems. This paper introduces an implementation of a pervasive system for managing a meeting room. This system has been developed using a model driven method proposed by the authors. The system is specified using PervML, a UML-like modeling language. Then, a set of templates are applied to the specification in order to automatically produce Java code that uses an OSGi-based framework. The final application integrates several technologies like EIB and Web Services. Three different user interfaces are provided for interacting with the system.", "num_citations": "35\n", "authors": ["1509"]}
{"title": "Enhancing modeling and change support for process families through change patterns\n", "abstract": " The increasing adoption of process-aware information systems (PAISs), together with the variability of business processes (BPs), has resulted in large collections of related process model variants (i.e., process families). To effectively deal with process families, several proposals (e.g., C-EPC, Provop) exist that extend BP modeling languages with variability-specific constructs. While fostering reuse and reducing modeling efforts, respective constructs imply additional complexity and demand proper support for process designers when creating and modifying process families. Recently, generic and language independent adaptation patterns were successfully introduced for creating and evolving single BP models. However, they are not sufficient to cope with the specific needs for modeling and evolving process families. This paper suggests a complementary set of generic and language-independent change …", "num_citations": "31\n", "authors": ["1509"]}
{"title": "Bridging the Gap between BPMN and WS-BPEL. M2M Transformations in Practice.\n", "abstract": " The Web is being consolidating as the main platform for the development of applications. Moreover, these applications are not conceived just as isolated systems. This fact implies that the requirements that Web applications should satisfy are now more challenging than before. One important requirement for these systems is to provide support for the execution of business goals expressed by means of Business Process definitions. From the Web Engineering area, several methods have provided a solution to cope with this requirement. In this work we present, within the context of the OOWS Web Engineering method, how business process definitions are transformed into executable process definitions by the application of model-to-model transformations. To accomplish this goal, this work has been developed in the context of the Eclipse environment jointly with the BABEL project.", "num_citations": "30\n", "authors": ["1509"]}
{"title": "Dynamic evolution of context-aware systems with models at runtime\n", "abstract": " Model-driven techniques have proven to yield significant benefits for context-aware systems. Specifically, semantically-rich models are used at runtime to monitor the system context and guide necessary changes. Under the closed-world assumption, adaptations are fully known at design time. Nevertheless, it is difficult to foresee all the possible situations that may arise in uncertain and complex contexts. In this paper, we present a model-based framework to support the dynamic evolution of context-aware systems to deal with unexpected context events in the open world. If model adaptations are not enough to solve uncertainty, our model-based evolution planner guides the evolution of the supporting models to preserve high-level requirements. A case study about a context-aware Web service composition, which is executed in a distributed computing infrastructure, illustrates the applicability of our …", "num_citations": "29\n", "authors": ["1509"]}
{"title": "Designing human-in-the-loop autonomous cyber-physical systems\n", "abstract": " Even though full autonomy in Cyber-Physical Systems (CPSs) is a challenge that has been confronted in different application domains and industrial sectors, the current scenario still requires human intervention in these autonomous systems in order to accomplish tasks that are better performed with human-in-the-loop. Humans, machines, and software systems are required to interact and understand each other in order to work together in an effective and robust way. This human integration introduces an important number of challenges and problems to be solved in order to achieve seamless and solid participation. To manage this complexity, appropriate techniques and methods must be used to help CPS developers analyze and design this kind of human-in-the-loop integration. The goal of this paper is to identify the technological challenges and limitations of integrating humans into the CPSs autonomy loop and …", "num_citations": "27\n", "authors": ["1509"]}
{"title": "A qualitative comparison of approaches supporting business process variability\n", "abstract": " The increasing adoption of Process-Aware Information Systems, together with the reuse of process knowledge, has led to the emergence of process model repositories with large process families, i.e., collections of related process model variants. For managing such related model collections two types of approaches exist. While behavioral approaches take supersets of variants and derive a process variant by hiding and blocking process elements, structural approaches take a base process model as input and derive a process variant by applying a set of change operations to it. However, at the current stage no framework for assessing these approaches exists and it is not yet clear which approach should be better used and under which circumstances. Therefore, to give first insights about this issue, this work compares both approaches in terms of understandability of the produced process model artifacts …", "num_citations": "27\n", "authors": ["1509"]}
{"title": "Variability management in process families through change patterns\n", "abstract": " Context: The increasing adoption of process-aware information systems together with the high variability in business processes has resulted in collections of process families. These families correspond to a business process model and its variants, which can comprise hundreds or thousands of different ways of realizing this process. Managing process variability in this context can be very challenging, labor-intensive, and error-prone, and new approaches for managing process families are necessary.Objective: We aim to facilitate variability management in process families, ensure process family correctness, and reduce the effort needed for such purposes.Method: We have derived a set of change patterns for process families from variability-specific language constructs identified in the literature. For validation, we have conducted a case study with a safety standard in which we have measured the number of …", "num_citations": "26\n", "authors": ["1509"]}
{"title": "Requirements engineering for pervasive systems. a transformational approach\n", "abstract": " This paper introduces a method for specifying the functional requirements of pervasive systems. These requirements specifications can be mapped into PervML models, which enables (1) the early generation of prototypes to validate the requirements and (2) the definition of well defined transformations that provide traceability mechanisms for going from requirements to implementation and vice-versa", "num_citations": "26\n", "authors": ["1509"]}
{"title": "Variability management in business process models\n", "abstract": " author (s): cayora@ pros. upv. es vtorres@ pros. upv. es pele@ pros. upv. es Document version number: 1.0 Final version: Yes Pages: 15 Release date: December 2011", "num_citations": "24\n", "authors": ["1509"]}
{"title": "Facing uncertainty in web service compositions\n", "abstract": " Web service compositions run in complex computing infrastructures where arising events may affect the quality of the system. However, crucial Web service compositions cannot be stopped to apply changes to deal with problematic events. Therefore, the trend is moving towards context-aware Web service compositions, which use context information as a basis for autonomic changes. Under the closed-world assumption, the context and possible adaptations are fully known at design time. Nevertheless, it is difficult to foresee all the possible situations arising in uncertain contexts. In this paper, we leverage models at runtime to guide the dynamic evolution of context-aware Web service compositions to deal with unexpected events in the open world. In order to manage uncertainty, a model that abstracts the Web service composition, self-evolves to preserve requirements. The evolved model guides changes in the …", "num_citations": "23\n", "authors": ["1509"]}
{"title": "Systematic reuse of web services through software product line engineering\n", "abstract": " In SOA, reusability logic is divided into services to support reuse. However, SOA lacks support for systematic reusability of Web services or composite Web services, making it more difficult to reuse them in mass production environments. On the other hand, SPL engineering supports systematic reuse by selecting the features that are part of a product while removing others that are not part of it. We propose a method in which SPL features are used to represent Web services and composite Web services. As a result, the selection or deselection of reusable features in a feature model guide the construction of particular service compositions. We have validated our approach based on a case study. Results related to systematic reuse demonstrate the value of our method.", "num_citations": "23\n", "authors": ["1509"]}
{"title": "A methodological framework and software infrastructure for the construction of software production methods\n", "abstract": " The theory of Method Engineering becomes increasingly solid, but very few engineering tools have been developed to support the application of its research results. To overcome this limitation, this paper presents a methodological framework based on Model Driven Engineering techniques. The framework provides a method supported by a software platform for the construction of software production methods. This framework covers from the specification of the software production method to the generation of the CASE tool that supports it. This generation process has been semi-automated through model transformations. The CASE tool and the software platform are based on the Eclipse-based MOSKitt tool. The plugin-based architecture and the integrated modelling tools included in the MOSKitt tool turn it into a suitable software platform to support our proposal. To validate the proposal we have applied the …", "num_citations": "23\n", "authors": ["1509"]}
{"title": "Applying Software Factories to Pervasive Systems: A Platform Specific Framework.\n", "abstract": " The raise of the number and complexity of pervasive systems is a fact. This kind of systems involves the integration of physical devices and software components in order to provide services to the inhabitants of an environment. Current techniques for developing pervasive systems provide low-level abstraction primitives which makes difficult the construction of large systems. Software Factories and the Model Driven Architecture (MDA) are two important trends in the software engineering field that can provide sensible benefits in the development of pervasive systems. In this paper, we present an approach for building a Software Factory for pervasive systems, focusing in the definition of a product line for this kind of systems. We introduce a software architecture for pervasive systems, which is supported by a software framework implemented using the OSGi technology. Then, we integrate the framework into the MDA standard defining the framework metamodel and providing tool support for the automatic code generation.", "num_citations": "23\n", "authors": ["1509"]}
{"title": "Inferring loneliness levels in older adults from smartphones\n", "abstract": " The number of older adult has increased significantly in most current societies. One problem that is accentuated in the stage of old age is loneliness which is a serious health risk. Therefore, new methods for early detection of this condition that make use of new non-intrusive technologies are required. Loneliness includes four main factors (family, spousal, social and existential crisis). In this paper, four predictive models to determine the level of loneliness of each factor are proposed, focusing on the activities that can be monitored using a Smartphone. Predictive models have been evaluated on basis of their accuracy, sensitivity, specificity, predictive values, type I and type II error rates. This paper also presents the results of the experimentation of the proposed approach in practice and with real users through a mobile application called “¡ Vive!” that implements the predictive models.", "num_citations": "22\n", "authors": ["1509"]}
{"title": "MDA vs Factorías de Software\n", "abstract": " La comunidad de la Ingeniería de Software está prestando en la actualidad un especial interés a dos enfoques para el desarrollo de software: la Model Driven Architectura (MDA) y las Factorías de Software. Este trabajo plantea e intenta responder algunas cuestiones respecto a la relación entre ambos enfoques. El trabajo discute las principales diferencias entre ambas propuestas, sus respectivas ventajas e inconvenientes, la posibilidad de integración y se identifican algunos aspectos de interés en el ámbito de la investigación. Las argumentaciones presentadas se ilustran mediante la aplicación de estas propuestas para la definición de un método de desarrollo de sistemas pervasivos.", "num_citations": "22\n", "authors": ["1509"]}
{"title": "Designing the human in the loop of self-adaptive systems\n", "abstract": " Self-adaptation is a key requirement in emerging software systems that must become capable of continuously adapting its behavior at run-time to their context (new environmental conditions, resource variability, unpredictable situations, changing user needs, etc.) without human intervention. However, experience in autonomous systems shows that people cannot be excluded entirely of the adaptation loop. For example, in the case of autonomous cars, they still need humans to drive in certain situations (e.g., complex driving situations, emergencies, etc.). This work defines the key factors to design the human participation in the control loops by introducing a framework to design human participations. Our framework considers human attention as a critical factor for user participation. Also, it pays attention to the dynamism between different types of human participation depending on the different system …", "num_citations": "20\n", "authors": ["1509"]}
{"title": "Model to text transformation in practice: generating code from rich associations specifications\n", "abstract": " This work presents a model to code transformation where extended UML association specifications are transformed into C# code. In order to define this transformation the work uses a conceptual framework for specifying association relationships that extends the UML proposal. We define a set of transformation rules for generating the C# code. The generated code extends an implementation framework that defines a design structure to implement the association abstraction. The transformation takes as input models those which are specified using the conceptual framework. Transformations have been implemented in the Eclipse environment using the EMF and MOFScript tools.", "num_citations": "18\n", "authors": ["1509"]}
{"title": "A model driven approach for the integration of external functionality in web applications. The travel agency system\n", "abstract": " Nowadays, it is getting more and more common to develop Web applications where part of the functionality is carried out by different systems. These systems provide functionality developed in different technologies that are integrated to build a complete web application. To deal with the integration issue that allows us to build this kind of Web applications, current Web Engineering methods should provide the mechanisms that facilitate this integration with third business parties during the modeling process. This paper presents a model driven method to achieve integration with external parties at a high level of abstraction. The method provided is an extension to the OOWS approach for the construction of this new kind of Web applications. The Travel Agency System has been taken as a case study to clearly understand how the whole method is applied.", "num_citations": "17\n", "authors": ["1509"]}
{"title": "Achieving autonomic Web service compositions with models at runtime\n", "abstract": " Several exceptional situations may arise in the complex, heterogeneous, and changing contexts where Web service operations run. For instance, a Web service operation may have greatly increased its execution time or may have become unavailable. The contribution of this article is to provide a tool-supported framework to guide autonomic adjustments of context-aware service compositions using models at runtime. During execution, when problematic events arise in the context, models are used by an autonomic architecture to guide changes of the service composition. Under the closed-world assumption, the possible context events are fully known at design time. Nevertheless, it is difficult to foresee all the possible situations arising in uncertain contexts where service compositions run. Therefore, the proposed framework also covers the dynamic evolution of service compositions to deal with unexpected events …", "num_citations": "16\n", "authors": ["1509"]}
{"title": "Building semantic web services based on a model driven web engineering method\n", "abstract": " The first step to turn into reality the vision of the Semantic Web is to provide web contents (data and functionality) in a format that can be processed by software agents. However, this change will not be achieved until users count on methods and techniques that help them in its development. For this reason we provide in this paper a methodological solution based on the Web Engineering discipline. We propose to extend a Web Engineering method with an Ontology model in order to specify, at the modelling level, the system data and functionality that are going to be exposed for the use of external applications. Moreover, by the application of a set of transformation rules we (1) build a draft of this Ontology model from the structural and behavioural models defined in the OOWS approach and (2) generate the equivalent representation of the Ontology model in a particular semantic web language.", "num_citations": "16\n", "authors": ["1509"]}
{"title": "Designing web services for supporting user tasks: A model driven approach\n", "abstract": " Web Service (WS) developers must take several decisions to design Service Oriented Architectures. Some of these decisions are: which operations should provide the involved Web Service, how we can detect these operations, in which way this can be automated and which is the right granularity of the operations. To address some of these questions, we present in this paper a methodological approach that extends the OOWS web engineering method. Following a model-driven approach, we systematically identify and design the operations of a Web service, taking as the source: (1) the tasks that the user must be able to achieve and (2) the OOWS conceptual models.", "num_citations": "16\n", "authors": ["1509"]}
{"title": "Developing BP-driven web applications through the use of MDE techniques\n", "abstract": " Model driven engineering (MDE) is a suitable approach for performing the construction of software systems (in particular in the Web application domain). There are different types of Web applications depending on their purpose (i.e., document-centric, interactive, transactional, workflow/business process-based, collaborative, etc). This work focusses on business process-based Web applications in order to be able to understand business processes in a broad sense, from the lightweight business processes already addressed by existing proposals to long-running asynchronous processes. This work presents a MDE method for the construction of systems of this type. The method has been designed in two steps following the MDE principles. In the first step, the system is represented by means of models in a technology-independent manner. These models capture the different aspects of Web-based systems …", "num_citations": "15\n", "authors": ["1509"]}
{"title": "Towards an end-user development approach for web engineering methods\n", "abstract": " End-users who are nonprogrammers create web applications by using advanced web development tools. However, these tools are not supported by any methodological process which produces that web applications are of low quality. This paper presents an approach to bring web engineering principles to the end-user community. We complement the web engineering method OOWS with tools that allow end-users to develop web applications by: (1) describing web applications in terms of the end-users’ knowledge about the application domain, (2) automatically obtaining a web application prototype by means of the OOWS code generation strategy, and (3) personalizing the web application look and feel by simply selecting a design template. To achieve this, an ontology-based strategy is introduced to support end-users throughout the web application development. We also introduce a strategy that allows …", "num_citations": "15\n", "authors": ["1509"]}
{"title": "Applying a web engineering method to design web services\n", "abstract": " Probably one of the most difficult tasks in the development of a Service Oriented Architecture (SOA) is how to obtain well designed Web Services. Some Web Engineering methods provide support to introduce Web services in the software development process but do not give support to the systematic design and implementation of them. In this work, we present an extension of a Web Engineering method (called OOWS) to provide a methodological guide for designing Web Services. This allows identifying and designing the operations and arguments of Web Services following a modeldriven approach, taking the OOWS conceptual models as a source. To document our approach, we apply our ideas to the design of the Amazon Web Service and compare our proposal with the solution provided by Amazon.", "num_citations": "15\n", "authors": ["1509"]}
{"title": "An architecture to automate ambient business system development\n", "abstract": " Business Processes in organizations usually involve real-world objects. A tight integration of these elements from the physical world into business process can improve process automation. This paper introduces a software architecture that allows this integration. The presented architecture is defined following an architectural process that decouples architectural concepts from technological solutions and stresses the relevance of automating the development process. Several case studies have been developped using the introduced architecture to experiment their benefits. In addition, modelling techniques have been used to automate the development of this kind of systems.", "num_citations": "14\n", "authors": ["1509"]}
{"title": "A model-driven approach for the design and implementation of software development methods\n", "abstract": " The Situational Method Engineering (SME) discipline emerged two decades ago to address the challenge of the in-house definition of software development methods and the construction of the corresponding supporting tools. Unfortunately, current SME approaches still have limitations that are hindering their adoption by industry. One of these limitations is that most approaches do not properly encompass two phases of the SME lifecycle, which refer to the method design and the method implementation. To address this limitation, this paper demonstrates how Model-Driven Development (MDD) techniques can contribute to successfully cover both phases. The proposal is illustrated by a real case study that is currently being used at the Valencian Regional Ministry of Infrastructure, Territory and Environment.", "num_citations": "13\n", "authors": ["1509"]}
{"title": "An object oriented methodological approach for making automated prototyping feasible\n", "abstract": " We present the OO-Method, an Object-Oriented Methodology that complements the use of formal specification languages with the background of the classical informal OO Analysis and Design proposals. This methodology eliminates the ambiguity of such methods and puts into practice the appropiate properties of formal specification languages in a practical way. It uses a formal OO Specification Language called Oasis as a design tool. The most relevant contribution of the OO-Method is that it generates the specification in an automated way from the graphical models obtained in the Analysis step and the quoted specification is a robust documentation of the System. Finally, code generators make possible to obtain implementations of the specification in different Software Development Environments, including declarative (Prolog-based) and imperative environments.", "num_citations": "13\n", "authors": ["1509"]}
{"title": "Turning method engineering support into reality\n", "abstract": " The Situational Method Engineering (SME) discipline emerged two decades ago to face up to the challenge of the in-house definition of software production methods and the construction of the corresponding supporting tools. However, nowadays most of the existent proposals only focus on one of the phases of the SME lifecycle. In order to fill this gap, in this paper we present a methodological framework that equally encompasses two of these phases, which refer to the method design and implementation. In order to support them in an effective manner, we advocate for the use of the Model Driven Development (MDD) paradigm. Applying these ideas, the framework has been defined on top of a MDD infrastructure based on meta-modeling and model transformation techniques. In addition, we provide implementation details of the framework in an Eclipse-based modeling platform, namely MOSKitt.", "num_citations": "12\n", "authors": ["1509"]}
{"title": "Introducing graphic designers in a web development process\n", "abstract": " Web development teams include not only software engineers but also graphic designers. In this work, we extend the OOWS method in order to introduce graphic designers into its development process. To do this, we extend the automatic code generation strategy of the OOWS method to obtain code that provides users with the information and functionality captured in the requirements model but without considering any kind of aesthetic aspect. We also propose a strategy to define domain-independent presentation templates. These templates can be applied to any web application developed by the OOWS method. These extensions allow us to define a web development process where graphic designers work together with analysts with a high degree of independence from each other but always in a coordinated way.", "num_citations": "12\n", "authors": ["1509"]}
{"title": "Extending an OO Method de Develop Web Applications\n", "abstract": " This work presents an overview of the OOWS method, an OO software production method that provides conceptual modelling extensions (in terms of models and abstraction primitives) to facilitate the web application specification. The method provides a set of techniques for the conceptual modelling of functional, navigational and presentation requirements of dynamic web applications, and proposes a strategy to allow going from the problem space (conceptual model) to the solution space (final software product) in an automatic way.", "num_citations": "12\n", "authors": ["1509"]}
{"title": "Engineering human-in-the-loop interactions in cyber-physical systems\n", "abstract": " Context: Cyber-Physical Systems (CPSs) are gradually and widely introducing autonomous capabilities into everything. However, human participation is required to accomplish tasks that are better performed with humans (often called human-in-the-loop). In this way, human-in-the-loop solutions have the potential to handle complex tasks in unstructured environments, by combining the cognitive skills of humans with autonomous systems behaviors.Objective: The objective of this paper is to provide appropriate techniques and methods to help designers analyze and design human-in-the-loop solutions. These solutions require interactions that engage the human, provide natural and understandable collaboration, and avoid disturbing the human in order to improve human experience.Method: We have analyzed several works that identified different requirements and critical factors that are relevant to the design of …", "num_citations": "11\n", "authors": ["1509"]}
{"title": "Modeling Ubiquitous Business Process Driven Applications.\n", "abstract": " This paper presents a model driven approach for the generation of business process driven web applications within the context of ubiquitous environments. For this reason, we have taken into account that the generated Web applications can be accessed via different devices (such as PDAs), which introduce a set of constraints that are better faced at the modeling process. This proposal relies on both model-to-model and model-to-text transformation techniques to obtain the final software artifact. As a result, we have implemented an Eclipse based prototype that generates from a business process definition the adequate GUI (in terms of the device) to execute the process as well as the equivalent definition into an executable language such as WS-BPEL.", "num_citations": "11\n", "authors": ["1509"]}
{"title": "Measures to report the location problem of model fragment location\n", "abstract": " Model Fragment Location (MFL) aims at identifying model elements that are relevant to a requirement, feature, or bug. Many MFL approaches have been introduced in the last few years to address the identification of the model elements that correspond to a specific functionality. However, there is a lack of detail when the measurements about the search space (models) and the measurements about the solution to be found (model fragment) are reported. Generally, the only reported measure is the model size. In this paper, we propose using five measurements (size, volume, density, multiplicity, and dispersion) to report the location problems. These measurements are the result of analyzing 1,308 MFLs in a family of industrial models over the last four years. Using two MFL approaches, we emphasize the importance of these measurements in order to compare results. Our work not only proposes improving the …", "num_citations": "10\n", "authors": ["1509"]}
{"title": "A mobile-based solution for supporting end-users in the composition of services\n", "abstract": " Currently, technologies and applications evolve to create eco-systems made up of a myriad of heterogeneous and distributed services that are accessible anytime and anywhere. Even though these services can be used individually, it is their coordinated and combined usage what provide an added value to end-users. In addition, user’s wide adoption of mobile devices for daily activities have fostered a shift in the role played by end-users towards Internet data and services. However, existing solutions to service composition are not targeted to ordinary end-users. More easy-to-use tools have to be offered to end-users to make sure that they are successfully accepted and used by them. To this end, the work presented in this paper supports end-users in the creation of service compositions by using mobile devices. We present a Domain Specific Visual Language (DSVL) for end-users that allows them to …", "num_citations": "10\n", "authors": ["1509"]}
{"title": "On the usefulness and ease of use of a model-driven Method Engineering approach\n", "abstract": " The Method Engineering (ME) discipline emerged as a response to the need for methods that are better adapted to context. Despite the potential benefits of ME and the emergence of Computer-Aided Method Engineering technology, there are hardly any reports on the practical application of ME available in the literature. Some authors argue that this is because practitioners often fail to see the usefulness of ME due to its high complexity. With the aim of facilitating the application of ME, we developed MOSKitt4ME, a lightweight approach that makes intensive use of reusable assets and Model-Driven Engineering. In previous work, we illustrated how MOSKitt4ME supports three phases of the ME lifecycle: design, implementation, and execution. In this paper, we evaluate the complexity of MOSKitt4ME. Specifically, we present a study that is based on the Technology Acceptance Model (TAM) and the Think Aloud …", "num_citations": "10\n", "authors": ["1509"]}
{"title": "The MOSKitt4ME approach: providing process support in a method engineering context\n", "abstract": " It is commonly agreed that software developments methods must be defined (or adapted) in-house in order to meet the particular needs of the organizations where they are to be applied. To help meet this challenge, Method Engineering (ME) research aims to provide solutions to efficiently deal with the definition and adaptation of methods, and the construction of the supporting software tools. However, while the product part of methods is fully considered by most ME approaches, the specification and enactment of the process part is less well-supported. To fill this gap, this work presents a methodological ME approach and a Computer-Aided Method Engineering (CAME) environment (MOSKitt4ME) that support the design and implementation of the process part of methods in the context of Model-Driven Engineering. The proposal is illustrated by means of a real case study from the Valencian Regional …", "num_citations": "10\n", "authors": ["1509"]}
{"title": "Model driven design of web service operations using web engineering practices\n", "abstract": " The design of Web Services is nowadays emerging as one of the most important tasks in the development of a Service Oriented Application. Web service designers need some guidelines to achieve a design of quality. In this paper we provide a methodological guide in the context of a Web engineering method called OOWS. Our approach allows identifying the operations of Web services following a model driven approach, taking the OO-Method / OOWS conceptual models as the source. To document our approach, we apply our ideas to a real case study of a Web application to manage University Research Groups.", "num_citations": "10\n", "authors": ["1509"]}
{"title": "Un modelo de evaluación de prácticas en laboratorio de ingeniería del software\n", "abstract": " En este trabajo se presenta un modelo de evaluación de las prácticas realizadas en la asignatura Laboratorio de Ingeniería del Software que se imparte en la titulación de Ingeniería Técnica en Informática de la Escuela Universitaria de Informática en la Universidad Politécnica de Valencia. En estas prácticas, los alumnos deben desarrollar un proyecto software, cubriendo todas las fases del ciclo de vida, desde la especificación de requisitos de la aplicación hasta la documentación y entrega del producto final. Este planteamiento de las prácticas se complementa con la evaluación que se realiza de las mismas. La idea es que los alumnos, además de desarrolladores, desempeñen también el papel de evaluadores del producto y evalúen los proyectos realizados por otros alumnos. De esta forma, en la nota final de las prácticas, el profesor evalúa dos aspectos: el trabajo realizado y la capacidad de evaluar un proyecto software. Además, en la calificación del trabajo realizado, se añade a la evaluación del profesor, la evaluación realizada por otros alumnos. Esta forma de evaluación se ha puesto en práctica en los dos últimos cursos académicos, mostrándose los resultados obtenidos.", "num_citations": "10\n", "authors": ["1509"]}
{"title": "A microservice composition approach based on the choreography of BPMN fragments\n", "abstract": " ContextMicroservices must be composed to provide users with complex and elaborated functionalities. It seems that the decentralized nature of microservices makes a choreography style more appropriate to achieve such cooperation, where lighter solutions based on asynchronous events are generally used. However, a microservice composition based on choreography distributes the flow logic of the composition among microservices making further analysis and updating difficult, i.e. there is not a big picture of the composition that facilitates these tasks. Business Process Model and Notation (BPMN) is the OMG standard developed to represent Business Processes (BPs), being widely used to define the big picture of such compositions. However, BPMN is usually considered in orchestration-based solutions, and orchestration can be a drawback to achieve the decoupling pursued by a microservice architecture …", "num_citations": "9\n", "authors": ["1509"]}
{"title": "Software Engineering for Pervasive Systems. Applying Models, Frameworks and Transformations\n", "abstract": " Current pervasive systems are developed ad-hoc or using implementation frameworks. These approaches could be not enough when dealing with large and complex pervasive systems. In order to improve the productivity and reduce the number of errors, we propose to apply the newest trends in software engineering (the MDA and Software Factories approaches) to the development of pervasive systems. These strategies propose to use models for automatically generating the final system, and not only for generating documentation or for guiding the implementation process. The application of model driven approaches to the development of pervasive systems can provide many relevant benefits. We have developed such a kind of method providing several assets for supporting the development process.", "num_citations": "9\n", "authors": ["1509"]}
{"title": "Generación de aplicaciones web basadas en procesos de negocio mediante transformación de modelos\n", "abstract": " Las aplicaciones Web están evolucionando hacia un entorno inter-organizacional donde aparecen nuevos requisitos (integración de aplicaciones mediante la composición de procesos de negocio de diferentes organizaciones) que deben abordarse en el proceso de desarrollo de aplicaciones. En este trabajo se propone una extensión al método de ingeniería Web OOWS para el desarrollo de aplicaciones Web basadas en procesos de negocio. En esta extensión se ha tenido en cuenta tanto la existencia de tareas manuales llevadas a cabo por participantes humanos como el hecho de que en un contexto B2B los procesos normalmente involucran el uso de funcionalidad distribuida, normalmente proporcionada a través de Servicios Web. Mediante la aplicación del estándar QVT para la transformación de modelos obtenemos a partir de una especificación de proceso de negocio tanto (1) las interfaces gráficas que permiten la ejecución de los procesos como (2) la especificación ejecutable del proceso en WS-BPEL.", "num_citations": "9\n", "authors": ["1509"]}
{"title": "A conceptual modeling approach for the design of web applications based on services\n", "abstract": " Current design techniques for distributed business processes based on services focus mainly on functionality concerns and forget about the navigational aspects of Web applications. Moreover, present Web engineering methods offer solid proposals mainly for the development of monolithic and isolated Web applications. We consider highly important to bring together both worlds and to present a complete methodological solution based on conceptual modeling. The present work shows, in the context of the OOWS Web engineering method, the models and methodological steps for the specification, development and automatic generation of Web applications that interact with other external applications based on services.", "num_citations": "9\n", "authors": ["1509"]}
{"title": "A methodological approach for incorporating adaptive navigation techniques into web applications\n", "abstract": " The incorporation of Adaptive Navigation techniques into Web applications is a complex task. The conceptual specification of the navigation must consider the preferences and needs of users, as well as different implementation alternatives from the same navigational structure. However, there is a lack of methods that rule this integration. This work proposes a methodological approach that allow describing adaptive navigation characteristics of a Web application at a high abstraction level. We introduce a User Modelling process and a set of concepts that permit to incorporate two types of adaptive navigation techniques into the navigational description of a Web application. These techniques select and sort the links of a page, according to their relevance for a given user. The steps of the methodology are illustrated through a case study.", "num_citations": "9\n", "authors": ["1509"]}
{"title": "An automatic code generation process for dynamic specialization based on design patterns and formal techniques\n", "abstract": " In this work, we present an automatic code generation process from conceptual models. This process incorporates the use of design patterns in OO-Method [12],[13], an automatic software production method, which is built on a formal object-oriented model called OASIS [14]. Our approach defines a precise mapping between conceptual patterns, design patterns and their implementation. Design patterns make code generation process easy because they bring the problem space to the solution space. In order to understand these ideas, we introduce a complete code generation of conceptual models that have dynamic specialization relationships. This proposal can be incorporated into CASE tools, making the automation of the software production process feasible.", "num_citations": "9\n", "authors": ["1509"]}
{"title": "Exploiting user feedback for adapting mobile interaction obtrusiveness\n", "abstract": " Ubiquitous computers, such as mobile devices, enable users to always be connected to the environment, making demands on one of the most precious resources of users: human attention. Thus, ubiquitous services should be designed in a considerate manner, demanding user attention only when it is actually required according to user needs. However, as user needs and preferences can change over time, we aim at improving the initial decisions by learning from user’s feedback through experience. We present a method for adapting interaction obtrusiveness automatically based on user’s reaction. Instead of asking the user to re-define his preferences about interaction obtrusiveness configurations, we learn them by means of the received feedback in a way that maximizes user’s satisfaction in a long-term use.", "num_citations": "8\n", "authors": ["1509"]}
{"title": "Adapting BPMN to public administration\n", "abstract": " BPMN was originally defined to provide a process modelling notation that could be easily understood by all business stakeholders. However, when using this notation within a particular domain, as is the case with public administration, some limitations in the original notation become apparent. Documents play a very important role in the public domain. They become first-class citizens and standard BPMN notation is not sufficient to address certain common situations. This paper presents the extension defined for the BPMN 1.1 notation which is to be used to define process models in the Valencian public administration in Spain. In addition to this extension, the paper also presents how BPMN has been integrated into a software development methodology.", "num_citations": "8\n", "authors": ["1509"]}
{"title": "Model centric approach of web services composition\n", "abstract": " The development of composite Web Services is being specified in a more declarative way than imperative programming. In this context, conceptual modeling has been the most accepted solution. Conceptual modeling of Web services has been done using behavioral models (like activity diagrams) considering mainly the dynamic view. We believe that, besides the dynamic aspects, the models should capture structural requirements between web service operations. In this way, behavioral models could be complemented with a structural model. In this paper we introduce a Web service composition modeling solution, following the MDA approach, considering both -structural and dynamic properties-enriched with semantic constraints in order to automatically generate composite Web services implemented in BPEL.", "num_citations": "8\n", "authors": ["1509"]}
{"title": "Describing adaptive navigation requirements of web applications\n", "abstract": " This work introduces a proposal to capture adaptive navigation characteristics of a Web Application in the Requirements Specification stage. Tasks that users must be able to achieve are identified and described, considering the navigational adaptations that are needed to fulfill them. By applying a given code generation strategy, it is possible to obtain fully operative prototypes of the adaptive web application from its requirements specification.", "num_citations": "8\n", "authors": ["1509"]}
{"title": "A Model Driven Approach to Design Web Services in a Web Engineering Method.\n", "abstract": " Probably one of the most difficult tasks in the development of a Service Oriented Architecture (SOA) is how to obtain well designed Web Services. In this work, we present an extension of a web engineering method (OOWS) to provide a methodological guide that allow us to identify well designed Web services in a SOA from the OOWS conceptual model.", "num_citations": "8\n", "authors": ["1509"]}
{"title": "High-resolution analysis of cell-state transitions in yeast suggests widespread transcriptional tuning by alternative starts\n", "abstract": " The start and end sites of messenger RNAs (TSSs and TESs) are highly regulated, often in a cell-type-specific manner. Yet the contribution of transcript diversity in regulating gene expression remains largely elusive. We perform an integrative analysis of multiple highly synchronized cell-fate transitions and quantitative genomic techniques in Saccharomyces cerevisiae to identify regulatory functions associated with transcribing alternative isoforms. Cell-fate transitions feature widespread elevated expression of alternative TSS and, to a lesser degree, TES usage. These dynamically regulated alternative TSSs are located mostly upstream of canonical TSSs, but also within gene bodies possibly encoding for protein isoforms. Increased upstream alternative TSS usage is linked to various effects on canonical TSS levels, which range from co-activation to repression. We identified two key features linked to these outcomes: an interplay between alternative and canonical promoter strengths, and distance between alternative and canonical TSSs. These two regulatory properties give a plausible explanation of how locally transcribed alternative TSSs control gene transcription. Additionally, we find that specific chromatin modifiers Set2, Set3, and FACT play an important role in mediating gene repression via alternative TSSs, further supporting that the act of upstream transcription drives the local changes in gene transcription. The integrative analysis of multiple cell-fate transitions suggests the presence of a regulatory control system of alternative TSSs that is important for dynamic tuning of gene expression. Our work provides a framework for understanding …", "num_citations": "7\n", "authors": ["1509"]}
{"title": "Building ubiquitous business process following an mdd approach\n", "abstract": " Information systems supporting business processes can be improved by the use of Ubiquitous Computing (Ubicomp) technologies. However, the dynamism of business processes and the complexity in the construction of Ubicomp systems requires an adequate method for its development. This paper proposes a model driven development method to obtain this kind of systems in a systematic way, abstracting technological details and automating its implementation. The method is presented in depth with a case study of the supply chain of a pharmaceutics company where Ubicomp is used to improve the cold chain and ease the inventory tasks.", "num_citations": "7\n", "authors": ["1509"]}
{"title": "Conceptual modeling of service composition using aggregation and specialization relationships\n", "abstract": " Web service development and composition are mainly realized using programming languages. The high demand of productivity in the development of composite Web service requires different approaches. Conceptual modeling could be a solution. In this work we present an approach to conceptual modeling of Web service composition. Considering that a composite Web service is a way of implementing functionality reuse, we propose to use aggregation and specialization relationships (at conceptual level) with a precise semantics as mechanisms to allow the composition characterization. These conceptual models could be included in other methods (as Web engineering methods) or models in order to capture the integration requirements needed to define collaborative applications.", "num_citations": "7\n", "authors": ["1509"]}
{"title": "Variability in autonomic computing\n", "abstract": " Autonomic Computing transfers maintenance responsibilities to the software itself. By automating tasks such as installation, healing, or updating, system operation is simplified at the expense of increasing its internal complexity [1]. A system with autonomic capabilities installs, configures, tunes, and maintains its own components at run-time.", "num_citations": "6\n", "authors": ["1509"]}
{"title": "Automating the development of information systems with the MOSKitt open source tool\n", "abstract": " Modeling Software Kit (MOSKitt) is a FREE CASE tool, built on Eclipse, which is being developed by the Conselleria de Infraestructuras, Territorio y Medio Ambiente. Its main goal is to provide the necessary tools for supporting a complete Model Driven Software Development (MDSD) Process. To achieve such support MOSKitt has been endowed with a set of graphical model editors (such as BPMN, UML, User Interface Design or Data Base Design) and Model Transformations (M2M and M2T) that turn it not just as a Modeling Tool but also as a powerful environment to automate the full development process. In addition, MOSKitt's plugin architecture allows using MOSKitt as a real CAME environment. This feature enables specifying and implementing different software development processes based on the specific requirements of software company life cycles and processes.", "num_citations": "6\n", "authors": ["1509"]}
{"title": "Improving communication in requirements engineering activities for web applications\n", "abstract": " We present a requirements engineering environment which provides techniques and tools to improve communication in Requirements Engineering activities. First, a technique based on requirements ontologies is proposed to allow customers to describe their needs. This technique is supported by a tool. This tool provides analysts with structured descriptions of the customers’ needs that facilitate analysts to understand the problem to be solved. Next, both a model-to-text transformation and a model-to-model transformation are introduced to automatically obtain a textual requirements specification and a task-based requirements model respectively. The textual specification facilitates customers to validate requirements. The task-based requirements model facilitates programmers to interpret the requirements specification.", "num_citations": "6\n", "authors": ["1509"]}
{"title": "Web application development focused on BP specifications\n", "abstract": " Business Process specification can be used during the software development process for different purposes. In this paper we present a Web Engineering approach that has been extended to allow the construction of Process Driven Web Applications. In this approach, BP specifications are defined at the PIM level and are used to produce (1) the proper navigational models that support the execution of these processes and (2) the executable definition that will allow automating the original Business Process.", "num_citations": "6\n", "authors": ["1509"]}
{"title": "Physical-Virtual Connection in Ubiquitous Business Processes.\n", "abstract": " Ubiquitous Computing (Ubicomp) when applied to organizations can improve their Business Processes. An example of improvement is the integration of real world objects in the Information System. This reduces inconsistencies in the information and improves information acquisition rates. Automatic identification is the key technology to achieve this paradigm shift. The present work inspects the relevance of the identification concept for Business Processes supported by Ubicomp technologies and presents a conceptual framework to define the elements involved in the identification process. Taking into account that Business Processes tend to be very dynamic, it is important to have technological-independent definitions in order to enable the evolution of systems. The presented framework is independent of the underlying technology, in order not to be locked with one particular solution.", "num_citations": "5\n", "authors": ["1509"]}
{"title": "V.: Building business process driven web applications\n", "abstract": " The Internet has turned to be one the most common platform for the development of applications. In addition, sometimes the specification of these applications is given to web developers in the form of Business Processes (BP), and from this specification they are asked to develop the corresponding Web Application. In this situation, Web Engineering Methods should provide a way in which these specifications could be taken and be transformed into a Web Application that gives support to the process execution. Furthermore, when we are talking about B2B applications, we have to take into account that these BP usually involve the use of distributed functionality where different partners collaborate to accomplish an agreed goal. Therefore, in this work we provide a method for the automatic generation of Web Applications that give support to BP specifications. For this purpose, we generate from a BP definition the Navigation (web pages) and the WS-BPEL executable description that implements the entire process. 1", "num_citations": "5\n", "authors": ["1509"]}
{"title": "Un framework para la simulación de sistemas pervasivos\n", "abstract": " Los sistemas pervasivos están formados por distintos dispositivos encargados de proporcionar funcionalidad a los usuarios. Durante el desarrollo de sistemas pervasivos es necesario prototipar y probar el sistema final. En muchos casos no se dispone de todos los dispositivos en el momento de la prueba, por lo que proporcionar dispositivos virtuales permitirá ejecutar el sistema en un entorno de simulación. Este trabajo propone un framework para el desarrollo de dispositivos virtuales y la simulación de sistemas pervasivos. El framework, desarrollado utilizando la tecnología OSGi, proporciona:(1) mecanismos para el desarrollo de dispositivos virtuales (que simulen dispositivos reales) y (2) una interfaz gráfica para monitorizar el estado de los dispositivos y modificar la información sobre el entorno que éstos transmiten al sistema. Este framework nos está permitiendo desarrollar y probar aplicaciones pervasivas en el contexto de nuestro método de modelado y generación automática de sistemas pervasivos.", "num_citations": "5\n", "authors": ["1509"]}
{"title": "MDA a Debate\n", "abstract": " La propuesta MDA del OMG está tomando cada vez más fuerza en el Desarrollo de Software actual. El interés suscitado para su aplicación industrial contrasta con la precariedad y/o indefinición de la especificación de la propuesta, donde existen algunas cuestiones que pueden resultar confusas. Este trabajo pretende introducir un debate sobre MDA, identificando algunas cuestiones “oscuras” ya la vez importantes para su aplicabilidad. Esta discusión se apoya en la visión que diversos autores relevantes en el área ofrecen en sus publicaciones y tutoriales. Concretamente se analiza la naturaleza de MDA, la aportación de esta propuesta al Desarrollo de Software, la naturaleza de las transformaciones entre modelos y su grado de automatización, y el concepto de plataforma. Como conclusión del trabajo, se proporciona y discute una interpretación particular de estas cuestiones que puede ser de ayuda a la comunidad del Desarrollo de Software. Las conclusiones de nuestro trabajo tienen como propósito actuar como semilla para activar la discusión en ámbitos académicos e industriales.", "num_citations": "5\n", "authors": ["1509"]}
{"title": "The Conceptual Model Is The Code. Why Not?\n", "abstract": " The selection of the paper entitled “OO-METHOD: An OO Software Production Environment Combining Conventional and Formal Methods” for this book on Advanced Information Systems Engineering allows us to reflect on the research context where the work was developed and presented (in “CAiSE 1997”) and to introduce its main contributions, how they have evolved with time and what influence the approach could have in the emergence of the Model-Driven Engineering domain. As the main goal was to provide a Software Process that should be fully Conceptual Model-based, the central message of this chapter is still the same 16 years later: the Conceptual Model must be the key software artefact of a sound, correct and complete Software Production Process. Novel approaches were required to generate a sound software production process, and they should use conceptual models as the key software …", "num_citations": "4\n", "authors": ["1509"]}
{"title": "Change patterns for process families\n", "abstract": " The increasing adoption of process-aware information systems (PAISs), together with the variability of business processes (BPs), has resulted in large collections of related process model variants (i.e., process families). To effectively deal with process families, several proposals (e.g., C-EPC, Provop) exist that extend BP modeling languages with variability-specific constructs. While fostering reuse and reducing modeling efforts, respective constructs imply additional complexity and demand proper support for process designers when creating and modifying process families. Recently, generic and language-independent adaptation patterns were successfully introduced for creating and evolving single BP models. However, they are not sufficient to cope with the specific needs for modeling and evolving process families. This paper suggests a complementary set of generic and language-independent change patterns specifically tailored to the needs of process families. When used in combination with existing adaptation patterns, change patterns for process families will enable the modeling and evolution of process families at a high-level of abstraction. Further, they will serve as reference for implementing tools or comparing proposals managing process families.", "num_citations": "4\n", "authors": ["1509"]}
{"title": "Providing methodological support to incorporate presentation properties in the development of web services\n", "abstract": " Nowadays, Web services provide only raw data. However, Web service consumers need Web services with new features that allow them to obtain data with specific presentation properties. In this paper, we present an approach to develop Web services that incorporate presentation properties from a methodological point of view. To do this, we based on the models proposed by the model-driven development method OO-Method / OOWS. To document our approach, we apply our ideas to a real case study of a Web application to manage University Research Groups.", "num_citations": "4\n", "authors": ["1509"]}
{"title": "Towards the Integration of Data and Functionality in Web Applications. A Model Driven Approach.\n", "abstract": " Web Engineering methods have evolved during the last years to deal with new requirements that have arisen as a natural evolution of Web Applications. However, a new challenge that has been little handled by some of these methods is the data and functionality integration with third-party systems. Relying on the basic principles of the OMG Model Driven Architecture, we present a solution to achieve this integration at the conceptual modelling level. Therefore, solving the integration problem at this level of abstraction let us (1) give a general solution that is not tied to any particular implementation technology and (2) to handle external components at the conceptual modelling phase. To achieve this goal we present a new model that characterizes external functionality at a high level of abstraction.", "num_citations": "4\n", "authors": ["1509"]}
{"title": "A model driven method for the integration of web applications\n", "abstract": " Currently, the software industry is demanding the construction of Web applications that are built integrating functionality from third party systems. Web engineering methods are not properly dealing with this open strategy. Instead, they only provide methodological support for the implementation of isolated Web applications. The solutions that are based on a specific technology do not solve the integration problem at all. To provide an adequate solution we have to tackle with the integration issue at the problem space, avoiding ad-hoc solutions. We should provide a set of mechanisms that allow to model integration at a high level of abstraction, independently of the underlying technology in which these services are provided. Following the MDA principles, we present a model driven approach that makes a clear separation of concerns in the Web development process. Our method includes a step where the integration …", "num_citations": "4\n", "authors": ["1509"]}
{"title": "A Methodological Framework to support Model Driven Method Engineering\n", "abstract": " Method designDuring this phase, the method engineer builds the model of the method using SPEM. This model is composed of two parts: the product part and the process part1. The product part represents the artifacts that developers should construct during the execution of a project, and the process part represents the procedures that developers must follow to construct such products. The construction of the method model can be performed from scratch or reusing method fragments stored in a Method Base repository that is implemented", "num_citations": "4\n", "authors": ["1509"]}
{"title": "Transcription-driven chromatin repression of intragenic promoters\n", "abstract": " Progression of RNA polymerase II (RNAPII) transcription relies on the appropriately positioned activities of elongation factors. The resulting profile of factors and chromatin signatures along transcription units provides a “positional information system” for transcribing RNAPII. Here, we investigate a chromatin-based mechanism that suppresses intragenic initiation of RNAPII transcription. We demonstrate that RNAPII transcription across gene promoters represses their function in plants. This repression is characterized by reduced promoter-specific molecular signatures and increased molecular signatures associated with RNAPII elongation. The FACT histone chaperone complex is required for this repression mechanism. Genome-wide mapping of Transcription Start Sites (TSSs) reveals thousands of discrete intragenic TSS positions in FACT mutants. Histone 3 lysine 4 mono-methylation poises exonic sites to initiate RNAPII transcription in FACT mutants. Uncovering the mechanism for intragenic TSS repression through the act of RNAPII elongation has important implications for understanding pervasive RNAPII transcription and the regulation of transcript isoform diversity.", "num_citations": "3\n", "authors": ["1509"]}
{"title": "Self-adaptive unobtrusive interactions of mobile computing systems\n", "abstract": " In Pervasive Computing environments, people are surrounded by a lot of embedded services. Since pervasive devices, such as mobile devices, have become a key part of our everyday life, they enable users to always be connected to the environment, making demands on one of the most valuable resources of users: human attention. A challenge of the mobile computing systems is regulating the request for users’ attention. In other words, service interactions should behave in a considerate manner by taking into account the degree to which each service intrudes on the user’s mind (ie, the degree of obtrusiveness). The main goal of this paper is to introduce self-adaptive capabilities in mobile computing systems in order to provide non-disturbing interactions. We achieve this by means of an software infrastructure that automatically adapts the service interaction obtrusiveness according to the user’s context. This …", "num_citations": "3\n", "authors": ["1509"]}
{"title": "A Mobile End-User Tool for Service Compositions\n", "abstract": " With the advent of Web 2.0 and the massive adoption of smartphones, end-users are more keen to actively participate in the creation of content for the Internet. In addition, the big amount of data that the Internet of Things can bring to it, establishes an ideal framework to allow end-users not just consuming data but also creating new valueadded services. To achieve this, in this work we propose the development of an end-user tool for smartphones capable of composing services that are available in the Internet.", "num_citations": "3\n", "authors": ["1509"]}
{"title": "BP Variability Case Studies Development using different Modeling Approaches\n", "abstract": " Variability in Business Process modeling has already been faced by different authors from the literature. Depending on the context in which each author faces the modeling problem, we find different approaches (C-EPC, C-YAWL, FEATURE-EPC, PESOA, PROVOP, or WORKLETS). In this report we present four of the most representative approaches (C-EPC, PESOA, PROVOP and WORKLETS) which are presented by means of the different case studies found in the literature.", "num_citations": "3\n", "authors": ["1509"]}
{"title": "From BPMN to BPEL4People:: a MDE approach\n", "abstract": " WS-BPEL is a process execution language that lacks support for human tasks. To overcome this lack, an extension defined on top of this language has been defined. This extension includes two specifications which are BPEL4People and WS-Human Tasks. Workiing at WS-BPEL level demands a lot of technical wnowledge about Web Service technologies, so it is preferred to use a modeliing notation. In this work we use extended BPMN models to derive automatically WS-BPEL executable process descriptions that support human participation in an initeroperable way. This generation has been designed following a Model Driven Engineering approach.", "num_citations": "3\n", "authors": ["1509"]}
{"title": "Servicios Web. Estándares, extensiones y perspectivas de futuro\n", "abstract": " Internet introduce un nuevo entorno donde el software se va a ofrecer y acceder como servicio. Los servicios web proporcionan la plataforma ideal para conseguir la completa integración de los procesos de negocio de una organización con diferentes organizaciones. Este documento presenta una introducción a los servicios web, las tecnologías y estándares básicos (SOAP, WSDL, UDDI) para el correcto desarrollo de los servicios web. Además se presenta, con perspectivas de futuro, una visión general de las distintas extensiones que se están desarrollando en la actualidad.", "num_citations": "3\n", "authors": ["1509"]}
{"title": "Un Framework para la implementación de relaciones de asociación, agregación y composición en UML\n", "abstract": " Este trabajo propone un framework para la implementación de relaciones de asociación, agregación y composición. Para ello se presenta una interpretación semántica de estos conceptos que permite eliminar ambigüedades introducidas por UML. Esta interpretación se realiza a través de un conjunto de propiedades que permiten caracterizar estas relaciones. Una vez definida la semántica de estas relaciones, se propone un framework basado en patrones de diseño que permite obtener su representación software en función de las propiedades que las caracterizan. El framework propuesto proporciona una solución de calidad, introduciendo beneficios considerables respecto otras aproximaciones de implementación existentes en la actualidad.", "num_citations": "3\n", "authors": ["1509"]}
{"title": "MDA aplicado: Una gramática de grafos para la transformación de relaciones de asociación\n", "abstract": " Las transformaciones entre modelos constituyen un elemento clave que deben proporcionar los métodos basados en MDA. Este trabajo presenta un enfoque metodológico para la definición de transformaciones entre modelos. Nuestro enfoque propone el uso de gramáticas de grafos para realizar una descripción precisa y operativa de las transformaciones entre modelos. Esta propuesta se ha materializado desarrollando una gramática que permite la transformación de un modelo de relaciones de asociación, agregación y composición (PIM) a una representación software (PSM), haciendo uso de un framework basado en patrones de diseno que permite obtener una representación software para estas relaciones.", "num_citations": "3\n", "authors": ["1509"]}
{"title": "On the influence of model fragment properties on a machine learning-based approach for feature location\n", "abstract": " Context:Leveraging machine learning techniques to address feature location on models has been gaining attention. Machine learning techniques empower software product companies to take advantage of the knowledge and the experience to improve the performance of the feature location process. Most of the machine learning-based works for feature location on models report the machine learning techniques and the tuning parameters in detail. However, these works focus on the size and the distribution of the data sets, neglecting the properties of their contents.Objective:In this paper, we analyze the influence of three model fragment properties (density, multiplicity, and dispersion) on a machine learning-based approach for feature location.Method:The analysis of these properties is based on an industrial case provided by CAF, a worldwide provider of railway solutions. The test cases were evaluated through a …", "num_citations": "2\n", "authors": ["1509"]}
{"title": "A social network for supporting end users in the composition of services: definition and proof of concept\n", "abstract": " Nowadays, end users are surrounded by plenty of services that are somehow supporting their daily routines and activities. Involving end users into the process of service creation can allow end users to benefit from a cheaper, faster, and better service provisioning. Even though we can already find tools that face this challenge, they consider end users as isolate individuals. In this paper, we investigate how social networks can be used to improve the composition of services by end users. To do so, we propose a graph-based definition of a social structure, and analyse how social connections can be exploited to both facilitate end users to discover services through browsing these connections, and recommend services to end users during the composition activity. As proof of concept, we implement and evaluate the proposed social network in the context of EUCalipTool, a mobile end-user environment for …", "num_citations": "2\n", "authors": ["1509"]}
{"title": "Supporting a Hybrid Composition of Microservices. The EUCalipTool Platform.\n", "abstract": " To provide complex and elaborated functionalities, Microservices may cooperate with each other either by following a centralized (orchestration) or decentralized (choreography) approach. It seems that the decentralized nature of microservices makes the choreography approach more appropriate to achieve such cooperation, where lighter solutions based on events and message queues are used. However, orchestration through the usage of a process model facilitates the analysis of the composition when this is modified. To benefit from the goodness of these two approaches, this paper presents a hybrid solution based on the choreography of business process pieces that are obtained from a previously defined description of the complete microservice composition. To support this solution, the EUCalipTool platform is presented.", "num_citations": "2\n", "authors": ["1509"]}
{"title": "IoT Compositions by and for the Crowd\n", "abstract": " The Internet of Things (IoT) offers a new eco-system of heterogeneous and distributed services that is available anytime and anywhere and that can be potentially accessed by any properly connected device. However, these available services are usually consumed in isolation, missing the potential that their combined usage can bring as new added-value services. In addition, the massive end-user adoption and usage of smartphones together with their powerful capabilities turn this type of devices into a promising platform to develop and execute these added-value services compositions. Moreover, end-users are nowadays getting more and more familiar with technology, fact that allows them to participate more actively in the development of new types of applications. However, this will not happen until we provide end-users with more powerful and easy-to-use tools. To this end, this paper presents an architectural solution to allow end-users building IoT services compositions by just focusing on domain-logic issues.", "num_citations": "2\n", "authors": ["1509"]}
{"title": "Dealing with variability in process-aware information systems: language requirements, features, and existing proposals\n", "abstract": " The increasing adoption of Process-Aware Information Systems (PAISs), together with the variability of Business Processes (BPs) across different application contexts, has resulted in large process model repositories with collections of related process model variants. To reduce both costs and occurrence of errors, the explicit management of variability throughout the BP lifecycle becomes crucial. In literature, several proposals dealing with BP variability have been proposed. However, the lack of a method for their systematic comparison makes it difficult to select the most appropriate one meeting current needs best. To close this gap, this work presents an evaluation framework that allows analyzing and comparing the variability support provided by existing proposals developed in the context of BP variability. The framework encompasses a set of language requirements as well as a set of variability support features. While language requirements allow assessing the expressiveness required to explicitly represent variability of different process perspectives, variability support features reflect the tool support required to properly cover such expressiveness. Our evaluation framework has been derived based on an in-depth analysis of several large real-world process scenarios, an extensive literature review, and an analysis of existing PAISs. In this vein, the framework helps to understand BP variability along the BP lifecycle. In addition, it supports PAISs engineers in deciding, which of the existing BP variability proposals meets best their needs.", "num_citations": "2\n", "authors": ["1509"]}
{"title": "Feature Modeling to deal with Variability in Business Process Perspectives\n", "abstract": " The construction of Business Process (BP) models entails big challenges, especially when BPs contain many variations. In addition, BPs can be seen from different perspectives, ie, the behavioral (ie, control-flow), the organizational (ie, resources distribution), or the informational (data-flow) perspectives among others. Depending on the context where the BP is taken place, we may found variability in any of these perspectives. Different approaches to model variability in BP perspectives have already been proposed. However, these approaches are highly tight to the modeling language. In addition, they focus mainly on the behavioral perspective. To deal with variability in other BP perspectives in a more flexible manner, this work proposes an approach based on feature models. These models do not only allow enhancing expressiveness regarding BP variability, but also the maintenance and understanding of the resulting process model.", "num_citations": "2\n", "authors": ["1509"]}
{"title": "Understandability Issues of Approaches Supporting Business Process Variability\n", "abstract": " The increasing adoption of Process-Aware Information Systems, together with the reuse of process knowledge, has led to the emergence of process model repositories with large process families, i.e., collections of related process model variants. For managing such related model collections two types of approaches exist. While behavioral approaches take supersets of variants and derive a process variant by hiding and blocking process elements, structural approaches take a base process model as input and derive a process variant by applying a set of change operations to it. However, at the current stage no framework for assessing these approaches exists and it is not yet clear which approach should be better used and under which circumstances. Therefore, to give first insights about this issue, this work compares both approaches in terms of understandability of the produced process model artifacts, which is fundamental for the management of process families and the reuse of their contained process fragments. In addition, the comparison can serve as theoretical basis for conducting experiments as well as for fostering the development of tools managing business process variability.", "num_citations": "2\n", "authors": ["1509"]}
{"title": "Service obtrusiveness adaptation\n", "abstract": " Increasingly, mobile devices play a key role in the communication between users and the services embedded in their environment. All these services compete for the attentional resources of the user. Thus, it is essential to consider the degree in which each service intrudes the user mind (i.e., the obtrusiveness level) when services are designed. In this work we introduce a method for the development of mobile services that can be adapted in terms of obtrusiveness. That is, services can be developed to provide their functionality at different obtrusiveness levels by minimizing the duplication of efforts. In order to define the obtrusiveness level adaptation in a declarative manner we make use of Feature Modeling techniques. An experiment was conducted in order to put in practice the proposal and evaluate the user acceptance for the way in which services are presented.", "num_citations": "2\n", "authors": ["1509"]}
{"title": "Generation of Business Process based Web Applications.\n", "abstract": " This demo presents an extension to the OOWS Web Engineering method for the systematic development of Web applications that provide support to business processes (BP). The extension defined for the original method cover both navigational and architectural issues. Moreover, the kind of BP definitions supported in the extension includes short and long lived processes, which could even comprehend the participation of external systems.", "num_citations": "2\n", "authors": ["1509"]}
{"title": "Dealing with crosscutting concerns in a model based software production method\n", "abstract": " The OO-Method is a Model-based Code Generation Software Production Process that is based on object-oriented concepts. To face it from an Aspect-Oriented domain engineering point of view is the central goal of this paper. We want to do that for two main reasons: i) to fix which conceptual primitives should be required to accomplish aspect-oriented conceptual modeling ii) to define a precise subsequent map between aspect-oriented domain analysis concepts and their corresponding software counterparts in a given software architecture. This would make possible to define a Model Compiler based on aspects-based concepts, properly linking MDA-based proposals with Aspects. With this objective in mind, the paper analyzes the OO-Method approach in the light of Aspect-Oriented Software Development (AOSD), with the concrete intention of finding out whether OO-Method deals with croscutting concerns, and …", "num_citations": "2\n", "authors": ["1509"]}
{"title": "Transformación de relaciones de asociación mediante gramáticas de grafos aplicando MDA\n", "abstract": " Resumen La propuesta MDA (Model Driven Architecture) de OMG constituye un enfoque adecuada para llevar a cabo de manera estructurada y documentada el proceso de generación de código siguiendo una estrategia basada en modelos. Las transformaciones entre modelos constituyen un elemento clave que deben proporcionar los métodos basados en MDA. Este trabajo presenta un enfoque metodológico para la definición de transformaciones entre modelos. Nuestro enfoque propone el uso de gramáticas de grafos para realizar una descripción precisa y operativa de las transformaciones entre modelos. Esta propuesta se ha materializado y validado desarrollando una gramática (implementada mediante el uso de la herramienta AT OM3) que permite la transformación de un modelo de relaciones de asociación, agregación y composición (PIM) a una representación software (PSM), haciendo uso de un framework basado en patrones de diseno que permite obtener una representación software para estas relaciones.", "num_citations": "2\n", "authors": ["1509"]}
{"title": "Tratamiento de excepciones a nivel de modelado conceptual OO\n", "abstract": " Tratamiento de excepciones a nivel de modelado conceptual OO - Dialnet Ayuda ¿En qué podemos ayudarle? × Buscar en la ayuda Buscar Consultar la ayuda Ir al contenido Dialnet Buscar Revistas Tesis Congresos Ayuda Tratamiento de excepciones a nivel de modelado conceptual OO Autores: Eva Campos, Vicente Pelechano Ferragud, Manoli Albert Localización: JISBD 2001. Jornadas de ingeniería del software y bases de datos: 21 y 23 de noviembre de 2001. Almagro (Ciudad Real) / Arantza Illarramendi Echave ( ed. lit. ), Óscar Díaz García ( ed. lit. ), Mario G. Piattini Velthuis ( ed. lit. ), 2001, ISBN 84-699-6275-2, págs. 311-326 Idioma: español Texto completo no disponible (Saber más ...) Fundación Dialnet Acceso de usuarios registrados Imagen de identificación Identificarse ¿Olvidó su contraseña? ¿Es nuevo? Regístrese Ventajas de registrarse Dialnet Plus Más información sobre Dialnet Plus Opciones …", "num_citations": "2\n", "authors": ["1509"]}
{"title": "Una Aproximación Dirigida por Modelos para el Diseño de Servicios Web en el ámbito de un Método de Ingeniería Web. I Jornadas Científico-Técnicas en Servicios Web, JSWEB 2005\n", "abstract": " Probablemente una de las tareas más difíciles en el desarrollo de una Arquitectura Orientada a Servicios (SOA) sea cómo diseñar adecuadamente servicios Web. En este trabajo, presentamos una extensión de un método de ingeniería Web (OOWS) que proporciona una guía metodológica que nos permite, siguiendo un enfoque dirigido por modelos, identificar y diseñar servicios Web, sus operaciones y argumentos en una arquitectura SOA, tomando como punto de partida los modelos conceptuales de OOWS.", "num_citations": "2\n", "authors": ["1509"]}
{"title": "Servicios adaptive-ready para la reconfiguración dinámica de arquitecturas de microservicios\n", "abstract": " Las arquitecturas de microservicios ofrecen un enfoque para la ingenierıa de sistemas complejos y distribuidos en donde la escalabilidad y disponibilidad de las soluciones son un factor crıtico. En la última década han surgido herramientas (orquestadores) orientadas a monitorizar y mantener de manera automática estas infraestructuras para garantizar la calidad del servicio. Sin embargo, estos orquestadores no están disenados para gestionar automáticamente cambios arquitectónicos sobre la configuración de servicios, necesarios bajo ciertas condiciones operativas. Este trabajo promueve la aplicación de la computación autónoma (a través del uso de bucles de control) como estrategia para la reconfiguración dinámica de arquitecturas de microservicios. Para ello, se introduce el concepto de servicio adaptive-ready, como un microservicio que ofrece un contrato de adaptación disenado para ser usado por los bucles de control. Para ejemplificar la propuesta se utiliza un caso de estudio real en el que se aplican estos principios para desarrollar el sistema informático de una fábrica de producción industrial. Se ha disenado e implementado un conjunto de servicios adaptive-ready y se ha desplegado una arquitectura de microservicios reconfigurable sobre kubernetes.", "num_citations": "1\n", "authors": ["1509"]}
{"title": "Modeling and “smart” prototyping human-in-the-loop interactions for AmI environments\n", "abstract": " Autonomous capabilities are required in AmI environments in order to adapt systems to new environmental conditions and situations. However, keeping the human in the loop and in control of such systems is still necessary because of the diversity of systems, domains, environments, context situations, and social and legal constraints, which makes full autonomy a utopia within the short or medium term. Human-system integration introduces an important number of challenges and problems that have to be solved. On the one hand, humans should interact with systems even in those situations where their attentional, cognitive, and physical resources are limited in order to perform the interaction. On the other hand, systems must avoid overwhelming the user with unnecessary actions. Therefore, appropriate user-centered methods for AmI development should be used to help designers analyze and design human-in …", "num_citations": "1\n", "authors": ["1509"]}
{"title": "Towards the composition of services by end-users\n", "abstract": " Nowadays, we live surrounded by heterogeneous and distributed services that are available to people anytime and anywhere. Even though these services can be used individually, it is through their synchronized and combined usage that end-users are provided with added value. However, existing solutions to service composition are not targeted at ordinary end-users. In fact, these solutions require technical knowledge to deal with the technological heterogeneity in which they are offered to the market. To this end, the paper presents a tool-supported platform that is aided by: (1) EUCalipTool, an end-user mobile tool that implements a Domain Specific Visual Language, which has been specifically designed to compose services on mobile devices; (2) a Faceted Service Registry, which plays the role of gateway between service implementations and end-users, hiding technological issues from the latter when …", "num_citations": "1\n", "authors": ["1509"]}
{"title": "Software Knowledge Representation to Understand Software Systems\n", "abstract": " A software development process involves numerous persons, including customers, domain experts, software engineers, managers, evaluators and certifiers. Together, they produce some software that satisfies its requirements and its quality criteria at a certain point in time. This software contains faults and flaws of different levels of severity and at different phases of its production (specification, design, etc.) so maintenance is needed in order to correct it. Perfective and adaptive maintenance is also needed to cope with changes in the environment or with new requirements, e.g. new functionalities. In this work, we introduce the Persistent Knowledge Monitor (PKM), which is being developed within the DECODER H2020 project for handling (i.e. storing, retrieving, merging and checking for consistency) all kinds of knowledge and information related to a software project. The PKM will be part of a platform capable of …", "num_citations": "1\n", "authors": ["1509"]}
{"title": "Diseñando la Participación del Humano en los Sistemas Autónomos\n", "abstract": " Estamos entrando gradualmente en la era de los sistemas que pretenden dotar de capacidades de computación autónoma a servicios cotidianos. La búsqueda de la autonomía completa es un reto que se está persiguiendo en diversos ámbitos de aplicación y sectores industriales. Sin embargo, la realidad es que la variedad de sistemas, dominios, entornos y contextos de ejecución, restricciones legales y sociales, hace vislumbrar un mundo donde esta autonomía completa será una utopía a corto y medio plazo. En los escenarios en que el sistema autónomo no pueda automatizar completamente sus tareas, se requerirá pues de la participación humana. Desde un punto de vista ingenieril la colaboración entre el humano y estos sistemas (Human in the Loop) introduce un considerable número de retos y problemas a resolver. En este trabajo se identifican los retos tecnológicos que introduce esta colaboración humano-sistema, y se define un marco conceptual que identifica los aspectos a considerar desde un punto de vista abstracto e ingenieril.", "num_citations": "1\n", "authors": ["1509"]}
{"title": "A Software Factory for Pervasive Systems Development\n", "abstract": " The rise in the number and complexity of pervasive systems is a fact. Pervasive systems developers need advanced development methods in order to build better systems in an easy way. Software factories and model-driven architecture (MDA) are two important trends in the software engineering field. This chapter applies the guidelines and strategies described by these proposals in order to build a methodological approach for the development of pervasive systems. Software factories are based on the definition of software families supported by frameworks. Individual system requirements are specified by means of domain-specific languages. Following this strategy, our approach defines a domain-specific language for pervasive systems (PervML). In order to support our modeling language, we introduce a software architecture for pervasive systems, which is implemented by a software framework using OSGi …", "num_citations": "1\n", "authors": ["1509"]}
{"title": "Involucrando al humano en el bucle de control de sistemas auto-adaptativos\n", "abstract": " La auto-adaptación juega un papel clave en los sistemas software del futuro, los cuales están formados por complejos ecosistemas heterogéneos teniendo que ser capaces de adaptarse continua y autónomamente, en tiempo de ejecución, a su contexto (nuevas condiciones del entorno, situaciones impredecibles, necesidades cambiantes de los usuarios, nuevos recursos, etc.). Aunque estas adaptaciones deben gestionarse de forma autónoma, la experiencia demuestra que los humanos no pueden excluirse completamente del bucle de adaptación, ya sea para solucionar conflictos difıciles de resolver autónomamente o para mejorar las estrategias de adaptación con su realimentación. En este artıculo se abre una lınea de trabajo para involucrar al humano en el bucle de control de los sistemas auto-adaptativos (“human in the loop”) de forma que éstos puedan participar en la toma de decisiones de adaptación, siempre intentando maximizar la autonomıa y evitar sistemas intrusivos y molestos.", "num_citations": "1\n", "authors": ["1509"]}
{"title": "Moskitt4SPL: Tool support for developing self-adaptive systems\n", "abstract": " Increasingly, software needs to dynamically adapt its behavior at runtime in response to changing conditions in the supporting computing, communication infrastructure, and in the surrounding physical environment [6]. Self-adaptive software systems are able to reconfigure at run-time to adapt to changes. The implementation of ad-hoc solutions to cover all possible system configurations and reconfigurations is not feasible. Dynamic Software Product Lines (DSPLs) provide a systematic basis for the engineering of selfadaptive systems [4]. A key characteristic in DSPLs is the intensive use of variability at run-time in order to adapt the system configuration caused by an environment change. Following this approach, a self-adaptive system can be seen as a family of feasible system configurations with a mechanism to move from one configuration to another. The development of self-adaptive systems involves great complexity and becomes a tedious task. We propose Moskitt4SPL (M4SPL) an open-source tool to ease the development of self-adaptive systems. In this tool, we combine model-driven and DSPLs to better cope with the complexities during the construction of self-adaptive systems. M4SPL can be used for modeling systems which make use of variability at run-time in order to adapt the system configuration caused by an environment change. M4SPL provides edition capabilities for Feature Models, Configuration Models and Resolution Models which are part of a self-adaptive system specification. Furthermore, M4SPL incorporates a series of refinements to automatically ensure interesting behavior issues in adaptation specifications. Dealing …", "num_citations": "1\n", "authors": ["1509"]}
{"title": "Model driven method engineering: a case study\n", "abstract": " Ref.#: PROS-TR-2011-1 6 Title: Model Driven Method Engineering: a Case Study Author (s): Mario Cervera, Manoli Albert, Victoria Torres, Vicente Pelechano Corresponding author (s): Mario Cervera, mcervera@ pros. upv. es Manoli Albert, malbert@ pros. upv. es Victoria Torres, vtorres@ pros. upv. es Vicente Pelechano, pele@ pros. upv. es Document version number: 1.0 Final version: Yes Pages: 17 Release date: November 2011", "num_citations": "1\n", "authors": ["1509"]}
{"title": "Orchestrating your Surroundings\n", "abstract": " The Internet of Things envisions real-world environments that are augmented with digital services. With ever greater numbers of devices being added to our surroundings, simplicity is greatly appreciated by users. With the purpose of preventing service behaviour from becoming overwhelming, our project is devoted to dynamically organizing services according to user needs.", "num_citations": "1\n", "authors": ["1509"]}
{"title": "Generation of business process driven web applications by means of model transformations\n", "abstract": " Web applications are evolving towards an inter-organizational environment where new requirements arise (application integration by means of the composition of different enterprise business processes) and where these requirements need to be faced within the application development process. In this work we propose an extension to the OOWS Web Engineering method for the development of Web applications based on business processes. In this extension we have taken into account both the existence of manual tasks carried out by human participants and the fact that processes within a B2B context usually involve the use of distributed functionality, which is normally provided by means of Web Services. Moreover, the use of model transformation techniques (such as the standard QVT) allows us to obtain from business process specifications both (1) the graphical user interfaces that allow the execution of these …", "num_citations": "1\n", "authors": ["1509"]}
{"title": "A Code Generation Process for Role Classes. An approach based on Formal Techniques and Design Patterns\n", "abstract": " In this work, we present an automatic code generation process from conceptual models. This process incorporates the use of design patterns in OO-Method [9], an automatic software production method, which is built on a formal object-oriented model called OASIS [10]. Our approach defines a precise mapping between conceptual patterns, design patterns and their implementation. Design patterns make code generation process easy because they bring the problem space to the solution space. In order to understand these ideas, we introduce a complete code generation of conceptual models that have player/role relationships. This proposal can be incorporated into CASE tools, making the automation of the software production process feasible.", "num_citations": "1\n", "authors": ["1509"]}
{"title": "Object-Oriented Modelling of a Rapid Prototyping Environment based on Oasis\n", "abstract": " This paper presents the OO modelling of a rapid prototyping environment; the description of this environment shows an absolutely homogeneous view of a CASE tool that allows software production in an automatic programming framework; it takes OASIS as the reference model where the notion of metaclass fits in a natural way. We have used OO-Method as the methodological extension to the OASIS model covering the Analysis and design phases, and the KAOS OOADDBMS as the prototyping tool of the specifications built in the design phase.", "num_citations": "1\n", "authors": ["1509"]}
{"title": "Descripción de la Interfaz Gráfica correspondiente a un Entorno de Prototipación Automática basado en OASIS.\n", "abstract": " El objetivo de este documento es presentar la interfaz gráfica de una herramienta totalmente homogénea e integrada en el Modelo Orientado a Objetos que nos va a permitir crear, evolucionar y validar especificaciones que modelen el comportamiento de nuestros sistemas de información. Los aspectos técnicos que dan soporte formal a dicha herramienta aparecen en [Ram95-1, Ram95-2]. Esta interfaz gráfica completa a el entorno de prototipación automática haciendo más fácil y amigable su utilización por parte del usuario. La forma que se ha escogido para presentar dicho entorno gráfico de prototipación automática, es ir navegando por él de la mano de un ejemplo de uso, de forma que los aspectos que fueron presentados durante su formalización irán apareciendo de forma natural a lo largo del documento en lo que sería una posible sesión de un usuario frente a la herramienta.", "num_citations": "1\n", "authors": ["1509"]}
{"title": "Procesos de Negocio Auto-Adaptables al contexto⋆\n", "abstract": " Cuando los procesos de negocio se ejecutan en entornos altamente dinámicos, los continuos cambios de contexto que se dan en dichos entorno obligan a adaptar constantemente estos procesos. Llevar a cabo esta adaptación de forma manual no es factible debido a la complejidad y al alto coste que esto conlleva. Por lo tanto se requiere de técnicas más avanzadas basadas en auto-adaptación. Este tipo de técnicas las encontramos en la Computación Autónoma, la cual ofrece la posibilidad de reconfigurar sistemas en base a cambios en el contexto. Es por esto que en este trabajo se presenta una propuesta para manejar y adaptar automáticamente procesos de negocio variables de acuerdo a cambios en el contexto. Especıficamente, la propuesta permite 1) modelar el proceso previniendo variaciones en el contexto de ejecución y 2) adaptar dicho proceso en función de estas variaciones. Además, se propone la infraestructura software que permite esta adaptación en tiempo de ejecución.", "num_citations": "1\n", "authors": ["1509"]}