{"title": "Automation of SysML activity diagram simulation with model-driven engineering approach\n", "abstract": " This study aims to automate the simulation of activity diagram (AD) in accordance with the OMG SysML specifications. We use the concept of model-driven engineering to transform AD into VHDL-AMS. This transformation is depicted in two transformations: Activity Diagram (AD) to Petri net (PN) and PN to VHDL-AMS. The first step, although has little importance for simulation, is used for formal verification, domain regularly used in addition with simulation. All simulations were implemented with SystemVision. The second step, allows to execute and simulate a system behaviour modelled by an AD, which is conformed to AD meta-model.", "num_citations": "22\n", "authors": ["1436"]}
{"title": "Simulation validation using the compatibility between Simulation Model and Experimental Frame\n", "abstract": " This work illustrates the possibilities associated with the con- cept of experimental frame in the domain of simulation. The experimental frame noted \"EF\" is used to define the environ- ment in which a model will evolve. EF and model are ex- tracted from specifications of the system understudy. Formal language has been utilized for designing EF & model such that model checking techniques can be employed. We have chosen \"I/O automata\", applying the frame to the model im- plies incompatibilities with parts of the model. In this con- tribution we detect these incompatibilities to measure it. Our method will allow a set of metrics evaluate the validity of simulations according to goals of simulation user-defined.", "num_citations": "15\n", "authors": ["1436"]}
{"title": "From sequence diagrams uml 2. x to fd-devs by model transformation\n", "abstract": " This work transforms sequence diagrams to Finite and Deterministic DEVS (FD-DEVS) in Model-Driven En- gineering field. The main goal is the formalisation of behaviours, described with UML sequence diagram, to make verification activity by space state exploration and to make validation activity of a set of traces by simu- lation. In this context, we have chosen to elaborate a model transformation. This paper shows how, after the construction of meta-model for sequence diagrams and for Finite and Deterministic DEVS, it is possible to automate the transformation from one instance of source meta-model to one instance of destination meta-model. The source model is a sequence diagram and the target model is a FD-DEVS component. The destination model is converted into DEVSJava code to simulate its execution.", "num_citations": "12\n", "authors": ["1436"]}
{"title": "ACTIVITYDIAGRAM2PETRINET: transformation-based model in accordance with the Omg SySML specifications\n", "abstract": " This study aims to automate the transformation of activity diagrams (AD) to Petri nets (PN). Based on specifications given by the Object Management Group (OMG), we have established transformation rules in ATLAS Transformation Language (ATL) to obtain a model consistent with our Petri Net meta-model (model2model). The semantic of Activity Diagram was verified with PetriNet2Tina transformation (model2text) and has allowed us to verify that was the same in the corresponding PN. This verification is done with the \"model-checker\" TIme petri Net Analyzer (TINA) and Linear Temporal Logic (LTL) language. The user needs only to set up the Activity Diagram from the stakeholder requirements; the transformation and verification is automatic. PetriNet formalism could enable us to provide valuable information on a Activity Diagram, to execute and simulate it.", "num_citations": "8\n", "authors": ["1436"]}
{"title": "ProDEVS: an Event-Driven Modeling and Simulation Tool for Hybrid Systems using State Machines\n", "abstract": " This paper introduces a new event-driven modeling and simulation tool for the simulation of hybrid systems. The particularity of this software called ProDEVS lies in its graphical language to define model components behaviour. This graphical language customizes state machines for DEVS and quantized based numerical methods. In this paper, syntax and operational semantic of the language are explained, and a mapping from DEVS to this language is illustrated across two simple examples in discrete-event and continuous domain. Finally a complete hybrid system is modeled and simulated to show the usability and the efficiency of this model.", "num_citations": "6\n", "authors": ["1436"]}
{"title": "A simulation fidelity assessment framework\n", "abstract": " A proposition for the correct by design of abstraction with respect to the simulation objectives based on the concepts of approximate bisimulation, Galois connections and ontology is presented. It addresses the fundamental problem of fidelity in simulation, namely, given a class of models and a class of properties that must be preserved, how to extract modeling abstractions that preserves the properties of interest which allows to conclude about the system being simulated. Fidelity and validity are explained in the framework of the experimental frame and discussed in the context of modeling abstractions. A formal method for the fidelity quantification is explained by abstraction inclusion relations for syntactic and semantic compatibility. Abstraction inclusion in dynamic systems for semantic compatibility by approximate bisimulation and the problem of finding surjection maps compatible with simulation objectives are …", "num_citations": "5\n", "authors": ["1436"]}
{"title": "Formal compatibility of experimental frame concept and FD-DEVS model\n", "abstract": " This paper shows how a Finite and Deterministic (FD-DEVS) model can be integrated within the concept of experimental frame. Experimental frame (EF) is used to define the environment that will be able to achieve desired simulation execution. These execution are extracted from the specifications of the studied system and included on specific part of the EF (the acceptor). This EF is defined with FD-DEVS like the model. FD-DEVS network permits to couple together the EF and the model. Applying an EF to a model implies in some case a non commandability of part of the model. This leads us to a second contribution where we formalise FD-DEVS model restriction. This restriction permits to apply less capable EF than the model itself. EF concept is illustrated with two examples, a running example of a toaster and a case study of an intelligent cruise controller implemented in UPPAAL tools.", "num_citations": "5\n", "authors": ["1436"]}
{"title": "A new specification-based qualitative metric for simulation model validity\n", "abstract": " Informal validation techniques such as simulation are extensively used in the development of embedded systems. Formal approaches such as model-checking and testing are important means to carry out Verification and Validation (V&V) activities. Model-checking consists in exploring all possible behaviors of a model in order to perform a qualitative and quantitative analysis. However, this method remains of limited use as it runs into the problem of combinatorial explosion. Testing and model-checking do not take into account the context of use objectives of the model. Simulation overcomes these problems but it is not exhaustive. Submitted to simulation scenarios which are an operational formulation of the V&V activity considered, simulation consists in exploring a subset of the state space of the model. This paper proposes a formal approach to assess simulation scenarios. The formal specification of a model and …", "num_citations": "4\n", "authors": ["1436"]}
{"title": "Consistent behavioral abstractions of experimental frame\n", "abstract": " I. Introduction odelling & Simulation (M&S) is being widely used as a means to conceive, develop and test complex engineering systems. In this Model Based context of systems engineering, Verification and Validation (V&V)", "num_citations": "4\n", "authors": ["1436"]}
{"title": "Verifying trace inclusion between an experimental frame and a model\n", "abstract": " The concept of experimental frame is employed to define circumstances under which a model is simulated and observed. Verifying the applicability of an experimental frame to a model is a key step to ensure that the intended purpose of a simulation can be achieved. We assume that the specification of an experimental frame and a model are two software components in the formal sense. This paper suggests a component-based approach to build the right simulation used for system models verification and validation. We use Input/Output automata for components' behaviour specification. Behavioural signature is employed to specify the experimental frame and model capabilities. Then we formally define applicability conditions with matching rules to verify the trace inclusion between an experimental frame and a model. This approach is illustrated with an application study of an intelligent cruise controller.", "num_citations": "4\n", "authors": ["1436"]}
{"title": "Signature matching applied to simulation/frame duality\n", "abstract": " A component-based framework for modeling and simulation (M&S) is proposed as a solution for handling the complex problem of analyzing the validity of a M&S enabling product. Validity refers to the degree that a model and its behavior are suitable representations of the real system and its behavior with respect to an intended purpose of model application. A set of properties related to simulation limitations and capabilities is proposed. Structured by a formal framework, those properties allows simulation user specifying their expected degree of validity to reach their intended purpose. Then compatibility rules are specified and signature matching is used to check the compatibility between the M&S enabling product and its intended purpose.", "num_citations": "4\n", "authors": ["1436"]}
{"title": "Modeling & simulation framework for the inclusion of simulation objectives by abstraction\n", "abstract": " Abstractions of experimental frame components with respect to simulation objectives are discussed with a hybrid system simulation application. Validity assessment through behavioural compatibility criteria described by the trace inclusion framework is given. The simulation objectives are associated with modelling abstractions by such a framework and described in established modeling & simulation framework. Consistent abstractions from hierarchically ordered posets for stimulant and observer models in experimental frame are discussed. A landing gear example is taken and testability through primary experimental frame component abstractions was observed for the given simulation requirements. The formal framework under development is briefly discussed at the end in the context of applicability and derivability of experimental frame and fidelity of simulation.", "num_citations": "3\n", "authors": ["1436"]}
{"title": "Formal compatibility of experimental frame concept and finite and deterministic DEVS model\n", "abstract": " This paper shows how an FD-DEVS model can be integrated within the concept of experimental frame. Experimental frame (EF) is used to define the environment that will be able to achieve desired states. These states are extracted from the specifications of the studied system and included on specific part of the EF (the acceptor). This EF is defined on FD-DEVS like the model. FD-DEVS network permits to couple together the EF and the model. Applying model to an EF implies in some case a non commandability of part of the model. This leads us to a second contribution where we formalise FD-DEVS model restriction. This restriction permits to apply less capable EF than the model itself. EF concept is illustrated with two examples, a running example of a toaster and a case study of an intelligent cruise controller implemented in UPPAAL tools.", "num_citations": "3\n", "authors": ["1436"]}
{"title": "Evaluation de la validité de la simulation dans le cadre du développement des systèmes embarqués\n", "abstract": " L'objectif de cette étude est de proposer une approche générale d'évaluation de la validité d'une Modélisation et Simulation (M&S) utilisée dans le cadre du développement des systèmes embarqués. Cette approche s'inscrit dans une démarche visant à améliorer la confiance en l'utilisation d'une simulation dont les résultats sont souvent remis en cause sans justification cohérente. Le cadre d'application de l'étude est l'ensemble des produits de simulation d'Airbus. Au regard d'un objectif de validation d'un système, une simulation doit être la plus proche possible du système qu'elle représente. Dans le cycle de développement d'un avion, les simulations doivent être disponibles avant les systèmes eux-mêmes. Si le niveau de validité est trop faible les résultats nécessaires à l'expérience ne peuvent être atteints. Si le niveau de validité est trop élevé, du temps de travail de modélisation et de calcul est inutilement dépensé. Nous avons assimilé le problème de niveau de validité à une hiérarchie d'abstraction de modèles. Nous proposons un modèle de description des propriétés d'abstractions qui permet de parler strictement des mêmes choses lorsque le terme de \"validité\" est évoqué et d'évaluer la compatibilité entre un niveau de validité attendu par l'expérience et un niveau de validité fourni par le produit de simulation. Puis, nous avons établi des règles formelles de mise en correspondance d'un objectif d'utilisation et du domaine d'usage d'un modèle. Le problème de la mise en correspondance est fondé sur le principe qu'un objectif d'utilisation et un domaine d'usage d'une simulation sont deux composants, au sens formel du terme. Nous avons …", "num_citations": "3\n", "authors": ["1436"]}
{"title": "Formal framework for discrete-event simulation\n", "abstract": " A formal framework for modelling and simulation of parallel systems named ProjectDEVS is presented. The objective of this framework is to apply a Model-Based System Engineering approach to the development of simulation products for cyber-physical embedded systems. It is intended for the design and automated deployment of virtual prototypes. Models are constructed by coupling concurrent components exchanging data through ports and executed by various simulation schemes, namely simulators. This paper focuses on the integration of a Time Petri Net implementation of a parallel simulator into the framework. The semantics of the parallel simulator is formally described using timed transition system to verify the correctness of the implementation. Then, a model with its simulator can be model checked against formal specification and be rapidly deployed on FPGA or PC via code generators.", "num_citations": "2\n", "authors": ["1436"]}
{"title": "Towards an Ontology-Driven Framework for Simulation Model Development\n", "abstract": " An ontology driven domain model approach for improving the fidelity of the simulation by developing models through the inclusion of simulation objectives for the system Verification & Validation activities (V&V) is presented. The system V&V by simulation ontology used to build this domain model is briefly outlined in the system teleological framework of Structure, Behavior, Function, Interface and Operation. The concept of operating mode is proposed and discussed with an example. The ontology approach is demonstrated with an aircraft nacelle anti-ice system presented in the experimental frame formalism. An example of using the inference and query capabilities of the domain model approach to identify and justify abstractions consistent with the test scenarios is illustrated with a failure mode case study for this application case. The relationship with formal behavioral approach through operating modes is briefly discussed at the end where some theoretical results on the behavioral compatibility of the experimental frame components with interface simulation distances are briefly presented. The paper concludes with a discussion on the benefits of this approach from an industrial perspective along with an overview of the challenges ahead and the future work.", "num_citations": "2\n", "authors": ["1436"]}
{"title": "A MULTIMODAL APPROACH TO SIMULATION FIDELITY\n", "abstract": " A process oriented view of a multimodal approach to simulation fidelity is discussed in the context of system verification and validation in industry. An overview of classical simulation product development is given and the problem of developing models through the inclusion of simulation objectives is presented in terms of this process. A multi modal approach for improving the syntactic fidelity of simulation by using meta-modeling techniques and semantic web principles is presented in an operational context. The domain model is briefly presented and a concept of operating mode is proposed in the model teleological framework of Structure, Behavior, Function and Interface. The relation with the study of formal techniques on semantic or behavioral fidelity is briefly discussed along with an overview on the challenges ahead and future work.", "num_citations": "2\n", "authors": ["1436"]}
{"title": "Applying the model-driven architecture approach to dynamic structure applications\n", "abstract": " Model-Driven Architecture (MDA) is a system engineering approach which consists in separating the model description from the execution platform. It allows building a model without detailed knowledge of the target platform, as well as retargeting the execution platform without changing the model itself. We present a meta-model called Partial Reconfigurable DEVS (PRDEVS) that is able to represent dynamic structure changes of a model. We base our approach on the DEVS formalism, which is modular and hierarchical. Our description paradigm differs from the previous DEVS-based dynamic meta-models in that it explicitly deals with adding and removing components. This approach is closer to the general reconfigurable embedded system design methodology. Both a software and a FPGA-based hardware platform are considered as dynamic execution platforms.", "num_citations": "1\n", "authors": ["1436"]}
{"title": "Codage de CDEVS et de PDEVS en réseau de Petri temporisé\n", "abstract": " Cet article présente un codage des sémantiques CDEVS (Classic Discrete-EVent Specification) et PDEVS (Parallel Discrete-EVent Specification) en TPN (réseaux de Petri temporisés-Timed PetriNet) avec priorités et gestion des données. Ce codage constitue une spécification formelle de la sémantique d'exécution des modèles CDEVS et PDEVS pour notre outil de simulation ProDEVS [1]. A partir d'un modèlè a base de réseau de Petri résultant d'une transformation automatique d'un modèle DEVS saisi dans ProDEVS, nous exécutons une exploration exhaustive du modèle. Nous montrons comment faire une vérification formelle de propriétés de simulation liéesliées`liéesà la correction du modèle : est-il bien construit et légitime pour toutes seséventuelles ses´seséventuelles utilisations ? Sera-t-il correctement exécuté par le simulateur.", "num_citations": "1\n", "authors": ["1436"]}
{"title": "A Meta-Model for Consistent & Automatic Simulation Model Selection\n", "abstract": " A meta-model of modeling abstractions is presented and discussed in the context of using simulation as a means for system verification and validation activities. Extending the classical results of presenting modeling as a relevance reasoning problem, abstractions are classified to build an ontology based on the concepts of teleological modeling and relevance reasoning. The domain model is built in the standard ontology tool of Protégé to exploit the reasoning and inference capabilities to build a model abstraction library. Lattice structures of model instances are formed and a recursive algorithm is implemented as an activity diagram in SysML for automated and consistent model selection. The approach is presented with a battery model example from the literature. Challenges and future work in implementation of such a semi-formal approach in model selection is briefly presented in the context of improving fidelity of simulation in the industry.", "num_citations": "1\n", "authors": ["1436"]}