{"title": "CID: an efficient complexity-invariant distance for time series\n", "abstract": " The ubiquity of time series data across almost all human endeavors has produced a great interest in time series data mining in the last decade. While dozens of classification algorithms have been applied to time series, recent empirical evidence strongly suggests that simple nearest neighbor classification is exceptionally difficult to beat. The choice of distance measure used by the nearest neighbor algorithm is important, and depends on the invariances required by the domain. For example, motion capture data typically requires invariance to warping, and cardiology data requires invariance to the baseline (the mean value). Similarly, recent work suggests that for time series clustering, the choice of clustering algorithm is much less important than the choice of distance measure used.In this work we make a somewhat surprising claim. There is an invariance that the community seems to have missed …", "num_citations": "277\n", "authors": ["1082"]}
{"title": "Time Series Classification Using Compression Distance of Recurrence Plots\n", "abstract": " There is a huge increase of interest for time series methods and techniques. Virtually every piece of information collected from human, natural, and biological processes is susceptible to changes over time, and the study of how these changes occur is a central issue in fully understanding such processes. Among all time series mining tasks, classification is likely to be the most prominent one. In time series classification there is a significant body of empirical research that indicates that k-nearest neighbor rule in the time domain is very effective. However, certain time series features are not easily identified in this domain and a change in representation may reveal some significant and unknown features. In this work, we propose the use of recurrence plots as representation domain for time series classification. Our approach measures the similarity between recurrence plots using Campana-Keogh (CK-1) distance, a …", "num_citations": "92\n", "authors": ["1082"]}
{"title": "Evaluation of statistical and machine learning models for time series prediction: Identifying the state-of-the-art and the best conditions for the use of each model\n", "abstract": " The choice of the most promising algorithm to model and predict a particular phenomenon is one of the most prominent activities of the temporal data forecasting. Forecasting (or prediction), similarly to other data mining tasks, uses empirical evidence to select the most suitable model for a problem at hand since no modeling method can be considered as the best. However, according to our systematic literature review of the last decade, few scientific publications rigorously expose the benefits and limitations of the most popular algorithms for time series prediction. At the same time, there is a limited performance record of these models when applied to complex and highly nonlinear data. In this paper, we present one of the most extensive, impartial and comprehensible experimental evaluations ever done in the time series prediction field. From 95 datasets, we evaluate eleven predictors, seven parametric and four …", "num_citations": "90\n", "authors": ["1082"]}
{"title": "Data Stream Classification Guided by Clustering on Nonstationary Environments and Extreme Verification Latency\n", "abstract": " Data stream classification algorithms for nonstationary environments frequently assume the availability of class labels, instantly or with some lag after the classification. However, certain applications, mainly those related to sensors and robotics, involve high costs to obtain new labels during the classification phase. Such a scenario in which the actual labels of processed data are never available is called extreme verification latency. Extreme verification latency requires new classification methods capable of adapting to possible changes over time without external supervision. This paper presents a fast, simple, intuitive and accurate algorithm to classify nonstationary data streams in an extreme verification latency scenario, namely Stream Classification Algorithm Guided by Clustering – SCARGC. Our method consists of a clustering followed by a classification step applied repeatedly in a closed loop fashion. We show …", "num_citations": "86\n", "authors": ["1082"]}
{"title": "Exploring low cost laser sensors to identify flying insect species\n", "abstract": " Insects have a close relationship with the humanity, in both positive and negative ways. Mosquito borne diseases kill millions of people and insect pests consume and destroy around US $40 billion worth of food each year. In contrast, insects pollinate at least two-thirds of all the food consumed in the world. In order to control populations of disease vectors and agricultural pests, researchers in entomology have developed numerous methods including chemical, biological and mechanical approaches. However, without the knowledge of the exact location of the insects, the use of these techniques becomes costly and inefficient. We are developing a novel sensor as a tool to control disease vectors and agricultural pests. This sensor, which is built from inexpensive commodity electronics, captures insect flight information using laser light and classifies the insects according to their species. The use of machine …", "num_citations": "58\n", "authors": ["1082"]}
{"title": "Applying Machine Learning and Audio Analysis Techniques to Insect Recognition in Intelligent Traps\n", "abstract": " Throughout the history, insects have had an intimate relationship with humanity, both positive and negative. Insects are vectors of diseases that kill millions of people every year and, at the same time, insects pollinate most of the world's food production. Consequently, there is a demand for new devices able to control the populations of harmful insects while having a minimal impact on beneficial insects. In this paper, we present an intelligent trap that uses a laser sensor to selectively classify and catch insects. We perform an extensive evaluation of different feature sets from audio analysis and machine learning algorithms to construct accurate classifiers for the insect classification task. Support Vector Machines achieved the best results with a MFCC feature set, which consists of coefficients from frequencies scaled according to the human auditory system. We evaluate our classifiers in multiclass and binary class …", "num_citations": "45\n", "authors": ["1082"]}
{"title": "Extracting Texture Features for Time Series Classification\n", "abstract": " Time series are present in many pattern recognition applications related to medicine, biology, astronomy, economy, and others. In particular, the classification task has attracted much attention from a large number of researchers. In such a task, empirical researches has shown that the 1-Nearest Neighbor rule with a distance measure in time domain usually performs well in a variety of application domains. However, certain time series features are not evident in time domain. A classical example is the classification of sound, in which representative features are usually present in the frequency domain. For these applications, an alternative representation is necessary. In this work we investigate the use of recurrence plots as data representation for time series classification. This representation has well-defined visual texture patterns and their graphical nature exposes hidden patterns and structural changes in data …", "num_citations": "41\n", "authors": ["1082"]}
{"title": "Classification of Data Streams Applied to Insect Recognition: Initial Results\n", "abstract": " Applications such as intelligent sensors should be able to collect information about the environment and make decisions based on input data. An example is a low-cost sensor able to detect and classify species of insects using a simple laser and machine learning techniques. This sensor is an important step towards the development of intelligent traps able to attract and selectively capture insect species of interest such as disease vectors or agricultural pests, without affecting non-harmful species. The data gathered by the sensor constitutes a data stream with non-stationary characteristics, since the insects' metabolisms are influenced by environmental conditions (such as temperature, humidity and atmospheric pressure), circadian rhythm and age. Algorithms that classify data streams often assume that once a prediction is made, the actual labels are provided to assist in updating the classifier. In the case of …", "num_citations": "40\n", "authors": ["1082"]}
{"title": "Classification of Evolving Data Streams with Infinitely Delayed Labels\n", "abstract": " The majority of evolving data streams classification algorithms assume that the actual labels of the predicted examples are readily available without any time delay just after a prediction is made. However, given the high label costs, dependence of an expert, limitations in data transmission or even restrictions imposed by the problem's nature, there is a large number of real-world applications in which the availability of actual labels is infinitely delayed (never available). In these cases, it is necessary the use of algorithms that does not follow the traditional process of monitoring the error rate to detect changes in data distribution and uses the most recent labeled data to update the classification model. In this paper, we propose the method MClassification to classify evolving data streams with infinitely delayed labels. Our method is inspired on the use of Micro-Cluster representation from online clustering algorithms …", "num_citations": "30\n", "authors": ["1082"]}
{"title": "Asfault: A low-cost system to evaluate pavement conditions in real-time using smartphones and machine learning\n", "abstract": " Modern smartphones have a large variety of built-in sensors that can measure different information about users and the environment around them. Given the increasing popularity of these devices, their high processing power, and the ability to transfer data over wireless networks, different smartphone-based applications have emerged in the last years to solve old problems with new approaches more efficiently and cheaply. One example is the assessment and monitoring of asphalt quality. This task has been done manually by experts since the 1930s, and with the help of expensive equipment since the 1960s. Currently, we are experiencing the emergence of next-generation tools to perform this monitoring with smartphones, significantly reducing costs, time, and effort of experts. However, there is a trade-off between the costs and precision of smartphone sensors, requiring the use of sophisticated software solutions …", "num_citations": "28\n", "authors": ["1082"]}
{"title": "Spoken Digit Recognition in Portuguese Using Line Spectral Frequencies\n", "abstract": " Recognition of isolated spoken digits is the core procedure for a large and important number of applications mainly in telephone based services, such as dialing, airline reservation, bank transaction and price quotation, only using speech. Spoken digit recognition is generally a challenging task since the signals last for short period of time and often some digits are acoustically very similar to each other. The objective of this paper is to investigate the use of machine learning algorithms for digit recognition. We focus on the recognition of digits spoken in Portuguese. However, we note that our techniques are applicable to any language. We believe that the most important task for successfully recognizing spoken digits is the attribute extraction. Audio data is composed by a huge amount of very weak features, and most machine learning algorithms will not be able to build accurate classifiers. We show that Line …", "num_citations": "27\n", "authors": ["1082"]}
{"title": "Music Shapelets for Fast Cover Song Recognition\n", "abstract": " A cover song is a new performance or recording of a previously recorded music by an artist other than the original one. The automatic identification of cover songs is useful for a wide range of tasks, from fans looking for new versions of their favorite songs to organizations involved in licensing copyrighted songs. This is a difficult task given that a cover may differ from the original song in key, timbre, tempo, structure, arrangement and even language of the vocals. Cover song identification has attracted some attention recently. However, most of the state-of-the-art approaches are based on similarity search, which involves a large number of similarity computations to retrieve potential cover versions for a query recording. In this paper, we adapt the idea of time series shapelets for contentbased music retrieval. Our proposal adds a training phase that finds small excerpts of feature vectors that best describe each song. We demonstrate that we can use such small segments to identify cover songs with higher identification rates and more than one order of magnitude faster than methods that use features to describe the whole music.", "num_citations": "23\n", "authors": ["1082"]}
{"title": "Challenges in Benchmarking Stream Learning Algorithms with Real-world Data\n", "abstract": " Streaming data are increasingly present in real-world applications such as sensor measurements, satellite data feed, stock market, and financial data. The main characteristics of these applications are the online arrival of data observations at high speed and the susceptibility to changes in the data distributions due to the dynamic nature of real environments. The data stream mining community still faces some primary challenges and difficulties related to the comparison and evaluation of new proposals, mainly due to the lack of publicly available high quality non-stationary real-world datasets. The comparison of stream algorithms proposed in the literature is not an easy task, as authors do not always follow the same recommendations, experimental evaluation procedures, datasets, and assumptions. In this paper, we mitigate problems related to the choice of datasets in the experimental evaluation of stream …", "num_citations": "20\n", "authors": ["1082"]}
{"title": "Asphalt pavement classification using smartphone accelerometer and Complexity Invariant Distance\n", "abstract": " Most modern smartphones have a variety of built-in sensors, as an accelerometer, gyroscope, GPS, proximity and a magnetic sensor. The large variety of sensors makes these devices powerful measurement tools, allowing the emergence of new systems and applications. In this paper, is presented a real data stream application related to asphalt pavement evaluation using acceleration data gathered by the accelerometer sensor of smartphones. The quality of the pavement has a significant influence on the final price of goods and services, the safety of drivers, pedestrians and passengers, and driver’s comfort. Thus, it is essential the use of tools, as proposed in this work, that allows the constant monitoring of pavement conditions by the Government authorities or private entities for more precise interventions in the maintenance planning with fewer expenses. This task is mainly important in developing countries …", "num_citations": "19\n", "authors": ["1082"]}
{"title": "Effective Insect Recognition Using a Stacked Autoencoder with Maximum Correntropy Criterion\n", "abstract": " Throughout the history, insects had been intimately connected to humanity, in both positive and negative ways. Insects play an important part in crop pollination, on the other hand, some of them spread diseases that kill millions of people every year. Effective control of harmful insects while having little impact to beneficial insects and environment is extremely important. Recently, an intelligent trap that uses laser sensors was presented to control the population of target insects. The device could record and analyze sensor signals when an insect passes through the trap and make quick decisions whether to catch it or not. The effectiveness of the trap relies on the correct choice of classification algorithm to perform the insect detection. In this paper, we propose to use a deep neural network with maximum correntropy criterion (MCC) for reliable classification of insects in real-time. Experimental results show that, deep …", "num_citations": "19\n", "authors": ["1082"]}
{"title": "Automatic classification of drum sounds with indefinite pitch\n", "abstract": " Automatic classification of musical instruments is an important task for music transcription as well as for professionals such as audio designers, engineers and musicians. Unfortunately, only a limited amount of effort has been conducted to automatically classify percussion instrument in the last years. The studies that deal with percussion sounds are usually restricted to distinguish among the instruments in the drum kit such as toms vs. snare drum vs. bass drum vs. cymbals. In this paper, we are interested in a more challenging task of discriminating sounds produced by the same percussion instrument. Specifically, sounds from different drums cymbals types. Cymbals are known to have indefinite pitch, nonlinear and chaotic behavior. We also identify how the sound of a specific cymbal was produced (e.g., roll or choke movements performed by a drummer). We achieve an accuracy of 96.59% for cymbal type …", "num_citations": "18\n", "authors": ["1082"]}
{"title": "An experimental analysis on time series transductive classification on graphs\n", "abstract": " Graph-based semi-supervised learning (SSL) algorithms perform well when the data lie on a low-dimensional manifold. Although these methods achieved satisfactory performance on a variety of domains, they have not been effectively evaluated on time series classification. In this paper, we provide a comprehensive empirical comparison of state-of-the-art graph-based SSL algorithms combined with a variety of graph construction methods in order to evaluate them on time series transductive classification tasks. Through a detailed experimental analysis using recently proposed empirical evaluation models, we show strong and weak points of these classifiers concerning both performance and stability with respect to graph construction and parameter selection. Our results show that some hypotheses raised on previous work do not hold in the time series domain while others may only hold under mild conditions.", "num_citations": "17\n", "authors": ["1082"]}
{"title": "Time Series Transductive Classification on Imbalanced Data Sets: An Experimental Study\n", "abstract": " Graph-based semi-supervised learning (SSL) algorithms perform well on a variety of domains, such as digit recognition and text classification, when the data lie on a low-dimensional manifold. However, it is surprising that these methods have not been effectively applied on time series classification tasks. In this paper, we provide a comprehensive empirical comparison of state-of-the-art graph-based SSL algorithms with respect to graph construction and parameter selection. Specifically, we focus in this paper on the problem of time series transductive classification on imbalanced data sets. Through a comprehensive analysis using recently proposed empirical evaluation models, we confirm some of the hypotheses raised on previous work and show that some of them may not hold in the time series domain. From our results, we suggest the use of the Gaussian Fields and Harmonic Functions algorithm with the …", "num_citations": "16\n", "authors": ["1082"]}
{"title": "A comparative study between MFCC and LSF coefficients in automatic recognition of isolated digits pronounced in Portuguese and English\n", "abstract": " Recognition of isolated spoken digits is the core procedure for a large number of applications which rely solely on speech for data exchange, as in telephone-based services, such as dialing, airline reservation, bank transaction and price quotation. Spoken digit recognition is generally a challenging task since the signals last for a short period of time and often some digits are acoustically very similar to other digits. The objective of this paper is to investigate the use of machine learning algorithms for spoken digit recognition and disclose the free availability of a database with digits pronounced in English and Portuguese to the scientific community. Since machine learning algorithms are fully dependent on predictive attributes to build precise classifiers, we believe that the most important task for successfully recognizing spoken digits is feature extraction. In this work, we show that Line Spectral Frequencies (LSF) provide a set of highly predictive coefficients. We evaluated our classifiers in different settings by altering the sampling rate to simulate low quality channels and varying the number of coefficients.", "num_citations": "13\n", "authors": ["1082"]}
{"title": "A coherence analysis module for SciPo: providing suggestions for scientific abstracts written in Portuguese\n", "abstract": " SciPo is a writing tool whose ultimate goal is to assist novice writers in producing scientific writing in Portuguese, focusing primarily on abstracts and introductions from computer science. In this paper, we describe the development of a coherence analysis module for SciPo, which aims to automatically detect semantic coherence aspects of abstracts and provide suggestions for improvement. At the core of this new module are classifiers that identify different semantic relationships among sentences within an abstract and hence indicate semantic aspects that add coherence to the abstract. Such classifiers are based on a set of features extracted automatically from the surface of the text and by Latent Semantic Analysis processing. All classifiers were evaluated intrinsically and their performance was higher than the baseline. We also resorted to actual users to evaluate our coherence analysis module, which has been …", "num_citations": "10\n", "authors": ["1082"]}
{"title": "Evaluating Stream Classifiers with Delayed Labels Information\n", "abstract": " In general, data stream classifiers consider that the actual label of every unlabeled instance is available immediately after it issues a classification. The immediate availability of class labels allows the supervised monitoring of the data distribution and the error rate to verify whether the current classifier is outdated. Further, if a change is detected, the classifier has access to all recent labeled data to update the model. However, this assumption is very optimistic for most (if not all) applications. Given the costs and labor involved to obtain labels, failures in data acquisition or restrictions of the classification problem, a more reasonable assumption would be to consider the delayed availability of class labels. In this paper, we experimentally analyze the impact of latency on the performance of stream classifiers and call the attention of the community for the need to consider this critical variable in the evaluation process. We …", "num_citations": "7\n", "authors": ["1082"]}
{"title": "Towards Hierarchical Classification of Data Streams⋆\n", "abstract": " In data stream mining, state-of-the-art machine learning algorithms for the classification task associate each event with a class belonging to a finite, devoid of structural dependencies and usually small, set of classes. However, there are more complex dynamic problems where the classes we want to predict make up a hierarchal structure. In this paper, we propose an incremental method for hierarchical classification of data streams. We experimentally show that our stream hierarchical classifier present advantages to the traditional online setting in three real-world problems related to entomology, ichthyology, and audio processing.", "num_citations": "7\n", "authors": ["1082"]}
{"title": "Towards automatic evaluation of asphalt irregularity using smartphone’s sensors\n", "abstract": " The quality of the pavement of roads and streets has significant influence in the final price of goods and services, in the safety of pedestrians and also in the driver’s comfort. Thus, the development of tools for continuous monitoring of the pavement, intending to obtain a more precise and adequate maintenance plan is essential. In order to reduce the manual effort of inspections made by experts, the use of high-cost equipment as laser profilometer and allowing evaluations in real-time, the use of motion sensor of smartphones to monitor the asphalt irregularity is proposed. In this paper, the present problem is modeled as a classification task that can be performed by supervised learning algorithms and aided by signal processing techniques for features extraction from the acceleration data. The proposed approach shows promising accuracies for the identification of asphalt irregularity (around 99%) and for …", "num_citations": "7\n", "authors": ["1082"]}
{"title": "Unsupervised active learning techniques for labeling training sets: An experimental evaluation on sequential data\n", "abstract": " Many real-world applications, such as those related to sensors, allow collecting large amounts of inexpensive unlabeled sequential data. However, the use of supervised machine learning methods is frequently hindered by the high costs involved in gathering labels for such data. These methods assume the availability of a considerable amount of labeled data to build an accurate classification model. To overcome this bottleneck, active learning methods are designed to selectively label the most informative examples instead of requesting all true labels. Although active learning has been widely used in many problems, most of the methods consider the presence of labeled data or some prior knowledge about the problem, as the number of classes. Differently, in this paper, we are interested in the realistic scenario where the active learning is performed from scratch on a fully unlabeled dataset and with the absence …", "num_citations": "7\n", "authors": ["1082"]}
{"title": "Identifying Aedes aegypti Mosquitoes by Sensors and One-Class Classifiers\n", "abstract": " Yellow fever, zika, and dengue are some examples of arboviruses transmitted to the humans by the Aedes aegypti mosquitoes. The efforts to curb the transmission of these viral diseases are focused on the vector control. However, without the knowledge of the exact location of the insects with a reduced time delay, the use of techniques as chemical control becomes costly and inefficient. Recently, an optical sensor was proposed to gather real-time information about the spatio-temporal distributions of insects, supporting different vector control techniques. In field conditions, the assumption of knowledge of all classes of the problem, it is hard to be fulfilled. For this reason, we address the problem of insect classification by one-class classifiers, where the learning is performed only with positive examples (target class). In our experiments, we identify Aedes aegypti mosquitos with an AUC = 0.87.", "num_citations": "6\n", "authors": ["1082"]}
{"title": "Avaliação de Classificadores para o Reconhecimento Automático de Insetos\n", "abstract": " An important application in public health are the intelligent traps able to selectively capture insect species of interest, such as disease vectors, without affecting other beneficial species to the environment. The implementation on such trap requires the development of a sensor able to automatically detect the species of the insects that enter the trap. Recently, we proposed a sensor that uses lasers and machine learning techniques to automatically classify insects. Aiming to guide the choice of classifiers to be embedded in the intelligent trap, this work presents an experimental evaluation of several classifiers to automatically recognize insect species using the sensor data. Our results indicate that a simple kNN classifier outperforms the proposed baseline and is competitive with more sophisticated techniques such as SVM and GMM classifiers.Resumo. Uma importante aplicaç ao de utilidade pública é o uso de …", "num_citations": "5\n", "authors": ["1082"]}
{"title": "EmbML Tool: supporting the use of supervised learning algorithms in low-cost embedded systems\n", "abstract": " Machine Learning (ML) is becoming a ubiquitous technology employed in many real-world applications. In some applications, sensors measure the environment while ML algorithms are responsible for interpreting the data. These systems often face three main restrictions: power consumption, cost, and lack of infrastructure. Therefore, we need highly-efficient classifiers suitable to execute in unresourceful hardware. However, this scenario conflicts to the state-of-practice of ML, in which classifiers are frequently implemented in high-level interpreted languages, make unrestricted use of floating-point operations and assume plenty of resources. In this paper, we present a software tool named EmbML that implements a pipeline to develop classifiers for low-powered embedded systems. It starts with learning a classifier using popular software packages or libraries. Then, EmbML converts the classifier into a carefully …", "num_citations": "4\n", "authors": ["1082"]}
{"title": "Avaliação de um aplicativo para apoio à decisão no cuidado de úlceras por pressão\n", "abstract": " O Programa Nacional de Segurança do Paciente tem como objetivo geral reduzir a ocorrência de eventos adversos em instituições de saúde, como, por exemplo as úlceras por pressão. Para isso, é fundamental que o enfermeiro esteja preparado e fundamentado para prescrever medidas de prevenção efetivas para cada paciente. Com o intuito de auxiliar os profissionais de saúde frente à aquisição de conhecimento especializado e frente ao processo de tomada de decisão dos cuidados das UP, esta pesquisa visou avaliar um aplicativo-protótipo que fornece informações personalizadas de cada paciente quanto ao risco, prevenção e/ou classificação da UP. O aplicativo desenvolvido na plataforma Android, passou por uma avaliação de qualidade técnica e funcional. A partir da análise dos resultados obtidos, concluiu-se que o sistema desenvolvido foi considerado adequado nos quesitos de Engenharia de Software, além de apresentar alta portabilidade e fácil acesso, representando uma importante ferramenta para auxiliar no processo de difusão das práticas baseadas em evidências para a prevenção das úlceras por pressão.", "num_citations": "4\n", "authors": ["1082"]}
{"title": "Automatic Analysis of Semantic Coherence in Academic Abstracts Written in Portuguese\n", "abstract": " SciPo is a system whose ultimate goal is to support novice writers in producing academic texts in Brazilian Portuguese through presentation of critiques and suggestions. Currently, it focuses on the rhetorical structure of texts, being capable of automatically detecting and criticizing the rhetorical structure of Abstract sections. We describe a system that enhances SciPo’s functionality by evaluating aspects of semantic coherence in academic abstracts. This system identifies features of sentences based on semantic similarity measures and rhetorical structure. Different machine learning algorithms were trained and evaluated with these features, resulting in three classifiers capable of detecting specific coherence issues on sentences with regard to a rhetorical structure model for abstracts. Results indicate that the system yields higher performance than the baseline for all classifiers.", "num_citations": "4\n", "authors": ["1082"]}
{"title": "A Comparative Study of Algorithms for Recommending Given Names\n", "abstract": " Recommending given names is a special case of recommender system that is little explored, but has gained a great interest recently. Indication of names related to a user's query or suggestion of names for parents in order to choose a name for their unborn child are examples of applications of name recommendation. In this paper, we present results for this task by using a baseline approach that recommends only the most frequent searched names, two state-of-the-art recommender systems, and a proposed method based on graph. The empirical evaluation shows that our method based on graph provides better results than the other methods.", "num_citations": "3\n", "authors": ["1082"]}
{"title": "Efficient unsupervised drift detector for fast and high-dimensional data streams\n", "abstract": " Stream mining considers the online arrival of examples at high speed and the possibility of changes in its descriptive features or class definitions compared with past knowledge (ie, concept drifts). The fast detection of drifts is essential to keep the predictive model updated and stable in changing environments. For many applications, such as those related to smart sensors, the high number of features is an additional challenge in terms of memory and time for stream processing. This paper presents an unsupervised and model-independent concept drift detector suitable for high-speed and high-dimensional data streams. We propose a straightforward two-dimensional data representation that allows the faster processing of datasets with a large number of examples and dimensions. We developed an adaptive drift detector on this visual representation that is efficient for fast streams with thousands of features and is …", "num_citations": "2\n", "authors": ["1082"]}
{"title": "An analysis of textual coherence in academic abstracts written in Portuguese\n", "abstract": " The abstract can be considered as one of the most important sections of an academic work. Along with the title, it is used by researchers to disseminate their research in scientific circles. In this context, it was developed an environment to support the writing of Abstract and Introduction sections called SciPo (Scientific Portuguese). This environment provides writing support by means of critics and suggestions presented to the user with respect to the rhetorical structure identified in text submitted for analysis. Although SciPo provides feedback indicating which parts of the text should be improved, it does not analyze features related to semantics, such as coherence, which is essential to the readability and interpretability of the text. This paper presents a study with regard to the analysis of textual coherence in Abstracts section from Bachelor theses in the area of Computer Science written in Portuguese. The coherence analysis was based on the semantic relationship observed among certain parts of the abstract that constitute its rhetorical structure. This analysis led to the development of additional computational resources to SciPo, which is now able to analyze coherence of the abstracts written in Portuguese.", "num_citations": "2\n", "authors": ["1082"]}
{"title": "Unsupervised Drift Detection on High-speed Data Streams\n", "abstract": " Changes in data distribution of streaming data (i.e., concept drifts), constitute a central issue in online data mining. The main reason is that these changes are responsible for outdating stream learning models, reducing their predictive performance over time. A common approach adopted by real-time adaptive systems to deal with concept drifts is to employ detectors that indicate the best time for updates. However, an unrealistic assumption of most detectors is that the labels become available immediately after data arrives. In this paper, we introduce an unsupervised and model-independent concept drift detector suitable for high-speed and high-dimensional data streams in realistic scenarios with the scarcity of labels. We propose a straightforward two-dimensional representation of the data aiming faster processing for detection. We develop a simple adaptive drift detector on this visual representation that is efficient …", "num_citations": "1\n", "authors": ["1082"]}
{"title": "A Fuzzy Classifier for Data Streams with Infinitely Delayed Labels⋆\n", "abstract": " In data stream learning, classification is a prominent task which aims to predict the class labels of incoming examples. However, in classification, most of the approaches from literature make assumptions that limit the usefulness of the methods in real scenarios such as the supposition that the label of an example will be available right after its prediction, i.e., there is no time delay to acquiring actual labels. It is a very optimistic assumption, since labeling the entire data stream is usually not feasible. Some recent approaches overcome this limitation, considering unsupervised learning methods to deal with delayed labels. Also, some proposals explore concepts of fuzzy set theory to add more flexibility to the learning process, although restricted to data streams with no delayed labels. In this paper, we propose a fuzzy classifier for data streams with infinitely delayed labels called FuzzMiC. Our algorithm …", "num_citations": "1\n", "authors": ["1082"]}
{"title": "Análise automática de coerência semântica em recursos acadêmicos escritos em português\n", "abstract": " The abstract can be considered one of the most important sections of an academic work. Along with the title, it is used by researchers to disseminate their research in scientic circles. In this context, Feltrim (2004) proposed an environment to support the writing of Abstract and Introduction sections called SciPo. This environment provides writing support by means of criticism and suggestions presented to the user with respect to the rhetorical (or schematic) structure identified in text submitted for analysis. Although the SciPo provides feedback indicating which parts of the text should be improved, it does not analyze features related to semantics, such as coherence, which is essential to the readability and interpretability of the text. Therefore, the main goal of this research was to develop computional resources to the automatic detection of semantic aspects of the Abstract section. We use these resources for the return of …", "num_citations": "1\n", "authors": ["1082"]}
{"title": "PyGER: Uma Ferramenta Geradora de Expressões Regulares a partir de um Conjunto de Expressões em Linguagem Natural\n", "abstract": " A very common procedure used in the natural language processing is the analysis of natural language expressions as well as their transformation into regular expressions. The transformation mentioned before can help finding other important expressions into the body of a text article and also contributes as input data to lexical analyzer generators (scanners). Unfortunately, the mentioned tasks are still made manually and for that reason the development of new strategies are needed, in a way of overcoming the mentioned problems, the present work aims at presenting a computational tool with this goal In a more specific context, the proposed software will reduce the cost of adaptation of the SciPo texts to other domains.Resumo. Um procedimento recorrente no processamento de linguagem natural, consiste na análise de expressões em linguagem natural e transformação das mesmas em expressões regulares para que se possa identificar outras expressões de importância no texto, e também servindo de entrada para geradores de analisadores léxicos (scanners). Essa tarefa é até o momento realizada de forma manual e neste trabalho foram investigadas formas de automatizar tal processo, resultando na implementação de uma ferramenta com esse objetivo. Em um contexto mais específico, este trabalho reduzirá o custo de adaptação do ambiente SciPo a textos de outros domínios.", "num_citations": "1\n", "authors": ["1082"]}