{"title": "A systematic review on cloud computing\n", "abstract": " Cloud computing is an ascending technology that has introduced a new paradigm by rendering a rational computational model possible. It has changed the dynamics of IT consumption by means of a model that provides on-demand services over the Internet. Unlike the traditional hosting service, cloud computing services are paid for per usage and may expand or shrink based on demand. Such services are, in general, fully managed by cloud providers that require users nothing but a personal computer and an Internet access. In recent years, this model has attracted the attention of researchers, investors and practitioners, many of whom have proposed a number of applications, structures and fundamentals of cloud computing, resulting in various definitions, requirements and models. Despite the interest and advances in the field, issues such as security and privacy, service layer agreement, resource …", "num_citations": "181\n", "authors": ["1526"]}
{"title": "Smart cities software architectures: a survey\n", "abstract": " The smart cities concept arises from the need to manage, automate, optimize and explore all aspects of a city that could be improved. For this purpose it is necessary to build a robust architecture that satisfies a minimal number of requirements such as distributed sensing, integrated management and flexibility. Several architectures have been proposed with different goals, but none of them met satisfactorily the needs that permeate smart cities. In this work various architectures are discussed, highlighting the main requirements that they aim to fulfill. Furthermore, based on different architectures with the most varied purposes, a set of requirements for the implementation of a smart city is presented and discussed.", "num_citations": "123\n", "authors": ["1526"]}
{"title": "PBL in teaching computing: An overview of the last 15 years\n", "abstract": " In computing courses, the teaching and learning approach normally emphasizes theoretical knowledge at the expense of practical knowledge. The major disadvantages of this approach are learners' lack of motivation during class and their quickly forgetting the knowledge they have acquired. With a view to overcoming these difficulties, Problem Based Learning (PBL), an institutional method of teaching, has been applied to teaching computing disciplines. Despite the growth of the practice of PBL in various disciplines of Computing, there is little evidence of its specific characteristics in this area, the effectiveness of different PBL methodological approaches, or of benefits and challenges encountered. In this context, this paper presents a systematic mapping study in order to identify studies which involve best practices when using the PBL method in Computing between 1997 and 2011, answering five research …", "num_citations": "58\n", "authors": ["1526"]}
{"title": "Brazilian smart cities: using a maturity model to measure and compare inequality in cities\n", "abstract": " Nowadays there are several publications on smart cities and improvements offered to the routine of its inhabitants and resource optimization, however, there is still no agreement about the definition of\" Smart Cities\", their domains and indicators. The lack of a clear and widely usable definition and such as delimitation areas and indicators makes it difficult to compare or measure cities in this context. This paper compares some of the Brazilian capital indicators and presents a maturity model called br-SCMM (Brazilian Smart City Maturity Model) developed to allow extracted indicators of public databases may be used to assist city managers.", "num_citations": "56\n", "authors": ["1526"]}
{"title": "A systematic mapping study on domain-specific languages\n", "abstract": " Domain-Specific Languages (DSLs) offer substantial gains in expressiveness and ease of use compared with general purpose languages. This way, DSLs have gained significant attention in industry and academy, as can be seen by the increased number of related publications in key conferences and journals. This paper aims to provide a broad view of the DSL research field by performing a Systematic Mapping Study. Adopting a detailed search strategy, 4450 studies were initially identified, and, after filtering, 1440 primary studies were selected and categorized using a particular classification scheme. So, this work presents the most popular application domains where DSLs have been applied, identifies different tools for handling DSLs, including language workbenches, and enumerates several techniques, methods and/or processes for dealing with DSLs.", "num_citations": "45\n", "authors": ["1526"]}
{"title": "Brazilian government open data: implementation, challenges, and potential opportunities\n", "abstract": " Technological advances and real-time worldwide communications hold great promise for transforming the efficiency and effectiveness of public services through the ease of publishing and access to government public information or through the offer of new kinds of services. In this paper, we describe two initiatives, Rio Inteligente (Smart Rio) and Cidadão Recifense (Recife Citizen), which are based on Brazilian open-data repositories from the cities of Rio de Janeiro and Recife and deliver services for citizens and tourists, mainly (i) a health-unit finder based on user location and (ii) an online vaccination card. Based on the development experience of these two similar applications that use completely independent open-data repositories, this paper discusses the current state of Brazilian open-data initiatives, their challenges and difficulties, and draws some considerations towards a framework to build applications …", "num_citations": "37\n", "authors": ["1526"]}
{"title": "Systematic mapping study on security threats in cloud computing\n", "abstract": " Today, Cloud Computing is rising strongly, presenting itself to the market by its main service models, known as IaaS, PaaS and SaaS, that offer advantages in operational investments by means of on-demand costs, where consumers pay by resources used. In face of this growth, security threats also rise, compromising the Confidentiality, Integrity and Availability of the services provided. Our work is a Systematic Mapping where we hope to present metrics about publications available in literature that deal with some of the seven security threats in Cloud Computing, based in the guide entitled \"Top Threats to Cloud Computing\" from the Cloud Security Alliance (CSA). In our research we identified the more explored threats, distributed the results between fifteen Security Domains and identified the types of solutions proposed for the threats. In face of those results, we highlight the publications that are concerned to fulfill some standard of compliance.", "num_citations": "31\n", "authors": ["1526"]}
{"title": "Heuristic-based strategy for Phishing prediction: A survey of URL-based approach\n", "abstract": " ContextIn the fight against phishing attacks, phishing prediction heuristics are important in developing solutions. However, phishing attacks continue to grow today, reflecting on the need for higher precision solutions.ObjectiveThis article focuses on phishing prediction based on a set of features. The purpose of this proposal is to evaluate the static features used and observe their occurrence in the current phishing. Static aspects refer to elements such as keywords and patterns over the phishing URL.MethodThe study methodology makes use of a survey with a set of 12 features, raised both in this study and from third-party studies, submitted to three distinct samples of phishing and legitimate sites during the year 2018.ResultsAlthough research on phishing prediction has developed considerably, it is possible to note that certain features are of low relevant and others have not accompanied the changes in the …", "num_citations": "24\n", "authors": ["1526"]}
{"title": "Assessing the benefits of open government data: The Case of meu congresso nacional in Brazilian Elections 2014\n", "abstract": " Open Government Data (OGD) and transparency has been recognized as having the potential to provide many benefits for the society at all, including governmental, scientific, commercial and political domains. However, much of the existing research discusses benefits on a high-level basis, and more empirical analysis is needed in order to analyze and assess the real impact of these initiatives. The objective of this paper is to analyze the benefits perceived by the general population of the use of applications based on OGD, especially the Meu Congresso Nacional, a website based on political OGD and broadly used by Brazilian citizens in the Brazilian elections in 2014. The analysis was based on a survey conducted with website visitors and concludes that, despite this kind of application not yet being popular, people consider them more useful than official government websites, able to help reduce corruption and …", "num_citations": "23\n", "authors": ["1526"]}
{"title": "Moving towards\" relationship-aware\" applications and services: A social machine-oriented approach\n", "abstract": " The open, distributed approach of the Web and the relationship's prevalence of applications and services is transforming both the way we develop software and how they operate and interact with each other. As a result, a novel breed of applications is emerging, and consequently new mental models are needed to deal with them. In this paper, we weave \"social\" relationships into software, leading to the notion of \"relationship-aware\" software. Relationship-aware software uses the metaphor of human social relationships and, at the simplest level, is software whose behavior takes into account other software it interacts with. Here, we revisit the concept of relationship and extend the notion of Social Machines to establish a unifying abstraction model that is used for specifying relationship-aware applications and services. To engineer relationship-aware applications, this paper presents a guideline that address some …", "num_citations": "23\n", "authors": ["1526"]}
{"title": "Using parliamentary Brazilian open data to improve transparency and public participation in Brazil\n", "abstract": " Government concerns about transparency date from 1957, but current technological advances and real-time worldwide communications hold great promise to transform accountability, transparency, citizen participation and collaboration, in addition to offering better public services, by increasing efficiency and effectiveness and decreasing corruption in government. With these goals in mind, this paper describes Meu Congresso Nacional (My National Congress), a first prize winner application developed during the First Brazilian Parliament Hackathon focused on parliamentarians transparency by obtaining and analyzing data from several sources and displaying them on a user-friendly website. In addition, based on this development experience, this paper discusses the difficulties and challenges of developing applications based on Brazilian government data.", "num_citations": "19\n", "authors": ["1526"]}
{"title": "Br-scmm: Modelo brasileiro de maturidade para cidades inteligentes\n", "abstract": " As Cidades Inteligentes estão emergindo frente às necessidades da nova sociedade da tecnologia e informação que surgiu neste século. Atualmente não existe um modelo de maturidade que possa medir o quão inteligente uma sociedade pode ser com base em indicadores sociais ou tecnológicos. Criar um modelo de maturidade pressupõe levantar requisitos, analisá-los e definir quais serão transformados em indicadores. Este trabalho visa apresentar o nível inicial de um Modelo de maturidade aplicado às cidades inteligentes.", "num_citations": "18\n", "authors": ["1526"]}
{"title": "Accounting models for cloud computing: A systematic mapping study\n", "abstract": " Cloud services change the economics of computing by enabling users to pay only for the capacity that they actually use. In this context, cloud providers have their own accounting models including their billing mechanisms and pricing schemes to achieve this efficient pay-as-you-go model. Thus it is important to study this heterogeneity aiming to map out the existing accounting models to become possible new proposals or future standardizations. Therefore, this paper focuses on mapping accounting models for cloud computing, where a mapping study process was undertaken, and a total of 23 primary studies were considered, which evidenced 5 accounting models, 31 different pricing scheme types and 4 primary studies related to SLA (Service-Level Agreement) composition. Although the significant number of studies found address grid computing it was possible to identify one accounting model which was very complete from different points of view for cloud environments.", "num_citations": "17\n", "authors": ["1526"]}
{"title": "The dynamic aspects of product derivation in dspl: A systematic literature review\n", "abstract": " Dynamic Software Product Lines (DSPL) have gained significant attention in academic community by involving aspects of product lines and runtime adaptable systems development. Managing dynamic variations demands is a challenge addressed by DSPL paradigm. In this context, this paper introduces the results of a systematic literature review that involved 2,084 studies, with the objective of understanding how the dynamic derivation in DSPL is made. The contributions of this study are: a) an embracing analysis and classification of scientific literature in DSPL area, b) the definition of inputs that are needed to perform the dynamic derivation, c) the description of what composes these inputs, and d) the understanding of the process to perform the dynamic derivation. We conclude that due to the lack of maturity in the dynamic derivation field, there are many open research opportunities still available.", "num_citations": "16\n", "authors": ["1526"]}
{"title": "Experiences integrating heterogeneous government open data sources to deliver services and promote transparency in brazil\n", "abstract": " The use of Government Open Data to deliver services and promote transparency is a current goal of many governments. In this paper, we briefly describe two contest winner applications with focus on these goals, and present a discussion about the difficulties of integrating Government Open Data to develop them.", "num_citations": "15\n", "authors": ["1526"]}
{"title": "How people care about their personal data released on social media\n", "abstract": " Content sharing services have become immensel popular on the Web. More than 1 billion people use this kind o services to communicate with friends and exchange all sorts o information. In this new context, privacy guarantees are essential guarantees about the potential release of data to unintended recipients and the use of user data by the service provider Although the general public is concerned about privacy question related to unintended audiences, data usage by service provider is still misunderstood. In order to further explore this level o misunderstanding, this work presents the results of a surve: conducted among 900 people with the aim of discovering hov people care about the use of their personal data by servic providers in terms of social media. From the results, we found that: (i) in general people do not read license terms and do no know very much about service policies, and when presented with …", "num_citations": "15\n", "authors": ["1526"]}
{"title": "Security threats in cloud computing models: Domains and proposals\n", "abstract": " This work displays metrics about publications available in the literature which deal with some of the seven security threats in Cloud Computing based in the guide entitled \"Top Threats to Cloud Computing\" from the Cloud Security Alliance (CSA). Through this research, it is identified the most explored threats, distributed the results between fifteen Security Domains and identified between eight types of solutions proposed for the threats. In face of those results, it was observed that publications in the literature mostly show a certain trend as the proposals presented for the involved Threats. However, in some cases some variations occur, what motivated us to fulfill an analysis of standard deviation in the results obtained in our research. Based on these data, we present our conception regarding this behavior.", "num_citations": "14\n", "authors": ["1526"]}
{"title": "Usto. re: A private cloud storage software system\n", "abstract": " Cloud computing is a computing model where hardware, platforms and software are seen as services; viz. Infrastructure as a Service, Platform as a Service, and Software as a Service, respectively. Data as a Service (DaaS) is based on the concept that the product, data in this case, can be provided on demand to the user, regardless of geographic or organizational separation between provider and consumer. DaaS applications are for the most part based on excessive data replication in order to guarantee data availability, which means excessive costs in hardware investments. This white paper presents the specification, implementation and evaluation of a system called USTO.RE which aims to be an effective and low-cost alternative for storing data, thereby mitigating the problem of excessive data replication and thus allows itself to be considered a reliable platform from the perspective of data availability …", "num_citations": "13\n", "authors": ["1526"]}
{"title": "Um mapeamento sistemático para problem based learning aplicado à ciência da computação\n", "abstract": " Estudos que envolvem Aprendizagem Baseada em Problemas, especificamente na área de Ciência da Computação, necessitam de mais evidências, principalmente no que tange a utilização da aprendizagem de disciplinas da área de engenharia de software. Diante deste contexto, este trabalho teve como objetivo um estudo de mapeamento sistemático com a finalidade de identificar os estudos que envolvem a prática de PBL com o ensino da Ciência da Computação. Para tal foi utilizado uma metodologia de buscas realizadas em engenhos automatizados, relevantes na área de Informática e Ciência da Computação. A partir da análise o estudo concluiu que grande parte das aplicações de PBL foram voltadas para o ensino de disciplinas como Programação, Engenharia de Software e Sistemas Operacionais, e a utilização de metodologias híbridas com PBL fazendo o uso de Games, e outras metodologias de apoio a PBL, como também construção de aplicativos e uso de ferramentas e tecnologias.", "num_citations": "12\n", "authors": ["1526"]}
{"title": "Is brazilian open government data actually open data?\n", "abstract": " Open Government Data (OGD) hold great promise for transforming the efficiency and effectiveness of public services through the ease of publishing and access to government public information or through the offer of new kinds of services, such as smart cities services and applications. In this work, we analyze the Brazilian OGD current scenario and the main difficulties and challenges of developing applications using that data. First, we performed a structured analysis of Brazilian OGD repositories according to OGD definitions. Then, we analyzed the development of two similar applications that use the OGD of two main Brazilian cities and were submitted to different cities’ application contests and were well evaluated in both of them. Based on the analysis, this work concludes that Brazilian OGD initiatives have to resolve some issues before being considered truly open data for use in application development at large.", "num_citations": "10\n", "authors": ["1526"]}
{"title": "Linhas de Produtos de Software: Uma tendência da indústria\n", "abstract": " Ao longo dos últimos anos uma nova abordagem de reuso de software tem ganhado atenção tanto pela indústria quanto pela academia. Esta abordagem é conhecida como Linhas de Produtos de Software na qual é baseada na reutilização sistemática de artefatos de software, através da exploração de pontos comuns e a gestão de variabilidade entre os produtos, que são estabelecidos sob uma mesma arquitetura. Este conceito de linhas de produtos tem sido utilizado pela indústria de manufatura a anos para reduzir custos e aumentar a produtividade. No entanto esta prática possui um conceito relativamente novo na indústria de software. Estudos têm demonstrado que as organizações têm apresentado melhorias principalmente na produtividade aplicando esta abordagem. Neste contexto, este trabalho apresenta alguns dos aspectos mais importantes sobre linhas de produtos de software, tais como variabilidade, processos de desenvolvimento e finalmente mostrando algumas ferramentas de apoio a Linhas de Produtos de Software (LPS).", "num_citations": "10\n", "authors": ["1526"]}
{"title": "A systematic mapping study on cloud computing\n", "abstract": " Cloud Computing emerges from the global economic crisis as an option to use computing resources from a more rational point of view. In other words, a cheaper way to have IT resources. However, issues as security and privacy, SLA (Service Layer Agreement), resource sharing, and billing has left open questions about the real gains of that model. This study aims to investigate state-of-the-art in Cloud Computing, identify gaps, challenges, synthesize available evidences both its use and development, and provides relevant information, clarifying open questions and common discussed issues about that model through literature. The good practices of systematic map- ping study methodology were adopted in order to reach those objectives. Al- though Cloud Computing is based on a business model with over 50 years of existence, evidences found in this study indicate that Cloud Computing still presents limitations that prevent the full use of the proposal on-demand.", "num_citations": "9\n", "authors": ["1526"]}
{"title": "Measuring distributed applications through MapReduce and traffic analysis\n", "abstract": " Monitoring and evaluating distributed systems at runtime is a difficult effort. Network traffic analysis may be used to analyse distributed systems, but the capacity to analyse large amount of traffic is a challenge. This work proposes the use of Map Reduce for deeply inspecting distributed systems network traffic, evaluating the effectiveness and the processing capacity of Map Reduce for this inspection.", "num_citations": "9\n", "authors": ["1526"]}
{"title": "A web-based platform for scavenger hunt games using the Internet of Things\n", "abstract": " The concept of an “Internet of Things” (IoT) initially referred to a network where objects would be individually and instantly identified with Radio-Frequency Identification (RFID). Such concept was later evolved to a wider notion of heterogeneous objects using ubiquitous technologies to interact among them and with the physical environment. Among these technologies, Bluetooth, ZigBee, GPRS, NFC, QR code, can be cited some of those that were labeled as IoT technologies. Based on the possibility of linking ordinary objects from the physical world to the Internet, this paper proposes and details a platform called TagHunt, for creating and playing scavenger hunt games. It allows smartphones to interact with ordinary objects using IoT-based technologies such as NFC and QR Code, stimulating the user/player to interact with the surrounding environment looking for “clues” in the game. We performed an experiment …", "num_citations": "7\n", "authors": ["1526"]}
{"title": "Cloud testing framework\n", "abstract": " Context: Cloud-based testing introduces a new set of challenges. While many companies are approaching cloud computing with cautious, testing appears to be next area of growing interest. Objective: This paper propose the development of a new framework focusing on cloud testing. We intend to define the activities, roles, techniques, and tools that will be used in an integrated framework. Method: A research methodology containing all the steps that will be executed during the proposal implementation was defined. Results: A schedule was suggested in order to allow the research development. Conclusion: It is concluded that is important to establish the standardization for the cloud environment in order to ensure the cloud applications quality.", "num_citations": "7\n", "authors": ["1526"]}
{"title": "Smartcluster: Utilizando dados públicos para agrupar cidades inteligentes por domínios\n", "abstract": " Atualmente existem vários domínios e indicadores ao redor do mundo que servem para categorizar Cidades Inteligentes, entretanto, não há estudos suficientes sobre a comparação destas cidades no Brasil. As bases de dados públicos dispõem de dados sobre os mais variados indicadores e domínios, e esses dados precisam ser normalizados e agrupados para permitir uma comparação entre as cidades inteligentes brasileiras. Realizar uma análise baseada no agrupamento de similaridade de indicadores de cidades inteligentes pode trazer aos gestores municipais uma maior compreensão das possibilidades estratégicas de otimização de recursos.", "num_citations": "6\n", "authors": ["1526"]}
{"title": "A privacy maturity model for cloud storage services\n", "abstract": " The purpose of this article is to present a PrivacyMaturity Model of services offered by Cloud ComputingProviders in the context of Cloud Storage. This study aims topresent an overview of the current barriers in these scenariosand present a model based on technical analysis of maturity inthese environments. We present the goals to be achieved in thisresearch, as well as the strategies to be pursued to the contents of sensitive data in order to establish a level of effectiveprivacy. Also featuring is planning an architectural model as aprototype, and set in stages as its research and implementation.", "num_citations": "6\n", "authors": ["1526"]}
{"title": "Evaluating performance of distributed systems with mapreduce and network traffic analysis\n", "abstract": " Testing, monitoring and evaluation of distributed systems at runtime is a difficult effort, due the dynamicity of the environment, the large amount of data exchanged between the nodes and the difficulty of reproduce an error for debugging. Application traffic analysis is a method to evaluate distributed systems, but the ability to analyze large amount of data is a challenge. This paper proposes and evaluates the use of MapReduce programming model to deep packet inspection the application traffic of distributed systems, evaluating the effectiveness and the processing capacity of the MapReduce programming model for deep packet inspection of a JXTA distributed storage application, in order to measure performance indicators.", "num_citations": "6\n", "authors": ["1526"]}
{"title": "Reengenharia de Sistemas Legados Baseada em Componentes usando Transformações\n", "abstract": " Este artigo apresenta uma estratégia para Reengenharia de Sistemas Legados Baseada em Componentes usando Transformações, que integra um sistema de transformação, uma ferramenta CASE e outras tecnologias para reconstruir sistemas legados usando componentes distribuídos. A estratégia é realizada em 4 passos: Organizar Código Legado, que organiza código legado, usando transformações, de acordo com os princípios da Orientação a Objetos, segmentando o código em supostas classes, atributos e métodos; Recuperar Projeto, que parte do código legado organizado e também usando transformações de software, gera sua descrição na linguagem MDL (Modeling Domain Language), que importadas numa ferramenta CASE, recuperam o projeto do código legado; Reprojetar, onde o Engenheiro de Software reprojeta o sistema usando componentes de software distribuídos; e Reimplementar, onde a reimplementação do sistema é feita numa linguagem executável alvo da reimplementação.", "num_citations": "6\n", "authors": ["1526"]}
{"title": "DDE-draco domain editor\n", "abstract": " This article presents a domain edition tool for Draco Transformation System, called Draco Domain Editor. In the ST Draco, a domain is defined by a Language composed by: a grammar, a parser and Prettyprinter, or unparser, defined from this grammar. DDE facilitates the domain edition, through textual and graphic resources. Other DDE resources aims the edition of transformation and scripts that guide the transformation application process, and the management of projects that use the ST Draco.", "num_citations": "6\n", "authors": ["1526"]}
{"title": "OKIoT Open Knowledge IoT Project: Smart Home Case Studies of Short-term Course and Software Residency Capstone Project.\n", "abstract": " The emergence of smart environments built on top of Internet of Things (IoT) solutions demand new skills and knowledge for developers. Dealing with inherent complexity of IoT architecture, constrained device limitations, communication faults and vendor lock-in can be drawbacks for successful deploy of IoT projects. With the objective of sharing knowledge between IoT developers, OKIoT project focuses on project-oriented education in Short-term and Long-term modes based on Software Engineering methodology. First qualitative results on a 6-week course on MBA subject offering and a case study of an open architecture for smart speaker executed with 1-year mentoring of a capstone project are summarized. Future steps based on case studies insights are presented.", "num_citations": "5\n", "authors": ["1526"]}
{"title": "Is Brazilian open government data actually open data?: An analysis of the current scenario\n", "abstract": " Open Government Data (OGD) hold great promise for transforming the efficiency and effectiveness of public services through the ease of publishing and access to government public information or through the offer of new kinds of services, such as smart cities services and applications. In this work, we analyze the Brazilian OGD current scenario and the main difficulties and challenges of developing applications using that data. First, we performed a structured analysis of Brazilian OGD repositories according to OGD definitions. Then, we analyzed the development of two similar applications that use the OGD of two main Brazilian cities and were submitted to different cities' application contests and were well evaluated in both of them. Based on the analysis, this work concludes that Brazilian OGD initiatives have to resolve some issues before being considered truly open data for use in application development at large.", "num_citations": "5\n", "authors": ["1526"]}
{"title": "Smart cities architectures-a systematic review\n", "abstract": " The smart cities concept arises from the necessity of managing several problems caused by the unbridled population growth at urban centers. To make a city become “smart” it is needed to employ Information and Communication Technologies (ICT) to access, process and deliver information according to the urban context. This information can be employed to mitigate several urban issues, such as traffic jams, high natural resource consumption, epidemias, sustainability, waste management, low quality and life expectancy of citizens, among others. Thus, the increasing need to create architectures that are able to interact with the Internet of Things, i.e., several built-in devices, appliances, sensors and actuators embedded in each urban context. This work is a systematic review regarding proposals for such architectures. After selecting the relevant approaches, we have identified a set of issues that these approaches …", "num_citations": "5\n", "authors": ["1526"]}
{"title": "Reprojeto de Sistemas Legados Baseado em Componentes de Software\n", "abstract": " Este artigo apresenta uma estratégia para o Reprojeto de Sistemas Legados Baseado em Componentes de Software, que integra um sistema de transformação, uma ferramenta CASE e outras tecnologias para reconstruir sistemas legados usando componentes distribuídos.A estratégia é realizada em 4 passos: Organizar Código Legado, Recuperar Projeto, Reprojetar e Reimplementar. No passo Organizar Código Legado, o código legado é organizado, usando transformações, de acordo com os proncípios da Orientação a Objetos, segmentando o código em supostas classes, atributos e métodos. O passo Recuperar Projeto parte do código legado organizado e também usando transformações de software, gera sua descrição na linguagem MDL (Modeling Domain Language). Estas descrições são importadas numa ferramenta CASE, recuperando o projeto do código legado, representado com notação UML. No passo Reprojetar, o Engenheiro de Software reprojeta o sistema usando componentes distribuídos. Novos requisitos funcionais e nãofuncionais como plataforma, podem ser adicionados neste passo. Finalmente, no passo Reimplementar, faz-se a reimplementação do sistema numa linguagem alvo da reimplementação neste caso, Java. O código final do sistema pode ser gerado pela ferramenta CASE ou usando transformações.", "num_citations": "5\n", "authors": ["1526"]}
{"title": "Learning analytics: A brief overview about applications and its advantages\n", "abstract": " Learning Analytics (LA) is concerned with the use of data resulting from students' interaction with Learning Management Systems (LMS) to carry out analyses that can help students and teachers to understand and evaluate the learning process. However, several works on the subject only expose future expectations of what LA applications can perform. Thus, this paper aims at finding out practical results of LA and if its use has improved teaching and learning.", "num_citations": "4\n", "authors": ["1526"]}
{"title": "A cloud-based recommendation model\n", "abstract": " The recommendation systems aim to minimize information overload by helping user's in searching desired information. Faced with this scenario, we investigate the use of cloud factors able to have a positive influence on generating recommendations. Thus, we present a new, simple model based on cloud features which is associated with the content-based technique of recommendation. The practical applicability of data storage environments in the cloud provides the best use of cloud resources and meets user's preferences.", "num_citations": "4\n", "authors": ["1526"]}
{"title": "Uma abordagem para indexacao e buscas full-text baseadas em conteúdo em sistemas de armazenamento em nuvem\n", "abstract": " O “universo digital” cresce de forma exponencial e a previsão é que em 2015 chegue a quase 8 zettabytes. É cada vez mais complexo processar, armazenar, gerenciar, garantir a segurança e disponibilizar estas informações. O armazenamento em nuvem é apontado como melhor solução para lidar com estes problemas e muitos sistemas têm sido desenvolvidos com este fim. Grande parte destes sistemas tiram proveito da arquitetura peer-to-peer (p2p) para evitar gargalos, pontos únicos de falha e conseguir escalar de forma fácil. A maioria dos sistemas de armazenamento em nuvem existentes não permite que o usuário faça buscas mais complexas, por exemplo, levando em consideração o conteúdo dos arquivos ou informações presente nos metadados. Com isso essa pesquisa tem como objetivo propor uma abordagem para extração e indexação de conteúdo dos arquivos, de forma que o sistema permita que sejam realizadas buscas full-text baseadas no conteúdo dos arquivos em sistemas de armazenamento em nuvem com arquitetura peer-to-peer. Além disso, essa pesquisa também tem como objetivo investigar uma maneira eficiente para armazenar o índice de busca dentro da arquitetura P2P, de forma que seja possível replicar as informações com facilidade, permita elasticidade, garanta disponibilidade e, com isso, permitir que as buscas encontrem a maior quantidade de resultados relevantes possível.", "num_citations": "4\n", "authors": ["1526"]}
{"title": "Monext: An accounting framework for infrastructure clouds\n", "abstract": " Cloud Accounting refers to how cloud usage is recorded and charged. Even in the case of a single cloud provider this task is hard and there is a context which it becomes even worse, known as federated cloud. It happens when a cloud provider dynamically outsources resources to other providers in response to demand variation. In this context, we identified some research addressing this area which developed platforms for federated clouds, however without addressing the accounting requirement. This work presents the Monext, an accounting framework for Infrastructure as a Service, focused on federated clouds. It is based on a standard accounting process, follows a set of principles specified by previous research, and offers a Domain Specific Language (DSL) to define charging policies. We evaluated the framework under a federated cloud platform called JiTCloud. The results provided evidences that Monext …", "num_citations": "4\n", "authors": ["1526"]}
{"title": "Evaluating mapreduce for profiling application traffic\n", "abstract": " The use of MapReduce for distributed data processing has been growing and achieving benefits with its application for different workloads. MapReduce can be used for distributed traffic analysis, although network traces present characteristics which are not similar to the data type commonly processed through MapReduce. Motivated by the use of MapReduce for profiling application traffic and due to the lack of evaluation of MapReduce for network traffic analysis and the peculiarity of this kind of data, this paper evaluates the performance of MapReduce in packet level analysis and DPI, analysing its scalability, speed-up, and the behavior of MapReduce phases. The experiments provide evidences for the predominant phases in this kind of job, and show the impact of input size, block size and number of nodes, on MapReduce completion time and scalability.", "num_citations": "4\n", "authors": ["1526"]}
{"title": "Accounting federated clouds based on the JiTCloud platform\n", "abstract": " Cloud accounting refers to how cloud usage is recorded and charged. We identified four federated cloud platforms which do not include an accounting system. This work presents an accounting mechanism implemented for one of these platforms focused on IaaS. Further, we analyse our proposal in a qualitative fashion.", "num_citations": "4\n", "authors": ["1526"]}
{"title": "Experiences from a Brazilian Bank Reengineering Project\n", "abstract": " The migration of legacy mainframe applications to new web technologies is a challenge faced by several organizations. Since 2005, the Pitang and C.E.S.A.R companies are involved in a large migration project for a bank institution, aiming to migrate NATURAL/ADABAS legacy mainframe source code to a web-based platform. In this paper, we briefly describe the project's evolution and lessons learned.", "num_citations": "4\n", "authors": ["1526"]}
{"title": "Reengenharia de software usando transformações (RST)\n", "abstract": " The strategy is accomplished in 4 steps: Organize Legacy Code, Recover Project, Reproject and Reimplement. In the Organize Legacy Code step, the legacy code is organized, using transformations, according to the principles of the Object Orientation, segmenting it in supposed classes, attributes and methods. The Recover Project step starts off with the organized legacy code and also using software transformations, generates its project description in the Modeling Domain Language, MDL. The MDL descriptions are read in a CASE tool, recovering the legacy code project, represented with UML techniques. In the Reproject step, the Software Engineer reprojects the system with distributed software components. New functional and non-functional requirements can be added in this step. The Catalysis method is used to reproject the distributed component-oriented system. Finally, in the Reimplement step, the system reimplementation is done in an executable language target of the reimplementation. The system final code can be generated in a CASE tool or using transformations. The CASE tool generates the code through the specifications of the new distributed component-oriented project and the transformational system through its MDL description.", "num_citations": "4\n", "authors": ["1526"]}
{"title": "Towards a maturity model for learning analytics adoption an overview of its levels and areas\n", "abstract": " Learning Analytics is a new field in education whose adoption can bring benefits for teaching and learning processes. However, many higher education institutions may not be ready to start using learning analytics due to challenges such as organizational culture, infrastructure, and privacy. In this context, Maturity Models (MMs) can support institutions to systematize their processes, enabling them to progress successively in the learning analytics adoption. MMs are used in different fields to support the improvement of processes, describing them in terms of maturity levels, and identifying enhancements that could lead an organization to higher levels of such maturity. Thus, this paper presents an outline of a MM for Learning Analytics adoption in higher education institutions, describing its levels and areas, together with its development methodology.", "num_citations": "3\n", "authors": ["1526"]}
{"title": "SmartCluster: Using Public Data to Group Smart Cities by Domains.\n", "abstract": " There are currently several domains and indicators around the world that serve to categorize Smart Cities, however, there are not enough studies on the comparison of these cities in Brazil. The public databases have data on various indicators and domains, and these data need to be standardized and clustered to allow a comparison between the smart cities. Make an analysis based on clustering similarity smart cities indicators can bring to the municipal managers a better understanding of the strategic possibilities of resource optimization.", "num_citations": "3\n", "authors": ["1526"]}
{"title": "A File Recommendation Model For Cloud Storage Systems.\n", "abstract": " The technological development in recent years has experienced the exponentially growth of the digital universe, part of this digital universe lies stored in cloud storage systems. With each day, more of these systems come out, offering data", "num_citations": "3\n", "authors": ["1526"]}
{"title": "Mapeamento Sistematico de Informatica Medica para Cidades Inteligentes\n", "abstract": " Objetivo: Atualmente estão sendo propostas muitas soluções na área de informática médica que otimizam e melhoram o atendimento médico a população. Otimizar processos e gerenciar recursos também é o objetivo das Cidades Inteligentes que utilizam a informática médica como um de seus domínios. Para isso, este trabalho procura apresentar um levantamento bibliográfico destas iniciativas. Resultado: Foram obtidos mais de quinhentos artigos, dos quais informações referentes ao estudo de Informática Médica para Cidades Inteligentes foram selecionados. Conclusão: A junção desses dois conceitos pode beneficiar as cidades do futuro, mas antes é necessário quantificar e mapear as pesquisas nessas áreas para identificar as lacunas desses estudos, e assim, propor novas soluções.", "num_citations": "3\n", "authors": ["1526"]}
{"title": "Component-Oriented Software Reengineering using Transformations\n", "abstract": " The strategy is divided in 4 steps: Organize Legacy Code, Recover Project, Reproject and Reimplement. In the Organize Legacy Code step, the legacy code is organized, according to the Object-Oriented principles, partitioning in supposed classes, attributes and methods to facilitate the Component-Oriented Reengineering. In the Recover Project step, it is obtained the legacy system descriptions in MDL (Modeling Domain Language) that will be persisted using UML techniques, in the MVCase tool. The project is recovered in the MVCase tool, starting off with MDL descriptions, and the organized code parts, corresponding to the procedures and functions, candidates to methods of a class, are transformed to Java. In the Reproject step, it is done the Component-Oriented reproject of the project recovered in the MVCase tool, to satisfy the new requirements, following the Catalysis method and the Enterprise Java Beans technique (EJB). Finally, in the Reimplement step, the components description in MDL/Catalysis are transformed into Java beans, and integrated to the Java code of the methods, obtaining the system final implementation.", "num_citations": "3\n", "authors": ["1526"]}
{"title": "Um Modelo de Recomendação de Arquivos para Sistemas de Armazenamento em Nuvem\n", "abstract": " O desenvolvimento tecnológico vivenciado nos últimos anos proporcionou o crescimento do universo digital de forma exponencial, parte desse universo digital encontra-se armazenado em sistemas de armazenamento em nuvem. A cada dia surgem mais destes sistemas, que oferecem o armazenamento de dados de forma distribuıda com alta taxa de disponibilidade, o que tem impucionado cada vez mais usuários a migrarem seus dados para a nuvem. No entanto, a grande quantidade de arquivos armazenada nestes sistemas dificulta a filtragem de conteúdo relevante, demandando tempo e trabalho por parte do usuário na busca por arquivos com conteúdo similar as suas preferências. Diante deste cenário, esta pesquisa propoe um modelo de recomendaçao para sistemas de armazenamento em nuvem, que tem como objetivo utilizar caracterısticas da nuvem associadasa técnica de recomendaçao baseada em conteúdo.", "num_citations": "2\n", "authors": ["1526"]}
{"title": "SMADL–The social machines architecture description language\n", "abstract": " We are experiencing a high growth in the number of Web applications being developed. This is happening mainly because the Web is going into a new phase, called programmable Web, where several Web-based systems make their APIs publicly available. In order to deal with the complexity of this emerging Web, we define the notion of a Social Machine and envisage a language that can describe networks of such. To start with, we define a Social Machine (SM) as a “connectable and programmable building block that wraps (WI) an information processing system (IPS) and defines a set of required (RS) and provided services (PS), dynamically available under constraints (C) which are determined by, among other things, its relationships (Rel) with others”. In other words, a SM is a connected machine, usually to the Web, which dynamically provides and/or requires a set of services according to its established relationships. Any application in the Web can be seen as a SM. In order to make feasible the practical application of the aforementioned Social Machine concept, we define SMADL – the Social Machines Architecture Description Language – as an attempt to be a completely different way to program the Web, mixing concepts from Architecture Description Languages (ADLs) and Domain-Specific Languages (DSLs). As an ADL, it allows the description of Social Machines (and networks of such) in terms of relationships (Rel) as high-level abstractions, without the need to specify details of communication (protocols) and/or authentication methods. As a DSL, it allows the implementation and integration of Web services using a dynamically typed …", "num_citations": "2\n", "authors": ["1526"]}
{"title": "Methods and processes definitions for multiplatform social network games development with distributed teams\n", "abstract": " In recent decades, agile methodologies have contributed in the process of developing software as an efficient way to manage requirements. Game development for geographically distributed teams includes additional elements that also need to be managed properly. This work is an experience report of a game development by geographically distributed team, using Scrum methodology. The game runs on web and mobile platforms and has interface with social networks such as Facebook and Twitter. The purpose of this article is to contribute to the discussion about Scrum's adaptation for game development with respect to the methods, process definition and tools used in conception, design, definition, prioritization of backlog items, monitoring requirements and quality assurance.", "num_citations": "2\n", "authors": ["1526"]}
{"title": "Termos em português para Desenvolvimento de Software Orientado a Aspectos\n", "abstract": " Este poster tem por objetivo prover subsıdios iniciais para uma discussao mais aprofundada a respeito dos termos mais adequados a serem utilizados para a traduçao e escrita de textos referentes ao desenvolvimento de software orientado a aspectos.", "num_citations": "2\n", "authors": ["1526"]}
{"title": "Learning Analytics em Ação: Uma Revisão Sistemática de Literatura\n", "abstract": " Context: Learning Analytics (LA) is a recent trend in education, and its impacts are not widely demonstrated yet. Aim: Identify and summarize practical results of using LA concerning teaching and learning. Methodology: Systematic Literature Review. Results: From 757 papers, 14 have shown evidence to understand practical results for teachers and students while using LA. Conclusions: LA has contributed to improving teaching and learning in different circumstances, after students receiving automated feedback, and supported teachers to achieve insights about assessments, which could never be revealed without using LA.", "num_citations": "1\n", "authors": ["1526"]}
{"title": "A Microservice Based Architecture to Support Offloading in Mobile Cloud Computing\n", "abstract": " Mobile devices are increasingly present in people's daily lives. However, despite the substantial improvement of new generations of smartphones, the amount of information and the complexity of the procedures delegated to these devices still imposes certain restrictions on processing, especially regarding energy consumption. A promise solution to this issue is the technique known as offloading. Over the last few years, several offloading support platforms have been proposed. This work has a particular interest in one of those platforms, called CAOS. Despite its success to perform offloading tasks, CAOS still has problems such as low scalability. In this paper, we report on the refactoring of CAOS into a new microservice-based architecture. Performance and scalability evaluations were performed in both monolithic and microservices versions to show the benefits achieved with the new CAOS architecture.", "num_citations": "1\n", "authors": ["1526"]}
{"title": "Um relato sobre a migração de uma plataforma de offloading para microsserviços\n", "abstract": " Os dispositivos móveis estão cada vez mais presentes no dia a dia das pessoas. No entanto, apesar da evolução das novas gerações de smartphones, a quantidade de informações e a complexidade dos procedimentos delegados a esses dispositivos, ainda impõem restrições ao processamento, principalmente relacionado ao consumo de energético. Uma solução que vem sendo utilizada para esse problema é a técnica conhecida como offloading. Nos últimos anos, várias plataformas de suporte ao offloading foram propostas. Este trabalho tem foco em uma dessas plataformas, denominado CAOS. Apesar de realizar tarefas de offloading com êxito, o CAOS ainda apresenta problemas como baixa escalabilidade. Neste estudo, descrevemos o processo de migração do CAOS para uma nova arquitetura baseada em microsserviços, evidenciando as decisões e práticas que foram adotadas nessa jornada.", "num_citations": "1\n", "authors": ["1526"]}
{"title": "Suscetibilidade através da forja de ﬁdedignidade: uma abordagem sobre ataques de phishing\n", "abstract": " No combate aos incidentes de segurança relacionados a ataques de phishing, inúmeras são as soluções propostas no intuito de minimizar a incidência desses ataques. Contudo, esses continuam crescendo nos dias de hoje, fazendo reﬂetir sobre a precisão dessas soluções. Este artigo enfoca a exploração de phishing baseada em conjunto de características que visam abusar da suscetibilidade do usuário ﬁnal. Como resultado, além dos dados quantitativos, o estudo também realizou uma análise qualitativa dos comportamentos, conseguindo identiﬁcar aspectos como relevância, relações e similaridades entre as características. Diante disso, é esperado que os resultados obtidos tragam uma reﬂexão sobre as novas abordagens ou maior robustez nas existentes.", "num_citations": "1\n", "authors": ["1526"]}
{"title": "Uma modelagem de risco centrada em comportamentos para o desenvolvimento seguro de serviços no ecossistema web\n", "abstract": " O objetivo deste artigo é apresentar uma modelagem de risco para o desenvolvimento de serviços no ecossistema Web. A proposta visa estimar um fator de risco e impacto aos ativos considerando a violação de dados, os aspectos humanos e a conformidade do serviço. Além de considerar os comportamentos de seus atores, dispositivos e recursos. Adicionalmente, a proposta é validada através de catálogos de ataques top-threats disponíveis publicamente e testes estruturais com a linguagem Java e técnicas BDD. Com isso, é possível observar sua aplicabilidade sobre os riscos mais emergentes, caracterizando-se como um artefato que proporciona um desenvolvimento guiado na prevenção de ameaças para serviços da Web.", "num_citations": "1\n", "authors": ["1526"]}
{"title": "Tópicos em sistemas de Informação\n", "abstract": " Dentre as atividades de Simpósio Brasileiro de Sistemas de Informação (SBSI) a discussão de temas atuais sobre pesquisa e ensino, e também sua relação com a indústria, é sempre oportunizada. Neste âmbito, os minicursos constituem-se para a comunidade em oportunidades de formação e atualização em determinados tópicos de pesquisa.Na edição 2016 foram selecionados quatro minicursos dentre dezessete propostas submetidas por meio de uma chamada pública amplamente divulgada por meio de listas eletrônicas da SBC (Sociedade Brasileira de Computação). Todas as propostas receberam, no mínimo, três avaliações realizadas por um Comitê composto por quarenta e cinco professores doutores, que consideraram critérios como relevância para o evento, expectativa do público, atualidade e conteúdo. O SBSI 2016 inova também por lançar, pela primeira vez, o conteúdo dos minicursos no formato de livro, cujas quatro propostas selecionadas constituem os seus capítulos.", "num_citations": "1\n", "authors": ["1526"]}
{"title": "Modelos de Negócios Inovadores na Era da Computaçao em Nuvem\n", "abstract": " Business models are few understood in our generation. The initial image is a complex and laborious, seen by many as unnecessary. Business mo-dels have become an essential tool for entrepreneurs. With technological deve-lopments emerged several businesses, some of these businesses are in the cloud or are cloud-based. In this scenario, this work presents the main concepts of cloud computing and business models.Resumo. Modelos de negócios sao poucos compreendidos em nossa geraçao. A imagem inicial e de algo complexo e trabalhoso, visto por muitos como desnecessário. Os modelos de negócios se tornaram uma ferramenta fundamental para empreendedores. Com a evoluçao tecnológica surgiram diversos negócios, parte desses negócios estao na nuvem ou sao baseados em nuvem. Diante desse cenário, este trabalho apresenta os principais conceitos de computaçao em nu-vem e modelos de negócios.", "num_citations": "1\n", "authors": ["1526"]}
{"title": "SCiAl: usando dados públicos para agrupar cidades Alagoanas\n", "abstract": " O conceito de Cidades Inteligentes surgiu frente às necessidades da nova sociedade da tecnologia e informação em identificar formas de otimizar recursos. Atualmente existem modelos para comparar e medir os domínios dessas cidades, sobretudo modelos americanos e europeus. Entretanto, estes modelos se mostram ineficazes ou incompatíveis com as necessidades de pequenas e médias cidades, cujas preocupações ainda residem nos domínios de infraestrutura e oferta de serviços públicos básicos. Este trabalho apresenta o resultado da mineração de dados abertos públicos e a comparação de indicadores que permitiu criar um agrupamento de cidades inteligentes por semelhanças de características regionais chamado: SCiAl–Smart Cities Alagoas.", "num_citations": "1\n", "authors": ["1526"]}
{"title": "Toward a QoS Based Run-time Reconfiguration in Service-oriented Dynamic Software Product Lines.\n", "abstract": " Ford invented the product line that makes possible to mass produce by reducing the delivery time and production costs. Regarding the software industry, this, roughly presents both a manufacturing and mass production that generates products that are denoted as individual software and standard software (Pohl et al., 2005): a clear influence of Fordism in the development paradigm of Software Product Lines (SPL). However, this development paradigm was not designed to support user requirements changes at run-time. Faced with this problem, the academy has developed and proposed the Dynamic Software Product Lines (DSPL)(Hallsteinsen et al., 2008) paradigm. Considering this scenario, we objective contribute to DSPL field presenting a new way of thinking which DSPL features should be connected at run-time to a product based on an analysis of quality attributes in service levels specified by the user. In order to validate the proposed approach we tested it on a context-aware DSPL. At the end of the exploratory validation we can observe the effectiveness of the proposed approach in the DSPL which it was applied. However, it is necessary to perform another studies in order to achieve statistical evidences of this effectiveness.", "num_citations": "1\n", "authors": ["1526"]}
{"title": "Frederico Durao, Jose Fernando S. Carvalho, Anderson Fonseka &\n", "abstract": " Cloud computing is an ascending technology that has introduced a new paradigm by rendering a rational computational model possible. It has changed the dynamics of IT consumption by means of a model that provides on-demand services over the Internet. Unlike the traditional hosting service, cloud computing services are paid for per usage and may expand or shrink based on demand. Such services are, in general, fully managed by cloud providers that require users nothing but a personal computer and an Internet access. In recent years, this model has attracted the attention of researchers, investors and practitioners, many of whom have proposed a number of applications, structures and fundamentals of cloud computing, resulting in various definitions, requirements and models. Despite the interest and advances in the field, issues such as security and privacy, service layer agreement, resource sharing, and billing have opened up new questions about the real gains of the model. Although cloud computing is based on a 50-year-old business model, evidence from this study indicates that cloud computing still needs to expand and overcome present limitations that prevent the full use of its potential. In this study, we critically review the state of the art in cloud computing with the aim of identifying advances, gaps and new challenges.", "num_citations": "1\n", "authors": ["1526"]}
{"title": "VeloZ: A charging policy specification language for infrastructure clouds\n", "abstract": " Cloud Accounting refers to how cloud usage is recorded and charged. It is present at all commercialized cloud services (SaaS, PaaS and IaaS), since they have to monitor the consumption aiming to charge the customers. In a previous research we performed a systematic mapping study regarding cloud accounting and identified a set of shortcomings in the existing accounting models for IaaS. One of these limitations was related to charging policy specification. Charging policies are mechanisms that establish rules to convert usage records into monetary information. This paper presents a Domain Specific Language (DSL) for charging policy specification: VeloZ. Such DSL enables cloud providers to write charging policies following the economic model RaaS. According to RaaS, the IaaS must be provisioned in a high granularity in terms of resource types and such granularity is profitable for both, provider and …", "num_citations": "1\n", "authors": ["1526"]}
{"title": "Just-in-time clouds uma abordagem para federaçao de clouds privadas\n", "abstract": " Este artigo descreve a solução Just-in-Time (JiT) Cloud para a federação de clouds privadas. Uma JiT Cloud consiste na agregação de diversos JiT Data Centres (JiT DCs) geograficamente dispersos e provê infraestrutura computacional como serviço (IaaS) por meio da alocação sob demanda de máquinas virtuais. A solução é composta por três módulos de software que permitem a gerência da infraestrutura por parte de um administrador e de máquinas virtuais por parte de usuários clientes. Atualmente existe uma JiT Cloud em produção composta por seis JiT DCs distribuídos em três estados brasileiros (Paraíba, São Paulo e Rio G. do Sul).", "num_citations": "1\n", "authors": ["1526"]}
{"title": "Desafios em Cloud computing: Armazenamento, Banco de Dados e BIG Data\n", "abstract": " Com o aumento da velocidade de conectividade e evolução dos sistemas WEB, começa a surgir os sistemas de Internet, que mais comumente são chamados de Computação nas Nuvens. Este termo designa uma plataforma de suporte a sistemas de software que provê aos seus usuários: gerenciamento, uso sob demanda, adequação às necessidades, racionalização do uso dos recursos e automação dos processos relacionados a criação de infra-estruturas. Neste contexto surge os sistemas de armazenamento de dados em nuvem, escalabilidade de banco de dados e busca e recuperação que hoje chamamos de BIGDATA. Este minicurso aborda estes temos exemplificando como implementar e utilizar tais plataformas.", "num_citations": "1\n", "authors": ["1526"]}
{"title": "Software as a Service: Desenvolvendo Aplicações Multi-tenancy com Alto Grau de Reuso\n", "abstract": " Software como serviço (SaaS) representa um novo paradigma e um modelo de negócios onde as empresas não precisam comprar e manter sua própria infraestrutura de TI. Ao invés disso, elas adquirem um serviço de software de terceiros, obtendo assim consideráveis benefícios, principalmente no que tange a redução de custos de manutenção dessa infraestrutura. O objetivo desse minicurso é apresentar os principais conceitos relacionados à arquitetura multi-tenancy, uma das abordagem para implementação de Software como Serviço. Durante esse trabalho serão apresentadas as principais tecnologias associadas ao assunto e um exemplo prático da implementação de um aplicativo multi-tenancy utilizando o framework Grails e componentes reutilizáveis.", "num_citations": "1\n", "authors": ["1526"]}
{"title": "An approach to developing multi-tenancy SaaS using metaprogramming\n", "abstract": " In last years have seen an increase in SaaS (Software as a Service) use. The development of multi-tenancy web application (one of the main ways to provide SaaS) increased considerably after the start of call\" Web 2.0 Age\". This work presents an approach for implementation of a multi-tenancy SaaS application, and an architecture based on plugins and metaprogramming to achieve a high level software reuse. This approach is presented through an experience report described throughout the paper.", "num_citations": "1\n", "authors": ["1526"]}
{"title": "Adoção de Metodologias Ágeis para Produção de Jogos Sociais com Times Distribuídos\n", "abstract": " A utilização de metodologias ágeis para desenvolvimento de software tem se tornado uma demanda em times geograficamente distribuídos. Este trabalho tem por objetivo relatar as experiências obtidas em uma fábrica de software open-source, criada por alunos de pos-graduação da universidade federal de Pernambuco, no desenvolvimento de jogos sociais multiplatafoma. Descrevendo o processo de adaptação da metodologia Scrum no desenvolvimento de jogos sociais com equipes distribuídas.", "num_citations": "1\n", "authors": ["1526"]}
{"title": "Uma proposta arquitetural para serviços escaláveis de dados em nuvens\n", "abstract": " The increase of the peer-to-peer networks popularity is related to decentralized resources sharing, where peers could exchanging messages among theirs. Through the aggregation and replication techniques, this model offer more robustness and performance when compared to client-server model. In this context, where the peer-to-peer paradigm was selected to development the U-Store, a data cloud solution project, this article presents an architectural proposal towards to create distributed and scalable services, aiming to solve the known issues such as latency, performance, load balancing and so on.Resumo. O aumento da popularidade de redes peer-to-peer, está relacionado com o compartilhamento de recursos descentralizado, onde os pares podem trocar mensagens entre si. Através de técnicas de agregaçao e de replicaçao, este modelo oferece mais robustez e desempenho quando comparado ao modelo cliente-servidor. Neste contexto, onde o paradigma peer-to-peer (p2p) foi selecionado para o desenvolvimento do U-Store, uma soluçao de dados em nuvem, este artigo apresenta uma proposta de arquitetura para a criaçao de serviços distribuıdos e escaláveis, com o objetivo de solucionar questoes relativasa latência, desempenho, balanceamento de carga dentre outros.", "num_citations": "1\n", "authors": ["1526"]}
{"title": "Adoção de metodologias ágeis para produção de jogos sociais com times distribuídos\n", "abstract": " A utilização de metodologias ágeis para desenvolvimento de software tem se tornado uma demanda em times geograficamente distribuídos. Este trabalho tem por objetivo relatar as experiências obtidas em uma fábrica de software open source para desenvolvimento de jogos sociais, adaptando a metodologia Scrum para o processo de desenvolvimento distribuído.", "num_citations": "1\n", "authors": ["1526"]}
{"title": "Game development guidelines: Practices to avoid conflicts between software and design\n", "abstract": " The game process is guided traditionally by the Game Design Document, a document which contains all the necessary info to support the team through the game development process. The Game Design Document contents is insufficient, starting a conflict between game designers and programmers. This work aims to study the game development process and recommend guidelines to reduce the conflicts between the Design and the Software development phases.", "num_citations": "1\n", "authors": ["1526"]}
{"title": "Implementações de Frameworks de Componentes, dirigidas por Modelos do Método Catalysis\n", "abstract": " Este artigo trata de implementações de frameworks de componentes dirigidas por modelos do método Catalysis. Dois enfoques de implementação são apresentados e comparados. Um enfoque utiliza o gerador de código da ferramenta Bold e o outro, utiliza a Ferramenta Draco-PUC. Um Framework, denominado FrameCardio, do domínio de cardiologia é apresentado como exemplo. O FrameCardio, foi construído em 4 passos:", "num_citations": "1\n", "authors": ["1526"]}
{"title": "Estratégia de Reengenharia de Software Baseada em Componentes Distribuídos\n", "abstract": " The strategy is accomplished in 4 steps: Organize Legacy Code, Recover Project, Reproject and Reimplement. In the Organize Legacy Code step, the legacy code is organized, using transformations, according to the principles of the Object Orientation, segmenting it in supposed classes, attributes and methods. The Recover Project step starts from the organized legacy code and also using software transformations, generates its project description in the MDL (Modeling Domain Language) language. The MDL descriptions are read in a CASE tool, recovering the legacy code project, represented with UML techniques. In the Reproject step, the Software Engineer reprojects the system with distributed software components. New functional and non-functional requirements can be added in this step. Finally, in the Reimplement step, the system reimplementation is done in an executable language target of the reimplementation.", "num_citations": "1\n", "authors": ["1526"]}