{"title": "A Riccati-Bernoulli sub-ODE method for nonlinear partial differential equations and its application\n", "abstract": " The Riccati-Bernoulli sub-ODE method is firstly proposed to construct exact traveling wave solutions, solitary wave solutions, and peaked wave solutions for nonlinear partial differential equations. A Bäcklund transformation of the Riccati-Bernoulli equation is given. By using a traveling wave transformation and the Riccati-Bernoulli equation, nonlinear partial differential equations can be converted into a set of algebraic equations. Exact solutions of nonlinear partial differential equations can be obtained by solving a set of algebraic equations. By applying the Riccati-Bernoulli sub-ODE method to the Eckhaus equation, the nonlinear fractional Klein-Gordon equation, the generalized Ostrovsky equation, and the generalized Zakharov-Kuznetsov-Burgers equation, traveling solutions, solitary wave solutions, and peaked wave solutions are obtained directly. Applying a Bäcklund transformation of the Riccati-Bernoulli equation, an infinite sequence of solutions of the above equations is obtained. The proposed method provides a powerful and simple mathematical tool for solving some nonlinear partial differential equations in mathematical physics.", "num_citations": "140\n", "authors": ["1703"]}
{"title": "Swim: Synthesizing what i mean-code search and idiomatic snippet synthesis\n", "abstract": " Modern programming frameworks come with large libraries, with diverse applications such as for matching regular expressions, parsing XML files and sending email. Programmers often use search engines such as Google and Bing to learn about existing APIs. In this paper, we describe SWIM, a tool which suggests code snippets given API-related natural language queries such as “generate md5 hash code”. The query does not need to contain framework-specific trivia such as the type names or methods of interest. We translate user queries into the APIs of interest using clickthrough data from the Bing search engine. Then, based on patterns learned from open-source code repositories, we synthesize idiomatic code describing the use of these APIs. We introduce structured call sequences to capture API-usage patterns. Structured call sequences are a generalized form of method call sequences, with if-branches …", "num_citations": "134\n", "authors": ["1703"]}
{"title": "Independent measurement of the neutrino mixing angle  via neutron capture on hydrogen at Daya Bay\n", "abstract": " A new measurement of the θ 13 mixing angle has been obtained at the Daya Bay Reactor Neutrino Experiment via the detection of inverse beta decays tagged by neutron capture on hydrogen. The antineutrino events for hydrogen capture are distinct from those for gadolinium capture with largely different systematic uncertainties, allowing a determination independent of the gadolinium-capture result and an improvement on the precision of the θ 13 measurement. With a 217-day antineutrino data set obtained with six antineutrino detectors and from six 2.9 GW th reactors, the rate deficit observed at the far hall is interpreted as sin 2 2 θ 13= 0.083±0.018 in the three-flavor oscillation model. When combined with the gadolinium-capture result from Daya Bay, we obtain sin 2 2 θ 13= 0.089±0.008 as the final result for the six-antineutrino-detector configuration of the Daya Bay experiment.", "num_citations": "83\n", "authors": ["1703"]}
{"title": "Nuciferine, extracted from Nelumbo nucifera Gaertn, inhibits tumor-promoting effect of nicotine involving Wnt/β-catenin signaling in non-small cell lung cancer\n", "abstract": " Ethnopharmacological relevanceThe leaves of Nelumbo nucifera Gaertn are recorded in the earliest written documentation of traditional Chinese medicinal as “Ben Cao Gang Mu”, a medicinal herb for blood clotting, dysentery and dizziness. Recently, nuciferine (NF), one of N. nucifera Gaertn leaf extracts has been shown to possess several pharmacological properties, including anti-viral and anti-cancer. The aim of this study is to investigate the underlying molecular mechanism of the anti-cancer activity of NF in NSCLC progression induced by nicotineMaterials and methodsThe effect of NF on proliferation of A549 (human lung adenocarcinoma epithelial cell line) pretreated with or without nicotine was detected by tumor cell proliferation assay. TOP-Flash reporter assay was applied to investigate the activity of Wnt/β-catenin signaling in tumor cells in the presence of NF and/or nicotine. Apoptosis was measured …", "num_citations": "61\n", "authors": ["1703"]}
{"title": "The muon system of the Daya Bay Reactor antineutrino experiment\n", "abstract": " The Daya Bay experiment consists of functionally identical antineutrino detectors immersed in pools of ultrapure water in three well-separated underground experimental halls near two nuclear reactor complexes. These pools serve both as shields against natural, low-energy radiation, and as water Cherenkov detectors that efficiently detect cosmic muons using arrays of photomultiplier tubes. Each pool is covered by a plane of resistive plate chambers as an additional means of detecting muons. Design, construction, operation, and performance of these muon detectors are described.", "num_citations": "58\n", "authors": ["1703"]}
{"title": "What good are strong specifications?\n", "abstract": " Experience with lightweight formal methods suggests that programmers are willing to write specification if it brings tangible benefits to their usual development activities. This paper considers stronger specifications and studies whether they can be deployed as an incremental practice that brings additional benefits without being unacceptably expensive. We introduce a methodology that extends Design by Contract to write strong specifications of functional properties in the form of preconditions, postconditions, and invariants. The methodology aims at being palatable to developers who are not fluent in formal techniques but are comfortable with writing simple specifications. We evaluate the cost and the benefits of using strong specifications by applying the methodology to testing data structure implementations written in Eiffel and C#. In our extensive experiments, testing against strong specifications detects twice as …", "num_citations": "55\n", "authors": ["1703"]}
{"title": "Is branch coverage a good measure of testing effectiveness?\n", "abstract": " Most approaches to testing use branch coverage to decide on the quality of a given test suite. The intuition is that covering branches relates directly to uncovering faults. The empirical study reported here applied random testing to 14 Eiffel classes for a total of 2520 hours and recorded the number of uncovered faults and the branch coverage over time. For the tested classes, (1) random testing reaches 93% branch coverage (2) it exercises almost the same set of branches every time, (3) it detects different faults from execution to execution, (4) during the first 10 minutes of testing, while branch coverage increases rapidly, there is a strong correlation between branch coverage and the number of uncovered faults, (5) over 50% of the faults are detected at a time where branch coverage hardly changes, and the correlation between branch coverage and the number of uncovered faults is weak.             These results …", "num_citations": "49\n", "authors": ["1703"]}
{"title": "A scaled underwater launch system accomplished by stress wave propagation technique\n", "abstract": " A scaled underwater launch system based on the stress wave theory and the slip Hopkinson pressure bar (SHPB) technique is developed to study the phenomenon of cavitations and other hydrodynamic features of high-speed submerged bodies. The present system can achieve a transient acceleration in the water instead of long-time acceleration outside the water. The projectile can obtain a maximum speed of 30 m/s in about 200 μs by the SHPB launcher. The cavitation characteristics in the stage of acceleration and deceleration are captured by the high-speed camera. The processes of cavitation inception, development and collapse are also simulated with the business software FLUENT, and the results are in good agreement with experiment. There is about 20–30% energy loss during the launching processes, the mechanism of energy loss is also preliminary investigated by measuring the energy of the …", "num_citations": "36\n", "authors": ["1703"]}
{"title": "Shedding phenomenon of ventilated partial cavitation around an underwater projectile\n", "abstract": " A new shedding phenomenon of ventilated partial cavitations is observed around an axisymmetric projectile in a horizontal launching experiment. The experiment system is established based on SHPB launching and high speed photography. A numerical simulation is carried out based on the homogeneous mixture approach, and its predicted evolutions of cavities are compared with the experimental results. The cavity breaks off by the interaction between the gas injection and the re-entry jet at the middle location of the projectile, which is obviously different from natural cavitation. The mechanism of cavity breaking and shedding is investigated, and the influences of important factors are also discussed.", "num_citations": "34\n", "authors": ["1703"]}
{"title": "Stateful testing: Finding more errors in code and contracts\n", "abstract": " Automated random testing has shown to be an effective approach to finding faults but still faces a major unsolved issue: how to generate test inputs diverse enough to find many faults and find them quickly. Stateful testing, the automated testing technique introduced in this article, generates new test cases that improve an existing test suite. The generated test cases are designed to violate the dynamically inferred contracts (invariants) characterizing the existing test suite. As a consequence, they are in a good position to detect new faults, and also to improve the accuracy of the inferred contracts by discovering those that are unsound. Experiments on 13 data structure classes totalling over 28,000 lines of code demonstrate the effectiveness of stateful testing in improving over the results of long sessions of random testing: stateful testing found 68.4% new faults and improved the accuracy of automatically inferred …", "num_citations": "26\n", "authors": ["1703"]}
{"title": "Main linac lattice design and optimization for Ecm= 1 TeV CLIC\n", "abstract": " The Compact Linear Collider (CLIC) is a future e+ e− linear collider. The CLIC study concentrated on a design of center-of-mass energy of 3 TeV and demonstrated the feasibility of the technology. However, the physics also demands lower energy collision. To satisfy this, CLIC can be built in stages. The actual stages will depend on LHC results. Some specific scenarios of staged constructions have been shown in CLIC Concept Design Report (CDR). In this paper, we concentrate on the main linac lattice design for E cm= 1 TeV CLIC aiming to upgrade from E cm= 500 GeV CLIC and then to E cm= 3 TeV one. This main linac accelerates the electron or positron beam from 9 GeV to 500 GeV. A primary lattice design based on the 3 TeV CLIC main linac design and its optimization based on the beam dynamics study will be presented. As we use the same design principles as 3TeV CLIC main linac, this optimization is …", "num_citations": "17\n", "authors": ["1703"]}
{"title": "利用颜色和熵提取感兴趣区域的感性图像检索\n", "abstract": " 感性图像检索是一种新型的检索技术,这种检索具有较高的复杂性.一幅图像中能够使人们产生感性认识的可能只有部分区域,准确地找到感兴趣区域能有效地降低复杂度.作为图像基本特征的颜色对人的感觉有重要的影响,颜色的差异和对比使人产生了不同的情感.同时,图像的熵也反应了图像中包含信息量的大小,图像的熵也是引起人们产生感性认识的一个度量.提出了利用图像的颜色和熵提取感兴趣区域进行感性图像检索的方法,通过BP神经网络将感兴趣区域的颜色特征和熵映射到情感特征空间,具有较好的检索效果.", "num_citations": "17\n", "authors": ["1703"]}
{"title": "土壤中毒死蜱和微生物相互作用的研究\n", "abstract": " 实验结果表明,50,500,5000g·kg-1的毒死蜱在灭菌土中的降解速度十分缓慢,60 d后,仅降解20%左右,在施过毒死蜱的土壤中的降解速度非常迅速,60 d后,50 mg·kg-1的降解率接近100%,500mg·kg-1的降解率达到90%,5000g·kg-1的降解率在80%左右,在未灭菌但未施过毒死蜱的土壤中的降解速度则介于二者之间.在各处理的土壤,50和500 mg·kg-1的毒死蜱在处理前期对真菌和细菌数量有一定的刺激作用,60 d后,基本恢复到正常水平,而5000 mg·kg-1的毒死蜱则对真菌和细菌的数量有较强的抑制作用,60 d后仍不能恢复.在同样处理条件下,施过毒死蜱土壤中的真菌和细菌数量并不比未施过毒死蜱土壤中的占优势,表明毒死蜱在施过药的土壤中降解速度的加快并不是由细菌和真菌的数量决定的,而是由它们的降解能力决定的.", "num_citations": "15\n", "authors": ["1703"]}
{"title": "Partial Wave Analysis of the Decay ψ′→J/ψ π+π-\n", "abstract": " In this paper, a model-independant amplitude for the decay process of ψ′→ J/ψ π+ π-is constructed from a few basic rules: Lorentz invariance, PCAC (Partial Conservation of Axial Current) and QCD low energy theorem. Based on this amplitude, a new and complete partial wave analysis to this process is carried out. Formulae of angular correlation distribution, invarant mass spectrum and two dimension (joint angular correlation and invarant mass) distribution are given. It is pointed out that there exist D-wave in the ψ′→ J/ψ π+ π-process and part of the D-wave is caused by recoil of J/ψ.", "num_citations": "15\n", "authors": ["1703"]}
{"title": "孕妇孕期营养知识和态度的影响因素分析\n", "abstract": " 目的:了解广州市孕妇孕期营养认识水平的影响因素,为有针对地提出干扰措施提供科学依据.方法:在我院产检门诊随机抽取347例孕龄34周以上的初孕妇女,对她们进行现场问卷调查并采用方差,相关,回归等分析.结果:孕妇的孕期营养知识水平不同程度地受到孕妇及其丈夫的文化程度,职业,教育性质,工作性质,家庭形态,营养知识来源,是否参加过孕期营养知识讲座,居住地区等因素的影响,上述因素对营养知识的影响较营养态度明", "num_citations": "14\n", "authors": ["1703"]}
{"title": "混凝土坝温控防裂智能监控系统及其工程应用\n", "abstract": " 阐述了混凝土坝智能监控的基本理念,即通过成套的仪器设备和软件系统,实现施工信息的实时采集,实时传输,自动管理,自动评价,仿真与预测分析,风险实时评价与预警,反馈实时自动控制等,可以为混凝土坝的施工质量监控提供一种新的途径.本文还针对混凝土坝温控施工的难题,介绍了笔者所在的研究团队研发的混凝土坝温控防裂智能监控系统,结合鲁地拉工程提出了智能监控系统服务于混凝土温控防裂的应用模式,可在同类工程中推广.", "num_citations": "13\n", "authors": ["1703"]}
{"title": "Projected Runge-Kutta methods for constrained Hamiltonian systems\n", "abstract": " Projected Runge-Kutta (R-K) methods for constrained Hamiltonian systems are proposed. Dynamic equations of the systems, which are index-3 differential-algebraic equations (DAEs) in the Heisenberg form, are established under the framework of Lagrangian multipliers. R-K methods combined with the technique of projections are then used to solve the DAEs. The basic idea of projections is to eliminate the constraint violations at the position, velocity, and acceleration levels, and to preserve the total energy of constrained Hamiltonian systems by correcting variables of the position, velocity, acceleration, and energy. Numerical results confirm the validity and show the high precision of the proposed method in preserving three levels of constraints and total energy compared with results reported in the literature.", "num_citations": "10\n", "authors": ["1703"]}
{"title": "Relation of the project manager leadership and performance\n", "abstract": " This paper is to propose the index system on evaluation of the project manager leadership and project performance through analysis the influence factors of project manager leadership to the project performance, as well as to establish the LISREL structural model by using the structural equation model to describe the relationship of project manager leadership and performance. The method of questionnaires has been adapted to collect datum. Then, two hypotheses put forward have been demonstrated in empirical study: the project manager leadership has direct correlation to performance; the influencing factors of project manager leadership to performance are different, the project manager's individual influence is the most remarkable.", "num_citations": "10\n", "authors": ["1703"]}
{"title": "基于生物光学模型的水体叶绿素浓度反演算法\n", "abstract": " 文章提出了一种基于生物光学模型的二类水体叶绿素浓度反演算法.本算法根据生物光学模型,利用一系列已知各组分浓度的反射光谱计算各组分的吸收和后向散射系数,然后采用非负最小二乘法解得叶绿素浓度.研究是在实验室内进行了绿藻的培养,且在暗室内测定了具有不同叶绿素和非藻类悬浮物浓度的水体样本的反射光谱.并把实验室测得的反射光谱重采样到Landsat TM对应的波段以检验该算法在TM数据中的适用性,同时比较了利用不同TM波段组合反演叶绿素浓度和非藻类悬浮物浓度的精度.结果表明,对于绿藻而言,利用TM第二,三,四波段反射率数据的组合反演时的效果最好,叶绿素浓度反演结果的均方根误差为4.7μg.L^-1,其精度明显优于传统的回归分析算法.", "num_citations": "9\n", "authors": ["1703"]}
{"title": "Research on Silicone Modified Waterborne Polyurethane-Acrylate Emulsion\n", "abstract": " 以聚酯多元醇, 异佛尔酮二异氰酸酯, 甲基丙烯酸甲酯等为原料, 合成了水性聚氨酯丙烯酸乳液, 加入含侧氨基和不饱和双键的有机硅氧烷进行扩链改性, 得到了一系列有机硅改性的聚氨酯丙烯酸乳液. 对得到的产物进行了表征, 对改性前后的体系涂膜的性能进行了比较, 结果表明, 用有机硅改性的聚氨酯丙烯酸乳液形成的涂膜接触角更大, 附着力更强, 具有更好的耐水性, 但硬度稍有下降.", "num_citations": "8\n", "authors": ["1703"]}
{"title": "科尔沁沙地丘间低地樟子松人工林水分利用来源的稳定同位素解析\n", "abstract": " 生态学杂志 Chinese Journal of Ecology 摇 2011, 30 (9): 1894-1900 摇 摇 摇 摇 摇 摇 摇 摇 摇 摇 摇 摇 摇 from May to October 2008. The water utilization sources of Mongolian pine mainly came from 20-40 cm soil layer or even much deeper soil layers, and there existed strong competition for soil water between Mongolian pine and S. gordejevii. S. gordejevii could earlier utilize the late strong precipitation (> 10 mm), giving impact on the water source supply of Mongolian pine. This study had significance for better understanding the decline of Mongolian pine in relation to its water uti 鄄 lization strategy on sandy land.", "num_citations": "7\n", "authors": ["1703"]}
{"title": "Metabolic flux and nutrient uptake modeling of normal and apoptotic CHO cells\n", "abstract": " Applying metabolic flux analysis as the basis, a dynamic mathematical model was developed for describing the growth and metabolic behavior of CHO cells producing monoclonal antibodies (MAb) in batch culture. The viable cell population was assumed to consist of normal growing, normal non-growing and apoptotic cell subpopulations. A logistic cell growth model was derived that differentiates between actively dividing, resting, and apoptotic cells. The rate of apoptotic cell formation was assumed to have a second order dependence on the normal cell concentration. The proposed mathematical model for metabolites included distinct terms that reflected the metabolic rates of growing and non-growing cell populations. The results of the prediction were in good agreement with experimental data for different initial conditions.", "num_citations": "6\n", "authors": ["1703"]}
{"title": "The homogeneous balance of undetermined coefficients method and its application\n", "abstract": " The homogeneous balance of undetermined coefficients method is firstly proposed to solve such nonlinear partial differential equations (PDEs), the balance numbers of which are not positive integers. The proposed method can also be used to derive more general bilinear equation of nonlinear PDEs. The Eckhaus equation, the KdV equation and the generalized Boussinesq equation are chosen to illustrate the validity of our method. The proposed method is also a standard and computable method, which can be generalized to deal with some types of nonlinear PDEs.", "num_citations": "5\n", "authors": ["1703"]}
{"title": "Roles of UGT 1A1 gene mutation in the development of neonatal hyperbilirubinemia in Guangxi\n", "abstract": " Neonatal unconjugated hyperbilirubinemia is one of the most common conditions encountered by the practicing pediatricians. Although it is usually self-limited and benign, the condition is of importance because of the rare instances in which severe hyperbilirubinemia can lead to bilirubin encephalopathy or kernicterus. The uridine diphosphate-glucuronosyl transferase 1A1 (UGT 1A1) gene controls bilirubin conjugation by determining the structure of the enzyme glucuronosyltransferase, which is synthesized in the hepatocyte. In the recent years much has been learned about the relationship between UGT 1A1 gene mutation and neonatal hyperbilirubinemia. This study aimed to investigate the roles of UGT 1A1 gene mutation in the development of neonatal hyperbilirubinemia in Guangxi. A total of 73 cases with hyperbilirubinemia and 31 healthy neonates were enrolled. UGT 1A1 G71R genotypes were identified by the (amplification refractory mutation system, ARMS) and direct sequencing method in all the neonates. To analyze the incidence of bilirubin encephalopathy, the peak (total serum bilirubin, TSB) concentration after 72 hours of age, and the possibility of TSB> 20 mg/dl of each group.(1) The frequencies of allele G71R were 0.1915 in this study, 0.2329 in hyperbilirubinemia group vs. 0.097 in healthy groups. The allele gene frequency of G71R in neonatal hyperbilirubinemia was higher than that in the normal group (P< 0.05).(2) Homozygous neonates had higher possibility to develop bilirubin encephalopathy and higher TSB concentration 72 hours after birth (28.57%, 23.12±4.58) than the normal group (0%, 17.68±2.69). The difference …", "num_citations": "5\n", "authors": ["1703"]}
{"title": "Exact combined traveling wave solutions and multi-symplectic structure of the variant Boussinesq–Whitham–Broer–Kaup type equations\n", "abstract": " The homogeneous balance of undetermined coefficients method (HBUCM) is firstly proposed to construct not only the exact traveling wave solutions, three-wave solutions, homoclinic solutions, N-soliton solutions, but also multi-symplectic structures of some nonlinear partial differential equations (NLPDEs). By applying the proposed method to the variant Boussinesq equations (VBEs), the exact combined traveling wave solutions and a multi-symplectic structure of the VBEs are obtained directly. Then, the definition and a multi-symplectic structure of the variant Boussinesq–Whitham–Broer–Kaup type equations (VBWBKTEs) which can degenerate to the VBEs, the Whitham–Broer–Kaup equations (WBKEs) and the Broer–Kaup equations (BKEs) are given in the multi-symplectic sense. The HBUCM is also a standard and computable method, which can be generalized to obtain the exact solutions and multi-symplectic …", "num_citations": "4\n", "authors": ["1703"]}
{"title": "An improved energy and constraint conserving algorithm for constrained Hamiltonian systems\n", "abstract": " In this paper, an improved Verlet’s method, has been proposed to solve the differential-algebraic equations (DAEs). Firstly, a parameter is introduced to modify the Verlet’s method to preserve energy exactly. Then, a new algorithm scheme is developed to discretize DAEs in the constrained Hamiltonian systems. The constraint equations are accurately satisfied at each time step, and the problem of constraint violation is avoided. Finally, numerical results confirm the validity of present method by comparing the results with those reported in the published literature. It is also found that the proposed algorithm is suitable for both the weak and strong nonlinear constrained Hamiltonian systems with the properties of high accuracy, long-term stability, and the proposed method is potentially useful for the application of trajectory of tethered satellites.", "num_citations": "4\n", "authors": ["1703"]}
{"title": "边缘和方向估计的自适应多尺度分块压缩感知算法\n", "abstract": " 由于多尺度小波变换的分块压缩感知算法(MS-BCS-SPL)将每层子带信息进行分块时,使得每层子带中各子块间的采样率相同;但是,当不同的图像子块含有不同的边缘信息时,对这些子块采用相同的采样率会造成资源分配不合理.因此在MS-BCS-SPL算法的基础上,利用图像块边缘信息的不同和图像块的方向性,将总的采样率自适应分配给各层子带中的各子块,实现多尺度分块压缩感知的自适应采样.实验结果表明,在不同采样率,尤其较低采样率时,该算法不仅比MS-BCS-SPL算法采用了较少的采样数目,节约资源;而且比其可重构较高质量的图像.", "num_citations": "4\n", "authors": ["1703"]}
{"title": "Approaches of constructing expressional vectors utilized in plant genetic transformation\n", "abstract": " Construction of expression vector plays an important role in plant gene engineering, and is closely related with the expressional results of target gene. Based on the previous research work, the five different kinds of vector construction methods were summarized depending on their construction strategy. The suggestions have been proposed, aiming at specific plant expressional vector, to utilize the different construction strategy. Construction of multi-link in a serials of small fragment of vector cloning method recommended by one step methods, when building a complex multi-link fragments of the large vector using the complex constructing vector technology, in order to get the marker-free transgenic plants it can be used three T-DNAs vector construction methods. Adoption of the Gateway technology in doing functional verification, constructing very simple vector can be using the traditional method of construction though digestion and connection. The mainstream way of construction vectors now is to use Gateway technology combing with other means, the development trend of the future constructing vector will be on no enzyme connection. At the same time, the tendency of plant vector construction in the future was prospected. It is hoped to promote the understandings of plant expressional vector construction.", "num_citations": "4\n", "authors": ["1703"]}
{"title": "Selective sorption of latex membranes with ethanol-water mixtures\n", "abstract": " Latex membranes have recently found use in pervaporation separation. The sorption of water-ethanol mixtures to latex membranes was carried out on three types of latex membranes, poly(acrylonitrile-co-butyl acrylate) [P(AN-BuA)], poly(methyl methacrylate-co-butyl acrylate) [P(MMA-BuA)], and poly(styrene-co-butyl acrylate) [P(ST-BuA)], which were prepared in our laboratory by direct casting of polymer latexes synthesized by emulsion polymerization. These latex membranes all exhibit preferential sorption and permeation toward water. Both water and ethanol sorption to the latex membranes exhibited nonideal sorption, with water sorption being enhanced greatly by the presence of ethanol. It was shown that the solubility parameter theory did not give correct predictions for the preferential sorption of latex membranes. Better results were obtained by using the Flory-Huggins interaction parameter …", "num_citations": "4\n", "authors": ["1703"]}
{"title": "Exact solutions and multi-symplectic structure of the generalized KdV-type equation\n", "abstract": " The homogeneous balance of undetermined coefficients method is proposed to obtain not only exact solutions but also multi-symplectic structure of some nonlinear partial differential equations. Bilinear equation, N-soliton solutions, traveling wave solutions and multi-symplectic structure are obtained by applying the proposed method to the KdV equation. Accordingly, the definition and multi-symplectic structure of the generalized KdV-type equation are given. The proposed method is also a standard and computable method, which can be generalized to deal with some types of nonlinear partial differential equations.", "num_citations": "3\n", "authors": ["1703"]}
{"title": "Characterization and biocontrol ability of fusion chitinase in Escherichia coli carrying chitinase cDNA from Trichothecium roseum\n", "abstract": " The antifungal mechanism of mycoparasitic fungi involves fungal cell wall degrading enzymes such as chitinases. Trichothecium roseum is an important mycoparasitic fungus with significant antifungal ability, but studies on chitinases of T. roseum were poor. Here, we report a novel chitinase cDNA isolated from T. roseum by PCR amplification based on conserved chitinase sequences. Southern blot analysis suggested that a single copy of the gene exists in the genome of T. roseum. The deduced open reading frame of 1,143 nucleotides encodes a protein of 380 amino acids with a calculated molecular weight of 41.6 kDa. The fusion chitinase expressed in Escherichia coli has been purified by single-step chromatography. It has a pI of pH 5.4 and expresses a thermal stability, but is insensitive to pH in a broad pH range. According to expectation, E. coli efficiently yielded a high amount of active chitinase. Remarkably …", "num_citations": "3\n", "authors": ["1703"]}
{"title": "萘酰亚胺类荧光染料及共聚型荧光聚氨酯乳液的合成与性能\n", "abstract": " 首先以 4-溴-1, 8-萘酐, 2-氨基-1, 3-丙二醇和甲醇钠为原料, 经亚胺化和取代两步反应合成出 4-甲氧基-N-(2-羟基-1-羟甲基乙基)-1, 8-萘酰亚胺 (MHHNA) 活性荧光染料, 然后将其作为扩链剂通过相反转自乳化法制备出了共聚型荧光聚氨酯 (PU)(PU-MHHNA) 乳液, 并分别采用核磁共振氢谱 (1 H NMR), 核磁共振碳谱 (13 CNMR), 元素分析, 傅里叶变换红外 (FTIR) 光谱, 紫外-可见 (UV-Vis) 吸收光谱, 荧光光谱, 粒度分析, 氙灯老化等方法对所得荧光染料的化学结构, PU 乳液及乳胶膜的性能进行了表征. 结果表明, MHHNA 和 PU-MHHNA 的荧光量子产率分别为 0.73 和 0.92, MHHNA 的用量对所得 PU 乳液的胶体性质没有明显影响. PU-MHHNA 的丙酮溶液在 UV-Vis 吸收光谱上的最大吸收波长 (λ max) 为 360.6 nm, 在荧光光谱上的最大激发波长 (λ ex) 和最大发射波长 (λ em) 分别为 362 和 435 nm. 随着温度的升高, PU-MHHNA 的荧光强度逐渐降低. PU-MHHNA 乳胶膜的耐光色牢度和耐溶剂色牢度均明显高于共混型荧光聚氨酯 (PU/MBNA) 乳胶膜.", "num_citations": "2\n", "authors": ["1703"]}
{"title": "中碳微合金非调质钢涨断连杆的开发\n", "abstract": " 为提高发动机连杆性能,用中碳微合金非调质钢36MnVS4试制了发动机连杆,并对试制连杆的性能进行了检测.结果表明,试制的36MnVS4连杆的化学成分,显微组织,力学性能,疲劳性能,台架耐久性能和道路试验性能等性能不仅满足技术要求,且比高碳微合金非调质钢C70S6连杆的性能优异,可代替C70S6生产连杆,提高连杆性能.", "num_citations": "2\n", "authors": ["1703"]}
{"title": "A high-speed, real-time mobile gait rehabilitation system\n", "abstract": " Combining advanced technologies in real-time wireless communication, control theory, sensor and actuator design, and rehabilitation science.", "num_citations": "2\n", "authors": ["1703"]}
{"title": "Results from the daya bay reactor neutrino experiment\n", "abstract": " Abstract The Daya Bay Reactor Neutrino Experiment was designed to achieve a sensitivity on the value of sin 2 2 θ 13 to better than 0.01 at 90% CL. The experiment consists of eight antineutrino detectors installed underground at different baselines from six nuclear reactors. With data collected with six antineutrino detectors for 55 days, Daya Bay announced the discovery of a non-zero value for sin 2 2 θ 13 with a significance of 5.2 standard deviations in March 2012. The most recent analysis with 139 days of data acquired in a six-detector configuration yields sin 2 2 θ 13= 0.089±0.010 (stat.)±0.005 (syst.), which is the most precise measurement of sin 2 2 θ 13 to date.", "num_citations": "2\n", "authors": ["1703"]}
{"title": "Productivity prediction methods for tight gas reservoir with low permeability\n", "abstract": " Fight gas reservoir with low permeability is characterized by low porosity, low permeability and high water saturation, compared with conventional gas reservoir. Evaluation method of productivity is greatly different from conventional gas reservoir. Main influential factors are threshold pressure gradient, stress sensitivity and slippage effect for the productivity of low permeability gas well. Aiming at the features of tight gas reservoir with low permeability, the gas well deliverability equations considering threshold pressure gradient, stress sensitivity and slippage effect are derived Study results show that we can gain other productivity equations through taking limits on the both sides of the productivity equation considering pressure gradient, stress sensitivity and slippage effect. Finally, we deal with the productivity test data. The results indicate that the deliverability equations of low permeability gas reservoir and …", "num_citations": "2\n", "authors": ["1703"]}
{"title": "络合剂作用下光催化氧化纳米铁氧化物的生成及机理\n", "abstract": " 进行了空气氧化Fe(OH)2悬浮液,络合剂(乙二胺,草酸,柠檬酸)作用下光催化氧化制备FeOOH的研究.结果表明:在室光下,一定量乙二胺,草酸,柠檬酸的加入有利于纯γ-FeOOH的生成;且随光强的增强,γ-FeOOH的晶化性降低.机理分析表明:可见光存在下,络合剂的加入,不仅使中间物绿锈GR(Ⅱ)结晶度变差,溶解加快;而且络合剂与Fe^2+形成的配合物可吸收部分可见光,生成强氧化型的自由基,使反应初期Fe^2+快速氧化为Fe^3+,快的氧化速度利于生成低晶化度的γ-FeOOH.", "num_citations": "2\n", "authors": ["1703"]}
{"title": "炸药球壳中长程绕射爆轰波的传播行为\n", "abstract": " 进行了一点引爆的塑料粘结炸药(HMX/TATB=87/7)球壳中长程绕射爆轰波传播实验.针对实验结果给出一种简便的近似计算方法,它能准确地重现炸药球壳中长程绕射爆轰波的非理想传播行为.", "num_citations": "2\n", "authors": ["1703"]}
{"title": "水电厂汽轮机油颗粒度的在线测量装置研究\n", "abstract": " 本文研究了一套能用于在线测量水电厂汽轮机油颗粒度的装置,采用了一种新的测量方法(超声衰减法)对洪江水力发电厂2#机组轴承油系统和调速器系统的汽轮机油进行了测量,并与显微镜法测量结果进行对比,结果表明该装置测量结果误差更小,更符合实际情况.此外,该装置还能实现汽轮机油多参数测量,如粘度,浓度等,成本低,可以作为其他测量方法的重要补充.", "num_citations": "1\n", "authors": ["1703"]}
{"title": "碾压混凝土坝数字监控系统及其工程应用\n", "abstract": " 数字监控是混凝土坝工程质量控制新的理念.基于这一思想,研发了碾压混凝土坝数字监控系统.该系统可实现对大坝开始施工直至服役结束整个生命过程的工作性态的监控,从过程中最大限度地杜绝裂缝的产生,该系统在鲁地拉碾压混凝土重力坝中得以实施,实践表明,该系统可有效指导温控施工的全过程,成功实现了温度信息的自动获取,温控资料的数字集成和自动分析,分析成果的多方共享,预警信息的自动发布以及温控档案的备份查询等.", "num_citations": "1\n", "authors": ["1703"]}
{"title": "亲和色谱法研究 β_2-肾上腺素受体与盐酸巴马汀和盐酸药根碱的相互作用\n", "abstract": " 采用亲和色谱法研究了β2-肾上腺素受体(β2-AR)与中药活性小分子盐酸巴马汀(Pa)和盐酸药根碱(Ja)的相互作用.前沿色谱法说明Pa与β2-AR之间存在一类结合位点,Ja与β2-AR之间存在两类结合位点.在pH 7.4,25℃时,用竞争洗脱法测得了Pa与β2-AR的结合常数为2.93×104 L?mol-1,结合位点浓度为1.13×10-4 mol?L-1,Ja在β2-AR低,高亲和力位点上的结合常数分别为1.93×104和1.56×105 L?mol-1,对应的结合位点浓度分别为1.25×10-4 mol?L-1和1.00×10-5 mol?L-1,两类结合位点数的比值为93∶7,且Pa和Ja在低亲和力位点上存在竞争作用.热力学研究表明,静电力是这两种药物与β2-AR之间作用的主要驱动力.", "num_citations": "1\n", "authors": ["1703"]}
{"title": "Evaluating the Resistance Performance to Stress Corrosion Cracking for High Strength oil Casing Steels with MTS Testing Machine\n", "abstract": " The application of MTS testing machine in the evaluation of resistance to Sulfide Stress Corrosion (SSC) cracking for high strength oil casing steels has been introduced in the paper. For a Double Cantilever Beam (DCB) specimen, by means of the fitted functional relationship between unloading compliance coefficiency and crack length from a closed loop curve relative to the loading and unloading process, crack extension during fatigue precracking for a DCB specimen could be effectively controlled. In addition, after SSC preparation, the critical balance load due to the wedge inserts could be measured from the force-displacement curve recording the process of loading-wedge removal-unloading, the front of the crack propagation induced by SSC could be marked clearly by secondarily fatigue cracking, which is necessary for the determination of factor, K_ (1SSC).", "num_citations": "1\n", "authors": ["1703"]}
{"title": "纺锤形 α-Fe2O3 粒子的溶液催化合成\n", "abstract": " 以Fe2(SO4)3为原料,在pH为4~7,微量催化剂Fe2+离子及晶体助长剂NaH2PO4存在下,沸腾回流,短时间可直接成长出纺锤形α-Fe2O3超细粒子.与强迫水解法和水热法比较,该方法具有操作简单,反应物浓度高,反应条件温和及重现性好等优点.同时研究了各种因素对产物的轴比及相转化速率的影响.", "num_citations": "1\n", "authors": ["1703"]}