{"title": "CMS physics technical design report, volume II: physics performance\n", "abstract": " CMS is a general purpose experiment, designed to study the physics of pp collisions at 14 TeV at the Large Hadron Collider (LHC). It currently involves more than 2000 physicists from more than 150 institutes and 37 countries. The LHC will provide extraordinary opportunities for particle physics based on its unprecedented collision energy and luminosity when it begins operation in 2007.", "num_citations": "2779\n", "authors": ["878"]}
{"title": "The CMS experiment at the CERN LHC\n", "abstract": " The Compact Muon Solenoid (CMS) detector is described. The detector operates at the Large Hadron Collider (LHC) at CERN. It was conceived to study proton-proton (and leadlead) collisions at a centre-of-mass energy of 14 TeV (5.5 TeV nucleon-nucleon) and at luminosities up to 1034 cm− 2s− 1 (1027 cm− 2s− 1). At the core of the CMS detector sits a high-magneticfield and large-bore superconducting solenoid surrounding an all-silicon pixel and strip tracker, a lead-tungstate scintillating-crystals electromagnetic calorimeter, and a brass-scintillator sampling hadron calorimeter. The iron yoke of the flux-return is instrumented with four stations of muon detectors covering most of the 4π solid angle. Forward sampling calorimeters extend the pseudorapidity coverage to high values (| η|≤ 5) assuring very good hermeticity. The overall dimensions of the CMS detector are a length of 21.6 m, a diameter of 14.6 m and a total weight of 12500 t.", "num_citations": "2549\n", "authors": ["878"]}
{"title": "Observation of long-range, near-side angular correlations in proton-proton collisions at the LHC\n", "abstract": " Results on two-particle angular correlations for charged particles emitted in proton-proton collisions at center-of-mass energies of 0.9, 2.36, and 7 TeV are presented, using data collected with the CMS detector over a broad range of pseudorapidity (η) and azimuthal angle (ϕ). Short-range correlations in Δη, which are studied in minimum bias events, are characterized using a simple “independent cluster” parametrization in order to quantify their strength (cluster size) and their extent in η (cluster decay width). Long-range azimuthal correlations are studied differentially as a function of charged particle multiplicity and particle transverse momentum using a 980 nb− 1 data set at 7 TeV. In high multiplicity events, a pronounced structure emerges in the two-dimensional correlation function for particle pairs with intermediate p T of 1–3 GeV/c, 2.0<| Δη|< 4. 8 and Δϕ≈ 0. This is the first observation of such a long-range, near …", "num_citations": "2064\n", "authors": ["878"]}
{"title": "Description and performance of track and primary-vertex reconstruction with the CMS tracker\n", "abstract": " A description is provided of the software algorithms developed for the CMS tracker both for reconstructing charged-particle trajectories in proton-proton interactions and for using the resulting tracks to estimate the positions of the LHC luminous region and individual primary-interaction vertices. Despite the very hostile environment at the LHC, the performance obtained with these algorithms is found to be excellent. For t bar t events under typical 2011 pileup conditions, the average track-reconstruction efficiency for promptly-produced charged particles with transverse momenta of p T> 0.9GeV is 94% for pseudorapidities of| η|< 0.9 and 85% for 0.9<| η|< 2.5. The inefficiency is caused mainly by hadrons that undergo nuclear interactions in the tracker material. For isolated muons, the corresponding efficiencies are essentially 100%. For isolated muons of p T= 100GeV emitted at| η|< 1.4, the resolutions are approximately …", "num_citations": "1846\n", "authors": ["878"]}
{"title": "The CMS trigger system\n", "abstract": " This paper describes the CMS trigger system and its performance during Run 1 of the LHC. The trigger system consists of two levels designed to select events of potential physics interest from a GHz (MHz) interaction rate of proton-proton (heavy ion) collisions. The first level of the trigger is implemented in hardware, and selects events containing detector signals consistent with an electron, photon, muon, tau lepton, jet, or missing transverse energy. A programmable menu of up to 128 object-based algorithms is used to select events for subsequent processing. The trigger thresholds are adjusted to the LHC instantaneous luminosity during data taking in order to restrict the output rate to 100 kHz, the upper limit imposed by the CMS readout electronics. The second level, implemented in software, further refines the purity of the output stream, selecting an average rate of 400 Hz for offline event storage. The objectives, strategy and performance of the trigger system during the LHC Run 1 are described.", "num_citations": "1776\n", "authors": ["878"]}
{"title": "CMS Physics: Technical Design Report Volume 1: Detector Performance and Software\n", "abstract": " Although the Standard Model (SM) of particle physics has so far been tested to exquisite precision, it is considered to be an effective theory up to some scale Λ≈ TeV. The prime motivation of the Large Hadron Collider (LHC) is to elucidate the nature of electroweak symmetry breaking for which the Higgs mechanism is presumed to be responsible. The experimental study of the Higgs mechanism also can shed light on the mathematical consistency of the SM at energy scales above about 1 TeV. However, there are alternatives that invoke more symmetry such as supersymmetry or invoke new forces or constituents such as strongly-broken electroweak symmetry, technicolour, etc. An as yet unknown mechanism is also possible. Furthermore there are high hopes for discoveries that could pave the way towards a unified theory. These discoveries could take the form of supersymmetry or extra dimensions, the latter requiring modification of gravity at the TeV scale. Hence there are many compelling reasons to investigate the TeV energy scale. Hadron colliders are well suited to the task of exploring new energy domains, and the region of 1 TeV constituent centre-of-mass energy can be explored if the proton energy and the luminosity are high enough. The beam energy (7 TeV) and the design luminosity (L= 1034 cm− 2 s− 1) of the LHC have been chosen in order to study physics at the TeV energy scale. Hence a wide range of physics is potentially possible with the seven-fold increase in energy and a hundred-fold increase in integrated luminosity over the current hadron collider experiments. These conditions also require a very careful design of the …", "num_citations": "389\n", "authors": ["878"]}
{"title": "The CMS high level trigger\n", "abstract": " At the Large Hadron Collider at CERN the proton bunches cross at a rate of 40 MHz. At the Compact Muon Solenoid experiment the original collision rate is reduced by a factor of  (1000) using a Level-1 hardware trigger. A subsequent factor of  (1000) data reduction is obtained by a software-implemented high level trigger (HLT) selection that is executed on a multi-processor farm. In this review we present in detail prototype CMS HLT physics selection algorithms, expected trigger rates and trigger performance in terms of both physics efficiency and timing.", "num_citations": "311\n", "authors": ["878"]}
{"title": "CMS physics technical design report: Addendum on high density QCD with heavy ions\n", "abstract": " This report presents the capabilities of the CMS experiment to explore the rich heavy-ion physics programme offered by the CERN Large Hadron Collider (LHC). The collisions of lead nuclei at energies, will probe quark and gluon matter at unprecedented values of energy density. The prime goal of this research is to study the fundamental theory of the strong interaction—Quantum Chromodynamics (QCD)—in extreme conditions of temperature, density and parton momentum fraction (low-x).", "num_citations": "274\n", "authors": ["878"]}
{"title": "Identification and filtering of uncharacteristic noise in the CMS hadron calorimeter\n", "abstract": " Commissioning studies of the CMS hadron calorimeter have identified sporadic uncharacteristic noise and a small number of malfunctioning calorimeter channels. Algorithms have been developed to identify and address these problems in the data. The methods have been tested on cosmic ray muon data, calorimeter noise data, and single beam data collected with CMS in 2008. The noise rejection algorithms can be applied to LHC collision data at the trigger level or in the offline analysis. The application of the algorithms at the trigger level is shown to remove 90% of noise events with fake missing transverse energy above 100 GeV, which is sufficient for the CMS physics trigger operation.", "num_citations": "235\n", "authors": ["878"]}
{"title": "Challenges in QCD matter physics--The scientific programme of the Compressed Baryonic Matter experiment at FAIR\n", "abstract": " Substantial experimental and theoretical efforts worldwide are devoted to explore the phase diagram of strongly interacting matter. At LHC and top RHIC energies, QCD matter is studied at very high temperatures and nearly vanishing net-baryon densities. There is evidence that a Quark-Gluon-Plasma (QGP) was created at experiments at RHIC and LHC. The transition from the QGP back to the hadron gas is found to be a smooth cross over. For larger net-baryon densities and lower temperatures, it is expected that the QCD phase diagram exhibits a rich structure, such as a first-order phase transition between hadronic and partonic matter which terminates in a critical point, or exotic phases like quarkyonic matter. The discovery of these landmarks would be a breakthrough in our understanding of the strong interaction and is therefore in the focus of various high-energy heavy-ion research programs. The Compressed …", "num_citations": "217\n", "authors": ["878"]}
{"title": "Performance and operation of the CMS electromagnetic calorimeter\n", "abstract": " The operation and general performance of the CMS electromagnetic calorimeter using cosmic-ray muons are described. These muons were recorded after the closure of the CMS detector in late 2008. The calorimeter is made of lead tungstate crystals and the overall status of the 75 848 channels corresponding to the barrel and endcap detectors is reported. The stability of crucial operational parameters, such as high voltage, temperature and electronic noise, is summarised and the performance of the light monitoring system is presented.", "num_citations": "210\n", "authors": ["878"]}
{"title": "Precise mapping of the magnetic field in the CMS barrel yoke using cosmic rays\n", "abstract": " The CMS detector is designed around a large 4 T superconducting solenoid, enclosed in a 12 000-tonne steel return yoke. A detailed map of the magnetic field is required for the accurate simulation and reconstruction of physics events in the CMS detector, not only in the inner tracking region inside the solenoid but also in the large and complex structure of the steel yoke, which is instrumented with muon chambers. Using a large sample of cosmic muon events collected by CMS in 2008, the field in the steel of the barrel yoke has been determined with a precision of 3 to 8% depending on the location.", "num_citations": "199\n", "authors": ["878"]}
{"title": "Performance of the CMS hadron calorimeter with cosmic ray muons and LHC beam data\n", "abstract": " The CMS Hadron Calorimeter in the barrel, endcap and forward regions is fully commissioned. Cosmic ray data were taken with and without magnetic field at the surface hall and after installation in the experimental hall, hundred meters underground. Various measurements were also performed during the few days of beam in the LHC in September 2008. Calibration parameters were extracted, and the energy response of the HCAL determined from test beam data has been checked.", "num_citations": "197\n", "authors": ["878"]}
{"title": "A new boson with a mass of 125 GeV observed with the CMS experiment at the Large Hadron Collider\n", "abstract": " The Higgs boson was postulated nearly five decades ago within the framework of the standard model of particle physics and has been the subject of numerous searches at accelerators around the world. Its discovery would verify the existence of a complex scalar field thought to give mass to three of the carriers of the electroweak force—the W+, W–, and Z0 bosons—as well as to the fundamental quarks and leptons. The CMS Collaboration has observed, with a statistical significance of five standard deviations, a new particle produced in proton-proton collisions at the Large Hadron Collider at CERN. The evidence is strongest in the diphoton and four-lepton (electrons and/or muons) final states, which provide the best mass resolution in the CMS detector. The probability of the observed signal being due to a random fluctuation of the background is about 1 in 3 × 106. The new particle is a boson with spin not equal to 1 …", "num_citations": "177\n", "authors": ["878"]}
{"title": "Pi of the sky–all-sky, real-time search for fast optical transients\n", "abstract": " An apparatus to search for optical flashes in the sky is described. It has been optimized for optical counterparts of gamma ray bursts (GRB). It consists of 2 × 16 cameras covering all the sky. The sky is monitored continuously and the data are analyzed on-line. The apparatus has self-triggering capability and can react to external triggers with negative delay. The prototype with two cameras has been installed at Las Campanas (Chile) and is operational from July 2004. The paper presents the general idea of the experiment and describes the apparatus in detail. The performance of the prototype is briefly reviewed and perspectives for the future are outlined.", "num_citations": "177\n", "authors": ["878"]}
{"title": "Alignment of the CMS silicon tracker during commissioning with cosmic rays\n", "abstract": " The CMS silicon tracker, consisting of 1440 silicon pixel and 15 148 silicon strip detector modules, has been aligned using more than three million cosmic ray charged particles, with additional information from optical surveys. The positions of the modules were determined with respect to cosmic ray trajectories to an average precision of 3–4 microns RMS in the barrel and 3–14 microns RMS in the endcap in the most sensitive coordinate. The results have been validated by several studies, including laser beam cross-checks, track fit self-consistency, track residuals in overlapping module regions, and track parameter resolution, and are compared with predictions obtained from simulation. Correlated systematic effects have been investigated. The track parameter resolutions obtained with this alignment are close to the design performance.", "num_citations": "172\n", "authors": ["878"]}
{"title": "Commissioning of the CMS experiment and the cosmic run at four tesla\n", "abstract": " The CMS Collaboration conducted a month-long data-taking exercise known as the Cosmic Run At Four Tesla in late 2008 in order to complete the commissioning of the experiment for extended operation. The operational lessons resulting from this exercise were addressed in the subsequent shutdown to better prepare CMS for LHC beams in 2009. The cosmic data collected have been invaluable to study the performance of the detectors, to commission the alignment and calibration techniques, and to make several cosmic ray measurements. The experimental setup, conditions, and principal achievements from this data-taking exercise are described along with a review of the preceding integration activities.", "num_citations": "165\n", "authors": ["878"]}
{"title": "Performance of the CMS Level-1 trigger in proton-proton collisions at  13 TeV\n", "abstract": " At the start of Run 2 in 2015, the LHC delivered proton-proton collisions at a center-of-mass energy of 13 TeV. During Run 2 (years 2015-2018) the LHC eventually reached a luminosity of 2.1  10 cm s, almost three times that reached during Run 1 (2009-2013) and a factor of two larger than the LHC design value, leading to events with up to a mean of about 50 simultaneous inelastic proton-proton collisions per bunch crossing (pileup). The CMS Level-1 trigger was upgraded prior to 2016 to improve the selection of physics events in the challenging conditions posed by the second run of the LHC. This paper describes the performance of the CMS Level-1 trigger upgrade during the data taking period of 2016-2018. The upgraded trigger implements pattern recognition and boosted decision tree regression techniques for muon reconstruction, includes pileup subtraction for jets and energy sums, and incorporates pileup-dependent isolation requirements for electrons and tau leptons. In addition, the new trigger calculates high-level quantities such as the invariant mass of pairs of reconstructed particles. The upgrade reduces the trigger rate from background processes and improves the trigger efficiency for a wide variety of physics signals.", "num_citations": "137\n", "authors": ["878"]}
{"title": "Performance of the CMS drift tube chambers with cosmic rays\n", "abstract": " Studies of the performance of the CMS drift tube barrel muon system are described, with results based on data collected during the CMS Cosmic Run at Four Tesla. For most of these data, the solenoidal magnet was operated with a central field of 3.8 T. The analysis of data from 246 out of a total of 250 chambers indicates a very good muon reconstruction capability, with a coordinate resolution for a single hit of about 260 μm, and a nearly 100% efficiency for the drift tube cells. The resolution of the track direction measured in the bending plane is about 1.8 mrad, and the efficiency to reconstruct a segment in a single chamber is higher than 99%. The CMS simulation of cosmic rays reproduces well the performance of the barrel muon detector.", "num_citations": "121\n", "authors": ["878"]}
{"title": "Overview of the JET results with the ITER-like wall\n", "abstract": " Following the completion in May 2011 of the shutdown for the installation of the beryllium wall and the tungsten divertor, the first set of JET campaigns have addressed the investigation of the retention properties and the development of operational scenarios with the new plasma-facing materials. The large reduction in the carbon content (more than a factor ten) led to a much lower Z eff (1.2–1.4) during L-and H-mode plasmas, and radiation during the burn-through phase of the plasma initiation with the consequence that breakdown failures are almost absent. Gas balance experiments have shown that the fuel retention rate with the new wall is substantially reduced with respect to the C wall. The re-establishment of the baseline H-mode and hybrid scenarios compatible with the new wall has required an optimization of the control of metallic impurity sources and heat loads. Stable type-I ELMy H-mode regimes with H …", "num_citations": "99\n", "authors": ["878"]}
{"title": "Distributed embedded-PC-based control and data acquisition system for TESLA cavity controller and simulator\n", "abstract": " This paper describes an alternative approach for control and data acquisition system to be used in TESLA controller and simulator (SIMCON) boards. The standard VME controller may be replaced with a cheap embedded PC to provide equivalent or even superior functionality. The new approach offers better cost/performance ratio, better scalability of the system and better testability of the SIMCON boards.", "num_citations": "80\n", "authors": ["878"]}
{"title": "Performance of CMS hadron calorimeter timing and synchronization using test beam, cosmic ray, and LHC beam data\n", "abstract": " This paper discusses the design and performance of the time measurement technique and of the synchronization systems of the CMS hadron calorimeter. Time measurement performance results are presented from test beam data taken in the years 2004 and 2006. For hadronic showers of energy greater than 100 GeV, the timing resolution is measured to be about 1.2 ns. Time synchronization and out-of-time background rejection results are presented from the Cosmic Run At Four Tesla and LHC beam runs taken in the Autumn of 2008. The inter-channel synchronization is measured to be within±2 ns.", "num_citations": "60\n", "authors": ["878"]}
{"title": "Development of GEM gas detectors for X-ray crystal spectrometry\n", "abstract": " Two Triple Gas Electron Multiplier (Triple-GEM) detectors were developed for high-resolution X-ray spectroscopy measurements for tokamak plasma to serve as plasma evolution monitoring in soft X-ray region (SXR). They provide energy resolved fast dynamic plasma radiation imaging in the SXR with 0.1 kHz frequency. Detectors were designed and constructed for continuous data-flow precise energy and position measurement of plasma radiation emitted by metal impurities, W 46+ and Ni 26+ ions, at 2.4 keV and 7.8 keV photon energies, respectively. High counting rate capability of the detecting units has been achieved with good position resolution. This article presents results of the laboratory and tokamak experiments together with the system performance under irradiation by photon flux from the plasma core.", "num_citations": "59\n", "authors": ["878"]}
{"title": "Alignment of the CMS silicon tracker during commissioning with cosmic rays\n", "abstract": " The CMS silicon tracker, consisting of 1440 silicon pixel and 15 148 silicon strip detector modules, has been aligned using more than three million cosmic ray charged particles, with additional information from optical surveys. The positions of the modules were determined with respect to cosmic ray trajectories to an average precision of 3-4 microns RMS in the barrel and 3-14 microns RMS in the endcap in the most sensitive coordinate. The results have been validated by several studies, including laser beam cross-checks, track fit self-consistency, track residuals in overlapping module regions, and track parameter resolution, and are compared with predictions obtained from simulation. Correlated systematic effects have been investigated. The track parameter resolutions obtained with this alignment are close to the design performance. © 2010 IOP Publishing Ltd and SISSA.", "num_citations": "58\n", "authors": ["878"]}
{"title": "Commissioning of the CMS High-Level Trigger with cosmic rays\n", "abstract": " The CMS High-Level Trigger (HLT) is responsible for ensuring that data samples with potentially interesting events are recorded with high efficiency and good quality. This paper gives an overview of the HLT and focuses on its commissioning using cosmic rays. The selection of triggers that were deployed is presented and the online grouping of triggered events into streams and primary datasets is discussed. Tools for online and offline data quality monitoring for the HLT are described, and the operational performance of the muon HLT algorithms is reviewed. The average time taken for the HLT selection and its dependence on detector and operating conditions are presented. The HLT performed reliably and helped provide a large dataset. This dataset has proven to be invaluable for understanding the performance of the trigger and the CMS experiment as a whole.", "num_citations": "57\n", "authors": ["878"]}
{"title": "Design of soft-X-ray tomographic system in WEST using GEM detectors\n", "abstract": " In metallic tokamaks, the interplay between particle transport and MagnetoHydroDynamic (MHD) activity might lead to impurities accumulation and finally to disruption. Studying such phenomena is thus essential if stationary discharges are to be achieved. Measuring the soft X-ray (SXR) radiation ([0.1 keV; 20 keV]) of magnetic fusion plasmas is a standard way of accessing valuable information on particle transport and MHD. Generally, like at Tore Supra (TS), the analysis is performed with a 2D tomographic system composed of several cameras equipped with silicon barrier diodes (SBD). On WEST the installation of an upper divertor masks many of the actual TS vertical diodes so that no proper tomography is possible. This paper presents the design of a new SXR diagnostic for the WEST project developed in collaboration with IPPLM (Poland) and the Warsaw University of Technology, based on a triple gas …", "num_citations": "51\n", "authors": ["878"]}
{"title": "Design of T-GEM detectors for X-ray diagnostics on JET\n", "abstract": " Upgraded high-resolution X-ray diagnostics on JET is expected to monitor the plasma radiation emitted by W46+ and Ni26+ ions at 2.4 keV and 7.8 keV photon energies, respectively. Both X-ray lines will be monitored by new generation energy-resolved micropattern gas detectors with 1-D position reconstruction capability. The detection structure is based on triple GEM (T-GEM) amplification structure followed by the strip readout electrode. This article presents a design of new detectors and prototype detector tests.", "num_citations": "51\n", "authors": ["878"]}
{"title": "Performance of the CMS Level-1 trigger during commissioning with cosmic ray muons and LHC beams\n", "abstract": " The CMS Level-1 trigger was used to select cosmic ray muons and LHC beam events during data-taking runs in 2008, and to estimate the level of detector noise. This paper describes the trigger components used, the algorithms that were executed, and the trigger synchronisation. Using data from extended cosmic ray runs, the muon, electron/photon, and jet triggers have been validated, and their performance evaluated. Efficiencies were found to be high, resolutions were found to be good, and rates as expected.", "num_citations": "45\n", "authors": ["878"]}
{"title": "Search for optical flashes accompanying gamma ray bursts Pi of the Sky collaboration\n", "abstract": " Perhaps the most powerful cosmic processes ever observed are gamma ray bursts (GRB). So far, phenomena responsible for GRB have not been unambiguously identified. In the present paper we propose an approach completely different from the classical one. It employs experimental techniques developed for particle physics. Presented project is pioneering research in the unexplored so far domain of cosmic phenomena on the time scale of seconds. Both the rate of signal in question and the rate of unexpected background are not known. Therefore we decided to divide the project into two phases: phase I -- two CCD cameras, phase II - a system of cameras covering all sky. The phase I is well defined whereas detailed realization of phase II will depend strongly on results and experience gained in phase I.", "num_citations": "44\n", "authors": ["878"]}
{"title": "X-ray crystal spectrometer upgrade for ITER-like wall experiments at JET\n", "abstract": " The high resolution X-Ray crystal spectrometer at the JET tokamak has been upgraded with the main goal of measuring the tungsten impurity concentration. This is important for understanding impurity accumulation in the plasma after installation of the JET ITER-like wall (main chamber: Be, divertor: W). This contribution provides details of the upgraded spectrometer with a focus on the aspects important for spectral analysis and plasma parameter calculation. In particular, we describe the determination of the spectrometer sensitivity: important for impurity concentration determination.", "num_citations": "42\n", "authors": ["878"]}
{"title": "Fine synchronization of the CMS muon drift-tube local trigger using cosmic rays\n", "abstract": " The CMS experiment uses self-triggering arrays of drift tubes in the barrel muon trigger to perform the identification of the correct bunch crossing. The identification is unique only if the trigger chain is correctly synchronized. In this paper, the synchronization performed during an extended cosmic ray run is described and the results are reported. The random arrival time of cosmic ray muons allowed several synchronization aspects to be studied and a simple method for the fine synchronization of the Drift Tube Local Trigger at LHC to be developed.", "num_citations": "42\n", "authors": ["878"]}
{"title": "Aligning the CMS muon chambers with the muon alignment system during an extended cosmic ray run\n", "abstract": " The alignment system for the muon spectrometer of the CMS detector comprises three independent subsystems of optical and analog position sensors. It aligns muon chambers with respect to each other and to the central silicon tracker. System commissioning at full magnetic field began in 2008 during an extended cosmic ray run. The system succeeded in tracking muon detector movements of up to 18 mm and rotations of several milliradians under magnetic forces. Depending on coordinate and subsystem, the system achieved chamber alignment precisions of 140-350 mu m and 30-200 mu rad, close to the precision requirements of the experiment. Systematic errors on absolute positions are estimated to be 340-590 mu m based on comparisons with independent photogrammetry measurements.", "num_citations": "42\n", "authors": ["878"]}
{"title": "Design and simulation of fpga implementation of a rf control system for the tesla test facility\n", "abstract": " This paper presents a new FPGA based solution of the Low Level RF Control System for TESLA Test Facility. The LLRF Control System is responsible for maintaining the constant amplitude and phase of accelerating field in set of accelerator's cryomodulaes driven by single klystron. To obtain shorter processing time and less complicated hardware an FPGA based solution was selected. The proposed simulation has been simulated in software, and appeared to be faster and less complex than DSP based solutions.", "num_citations": "42\n", "authors": ["878"]}
{"title": "Conceptual design and development of GEM based detecting system for tomographic tungsten focused transport monitoring\n", "abstract": " Implementing tungsten as a plasma facing material in ITER and future fusion reactors will require effective monitoring of not just its level in the plasma but also its distribution. That can be successfully achieved using detectors based on Gas Electron Multiplier (GEM) technology. This work presents the conceptual design of the detecting unit for poloidal tomography to be tested at the WEST project tokamak. The current stage of the development is discussed covering aspects which include detector's spatial dimensions, gas mixtures, window materials and arrangements inside and outside the tokamak ports, details of detector's structure itself and details of the detecting module electronics. It is expected that the detecting unit under development, when implemented, will add to the safe operation of tokamak bringing the creation of sustainable nuclear fusion reactors a step closer.", "num_citations": "40\n", "authors": ["878"]}
{"title": "FPGA based charge fast histogramming for GEM detector\n", "abstract": " This article presents a fast charge histogramming method for the position sensitive X-ray GEM detector. The energy resolved measurements are carried out simultaneously for 256 channels of the GEM detector. The whole process of histogramming is performed in 21 FPGA chips (Spartan-6 series from Xilinx) . The results of the histogramming process are stored in an external DDR3 memory. The structure of an electronic measuring equipment and a firmware functionality implemented in the FPGAs is described. Examples of test measurements are presented.", "num_citations": "34\n", "authors": ["878"]}
{"title": "Serial data acquisition for GEM-2D detector\n", "abstract": " This article debates about data fast acquisition and histogramming method for the X-ray GEM detector. The whole process of histogramming is performed by FPGA chips (Spartan-6 series from Xilinx). The results of the histogramming process are stored in an internal FPGA memory and then sent to PC. In PC data is merged and processed by MATLAB. The structure of firmware functionality implemented in the FPGAs is described. Examples of test measurements and results are presented.", "num_citations": "32\n", "authors": ["878"]}
{"title": "Determination of tungsten and molybdenum concentrations from an X-ray range spectrum in JET with the ITER-like wall configuration\n", "abstract": " The  and  3p–4d inner shell excitation lines in addition to  2p–3s lines have been identified from the spectrum taken by an upgraded high-resolution x-ray spectrometer. It is found from analysis of the absolute intensities of the  and  lines that W and Mo concentrations are in the range of  and , respectively, with a ratio of~ 5% in JET with the ITER-like wall configuration for ELMy H-mode plasmas with a plasma current of 2.0–2.5 MA, a toroidal magnetic field of 2.7 T and a neutral beam injection power of 14–18 MW. For the purpose of checking self-consistency, it is confirmed that the W concentration determined from the  line is in agreement with that from the  line within 20% and that the plasma effective charge determined from the continuum of the first order reflection spectrum is also in agreement with that from the second order within 50%. Further, the determined …", "num_citations": "31\n", "authors": ["878"]}
{"title": "Dual port memory based Heapsort implementation for FPGA\n", "abstract": " This document presents a proposal of implementation of the Heapsort algorithm, which utilizes hardware features of modern Field-Programmable Gate Array (FPGA) chips, such as dual port random access memories (DP RAM), to implement efficient sorting of a data stream. The implemented sorter is able to sort one data record every two clock periods. This throughput does not depend on the capacity of the sorter (defined as number of storage cells in the sorter). The mean latency (expressed in sorting cycles - each equal to two clock periods) when sorting the stream of data is equal to the capacity of the sorter. Due to efficient use of FPGA resources (e.g. data are stored mainly in internal block RAMs), the complexity of the sorter is proportional to the logarithm of sorter capacity. Only the required RAM size is linearly proportional to the sorter capacity. The proposed sorter has been tested in simulations and …", "num_citations": "31\n", "authors": ["878"]}
{"title": "Calibration of the CMS drift tube chambers and measurement of the drift velocity with cosmic rays\n", "abstract": " This paper describes the calibration procedure for the drift tubes of the CMS barrel muon system and reports the main results obtained with data collected during a high statistics cosmic ray data-taking period. The main goal of the calibration is to determine, for each drift cell, the minimum time delay for signals relative to the trigger, accounting for the drift velocity within the cell. The accuracy of the calibration procedure is influenced by the random arrival time of the cosmic muons relative to the LHC clock cycle. A more refined analysis of the drift velocity was performed during the offline reconstruction phase, which takes into account this feature of cosmic ray events.", "num_citations": "31\n", "authors": ["878"]}
{"title": "Serial data acquisition for the X-ray plasma diagnostics with selected GEM detector structures\n", "abstract": " The measurement system based on GEM—Gas Electron Multiplier detector is developed for X-ray diagnostics of magnetic confinement tokamak plasmas. The paper is focused on the measurement subject and describes the fundamental data processing to obtain reliable characteristics (histograms) useful for physicists. The required data processing have two steps: 1—processing in the time domain, ie events selections for bunches of coinciding clusters, 2—processing in the planar space domain, ie cluster identification for the given detector structure. So, it is the software part of the project between the electronic hardware and physics applications. The whole project is original and it was developed by the paper authors. The previous version based on 1-D GEM detector was applied for the high-resolution X-ray crystal spectrometer KX1 in the JET tokamak. The current version considers 2-D detector structures for the …", "num_citations": "30\n", "authors": ["878"]}
{"title": "Distributed control system for TRIDAQ boards\n", "abstract": " This paper presents a distributed control system developed for TriDAQ boards prepared for Resistive Plate Chamber (RPC) detector in Compact Muon Solenoid (CMS) Muon Trigger system to be used in Large Hadron Colider (LHC) in CERN. The control systme is based on Linux servers embedded in TriDAQ boards. The communication between embedded servers and managing/data processing host is assured by the Ethernet network. The embedded controllers offer sufficient computational power to perform board diagnostics and preprocessing of acquired data. Presented solution assures both high flexibility (due to configuration by the network) and high performance (due to highly parallel architecture).", "num_citations": "30\n", "authors": ["878"]}
{"title": "Aligning the CMS muon chambers with the muon alignment system during an extended cosmic ray run\n", "abstract": " The alignment system for the muon spectrometer of the CMS detector comprises three independent subsystems of optical and analog position sensors. It aligns muon chambers with respect to each other and to the central silicon tracker. System commissioning at full magnetic field began in 2008 during an extended cosmic ray run. The system succeeded in tracking muon detector movements of up to 18 mm and rotations of several milliradians under magnetic forces. Depending on coordinate and subsystem, the system achieved chamber alignment precisions of 140–350 μm and 30–200 μrad, close to the precision requirements of the experiment. Systematic errors on absolute positions are estimated to be 340–590 μm based on comparisons with independent photogrammetry measurements.", "num_citations": "26\n", "authors": ["878"]}
{"title": "A computing system for the clinical and experimental investigation of cerebrovascular reactivity\n", "abstract": " We present a computing system for the recording and on-line analysis of analogue signals derived from bedside cerebrovascular monitors in different pathophysiological conditions. These include arterial blood pressure and oxygen saturation, end-tidal carbon dioxide concentration, cerebral blood flow velocities using transcranial Doppler ultrasonography, and concentration changes in cerebral oxy- and deoxyhaemoglobin from near infrared spectroscopy. Configuration and analysis adopts arithmetic expressions of different signal processing functions, various statistical properties for each signal, frequency spectrum analysis using fast Fourier transformation, and correlation/cross-correlation. The software offers off-line analysis of non-invasive tests of cerebrovascular reactivity. Several examples of clinical assessment of cerebrovascular reactivity are presented, including cerebral haemodynamic stress tests …", "num_citations": "26\n", "authors": ["878"]}
{"title": "Portable software for intracranial pressure recording and waveform analysis\n", "abstract": " Reliable data recording is essential in clinical and experimental studies on cerebrospinal dynamics. In clinical work however it is important to provide on-line signal analysis of acquired data to estimate the clinical state of the patient. Our programs allow simultaneous recording and analysis of data, working on single IBM PC compatible (even laptop) computer, equipped with a low cost analog-to-digital board. In many applications computers may replace expensive and inconvenient magnetic data recorders, reducing numbers of equipment needed beside patient's bed. Recorded data are stored on computer's disc, allowing easy access, off-line analysis and archivisation. The off-line data analysis can be performed using our offline analysing software, or using algorithms written in MATLAB-386TM (by The Math Works Inc.) package. A well-defined communication protocol allows the user to create his own data analysing software.", "num_citations": "26\n", "authors": ["878"]}
{"title": "Cerebrospinal compensation in hydrocephalic children\n", "abstract": " One hundred and fifteen cases of hydrocephalus in children were analysed. Cerebrospinal compensatory reserve was assessed by a computerized, constant rate, lumbar infusion test. Head circumference and ventricular size were measured and a psychometric examination carried out. A classification of hydrocephalus based on resting cerebrospinal fluid pressure (CSFP) and resistance to cerebrospinal fluid outflow (RCSF) was introduced. Parameters of compensatory reserve were compared in atrophy (low CSFP, low RCSF), normal-pressure hydrocephalus (low CSFP, increased RCSF), non-communicating hydrocephalus (high CSFP, low RCSF) and acute hydrocephalus (high CSFP and increased RCSF). Significant differences were found between the factors describing compensatory ability in these groups. Sixty-two patients could be classified on the basis of resting CSFR and RCSF. Differentiation …", "num_citations": "25\n", "authors": ["878"]}
{"title": "FPGA-based GEM detector signal acquisition for SXR spectroscopy system\n", "abstract": " The presented work is related to the Gas Electron Multiplier (GEM) detector soft X-ray spectroscopy system for tokamak applications. The used GEM detector has one-dimensional, 128 channel readout structure. The channels are connected to the radiation-hard electronics with configurable analog stage and fast ADCs, supporting speeds of 125 MSPS for each channel. The digitalized data is sent directly to the FPGAs using fast serial links. The preprocessing algorithms are implemented in the FPGAs, with the data buffering made in the on-board 2Gb DDR3 memory chips. After the algorithmic stage, the data is sent to the Intel Xeon-based PC for further postprocessing using PCI-Express link Gen 2. For connection of multiple FPGAs, PCI-Express switch 8-to-1 was designed. The whole system can support up to 2048 analog channels. The scope of the work is an FPGA-based implementation of the recorder of the raw …", "num_citations": "24\n", "authors": ["878"]}
{"title": "On line separation of overlapped signals from multi-time photons for the GEM-based detection system\n", "abstract": " The Triple Gas Electron Multiplier (T-GEM) is presented as soft X-ray (SXR) energy and position sensitive detector for high-resolution X-ray diagnostics of magnetic confinement fusion plasmas. Multi-channel measurement system and serial data acquisition for X-ray energy and position recognition is described. Fundamental characteristics are presented for two dimensional detector structure. Typical signals of ADC – Analog to Digital Converter are considered for charge value and position estimation. Coinciding signals for high flux radiation cause the problem for cluster charge identification. The amplifier with shaper determines time characteristics and limits the pulses frequency. Separation of coincided signals was introduced and verified for simulation experiments. On line separation of overlapped signals was implemented applying the FPGA technology with relatively simple firmware procedure. Representative …", "num_citations": "24\n", "authors": ["878"]}
{"title": "Fast ADC based multichannel acquisition system for the GEM detector\n", "abstract": " A novel approach to the Gas Electron Multiplier1 (GEM) detector readout is presented. Unlike commonly used methods, based on discriminators, and analogue FIFOs,[ the method developed uses simultaneously sampling high speed ADCs and advanced FPGA-based processing logic to estimate the energy of every single photon. Such method is applied to every GEM strip signal. It is especially useful in case of crystal-based spectrometers for soft X-rays, where higher order reflections need to be identified and rejected. For the purpose of the detector readout, a novel conception of the measurement platform was developed.", "num_citations": "23\n", "authors": ["878"]}
{"title": "Readout electronics for the GEM detector\n", "abstract": " A novel approach to the Gas Electron Multiplier (GEM) detector readout is presented. Unlike commonly used methods, based on discriminators[2],[3] and analogue FIFOs[1], the method developed uses simultaneously sampling high speed ADCs and advanced FPGA-based processing logic to estimate the energy of every single photon. Such method is applied to every GEM strip signal. It is especially useful in case of crystal-based spectrometers for soft X-rays, where higher order reflections need to be identified and rejected[5].", "num_citations": "23\n", "authors": ["878"]}
{"title": "Prototype implementation of the embedded PC-based control and DAQ module for TESLA cavity SIMCON\n", "abstract": " This paper describes the results obtained with the first prototype of the embedded PC (Axis ETRAX LX MCM) based board for control and data acquisition system, to be used in TESLA controller and simulator (SIMCON). This board is a result of the new approach to the architecture of measurement systems, where the VME controller is replaced with the embedded PC, to improve the functionality and to reduce cost of the system. This new concept assures better scalability and testability of the SIMCON board.", "num_citations": "23\n", "authors": ["878"]}
{"title": "A protocol for hit and control synchronous transfer for the front-end electronics at the CBM experiment\n", "abstract": " The Silicon Tracking System, Muon Chamber, Transition Radiation Detector and Time-Of-Flight among others are the detector systems of the Compressed Baryonic Matter (CBM) experiment at the FAIR facility. These detector systems will be built with tens of thousands of front-end ASICs exposed to high radiation doses and difficult environmental and interference conditions. A CERN's GBTx-based solution was chosen for combining data from multiple front-end ASICs into an optical link before further concentration and preprocessing in the common Data Processing Board data hub. This paper presents the protocol design addressing the DAQ system requirements, simplifying the ASIC's back-end design and presents its adaptation for the STS and MUCH detector's conditions. A specific link synchronization technique, hit data bandwidth optimization and time synchronization method for the self-triggered front-end …", "num_citations": "22\n", "authors": ["878"]}
{"title": "Data processing for soft X-ray diagnostics based on GEM detector measurements for fusion plasma imaging\n", "abstract": " The measurement system based on GEM – Gas Electron Multiplier detector is developed for X-ray diagnostics of magnetic confinement fusion plasmas. The Triple Gas Electron Multiplier (T-GEM) is presented as soft X-ray (SXR) energy and position sensitive detector. The paper is focused on the measurement subject and describes the fundamental data processing to obtain reliable characteristics (histograms) useful for physicists. So, it is the software part of the project between the electronic hardware and physics applications. The project is original and it was developed by the paper authors. Multi-channel measurement system and essential data processing for X-ray energy and position recognition are considered. Several modes of data acquisition determined by hardware and software processing are introduced. Typical measuring issues are deliberated for the enhancement of data quality. The primary version …", "num_citations": "22\n", "authors": ["878"]}
{"title": "First measurements of the performance of the barrel RPC system in CMS\n", "abstract": " During the summer 2006, a first integrated test of a part of the CMS experiment was performed at CERN collecting a data sample of several millions of cosmic rays events. A fraction of the Resistive Plate Chambers system was successfully operated. Results on the RPC performance are reported.", "num_citations": "22\n", "authors": ["878"]}
{"title": "The dynamics of cerebral blood flow, perfusion pressure and CSF circulation—a modelling study\n", "abstract": " The first modelling studies on the craniospinal volume compensation were focused on finding the best approximation of the cerebrospinal pressure-volume relationship. An expanded model, explaining the process of the formation, storage and outflow of cerebrospinal fluid [1, 4] was accepted by clinicians as a powerful tool in the examination of hydrocephalic patients.", "num_citations": "21\n", "authors": ["878"]}
{"title": "Multichannel measurement system for extended SXR plasma diagnostics based on novel radiation-hard electronics\n", "abstract": " This work refers to the soft X-Ray (SXR) plasma diagnostics system being developed. The goal is to compute SXR spectra − energetically and topologically with means of Gas Electron Multiplier (GEM) detector. The system has two sections: the analog signal acquisition part (installed at the GEM detector), and the signal processing part (located in the rack). PCI-Express Gen2 interface and DDR3 memory are used for data transmission, storage and buffering. Xilinx Artix7 FPGAs in the signal processing part perform signal acquisition functions. One data acquisition module (DQM) of the system is capable of processing up to 64 analog input channels in real-time. Acquired data is transferred to the embedded PC for post-processing − including cluster reconstruction and spectrograms computation in offline mode. Advanced low-level control software and signal processing algorithms (Matlab) integration was performed …", "num_citations": "20\n", "authors": ["878"]}
{"title": "Concept and current status of data acquisition technique for GEM detector–based SXR diagnostics\n", "abstract": " This work refers to the measurement system for soft-X-ray radiation (SXR) diagnostics using gaseous electron multiplier (GEM) detectors. In terms of tokamak plasma parameter control and optimization, it is important to determine the level of SXR generated by plasma. This work describes the whole system including the GEM detector, electronic modules, and data acquisition (DAQ) path. The structure of the DAQ system is presented in terms of hardware, firmware, and software architecture. The currently developed hardware allows sampling of the GEM detector signals with 125-MHz frequency and real-time field-programmable gate array (FPGA) processing. It enables processing of all events generated by the highest possible photon flux for the GEM detector. The developed FPGA firmware registers digitized GEM detector signals with a global trigger up to 625 kHz with all 64 channels sampling simultaneously and …", "num_citations": "20\n", "authors": ["878"]}
{"title": "Fast data transmission from serial data acquisition for the GEM detector system\n", "abstract": " This article proposes new method of storing data and transferring it to PC in the X-ray GEM detector system. The whole process is performed by FPGA chips (Spartan-6 series from Xilinx). Comparing to previous methods, new approach allows to store much more data in the system. New, improved implementation of the communication algorithm significantly increases transfer rate between system and PC. In PC data is merged and processed by MATLAB. The structure of firmware implemented in the FPGAs is described.", "num_citations": "20\n", "authors": ["878"]}
{"title": "Fast modular data acquisition system for GEM-2D detector\n", "abstract": " A novel approach to two dimensional Gas Electron Multiplier (GEM) detector readout is presented. Unlike commonly used methods, based on discriminators and analogue FIFOs, the method developed uses simulta- neously sampling high speed ADCs with fast hybrid integrator and advanced FPGA-based processing logic to estimate the energy of every single photon. Such a method is applied to every GEM strip / pixel signal. It is especially useful in case of crystal-based spectrometers for soft X-rays, 2D imaging for plasma tomography and all these applications where energy resolution of every single photon is required. For the purpose of the detector readout, a novel, highly modular and extendable conception of the measurement platform was developed. It is evolution of already deployed measurement system for JET Spectrometer.", "num_citations": "20\n", "authors": ["878"]}
{"title": "Gaseous electron multiplier-based soft x-ray plasma diagnostics development: Preliminary tests at ASDEX Upgrade\n", "abstract": " A Gaseous Electron Multiplier (GEM)-based detector is being developed for soft X-ray diagnostics on tokamaks. Its main goal is to facilitate transport studies of impurities like tungsten. Such studies are very relevant to ITER, where the excessive accumulation of impurities in the plasma core should be avoided. This contribution provides details of the preliminary tests at ASDEX Upgrade (AUG) with a focus on the most important aspects for detector operation in harsh radiation environment. It was shown that both spatially and spectrally resolved data could be collected, in a reasonable agreement with other AUG diagnostics. Contributions to the GEM signal include also hard X-rays, gammas, and neutrons. First simulations of the effect of high-energy photons have helped understanding these contributions.", "num_citations": "19\n", "authors": ["878"]}
{"title": "The cluster charge identification in the GEM detector for fusion plasma imaging by soft X-ray diagnostics\n", "abstract": " The measurement system based on gas electron multiplier detector is developed for soft X-ray diagnostics of tokamak plasmas. The multi-channel setup is designed for estimation of the energy and the position distribution of an X-ray source. The focal measuring issue is the charge cluster identification by its value and position estimation. The fast and accurate mode of the serial data acquisition is applied for the dynamic plasma diagnostics. The charge clusters are counted in the space determined by 2D position, charge value, and time intervals. Radiation source characteristics are presented by histograms for a selected range of position, time intervals, and cluster charge values corresponding to the energy spectra.", "num_citations": "19\n", "authors": ["878"]}
{"title": "Diagnostic-management system and test pulse acquisition for WEST plasma measurement system\n", "abstract": " This paper describes current status of electronics, firmware and software development for new plasma measurement system for use in WEST facility. The system allows to perform two dimensional plasma visualization (in time) with spectrum measurement. The analog front-end is connected to Gas Electron Multiplier detector (GEM detector). The system architecture have high data throughput due to use of PCI-Express interface, Gigabit Transceivers and sampling frequency of ADC integrated circuits. The hardware is based on several years of experience in building X-ray spectrometer system for Joint European Torus (JET) facility. Data streaming is done using Artix7 FPGA devices. The system in basic configuration can work with up to 256 channels, while the maximum number of measurement channels is 2048. Advanced firmware for the FPGA is required in order to perform high speed data streaming and analog …", "num_citations": "18\n", "authors": ["878"]}
{"title": "Synchronization methods for the PAC RPC trigger system in the CMS experiment\n", "abstract": " The PAC (pattern comparator) is a dedicated muon trigger for the CMS (Compact Muon Solenoid) experiment at the LHC (Large Hadron Collider). The PAC trigger processes signals provided by RPC (resistive plate chambers), a part of the CMS muon system. The goal of the PAC RPC trigger is to identify muons, measure their transverse momenta and select the best muon candidates for each proton bunch collision occurring every 25 ns. To perform this task it is necessary to deliver the information concerning each bunch crossing from many RPC chambers to the trigger logic at the same moment. Since the CMS detector is large (the muon hits are spread over 40 ns), and the data are transmitted through thousands of channels, special techniques are needed to assure proper synchronization of the data. In this paper methods developed for the RPC signal synchronization and synchronous transmission are …", "num_citations": "18\n", "authors": ["878"]}
{"title": "Algorithm and implementation of muon trigger and data transmission system for barrel-endcap overlap region of the CMS detector\n", "abstract": " The CMS experiment Level-1 trigger system is undergoing an upgrade. In the barrel-endcap transition region, it is necessary to merge data from 3 types of muon detectors—RPC, DT and CSC. The Overlap Muon Track Finder (OMTF) uses the novel approach to concentrate and process those data in a uniform manner to identify muons and their transversal momentum. The paper presents the algorithm and FPGA firmware implementation of the OMTF and its data transmission system in CMS. It is foreseen that the OMTF will be subject to significant changes resulting from optimization which will be done with the aid of physics simulations. Therefore, a special, high-level, parameterized HDL implementation is necessary.", "num_citations": "17\n", "authors": ["878"]}
{"title": "Introducing parallelism to histogramming functions for GEM systems\n", "abstract": " This article is an assessment of potential parallelization of histogramming algorithms in GEM detector system. Histogramming and preprocessing algorithms in MATLAB were analyzed with regard to adding parallelism. Preliminary implementation of parallel strip histogramming resulted in speedup. Analysis of algorithms parallelizability is presented. Overview of potential hardware and software support to implement parallel algorithm is discussed.", "num_citations": "17\n", "authors": ["878"]}
{"title": "Radiation tests of CMS RPC muon trigger electronic components\n", "abstract": " The results of proton irradiation test of electronic devices, selected for the RPC trigger electronic system of the CMS detector, will be presented. For Xilinx Spartan-IIE FPGA the cross-section for Single Event Upsets (SEUs) in configuration bits was measured. The dynamic SEUs in flip-flops were also investigated, but not observed. For the FLASH memories no single upsets were detected. Only after irradiating with a huge dose permanent damages of devices were observed. For Synchronous Dynamic Random Access Memory (SDRAM), the SEU cross-section was measured.", "num_citations": "17\n", "authors": ["878"]}
{"title": "GBT based readout in the CBM experiment\n", "abstract": " The CBM experiment at FAIR will use GBTX and Versatile Link based readout systems for several of its subdetectors. The paper describes the GBT based readout concept in CBM, emphasizing the common features among systems. Particular choices and features of the readout are motivated mainly by the requirements in the readout of the silicon tracking system (STS). Common developments like a common CBM readout board are presented. The prototype board provides full GBT functionality for all systems, can be interfaced to various prototype readout chains and be refined for later detector specific versions.", "num_citations": "16\n", "authors": ["878"]}
{"title": "Back-end and interface implementation of the STS-XYTER2 prototype ASIC for the CBM experiment\n", "abstract": " Each front-end readout ASIC for the High-Energy Physics experiments requires robust and effective hit data streaming and control mechanism. A new STS-XYTER2 full-size prototype chip for the Silicon Tracking System and Muon Chamber detectors in the Compressed Baryonic Matter experiment at Facility for Antiproton and Ion Research (FAIR, Germany) is a 128-channel time and amplitude measuring solution for silicon microstrip and gas detectors. It operates at 250 kHit/s/channel hit rate, each hit producing 27 bits of information (5-bit amplitude, 14-bit timestamp, position and diagnostics data). The chip back-end implements fast front-end channel read-out, timestamp-wise hit sorting, and data streaming via a scalable interface implementing the dedicated protocol (STS-HCTSP) for chip control and hit transfer with data bandwidth from 9.7 MHit/s up to 47 MHit/s. It also includes multiple options for link diagnostics …", "num_citations": "16\n", "authors": ["878"]}
{"title": "Development of GEM detector for tokamak SXR tomography system: Preliminary laboratory tests\n", "abstract": " The GEM based detecting system is currently being developed for poloidal tomography to be used at WEST project tokamak. It consists of two GEM detectors of planar and of cylindrical geometry for the vertical and horizontal ports, respectively. Several laboratory tests were conducted to assess the performance of the prototype detectors and verify the proposed design. For that, the measurements of the detectors with 55Fe source and X-ray generator were performed. The detector’s behavior was tested for two gas mixtures: Ar/CO2 and Ar/CO2/CF4 and the detector amplification dependencies on high photon flux, start-up and applied high voltages are demonstrated. The cluster sizes of the generated anode charge and energy resolution are also provided.", "num_citations": "15\n", "authors": ["878"]}
{"title": "On algorithmic optimization of histogramming functions for GEM systems\n", "abstract": " This article concerns optimization methods for data analysis for the X-ray GEM detector system. The offline analysis of collected samples was optimized for MATLAB computations. Compiled functions in C language were used with MEX library. Significant speedup was received for both ordering-preprocessing and for histogramming of samples. Utilized techniques with obtained results are presented.", "num_citations": "15\n", "authors": ["878"]}
{"title": "GEM detector development for tokamak plasma radiation diagnostics: SXR poloidal tomography\n", "abstract": " An increased attention to tungsten material is related to a fact that it became a main candidate for the plasma facing material in ITER and future fusion reactor. The proposed work refers to the studies of W influence on the plasma performances by developing new detectors based on Gas Electron Multiplier GEM) technology for tomographic studies of tungsten transport in ITER-oriented tokamaks, e.g. WEST project. It presents current stage of design and developing of cylindrically bent SXR GEM detector construction for horizontal port implementation. Concept to overcome an influence of constraints on vertical port has been also presented. It is expected that the detecting unit under development, when implemented, will add to the safe operation of tokamak bringing creation of sustainable nuclear fusion reactors a step closer.", "num_citations": "15\n", "authors": ["878"]}
{"title": "Optimization of fpga processing of gem detector signal\n", "abstract": " This paper presents analysis of processing method of the signal from Gas Electron Multiplier (GEM) detector acquired in our Field-Programmable Gate Array (FPGA) based readout system. We have found that simple processing of GEM signal received from the charge amplifier, sampled at 100MHz with 10-bit resolution, after low-pass filtering with 15 MHz cut-off frequency, provides accuracy similar to obtained by processing of the raw GEM signal sampled at 2.5 GHz frequency with 8-bit resolution. Even when 3 bits are lost due to long term instability of the detector and analog part of the system - resulting in 7-bit effective resolution, the reasonable accuracy is still preserved. Additionally we have analyzed computational power required to perform the real-time analysis of the GEM signal, taking into consideration resources offered by the FPGA chip used in the prototype platform.", "num_citations": "15\n", "authors": ["878"]}
{"title": "FPGA based charge acquisition algorithm for soft x-ray diagnostics system\n", "abstract": " Soft X-ray (SXR) measurement systems working in tokamaks or with laser generated plasma can expect high photon fluxes. Therefore it is necessary to focus on data processing algorithms to have the best possible efficiency in term of processed photon events per second. This paper refers to recently designed algorithm and data-flow for implementation of charge data acquisition in FPGA. The algorithms are currently on implementation stage for the soft X-ray diagnostics system. In this paper despite of the charge processing algorithm is also described general firmware overview, data storage methods and other key components of the measurement system. The simulation section presents algorithm performance and expected maximum photon rate.", "num_citations": "14\n", "authors": ["878"]}
{"title": "Versatile prototyping platform for Data Processing Boards for CBM experiment\n", "abstract": " The CBM experiment is one of the experiments prepared at the FAIR Facility in Darmstadt. The Data Processing Boards (DPB) are an important component of the CBM readout chain. Before the final, production versions of DPB may be designed, it is important to create a prototyping platform, to test and select appropriate hardware and firmware solutions. The Kintex based AMC FMC Carrier (AFCK) board is a versatile and open solution fulfilling those requirements, offering configurable high-speed (up to 10 Gbps) connectivity. The paper describes the AFCK hardware, the firmware architecture, and the IP cores developed for different DPB prototyping tasks. Due to its versatility and openness the AFCK may be reused in other experiments.", "num_citations": "13\n", "authors": ["878"]}
{"title": "Interface and protocol development for STS read-out ASIC in the CBM experiment at FAIR\n", "abstract": " This paper presents a proposal of a protocol for communication between the read-out integrated circuit for the STS (Silicon Tracking System) and the Data Processing Board (DPB) at CBM (Compressed Baryonic Matter) experiment at FAIR, GSI (Helmholtzzentrum fuer Schwerionenforschung GmbH) in Germany. The application background, objectives and proposed solution is presented.", "num_citations": "13\n", "authors": ["878"]}
{"title": "Data processing boards design for CBM experiment\n", "abstract": " This paper presents a concept of the Data Processing Boards for the Compressed Baryonic Matter (CBM) experiment. Described is the evolution of the concepts leading from the functional requirements of the control and readout systems of the CBM experiment to the design of prototype implementation of the DPB boards. The paper describes requirements on the board level and on the crate level. Finally it discusses the prototype design prepared for testing and verification of proposed solutions, and selection of the final implementation.", "num_citations": "13\n", "authors": ["878"]}
{"title": "Wbudowany system komputerowy jako sterownik płyt kontrolno-pomiarowych do sterowania LLRF w akceleratorze\n", "abstract": " PL Artykul zawiera ogolne rozwazania na temat przydatnosci wbudowanych systemow komputerowych do realizacji systemow sterowania w ptytach kontrolno-pomiarowych dla eksperymentow fizyki wysokiej energii. Oprocz tego przedstawiono opis prototypowego wbudowanego systemu komputerowego, umozliwiajacego sterowanie ptytami LLRF projektu TESLA. Stowa kluczowe:", "num_citations": "13\n", "authors": ["878"]}
{"title": "The speedup analysis in GEM detector based acquisition system algorithms with CPU and PCIe cards\n", "abstract": " The GEM detector based acquisition systems are the compound multimodule electronic devices whose function is to provide quick acquisition, storing and processing of the data from the detector. The systems are described in [1, 2]. The scheme of main elements of the system is discussed in [3, 4]. The primary requirement for the systems of such kind is to provide highest throughput possible when processing the data in the plasma physics", "num_citations": "12\n", "authors": ["878"]}
{"title": "Development of a 1D Triple GEM X-ray detector for a high-resolution X-ray diagnostics at JET\n", "abstract": " The impurity concentration, the ion temperature, and the toroidal rotation velocity are key parameters which have to be monitored at a high level of accuracy for all the operating phases and for different operating scenarios of the ITER-oriented JET research programme. Therefore, a high resolution KX1 Bragg spectrometer [1] operated in so-called Johann geometry will be equipped with new detectors. Both, Ni (7.8 keV) and W (2.4 keV) characteristic X-ray lines will be measured by a new generation energy-resolved micropattern gas detectors [2-6] providing 1-D position reconstruction capability. Here we would like to address main characteristics and the first laboratory tests of the prototype Triple Gas Electron Multiplier (T-GEM) detectors designed for the KX1 diagnostic at JET.", "num_citations": "12\n", "authors": ["878"]}
{"title": "Implementation of the data acquisition system for the resistive plate chamber pattern comparator muon trigger in the CMS experiment\n", "abstract": " This paper presents the implementation of the data acquisition system of the Resistive Plate Chamber (RPC) subdetector in the Compact Muon Solenoid (CMS) experiment at the Large Hadron Collider (LHC) in CERN. The described readout system connects with the RPC detector, the RPC link system, the RPC trigger system and the CMS data acquisition system and creates one of multiple metrological systems in CMS experiment. The readout system receives the data provided by the multiple channels of the link system, filters out the non-triggered data, encapsulates the data into the standard CMS common data format events and sends them to the global data acquisition system. The main problem in the readout system design was to provide a sufficiently large throughput to reliably transfer the data. The implemented system is the scalable solution based on advanced Field Programmable Gate Arrays (FPGA …", "num_citations": "12\n", "authors": ["878"]}
{"title": "Measurements and controls implementation for WEST\n", "abstract": " The WEST platform consists in a major upgrade of Tore Supra towards a steady-state tungsten (W) diverted tokamak. In support of this, significant developments are performed on the measurement systems (diagnostics); the control, data access and communication (CODAC); the plasma control system (PCS), the monitoring and protection of the first wall and modelling to prepare the restart of the plasma. Thanks to collaboration agreements already in force, most of the developments and some hardware procurements are performed with the help of several international partners. This paper discusses the present status of developments regarding the measurements and control for the WEST project. In particular, the integration of about 50 diagnostics in ports is completed, and their in-vessel and ex-vessel installation is underway. The refurbishment of the CODAC network architecture has been completed. The …", "num_citations": "11\n", "authors": ["878"]}
{"title": "Fast data acquisition measurement system for plasma diagnostics using GEM detectors\n", "abstract": " This paper refers to the measurement system for plasma diagnostics of tokamaks, that is currently being developed. In thermonuclear fusion research reactors, precise determination of the level and spatial distribution of the plasma soft X-ray radiation will be important for plasma parameters optimization. The system is based on the Gas Electron Multiplier (GEM) detector with high speed communication interfaces and effective algorithms for data processing, implemented in the FPGA units and in real time software [1]. The current implementation of the system's hardware allows achieving high signal rates from the detector. The system can work in two modes: First mode performs fast raw data acquisition of the analog signals, giving therefore important information about the plasma or other radiation sources. On the contrary, the second mode performs an online calculation of the charges registered on the GEM channel. Further post processing is done by software running on embedded PC. Due to the modular structure of the measurement system, GEM detector readout boards can have different readout structures (1D, 2D, redundant, etc.). The system can work with connected both one-or two-dimensional readout boards. In order to provide high throughput of the data to the post-processing algorithms, advanced gigabit serial communication interfaces are used. The main goal of the work was to develop a new generation of SXR measurement system with a large number of measurements channel and high sampling speed. The first generation of the system included 256 readout channels, whereas the sampling frequency was 77 MHz, with 10 ms …", "num_citations": "11\n", "authors": ["878"]}
{"title": "Fpga-based cavity simulator for tesla test facility\n", "abstract": " This paper presents a FPGA based DSP system for realtime simulation of superconducting accelerator's cavity. The superconducting linacs require sophisticated control systems for maintaining the constant amplitude and phase of accelerating field in the accelerator's cavities. The debugging of these systems on real hardware can be both difficult and dangerous. To allow testing of the real LLRF systems in the real time and with different cavity parameters, the FPGA based system has been developed.", "num_citations": "11\n", "authors": ["878"]}
{"title": "Data processing and analysis for 2D imaging GEM detector system\n", "abstract": " The Triple Gas Electron Multiplier (T-GEM) is presented as soft X-ray (SXR) energy and position sensitive detector for high-resolution X-ray diagnostics of magnetic confinement fusion plasmas [1]. Multi-channel measurement system and essential data processing for X-ray energy and position recognition is consider. Several modes of data acquisition are introduced depending on processing division for hardware and software components. Typical measuring issues aredeliberated for enhancement of data quality. Fundamental output characteristics are presented for one and two dimensional detector structure. Representative results for reference X-ray source and tokamak plasma are demonstrated.", "num_citations": "10\n", "authors": ["878"]}
{"title": "Effect of dotarizine on CO 2-dependent cerebrovascular reactivity\n", "abstract": " Dotarizine is chemically related to calcium antagonist cinnarizine and flunarizine. The study presented investigates the influence of the drug on the diameter of cortical arteries and cerebral blood velocity measured in the MCA in two groups of anaesthetized cats. Changes of vessel diameter were measured indirectly using photographs of the cerebral cortex during experiments, and flow velocity was measured using transcranial Doppler sonography. Dotarizine was administrated by 20 minute intravenous infusion in a dose of 0.05 mg/kg/min. In the first group of animals the infusion was started during normoventilation, in the next group the infusion started during 30th minute of hyperventilation.               The most conspicuous data were obtained in experiments conducted in hyperventilated animals where dotarizine abolished the vasoconstrictive effect of hyperventilation. The results suggest that dotarizine has …", "num_citations": "10\n", "authors": ["878"]}
{"title": "The development of algorithms for the deployment of new version of GEM-detector-based acquisition system\n", "abstract": " This article is an overview of what has been implemented in the process of development and testing the GEM detector based acquisition system in terms of post-processing algorithms. Information is given on mex functions for extended statistics collection, unified hex topology and optimized S-DAQ algorithm for splitting overlapped signals. Additional discussion on bottlenecks and major factors concerning optimization is presented.", "num_citations": "9\n", "authors": ["878"]}
{"title": "Implementation of PCI Express bus communication for FPGA-based data acquisition system\n", "abstract": " This paper presents a PCI Express based system dedicated for communication with FPGA in data acquisition systems. The system consisted of FPGA IP core containing PCIE endpoint tightly coupled with with the user core (further denoted as “USR core”) and the DDR3 memory controller, together with Linux device driver. The Linux OS was running on top of typical x86-64 system.", "num_citations": "9\n", "authors": ["878"]}
{"title": "Resistive plate chamber commissioning and performance in CMS\n", "abstract": " The CMS muon system is conceived for trigger and muon track reconstruction. The redundancy and robustness of the system are guaranteed by three complementary subsystems: drift tube in the barrel, cathode strip chamber in the end-cap and resistive plate chamber in barrel and end-cap. The installation of muon stations and read-out trigger electronic has been completed in middle 2007. Since than, a remarkable effort has been addressed to the detector commissioning in order to ensure the readiness of the hardware/software chain for the LHC start up operation. At the end of 2007, a test of an entire CMS slice has been performed, involving about 5% of muon stations. Several thousand cosmic muons events have been collected. Performance of the barrel chambers are reported.", "num_citations": "9\n", "authors": ["878"]}
{"title": "Performance evaluation of developed GEM-based X-Ray diagnostic system\n", "abstract": " Performance evaluation of developed GEM-based X-Ray diagnostic system Page 1 Performance evaluation of developed GEM-based X-Ray diagnostic system Pawel Linczuk, Andrzej Wojeński, Rafal D. Krawczyk, Wojciech Zabołotny, Krzysztof Pozniak, Maryna Chernyshova, Tomasz Czarski, Piotr Kolasiński, Grzegorz Kasprowicz, Michał Gąska, Ewa Kowalska-Strzęciwilk, Karol Malinowski Warsaw, 07.11.2017 Page 2 Presentation plan • Introduction • System parts description: – overview – logical division – technical details – throughput – actual state of development • Conclusions and future works 2 Page 3 • 1st generation system, used in JET tokamak, Culham, GB – computation based on FPGA • New demands for ITER-like tokamaks (WEST tokamak) • FPGA not scalable: – limited hardware resources with expensive improvement – longer time of development – less efficient for complex algorithms with huge …", "num_citations": "8\n", "authors": ["878"]}
{"title": "Feasibility of FPGA to HPC computation migration of plasma impurities diagnostic algorithms\n", "abstract": " We present a feasibility study of fast events parameters estimation algorithms regarding their execution time. It is the first stage of procedure used on data gathered from gas electron multiplier (GEM) detector for diagnostic of plasma impurities. Measured execution times are estimates of achievable times for future and more complex algorithms. The work covers usage of Intel Xeon and Intel Xeon Phi-high-performance computing (HPC) devices as a possible replacement for FPGA with highlighted advantages and disadvantages. Results show that less than 10 ms feedback loop can be obtained with the usage of 25% hardware resources in Intel Xeon or 10% resources in Intel Xeon Phi which leaves space for future increase of algorithms complexity. Moreover, this work contains a simplified overview of basic problems in actual measurement systems for diagnostic of plasma impurities, and emerging trends in developed solutions.", "num_citations": "8\n", "authors": ["878"]}
{"title": "Evaluation of FPGA to PC feedback loop\n", "abstract": " The paper presents the evaluation study of the performance of the data transmission subsystem which can be used in High Energy Physics (HEP) and other High-Performance Computing (HPC) systems. The test environment consisted of Xilinx Artix-7 FPGA and server-grade PC connected via the PCIe 4xGen2 bus. The DMA engine was based on the Xilinx DMA for PCI Express Subsystem1 controlled by the modified Xilinx XDMA kernel driver.2 The research is focused on the influence of the system configuration on achievable throughput and latency of data transfer.", "num_citations": "8\n", "authors": ["878"]}
{"title": "C to vhdl compiler\n", "abstract": " The main goal of C to VHDL compiler project is to make FPGA platform more accessible for scientists and software developers. FPGA platform offers unique ability to configure the hardware to implement virtually any dedicated architecture, and modern devices provide sufficient number of hardware resources to implement parallel execution platforms with complex processing units. All this makes the FPGA platform very attractive for those looking for efficient heterogeneous, computing environment. Current industry standard in development of digital systems on FPGA platform is based on HDLs. Although very effective and expressive in hands of hardware development specialists, these languages require specific knowledge and experience, unreachable for most scientists and software programmers. C to VHDL compiler project attempts to remedy that by creating an application, that derives initial VHDL description of …", "num_citations": "8\n", "authors": ["878"]}
{"title": "Automatic management of local bus address space in complex FPGA-implemented hierarchical systems\n", "abstract": " The FPGA-implemented data acquisition and processing systems are usually configured via local bus providing access to internal control and status registers. Management of the address space of that local bus is a well known and non-trivial problem, especially in complex hierarchical systems. Even though various solutions have been already proposed, it seems that there is still a need for an open, portable address management system, capable of operation with different local bus technologies and various control interfaces. This paper presents a proposition for such a system. The multi-level hierarchy of nested blocks with internal control and status registers is supported. The blocks and registers may be implemented as single instances or vectors of multiple instances. The structure of the system is described with the XML file. The generated address map may be stored in various formats compatible with different …", "num_citations": "7\n", "authors": ["878"]}
{"title": "Novel application of parallel computing techniques in soft X-rays plasma measurement systems for the WEST experimental thermal fusion reactor\n", "abstract": " The article presents results of the novel approach of combining high-performance and parallel computing solutions with front-end electronics in the development of scalable specialized soft X-rays measurement tool for high-scale plasma physics experiments with thermal fusion devices. Regarding the need for an easily-modifiable advanced diagnostics of tokamak hot plasma content, the heterogeneous system consisting of FPGAs and the PC server was introduced. The objective is to provide data quality monitoring and evaluation mechanisms along with an algorithm benchmarking tool for fast, low-latency measurements of soft X-rays emitted by hot tokamak plasma. The article describes a method of the development of the computation pipeline on the server side. The novel parallel algorithms and results are discussed. This brand new approach is targeted to adapt a HPC techniques in new areas of science, where …", "num_citations": "7\n", "authors": ["878"]}
{"title": "DMA implementations for FPGA-based data acquisition systems\n", "abstract": " The paper describes three implementations of DMA engines created for different data acquisition (DAQ) systems. The designs are based on vendor (Xilinx) provided IP cores. The emphasis is put on typical problems related to the implementation of high-performance data acquisition systems. The selection or building of proper DMA cores is shown, and typical problems associated with the realization of the device driver are described. Sources of the described systems are publically available.", "num_citations": "7\n", "authors": ["878"]}
{"title": "The computation in diagnostics for tokamaks: systems, designs, approaches\n", "abstract": " The requirements given for GEM (Gaseous Electron Multiplier) detector based acquisition system for plasma impurities diagnostics triggered a need for the development of a specialized software and hardware architecture. The amount of computations with latency and throughput restrictions cause that an advanced solution is sought for. In order to provide a mechanism fitting the designated tokamaks, an insight into existing solutions was necessary. In the article there is discussed architecture of systems used for plasma diagnostics and in related scientific fields. The developed solution is compared and contrasted with other diagnostic and control systems. Particular attention is payed to specific requirements for plasma impurities diagnostics in tokamak thermal fusion reactor. Subsequently, the details are presented that justified the choice of the system architecture and the discussion on various approaches is given.", "num_citations": "7\n", "authors": ["878"]}
{"title": "Low latency protocol for transmission of measurement data from FPGA to Linux computer via 10 Gbps Ethernet link\n", "abstract": " This paper presents FADE-10G—an integrated solution for modern multichannel measurement systems. Its main aim is a low latency, reliable transmission of measurement data from FPGA-based front-end electronic boards (FEBs) to a computer-based node in the Data Acquisition System (DAQ), using a standard Ethernet 1 Gbps or 10 Gbps link. In addition to transmission of data, the system allows the user to send reliably simple control commands from DAQ to FEB and to receive responses.", "num_citations": "7\n", "authors": ["878"]}
{"title": "Dual port memory based parallel programmable architecture for dsp in fpga\n", "abstract": " This document presents a proposal of a new architecture for implementation of Digital Signal Processing (DSP) algorithms in Field-Programmable Gate Array (FPGA). The proposed approach uses the dual port memory for fast exchange of information between the processing units implemented in the FPGA. The special, parametrized scheme of interconnections between processing units has been also proposed, which allows to synthesize DSP system with customized number of processing units. The proposed interconnections scheme provides possibility to quickly transfer the data between processing units, at reasonable consumption of routing resources. The proposed architecture has been tested in simulations, and synthesized for real FPGA chips to verify its correctness.", "num_citations": "7\n", "authors": ["878"]}
{"title": "Dsp algorithms in fpga: proposition of a new architecture\n", "abstract": " This paper presents a new reconfigurable architecture created in FPGA which is optimized for DSP algorithms like digital filters or digital transforms. The architecture tries to combine advantages of typical architectures like DSP processors and datapath architecture, while avoiding their drawbacks. The architecture is built from blocks called Operational Units (OU). Each Operational Unit contains the Control Unit (CU), which controls its operation. The Operational Units may operate in parallel, which shortens the processing time. This structure is also highly flexible, because all OUs may operate independently, executing their own programs. User may customize connections between units and modify architecture by adding new modules.", "num_citations": "7\n", "authors": ["878"]}
{"title": "RPC link box control system for RPC detector in LHC experiment\n", "abstract": " This paper describes the RPC Link Box Control System (RLBCS) developed for the RPC muon trigger in the CMS experiment on LHC collider under construction in CERN (Geneva). RLBCS subsystem is reponsible for relatively slow, bidirectional communication between the link electronics placed on detector and devices of CMS Detector Control System (DCS) located in the control room. The RLBCS is used for diagnostic and control purposes, and therefore it is essential for the RPC muon trigger. The RLBCS is also responsible for configuration of the FPGAs in the RPC link electronics, working in the harsh, irradiated environment. Additionally most part of the RLBCS itself works in the irradiated area, so assuring its reliable operation required some special solutions. All the above factors make this subsystem an important and non-trivial task in the CMS RPC muon trigger development.", "num_citations": "7\n", "authors": ["878"]}
{"title": "Irradiation effects in electronic components of the RPC trigger for the CMS experiment\n", "abstract": " The results of proton radiation test of electronic devices for RPC trigger electronic system of CMS detector are presented. For Xilinx Spartan-IIE FPGA the cross section for Single Event Upsets (SEUs) in configuration bits was measured. The dynamic SEUs in flip-flops was also investigated, but not observed. For the FLASH memories no single upsets were detected, but after a  huge dose permanent damages of devices were observed. For SDRAM memories, the SEU cross section was measured. A brief description of radiation inducted effects in FPGAs, SRAM and FLASH memories is also presented.", "num_citations": "7\n", "authors": ["878"]}
{"title": "MCORD: MPD cosmic ray detector for NICA\n", "abstract": " Multi-Purpose Detector (MPD) is a part of Nuclotron-based Ion Collider fAcility (NICA) located in Dubna, Russia. For full functionality, the MPD needs an additional trigger system for off-beam calibration of MPD subdetectors and for rejection of cosmic ray particles (mainly muons). The system could also be useful for astrophysics observations of cosmic showers initiated by high energy primary particles. The consortium NICA-PL comprised of several Polish scientific institutions has been formed to define goals and basic assumptions for MPD Cosmic Ray Detector (MCORD). This article describes the early stage design of the MCORD detector based on plastic scintillators with silicon photomultiplier photodetectors for scintillation readout and electronic system based on MicroTCA crate. Plans for simulations of MCORD detector performance are also presented.", "num_citations": "6\n", "authors": ["878"]}
{"title": "Measuring issues in the GEM detector system for fusion plasma imaging\n", "abstract": " A measurement systems based on GEM (Gas Electron Multiplier) detectors is developed for X-ray diagnostics of tokamak plasmas. The multi-channel setup is designed for evaluation the X-ray source distribution in energy, space and time. The paper deals with the development of a fast analysis and elaboration of collected data, including charge cluster identification and the separation of coincided signals. The proposed algorithm can be applied iteratively for series of superimposed pulses. On-line separation of overlapped signals was implemented applying the FPGA (FPGA—Field-Programmable Gate Array) technology with relatively simple firmware processing. We demonstrate reconstruction of coinciding signals and retrieval of radiation source properties and energy spectra.", "num_citations": "6\n", "authors": ["878"]}
{"title": "FPGA and Embedded Systems Based Fast Data Acquisition and Processing for GEM Detectors\n", "abstract": " Gas electron multiplier (GEM) detectors (Sauli in Nucl Instrum Methods Phys Res A 805:2–24, 2016.                    https://doi.org/10.1016/j.nima.2015.07.060                                     (special issue in memory of Glenn F. Knoll); Buzulutskov in Instrum Exp Tech 50(3):287–310, 2007.                    https://doi.org/10.1134/S0020441207030013                                    ) are widely used for detection of ionizing radiation. When used in the proportional mode, they provide information about time, location, and energy of a detected particle (Chernyshova et al. in Fusion Eng Design, 2017.                    https://doi.org/10.1016/j.fusengdes.2017.03.107                                    ; Altunbas et al. in Nucl Instrum Methods Phys Res A 490(1–2):177–203, 2002.                    https://doi.org/10.1016/S0168-9002(02)00910-5                                    .                    http://linkinghub.elsevier.com/retrieve/pii/S0168900202009105                                    ). Modern …", "num_citations": "6\n", "authors": ["878"]}
{"title": "Selection of hardware platform for CBM Common Readout Interface\n", "abstract": " The implementation of the CBM readout and DAQ chain is currently reconsidered. The proposed changes include replacement of two sets of FPGA-based boards with a single one: Common Readout Interface (CRI) board. The paper presents the analysis performed to select the optimal hardware platform for the CBM CRI, considering the cost and the number of input links serviced by a single board.", "num_citations": "6\n", "authors": ["878"]}
{"title": "Modeling of serial data acquisition structure for GEM detector system in Matlab\n", "abstract": " This article presents method of modeling in Matlab hardware architecture dedicated for FPGA created by languages like VHDL or Verilog. Purposes of creating such type of model with its advantages and disadvantages are described. Rules presented in this article were exploited to create model of Serial Data Acquisition algorithm used in X-ray GEM detector system. Result were compared to real working model implemented in VHDL. After testing of basic structure, other two structures were modeled to see influence parameters of the structure on its behavior.", "num_citations": "6\n", "authors": ["878"]}
{"title": "Time and clock synchronization with AFCK for CBM\n", "abstract": " The AMC FMC Carrier Kintex (AFCK) board is a prototype of Data Processing Board (DPB) for CBM experiment. AFCK is open hardware and was designed to be a versatile solution, applicable in multiple systems. In CBM experiment AFCK will serve as a data hub and communication interconnection. One of DPB's functions is synchronization of Front End Electronics (FEE). To provide this functionality, it is necessary to receive the reference clock and timing signals from the Timing and Flow Control system. The received clock after the jitter cleaning will be used as a reference clock for GBT-FPGA based 4.8 Gbps links used for communication with front end electronics. This article will briefly describe AFCK board function in CBM experiment. Afterwards it will focus on jitter cleaning technique based on White Rabbit solution that can be used on AFCK board.", "num_citations": "6\n", "authors": ["878"]}
{"title": "Fast data transmission in dynamic data acquisition system for plasma diagnostics\n", "abstract": " This paper describes architecture of a new data acquisition system (DAQ) targeted mainly at plasma diagnostic experiments. Modular architecture, in combination with selected hardware components, allows for straightforward reconfiguration of the whole system, both offline and online. Main emphasis will be put into the implementation of data transmission subsystem in said system. One of the biggest advantages of described system is modular architecture with well defined boundaries between main components: analog frontend (AFE), digital backplane and acquisition/control software. Usage of a FPGA chips allows for a high flexibility in design of analog frontends, including ADC ↔ FPGA interface. Data transmission between backplane boards and user software was accomplished with the use of industry-standard PCI Express (PCIe) technology. PCIe implementation includes both FPGA firmware and Linux …", "num_citations": "6\n", "authors": ["878"]}
{"title": "Development of 2D imaging of SXR plasma radiation by means of GEM detectors\n", "abstract": " Presented 2D gaseous detector system has been developed and designed to provide energy resolved fast dynamic plasma radiation imaging in the soft X-Ray region with 0.1 kHz exposure frequency for online, made in real time, data acquisition (DAQ) mode. The detection structure is based on triple Gas Electron Multiplier (GEM) amplification structure followed by the pixel readout electrode. The efficiency of detecting unit was adjusted for the radiation energy region of tungsten in high-temperature plasma, the main candidate for the plasma facing material for future thermonuclear reactors. Here we present preliminary laboratory results and detector parameters obtained for the developed system. The operational characteristics and conditions of the detector were designed to work in the X-Ray range of 2-17 keV. The detector linearity was checked using the fluorescence lines of different elements and was found to …", "num_citations": "6\n", "authors": ["878"]}
{"title": "Data management software concept for WEST plasma measurement system\n", "abstract": " This paper describes the concept of data management software for the multichannel readout system for the GEM detector used in WEST Plasma experiment. The proposed system consists of three separate communication channels: fast data channel, diagnostics channel, slow data channel. Fast data channel is provided by the FPGA with integrated ARM cores providing direct readout data from Analog Front Ends through 10GbE with short, guaranteed intervals. Slow data channel is provided by multiple, fast CPUs after data processing with detailed readout data with use of GNU/Linux OS and appropriate software. Diagnostic channel provides detailed feedback for control purposes.", "num_citations": "6\n", "authors": ["878"]}
{"title": "Low cost USB-local bus interface for FPGA based systems\n", "abstract": " This paper presents a concept of simple interface allowing to control the local bus of the FPGA based system from the computer working as USB host. Such approach may significantly simplify and decrease cost of development of FPGA based systems.", "num_citations": "6\n", "authors": ["878"]}
{"title": "Automatic test-bench for GEM detectors\n", "abstract": " The paper describes construction of a scalable, automatic measurement system to research GEM detectors. The testbench enables concurrent and precise measurements of many discharge current signals originating from the charges generated by the avalanche process in gas in the GEM micro-holes where the electric field gradient is high. We used Tektronix scopes MSO/DPO4104 and MSO/DPO5104 and Matlab to collect and process the data. Construction of the test-bench is presented in terms of hardware and software. The examples of lab condition measurements were presented. Analysis of these data enable the estimation of the quality of the GEM detector.", "num_citations": "6\n", "authors": ["878"]}
{"title": "Clock-efficient and maintainable implementation of complex state machines in vhdl\n", "abstract": " This paper presents a nonstandard approach to describe the complex state machines in VHDL to obtain both good readability of the code and efficient operation. This new approach, called \"variable driven flow control in sequential process\" allows to avoid loss of clock cycles when complex decisions are to be taken, and simultaneously allows to keep the structure of the code clear and easy to maintain. A simple example has been presented, showing the idea and practical implementation of the proposed method. The code produced by the presented method is synthesizable, and the obtained parameters of resulting FPGA implementation (both speed and occupancy) are good.", "num_citations": "6\n", "authors": ["878"]}
{"title": "Diagnostic tools for the RPC muon trigger of the CMS detector-design and test beam results\n", "abstract": " The resistive plate chambers (RPCs) muon trigger electronics of the Compact Muon Solenoid (CMS) detector performs a number of tasks: synchronization of detector signals, optical data transmission from the detector to the trigger electronics, pattern recognition, muons momentum measurement, selection of track candidates. For the diagnostic purposes, as well as for the calibration and real-time monitoring of the RPC detectors and electronic hardware, a set of flexible diagnostic modules was designed and implemented into the field programmable gate arrays on which the trigger electronics is based. These include: multichannel counters, timing histograms, test pulses generators, diagnostic readout and data spying (\"snap-shots\" of the data stream). Test results presented in this paper, including tests with Large Hadron Collider-like muon beam, illustrate the performance and the usefulness of these diagnostic …", "num_citations": "6\n", "authors": ["878"]}
{"title": "Radiation tolerant design of RLBCS system for RPC detector in LHC experiment\n", "abstract": " This paper describes the design of the Link Box Control System for the RPC Detector (RLBCS), emphasizing the features needed to assure reliable operation in the irradiated environment of the RPC detector and its neighbourhood. The development process required to balance different factors - radiation hardness, reliability, flexibility, firmware upgrade possibilities, diagnostic features. The final design presented in the paper is a result of compromise between the above requirements.", "num_citations": "6\n", "authors": ["878"]}
{"title": "Does left-handedness affect the pattern of cerebral blood flow during cognitive activity?\n", "abstract": " In most people the left hemisphere of the brain is dominant for language functions. Because of an increased incidence of atypical language lateralisation in the right hemisphere of left-handed neurological patients, more systematic studies on handedness and cerebral asymmetry of language have been undertaken. The present study is aimed at clarification of the relationship between handedness and language dominance in healthy subjects. Lateralisation was measured directly using functional transcranial Doppler sonography in left-handed subjects. Twenty-six individuals participated in the study. Three kinds of tasks were used, differing in the material involved and in appropriate strategies to be employed by the subjects. Two important parameters of the MCA blood flow were analysed: mean relative increase in the blood flow velocity (MDV) and specific patterns of cognitive task performance (ie performance profiles). Our results indicate that the incidence of the right hemisphere dominance for language depends on the degree of handedness, since only in the group of consistent left-handers language was right lateralised. In other left-handers both cerebral hemispheres were functionally equivalent. The measurement of MCA blood flow velocity changes using transcranial Doppler ultrasonography seems to be a simple and non-invasive method of assessing the functioning of the two hemispheres of human brain.", "num_citations": "6\n", "authors": ["878"]}
{"title": "Post-shunting improvement in hydrocephalic patients described by cerebrospinal compensatory parameters\n", "abstract": " Many authors have studied the problem of predictive factors with regard to the post-shunting improvement in communicating hydrocephalus. There is still no agreement on the validity of such factors as the ventricular enlargement ratio seen on CT, clinical symptoms and parameters of the cerebrospinal volume compensation [1,4]. This problem seems to be really important with respect to establishing the proper diagnostic protocol in hydrocephalus. There are many protocols, used in different centers, which seems to contrast with the current state of knowledge about this entity.", "num_citations": "6\n", "authors": ["878"]}
{"title": "Latency and throughput of online processing in soft x-ray GEM-based measurement system\n", "abstract": " The paper presents latency and performance study of the monitoring system for plasma impurities radiation in a tokamak. The developed solution measures radiation in Soft X-Ray range and can provide valuable information about the ongoing experiment with low latency. This work presents the test configuration with a single-dimensional pixel topology, with 64 channels, tested at photon rate about 100 kHz per channel. The hardware consists of the GEM-based detector, FPGAs, PCIe transmission system and the computer system with 64-bit x86 architecture. The software is the C/C++ code optimized for the execution time and working in the global trigger mode. The system uses raw data acquisition and the backend computations in CPU to provide high accuracy and high-quality results, not easily achievable otherwise. The research includes measurements of the throughput of the system and the latency of the …", "num_citations": "5\n", "authors": ["878"]}
{"title": "MCORD-MPD Cosmic Ray Detector a new features\n", "abstract": " The main detector system at the Nuclotron-based Ion Collider fAcility (NICA) located in Dubna, Russia is the Multi-Purpose Detector (MPD). For better calibration reason, the MPD needs an additional trigger system for an off-beam calibration of MPD sub-detectors and for rejection (veto) of cosmic muons. The system should also be useful for practical astrophysics observations of cosmic showers. The consortium NICA-PL group defines goals and basic assumptions for the MPD Cosmic Ray Detector (MCORD). This article describes the conceptual design and simulation plans of the MCORD detector based on plastic scintillators with SiPM photodetectors and electronic digital system based on the MicroTCA crate.", "num_citations": "5\n", "authors": ["878"]}
{"title": "Data distribution and dispatching software for processing measurement data acquired with SXR GEM-based system\n", "abstract": " We present the concept of data distribution and dispatching software which is prepared for low latency and high throughput SXR measurement system developed by our group. Its scope includes handling data acquisition from multiple FPGA chips, execution of numerical algorithms with the use of multiple threads and post calculation storage and transfer. Data transfer to CPU side is done with usage of DMA via PCIe interface with specially developed Linux driver. This paper describes the need and details of discussed part of the system.", "num_citations": "5\n", "authors": ["878"]}
{"title": "The software-defined fast post-processing for gem soft x-ray diagnostics in the tungsten environment in steady-state tokamak thermal fusion reactor\n", "abstract": " This article presents a novel software-defined server-based solutions that were introduced in the fast, real-time computation systems for soft X-ray diagnostics for the WEST (Tungsten Environment in Steady-state Tokamak) reactor in Cadarache, France. The objective of the research was to provide a fast processing of data at high throughput and with low latencies for investigating the interplay between the particle transport and magnetohydrodynamic activity. The long-term objective is to implement in the future a fast feedback signal in the reactor control mechanisms to sustain the fusion reaction. The implemented electronic measurement device is anticipated to be deployed in the WEST. A standalone software-defined computation engine was designed to handle data collected at high rates in the server back-end of the system. Signals are obtained from the front-end field-programmable gate array mezzanine cards …", "num_citations": "5\n", "authors": ["878"]}
{"title": "Implementation of the data acquisition system for the Overlap Muon Track Finder in the CMS experiment\n", "abstract": " The Overlap Muon Track Finder (OMTF) is the new system developed during the upgrade of the CMS experiment which includes the upgrade of its Level-1 trigger. It uses the novelty approach to finding muon candidates based on data received from three types of detectors: RPC, DT, and CSC. The upgrade of the trigger system requires also upgrade of the associated Data Acquisition (DAQ) system. The OMTF DAQ transmits the data from the connected detectors that were the basis for the Level-1 trigger decision. To increase its diagnostic potential, it may also transmit the data from a few bunch crossings (BXes) preceding or following the BX, in which the L1 trigger was generated. The paper describes the technical concepts and solutions used in the OMTF DAQ system. The system is still under development. However, it successfully passed the first tests.", "num_citations": "5\n", "authors": ["878"]}
{"title": "From the Physical Model to the Electronic System - OMTF Trigger for CMS\n", "abstract": " The paper presents the development of the Overlap Muon Track Finder (OMTF) trigger for the CMS experiment at CERN. The transition from the data produced by the physical model to the algorithm suitable for practical implementation is shown. The paper also concentrates on the problems related to the necessity of continuous adaptation of the algorithm to the changing operating conditions of the detector", "num_citations": "5\n", "authors": ["878"]}
{"title": "Internal monitoring of GBTx emulator using IPbus for CBM experiment\n", "abstract": " The Compressed Baryonic Matter (CBM) experiment is a part of the Facility for Antiproton and Ion Research (FAIR) in Darmstadt at GSI. In CBM experiment a precisely time synchronized fault tolerant self-triggered electronics is required for Data Acquisition (DAQ) system in CBM experiments which can support high data rate (up to several TB/s). As a part of the implementation of the DAQ system of Muon Chamber (MUCH) which is one of the important detectors in CBM experiment, a FPGA based Gigabit Transceiver (GBTx) emulator is implemented. Readout chain for MUCH consists of XYTER chips (Front end electronics) which will be directly connected to detector, GBTx emulator, Data Processing Board (DPB) and First level event selector board (FLIB) with backend software interface. GBTx emulator will be connected with the XYTER emulator through LVDS (Low Voltage Differential Signalling) line in the front end …", "num_citations": "5\n", "authors": ["878"]}
{"title": "Towards the Data Processing Boards for CBM experiment\n", "abstract": " The Data Processing Boards (DPB)[1] are important part of the CBM readout and detector control systems, providing concentration (possibly combined with local preprocessing) of readout data, before they are sent to the First Level Event Selector (FLES). Additionally DPBs should provide fast and slow control for the Front End Electronics (FEE), distribute the reference clock, and time-critical information, like synchronization and flow control messages from the Timing and Flow Control system (TFC). To allow testing of different possible implementations of listed functionalities, the versatile prototyping Open Hardware platform-AMC FMC Carrier Kintex (AFCK)[2] was created. The first version of AFCK is shown in figure 1.", "num_citations": "5\n", "authors": ["878"]}
{"title": "Embedded controller for GEM detector readout system\n", "abstract": " This paper describes the embedded controller used for the multichannel readout system for the GEM detector. The controller is based on the embedded Mini ITX mainboard, running the GNU/Linux operating system. The controller offers two interfaces to communicate with the FPGA based readout system. FPGA configuration and diagnostics is controlled via low speed USB based interface, while high-speed setup of the readout parameters and reception of the measured data is handled by the PCI Express (PCIe) interface. Hardware access is synchronized by the dedicated server written in C. Multiple clients may connect to this server via TCP/IP network, and different priority is assigned to individual clients. Specialized protocols have been implemented both for low level access on register level and for high level access with transfer of structured data with \"msgpack\" protocol. High level functionalities have been split …", "num_citations": "5\n", "authors": ["878"]}
{"title": "Resistive Plate Chambers performance with Cosmic Rays in the CMS experiment\n", "abstract": " Abstract The Resistive Plate Chambers [M. Abbrescia, et al., Nucl. Instr. and Meth. A 550 (2005) 116] are used in the CMS experiment [CMS Collaboration, The CMS experiment at the CERN LHC 2008, J. Inst. 3 (2008) S08004] as a dedicated muon trigger both in barrel and endcap system. About 4000 m 2 of double gap RPCs have been produced and have been installed in the experiment since more than one and half Years. The full barrel system and a fraction of the endcaps have been monitored to study dark current behaviour and system stability, and have been extensively commissioned with Cosmic Rays collected by the full CMS experiment.", "num_citations": "5\n", "authors": ["878"]}
{"title": "Cerebrospinal fluid pulse pressure waveform analysis in hydrocephalic children\n", "abstract": " Analysis of cerebrospinal fluid pulse pressure was reported to be useful in the assessment of the cerebrospinal pressure-volume compensation. The method for the estimation of high-frequency centroid (HFC) was modified and used to verify the correlation between HFC and other compensatory parameters investigated by means of the lumbar infusion test in 94 hydrocephalic children. The results confirm that in hydrocephalus HFC is positively correlated to cerebrospinal elasticity coefficient, but inversely to mean CSF pressure and pulse wave amplitude. It was also demonstrated that HFC decreased dynamically during the infusion test.", "num_citations": "5\n", "authors": ["878"]}
{"title": "GBTX Emulation for BM@N/MPD Data Acquisition Systems\n", "abstract": " GBTX [1] is a radiation tolerant ASIC, able to provide multiple high-speed links for high-energy physics experiments. The user data frame with a length of 80 bits (with FEC) or 112 bits (without FEC) is transmitted every 25 ns in both directions via the optical GBT link operating at 4.8 Gb/s data rate. At the Frontend Electronics (FEE) side, this data may be used to implement so-called E-Links–SPI-like synchronous links, working at clock frequency between 40 and 320 MHz and with data rate between 80 and 320 Mb/s (DDR operation is possible)", "num_citations": "4\n", "authors": ["878"]}
{"title": "CRI board for CBM experiment: preliminary studies\n", "abstract": " The Common Readout Interface (CRI) is an important component of the new architecture of readout and DAQ chain for CBM. The paper presents the results of preliminary analysis and experiments performed to assess the possibility to implement the CRI firmware in the selected prototyping hardware platform. It also reviews functionalities provided by the Zynq UltraScale+ platform regarding their usability for the creation of the PCIe-based data concentration system.", "num_citations": "4\n", "authors": ["878"]}
{"title": "GBT oriented firmware for Data Processing Boards for CBM\n", "abstract": " The Compressed Baryonic Matter (CBM) experiment is currently prepared at the Facility for Antiproton and Ion Research (FAIR) in Darmstadt. Its purpose is the exploration of the QCD phase diagram in the region of high baryon densities during highenergy nucleusnucleus collisions [1]. CBM will utilize various particle detectors: Micro Vertex Detector (MVD), Ring Imaging Cherenkov Detector (RICH), Transition Radiation Detector (TRD), Time of Flight Detector (TOF), Projectile Spectator Detector (PSD), Silicon Tracking System (STS), Muon Chamber (MUCH). In the first version of the CBM readout chain the Data Processing Boards (DPB) were important components responsible for communication between the Front End Electronics (FEE) boards, the Timing and Fast Control (TFC) system, the Experiment Control System (ECS) and the first stage of the data acquisition system First Level Event Selector (FLES).", "num_citations": "4\n", "authors": ["878"]}
{"title": "Multichannel Data Acquisition System for GEM Detectors\n", "abstract": " This paper presents the data acquisition system for GEM-detector (Sauli in Nucl Instrum Methods Phys Res Sect A Accel Spectrom Detect Assoc Equip 386(2–3): 531–534, 1997.                    https://doi.org/10.1016/S0168-9002(96)01172-2                                    ) based cameras and spectrometers (Chernyshova et al. in Fusion Eng Des, 2017.                    https://doi.org/10.1016/j.fusengdes.2017.03.107                                    ). The system is modular (Czarski et al. in Rev Sci Instrum 87(11): 11E336, 2016.                    https://doi.org/10.1063/1.4961559                                    ) and supports 1D and 2D GEM arrays with software-defined readout modes. Channel count can vary from 8 up to hundreds. The readout electronics consists of two units—radiation tolerant Analog Front End and rack-mount data processing unit. Data processing is split into two parts—real-time hardware, based on FPGA and software, based on …", "num_citations": "4\n", "authors": ["878"]}
{"title": "Design of versatile ASIC and protocol tester for CBM readout system\n", "abstract": " Silicon Tracking System (STS), Muon Chamber (MUCH) and Transition Radiation Detector (TRD) subdetectors in the Compressed Baryonic Matter (CBM) detector system at Facility for Antiproton and Ion Research (FAIR) use the same innovative protocol ensuring reliable synchronization of the communication link between the controller and the front-end ASIC, transmission of time-deterministic commands to the ASIC and efficient readout of data. The paper describes the FPGA-based tester platform which can be used both for the verification of the protocol implementation in a front-end ASIC at the design stage, and for testing of the produced ASICs. Due to its modularity, the platform can be easily adapted for different integrated circuits and readout systems.", "num_citations": "4\n", "authors": ["878"]}
{"title": "Elektroniczne systemy pomiarowe do diagnostyki gorącej plazmy tokamakowej\n", "abstract": " W artykule przedstawiono opracowane przez Zespół Autorów wydajne elektroniczne systemy pomiarowe do diagnostyki gorącej plazmy tokamakowej bazujące na detektorach GEM. Na wstępie krótko omówiono realizowane eksperymenty fizyczne związane z gorącą plazmą oraz zasadę działania detektorów GEM, wykorzystywanych do rejestracji promieniowania miękkiego typu X emitowanego w tokamakach. Przedstawiono ogólną koncepcję budowy systemów elektronicznych do realizacji diagnostyki gorącej plazmy, działających z dużą ilość kanałów wejściowych oraz krótkim czasem przetwarzania danych. Omówiono dwa kluczowe systemy opracowywane przez Zespół: system sprzętowego histogramowania miękkiego promieniowania X oraz system szybkiej akwizycji potokowej miękkiego promieniowania X. Opisano budowę sprzętową systemów, opracowane koncepcje oraz implementacje oprogramowania (firmware oraz software) wraz z niezbędnymi algorytmami. Przedstawiono ponadto wyniki z działania systemów.", "num_citations": "4\n", "authors": ["878"]}
{"title": "Automatic latency balancing in VHDL-implemented complex pipelined systems\n", "abstract": " Balancing (equalization) of latency in parallel paths in the pipelined data processing system is an important problem. Without that the data from different paths arrive at the processing blocks in different clock cycles, and incorrect results are produced. Manual correction of latencies is a tedious and error-prone work. This paper presents an automatic method of latency equalization in systems described in VHDL. The method is based on simulation and is portable between different simulation and synthesis tools. The method does not increase the complexity of the synthesized design comparing to the solution based on manual latency adjustment. The example implementation of the proposed methodology together with a simple design demonstrating its use is available as an open source project under BSD license.", "num_citations": "4\n", "authors": ["878"]}
{"title": "FPGA implementation of overlap MTF trigger: preliminary study\n", "abstract": " The paper presents the concept of the Overlap Muon Track Finder (OTF) trigger for the CMS experiment in CERN as a system implemented in the modern FPGA device. The parametrized description of the complex data processing system, allowing further optimization by iterative simulations and recompilations, is presented. Problems associated with synthesis of such complex systems with currently available synthesis tools, and their workarounds are described.", "num_citations": "4\n", "authors": ["878"]}
{"title": "Implementation of PCIe-SerDes-DDR3 communication in a multi-FPGA data acquisition system\n", "abstract": " This paper describes the embedded system used to store and transfer large amounts of data in a multichannel data acquisition system for the GEM detector. The stored data is used for diagnostics purposes.   System consists of an embedded mini ITX motherboard connected through the PCI Express (PCIe) link to a backplane FPGA. The backplane FPGA is connected through the SerDes/GTP links to (up to) 4 carrier boards. Each carrier board is connected to (up to) 4 FMC modules. System allows for a high speed data transfers between the ITX motherboard and the backplane or carrier modules. Due to high performance/reliability requirements, special care is taken for a proper data error correction/packet retransmission scenarios. There is also need for a proper communications diagnostics and a system addressing abstraction.   Due to a distributed nature of described data acquisition system, data stored in DDR …", "num_citations": "4\n", "authors": ["878"]}
{"title": "Optimized Ethernet transmission of acquired data from FPGA to embedded system\n", "abstract": " This paper presents a simple system consisting of the FPGA core, network protocol and Linux kernel driver, aimed on efficient transmission of acquired data from the low resources FPGA equipped with Ethernet PHY to the embedded system, responsible for preprocessing of those data and sending them further via standard network links. The system has been optimized regarding the memory and logic consumption in the FPGA. Implementation based on the Layer 3 protocol allows to minimize latency of the packet acknowledge, which results in reduction of memory requirements on the FPGA side. The driver code has been optimized to avoid unnecessary copying of data between buffers in memory, allowing the user application to access received data via memory mapped buffer. The system has been successfully tested in real hardware. Sources of the whole system are published and freely available under Open …", "num_citations": "4\n", "authors": ["878"]}
{"title": "Fundamental data processing for GEM detector measurement system applied for X-ray diagnostics of fusion plasmas\n", "abstract": " TRIPPLE-GAS ELECTRON MULTIPLIER (T-GEM) The X-ray T-GEM detectors [1, 2, 3] are based on collection of electrons created by direct ionization within the gas through application of a large electric field that initiates an electron avalanche. The multiplied space charge, which is injected to the final segment of the detector, so-called induction gap, and collected on the multi-strip plane, generates current anode signals detected by electronics. The structure of the detector is presented in Fig. 1.", "num_citations": "4\n", "authors": ["878"]}
{"title": "Development of embedded PC and FPGA based systems with virtual hardware\n", "abstract": " This paper discusses a methodology available to develop digital systems based on both: embedded computer and tightly coupled FPGA, using the virtual hardware. This approach allows to test design concepts and even to develop some parts of firmware and software before the real hardware is built, or to allow multiple developers to work simultaneously when only limited number of prototype devices is available. The aim of this paper is to show different available methods, providing the hardware-software co-simulation for development of such digital systems, with emphasis on the open source solutions, and to discuss their applicability.", "num_citations": "4\n", "authors": ["878"]}
{"title": "Readout system for CMS RPC muon trigger\n", "abstract": " This paper presents readout for RPC based muon trigger system, part of CMS experiment on LHC collider at CERN (Geneva). All RPC data used to perform trigger algorithm are collected on RPC trigger boards of and send to general CMS data acquisition system. Zero suppression used to transfer data from detector to control room is used to decrease the amount the links and data to be stored.", "num_citations": "4\n", "authors": ["878"]}
{"title": "Zero-Suppression Trigger Mode for GEM detector measurement system\n", "abstract": " A novel approach to a trigger mode in the Gas Electron Multiplier (GEM) detector readout system is presented. The system is already installed at WEST tokamak. The article briefly describes the architecture of the GEM detector and the measurement system. Currently the system can work in two trigger modes: Global Trigger and Local Trigger. All trigger processing blocks are parts of the Charge Signal Sequencer module which is responsible for transferring data to the PC. Therefore, the article presents structure of the Sequencer with details about basic blocks, theirs functionality and output data configuration. The Sequencer with the trigger algorithms is implemented in an FPGA chip from Xilinx. Global Trigger, which is a default mode for the system, is not efficient and has limitations due to storing much data without any information. Local trigger which is under tests, removes data redundancy and is constructed to send only valid data, but the rest of the software, especially on the PC side, is still under development. Therefore authors propose the trigger mode which combines functionality of two existing modes. The proposed trigger, called Zero Suppression Trigger, is compatible with the existing interfaces of the PC software, but is also capable to verify and filter incoming signals and transfer only recognized events. The results of the implementation and simulation are presented.", "num_citations": "3\n", "authors": ["878"]}
{"title": "First exploitation results of recently developed SXR GEM-based diagnostics at the WEST project\n", "abstract": " This contribution outlines the first preliminary acquisition data obtained by the GEM diagnostics on WEST. It was designed to monitor the radiation of impurities with a particular focus on the challenges of the elaborated plasma imaging technology in the area of SXR radiation. The details of the developed diagnostics and preliminary results obtained within the commissioning phase of the diagnostics at the WEST Project are provided. It is shown that both spatially and spectrally resolved calibrated data could be collected. A comparison with other WEST diagnostics manifests good qualitative agreement. Currently, the developed system records rather high energy part of the SXR radiation (above 4 keV), that nevertheless still could be useful to assess an intensification of the erosion.", "num_citations": "3\n", "authors": ["878"]}
{"title": "The CMS trigger system\n", "abstract": " The Compact Muon Solenoid (CMS)[1] is a multipurpose detector designed for the precision measurement of leptons, photons, and jets, among other physics objects, in proton-proton as well as heavy ion collisions at the CERN LHC [2]. The LHC is designed to collide protons at a center-ofmass energy of 14 TeV and a luminosity of 1034 cm− 2 s− 1. At design luminosity, the pp interaction rate exceeds 1 GHz. Only a small fraction of these collisions contain events of interest to the CMS physics program, and only a small fraction of those can be stored for later offline analysis. It is the job of the trigger system to select the interesting events for offline storage from the bulk of the inelastic collision events.To select events of potential physics interest [3], the CMS trigger utilizes two levels while, for comparison, ATLAS uses a three-tiered system [4]. The first level (L1) of the CMS trigger is implemented in custom hardware, and selects events containing candidate objects, eg, ionization deposits consistent with a muon, or energy clusters consistent with an electron, photon, τ lepton, missing transverse energy (Emiss", "num_citations": "3\n", "authors": ["878"]}
{"title": "Automatization of hardware configuration for plasma diagnostic system\n", "abstract": " Soft X-ray plasma measurement systems are mostly multi-channel, high performance systems. In case of the modular construction it is necessary to perform sophisticated system discovery in parallel with automatic system configuration. In the paper the structure of the modular system designed for tokamak plasma soft X-ray measurements is described. The concept of the system discovery and further automatic configuration is also presented. FCS application (FMC/ FPGA Configuration Software) is used for running sophisticated system setup with automatic verification of proper configuration. In order to provide flexibility of further system configurations (e.g. user setup), common communication interface is also described. The approach presented here is related to the automatic system firmware building presented in previous papers. Modular construction and multichannel measurements are key requirement in term of …", "num_citations": "3\n", "authors": ["878"]}
{"title": "Version control friendly project management system for FPGA designs\n", "abstract": " In complex FPGA designs, usage of version control system is a necessity. It is especially important in the case of designs developed by many developers or even by many teams. The standard development mode, however, offered by most FPGA vendors is the GUI based project mode. It is very convenient for a single developer, who can easily experiment with project settings, browse and modify the sources hierarchy, compile and test the design. Unfortunately, the project configuration is stored in files which are not suited for use with Version Control System (VCS). Another important problem in big FPGA designs is reuse of IP cores. Even though there are standard solutions like IEEE 1685-2014, they suffer from some limitations particularly significant for complex systems (e.g. only simple types are allowed for IP-core ports, it is not possible to use parametrized instances of IP-cores). Additionally, the overhead …", "num_citations": "3\n", "authors": ["878"]}
{"title": "CBM experiment local and global implications\n", "abstract": " The research area of the compressed baryonic matter-CBM experiment (FAIR/GSI in Darmstadt) is sub-nuclear physics, thus hadron-baryon and quark-gluon, and the essence of phase transitions in the area of hot nuclear matter, and dense strongly interacting matter. Our interest in this paper are mainly considerations on the impact of such large infrastructural experiments and possibilities they give to local, smaller but very active, university based research groups and communities. Research and technical input from such groups is depicted on the background of the CBM detector infrastructure and electronic instrumentation just under design and test fabrication for this experiment. An essential input to this research originates from Poland via the agreed in-kind contribution. The areas of expertise of these groups are: superconductivity, structural large scale cabling, precision machined parts, RF and microwave technology, analog and advanced digital electronics, distributed measurement and control systems, etc.", "num_citations": "3\n", "authors": ["878"]}
{"title": "OMTF firmware overview\n", "abstract": " This paper describes firmware architecture of a new part of muon trigger system of the CMS detector – one of four detectors installed along LHC accelerator in CERN. Overlap Muon Track Finder (OMTF) is a new trigger subsystem designed to work in difficult barrel-endcap region of CMS detector. OMTF is designed to receive data from different detector types and process it to select 3 best muon candidates. These muon candidates are then forwarded to Global Muon Trigger (GMT). Performance requirements demanded usage of custom designed hardware. All the data reception and processing takes part in modern, large FPGA device. The IPBus module allows easy firmware control and diagnostics via Ethernet connection.", "num_citations": "3\n", "authors": ["878"]}
{"title": "A four channels electrohysterograph with individually self tuning amplifier gains\n", "abstract": " The paper presents the specialized measurement system aimed on reliable recording of electrohysterographical (EHG) signals in pregnant women. System offers efficient attenuation of the mains interference and DC offset, together with adjustable gain, allowing to suit its sensitivity to the level of signal available in the particular patient. The noise level is further reduced by optimized bandwidth and optical fiber based connection between the EHG device and recording computer.", "num_citations": "3\n", "authors": ["878"]}
{"title": "Measurement capabilities upgrade of GEM soft X-ray measurement system for hot plasma diagnostics\n", "abstract": " The paper presents improvements of the developed system for hot plasma radiation measurement in the soft X-ray range based on a Gas Electron Multiplier (GEM) detector. Scope of work consists of a new solution for handling hardware time-synchronization with tokamak systems needed for better synchronization with other diagnostics and measurement quality. The paper describes the support of new modes of triggering on PC-side. There are communication and data path overview in the system. The new API is described, which provide separate channels for data and control and is more robust than the earlier solution. Work concentrates on stability and usability improvements of the implemented device providing better usage for end-user.", "num_citations": "2\n", "authors": ["878"]}
{"title": "Parallel computing in soft X-rays plasma diagnostic systems for thermal fusion reactors - feasibility studies for GPUs\n", "abstract": " This paper presents feasibility studies in utilizing graphics processing units (GPUs) as high‐performance computing hardware with front‐end electronics in high‐scale magnetic confinement thermal fusion experiments. The objective of the research is to provide scalable, high‐throughput, and low‐latency measurements for the runtime tokamak metallic impurities X‐ray diagnostic for the Tungsten Environment in Steady‐State Tokamak (WEST) reactor. The heterogeneous system of front‐end with field‐programmable gate arrays and the back‐end server was introduced to decompose workloads efficiently. It allows the comprehensive evaluation of CPUs and accelerators. In particular, a novel implementation of the back‐end algorithm for GPU with the performance analysis are presented.", "num_citations": "2\n", "authors": ["878"]}
{"title": "FPGA-related development for CBM DAQ\n", "abstract": " In the first half of 2020, the development was significantly focused on the maintenance and improvement of the DPB firmware. The beam tests have exposed the problem of hits that have been assigned an incorrect timestamp value. The effect was visible at higher hit rates. A thorough investigation has shown that the cause was an incorrect behavior of the heap sorter in case of overflow. The significant advantage of the heap sorter is the perfect sorting of hits. However, its behavior at high rates is not acceptable. As a solution for that problem, a new concept of the hit sorter has been proposed. It utilizes the bin (bucket) sorting, where hits are stored to the appropriate buffer depending on their timestamp’s lower bits. The hits in each bin are not sorted, but correct handling of overflow is much easier. If a hit is received for an already filled bucket, the hit is dropped and the bucket is marked as overflown. If a toomuch delayed hit is received for an already closed bucket is received, the git is dropped, and an error flag may be set. The architecture of the proposed bucket sorter is shown in Figure 1.", "num_citations": "2\n", "authors": ["878"]}
{"title": "Concept of the platform architecture for data integration from the Border Guard observation systems\n", "abstract": " The Operational Data Aggregation Platform (PADO) is an innovative technical solution that integrates modern ICT techniques with advanced hardware architecture based on a modular design. Its task is to integrate data from many different observational systems of the Border Guard (BG). The basic function of PADO is to increase the safety and effectiveness of BG activities effectively. The article discusses the proposed solutions for the construction of hardware architecture for the PADO platform, which enable the integration of data obtained from various systems and devices used in BG tactics. The system must ensure high reliability of work in severe propagation conditions, ICT performance in the area of information through a variety of communication channels mutually cooperating and low latency. One of the critical aspects of the system is the ability to modify the hardware layer through the implementation of …", "num_citations": "2\n", "authors": ["878"]}
{"title": "Mobile distribution point architecture concept of ICT infrastructure\n", "abstract": " Mobile Distribution Point of ICT Infrastructure (MPDIT) is an innovative mobile device that integrates modern ICT solutions with advanced hardware architecture with a modular design. The basic function of MPDIT is to effectively increase public safety and counteract and reduce many types of threats, such as natural disasters. The article discusses considered hardware architecture construction solutions for the MPDIT project. It must ensure high reliability of operation in difficult operating conditions, ICT performance in terms of throughput information through a variety of communication channels that cooperate and low latency. Critical is the ability to modify the hardware layer by implementing a modular construction and based solutions based on modern standards and technologies.", "num_citations": "2\n", "authors": ["878"]}
{"title": "Application of Forth CPU for control and debugging of FPGA-implemented systems\n", "abstract": " The easiest method to solve that problem is to connect an external CPU (eg, a simple and cheap ARM) That must be done at the PCB design stage, and increases complexity of the board Another possibility is to use a soft CPU implemented in FPGA soft CPU", "num_citations": "2\n", "authors": ["878"]}
{"title": "Matlab-based modeling of GEM diagnostic data sequencer\n", "abstract": " This paper focuses on the model of the sequencer algorithm created in Matlab. The sequencer is used in the measurement system of 2nd generation for GEM detector. First, are described and compared two generations of the system. The article explains why sequencer is needed in the new system and presents how it works. It can collect data from many sources and send it out in unambiguous order. The model of the sequencer designed in Matlab allows adjusting its parameters to the specific process. The article explains technical aspects of the model, describes basic objects that were used to build the model. In the end, there are presented results. The sequencer is implemented in FPGA device.", "num_citations": "2\n", "authors": ["878"]}
{"title": "An FPGA-Based High-Speed Error Resilient Data Aggregation and Control for High Energy Physics Experiment\n", "abstract": " Due to the dramatic increase of data volume in modern high energy physics (HEP) experiments, a robust high-speed data acquisition (DAQ) system is very much needed to gather the data generated during different nuclear interactions. As the DAQ works under harsh radiation environment, there is a fair chance of data corruption due to various energetic particles like alpha, beta, or neutron. Hence, a major challenge in the development of DAQ in the HEP experiment is to establish an error resilient communication system between front-end sensors or detectors and back-end data processing computing nodes. Here, we have implemented the DAQ using field-programmable gate array (FPGA) due to some of its inherent advantages over the application-specific integrated circuit. A novel orthogonal concatenated code and cyclic redundancy check (CRC) have been used to mitigate the effects of data corruption in the …", "num_citations": "2\n", "authors": ["878"]}
{"title": "Automatic latency equalization in VHDL-implemented complex pipelined systems\n", "abstract": " In the pipelined data processing systems it is very important to ensure that parallel paths delay data by the same number of clock cycles. If that condition is not met, the processing blocks receive data not properly aligned in time and produce incorrect results. Manual equalization of latencies is a tedious and error-prone work. This paper presents an automatic method of latency equalization in systems described in VHDL. The proposed method uses simulation to measure latencies and verify introduced correction. The solution is portable between different simulation and synthesis tools. The method does not increase the complexity of the synthesized design comparing to the solution based on manual latency adjustment. The example implementation of the proposed methodology together with a simple design demonstrating its use is available as an open source project under BSD license.", "num_citations": "2\n", "authors": ["878"]}
{"title": "Algorithms development for the GEM-based detection system\n", "abstract": " The measurement system based on GEM - Gas Electron Multiplier detector - is developed for soft X-ray diagnostics of tokamak plasmas. The multi-channel setup is designed for estimation of the energy and the position distribution of an Xray source. The focal measuring issue is the charge cluster identification by its value and position estimation. The fast and accurate mode of the serial data acquisition is applied for the dynamic plasma diagnostics. The charge clusters are counted in the space determined by 2D position, charge value and time intervals. Radiation source characteristics are presented by histograms for a selected range of position, time intervals and cluster charge values corresponding to the energy spectra.", "num_citations": "2\n", "authors": ["878"]}
{"title": "GEM detectors development for radiation environment: neutron tests and simulations\n", "abstract": " One of the requests from the ongoing ITER-Like Wall Project is to have diagnostics for Soft X-Ray (SXR) monitoring in tokamak. Such diagnostics should be focused on tungsten emission measurements, as an increased attention is currently paid to tungsten due to a fact that it became a main candidate for the plasma facing material in ITER and future fusion reactor. In addition, such diagnostics should be able to withstand harsh radiation environment at tokamak during its operation. The presented work is related to the development of such diagnostics based on Gas Electron Multiplier (GEM) technology. More specifically, an influence of neutron radiation on performance of the GEM detectors is studied both experimentally and through computer simulations. The neutron induced radioactivity (after neutron source exposure) was found to be not pronounced comparing to an impact of other secondary neutron reaction …", "num_citations": "2\n", "authors": ["878"]}
{"title": "Object oriented hardware-software test bench for OMTF diagnosis\n", "abstract": " In this paper the object oriented hardware-software model and its sample implementation of diagnostics for the Overlap Muon Track Finder trigger for the CMS experiment in CERN is described. It presents realization of test-bench for control and diagnosis class of multichannel, distributed measurement systems based on FPGA chips. The test-bench fulfills requirements for system’s rapid changes, configurability and efficiency. This ability is very significant and desirable by expanded electronic systems. The solution described is a software model based on a method of address space management called the Component Internal Interface (CII). Establishment of stable link between hardware and software, as a purpose of designed and realized programming environment, is presented. The test-bench implementation and example of OMTF algorithm test is presented.", "num_citations": "2\n", "authors": ["878"]}
{"title": "Improvement of FPGA control via high speed but high latency interfaces\n", "abstract": " In last years, the throughput of interfaces used in computer systems to control extension boards or external hardware has increased significantly. Unfortunately, those interfaces have also significant round-trip latency. This fact seriously impairs the efficiency of those control algorithms, which require a tight handshake. In such algorithms, the communication consists of a sequence of write and read operations, where read result (the handshake status) must be checked before the next write command is issued. This problem can be solved by the implementation of an intelligent controller in the controlled hardware. This controller should execute high-level commands locally performing all necessary handshake operations. Unfortunately, such a complex and highly specialized controller would consume a significant amount of FPGA resources. This paper presents an alternative approach which uses a highly simplified …", "num_citations": "2\n", "authors": ["878"]}
{"title": "Head of the bed elevation angle recorder for intensive care unit\n", "abstract": " This paper presents a recording system optimized for long term measurement of bed headrest elevation angle in the Intensive Care Unit. The continuous monitoring of this parameter allows to find the correlation between the patient’s position in bed and the risk of the Ventilator Associated Pneumonia (VAP), a very serious problem in therapy of critically ill patients. Recorder might be be an important tool to evaluate the “care bundles” – sets of preventive procedures recommended for treatment of patients in the ICU.", "num_citations": "2\n", "authors": ["878"]}
{"title": "The CMS RPC system overview\n", "abstract": " The Muon System of the CMS experiment at CERN employees three different detector technologies—Drift Tube Chambers (DT) in the barrel part, Cathode Strip Chambers (CSC) in the endcaps and Resistive Plate Chambers (RPC) both in the barrel and the endcaps. TDs and CSCs serve as precise muon trajectory measurement devices. The RPCs are responsible for the bunch crossing identification and for a fast muon transverse momentum measurement. The total number of RPCs is 480 in the barrel and 756 in the endcaps, covering an area of about 3500 square meters. A brief overview of the system will be presented as well as some recent results about the system stability and performance.", "num_citations": "2\n", "authors": ["878"]}
{"title": "Implementation of elliptic curve cryptography for 8-bit and 32-bit embedded systems-time efficiency and power consumption analysis\n", "abstract": " Results of research that compares possibilities of securing transmission from biomedical embedded telemetry devices with elliptic curve cryptography algorithms performed on 8-bit and 32-bit microcontrollers is presented in the paper. The review of possible ways of implementing cryptographic protocols based on elliptic curves in embedded systems with usage of commercial MIRACL library and open-source GMP arithmetic library was performed. We have used MIRACL library to compare time efficiency and energy costs of elliptic curve point multiplication on selected AVR and ARM embedded platforms. Additionally we have implemented basic ECC library based on open-source GMP library for ARM microcontrollers to check efficiency of algorithms based on different number representations. Results obtained during the work showed that despite of the fact that selected ARM microcontroller active supply current is higher than selected AVR device active supply current, total energy cost associated with elliptic point curve multiplication is much smaller in case of ARM microcontrollers.", "num_citations": "2\n", "authors": ["878"]}
{"title": "CMS Expression of Interest in the SLHC\n", "abstract": " Il report seguente simula gli indicatori relativi alla produzione scientifica in relazione alle soglie ASN 2018-2020 del proprio SC/SSD. Si ricorda che il superamento dei valori soglia (almeno 2 su 3) è requisito necessario ma non sufficiente al conseguimento dell'abilitazione.La simulazione si basa sui dati IRIS e presenta gli indicatori calcolati alla data indicata sul report. Si ricorda che in sede di domanda ASN presso il MIUR gli indicatori saranno invece calcolati a partire dal 1 gennaio rispettivamente del quinto/decimo/quindicesimo anno precedente la scadenza del quadrimestre di presentazione della domanda (art 2 del DM 598/2018).", "num_citations": "2\n", "authors": ["878"]}
{"title": "Diagnostic system of the RPC muon trigger of the CMS detector-design and test beam results\n", "abstract": " The RPC muon trigger electronics of the CMS detector performs a number of tasks: synchronization of detector signals, optical data transmission from the detector to the trigger electronics, pattern recognition, muon momentum measurement, selection of track candidates. For the diagnostic purposes, as well as for the calibration and real-time monitoring of the RPC detectors and electronic hardware, a set of flexible diagnostic modules was designed and implemented into the FPGAs on which the trigger electronics is based. These include: multi-channel counters, timing histograms, test pulses, and data spying (\"snapshots\" of the data stream). Tests results presented in this paper, including test with LHC-like muon beam, illustrate the performance and usefulness of these diagnostic modules.", "num_citations": "2\n", "authors": ["878"]}
{"title": "Radiation tests of RPC trigger electronic components\n", "abstract": " The part of RPC trigger electronic system-Link Boards (LBs) and Control Boards (CBs)-will be placed in the CMS cavern, mostly on the detector surface and some inside endcaps, between muon station ME1/1 and hadron calorimeter HE/1. These boards will be in the radiation field, composed mainly of thermal neutrons and high-energy hadrons (E= 10–100 MeV). The most important electronic devices used on these boards are FPGAs chips and memories that store the FPGAs configuration data. The goal of radiation tests was to predict the behaviour of this electronics in radiation environment, choose between different types of devices (SDRAM vs. FLASH memories, Xilinx vs. Altera FPGAs), and to find the methods of errors mitigation.", "num_citations": "2\n", "authors": ["878"]}
{"title": "Multichannel boundary scan controller\n", "abstract": " The paper presents, a specially designed chip, which ensures the carrying out of tests compliant with IEEE 1149.1-1990 Std. The above mentioned tests are very useful when checking for any errors and defects in electronics devices. The currently available solutions are not suitable for the requirements, which are quite specific and are the results of past experience. Therefore, a dedicated Field Programmable Gate Array (FPGA) core was created in VLSI Hardware Description Language (VHDL) implementing the desired functionality. The achieved result is a BS controller supporting many BS chains, working in parallel and using pipelining to boost performance.", "num_citations": "2\n", "authors": ["878"]}
{"title": "Diagnostyka i monitorowanie Trygera Mionowego RPC w eksperymencie CMS\n", "abstract": " PL W pracy opisano koncepcję diagnostyki i kalibracji systemu Trygera Mionowego RPC opartą na ciągłym monitoringu pracy poszczególnych bloków toru elektronicznego i dedykowanych testach. Zaprezentowano zasadę działania standaryzowanych elementów diagnostycznych zrealizowanych w sposób algorytmiczny i sparametryzowany w języku VHDL. Przedstawiono wyniki implementacji w układach programowalnych ALTERA.", "num_citations": "2\n", "authors": ["878"]}
{"title": "Dynamics of blood flow velocity in middle cerebral arteries in dyslexic persons\n", "abstract": " The aim of our study was to investigate the blood flow in middle cerebral arteries during the different forms of cognitive activity in dyslectic persons. Two group of subjects were tested. The first group consisted of 10 students with school difficulties, diagnosed neuropsychologically as having a particular form of dyslexia, ie dysgraphy or dysorthography. 6 of them were right lateralized and 4--left lateralized. The second contained 10 students without such problems. 7 of them were right lateralized and 3--left lateralized. We used four kinds of cognitive tasks, during which the blood flow velocity in MCA in left and right hemisphere was measured with the Transcranial Doppler method. The analysis of the results showed differences between the groups of blood flow velocity levels, without a difference in performance profile. The dysgraphic persons had significantly higher blood flow velocity in the right hemisphere compared to the reference group. The results suggest particularly important role of right hemisphere in dyslexic persons, which is consistent with results obtained by other authors. The analysis of lateralization showed that this factor influences significantly the blood flow velocity level--the left lateralized persons showed lower rise of blood flow velocity than the right lateralized, regardless of the kind of task and measured hemisphere.", "num_citations": "2\n", "authors": ["878"]}
{"title": "DPB/CRI firmware development\n", "abstract": " DPB/CRI firmware development Page 150 DPB/CRI firmware development W. Zabolotny, A. Byszuk, M. Guminski, G. Kasprowicz, M. Kruszewski, K. Pozniak, and R. Romaniuk Warsaw University of Technology, Institute of Electronic Systems, Warszawa, Poland Support for the GBT-based readout The GBT-based readout requires support for CROB boards capable to connect multiple FEBs, with different configurations of SMX2 chips. The structure of the DPB firmware was reorganized as shown in Fig. 1. The main G BT -F PG A GBT LINK 3 GBT LINK 2 GBT LINK 1 SMX2 command transmitters CTx0 SX0 SX7 [...] [...] 0 4 [...] 0 4 [...] CTx5 SX0 SX7 [...] 0 4 [...] 0 4 [...] SMX2 receivers Rx0 [...] Rx41 switch switch [...] Sorter system ACK, NACK, Responses switch matrix (240x42x24b) T o FL IM m od u le System Interface (IPbus) D a ta ag re ga to rs sorter sorter sorter [...] S tre am m e rg er Figure 1: Block diagram of the CROB-…", "num_citations": "2\n", "authors": ["878"]}
{"title": "GBTX emulator for development and special versions of GBT-based readout chains\n", "abstract": " The GBTX ASIC is a standard solution for providing fast control and data readout for radiation detectors used in HEP experiments. However, it is subject to export control restrictions due to the usage of radiation-hard technology. An FPGA-based GBTX emulator (GBTxEMU) has been developed to enable the development of GBT-based readout chains in countries where the original GBTX cannot be imported. Thanks to utilizing a slightly modified GBT-FGPA core, it maintains basic compatibility with standard GBT-based systems. The GBTxEMU also may be an interesting solution for developing GBT-based readout chains for less demanding experiments.", "num_citations": "1\n", "authors": ["878"]}
{"title": "Fast Data-Driven Readout System for the Wide Aperture Silicon Tracking System of the BM@ N Experiment\n", "abstract": " Abstract                 The major upgrade of the BM@N experiment for the heavy ion program is a new hybrid tracking system. It consists of seven planes of GEM detectors and four silicon tracking stations based on the modules with double-sided microstrip silicon sensors of CBM type. The BM@N silicon tracking system (STS) will conceptually inherit the data acquisition system (DAQ) from the CBM silicon tracker currently in development for FAIR. This is an entirely data driven acquisition system relying on purely self-triggering readout channels, which will also be adopted for the operation with BM@N trigger. The core components of the readout chain are front-end boards (FEB), GBTxEmu board and GBTxEmu readout interface (GERI) board. The front-end board is an integrated part of the STS module. The main components of FEB are eight STS-XYTER ASICs which are needed for the readout of one side of …", "num_citations": "1\n", "authors": ["878"]}
{"title": "Safe and Reusable Approach for Pin to Port Assignment in Multi-Board FPGA Data Acquisition and Control Designs\n", "abstract": " This paper introduces a robust approach for pin to port assignment in multi-board field-programmable gate array designs. The problem has been known for a long time and is especially annoying in relatively large data acquisition systems, such as data acquisition and control systems for high energy physics experiments, where hundreds of differential signals are routed via multiple boards. However, there is still no generic user-friendly open-source solution. The proposed approach has two main goals, safety (check as many potential human mistakes as possible) and reusability (reuse connections mappings, defined in files, in multiple designs). The proposed file format description is concise and comprehensible. It is fully declarative, vendor agnostic, part agnostic and programming language-agnostic from the users perspective. The paper also presents the realization of the idea implemented in the Python …", "num_citations": "1\n", "authors": ["878"]}
{"title": "MESH concept for mobile distribution point architecture of ICT infrastructure\n", "abstract": " In situations of failure of communication systems or lack of access to telecommunications infrastructure, it is necessary to use alternative solutions. One way is to use vehicles equipped with a variety of data transmission methods. An example of such a vehicle is the Mobile Distribution Point of ICT Infrastructure (MPDIT) which integrates modern and sophisticated ICT solutions. The vehicle is equipped with many different transmitting and receiving devices, however, the range of which is limited. One of the methods of increasing the range and reliability of communication links is the use of MESH networks. MESH nodes are carried by people, they create a dynamic structure, the functioning of which is possible even if some nodes stop working. The paper also presents a way to solve the problem of simultaneously ensuring high network throughput and large ranges by integrating two types of MESH networks.", "num_citations": "1\n", "authors": ["878"]}
{"title": "GEM detector charge signals sequencer implementation for WEST experiment\n", "abstract": " This paper focuses on implementation of the charge signal sequencer in FPGA chip dedicated for GEM detector. First is described structure of GEM detector for WEST experiment developed by IPPLM and Warsaw University of Technology. Then the article explains why signal sequencer is needed in the new system and shortly presents how it works. It collects data from all detector channels and sends it out in unambiguous order to PC. It plays a big role in a data pipeline. Proper order of data improves parameters of the system, decreases the latency and simplifies computations on PC side. The article explains technical aspects of the implementation like architecture, blocks, dataflow or configuration features. In the end, there are presented results of the implementation.", "num_citations": "1\n", "authors": ["878"]}
{"title": "Video signals integrator: configuration database\n", "abstract": " The article presents selected results of research conducted by the consortium under the implemented project for national defense and security on “Video Signals Integrator\" Acronym – VSI. Project Leader: Warsaw University of Technology. The consortium: Police Academy in Szczytno, Atende Software Ltd., VORTEX Ltd. No. DOB-Bio7/01/02/2015 funded by the National Centre for Research and Development. The essence of the Video Signals Integrator is to acquire and process signals from multiple sources: existing monitoring systems based on analog cameras, modern systems based on IP cameras, different types of individual cameras. The efficient functioning of the device depends on the properly prepared Configuration Database of the Central Video Integrator System. The configuration database contains information necessary to operate the system by users, both in the scope of authorizations (data of users …", "num_citations": "1\n", "authors": ["878"]}
{"title": "Design and development of soft x-ray diagnostics based on GEM detectors at IPPLM\n", "abstract": " The search for new technologies in the field of plasma diagnostics entails the increasing demands on the radiative stability of the used materials due to development and usage of fusion facilities, where the study of processes occurring during the interaction of radiation with matter has become particularly important. Currently, a new X-ray imaging detection technology is required for tokamaks such as ITER. X-ray detectors that are being used in existing equipment may rapidly degrade due to large neutron fluxes characteristic for the tokamak environment. Despite the relatively wide use of semiconductor detectors to record SXR radiation (generally ionizing radiation), gas detectors are promising candidates that are suited much better for use in future fusion reactors given their resistance to neutron radiation. The most promising representative of the new gas detector class is the so called Gas Electron Multiplier (GEM …", "num_citations": "1\n", "authors": ["878"]}
{"title": "Implementation of OMTF trigger algorithm with high-level synthesis\n", "abstract": " The paper presents the implementation of the Overlap Muon Track Finder algorithm using the High-Level Synthesis (HLS). That algorithm has been previously implemented in a highly optimized VHDL code. Therefore, comparison of the implementations based on VHDL code, and on HLS provides an assessment of the suitability of HLS for implementation of complex algorithms. Additionally, analysis of the correlation between the HLS code and parameters of the produced solution gives suggestions regarding the correct implementation of typical data-processing algorithms in HLS.", "num_citations": "1\n", "authors": ["878"]}
{"title": "Charge cluster identification for multidimensional GEM detector structures\n", "abstract": " The measurement system based on GEM - Gas Electron Multiplier detector - is developed for soft X-ray diagnostics of tokamak plasmas. The multi-channel setup is designed for estimation of the energy and the position distribution of an Xray source. The focal measuring issue is the charge cluster identification by its value and position estimation. The fast and accurate mode of the serial data acquisition is applied for the dynamic plasma diagnostics. The charge clusters are counted in the space determined by 2D position, charge value and time intervals. Radiation source characteristics are presented by histograms for a selected range of position, time intervals and cluster charge values corresponding to the energy spectra.", "num_citations": "1\n", "authors": ["878"]}
{"title": "The methodology of development of real-time and high-throughput heterogeneous devices for plasma confinement fusion diagnostics\n", "abstract": " This paper discusses the model and the development methodology that was proposed in the implementation process of the heterogeneous system for the WEST thermal fusion reactor. The objective was to provide a systematic approach to provide a heterogeneous device to handle high-throughput workloads with low-latency for the WEST Soft X-Ray impurities diagnostic. The presented mechanism is dedicated to augment the system applicability to a wider area of instrumentation for high-scale physics experiments.", "num_citations": "1\n", "authors": ["878"]}
{"title": "Implementation of heapsort in programmable logic with high-level synthesis\n", "abstract": " The paper presents the implementation of the streaming heapsort algorithm using the High-Level Synthesis (HLS). Results of synthesis in different configurations are compared with the reference implementation based on heavily optimized HDL code. Obtained results are used for evaluation of High-Level Synthesis as a method of implementation of data processing algorithms.", "num_citations": "1\n", "authors": ["878"]}
{"title": "Sorting of STS-XYTER2 data for microslice building for CBM experiment\n", "abstract": " Sorting of STS-XYTER2 data for microslice building for CBM experiment - NASA/ADS Now on home page ads icon ads Enable full ADS view NASA/ADS Sorting of STS-XYTER2 data for microslice building for CBM experiment Gumiński, M. ; Zabołotny, WM ; Byszuk, AP ; Poźniak, K. Abstract Publication: Topical Workshop on Electronics for Particle Physics. 17-21 September 2018. Antwerp Pub Date: September 2018 Bibcode: 2018twep.confE.143G full text sources Publisher | © The SAO/NASA Astrophysics Data System adshelp[at]cfa.harvard.edu The ADS is operated by the Smithsonian Astrophysical Observatory under NASA Cooperative Agreement NNX16AC86A NASA logo Smithsonian logo Resources About ADS ADS Help What's New Careers@ADS Social @adsabs ADS Blog Project Switch to full ADS Is ADS down? (or is it just me...) Smithsonian Institution Smithsonian Privacy Notice Smithsonian Terms of …", "num_citations": "1\n", "authors": ["878"]}
{"title": "Implementation of multistandard video signals integrator\n", "abstract": " The paper describes the prototype implemetantion of the Video Signals Integrator (VSI). The function of the system is to integrate video signals from many sources. The VSI is a complex hybrid system consisting of hardware, firmware and software components. Its creation requires joint effort of experts from different areas. The VSI capture device is a portable hardware device responsible for capturing of video signals from different different sources and in various formats, and for transmitting them to the server. The NVR server aggregates video and control streams coming from different sources and multiplexes them into logical channels with each channel representing a single source. From there each channel can be distributed further to the end clients (consoles) for live display via a number of RTSP servers. The end client can, at the same time, inject control messages into a given channel to control movement of a …", "num_citations": "1\n", "authors": ["878"]}
{"title": "Szybki, niskolatencyjny system szeregowania danych pomiarowych implementowany w układzie FPGA\n", "abstract": " W artykule przedstawiono opracowane przez Zespół Autorów systemy szeregowania danych przychodzących z wielu źródeł w czasie rzeczywistym. Na wstępie krótko omówiono zasadę działania detektorów GEM wykorzystywanych do rejestracji promieniowania w tokamakach. Przedstawiono ogólnie budowę systemu do realizacji diagnostyki gorącej plazmy, działającego z dużą liczbą kanałów wejściowych. Szczegółowo omówiono system szeregowania danych. Przedstawiono wymagania algorytmu, opracowane koncepcje, napotkane problemy oraz implementacje algorytmów w układach FPGA. Dodatkowo przedstawiono przykładowe wyniki z działania systemu.", "num_citations": "1\n", "authors": ["878"]}
{"title": "System zabezpieczeń elektronicznego systemu pomiarowego do diagnostyki gorącej plazmy tokamakowej\n", "abstract": " PL W artykule przedstawiono opracowany przez Zespół Autorów system zabezpieczeń i diagnostyki dla detektora gazowego GEM. Na wstępie krótko omówiono zagrożenia na jakie narażony jest detektor GEM oraz elektroniczne systemy pomiarowe pracujące w bliskiej odległości od reaktora termojądrowego. Przedstawiono koncepcje modułu do ciągłego monitorowania stanu systemu do diagnostyki gorącej plazm. Pod względem bezpieczeństwa omówiono dwa kluczowe podsystemy: moduł zabezpieczeń i system chłodzenia cieczą. Opisano funkcjonalność systemu, przyjęte rozwiązania sprzętowe oraz implementacją oprogramowania. Na końcu przedstawiono praktyczne wykorzystanie systemu.", "num_citations": "1\n", "authors": ["878"]}
{"title": "Versatile method to increase speed of external control with scatter-gather method in peripheral device\n", "abstract": " The paper describes an innovative module which autonomously executes frequently used sequences of commands, stored in the peripheral device RAM, and absorbs data from internal slave modules. Due to autonomous operation, significant increase of execution speed of typical control algorithms may be achieved. Depending on the particular algorithm performed, the appropriate operation mode may be selected, eg. the transparent mode for specific algorithms lacking sequences of repeated operations.", "num_citations": "1\n", "authors": ["878"]}
{"title": "Python based integration of GEM detector electronics with JET data acquisition system\n", "abstract": " This paper presents the system integrating the dedicated measurement and control electronic systems for Gas Electron Multiplier (GEM) detectors with the Control and Data Acquisition system (CODAS) in the JET facility in Culham, England. The presented system performs the high level procedures necessary to calibrate the GEM detector and to protect it against possible malfunctions or dangerous changes in operating conditions. The system also allows control of the GEM detectors from CODAS, setting of their parameters, checking their state, starting the plasma measurement and to reading the results. The system has been implemented using the Python language, using the advanced libraries for implementation of network communication protocols, for object based hardware management and for data processing.", "num_citations": "1\n", "authors": ["878"]}
{"title": "Determination of tungsten and molybdenum concentrations from an X-ray range spectrum in JET\n", "abstract": " Spectrometer setup The present X-ray spectrometer is built in Johann mounting with a Rowland circle radius of 12.5 m and a new Gas Electron Multiplier (GEM) detectors [2–6]. The measurable spectral band for the W channel is 0.0043 nm with 256 strips of the detector at a wavelength of 0.52 nm, or a photon energy of∼ 2. 4 keV, and an inverse linear dispersion of 2. 1× 10− 5 nm/mm. The sensitivity is calculated as a product of photon-throughputs at each component of the spectrometer: X-ray reflectivity of the crystal, transmittance of a 150 µm Be window at the torus, a 9 cm He gas buffer in front of the detector, a 12 µm Mylar window at the detector, resulting in 5. 4× 10− 11 [counts ph− 1m2sr] for the first order diffraction spectrum and 7. 2× 10− 12 [counts ph− 1m2sr] for the second one [4]. The diagnostic line-of-sight is on the mid-plane of JET, 0.2 m below the magnetic axis of typical diverted plasmas.", "num_citations": "1\n", "authors": ["878"]}
{"title": "Tethered Forth system for FPGA applications\n", "abstract": " This paper presents the tethered Forth system dedicated for testing and debugging of FPGA based electronic systems. Use of the Forth language allows to interactively develop and run complex testing or debugging routines. The solution is based on a small, 16-bit soft core CPU, used to implement the Forth Virtual Machine. Thanks to the use of the tethered Forth model it is possible to minimize usage of the internal RAM memory in the FPGA. The function of the intelligent terminal, which is an essential part of the tethered Forth system, may be fulfilled by the standard PC computer or by the smartphone. System is implemented in Python (the software for intelligent terminal), and in VHDL (the IP core for FPGA), so it can be easily ported to different hardware platforms. The connection between the terminal and FPGA may be established and disconnected many times without disturbing the state of the FPGA based system …", "num_citations": "1\n", "authors": ["878"]}
{"title": "Efficient transmission of measurement data from FPGA to embedded system via Ethernet link\n", "abstract": " This paper presents a system consisting of the FPGA IP core, the simple network protocol and the Linux device driver, capable of efficient and reliable data transmission from a low resources FPGA chip to the Linux-based embedded computer system, via a private Ethernet network (consisting of a single segment or a few segments connected via an Ethernet switch). The embedded system may optionally process the acquired data, and distribute them further, using standard network protocols. Proposed design targets cost-efficient multichannel data acquisition systems, in which multiple FPGA based front end boards (FEB) should transmit the stream of acquired data to the computer network, responsible for their final processing and archiving. The presented solution allows to minimize the cost of data concentration due to use of inexpensive Ethernet network infrastructure. The work is mainly focused on minimization of resources consumption in the FPGA, and minimization of acknowledge latency in the Linux based system - which allows to achieve high throughput in spite of use of inexpensive FPGA chips with small internal memory.", "num_citations": "1\n", "authors": ["878"]}
{"title": "Elektroniczny system trygera mionowego RPC w eksperymencie CMS dla akceleratora LHC\n", "abstract": " W artykule przedstawiono implementację rozproszonego, wielokanałowego elektronicznego systemu pomiarowego dla Trygera Mionowego RPC w ostatnio uruchomionym eksperymencie CMS przy akceleratorze LHC w CERN. Na wstępie krótko omówiono program badawczy LHC oraz scharakteryzowano detektor CMS pod kątem wymagań metrologicznych zapewnienia dobrej rozdzielczości przestrzennej i czasowej oraz pomiarów wielu parametrów fizycznych na podstawie zarejestrowanych zderzeń cząstek. Opisano system Trygera Mionowego RPC, który jest wyposażony w ponad 200 000 niezależnych kanałów do pomiaru pozycyjnego. W części pierwszej artykułu przedstawiono strukturę funkcjonalną systemu w kontekście wymogów nakładanych przez eksperyment CMS, takich jak: globalny system trygerowania eksperymentu, akwizycja danych. W części drugiej zamieszczono opis rozwiązań aparaturowych poszczególnych części systemu pomiarowego detektora RPC oraz przykłady uzyskanych wyników testowych.", "num_citations": "1\n", "authors": ["878"]}
{"title": "Low cost open data acquisition system for biomedical applications\n", "abstract": " In the biomedical applications it is often necessary to collect measurement data from different devices. It is relatively easy, if the devices are equipped with a MIB or Ethernet interface, however often they feature only the asynchronous serial link, and sometimes the measured values are available only as the analog signals.  The system presented in the paper is a low cost alternative to commercially available data acquisition systems. The hardware and software architecture of the system is fully open, so it is possible to customize it for particular needs. The presented system offers various possibilities to connect it to the computer based data processing unit - e.g. using the USB or Ethernet ports. Both interfaces allow also to use many such systems in parallel to increase amount of serial and analog inputs. The open source software used in the system makes possible to process the acquired data with standard tools like …", "num_citations": "1\n", "authors": ["878"]}
{"title": "Transcranial Doppler (TCD) ultrasonography in patients with ventriculomegaly: investigation of additional parameters for qualifying shunt implantation\n", "abstract": " Poszerzenie układu komorowego bez cech wzmożonego ciśnienia śródczaszkowego może być związane z zabu rzeniem fizjologicznej równowagi pomiędzy produkcją a wchłanianiem płynu mózgowo-rdzeniowego, jak to się dzieje w wodogłowiu normotensyjnym, może jednak także wynikać z procesu zanikowego mózgu, z czym mamy do czynienia np. w idiopatycznym zaniku, w chorobie Alzheimera, we wszelkich naczyniopochodnych uszkodze niach mózgu czy też wynikać może z fizjologicznego pro cesu starzenia się. Bez względu na przyczynę prowadzącą do poszerzenia układu komorowego, wśród objawów kli nicznych najczęściej można zaobserwować zaburzenia ruchowe, niejednokrotnie bardzo utrudniające pacjentowi samodzielne poruszanie się oraz postępującą deteriorację umysłową, mogącą prowadzić do zakłóceń w kontaktach z otoczeniem. Ze względu na duże podobieństwo obja wów, rozróżnienie obu procesów chorobowych sprawia niekiedy duże trudności. A właściwa diagnoza w sposób niezwykle istotny wpływa na dalsze postępowanie diag nostyczne i lecznicze. Leczeniem z wyboru w objawo wym wodogłowiu normotensyjnym jest umożliwienie odpływu płynu mózgowo-rdzeniowego z komór mózgo wych przy pomocy zastawkowych układów drenujących. Jeżeli jednak poszerzenie układu komorowego jest wtórne i wynika z zaniku mózgu, jakiekolwiek leczenie operacyj ne będzie nieskuteczne. Co więcej, wykluczenie procesu zanikowego nie rozwiązuje do końca problemu. Do chwili obecnej nie ma jednoznacznych kryteriów wskazujących na konieczność założenia zastawki i pozostają one nadal przedmiotem …", "num_citations": "1\n", "authors": ["878"]}
{"title": "Application of neural networks in estimation of maximum frequency in transcranial doppler signal\n", "abstract": " The paper presents a new approach to the estimation of a maximum frequency in the Transcranial Doppler signal. The neural network is trained to calculate the maximum frequency from other, easier to calculate parameters of the signal. The new algorithm is compared to two\" traditional\" algorithms of maximum frequency estimation showing smaller mean-square estimation error, and better correlation between real and estimated maximum frequency even for poor SNR.", "num_citations": "1\n", "authors": ["878"]}
{"title": "Dynamics of Hydrocephalus Development After Spontaneous Subarachnoid Hemorrhage\n", "abstract": " In the early stage of the cerebrospinal compensatory disturbances seen after SAH, the ventricular system is not necessarily dilated [5]. ICP, however, is commonly increased immediately after SAH, but often recovers to a low or moderate level during vasospasm. A decrease in the blood flow velocity, which is considered to be a sign of recovery to the normal autoregulatory ability after vasospasm, is usually observed after the 3rd or 4th week [4, 5]. The further development of the high-(HPH) or normal-(NPH) pressure hydrocephalus has still an unknown nature.", "num_citations": "1\n", "authors": ["878"]}
{"title": "STS-HCTSP, an STS Hit & Control Transfer Synchronous Protocol\n", "abstract": " The data communication between STS detector readout chip (STSXYTERv2 [1]) and the Data Processing Board DPB [2] via the GBTx data combining ASIC [3] requires a robust and optimized protocol. The specific requirements and a preliminary protocol was published in [4]. During development of the STSXYTERv2 and DPB systems the protocol was further refined.The protocol specification includes a detailed description of: frames’ structure in both uplink & downlink directions, methodology for time-allocating hits and error correction, link synchronization procedures (enabling low-level reset, bit position alignment and optimal adjustment of data/clock delays) and specification of STSXYTERv2-specific registers.", "num_citations": "1\n", "authors": ["878"]}
{"title": "Preparation of the GBTX emulator\n", "abstract": " GBTx is a radiation tolerant ASIC used to control front end electronics (FEE) and to concentrate readout data. It uses multiple copper E-Links for FEE connection and 4.8 Gb/s optical link for uplink. Unfortunately, due to radiation-hard technology, GBTx is submitted to export restrictions and can’t be used in certain countries involved in the development of the CBM and similar experiments. The GBTxEMU should emulate the GBTx functionality in a commercially available FPGA.", "num_citations": "1\n", "authors": ["878"]}