{"title": "Machine learning methods for wind turbine condition monitoring: A review\n", "abstract": " This paper reviews the recent literature on machine learning (ML) models that have been used for condition monitoring in wind turbines (e.g. blade fault detection or generator temperature monitoring). We classify these models by typical ML steps, including data sources, feature selection and extraction, model selection (classification, regression), validation and decision-making. Our findings show that most models use SCADA or simulated data, with almost two-thirds of methods using classification and the rest relying on regression. Neural networks, support vector machines and decision trees are most commonly used. We conclude with a discussion of the main areas for future work in this domain.", "num_citations": "283\n", "authors": ["2273"]}
{"title": "A New Approach to Assessment of Confidence in Assurance Cases\n", "abstract": " An assurance case is a body of evidence organized into an argument demonstrating that some claims about a system hold. It is generally developed to support claims in areas such as safety, reliability, maintainability, human factors, security etc. Practically, both argument and evidence are imperfect, resulting in that we can hardly say the claim is one hundred percent true. So when we do decision-making against assurance cases, we need to know how much confidence we hold in the claims. And the quantitative confidence would provide benefits over the qualitative one. In this paper, an approach is proposed to assess the confidence in assurance cases (mainly arguments) quantitatively. First we convert Argument Metamodel based (ARM-based) cases into a set of Toulmin model instances; then we use Hitchcock’s evaluative criteria for solo-verb-reasoning to analyze and quantify the Toulmin model …", "num_citations": "28\n", "authors": ["2273"]}
{"title": "Assessing the Safety and Reliability of Autonomous Vehicles from Road Testing\n", "abstract": " There is an urgent societal need to assess whether autonomous vehicles (AVs) are safe enough. From published quantitative safety and reliability assessments of AVs, we know that, given the goal of predicting very low rates of accidents, road testing alone requires infeasible numbers of miles to be driven. However, previous analyses do not consider any knowledge prior to road testing - knowledge which could bring substantial advantages if the AV design allows strong expectations of safety before road testing. We present the advantages of a new variant of Conservative Bayesian Inference (CBI), which uses prior knowledge while avoiding optimistic biases. We then study the trend of disengagements (take-overs by human drivers) by applying Software Reliability Growth Models (SRGMs) to data from Waymo's public road testing over 51 months, in view of the practice of software updates during this testing. Our …", "num_citations": "24\n", "authors": ["2273"]}
{"title": "Assessing safety-critical systems from operational testing: A study on autonomous vehicles\n", "abstract": " ContextDemonstrating high reliability and safety for safety-critical systems (SCSs) remains a hard problem. Diverse evidence needs to be combined in a rigorous way: in particular, results of operational testing with other evidence from design and verification. Growing use of machine learning in SCSs, by precluding most established methods for gaining assurance, makes evidence from operational testing even more important for supporting safety and reliability claims.ObjectiveWe revisit the problem of using operational testing to demonstrate high reliability. We use Autonomous Vehicles (AVs) as a current example. AVs are making their debut on public roads: methods for assessing whether an AV is safe enough are urgently needed. We demonstrate how to answer 5 questions that would arise in assessing an AV type, starting with those proposed by a highly-cited study.MethodWe apply new theorems extending …", "num_citations": "11\n", "authors": ["2273"]}
{"title": "Coverage Guided Testing for Recurrent Neural Networks\n", "abstract": " Recurrent neural networks (RNNs) have been applied to a broad range of applications, including natural language processing, drug discovery, and video recognition. Their vulnerability to input perturbation is also known. Aligning with a view from software defect detection, this article aims to develop a coverage-guided testing approach to systematically exploit the internal behavior of RNNs, with the expectation that such testing can detect defects with high possibility. Technically, the long short-term memory network (LSTM), a major class of RNNs, is thoroughly studied. A family of three test metrics are designed to quantify not only the values but also the temporal relations (including both stepwise and bounded-length) exhibited when LSTM processing inputs. A genetic algorithm is applied to efficiently generate test cases. The test metrics and test case generation algorithm are implemented into a tool testRNN, which …", "num_citations": "9\n", "authors": ["2273"]}
{"title": "UAS Operators Safety and Reliability Survey: Emerging Technologies towards the Certification of Autonomous UAS\n", "abstract": " This paper details the results of a survey on safety and reliability of commercial Unmanned Aerial Systems (UAS), issued to 1500 companies in the UK, with a 10% response rate. The results of this study concur with previous studies that commercial UAS have a failure rate of 1/10 3  flight hours. Furthermore, we found a reported 49% of companies believe a critical failure will occur within every 500 hours of flight. We investigate the responses concerning UAS subsystems; the experience of onboard intelligent systems, current practices around the frequency of maintenance and servicing of subsystems, and subsystems identified in order of the highest likelihood of failure. Informed by the results of this survey and a state of the art literature review we identify emerging technologies and methods as candidate solutions to the respondents reported challenges, such as; Integrated Vehicle Health Management (IVHM …", "num_citations": "8\n", "authors": ["2273"]}
{"title": "Interval change-point detection for runtime probabilistic model checking\n", "abstract": " Recent probabilistic model checking techniques can verify reliability and performance properties of software systems affected by parametric uncertainty. This involves modelling the system behaviour using interval Markov chains, i.e., Markov models with transition probabilities or rates specified as intervals. These intervals can be updated continually using Bayesian estimators with imprecise priors, enabling the verification of the system properties of interest at runtime. However, Bayesian estimators are slow to react to sudden changes in the actual value of the estimated parameters, yielding inaccurate intervals and leading to poor verification results after such changes. To address this limitation, we introduce an efficient interval change-point detection method, and we integrate it with a state-of-the-art Bayesian estimator with imprecise priors. Our experimental results show that the resulting end-to-end Bayesian …", "num_citations": "7\n", "authors": ["2273"]}
{"title": "The Application of Machine Learning and Low Frequency Sonar for Subsea Power Cable Integrity Evaluation\n", "abstract": " Subsea power cables are essential assets for the electrical transmission and distribution networks. They are crucial in ensuring the security of electricity supply and supporting the global expansion in offshore renewable energy generation. After reviewing historical data on subsea cable failure modes, we established that existing monitoring systems do not account for over 70% of subsea cable failure modes. The current technologies focus on electrical failure modes and subsea cable asset management strategies are typically reactive or time based, with inspection limited to diver and/or ROV supported video footage which has several limitations, such as requiring good visibility, access to the cable, challenges in locating the cable and inability to identify failure modes at the interface of the seabed. To overcome these limitations, we propose an innovative sensor technology that can provide the in-situ integrity …", "num_citations": "7\n", "authors": ["2273"]}
{"title": "BayLIME: Bayesian Local Interpretable Model-Agnostic Explanations\n", "abstract": " Given the pressing need for assuring algorithmic transparency, Explainable AI (XAI) has emerged as one of the key areas of AI research. In this paper, we develop a novel Bayesian extension to the LIME framework, one of the most widely used approaches in XAI–which we call BayLIME. Compared to LIME, BayLIME exploits prior knowledge and Bayesian reasoning to improve both the consistency in repeated explanations of a single prediction and the robustness to kernel settings. BayLIME also exhibits better explanation fidelity than the state-of-the-art (LIME, SHAP and GradCAM) by its ability to integrate prior knowledge from, eg, a variety of other XAI techniques, as well as verification and validation (V&V) methods. We demonstrate the desirable properties of BayLIME through both theoretical analysis and extensive experiments.", "num_citations": "6\n", "authors": ["2273"]}
{"title": "The design of a fusion prognostic model and health management system for subsea power cables\n", "abstract": " Subsea power cables are critical infrastructure for the continuity of energy supply and are a key enabler to the global growth in offshore renewable energy generation. Capital projects for long range, greater than 60km distances, for transmission networks can cost in excess of £1billion. In this paper, we have extensively reviewed the data within academia and industry with respect to the practices and challenges of subsea power cable management. With a detailed focus on 15 years of historical cable failure data from the UKs largest owner of subsea power cables, we identified that existing commercial monitoring systems do not monitor about 70% of subsea power cable failure modes. To overcome the challenges this represents to delivering cost effective and timely intervention to subsea power cables, we present a fusion prognostic model to enable predictive forecast on cable failure modes, include location and …", "num_citations": "3\n", "authors": ["2273"]}
{"title": "On the probability of perfection of software-based systems\n", "abstract": " The probability of perfection becomes of interest as the realization of its role in the reliability assessment of software-based systems. It is not only important on its own, but also in the reliability assessment of 1-out-of-2 diverse systems. By “perfection”, it means that thesoftware will never fail in a specific operating environment. If we assume that failures of a software system can occur if and only if it contains faults, then it means that the system is “fault-free”. Such perfection is possible for sufficiently simple software. While the perfection can never be certain, so the interest lies in claims for the probability of perfection.  In this thesis, firstly two different probabilities of perfection – an objective parameter characterizing a population property and a subjective confidence in the perfection of the specific software of interest – are distinguished and discussed. Then a conservative Bayesian method is used to claim about probability of perfection from various types of evidence, i.e. failure-free testing evidence, process evidence and formal proof evidence. Also, a “quasiperfection” notion is realized as a potentially useful approach to cover some shortages of perfection models. A possible framework to incorporate the various models is discussed at the end. There are generally two themes in this thesis: tackling the failure dependence issue in the reliability assessment of 1-out-of-2 diverse systems at both aleatory and epistemic levels; and degrading the well-known difficulty of specifying complete Bayesian priors into reasoning with only partial priors. Both of them are solved at the price of conservatism.  In summary, this thesis provides 3 parallel sets of (quasi …", "num_citations": "3\n", "authors": ["2273"]}
{"title": "Embedding and Extraction of Knowledge in Tree Ensemble Classifiers\n", "abstract": " The embedding and extraction of useful knowledge is a recent trend in machine learning applications, e.g., to supplement existing datasets that are small. Whilst, as the increasing use of machine learning models in security-critical applications, the embedding and extraction of malicious knowledge are equivalent to the notorious backdoor attack and its defence, respectively. This paper studies the embedding and extraction of knowledge in tree ensemble classifiers, and focuses on knowledge expressible with a generic form of Boolean formulas, e.g., robustness properties and backdoor attacks. For the embedding, it is required to be preservative(the original performance of the classifier is preserved), verifiable(the knowledge can be attested), and stealthy(the embedding cannot be easily detected). To facilitate this, we propose two novel, and effective, embedding algorithms, one of which is for black-box settings and the other for white-box settings.The embedding can be done in PTIME. Beyond the embedding, we develop an algorithm to extract the embedded knowledge, by reducing the problem to be solvable with an SMT (satisfiability modulo theories) solver. While this novel algorithm can successfully extract knowledge, the reduction leads to an NP computation. Therefore, if applying embedding as backdoor attacks and extraction as defence, our results suggest a complexity gap (P vs. NP) between the attack and defence when working with tree ensemble classifiers. We apply our algorithms toa diverse set of datasets to validate our conclusion extensively.", "num_citations": "2\n", "authors": ["2273"]}
{"title": "Conservative Confidence Bounds in Safety, from Generalised Claims of Improvement & Statistical Evidence\n", "abstract": " “Proven-in-use”, “globally-at-least-equivalent”, “stress-tested”, are concepts that come up in diverse contexts in acceptance, certification or licensing of critical systems. Their common feature is that dependability claims for a system in a certain operational environment are supported, in part, by evidence – viz of successful operation – concerning different, though related, system[s] and/or environment[s], together with an auxiliary argument that the target system/environment offers the same, or improved, safety. We propose a formal probabilistic (Bayesian) organisation for these arguments. Through specific examples of evidence for the “improvement” argument above, we demonstrate scenarios in which formalising such arguments substantially increases confidence in the target system, and show why this is not always the case. Example scenarios concern vehicles and nuclear plants. Besides supporting stronger claims, the mathematical formalisation imposes precise statements of the bases for “improvement” claims: seemingly similar forms of prior beliefs are sometimes revealed to imply substantial differences in the claims they can support.", "num_citations": "1\n", "authors": ["2273"]}
{"title": "Proofs of Conservative Confidence Bounds on PFD, Using Claims of Improved Reliability\n", "abstract": " We derive infima for posterior confidence in bounds on system pfd, subject to various constraints – called “prior knowledge” – on joint prior distributions. This concerns confidence bounds on the pfd for a system B, upon observing two systems, A and B, operate without failure. In particular, the results hold when evidence supports a claim of B being as reliable, or better, than A. The propositions proved in this technical report are motivated, explained and discussed in the paper “Conservative Confidence Bounds in Safety, from Generalised Claims of Improvement & Statistical Evidence”, reported at the 51st IEEE/IFIP DSN conference", "num_citations": "1\n", "authors": ["2273"]}