{"title": "Modeling and analyzing wireless sensor networks with VeriSensor\n", "abstract": " A Wireless Sensor Network (WSN), made of distributed autonomous nodes, is designed to monitor physical or environmental conditions. WSNs have many application domains such as environment or health monitoring. Their de- sign must consider energy constraints, concurrency issues, node heterogeneity, while still meeting the quality requirements of life-critical applications. Formal verification helps to obtain WSN reliability, but usually requires a high expertise, which limits its adoption in industry. This paper presents VeriSensor, a domain specific modeling language (DSML) for WSNs offering support for formal verification. VeriSensor is designed to be used by WSN experts. It can be automatically translated into a formal specifica- tion for model checking. We present the language, its translation, show how they work on a simple case study, and illustrate how several metrics and properties relevant to the domain can be evaluated.", "num_citations": "19\n", "authors": ["1432"]}
{"title": "Modeling and Analyzing Wireless Sensor Networks with VeriSensor: An Integrated Workflow\n", "abstract": " A Wireless Sensor Network (WSN), made of distributed autonomous nodes, is designed to monitor physical or environmental conditions. WSNs have many application domains such as environment or health monitoring. Their design must consider energy constraints, concurrency issues, node heterogeneity, while still meeting the quality requirements of life-critical applications. Formal verification helps to obtain WSN reliability, but usually requires a high expertise, which limits its adoption in industry.             This paper presents VeriSensor, a domain specific modeling language (DSML) for WSNs offering support for formal verification. VeriSensor is designed to be used by WSN experts. It can be automatically translated into a formal specification for model checking. We present the language and its translation into a formal model (we use Instantiable Transition Systems – ITS).             A tool has been implemented …", "num_citations": "17\n", "authors": ["1432"]}
{"title": "Improving vehicle localization in a smart city with low cost sensor networks and support vector machines\n", "abstract": " A smart city’s main purpose is to provide intelligent responses to different problems of the rapid urban population growth. For instance, integrating fleet management solutions into intelligent transportation systems (ITS) can efficiently resolve transportation problems relying on each vehicle information. Usually, the position estimate is ensured by the integration of the Global Positioning System (GPS) and Inertial Navigation Systems (INS). For multisensor data fusion, the Extended Kalman Filter (EKF) is generally applied using the sensor’s measures and the GPS position as a helper. However, the INS are expensive and require more complex computing which induces restrictions on their implementation. Furthermore, the EKF performance depends on the vehicle dynamic variations and may quickly diverge because of environmental changes. In this paper, we present a robust low cost approach using EKF and …", "num_citations": "16\n", "authors": ["1432"]}
{"title": "Improving low cost sensor based vehicle positioning with Machine Learning\n", "abstract": " Current fleet management solutions rely on real time vehicle information to efficiently resolve transportation problems. In this study, a novel robust approach based on combining the Extended Kalman Filter (EKF) with Machine Learning techniques, Neural Networks or Support Vector Machines, is introduced to improve the accuracy of vehicle position estimation and circumvent the EKF limitations. The proposed solution guarantees also a low cost by using the Global Positioning System enhanced with Dead Reckoning integrated sensors. To verify our approach, extensive simulation tests are conducted on field data sets and very promising progress is obtained in the estimated vehicle position.", "num_citations": "12\n", "authors": ["1432"]}
{"title": "Energy efficient in-network aggregation algorithms in wireless sensor networks: a survey\n", "abstract": " Advancement in ubiquitous networking has led to the production of wireless sensor networks, consisting of many autonomous small devices called sensor nodes, able to observe and report various real world physical phenomena with no wired infrastructure. Onetheless, this feature precisely makes these nodes energy constrained, since most of the energy is consumed in data communication. In-network processing may be regarded as an efficient technique that reduces the amount of data to be transmitted in the network. We focus on data aggregation algorithms, whose fundamental idea is to gather, combine and compress data from different sources by applying simple functions in order to reduce the traffic load, thus enhancing the network’s lifetime. However, it is difficult for developers to identify data aggregation algorithms strengths and weaknesses, nor to pinpoint current open research issues to be …", "num_citations": "12\n", "authors": ["1432"]}
{"title": "A review of air quality modeling\n", "abstract": " Air quality models (AQMs) are useful for studying various types of air pollutions and provide the possibility to reveal the contributors of air pollutants. Existing AQMs have been used in many scenarios having a variety of goals, e.g., focusing on some study areas and specific spatial units. Previous AQM reviews typically cover one of the forming elements of AQMs. In this review, we identify the role and relevance of every component for building AQMs, including (1) the existing techniques for building AQMs, (2) how the availability of the various types of datasets affects the performance, and (3) common validation methods. We present recommendations for building an AQM depending on the goal and the available datasets, pointing out their limitations and potentials. Based on more than 40 works on air quality, we concluded that the main utilized methods in air pollution estimation are land-use regression (LUR …", "num_citations": "11\n", "authors": ["1432"]}
{"title": "MDE-based languages for wireless sensor networks modeling: A systematic mapping study\n", "abstract": " Wireless Sensor Networks (WSNs) are ubiquitous systems of small devices equipped with sensors that collaborate to sense physical quantities in an area. However, the design constraints, the behavior requirements and the error prone nature, make the development of WSNs and their deployment an extremely challenging task. The Model Driven Engineering (MDE) approach helps tackling these issues by using models and automatic transformation to generate code or analyze WSNs against their requirements. In this paper, we propose a systematic mapping study which presents the existing WSNs MDE-based modeling languages. We surveyed a total of 1852 papers from which we selected 21 languages satisfying 7 selection criteria. We analyze these languages according to 5 rigorous research questions and 12 comparative criteria. Then we provide a precise view on the existing languages and their …", "num_citations": "11\n", "authors": ["1432"]}
{"title": "A comparative performance analysis of position estimation algorithms for GNSS localization in urban areas\n", "abstract": " Global Navigation Satellite Systems (GNSS) have become an integral part of all applications where mobility plays an important role. However, The performances of GNSS-based positioning systems can be affected in constrained environments (urban and indoor environments), due to masking of satellites by buildings and multipath effects. In this paper, a comparative investigation on classical GNSS localization algorithms in urban areas is presented and analyzed in terms of mean squared error. As a result, Kalman filter estimation shows the best error performance in good environments (all satellites are in direct sight). Nevertheless, in constrained environments, the Kalman filter and least square method show important positioning errors because their measurement noise model is unsuitable.", "num_citations": "10\n", "authors": ["1432"]}
{"title": "A hybrid low cost approach using extended Kalman filter and neural networks for real time positioning\n", "abstract": " Global Positioning System (GPS) and Inertial Navigation Systems (INS) are usually used for real time vehicle positioning. Unfortunately, this high cost solution still suffers from GPS outages due to multipath errors. To perform data fusion, the Extended Kalman filter (EKF) has been widely adopted as an optimal estimation tool for non-linear systems. However, it has some drawbacks in terms of stability, immunity to noise effects and observability. Furthermore, the filter is unfluenced by the vehicle dynamic variations and environment changes. On the other hand, neural networks can map input data to output data without any prior knowledge of the relationship involved. This paper presents a hybrid EKF and neural networks approach to improve the real time vehicle positioning performance while using GPS with nothing else than an odometer and a gyrometer low cost aiding sensors. While GPS signals are available, the …", "num_citations": "10\n", "authors": ["1432"]}
{"title": "A robust low cost approach for real time car positioning in a smart city using Extended Kalman Filter and evolutionary machine learning\n", "abstract": " A smart city is emerging as an application of information and communication technologies to mitigate the problems generated by the urban population growth. One of the smart city solutions is to establish an efficient fleet management relating to the use of a fleet of vehicles (e.g., ambulances and police vehicles). The most basic function in a fleet management system is the real time vehicle tracking component. This component is usually the Differential Global Positioning System (DGPS) or the integration of Global Positioning System (GPS) and Inertial Navigation Systems (INS). To predict the position, the Extended Kalman Filter (EKF) is generally applied using the sensor's measures and the GPS position as a helper. However, the DGPS high cost solution still suffers from GPS satellite signals loss due to multipath errors and the INS require more complex computing. Furthermore, the EKF performance depends on …", "num_citations": "8\n", "authors": ["1432"]}
{"title": "An improved robust low cost approach for real time vehicle positioning in a smart city\n", "abstract": " The Global Positioning System (GPS) aided low cost Dead Reckoning (DR) system can provide without interruption the vehicle position for efficient fleet management solutions in smart cities. The Extended Kalman Filter (EKF) is generally applied for data fusion using the sensor’s measures and the GPS position as a helper.             However, the EKF depends on the vehicle dynamic variations and may quickly diverge during periods of GPS signal loss.             In this paper, we present a robust low cost approach using EKF and neural networks (NN) with Particle Swarm Optimization (PSO) to reliably estimate the real time vehicle position. While GPS signals are available, we train the NN with PSO on different dynamics and outage times to learn the position errors so we can correct the future EKF predictions during GPS signal outages. We obtain empirically an improvement of up to 94% over the simple EKF …", "num_citations": "7\n", "authors": ["1432"]}
{"title": "Neutron-gamma discrimination based on support vector machine combined to nonnegative matrix factorization and continuous wavelet transform\n", "abstract": " Recent developments of digital signal processing have played an effective role to achieve a fast and accurate neutron-gamma discrimination. Thus, we present in this research work, a novel method which combines supervised and unsupervised machine learning to perform the neutron-gamma discrimination task at the output of a stilbene organic scintillation detector. We propose a three steps procedure that highly qualifies the discrimination. First, the detector’s output signals are processed as mixtures of several unknown sources, through nonnegative matrix factorization algorithms. Second, the continuous wavelet transform is performed to characterize the recovered original sources. The resulting time-scale representation is considered as an image which is segmented in order to extract main features of neutron signals versus the gamma ones. The features are then used as input of a nonlinear support vector …", "num_citations": "6\n", "authors": ["1432"]}
{"title": "A hybrid machine learning based low cost approach for real time vehicle position estimation in a smart city\n", "abstract": " The Global Positioning System (GPS) enhanced with low cost Dead Reckoning (DR) sensors allows to estimate in real time a vehicle position with more accuracy while maintaining a low cost. The Extended Kalman Filter (EKF) is generally used to predict the position using the sensor’s measures and the GPS position as a helper. However, the filter performance tails off during periods of GPS failure and may quickly diverge (e.g., in tunnels or due to multipath phenomenon). In this paper, we propose a novel hybrid approach based on neural networks (NN) and autoregressive integrated moving average (ARIMA) models to circumvent the EKF limitations and improve the accuracy of vehicle position estimation. While GPS signals are available, we train NN and ARIMA models to learn the non-linear and linear structures in the vehicle position; therefore they can provide good predictions during GPS signal …", "num_citations": "6\n", "authors": ["1432"]}
{"title": "A SysML profile for wireless sensor networks modeling\n", "abstract": " Today, wireless sensor networks designers do not fully benefit from the power of widely recognized UML (and its profiles including SysML) when it comes to modeling all aspects of a wireless sensor network. The modeling process is usually restricted to the software and therefore only partially supports the wireless sensor network's design. Among the UML profiles family, there is a language that supports the modeling of many aspects of a system (including software and hardware) : SysML (Systems Modeling Language). In this paper, we propose a SysML profile for wireless sensor networks that will support the modelling of such networks. This profile provides support for structure, behavior, requirements and energy consumption information modeling. It will allow designers to model different aspects of a wireless sensor network.", "num_citations": "6\n", "authors": ["1432"]}
{"title": "MAC protocols for wireless body area networks: An overview\n", "abstract": " In this paper, we study the existing MAC protocols for Wireless Body Area Networks. We compare quantitatively and qualitatively these protocols based on a set of proposed requirements, to sort out the MAC protocols that support all the stringent requirements of WBAN. We analyze, discuss and suggest open issues in the field of MAC protocol design as a reference for future contributions and developments in WBAN MAC protocols.", "num_citations": "4\n", "authors": ["1432"]}
{"title": "IEEE 802.15. 6 CSMA/CA access method for WBANs: Performance evaluation and new backoff counter selection procedure\n", "abstract": " Wireless body area networks (WBANs) are supposed to be an effective proposition to revolutionize the present and the future of health care services. They provide a proactive diagnosis for many deadly diseases, as well as remote and real-time monitoring. On the other hand, they impose several challenges to the medium access control (MAC) protocols design, regarding the energy-efficiency, quality-of-service, priority, scalability, reliability, and security. The standardization of the IEEE 802.15. 6 provides new MAC specifications for WBANs, that take these issues into account. In the case of the narrowband frequency (402 to 405 MHz) dedicated to medical applications, the WBAN employs the carrier sense multiple access with collision avoidance (CSMA/CA) access method: the main contention-based access method of the IEEE 802.15. 6 MAC protocol that supports the unpredictable data traffic. This access method …", "num_citations": "3\n", "authors": ["1432"]}
{"title": "Neutron-gamma discrimination method based on blind source separation and machine learning\n", "abstract": " The discrimination of neutrons from gamma rays in a mixed radiation field is crucial in neutron detection tasks. Several approaches have been proposed to enhance the performance and accuracy of neutron-gamma discrimination. However, their performances are often associated with certain factors, such as experimental requirements and resulting mixed signals. The main purpose of this study is to achieve fast and accurate neutron-gamma discrimination without a priori information on the signal to be analyzed, as well as the experimental setup. Here, a novel method is proposed based on two concepts. The first method exploits the power of nonnegative tensor factorization (NTF) as a blind source separation method to extract the original components from the mixture signals recorded at the output of the stilbene scintillator detector. The second one is based on the principles of support vector machine (SVM …", "num_citations": "2\n", "authors": ["1432"]}
{"title": "Maximizing QoS in heterogeneous wireless sensor networks using game theory and learning algorithms\n", "abstract": " A Wireless Sensor Network (WSN) is composed of sensor equipped devices that aim at sensing and processing information from the surrounding environment. Energy consumption is the major concern of WSNs. At the same time, quality of service is to be considered especially when dealing with critical WSNs.               In this paper, we present a game theory based approach to maximize quality of service, defined as the aggregate frame success rate, while optimizing power allocation. Game theory is designed to study interactions between players (e.g. chess players) who decide on a set of actions (e.g. the players moves) to reach the objective outcomes (e.g. to win the game). Here, we model the system as a potential game. We show that the optimal power allocation, crucial in a heterogeneous sensor network, is a Nash equilibrium of this game, and we discuss its uniqueness. For simulations, we present a …", "num_citations": "1\n", "authors": ["1432"]}