{"title": "QoS Prediction in Cloud and Service Computing: Approaches and Applications\n", "abstract": " Cloud computing provides shared resources (eg, infrastructure, platform, and software) as services. Service-oriented architecture (SOA) is the technical foundation of cloud computing, whereby services offered by different cloud providers are discovered and integrated over the Internet. Quality-of-Service (QoS) is widely employed to represent the non-functional performance of services and has been considered as the key factor to differentiate the qualities of service candidates. It becomes important to evaluate the QoS performance of services. However, QoS evaluation is time-and resource-consuming. Conducting real-world evaluation is difficult in practice. Moreover, in some scenarios, QoS evaluation becomes impossible (eg, the cloud provider may charge for service invocations, too many services to be evaluated). Therefore, it is crucial to study how to build effective and efficient approaches to predict the QoS …", "num_citations": "12\n", "authors": ["431"]}
{"title": "Credible and online qos prediction for services in unreliable cloud environment\n", "abstract": " With the widespread adoption of cloud computing, Service-Orientated Architecture (SOA) facilitates the deployment of large-scale online applications in many key areas where quality and reliability are critical. In order to ensure the performance of cloud applications, Quality of Service (QoS) is widely used as a key metric to enable QoS-driven service selection, composition, adaption, etc. Since QoS data observed by users is sparse due to technical constraints, previous studies have proposed prediction approaches to solve this problem. However, the dynamic nature of the cloud environment requires timely prediction of time-varying QoS values. In addition, unreliable QoS data from untrustworthy users may significantly affect the prediction accuracy. In this paper, we propose a credible online QoS prediction approach to address these challenges. We evaluate user credibility through a reputation mechanism and …", "num_citations": "2\n", "authors": ["431"]}
{"title": "Efficient and privacy-preserving federated qos prediction for cloud services\n", "abstract": " With the widespread adoption of cloud computing, large-scale online applications composed of services have been deployed in many critical areas. In order to ensure the performance of cloud applications, Quality of Service (QoS) is a key indicator commonly used for service selection and adaptation. Previous studies have proposed collaborative QoS prediction approaches to estimate personalized QoS values. However, collaborative QoS prediction encounters privacy problems in practice. As a result, privacy threat has become a key challenge to make QoS prediction approaches practical. In this paper, we proposed a privacy-preserving QoS prediction approach employing federated learning techniques to tackle this grand challenge. We further improve the prediction efficiency by reducing system overhead and make the federated privacy-preserving QoS prediction approach feasible. The proposed approach is …", "num_citations": "2\n", "authors": ["431"]}
{"title": "Real-time automatic configuration tuning for smart manufacturing with federated deep learning\n", "abstract": " Manufacturing systems contain a large number of parameters, and a proper configuration of parameters is very important to ensure the stability of product quality. Traditional configuration methods rely heavily on manual tuning, which is labor-intensive, time-consuming, and poor performance. In this paper, we propose to build deep learning models on the vast amount of industrial data collected by IIoT devices for automatic configuration tuning. In order to address key challenges such as high data redundancy, limited device capacity, latency-sensitivity, and system heterogeneity, we propose a two-level federated deep learning framework. We first extract representative features from redundant data, and reduce network traffic and latency through joint training on plants and the cloud. Timely configuration tuning is made through local models of plants, and the tuning accuracy is improved through the global …", "num_citations": "1\n", "authors": ["431"]}