{"title": "Fuzzy finite automata and fuzzy regular expressions with membership values in lattice-ordered monoids\n", "abstract": " We study fuzzy finite automata in which all fuzzy sets are defined by membership functions whose codomain forms a lattice-ordered monoid L. For these L-fuzzy finite automata (L-FFA, for short), we provide necessary and sufficient conditions for the extendability of the state-transition function. It is shown that nondeterministic L-FFA (N L-FFA, for short) are more powerful than deterministic L-FFA (D L-FFA, for short). Then, we give necessary and sufficient conditions for the simulation of an N L-FFA by an equivalent D L-FFA. Next, we turn to the closure properties of languages defined by L-FFAs: we establish closure under the regular operations and provide conditions for closure under intersection and reversal, in particular we show that the family of fuzzy languages accepted by D L-FFAs is not closed under Kleene closure operation, and the family of fuzzy languages accepted by N L-FFAs is not closed under …", "num_citations": "292\n", "authors": ["1636"]}
{"title": "Fidelity and trace-norm distances for quantifying coherence\n", "abstract": " We investigate the coherence measures induced by fidelity and trace norm, based on the coherence quantification recently proposed by Baumgratz et al.[T. Baumgratz, M. Cramer, and MB Plenio, Phys. Rev. Lett. 113, 140401 (2014)]. We show that the fidelity of coherence does not in general satisfy the monotonicity requirement as a measure of coherence under the subselection of the measurement condition. We find that the trace norm of coherence can act as a measure of coherence for qubits and some special class of qutrits with some restrictions on the incoherent operators, while the general case needs to be explored further.", "num_citations": "239\n", "authors": ["1636"]}
{"title": "Quantum coherence and correlations in quantum system\n", "abstract": " Criteria of measure quantifying quantum coherence, a unique property of quantum system, are proposed recently. In this paper, we first give an uncertainty-like expression relating the coherence and the entropy of quantum system. This finding allows us to discuss the relations between the entanglement and the coherence. Further, we discuss in detail the relations among the coherence, the discord and the deficit in the bipartite quantum system. We show that, the one-way quantum deficit is equal to the sum between quantum discord and the relative entropy of coherence of measured subsystem.", "num_citations": "211\n", "authors": ["1636"]}
{"title": "Application of level soft sets in decision making based on interval-valued fuzzy soft sets\n", "abstract": " Molodtsov’s soft set theory was originally proposed as a general mathematical tool for dealing with uncertainty. Research on (fuzzy) soft set based decision making has received much attention in recent years. This paper aims to give deeper insights into decision making involving interval-valued fuzzy soft sets, a hybrid model combining soft sets with interval-valued fuzzy sets. The concept called reduct fuzzy soft sets of interval-valued fuzzy soft sets is introduced. Using reduct fuzzy soft sets and level soft sets, flexible schemes for decision making based on (weighted) interval-valued fuzzy soft sets are proposed, and some illustrative examples are employed to show that the proposals presented here are not only more reasonable but more efficient in practical applications.", "num_citations": "202\n", "authors": ["1636"]}
{"title": "Generalized uni–int decision making schemes based on choice value soft sets\n", "abstract": " This paper aims to improve and further extend Çağman and Enginoğlu’s uni–int decision making method. We first define choice value soft sets and k-satisfaction relations. Using these new notions, we give deeper insights into the principle of uni–int decision making and show its limitations. We then propose several new soft decision making schemes, including the uni–int k, uni–int s t and int m− int n decision making methods. We show that classical uni–int decision making is a special case of the uni–int s t decision making method. Furthermore, we present a new decision scheme based on int m− int n decision making, which substantially improves the classical uni–int decision making approach.", "num_citations": "143\n", "authors": ["1636"]}
{"title": "Soft subsets and soft product operations\n", "abstract": " Molodtsov’s soft set theory provides a general mathematical framework for dealing with uncertainty. It is known that soft subsets and soft equal relations are of vital importance in soft set theory. This paper aims to give a systematic study on several types of soft subsets and various soft equal relations induced by them. We give some equivalent characterizations of different soft subsets and endeavor to ascertain the interrelations among these notions, illustrated by a number of concrete examples. We also consider ontology-based soft sets and show that soft L-subsets generalize both soft M-subsets and ontology-based soft subsets.Moreover, by means of soft L-subsets and some related notions, we give a theoretical study concerning soft product operations such as ∧-products and ∨-products. We consummate some incomplete results concerning soft product operations existing in the literature, and investigate the …", "num_citations": "127\n", "authors": ["1636"]}
{"title": "Robust adaptive output feedback control to a class of non-triangular stochastic nonlinear systems\n", "abstract": " In this paper, the robust adaptive control design problem is studied for a class of non-triangular nonlinear systems with unmodeled dynamics and stochastic disturbances. It is assumed that the states of the systems to be controlled are unmeasurable, and thus an adaptive state observer is first developed. By utilizing the stochastic small-gain theorem and the backstepping recursive design procedure, a robust adaptive output feedback control scheme is then proposed. It is shown that all the signals in the resulting closed-loop system are bounded in probability, and the system output converges to a small residual set of the equilibrium in probability.", "num_citations": "112\n", "authors": ["1636"]}
{"title": "Quantifying coherence in infinite-dimensional systems\n", "abstract": " We investigate the quantification of coherence in the infinite-dimensional systems, and especially, we focus on the infinite-dimensional bosonic systems in the Fock space. We find that given the average energy constraints, the relative entropy of coherence serves as a well-defined quantification of coherence in the infinite-dimensional systems, however, the l 1 norm of coherence fails. Via using the relative entropy of coherence as the quantification of coherence, we generalize the case to multimode Fock spaces, and some special examples are considered. It is shown that with a finite average particle number, increasing the number of modes of light can enhance the relative entropy of coherence. With the mean energy constraint, our results can also be extended to other infinite-dimensional systems.", "num_citations": "104\n", "authors": ["1636"]}
{"title": "Minimization of states in automata theory based on finite lattice-ordered monoids\n", "abstract": " In this study, we consider a concept of complete L-fuzzy matrix, define complete lattice-valued finite automata (CLFAs) and study their properties. The definitions of statewise equivalence relations and automata equivalence relations of a CLFA are given, two algorithms are aimed at the minimization of states of a CLFA.", "num_citations": "88\n", "authors": ["1636"]}
{"title": "Minimization of lattice finite automata and its application to the decomposition of lattice languages\n", "abstract": " In this paper, we study the minimization of lattice-valued finite automata with membership values in a distributive lattice and its relationships to the decomposition of lattice-valued regular languages. First, we establish the equivalence of (nondeterministic) lattice finite automata (LA) and deterministic lattice finite automata (DLA). Furthermore, we provide some characterization of lattice-valued regular languages and regular operations on family of lattice-valued regular languages. In the sequel, we introduce some notions that help clarify the concept of minimal DLAs and present an effective algorithm to obtain a minimal DLA from a given LA. Using the construction of minimal DLA, we introduce some simple classes of lattice-valued regular languages such as L-unitary and L-prefix ones. We demonstrate that any lattice-valued regular language can be decomposed as disjoint joins of such kinds of simple languages.", "num_citations": "87\n", "authors": ["1636"]}
{"title": "Approximation theory of fuzzy systems based upon genuine many-valued implications—SISO cases\n", "abstract": " It is proved that the single input and single output (SISO) fuzzy systems based upon genuine many-valued implications are universal approximators. It is shown theoretically that fuzzy control systems based upon genuine many-valued implications are equivalent to those based upon t-norm implications, the general approach to construct fuzzy systems is given. It is also shown that defuzzifier based upon center of areas is not appropriate to the fuzzy systems based upon genuine many-valued implications.", "num_citations": "79\n", "authors": ["1636"]}
{"title": "The relationships among several types of fuzzy automata\n", "abstract": " We discuss the relationships among several types of fuzzy automata in which all fuzzy sets are defined by membership functions whose codomains are a lattice-ordered monoid L. These automata include nondeterministic L-valued finite automata with Λ-move, nondeterministic L-valued finite automata, deterministic L-valued finite automata, and L-valued finite-state automata. We consider all that come with fuzzy initial states and fuzzy final states or with crisp initial states or crisp final states. Some comparative results concerning the power of fuzzy automata used in the existing literature to recognize fuzzy languages are given systematically.", "num_citations": "78\n", "authors": ["1636"]}
{"title": "An approach to measure the robustness of fuzzy reasoning\n", "abstract": " Fuzzy reasoning is intensively used in intelligent systems including fuzzy control, classification, expert systems, and networks to name a few dominant categories of such architectures. As being a fundamental construct permeating so many diverse areas, fuzzy reasoning was studied with respect to its fundamental properties such as robustness. The notion of robustness or sensitivity becomes of paramount importance by leading to a more comprehensive understanding of the way in which reasoning processes are developed. In this study, we introduce and study properties of some measures of robustness (or sensitivity) of fuzzy connectives and implication operators and discuss their relationships with perturbation properties of fuzzy sets. The results produced here are compared and contrasted with the previous findings available in the literature. © 2005 Wiley Periodicals, Inc. Int J Int Syst 20: 393–413, 2005.", "num_citations": "75\n", "authors": ["1636"]}
{"title": "Finite automata theory with membership values in lattices\n", "abstract": " In this paper, we study finite automata with membership values in a lattice, which are called lattice-valued finite automata. The extended subset construction of lattice-valued finite automata is introduced, then the equivalences between lattice-valued finite automata, lattice-valued deterministic finite automata and lattice-valued finite automata with ε-moves are proved. A simple characterization of lattice-valued languages recognized by lattice-valued finite automata is given, then it is proved that the Kleene theorem holds in the frame of lattice-setting. A minimization algorithm of lattice-valued deterministic finite automata is presented. In particular, the role of the distributive law for the truth valued domain of finite automata is analyzed: the distributive law is not necessary to many constructions of lattice-valued finite automata, but it indeed provides some convenience in simply processing lattice-valued finite automata.", "num_citations": "72\n", "authors": ["1636"]}
{"title": "Approximation theory of fuzzy systems based upon genuine many-valued implications—MIMO cases\n", "abstract": " It is constructively proved that the multi-input–multi-output fuzzy systems based upon genuine many-valued implications are universal approximators (they are called Boolean type fuzzy systems in this paper). The general approach to construct such fuzzy systems is given, that is, through the partition of the output region (by the given accuracy). Two examples are provided to demonstrate the way in which fuzzy systems are designed to approximate given functions with a given required approximation accuracy.", "num_citations": "72\n", "authors": ["1636"]}
{"title": "Remarks on uninorm aggregation operators\n", "abstract": " It is proved that continuous uninorm aggregation operators are only t-norms or t-conorms. Some general constructions about uninorm aggregation operators are given.", "num_citations": "68\n", "authors": ["1636"]}
{"title": "General monogamy of Tsallis -entropy entanglement in multiqubit systems\n", "abstract": " In this paper, we study the monogamy inequality of Tsallis q-entropy entanglement. We first provide an analytic formula of Tsallis q-entropy entanglement in two-qubit systems for 5− 13 2≤ q≤ 5+ 13 2. The analytic formula of Tsallis q-entropy entanglement in 2⊗ d system is also obtained and we show that Tsallis q-entropy entanglement satisfies a set of hierarchical monogamy equalities. Furthermore, we prove the squared Tsallis q-entropy entanglement follows a general inequality in the qubit systems. Based on the monogamy relations, a set of multipartite entanglement indicators is constructed, which can detect all genuine multiqubit entangled states even in the case of N-tangle vanishes. Moreover, we study some examples in multipartite higher-dimensional system for the monogamy inequalities.", "num_citations": "64\n", "authors": ["1636"]}
{"title": "Approximation and robustness of fuzzy finite automata\n", "abstract": " In previous work we have shown that nondeterministic fuzzy finite automata (or NFFAs, for short) under max-∗ compositional inference for some t-norm ∗ and deterministic fuzzy finite automata (or DFFAs, for short) are not necessarily equivalent. We continue to study the approximation and robustness of fuzzy finite automata in this paper. In particular, we show that we can approximate an NFFA by some DFFA with any given accuracy when the NFFA is not equivalent to any DFFA, and the related construction is also presented. Some characterizations of NFFA and DFFA are given. We study the robustness of fuzzy finite automata against imprecision of fuzzy transitions, and some interesting results are obtained.", "num_citations": "61\n", "authors": ["1636"]}
{"title": "Model checking of linear-time properties based on possibility measure\n", "abstract": " Using possibility measure, we study model checking of linear-time properties in possibilistic Kripke structures. First, the notion of possibilistic Kripke structures and the related possibility measure are introduced, and then, model checking of reachability and repeated reachability linear-time properties in finite possibilistic Kripke structures are studied. Standard safety properties and ω-regular properties in possibilistic Kripke structures are introduced; the verification of regular safety properties and ω-regular properties using finite automata are thoroughly studied. It has been shown that the verification of regular safety properties and ω-regular properties in a finite possibilistic Kripke structure can be transformed into the verification of reachability properties and repeated reachability properties in the product possibilistic Kripke structure that is introduced in this paper. Several examples are given to illustrate the methods …", "num_citations": "50\n", "authors": ["1636"]}
{"title": "Algebraic properties of LA-languages\n", "abstract": " In this study, we introduce the concepts of L-valued regular substitution (LA-substitution), deterministic L-valued regular substitution (DLA-substitution), L-valued fuzzy homomorphism and its inverse images, homomorphism and its inverse images for a lattice-ordered monoid L. We also study the properties of LA-languages and DLA-languages under the above-mentioned algebraic operations. The algebraic characterization of the L-valued regular language is given.", "num_citations": "50\n", "authors": ["1636"]}
{"title": "A fuzzy sets theoretic approach to approximate spatial reasoning\n", "abstract": " Relational composition-based reasoning has become the most prevalent method for qualitative reasoning since Allen's 1983 work on temporal intervals. Underlying this reasoning technique is the concept of a jointly exhaustive and pairwise disjoint set of relations. Systems of relations such as RCC5 and RCC8 were originally developed for ideal regions, not subject to imperfections such as vagueness or fuzziness which are found in many applications in geographic analysis and image understanding. This paper, however, presents a general method for classifying binary topological relations involving fuzzy regions using the RCC5 or the RCC8 theory. Our approach is based on fuzzy set theory and the theory of consonant random set. Some complete classifications of topological relations between fuzzy regions are also given. Furthermore, two composition operators on spatial relations between fuzzy regions are …", "num_citations": "50\n", "authors": ["1636"]}
{"title": "Measurement-induced nonlocality based on the relative entropy\n", "abstract": " We quantify the measurement-induced nonlocality [Luo and Fu, Phys. Rev. Lett. 106, 120401 (2011)] from the perspective of the relative entropy. This quantification leads to an operational interpretation for the measurement-induced nonlocality, namely, it is the maximal entropy increase after the locally invariant measurements. The relative entropy of nonlocality is upper bounded by the entropy of the measured subsystem. We establish a relationship between the relative entropy of nonlocality and the geometric nonlocality based on the Hilbert-Schmidt norm, and show that it is equal to the maximal distillable entanglement. Several trade-off relations are obtained for tripartite pure states. We also give explicit expressions for the relative entropy of nonlocality for Bell-diagonal states.", "num_citations": "49\n", "authors": ["1636"]}
{"title": "Robustness of interval-valued fuzzy inference\n", "abstract": " Since interval-valued fuzzy set intuitively addresses not only vagueness (lack of sharp class boundaries) but also a feature of uncertainty (lack of information), interval-valued fuzzy reasoning plays a vital role in intelligent systems including fuzzy control, classification, expert systems, and so on. To utilize interval-valued fuzzy inference better, it is very important to study the fundamental properties of interval-valued fuzzy inference such as robustness. In this paper, we first discuss the robustness of interval-valued fuzzy connectives. And then investigate the robustness of interval-valued fuzzy reasoning in terms of the sensitivity of interval-valued fuzzy connectives and maximum perturbation of interval-valued fuzzy sets. These results reveal that the robustness of interval-valued fuzzy reasoning is directly linked to the selection of interval-valued fuzzy connectives.", "num_citations": "49\n", "authors": ["1636"]}
{"title": "Computation tree logic model checking based on possibility measures\n", "abstract": " In order to deal with the systematic verification with uncertain information in possibility theory, Li and Li (2013) introduced model checking of linear-time properties in which the uncertainty is modeled by possibility measures. Xue, Lei and Li (2011) defined computation tree logic (CTL) based on possibility measures, which is called possibilistic CTL (PoCTL). This paper is a continuation of the above work. First, we study the expressiveness of PoCTL. Unlike probabilistic CTL, it is shown that PoCTL (in particular, qualitative PoCTL) is more powerful than CTL with respect to their expressiveness. The equivalent expressions of basic CTL formulae using qualitative PoCTL formulae are presented in detail. Some PoCTL formulae that cannot be expressed by any CTL formulae are presented. In particular, some qualitative properties of repeated reachability and persistence are expressed using PoCTL formulae. Next …", "num_citations": "48\n", "authors": ["1636"]}
{"title": "Monogamy of αth power entanglement measurement in qubit systems\n", "abstract": " In this paper, we study the α th power monogamy properties related to the entanglement measure in bipartite states. The monogamy relations related to the α th power of negativity and the Convex-Roof Extended Negativity are obtained for N-qubit states. We also give a tighter bound of hierarchical monogamy inequality for the entanglement of formation. We find that the GHZ state and W state can be used to distinguish both the α th power of the concurrence for 0< α< 2 and the α th power of the entanglement of formation for 0< α≤ 1 2. Furthermore, we compare concurrence with negativity in terms of monogamy property and investigate the difference between them.", "num_citations": "47\n", "authors": ["1636"]}
{"title": "Dalton Trans. 4336, 2008\n", "abstract": " CiNii 論文 - <no title> CiNii 国立情報学研究所 学術情報ナビゲータ[サイニィ] 日本の論文をさがす 大学図書館の本をさがす 日本の博士論文をさがす 新規登録 ログイン English 検索 すべて 本文あり すべて 本文あり 閉じる タイトル 著者名 著者ID 著者所属 刊行物名 ISSN 巻号ページ 出版者 参考 文献 出版年 年から 年まで 検索 検索 検索 CiNii窓口業務の再開について <no title> RIVARD E. 被 引用文献: 1件 著者 RIVARD E. 収録刊行物 Dalton Trans. Dalton Trans. 4336, 2008 被引用文献: 1件中 1-1件を 表示 1 Synthesis and Structures of a Series of Bulky \"Rind-Br\" Based on a Rigid Fused-Ring s-Hydrindacene Skeleton Matsuo Tsukasa , Suzuki Katsunori , Fukawa Tomohide , LI Baolin , ITO Mikinao , SHOJI Yoshiaki , OTANI Takashi , LI Liangchun , KOBAYASHI Megumi , HACHIYA Makoto , TAHARA Yoshiyuki , HASHIZUME Daisuke , FUKUNAGA Takeo , FUKAZAWA Aiko , LI Yongming , TSUJI Hayato , TAMAO Kohei Bulletin of the …", "num_citations": "46\n", "authors": ["1636"]}
{"title": "The equivalence between fuzzy Mealy and fuzzy Moore machines\n", "abstract": " We study the relationships between fuzzy Mealy and fuzzy Moore machines in the frame of truth values in a lattice-ordered monoid. In particular, we show that lattice-valued sequential-like machines and lattice-valued finite Moore machines are equivalent in the sense they exhibit the same input–output characteristics.", "num_citations": "46\n", "authors": ["1636"]}
{"title": "Quantitative computation tree logic model checking based on generalized possibility measures\n", "abstract": " We study generalized possibilistic computation tree logic (GPoCTL) model checking in this paper, which is an extension of possibilistic computation logic model checking introduced by Li et al. (2014). The system is modeled by generalized possibilistic Kripke structures, and the verifying property is specified by a GPoCTL formula. Based on generalized possibility measures and generalized necessity measures, the method of GPoCTL model checking is discussed, and the corresponding algorithm and its complexity are shown in detail. Furthermore, the comparison between possibilistic computation tree logic and GPoCTL is given. Finally, a thermostat example is given to illustrate the GPoCTL model-checking method.", "num_citations": "44\n", "authors": ["1636"]}
{"title": "Necessary and sufficient condition for saturating the upper bound of quantum discord\n", "abstract": " We revisit the upper bound of quantum discord given by the von Neumann entropy of the measured subsystem. Using the Koashi-Winter relation, we obtain a tradeoff between the amount of classical correlation and quantum discord in the tripartite pure states. The difference between the quantum discord and its upper bound is interpreted as a measure on the classical correlative capacity. Further, we give the explicit characterization of the quantum states saturating the upper bound of quantum discord, through the equality condition for the Araki-Lieb inequality. We also demonstrate that the saturating of the upper bound of quantum discord precludes any further correlation between the measured subsystem and the environment.", "num_citations": "43\n", "authors": ["1636"]}
{"title": "Robustness of fuzzy reasoning via logically equivalence measure\n", "abstract": " In this paper, we discuss robustness of fuzzy reasoning. After proposing the definition of perturbation of fuzzy sets based on some logic-oriented equivalence measure, we present robustness results for various fuzzy logic connectives, fuzzy implication operators, inference rules and fuzzy reasoning machines, and discuss the relations between the robustness of fuzzy reasoning and that of fuzzy conjunction and implication operators. The robustness results are presented in terms of δ-equalities of fuzzy sets based on some logic-oriented equivalence measure, and the maximum of δ (which ensures the corresponding δ-equality holds) is derived.", "num_citations": "41\n", "authors": ["1636"]}
{"title": "Algebraic properties of L-fuzzy finite automata\n", "abstract": " Fuzzy automata theory on lattice-ordered monoids was introduced by Li and Pedrycz. Dropping the distributive laws, fuzzy finite automata (L-FFAs for short) based on a more generalized structure L, named a po-monoid, are presented and investigated from the view of algebra in this paper. The notions of (strong) successor and source operators, fuzzy successor and source operators which are shown to be closure operators on certain conditions are introduced and discussed in detail. Using the weak primary submachines, a unique decomposition theorem of a fuzzy finite automaton based on a lattice-ordered monoid is obtained. Taking L as a quantale, fuzzy subsystems are proved to be the same as fuzzy submachines of an L-FFA. In particular, intrinsic connections between algebraic properties of L and properties of some operators of an L-FFA are discovered. It is shown that the join-preserving property of fuzzy …", "num_citations": "39\n", "authors": ["1636"]}
{"title": "Weak uninorm aggregation operators\n", "abstract": " By weakening the identity condition of uninorm, a general class of associative aggregation operators called weak uninorm is introduced. It is proved that continuous weak uninorms are the combination of continuous t-norm and continuous t-conorm through a median operator. The representation theorem for Archimedean weak uninorm is also given. Finally, the counting number of the identity elements of weak uninorm is also investigated.", "num_citations": "39\n", "authors": ["1636"]}
{"title": "A categorical approach to lattice-valued fuzzy automata\n", "abstract": " Some uniform categorical theoretical treatment of automata and lattice-valued fuzzy automata using quantale theory is studied in this paper. First, L-relational sheaves on a monoid M and Q-enriched categories are introduced for quantales L and Q, the equivalence of the corresponding categories are proved next. Then lattice-valued (fuzzy) automata are described by Q-enriched categories. In fact, lattice-valued (fuzzy) automata are characterized by the category of generalized lattice-valued automata using the notions of Q-bimodules. Finally, some of the algebraic properties of behaviors of generalized lattice-valued automata are studied by using the technique of gluing of Q-bimodules.", "num_citations": "38\n", "authors": ["1636"]}
{"title": "A new order relation on fuzzy soft sets and its application\n", "abstract": " In this paper, a new order relation on fuzzy soft sets, called soft information order, is introduced and its application to decision-making is investigated. It is shown that the collection of all fuzzy soft sets (over a given universe set), equipped with this new order, forms a complete Heyting algebra. The representation theorem of fuzzy soft sets with respect to the soft information order is also obtained. We initiate the concepts of soft set satisfaction problems and their solutions. An algorithm is presented to solve such decision-making problems.", "num_citations": "37\n", "authors": ["1636"]}
{"title": "格值自动机与语言\n", "abstract": " 引入了格值自动机及其语言的概念,给出了格值自动机的状态转移函数可扩充的充分必要条件,证明了确定型格值自动机与格值自动机等价的充分必要条件,研究了格值自动机的语言关于正则运算的封闭性及其条件.所得结论表明了格值自动机及其语言的特性与取值格代数性质的紧密联系.", "num_citations": "36\n", "authors": ["1636"]}
{"title": "The upper bound and continuity of quantum discord\n", "abstract": " Quantum discord is viewed as the measure of quantum correlation which can be nonzero even when entanglement in the system is zero. We study two properties of quantum discord: the upper bound and the continuity. We prove the upper bound of quantum discord in terms of the coherent information for any quantum state and discuss the condition for the reachable upper bound. If two states are close to each other, then we find that quantum discord has little change and provides a bound with respect to this small change.", "num_citations": "33\n", "authors": ["1636"]}
{"title": "Intuitionistic fuzzy recognizers and intuitionistic fuzzy finite automata\n", "abstract": " Intuitionistic fuzzy recognizers and intuitionistic fuzzy finite automata are discussed. The notions of intuitionistic fuzzy recognizer, complete accessible intuitionistic fuzzy recognizer, intuitionistic fuzzy finite automata, deterministic intuitionistic fuzzy finite automata, and intuitionistic fuzzy language are introduced. It is shown that the languages recognized by intuitionistic fuzzy recognizer are regular, and the intuitionistic fuzzy languages recognized by the intuitionistic fuzzy finite automaton and the intuitionistic fuzzy languages recognized by deterministic intuitionistic fuzzy finite automaton are equivalent.", "num_citations": "32\n", "authors": ["1636"]}
{"title": "Localic Katětov-Tong insertion theorem and localic Tietze extension theorem\n", "abstract": " In this paper, localic upper, respectively lower continuous chains over a locale are defined. A localic Katětov-Tong insertion theorem is given and proved in terms of a localic upper and lower continuous chain. Finally, the localic Urysohn lemma and the localic Tietze extension theorem are shown as applications of the localic insertion theorem.", "num_citations": "32\n", "authors": ["1636"]}
{"title": "Elicitation criterions for restricted intersection of two incomplete soft sets\n", "abstract": " PurposeThis paper aims to develop and compare several elicitation criterions for decision making of incomplete soft sets which are generated by restricted intersection.Design/methodology/approachOne time elicitation process is divided into two steps. Using the greedy idea four criterions for elicitation of objects are built based on maximax, maximin, minimax regret and combination of expected choice values and elicitation times. Then these initial unknown values which produce incomplete values together with known information are in priority.FindingsFast methods for computing possibly and necessarily optimal solutions before or in the elicitation process are invented. As far as the sizes of soft sets used in the simulation experiments, it is found statistically that we should choose the criterion based on the combination of expected choice value and expected elicitation times in the first step of one time elicitation …", "num_citations": "31\n", "authors": ["1636"]}
{"title": "The universal fuzzy automaton\n", "abstract": " In this paper, we introduce the notion of universal fuzzy automaton with membership values in a complete residuated lattice, whose states are the factorizations of this fuzzy language and transition function is defined using the inclusion degree of related fuzzy languages. Next, we define the homomorphism of fuzzy automata, prove that every automaton accepting a fuzzy language can canonically map into the universal fuzzy automaton of this language, which is called the universal property. For a fuzzy language, the connections between the universal fuzzy automaton and fuzzy minimal automata of the given fuzzy language are exploited. Finally, we give a method to construct the universal fuzzy automaton by a deterministic fuzzy automaton accepting the given fuzzy language, which is effective in the case that this deterministic fuzzy automaton is finite.", "num_citations": "30\n", "authors": ["1636"]}
{"title": "DHS (trans− 4, 4′-dihydroxystilbene) suppresses DNA replication and tumor growth by inhibiting RRM2 (ribonucleotide reductase regulatory subunit M2)\n", "abstract": " DNA replication machinery is responsible for accurate and efficient duplication of the chromosome. Since inhibition of DNA replication can lead to replication fork stalling, resulting in DNA damage and apoptotic death, inhibitors of DNA replication are commonly used in cancer chemotherapy. Ribonucleotide reductase (RNR) is the rate-limiting enzyme in the biosynthesis of deoxyribonucleoside triphosphates (dNTPs) that are essential for DNA replication and DNA damage repair. Gemcitabine, a nucleotide analog that inhibits RNR, has been used to treat various cancers. However, patients often develop resistance to this drug during treatment. Thus, new drugs that inhibit RNR are needed to be developed. In this study, we identified a synthetic analog of resveratrol (3, 5, 4′-trihydroxy-trans-stilbene), termed DHS (trans− 4, 4′-dihydroxystilbene), that acts as a potent inhibitor of DNA replication. Molecular docking …", "num_citations": "29\n", "authors": ["1636"]}
{"title": "Model checking fuzzy computation tree logic\n", "abstract": " Traditional temporal logics such as linear temporal logic and computation tree logic are widely used to specify properties of reactive systems. Model checking is a well-established technique for verifying if a desired property described as a temporal logic formula holds over a reactive system model. This paper presents fuzzy computation tree logic (FCTL), a fuzzy extension of temporal logics, by combining general fuzzy logic with computation tree logic, and discusses its model checking problem. First, the notion of fuzzy Kripke structures (FKSs) and the syntax and semantics of their specification language FCTL are introduced. Then we give a direct model checking algorithm for FCTL over FKS. On the other hand, we study when FCTL model checking problem can be reduced to classical model checking ones, and give a reduction method for an important fragment of FCTL.", "num_citations": "29\n", "authors": ["1636"]}
{"title": "Determination of the time resolution for neutron scintillation detectors by multi-coincidence measurement\n", "abstract": " Based on the multi-coincidence measurement, the time resolution of three liquid scintillation detectors (BC501A) were determined strictly by solving the coincidence equations, where the influence from electronics estimated by self coincidence measurement as well as the background had been considered. The result of this work agreed well with the result that was deduced from the traditional method, and it will be helpful to analyze the energy resolution of neutron time of flight spectra measured by using such detectors at CIAE (China Institute of Atomic Energy).", "num_citations": "28\n", "authors": ["1636"]}
{"title": "Nondeterministic fuzzy automata with membership values in complete residuated lattices\n", "abstract": " Abstract Automata theory based on complete residuated lattice-valued logic has been initiated by Qiu, and further systematically established by Qiu et al. In this paper, we propose the notion of nondeterministic fuzzy automata with membership values in a complete residuated lattice L, called lattice-valued nondeterministic fuzzy automata (L-NFAs). In our setting, a state of an L-NFA may have more than one transition labeled by the same input symbol, which reflects nondeterminism. To compare the behaviors of L-NFAs, we introduce two language equivalence relations which have different discriminating power. Furthermore, we extend the two relations to the complete residuated lattice-valued setting and investigate their properties such as robustness and compositionality. The theory developed here is applicable to the quantitative modeling and verification of fuzzy systems.", "num_citations": "27\n", "authors": ["1636"]}
{"title": "Algebraic structures of interval-valued fuzzy (S, N)-implications\n", "abstract": " In this paper, a new characterization with mutually independent requirements for the interval-valued fuzzy (S, N)-implications is presented, which provides a simple way to construct interval-valued fuzzy (S, N)-implications using continuous fuzzy negations. In addition, some illustrative examples are given to show the validity of this method which builds interval-valued fuzzy (S, N)-implications.", "num_citations": "26\n", "authors": ["1636"]}
{"title": "A generalized information theoretical model for quantum secret sharing\n", "abstract": " An information theoretical model for quantum secret sharing was introduced by H. Imai et al. (Quantum Inf. Comput. 5(1), 69–80 2005), which was analyzed by quantum information theory. In this paper, we analyze this information theoretical model using the properties of the quantum access structure. By the analysis we propose a generalized model definition for the quantum secret sharing schemes. In our model, there are more quantum access structures which can be realized by our generalized quantum secret sharing schemes than those of the previous one. In addition, we also analyse two kinds of important quantum access structures to illustrate the existence and rationality for the generalized quantum secret sharing schemes and consider the security of the scheme by simple examples.", "num_citations": "25\n", "authors": ["1636"]}
{"title": "Model checking computation tree logic over finite lattices\n", "abstract": " Multi-valued model-checking is an extension of classical model-checking used to verify the properties of systems with uncertain information content. It is used in systems where the semantic domain of both the models of the systems and the specification is a De Morgan algebra or more abstract structure such as semirings. A common feature of De Morgan algebras and semirings is that they satisfy the distributive law, which is crucial for all of the multi-valued model-checking algorithms developed so far. In this paper, we study computation tree logic with membership values in a finite lattice, which are called multi-valued computation tree logic (MCTL). We introduce three semantics for MCTL over the multi-valued Kripke structure: path semantics, fixpoint semantics, and algebraic semantics, and prove that they coincide if and only if the underlying lattice is distributive. Furthermore, we provide model-checking algorithms …", "num_citations": "24\n", "authors": ["1636"]}
{"title": "Regular grammars with truth values in lattice-ordered monoid and their languages\n", "abstract": " In this study, we introduce the concept of lattice-valued regular grammars. Such grammars have become a necessary tool for the analysis of fuzzy finite automata. The relationship between lattice-valued finite automata (LA) and lattice-valued regular grammars (LRG) are discussed and we get the following results, for a given LRG, there exists an LA such that they accept the same languages, and vice versa. We also show the equivalence between deterministic lattice-valued regular grammars and deterministic lattice-valued finite automata.", "num_citations": "24\n", "authors": ["1636"]}
{"title": "Quantum secret sharing using orthogonal multiqudit entangled states\n", "abstract": " In this work, we investigate the distinguishability of orthogonal multiqudit entangled states under restricted local operations and classical communication. According to these properties, we propose a quantum secret sharing scheme to realize three types of access structures, i.e., the (n, n)-threshold, the restricted (3, n)-threshold and restricted (4, n)-threshold schemes (called LOCC-QSS scheme). All cooperating players in the restricted threshold schemes are from two disjoint groups. In the proposed protocol, the participants use the computational basis measurement and classical communication to distinguish between those orthogonal states and reconstruct the original secret. Furthermore, we also analyze the security of our scheme in four primary quantum attacks and give a simple encoding method in order to better prevent the participant conspiracy attack.", "num_citations": "23\n", "authors": ["1636"]}
{"title": "0–1 Linear programming methods for optimal normal and pseudo parameter reductions of soft sets\n", "abstract": " This paper aims to find better algorithms for solving parameter reduction problems of soft sets and gives their potential applications. Firstly, we define the matrix of dominant support parameters and use it to explain the essential reasons for the different choice values of arbitrary pair of objects. Then we propose techniques for translating the normal and pseudo parameter reduction problems of soft sets into several equivalent 0–1 linear programming models, thus reduction problems of soft sets can be solved by any computational software for integer programming. Compared with the algorithm proposed by Ma et al., experimental results show that our method for normal parameter reduction is more efficient particularly when the number of parameters is big. At last we build a software system to show the potential applications of our methods in decision support.", "num_citations": "22\n", "authors": ["1636"]}
{"title": "Lattice-valued simulations for quantitative transition systems\n", "abstract": " Quantitative (bi)simulations taking values from non-negative real numbers enjoy numerous applications in the analysis of labeled transition systems, whose transitions, states, or labels contain quantitative information. To investigate the simulation semantics of labeled transition systems in the residuated lattice-valued logic setting, we introduce an extension of labeled transition systems, called the quantitative transition systems (QTSs), whose labels are equipped with a residuated lattice-valued equality relation. We then establish a lattice-valued relation between states of a QTS, called approximate similarity, to quantify to what extent one state is simulated by another. One main contribution of this paper is to show that unlike the classic setting where similarity has both fixed point and logical characterizations, these results do not hold for approximate similarity on QTSs in general, but they hold for QTSs having truth …", "num_citations": "22\n", "authors": ["1636"]}
{"title": "Sufficient and necessary conditions for Boolean fuzzy systems as universal approximators\n", "abstract": " A formula is first presented to compute the lower upper bounds on the number of fuzzy sets to achieve pre-specified approximation accuracy for an arbitrary multivariate continuous function. The necessary condition for Boolean fuzzy systems as universal approximators with minimal system configurations is then discussed. Two examples are provided to demonstrate how to design a Boolean fuzzy system in order to approximate a given continuous function with a required approximation accuracy.", "num_citations": "22\n", "authors": ["1636"]}
{"title": "Quantitative model checking of linear-time properties based on generalized possibility measures\n", "abstract": " Model checking of linear-time properties based on possibility measures was studied in previous work (Li and Li (2013)). However, the linear-time properties considered in the previous work was qualitative and was based on Boolean logic, the linear-time properties containing possibility information (we call it fuzzy linear-time properties here, which is based on fuzzy logic) of system could not be represented and tackled using the previous methods. We shall study quantitative model checking of fuzzy linear-time properties based on generalized possibility measures in the paper. Both the model of the system, as well as the properties the system needs to adhere to, are described using possibility information to identify the uncertainty in the model/properties. The systems are modeled by generalized possibilistic Kripke structures (GPKS, in short), and the properties are described by fuzzy linear-time properties. Concretely …", "num_citations": "21\n", "authors": ["1636"]}
{"title": "The relationship of controllability between classical and fuzzy discrete-event systems\n", "abstract": " We have known that the controllability of classical discrete-event systems has already been extended into fuzzy discrete-event systems. In this paper, firstly, we recall some related definitions and results of the controllability for classical and fuzzy discrete-event systems, respectively. Secondly, we are concerned with the relationship of the controllability between classical and fuzzy discrete-event systems. In particular, we show that there is an equivalence of the controllability between the two systems to some extent, some special proofs are also presented. Finally, we use this equivalence to extend some general controllability properties of classical discrete-event systems into fuzzy ones.", "num_citations": "21\n", "authors": ["1636"]}
{"title": "非可换线性逻辑及其 Quantale 语义\n", "abstract": " 扩充了V.M.Abrusci定义的非可换线性逻辑,使其兼容直觉逻辑,可换线性逻辑及cyclic线性逻辑,并利用提出的对偶quantale概念给出了非可换线性逻辑的可靠且完备的quantale语义.", "num_citations": "21\n", "authors": ["1636"]}
{"title": "Quantum coherence quantifiers based on Rényi α-relative entropy\n", "abstract": " The resource theories of quantum coherence attract a lot of attention in recent years. Especially, the monotonicity property plays a crucial role here. In this paper we investigate the monotonicity property for the coherence measures induced by the Rényi α-relative entropy, which present in [Phys. Rev. A 94 (2016) 052336]. We show that the Rényi α-relative entropy of coherence does not in general satisfy the monotonicity requirement under the subselection of measurements condition and it also does not satisfy the extension of monotonicity requirement, which presents in [Phys. Rev. A 93 (2016) 032136]. Due to the Rényi α-relative entropy of coherence can act as a coherence monotone quantifier, we examine the trade-off relations between coherence and mixedness. Finally, some properties for the single qubit of Rényi 2-relative entropy of coherence are derived.", "num_citations": "20\n", "authors": ["1636"]}
{"title": "A dynamic multiparty quantum direct secret sharing based on generalized GHZ states\n", "abstract": " This paper proposes a new dynamic multiparty quantum direct secret sharing (DQDSS) using mutually unbiased measurements based on generalized GHZ states. Without any unitary operations, an agent can obtain a shadow of the secret by simply performing a measurement on single photons. In the proposed scheme, multiple agents can be added or deleted and the shared secret need not be changed. Our DQDSS scheme has several advantages. The dealer is not required to retain any photons and can further share a predetermined key instead of a random key to the agents. Agents can update their shadows periodically, and the dealer does not need to be online. Furthermore, the proposed scheme can resist not only the existing attacks, but also cheating attacks from dishonest agents. Hence, compared to some famous DQSS schemes, the proposed scheme is more efficient and more practical. Finally …", "num_citations": "19\n", "authors": ["1636"]}
{"title": "One-way unlocalizable quantum discord\n", "abstract": " In this paper, we present the concept of the one-way unlocalizable quantum discord and investigate its properties. We provide a polygamy inequality for it in a tripartite pure quantum system of arbitrary dimension. Several tradeoff relations between the one-way unlocalizable quantum discord and other correlations are given. If the von Neumann measurement is made on a part of the system, we give two expressions of the one-way unlocalizable quantum discord in terms of partial distillable entanglement and quantum disturbance. Finally, we also provide a lower bound for bipartite shareability of quantum correlation beyond entanglement in a tripartite system.", "num_citations": "19\n", "authors": ["1636"]}
{"title": "Fuzzy Turing machines: variants and universality\n", "abstract": " In this paper, we study some variants of fuzzy Turing machines (FTMs) and universal FTM. First, we give several formulations of FTMs, including, in particular, deterministic FTMs (DFTMs) and nondeterministic FTMs (NFTMs). We then show that DFTMs and NFTMs are not equivalent as far as the power of recognizing fuzzy languages is concerned. This contrasts sharply with classical TMs. Second, we show that there is no universal FTM that can exactly simulate any FTM on it. But if the membership degrees of fuzzy sets are restricted to a fixed finite subset  A  of [0,1], such a universal machine exists. We also show that a universal FTM exists in some approximate sense. This means, for any prescribed accuracy, that we can construct a universal machine that simulates any FTM with the given accuracy. Finally, we introduce the notions of fuzzy polynomial time-bounded computation and nondeterministic fuzzy …", "num_citations": "19\n", "authors": ["1636"]}
{"title": "Model checking of linear-time properties in multi-valued systems\n", "abstract": " In this paper, we study the model-checking problem of linear-time properties in multi-valued systems. Safety properties, invariant properties, liveness properties, persistence and dual-persistence properties in multi-valued logic systems are introduced. Some algorithms related to the above multi-valued linear-time properties are discussed. The verification of multi-valued regular safety properties and multi-valued ω-regular properties using lattice-valued automata are thoroughly studied. Since the law of non-contradiction (ie, a∧¬ a= 0) and the law of excluded-middle (ie, a∨¬ a= 1) do not hold in multi-valued logic, the linear-time properties introduced in this paper have new forms compared to those in classical logic. Compared to those classical model-checking methods, our methods to multi-valued model checking are accordingly more direct: We give an algorithm for showing TS⊧ P for a model TS and a linear-time …", "num_citations": "18\n", "authors": ["1636"]}
{"title": "Lattice-valued fuzzy Turing machines: Computing power, universality and efficiency\n", "abstract": " In this paper we study fuzzy Turing machines with membership degrees in distributive lattices, which we called them lattice-valued fuzzy Turing machines. First we give several formulations of lattice-valued fuzzy Turing machines, including in particular deterministic and non-deterministic lattice-valued fuzzy Turing machines (l-DTMcs and l-NTMs). We then show that l-DTMcs and l-NTMs are not equivalent as the acceptors of fuzzy languages. This contrasts sharply with classical Turing machines. Second, we show that lattice-valued fuzzy Turing machines can recognize n-r.e. sets in the sense of Bedregal and Figueira, the super-computing power of fuzzy Turing machines is established in the lattice-setting. Third, we show that the truth-valued lattice being finite is a necessary and sufficient condition for the existence of a universal lattice-valued fuzzy Turing machine. For an infinite distributive lattice with a compact …", "num_citations": "17\n", "authors": ["1636"]}
{"title": "Intuitionistic fuzzy linguistic quantifiers based on intuitionistic fuzzy-valued fuzzy measures and integrals\n", "abstract": " In this paper, we generalize Ying's model of linguistic quantifiers [M.S. Ying, Linguistic quantifiers modeled by Sugeno integrals, Artificial Intelligence, 170 (2006) 581-606] to intuitionistic linguistic quantifiers. An intuitionistic linguistic quantifier is represented by a family of intuitionistic fuzzy-valued fuzzy measures and the intuitionistic truth value (the degrees of satisfaction and non-satisfaction) of a quantified proposition is calculated by using intuitionistic fuzzy-valued fuzzy integral. Description of a quantifier by intuitionistic fuzzy-valued fuzzy measures allows us to take into account differences in understanding the meaning of the quantifier by different persons. If the intuitionistic fuzzy linguistic quantifiers are taken to be linguistic fuzzy quantifiers, then our model reduces to Ying's model. Some excellent logical properties of intuitionistic linguistic quantifiers are obtained including a prenex norm form theorem. A simple …", "num_citations": "17\n", "authors": ["1636"]}
{"title": "Decomposition and resolution of min-implication fuzzy relation equations based on S-implications\n", "abstract": " The problem of solving min-implication fuzzy relation equations based on S-implications is studied in this paper. Decomposition of min-implication fuzzy relation equations is given in a finite case. The solution existence problem of min-implication fuzzy relation equations is discussed, and for NS-implications, a new solvability criterion based upon “solution matrices” introduced in this paper is studied. It is shown that for each solution r of a min-implication fuzzy relation equation, there exists a maximal solution r∗ of this equation, such that r∗ is greater than or equal to r, whenever the solution set of this equation is nonempty. The complete solution set of min-implication fuzzy relation equation can be determined by the maximal solution set of this equation, which is finite. An effective method to solve min-implication fuzzy relation equations based on S-implication is proposed.", "num_citations": "17\n", "authors": ["1636"]}
{"title": "Baseline assessments of strength and balance performance and bilateral asymmetries in collegiate athletes\n", "abstract": " Dai, B, Layer, J, Vertz, C, Hinshaw, T, Cook, R, Li, Y, and Sha, Z. Baseline assessments of strength and balance performance and bilateral asymmetries in collegiate athletes. J Strength Cond Res 33 (11): 3015–3029, 2019—Injuries to upper and lower extremities comprise more than 70% of the total injuries in collegiate athletes. Establishing normative data of upper and lower extremity strength and balance may help guide postinjury rehabilitation and return-to-play decisions. The purposes of the current study were to develop the normative data of performance and bilateral asymmetries during 4 upper and lower extremity strength and balance tests in collegiate athletes and to quantify the correlations between strength and balance performance and bilateral asymmetries. A total of 304 male and 195 female Division I athletes from 14 sports performed a maximum push-up test to assess upper extremity strength, a …", "num_citations": "16\n", "authors": ["1636"]}
{"title": "Pseudo difference posets and pseudo Boolean D-posets\n", "abstract": " The definitions of pseudo difference posets, pseudo boolean D-posets, and D-ideals are introduced. It is proved that pseudo difference posets are algebraically equivalent to pseudo effect algebras and pseudo boolean D-posets are algebraically equivalent to pseudo MV-algebras. In pseudo difference lattices, a D-ideal is equal to a Riesz ideal. At the same time, some good properties are obtained.", "num_citations": "16\n", "authors": ["1636"]}
{"title": "Finite automata based on quantum logic and monadic second-order quantum logic\n", "abstract": " We introduce monadic second-order quantum logic and prove that the behaviors of finite automata based on quantum logic are precisely the quantum languages definable with sentences of our monadic second-order quantum logic. This generalizes Büchi’s and Elgot’s fundamental theorems to quantum logic setting. We also consider first-order quantum logic and show that star-free quantum languages and aperiodic quantum languages introduced here coincide with the first-order quantum definable ones. This generalizes Schützenberger’s fundamental theorems to quantum logic setting. The determinazation of finite automata based on quantum logic is studied by introducing the generalized subset construction method. Then the Kleene theorem in the frame of quantum logic is presented here.", "num_citations": "15\n", "authors": ["1636"]}
{"title": "Linguistic quantifiers based on Choquet integrals\n", "abstract": " The introduction of linguistic quantifiers has provided an important tool to model a large number of issues in intelligent systems. Ying [M.S. Ying, Linguistic quantifiers modeled by Sugeno integrals, Artificial Intelligence 170 (2006) 581–606] recently introduced a new framework for modeling quantifiers in natural languages in which each linguistic quantifier is represented by a family of fuzzy measures, and the truth value of a quantified proposition is evaluated by using Sugeno’s integral. Representing linguistic quantifiers by fuzzy measures, this paper evaluates linguistic quantified propositions by the Choquet integral. Some elegant logical properties of linguistic quantifiers are derived within this approach, including a prenex normal form theorem stronger than that in Ying’s model. In addition, our Choquet integral approach to the evaluation of quantified statements is compared with others, in particular with Ying’s …", "num_citations": "15\n", "authors": ["1636"]}
{"title": "Quantales and process semantics of bisimulation\n", "abstract": " The bisimulation quantale QB is constructed by taking certain observationsas its generators, the modules over QB are constructed by formalizing process actions astheir constitutions, general completness criteria about process semantics of bisimulationare stated. One'tantalizing'open problem about the quantale semantics of bisimulationposed by Abramsky S. and Vickers S. is answered, the uniform algebraic frameworkfor the studying of various notations of observing, testing process and the epuivalencethey induced is completed.", "num_citations": "15\n", "authors": ["1636"]}
{"title": "A new algorithm for testing diagnosability of fuzzy discrete event systems\n", "abstract": " Failure diagnosis and detection of fuzzy discrete event systems play a significant role in the study of complex systems. In this paper, we investigate the diagnosability of fuzzy discrete event systems by proposing a new algorithm based on the concept of undistinguishable strings. Moreover, a necessary and sufficient condition for fuzzy diagnosability is obtained in terms of certain properties of the diagnoser, which is constructed with respect to the minimal observable event. The computing process to check the diagnosability of fuzzy DESs and some examples serving to illuminate the applications are developed and described.", "num_citations": "14\n", "authors": ["1636"]}
{"title": "Riesz ideals in generalized pseudo effect algebras and in their unitizations\n", "abstract": " We prove that there is an order isomorphism between the lattice of all normal Riesz ideals and the lattice of all Riesz congruences in upwards directed generalized pseudoeffect algebras (or GPEAs, for short). We give a sufficient and necessary condition under which a normal Riesz ideal I of a weak commutative generalized pseudoeffect algebra P is a normal Riesz ideal also in the unitization  of P. These results extend those obtained recently by Avalllone, Vitolo, Pulmannová and Vinceková for effect algebras. At the same time, we give the conditions under which the quotient of a generalized pseudoeffect algebra P is a generalized effect algebra and linearly ordered generalized pseudoeffect algebra.", "num_citations": "14\n", "authors": ["1636"]}
{"title": "同步格值自动机的约简和最小化算法\n", "abstract": " 引入了完备 L-Fuzzy 矩阵的概念, 提出了取值于格半群上的输入字符和输出字符长度相同的模糊自动机的概念, 即完备的同步格值自动机的概念, 研究了它的主要性质; 从行为矩阵出发, 给出了完备的同步格值自动机状态等价和自动机等价的定义, 从自动机的状态等价, 研究了该自动机可约简的条件, 并得到了该自动机的最小化算法.", "num_citations": "14\n", "authors": ["1636"]}
{"title": "Experimental study of continuous-variable quantum teleportation\n", "abstract": " The experimental demonstration of quantum teleportation for continuous variables using the squeezed-state entanglement generated by a type II phase matching optical parametric amplifier(OPA) is reported. Type II OPA operating at deamplification can generate amplitude-anticorrelated and phase-correlated entanglements, which can be used in quantum teleportation scheme by direct Bell- state measurement. The correlation of 2dB was obtained with a pair of KTP crystals in the cavity. The inferred teleportation fidelity is 0.60, which when correlated for the efficiency of detection by the output observer, gives a fidelity of 0.57. The imperfect factors in detection are also. discussed.", "num_citations": "14\n", "authors": ["1636"]}
{"title": "Regular expressions with truth values in lattice-monoid and their languages\n", "abstract": " In this study, we introduce the concept of lattice-valued regular expressions. Such expressions become not only the necessary tool for the analysis and synthesis of fuzzy automata, but give rise to a recursive generation of the family of fuzzy languages accepted by fuzzy automata from certain simple fuzzy languages. The equivalence between lattice-valued regular expressions and lattice-valued finite automata is demonstrated. We also show that the family of fuzzy languages accepted by deterministic lattice-valued finite automata (abbreviated as DLA) is not closed under Kleene closure operation. Similarly, we show that in general the family of fuzzy languages accepted by (nondeterministic) lattice-valued finite automata (abbreviated as LA) is not closed under complement operation. These two findings form an essential difference between lattice-valued finite automata and classical finite automata. We also …", "num_citations": "14\n", "authors": ["1636"]}
{"title": "Quantale 与互模拟的进程语义\n", "abstract": " 以特定的观察为生成元构造了互模拟quantale  QB,而将进程作为此quantale上的模的组成成分,由此给出了互模拟的三个完备性准则,回答了Abrasmky  S.与Vickers  S.提出的公开问题(1993),完备了他们利用quantale统一处理进程语义的方法.", "num_citations": "14\n", "authors": ["1636"]}
{"title": "Feature-based analysis of cell nuclei structure for classification of histopathological images\n", "abstract": " Pathological examination of histopathological images remains the main method of cancer diagnosis. We proposed a novel automatic feature-based analysis scheme for classification of the histopathological images. An animal model of intestinal carcinogenesis-multiple intestinal neoplasia mouse model was used to evaluate the feasibility of the nuclear structure feature for detecting early-stage carcinogenesis and assessing cancer risk. Firstly, the cell nuclei are segmented based on collaborate cell localization and the improved morphology method. Then several types of features, including shape features, statistical features and textual features (Gabor and Markov random field features) are extracted. Feature selection methods including wrapper, filter and the maximum relevance-minimum multicollinearity are applied to obtain the optimal feature set. Experimental results show that the proposed segmentation …", "num_citations": "13\n", "authors": ["1636"]}
{"title": "基于直觉模糊的满意度计算模型\n", "abstract": " 摘 要 满意度理论广泛应用于优化, 控制, 管理, 决策, 资源分配, 任务调度等领域, 但大多是针对具体问题背景定义和计算满意度, 缺乏一种普遍适用的形式化满意度计算模型. 基于直觉模糊集理论建立了一个普适的多级直觉模糊满意度计算模型; 利用直觉模糊集算子有效地诱导出直觉模糊满意度, 将定性与定量的方法结合起来进行满意度计算, 使计算结果信息量更大, 更加科学合理且自动化程度高. 分析了该模型的计算复杂度, 并结合实例计算了商洛旅游的直觉模糊满意度, 结果显示该模型高效实用.", "num_citations": "13\n", "authors": ["1636"]}
{"title": "Weak commutative pseudoeffect algebras\n", "abstract": " As noncommutative generalizations of effect algebras, we introduce weak commutative pseudoeffect algebras. In this paper, we prove that the generalized pseudoeffect algebras can be unitized if and only if they are weak commutative. Then we discuss the relationships between weak commutative pseudoeffect algebras and weak commutative generalized pseudoeffect algebras. We prove that the category of weak commutative pseudoeffect algebras is a reflective subcategory of weak commutative generalized pseudoeffect algebras. Similarly, we introduce weak commutative pseudodifference posets and show the relationships between weak commutative pseudoeffect algebras and weak commutative pseudodifference posets.", "num_citations": "13\n", "authors": ["1636"]}
{"title": "Approximation and universality of fuzzy Turing machines\n", "abstract": " Fuzzy Turing machines are the formal models of fuzzy algorithms or fuzzy computations. In this paper we give several different formulations of fuzzy Turing machine, which correspond to nondeterministic fuzzy Turing machine using max-⋆ composition for some t-norm ⋆ (or NFTM⋆, for short), nondeterministic fuzzy Turing machine (or NFTM), deterministic fuzzy Turing machine (or DFTM), and multi-tape versions of fuzzy Turing machines. Some distinct results compared to those of ordinary Turing machines are obtained. First, it is shown that NFTM⋆, NFTM, and DFTM are not necessarily equivalent in the power of recognizing fuzzy languages if the t-norm ⋆ does not satisfy finite generated condition, but are equivalent in the approximation sense. That is to say, we can approximate an NFTM⋆ by some NFTM with any given accuracy; the related constructions are also presented. The level characterization of …", "num_citations": "13\n", "authors": ["1636"]}
{"title": "Quantum secret sharing for a general quantum access structure\n", "abstract": " Abstract                  Quantum secret sharing is a procedure for sharing a secret among a number of participants such that only certain subsets of participants can collaboratively reconstruct it, which are called authorized sets. The quantum access structure of a secret sharing is a family of all authorized sets. Firstly, in this paper, we propose the concept of decomposition of quantum access structure to design a quantum secret sharing scheme. Secondly, based on a maximal quantum access structure (MQAS) [D. Gottesman, Phys. Rev. A 61, 042311 (2000)], we propose an algorithm to improve a MQAS and obtain an improved maximal quantum access structure (IMQAS). Then, we present a sufficient and necessary condition about IMQAS, which shows the relationship between the minimal authorized sets and the players. In accordance with properties, we construct an efficient quantum secret sharing scheme …", "num_citations": "12\n", "authors": ["1636"]}
{"title": "Ordering states with Tsallis relative                               α -entropies of coherence\n", "abstract": " In this paper, we study the ordering states with Tsallis relative -entropies of coherence and  norm of coherence for single-qubit states. Firstly, we show that any Tsallis relative -entropies of coherence and  norm of coherence give the same ordering for single-qubit pure states. However, they do not generate the same ordering for some high-dimensional states, even though these states are pure. Secondly, we also consider three special Tsallis relative -entropies of coherence for  and show these three measures and  norm of coherence will not generate the same ordering for some single-qubit mixed states. Nevertheless, they may generate the same ordering if we only consider a special subset of single-qubit mixed states. Furthermore, we find that any two of these three special measures generate different ordering for single-qubit mixed states. Finally, we discuss the degree of violation of between …", "num_citations": "11\n", "authors": ["1636"]}
{"title": "Robustness analysis of logic metrics on F (X)\n", "abstract": " Based on the notion of logic similarity degree, logic metric spaces are constructed on the family of fuzzy subsets of the universe X by means of some regular implication operators. The structures of four specific logic metric spaces induced by four important logic implication operators are discussed and compared. It can be concluded that the logic metrics induced by Łukasiewicz implication and Goguen implication are more beneficial to the robustness analysis of fuzzy reasoning.", "num_citations": "11\n", "authors": ["1636"]}
{"title": "关联规则挖掘的软集包含度方法\n", "abstract": " 本文在深入研究软集数据分析的基础上, 将包含度引入软集数据关联规则挖掘中, 利用包含度理论描述属性集之间的量化关系, 给出软集上属性集间的包含度, 关联规则和最大关联规则的概念, 讨论包含度和可信度之间的联系. 在此基础上给出利用包含度在事务数据软集中挖掘满足给定的支持度和可信度阈值的软关联规则方法, 以及最大软关联规则的提取算法. 理论证明和实例分析表明该关联规则挖掘方法是有效的, 并通过实验对算法的性能进行了比较.", "num_citations": "11\n", "authors": ["1636"]}
{"title": "On countable RCC models\n", "abstract": " Region Connection Calculus (RCC) is the most widely studied formalism of Qualitative Spatial Reasoning. It has been known for some time that each connected regular topological space provides an RCC model. These'standard'models are inevitable uncountable and regions there cannot be represented finitely. This paper, however, draws researchers' attention to RCC models that can be constructed from finite models hierarchically. Compared with those'standard'models, these countable models have the nice property that regions where can be constructed in finite steps from basic ones. We first investigate properties of three countable models introduced by Düuntsch, Stell, Li and Ying, resp. In particular, we show that (i) the contact relation algebra of our minimal model is not atomic complete; and (ii) these three models are non-isomorphic. Second, for each n> 0, we construct a countable RCC model that is a sub …", "num_citations": "11\n", "authors": ["1636"]}
{"title": "Sequential quantum secret sharing using a single qudit\n", "abstract": " In this paper we propose a novel and efficient quantum secret sharing protocol using d-level single particle, which it can realize a general access structure via the thought of concatenation. In addition, Our scheme includes all advantages of Tavakoli's scheme [Phys. Rev. A 92 (2015) 030302 (R)]. In contrast to Tavakoli's scheme, the efficiency of our scheme is 1 for the same situation, and the access structure is more general and has advantages in practical significance. Furthermore, we also analyze the security of our scheme in the primary quantum attacks.", "num_citations": "10\n", "authors": ["1636"]}
{"title": "On two types of continuous information algebras\n", "abstract": " In this paper (strong) continuity of domain-free information algebras and labeled information algebras are introduced. Relationships between domain-free information algebras and labeled information algebras are mainly explored. It is shown that continuity and compactness can be preserved under certain canonical correspondences between domain-free information algebras and labeled information algebras. Some equivalent characterizations and examples for continuous information algebras are also given.", "num_citations": "10\n", "authors": ["1636"]}
{"title": "Dynamics of quantum discord in a quantum critical environment\n", "abstract": " We study the dynamics of quantum discord (QD) of two qubits independently coupled to an Ising spin chain in a transverse field, which exhibits a quantum phase transition. For this model, we drive the corresponding Kraus operators, obtain the analytic results of QD and compare the dynamics of QD with the dynamics of relative entropy of entanglement nearby the critical point. It is shown that the impact of the quantum criticality environment on QD can be concentrated in a very narrow region nearby the critical point, so it supplies an efficient way to detect the critical points. In the vicinity of the critical point, the evolution of QD is shown to be more complicated than that of entanglement. Furthermore, we find that separable states can also be used to reflect the quantum criticality of the environment.", "num_citations": "10\n", "authors": ["1636"]}
{"title": "Computationg tree logic based on possibility measure\n", "abstract": " Firstly, the definition of possibilistic Kripke structure is presented, and the possibility measure space based on it is established. The properties of possibilistic Kripke structure are discussesd, such as the possibility of each path is the infimum of the initial distribution and all of the transisiton possibilities, and the possibility measure which is defined in accordance with the possibilistic Kripke structure is reasonable, etc. Secondly, the possibility computation tree logic (PoCTL) is defined, the equivalence between two PoCTL formulae is studied, and the problems whether some PoCTL formulae are equivalent to some CTL formulae are analyzed. Finally, the persistence property corresponding to PoCTL in CTL* are proved.", "num_citations": "10\n", "authors": ["1636"]}
{"title": "Some results of fuzzy Turing machines\n", "abstract": " In this paper we study the variants of fuzzy Turing machines and universal fuzzy Turing machine. First we give several equivalent formulations of fuzzy Turing machines which correspond to fuzzy deterministic Turing machines (FDTMs), fuzzy nondeterministic Turing machines (FNTMs) and multitape fuzzy Turing machines. Then the notions of fuzzy recursively enumerable languages and fuzzy recursive languages are defined in terms of FDTMs. The level characterizations of fuzzy recursively enumerable languages and fuzzy recursive languages are exploited. Second, we show that there is no universal fuzzy Turing machine that can simulate any fuzzy Turing machine on it. Finally, we propose the notion of complexity classes of fuzzy languages by using the time-bounded fuzzy Turing machines. In particular, the notions of fuzzy polynomial time-bounded computation (FP) and fuzzy nondeterministic polynomial time …", "num_citations": "10\n", "authors": ["1636"]}
{"title": "On the complemented disk algebra\n", "abstract": " The importance of relational methods in temporal and spatial reasoning has been widely recognised in the last two decades. A quite large part of contemporary spatial reasoning is concerned with the research of relation algebras generated by the “part of” and “connection” relations in various domains. This paper is devoted to the study of one particular relation algebra appeared in the literature, viz. the complemented disk algebra. This algebra was first described by Düntsch [I. Düntsch, A tutorial on relation algebras and their application in spatial reasoning, Given at COSIT, August 1999, Available from: <http://www.cosc.brocku.ca/~duentsch/papers/relspat.html>] and then, Li et al. [Y. Li, S. Li, M. Ying, Relational reasoning in the Region Connection Calculus, Preprint, 2003, Available from: http://arxiv.org/abs/cs/0505041] showed that closed disks and their complements provides a representation. This set of regions is …", "num_citations": "10\n", "authors": ["1636"]}
{"title": "对偶 Quantale 及其性质\n", "abstract": " 提出了对偶quantale的概念,研究了对偶quantale的性 质及其构造.利用quantale上的nucleus与余nucleus算子,给出了任一quantale的对偶quan tale商的完全构造及quantale上的开模态词的特别构造.研究表明,对偶quantale是非可换 quantale中的布尔代数.", "num_citations": "10\n", "authors": ["1636"]}
{"title": "Exponentiable objects in the category of topological molecular lattices\n", "abstract": " If C is any category with finite products, an object X of C is said to be exponentiable (or cartesian) if the functor ()× X has a right adjoint. The aim of this paper is to characterize the exponentiable objects in the category TML of topological molecular lattices. The main result of this paper is that a topological molecular lattice (L, η) is exponentiable in TML iff η op is a continuous lattice.", "num_citations": "10\n", "authors": ["1636"]}
{"title": "Approximate bisimulation relations for fuzzy automata\n", "abstract": " In this paper, for an ultra-metric D on the unit interval and a small positive real number , we firstly define the concept of approximate bisimulation relations between two fuzzy automata and prove that the behavior of a fuzzy automaton  differs by  from the behavior of a fuzzy automaton  under an approximate bisimulation relation between them. Then we put forward the notion of surjective functional approximate bisimulation relations between two fuzzy automata. A connection between surjective functional approximate bisimulation relations between two fuzzy automata  and  and approximate bisimulation relations for  is also discussed. Finally, we give a method to construct the greatest approximate bisimulation relation for a fuzzy automaton and point out that bisimulation relations for a fuzzy automaton are also approximate bisimulation relations.", "num_citations": "9\n", "authors": ["1636"]}
{"title": "Multiparty quantum direct secret sharing of classical information with bell states and bell measurements\n", "abstract": " This paper proposed a new and efficient multiparty quantum direct secret sharing (QDSS) by using swapping quantum entanglement of Bell states. In the proposed scheme, the quantum correlation between the possible measurement results of the members (except dealer) and the original local unitary operation encoded by the dealer was presented. All agents only need to perform Bell measurements to share dealer’s secret by recovering dealer’s operation without performing any unitary operation. Our scheme has several advantages. The dealer is not required to retain any photons, and can further share a predetermined key instead of a random key to the agents. It has high capacity as two bits of secret messages can be transmitted by an EPR pair and the intrinsic efficiency approaches 100%, because no classical bit needs to be transmitted except those for detection. Without inserting any checking sets …", "num_citations": "9\n", "authors": ["1636"]}
{"title": "-Bisimulation Relations for Fuzzy Automata\n", "abstract": " This paper investigates the approximate bisimulation relations for fuzzy automata in order to study the approximate minimization problem of fuzzy automata. For a small positive real number ∈, we introduce the notion of ∈-bisimulation relations between two fuzzy automata, and prove that the behavior of a fuzzy automaton A differs by ∈ from the behavior of a fuzzy automaton B under a ∈-bisimulation relation between them. Also, the notion of surjective functional ∈-bisimulation relations between two fuzzy automata is defined. According to surjective functional ∈-bisimulation relations, we discuss ∈-bisimulation relations for a fuzzy automaton. A construction of aggregated fuzzy automaton by the given ∈-bisimulation for a fuzzy automaton is given. Furthermore, we find that there might not exist the greatest ∈-bisimulation relation for a fuzzy automaton, and we novelly give an effective algorithm to construct all …", "num_citations": "9\n", "authors": ["1636"]}
{"title": "基于量子逻辑的有穷自动机与单体二阶量子逻辑\n", "abstract": " 文中引入了单体二阶量子逻辑, 进而给出了基于量子逻辑的有穷自动机识别语言的逻辑描述, 证明了量子逻辑意义下的 B (u|) chi-Elgot 基本定理. 通过引入星-自由量子语言与非周期量子语言, 完全刻画了可以用一阶量子逻辑定义的量子语言, 得到了量子逻辑意义下的 Sch (u|) tzenberger 分类定理. 另外, 通过引入广义的子集构造方法, 还给出了基于量子逻辑的有穷自动机的确定化形式, 进而研究了基于量子逻辑的 Kleene 定理的表现形式.", "num_citations": "9\n", "authors": ["1636"]}
{"title": "Restricted (k, n)-threshold quantum secret sharing scheme based on local distinguishability of orthogonal multiqudit entangled states\n", "abstract": " In this work, we study a restricted (k, n)-threshold access structure. According to this structure, we construct a group of orthogonal multipartite entangled states in d-dimensional system and investigate the distinguishability of these entangled states under restricted local operations and classical communication. Based on these properties, we propose a restricted (k, n)-threshold quantum secret sharing scheme (called LOCC-QSS scheme). The k cooperating players in the restricted threshold scheme come from all disjoint groups. In the proposed protocol, the participants distinguish these orthogonal states by the computational basis measurement and classical communication to reconstruct the original secret. Furthermore, we also analyze the security of our scheme in three primary quantum attacks and give a simple encoding method in order to better prevent the participant conspiracy attack.", "num_citations": "8\n", "authors": ["1636"]}
{"title": "Generalised monogamy relation of convex-roof extended negativity in multi-level systems\n", "abstract": " In this paper, we investigate the generalised monogamy inequalities of convex-roof extended negativity (CREN) in multi-level systems. The generalised monogamy inequalities provide the upper and lower bounds of bipartite entanglement, which are obtained by using CREN and the CREN of assistance (CRENOA). Furthermore, we show that the CREN of multi-qubit pure states satisfies some monogamy relations. Additionally, we test the generalised monogamy inequalities for qudits by considering the partially coherent superposition of a generalised W-class state in a vacuum and show that the generalised monogamy inequalities are satisfied in this case as well.", "num_citations": "8\n", "authors": ["1636"]}
{"title": "Remark on the one-way quantum deficit for general two-qubit states\n", "abstract": " We reinvestigate the one-way quantum deficit, which is a measure of quantum correlation emerging from a thermodynamical approach. We give a tight upper bound of the one-way quantum deficit for general mixed states, and give a sufficient condition for this bound. Finally, we discuss a universal way to evaluate the one-way quantum deficit for general two-qubit states.", "num_citations": "8\n", "authors": ["1636"]}
{"title": "The pasting constructions of lattice ordered effect algebras\n", "abstract": " The aim of this paper is to present some ways of constructing a lattice ordered effect algebra from the given family of MV-algebras. The loop lemma of lattice ordered effect algebras is proved. Then the definitions of Greechie diagrams of effect algebras are given. All these results have generalized those of orthomodular lattices. As applications of loop lemma and Greechie diagrams, some lattice ordered effect algebras without states are presented.", "num_citations": "8\n", "authors": ["1636"]}
{"title": "Decomposition and Resolution of θ-Fuzzy Relation Equations [J]\n", "abstract": " In this paper, decomposition of θ-Fuzzy relation equations is first given in a finite case. Then, for NR-implications, the resolution problem of θ-Fuzzy relation equations is discussed, and some new solvability criteria based upon ″solution matrices ″are studied. In the paper it is shown that for each r∈ S (A, b), there exists a maximal element r~*∈ S (A, b), such that r~*≥ r is given, when the solution set S (A, b) of θ-Fuzzy relation equation A~ θ r= b is unempty.[Fund]: 国家自然科学基金资助项目 (6 0 174 0 16);; 高等学校优秀青年教师教学科研奖励计划资助项目;; 国家重点基础研究发展计划 (973) 资助项目 (2 0 0 2 CB312 2 0 0)", "num_citations": "8\n", "authors": ["1636"]}
{"title": "Projective and injective objects in the category of quantales\n", "abstract": " Regular projective quantales are characterized as the weakly∗-stable completely distributive lattices. For the class E of all onto quantale homomorphisms whose right adjoints preserve multiplication∗, it is proved that E-projective quantales are exactly weakly∗-stable completely distributive lattices. It is also proved that there are no nontrivial injective objects in the category of quantales.", "num_citations": "8\n", "authors": ["1636"]}
{"title": "Constructive insertion theorems and extension theorems on extremally disconnected frames\n", "abstract": " Constructive insertion theorems and extensions theorems on extremally disconnected frames are proved. As a consequence, constructive Eilenberg-Steenrod-Taimanov extension theorem is presented.", "num_citations": "8\n", "authors": ["1636"]}
{"title": "L—Fuzzy 闭图象与强闭图象理论\n", "abstract": " 本文通过引入层(强)闭图,层(弱)连续,H闭空间等概念,证明了层(强)闭图定理,对良紧性与H-闭性给出了层闭投射式与层闭图式刻划,较完善地给出了L-Fuzzy闭图与强闭图理论.", "num_citations": "8\n", "authors": ["1636"]}
{"title": "Computation tree logic model checking based on multi-valued possibility measures\n", "abstract": " Multi-valued model checking has been studied extensively recently, but important uncertain information contained in systems of multi-valued logics has not been considered in previous work and, as a consequence, some serious deficiencies arise. To make up for these deficiencies, this paper considers the possibility information implied in multi-valued systems. Precisely, we investigate computation tree logic model checking based on multi-valued possibility measures. We model multi-valued logic systems by multi-valued Kripke structures (MvKSs) and specify their verification properties by multi-valued computation tree logic (MvCTL) formulae. Based on generalized possibility measures and generalized necessity measures, an MvCTL model checking method is proposed, the pseudocode of the corresponding model checking algorithm is presented, and its time complexity is analyzed in detail. Furthermore, after …", "num_citations": "7\n", "authors": ["1636"]}
{"title": "Fuzzy alternating automata over distributive lattices\n", "abstract": " Nondeterminism gives computation models the power of existential choice. As a generalization of nondeterminism, “alternation” gives computation models the power of existential choice and universal choice simultaneously. In this paper, we extend fuzzy nondeterministic automata to a model called fuzzy alternating automata over distributive lattices. Compared with the previous work, a weight labels a leaf node of the run tree rather than be involved in the edge between states when executing a transition. One advantage of our setting is that it is easy to complement a given fuzzy alternating automaton. It suffices to take the dual operation on the transition function and negate final costs on states. Moreover, we show that fuzzy alternating automata have the same expressive power as fuzzy nondeterministic automata, and the former ones are exponentially more succinct than the latter ones. In addition, we illustrate that …", "num_citations": "7\n", "authors": ["1636"]}
{"title": "Reachability in fuzzy game graphs\n", "abstract": " Two-player turn-based games on graphs (or game graphs for short) and their probabilistic versions have received increasing attention in computer science, especially in the formal verification of reactive systems. However, in the fuzzy setting, game graphs are yet to be addressed, although some practical applications, such as modeling fuzzy systems that interact with their environments, appeal to such models. To fill the gap, in this paper, we propose a fuzzy version of game graphs and focus on the fuzzy game graphs with reachability objectives, which we will refer to as fuzzy reachability games (FRGs). In an FRG, the goal of one player is to maximize her truth value of reaching a given target set, while the other player aims at the opposite. In this framework, we show that FRGs are determined in the sense that for every state, both of the two players have the same value, and there exist optimal memoryless strategies …", "num_citations": "7\n", "authors": ["1636"]}
{"title": "可能性测度下计算树逻辑的若干性质\n", "abstract": " 为讨论可能的计算树逻辑(PoCTL)与计算树逻辑(CTL)的关系,给出PoCTL公式与CTL公式等价的概念,利用公式的等价性证明了CTL是PoCTL的一个真子集.通过PoCTL模型检测算法与PoCTL公式的分析,解决了PoCTL模型检测的时间复杂度问题.最后对重复事件与持久性事件的定性性质及定量性质进行研究,用实例验证了CTL公式与PoCTL公式在可能性测度与概率测度下的本质区别.", "num_citations": "7\n", "authors": ["1636"]}
{"title": "Dynamic brain magnetic resonance image registration based on inheritance idea and PSO\n", "abstract": " Brain magnetic resonance (MR) image registration is an important part of brain MR image registration. Practically, there are many images needing to be registered at same time and the requirement for time cost is high. The current image registration methods register images one by one independently, so the methods are called static image registration methods. The methods are time consuming since they need to randomly initialize the relevant parameters before they start to register some image, so they can not meet the requirement of the practical applications for time cost. Through statistical research, we find the differences of the brain MR images are limited due to some reasons such as similar poses, similar brain structures and so on. So, we proposed one dynamic brain MR image registration algorithm combining inheritance idea and PSO. The algorithm can inherit the information of the former image's …", "num_citations": "7\n", "authors": ["1636"]}
{"title": "基于量子逻辑的下推自动机与上下文无关文法\n", "abstract": " 给出基于量子逻辑的下推自动机 (i-VPDA) 的概念, 提出广义的子集构造方法, 进而证明了一般的 i-VPDA 与状态转移为分明函数且具有量子终态的 i-VPDA 的等价性. 利用此等价性, 给出了量子上下文无关语言的代数刻画与层次刻画, 并籍此证明了量子上下文无关语言关于正则运算的封闭性. 最后, 说明了量子下推自动机和量子上下文无关文法 (i-VCFG) 的等价性.", "num_citations": "7\n", "authors": ["1636"]}
{"title": "计量逻辑学中的近似推理\n", "abstract": " 在多值逻辑系统中给出了计量逻辑学中单个公式到Γ结论集的距离公式,在此基础上,给出发散度的简化形式,讨论了计量逻辑学中三种近似推理模式之间的关系.", "num_citations": "7\n", "authors": ["1636"]}
{"title": "Soft set based approximate reasoning: A quantitative logic approach\n", "abstract": " Soft set theory is a newly emerging mathematical approach to vagueness. However, it seems that there is no existing research devoted to the discussion of applying soft sets to approximate reasoning. This paper aims to initiate an approximate reasoning scheme based on soft set theory. We consider proposition logic in the framework of a given soft set. By taking parameters of the underlying soft set as atomic formulas, the concept of (well-formed) formulas over a soft set is defined in a natural way. The semantic meaning of formulas is then given by taking objects of the underlying soft set as valuation functions. We propose the notion of decision soft sets and define decision rules as implicative type of formulas in decision soft sets. Motivated by basic ideas from quantitative logic, we also introduce several measures and preorders to evaluate the soundness of formulas and decision rules in soft sets. Moreover …", "num_citations": "7\n", "authors": ["1636"]}
{"title": "模糊有穷自动机与单体二阶 Lukasiewicz 逻辑\n", "abstract": " 该文引入了单体二阶Lukasiewicz逻辑,进而给出了模糊有穷自动机识别语言的逻辑描述,证明了多值逻辑意义下的Buchi与Elgot基本定理.通过引入星-自由模糊语言与非周期模糊语言,刻画了可以用一阶Lukasiewicz逻辑定义的模糊语言.", "num_citations": "7\n", "authors": ["1636"]}
{"title": "格值 Mealy 自动机的同余和同态\n", "abstract": " 提出格值Mealy自动机的概念,从代数角度出发详细研究此类自动机的性质,同时研究此类自动机的同余和同态,揭示此类自动机的代数性质和取值格半群的紧密联系,最终研究格值Mealy自动机的极小化,给出可在有限步实现极小化的算法.", "num_citations": "7\n", "authors": ["1636"]}
{"title": "几类格值自动机的关系\n", "abstract": " 本文给出了四类格值自动机及其语言的定义,证明了前三类格值自动机的等价性,讨论了第四类格值自动机与前三类格值自动机的关系.", "num_citations": "7\n", "authors": ["1636"]}
{"title": "两类具有输出字符功能的模糊自动机的关系\n", "abstract": " 在文中,对文献[8]中介绍的具有输出字符功能的模糊自动机和模糊有限状态自动机的定义作了修改,并对它们进行了系统的研究,揭示了此两类自动机和取分配格的代数性质的紧密联系;得到了此两类自动机在:(1)强等价;(2)等价;(3)弱等价条件下的许多重要结论.", "num_citations": "7\n", "authors": ["1636"]}
{"title": "Relational reasoning in the region connection calculus\n", "abstract": " This paper is mainly about the relation algebraical aspects of the well-known Region-Connection Calculus (RCC). RCC is a first order theory based on a primitive connection. We show that the relation algebra generated by the connection on certain RCC model is infinite, so RCC accommodates no extensional with finite base which refines the RCC8 relations. A complete analysis of the extensionality of the RCC11 weak composition table established by Düntsch is given. We also show that the relation algebra determined by the RCC11 weak composition table can be represented by the complemented circle algebra introduced in this paper. An important approach to reduce the calculation work of determining a composition table is proposed. Using this approach, the work needed can be reduced to 1/8 of that by the cell-by-cell approach. Some problems posed by Bennett and Düntsch are also answered.", "num_citations": "7\n", "authors": ["1636"]}
{"title": "Limit structures over completely distributive lattices\n", "abstract": " The notion of a limit molecular lattice—a completely distributive lattice with some kinds of convergence of ideals on it—is introduced. It is proved that the category of limit molecular lattices is a cartesian closed category containing the category of topological molecular lattices as a bireflective full subcategory and the category of limit spaces as a reflective and coreflective subcategory, respectively. Noteworthy is the distinctive order property of the convergence of ideals on the limit molecular lattice compared to that of limit spaces. The L-fuzzy version of fuzzy limit space is introduced, and it is proved that the category of L-fuzzy limit spaces is a nonfull coreflective subcategory of the category of limit molecular lattices.", "num_citations": "7\n", "authors": ["1636"]}
{"title": "一种基于语言变量的 MCDM 问题的决策方法\n", "abstract": " 基于语言变量的MCDM(Multi-Criteria/Multi-Person Decision-Making)问题的解决可分为三部分:(1)选择合适的语言变量集合;(2)选择恰当的聚合算子;(3)选择最佳备选方案,本文第三部分提出语言模糊集截集方法,通过语言模糊截集方法和LOWA算子的混合使用,不仅能决策出最佳备选方案,而且可以给出备选方案间的一个排序,最后给出两个实例.", "num_citations": "7\n", "authors": ["1636"]}
{"title": "Top is a reflective and coreflective subcategory of fuzzy topological spaces\n", "abstract": " It is proved that the category Top of topological spaces is a mono-reflective and epi-coreflective subcategory of fuzzy topological spaces in the sense of Hutton.", "num_citations": "7\n", "authors": ["1636"]}
{"title": "Generalized (S, I)-complete Free Completely Distributive Lattices Generated by Posets.\n", "abstract": " In this paper, some kinds of very extensive free completely distributive lattices generated by posers are constructed, they generalize some well known results of free objects in completely distributive lattices and take them in a universal form.", "num_citations": "7\n", "authors": ["1636"]}
{"title": "Weak locale quotient morphisms and locally connected frames\n", "abstract": " Weak locale quotient morphisms between frames are defined, and it is proved that local connectedness of frames is preserved under weak locale quotient morphisms, without any form of choice principle. This provides affirmative answers to problems posed by Baboolal and Banaschewski (1991) and by Chen (1992).", "num_citations": "7\n", "authors": ["1636"]}
{"title": "Minimization of lattice multiset finite automata\n", "abstract": " In this paper, we study the minimization of lattice-valued multiset finite automata with membership values in a distributive lattice. First, we establish the equivalence of (nondeterministic) lattice multiset finite automata (LMA) and deterministic lattice multiset finite automata (DLMA). Furthermore, we present some operations on lattice-valued regular multiset languages, and prove that the family of lattice-valued regular multiset languages is closed under this operations. We also introduce and study the minimal DLMAs and present an effective algorithm to obtain a minimal DLMA for a given LMA. Finally, we give a decomposition of lattice-valued regular multiset language by some simple lattice-valued regular multiset languages accepted by some special minimal DLMAs.", "num_citations": "6\n", "authors": ["1636"]}
{"title": "Model checking generalized possibilistic computation tree logic based on decision processes\n", "abstract": " We study model-checking generalized possibilistic computation tree logic (GPoCTL) and its application in system verification, in particular, nondeterministic systems. Firstly, we introduce generalized possibilistic decision-making processes (GPDP) as system models and GPoCTL formulae under GPDP to describe the properties of the system. Then, we provide a model-checking algorithm for GPoCTL. The main advantage of the algorithm is that it can use scheduling in the decision making processes to convert the model-checking problem into operations of the fuzzy matrix or fixed point of fuzzy matrix functions, which need polynomial time. Finally, an example is given to illustrate the application of the model-checking generalized possibilistic computation tree logic in verification of a nondeterministic system.", "num_citations": "6\n", "authors": ["1636"]}
{"title": "The realization problems related to weighted transducers over strong bimonoids\n", "abstract": " In this paper, the concepts of weighted transducers over strong bimonoids and their input-output-functions are introduced. Further more, the input-functions and output-functions induced by the input-output-functions of weighted transducers over strong bimonoids are given. It is the most important that the input-functions and output-functions of weighted transducers over strong bimonoids can be realized by weighted finite automata over strong bimonoids, and the realization does not depend on the distributive law, which also embodies the applications of weighted finite automata over strong bimonoids.", "num_citations": "6\n", "authors": ["1636"]}
{"title": "Pairwise quantum correlations for superpositions of dicke states\n", "abstract": " Pairwise correlation is really an important property for multi-qubit states. For the two-qubit X states extracted from Dicke states and their superposition states, we obtain a compact expression of the quantum discord by numerical check. We then apply the expression to discuss the quantum correlation of the reduced two-qubit states of Dicke states and their superpositions, and the results are compared with those obtained by entanglement of formation, which is a quantum entanglement measure.", "num_citations": "6\n", "authors": ["1636"]}
{"title": "模糊图灵机的逼近性与通用性\n", "abstract": " 模糊图灵机是模糊算法或模糊计算的形式模型.文中研究了模糊图灵机的几种变形,这包括基于max-★复合运算的非确定型模糊图灵机(简写为NFTM★,其中★为t-模),非确定型模糊图灵机(简写为NFTM),确定型模糊图灵机(简写为DFTM),以及这些变形的多带版本.得到了以下一些结论:第1,若t-模★不满足有限生成条件,则NFTM★,NFTM和DFTM一般不等价,这里等价指的是识别相同的模糊语言.但在逼近意义下等价,也即,NFTM★可以被NFTM以任意精度逼近,并给出了相关的构造.引入了模糊递归可枚举语言与模糊递归语言的概念,并利用递归可枚举语言与递归语言对其进行层次刻画.第2,如果限制NFTM★的模糊隶属函数的取值域为单位区间[0,1]的一个固定的有限子集D3则存在通用模糊图灵机,用该通用模糊图灵机可以模拟上述类型的限制型模糊图灵机.一般地,通用模糊图灵机在逼近意义下存在,该通用模糊图灵机可以以给定精度模拟任意类型的模糊图灵机.", "num_citations": "6\n", "authors": ["1636"]}
{"title": "拓扑分子格范畴与相关范畴的关系\n", "abstract": " 数理统计与管理 数理统计与管理 本刊为统计学学术期刊. 刊登数理统计, 应用概率, 运筹学及经济数学方法等方面的研究成果及其在工业生产, 管理, 科研, 农医生物等领域中的应用成果. 主要栏目有: 应用成果, 方法的探讨与研究, 软件的学习与应用, 争鸣与...... 详细", "num_citations": "6\n", "authors": ["1636"]}
{"title": "Inequivalent multipartite coherence classes and two operational coherence monotones\n", "abstract": " Quantum coherence has received significant attention in recent years, but the structure of multipartite coherent states is unclear. In this paper, we generalize important results in multipartite entanglement theory to their counterparts in quantum coherence theory. First, we give a necessary and sufficient condition for when two pure multipartite states are equivalent under local incoherent operations assisted by classical communications (LICC), ie, two states can be deterministically transformed to each other under LICC operations. Next, we investigate and give the conditions in which such a transformation succeeds only stochastically. Different from the entanglement case for two-qubit states, we find that the stochastic LICC (sLICC) equivalence classes are infinite. Moreover, it is possible that there are some classes of states in multipartite entanglement that can convert into each other, whereas they cannot convert into …", "num_citations": "5\n", "authors": ["1636"]}
{"title": "Entropic cohering power in quantum operations\n", "abstract": " Coherence is a basic feature of quantum systems and a common necessary condition for quantum correlations. It is also an important physical resource in quantum information processing. In this paper, using relative entropy, we consider a more general definition of the cohering power of quantum operations. First, we calculate the cohering power of unitary quantum operations and show that the amount of distributed coherence caused by non-unitary quantum operations cannot exceed the quantum-incoherent relative entropy between system of interest and its environment. We then find that the difference between the distributed coherence and the cohering power is larger than the quantum-incoherent relative entropy. As an application, we consider the distributed coherence caused by purification.", "num_citations": "5\n", "authors": ["1636"]}
{"title": "Fuzzy alternating Büchi automata over distributive lattices\n", "abstract": " Alternation was first proposed by Chandra et al. for obtaining a theoretical model of parallel computations. Compared with nondeterminism, alternation gives computing devices the power of universal choice in addition to existential choice. In this paper, we put forward a notion of fuzzy alternating Büchi automata over a distributive lattice L (L-ABAs, for short). In our setting, a weight is the label of a leaf node of the run tree when executing a transition, which is helpful in complementing L-ABAs. Taking the dual operation on the transition function and negating final costs on states, we can get the complement of a given L-ABA. We point out that L-ABAs have the same expressive power as L-valued fuzzy nondeterministic Büchi automata (L-NBAs). A construction presented here shows that languages accepted by L-valued fuzzy alternating co-Büchi automata (L-ACAs) are also ω-regular languages. Moreover, closure …", "num_citations": "5\n", "authors": ["1636"]}
{"title": "Automatic knee cartilage segmentation using multi-feature support vector machine and elastic region growing for magnetic resonance images\n", "abstract": " In this paper, a method of segmenting cartilage region from knee magnetic resonance images in vivo is presented. The scheme involved bone-cartilage interface edges location and elastic region growing. Firstly, the bone edges were obtained by modified adaptive canny edge detection and multi-feature support vector machine classifier. The accurate bone-cartilage interface edges were achieved by optimizing the bone edges. Subsequently, the seeds and candidate regions were chosen based on the bone-cartilage interface edges and the preliminary segmentation of articular cartilages were achieved by using the elastic region growing. Finally, the anatomic knowledge and morphology were used to improve the primary segmentation results. Anatomical knowledge was used to distinguish the overlapped cartilage parts, and morphology was used to optimize the results. The proposed automatic segmentation …", "num_citations": "5\n", "authors": ["1636"]}
{"title": "Entropic characterization of coherence in quantum evolutions\n", "abstract": " By using relative entropy of coherence, we characterize the coherence gain induced by some quantum evolutions, including the cohering power of unitary operations and the decohering power of quantum operations. We find that the cohering power of the controlled unitary operation can be reduced to the cohering power of the corresponding unitary operation. We observe that the global coherence generated via incoherent operation applied to the system and an incoherent ancilla do not exceed the amount of coherence contained in the initial system. Our result provides a much tighter lower bound of coherence for the initial quantum state, and give an interesting chain of inequalities for coherence, quantum correlation and entanglement. We also strengthen the relations between quantum correlations and coherence.", "num_citations": "5\n", "authors": ["1636"]}
{"title": "可能 LTL 模型检测的两种方法\n", "abstract": " 引入了基于广义可能性测度 LTL 模型检测的基于路径和基于语言的两种语义, 证明了其等价性. 基于可能 LTL 公式语言等价的方法, 给出基于广义可能性测度的 LTL 模型检测的算法和复杂性分析.", "num_citations": "5\n", "authors": ["1636"]}
{"title": "多处理器任务调度算法 TDS 的建模与验证\n", "abstract": " 摘 要 在 多处理器系统中, 一个应用所要完成的任务可以分配给同一个处理器处理, 也可以分配给多个处理器处理, 所以传统的测试方法难以满足多处理器任务调度算法的验证. 在此, 提出一个基于扩展 Btichi 自动机的形式化模型, 并用该模型来描述多处理器任务调度算法 TDS (TaskDuplicationbasedScheduling); 用线性时序逻辑描述出算法 TDS 期望的一些性质; 最后在该模型上验证了这些性质. 该方法有效地克服了传统测试的局限性, 保证了多处理器任务调度的可靠性.", "num_citations": "5\n", "authors": ["1636"]}
{"title": "MODEL-CHECKING OF LINEAR-TIME PROPERTIES IN POSSIBILISTIC KRIPKE STRUCTURE\n", "abstract": " Firstly, we define the possibilistic Kripke structure based on possibility measure and establish the model checking of Linear Temporal Logic (LTL) using possibilistic Kripke structure. Secondly, we discuss linear-time (LT) properties in possibilistic Kripke structure, introduce the presentation of possibility measure of possible Kripke structure meeting safety property and ω regular property, then give some calculation method related to the above Linear-time properties. Finally, we thoroughly study the verification of safety property and ω regular property using automata.", "num_citations": "5\n", "authors": ["1636"]}
{"title": "Generalized intuitionistic fuzzy soft sets and multiattribute decision making\n", "abstract": " Both Fuzzy set theory and rough set theory are effective tools in dealing with uncertainty problems. However, these theories have their own inherent limitation, which is the inadequacy of the parameterizations tool. Soft set theory is a new mathematical tool in dealing with uncertainties which is free from the above difficulties. Soft set can deal with broader uncertain problems by the combination of them. The present paper aims to further generalize intuitionistic fuzzy soft sets and investigate their application in multiattribute decision making. A new soft computing model called generalized intuitionistic fuzzy soft sets is defined and some related properties are investigated. This new model could give approximate description of concerned objects in an intuitionistic fuzzy environment, together with some additional information on the weights of attributes. We consider the application of generalized intuitionistic fuzzy soft sets …", "num_citations": "5\n", "authors": ["1636"]}
{"title": "单道批处理系统的建模与验证\n", "abstract": " 摘 要 单道批处理系统的模型是其性能评价, 仿真, 作业调度及控制的研究基础. 建立了单道批处理 系统的一个数学模型一 批处理自动机, 并给出了相应的转换算法, 将所建数学模型转换成 Kripke 结构; 完成了基于 Kripke 结构的单道批处理系统模型检测, 验证了单道批处理系统的合理性即兼顾公平性与效率.", "num_citations": "5\n", "authors": ["1636"]}
{"title": "软集决策信息系统的属性约简\n", "abstract": " 粗集和软集在解决不确定的问题的决策分析过程中,属性约简是关键和棘手的问题.与籼集理论相比较.利用软集方法能够有效地简化决策过程.决策信息系统用软集形式表示,用软集处理粗集理论中的等价关系,进行有效的属性约简,给出一个属性真度的概念作为反映条件属性重要性的函数,在此基础上给出一种适合软集属性约简的启发式算法,通过分析和实例证明该软集属性约简方法,简化约简过程,降低运算的复杂度.", "num_citations": "5\n", "authors": ["1636"]}
{"title": "基于可能性测度的计算树逻辑\n", "abstract": " 首先,提出了可能的Kripke结构的定义,建立了可能的Kripke结构的可能性测度空间,并分析了可能的Kripke结构的一系列性质,即任一路径转移的可能性可由其初始状态的可能性分布与各转移的可能性取下确界而得到;依据可能的Kripke结构所定义的可能性测度具有其合理性等等.其次,给出了可能性计算树逻辑(PoCTL)的概念,讨论了两个PoCTL状态公式以及PoCTI.与经典计算树逻辑(CTL)公式的等价性.最后,证明了PoCTI.公式有与CTL*公式中“一致性”相对应的公式.", "num_citations": "5\n", "authors": ["1636"]}
{"title": "部分可换半群的子代数与同余关系\n", "abstract": " 讨论了部分可换半群的子代数与同余关系之间的关系,进一步研究部分可换半群的商代数的结构.证明了部分可换半群上的Riesz子代数可诱导出满足消去律的同余关系,且通过此同余关系得到的商代数是满足正律的.", "num_citations": "5\n", "authors": ["1636"]}
{"title": "The Theory of L-Fuzzy Closed Graph and Strong Closed Graph [J]\n", "abstract": " In this parer, the concepts of level-(strong-) closed graph,(weak) level continuous, H-closed space were introduced, the theorems of level (strong) closed graph and the characterizations of nice compactness and H-closedness by level-closed graph and level-closed projection were given, thus the theory of L-Fuzzy closed graph and strong closed graph was shown here fully.", "num_citations": "5\n", "authors": ["1636"]}
{"title": "Tighter monogamy and polygamy relations in multiqubit systems\n", "abstract": " Abstract                  In this paper, we investigate some monogamy and polygamy relations in terms of concurrence, Rényi α-entropy entanglement and Tsallis q-entropy entanglement. Those relations are tighter than the existing monogamy and polygamy relations. As application, we give some examples in detail.                                                Graphical abstract", "num_citations": "4\n", "authors": ["1636"]}
{"title": "Hierarchical polygamy inequality for entanglement of Tsallis q-entropy\n", "abstract": " In this paper, we study the polygamy inequality of quantum entanglement in terms of Tsallis q-entropy. We first give a lower bound of Tsallis q-entropy entanglement of assistance (TOA) in the 2⊗ d systems. The relation-ships between Tsallis q-entropy entanglement (TEE) and TOA are also given. Furthermore, we prove TOA follows a hierarchical polygamy inequality in a 2⊗ 2⊗ 2 N− 2 systems.", "num_citations": "4\n", "authors": ["1636"]}
{"title": "On tree-preserving constraints\n", "abstract": " The study of tractable subclasses of constraint satisfaction problems is a central topic in constraint solving. Tree convex constraints are extensions of the well-known row convex constraints. Just like the latter, every path-consistent tree convex constraint network is globally consistent. However, it is NP-complete to decide whether a tree convex constraint network has solutions. This paper studies and compares three subclasses of tree convex constraints, which are called chain-, path-, and tree-preserving constraints respectively. The class of tree-preserving constraints strictly contains the subclasses of path-preserving and arc-consistent chain-preserving constraints. We prove that, when enforcing strong path-consistency on a tree-preserving constraint network, in each step, the network remains tree-preserving. This ensures the global consistency of consistent tree-preserving networks after enforcing strong …", "num_citations": "4\n", "authors": ["1636"]}
{"title": "量子马尔可夫链安全性模型检测\n", "abstract": " 本文定义了量子线性时间属性, 包括量子安全性, 量子不变性, 讨论了它们的关系和性质. 结合测量一次, 测量多次的单向量子有穷自动机, 构建了两类乘积量子马尔可夫链, 提出了基于自动机技术的量子正则安全性检测方法. 通过验证乘积量子马尔可夫链的可达终状态来判断量子正则安全性的可满足性, 并给出了可满足性的概率计算公式. 作为应用, 分析了广义量子 loop 程序, 将程序终止归结为验证量子正则安全性的可满足性.", "num_citations": "4\n", "authors": ["1636"]}
{"title": "Monogamy of measurement-induced nonlocality based on relative entropy\n", "abstract": " In this paper, using relative entropy, we study monogamous properties of measurement-induced nonlocality based on relative entropy. Depending on different measurement sides, we provide necessary and sufficient conditions for two types of monogamy inequalities. By the concept of nonlocality monogamy score, we find a necessary condition of the vanished nonlocality monogamy score for arbitrary three-party states. In addition, two types of necessary and sufficient conditions of the vanished nonlocality monogamy scores are obtained for any pure states. As an application, we show that measurement-induced nonlocality based on relative entropy can be viewed as a\" nonlocality witness\" to distinguish generalized GHZ states from the generalized W states.", "num_citations": "4\n", "authors": ["1636"]}
{"title": "An approach to association rules mining using inclusion degree of soft sets\n", "abstract": " This paper aims to present an approach for mining regular association rules and maximal association rules using soft set and inclusion degree theory from transactional datasets. We first give the notions of inclusion degree, association rule and maximum association rules between attribute sets of soft set. Then we discuss the relationship between inclusion degree and confidence. Furthermore, we give an algorithm of soft maximal association rules mining using inclusion degree of soft set. The experiments show the algorithm improves greatly the performance of maximal association rules mining.", "num_citations": "4\n", "authors": ["1636"]}
{"title": "广义量子 Loop 程序的若干性质\n", "abstract": " 本文首先就广义量子 loop 程序 (简记为 GQLoop) 的主体由比特翻转, 去极化, 幅值阻尼, 相位阻尼等信道描述时, 对它的终止 (几乎终止) 问题进行了研究. 其次, 讨论了两类 GQLoop 程序相互嵌套时 loop 程序的终止 (几乎终止) 的问题. 研究表明: 以量子运算的嵌套为主体的 GQLoop 程序终止 (几乎终止) 的条件依赖于刻画量子信道的参数. 最后, 当开放量子系统与其环境在酉运算下做为 loop 程序的主体时, 讨论了在酉运算后去掉环境时的主系统上量子程序的执行过程.", "num_citations": "4\n", "authors": ["1636"]}
{"title": "Turing machines based on quantum logic and their universality\n", "abstract": " Automata theory based on quantum logic is an important aspect of the quantum computing models. First we study Turing machines based on quantum logic(quantum Turing machines, for short) and their variants, the notions including nondeterministic quantum Turing machines l-VTM, deterministic quantum Turing machines l-VDTM and multi-tape quantum Turing machines are introduced. Two methods to recognize quantum languages by quantum Turings machines are given, which are based on depth-first technique and on width-first technique, respectively, it is shown that these two methods are not equivalent in recognizing quantum languages. Second, we introduce the notions of quantum recursively enumerable languages and quantum recursively languages, and the stratified characterization of them are also given. Moreover, we show that l-VTMs and l-VDTMs are not equivalent. However, they are equivalent …", "num_citations": "4\n", "authors": ["1636"]}
{"title": "基于可能性测度的计算树逻辑 CTL~* 与可能性互模拟\n", "abstract": " 摘 要 提出了基于可能性测度的计算树逻辑 CTL (PoCTL) 的概念. 给出了在可能的 Kripke 结构中可能性互模拟的定义并对其性质进行了详细的探讨. 对商可能性 Kripke 结构及其相关构造进行了特别的研究.", "num_citations": "4\n", "authors": ["1636"]}
{"title": "模糊代数系统\n", "abstract": " 引入模糊代数系统及其强解的概念,给出其特有性质.定义proper和V-proper模糊代数系统,并给出其解的一般表达形式.建立模糊代数系统与模糊上下文无关文法相互转化法则.最后得出结论:任一proper和V-proper模糊代数系统都存在唯一强解.模糊上下文无关文法生成的模糊语言和其对应的模糊代数系统的强解的某个分量是相等的.", "num_citations": "4\n", "authors": ["1636"]}
{"title": "Central elements in pseudoeffect algebras\n", "abstract": " We introduce the definition of pseudoorthoalgebras and discuss some relationships between orthomodular lattices and pseudoorthoalgebras. Then we study the conditions that a pseudoeffect algebra is isomorphic to an “internal direct product” of ideals generated by orthogonal principal elements. At last, we give some characterizations of central elements in pseudoeffect algebras.", "num_citations": "4\n", "authors": ["1636"]}
{"title": "分配序列效应代数的理想和同余\n", "abstract": " 分配的序列效应代数(简记为DSEA),是指在一个效应代数上带有一种乘积运算并满足一定的条件.介绍了分配的序列效应代数中的左理想,右理想,理想,素理想和同余等概念,并且证明了满足(RDP)性质并且以1为乘积单位的分配序列效应代数是具有(RDP)性质的反格分配序列效应代数的子直积.", "num_citations": "4\n", "authors": ["1636"]}
{"title": "Algebraic properties on the cuts of lattice-valued regular languages\n", "abstract": " In this paper, the algebraic operations on the cuts of lattice-valued regular languages are studied. Some sufficient conditions are given to guarantee the family of the cuts of lattice-valued regular languages to be closed under such algebraic operations as union, intersection, complement, quotient, homomorphism, inverse homomorphism, concatennation, reversal, etc.", "num_citations": "4\n", "authors": ["1636"]}
{"title": "模糊推理系统的鲁棒性\n", "abstract": " 主要讨论模糊推理系统的鲁棒性.给出基于逻辑等价度量的模糊集扰动的定义,讨论模糊集扰动与模糊连接词及蕴涵算子扰动之间的关系,针对若干特殊的模糊连接词及蕴涵算子的扰动情形,给出模糊推理系统的扰动的最佳结果.", "num_citations": "4\n", "authors": ["1636"]}
{"title": "Finite automata based on quantum logic and their determinization\n", "abstract": " We give the quantum subset construction of orthomodular lattice-valued finite automata, then we show the equivalence between orthomodular lattice-valued finite automata, orthomodular lattice-valued deterministic finite automata and orthomodular lattice-valued finite automata with empty string-moves. Based on these equivalences, we study the algebraic operations on orthomodular lattice-valued regular languages, then we establish Kleene theorem in the frame of quantum logic.", "num_citations": "4\n", "authors": ["1636"]}
{"title": "Generalized ideals in orthoalgebras\n", "abstract": " The definitions of generalized ideal and generalized filter in orthoalgebras are given, the relationship between generalized ideals and local ideals is studied, and the connections between generalized ideals and supports are established.", "num_citations": "4\n", "authors": ["1636"]}
{"title": "连续状态模糊控制系统的鲁棒稳定性分析\n", "abstract": " 1 引言 关于模糊系统的稳定性研究,目前已有许多相关的分析和设计方法[1].比如,文献[2]中证明了凡用经典控制能稳定控制的系统必可用模糊控制达到相同的稳定性能, 文献[3]中有关Takagi-Sugeno模糊系统的稳定性研究, 文献[4]中有关关系模型的模糊稳定性分析, 文献[5]中有关结论部分为单点的模糊系统的稳定性的讨论等,其它诸如相平面法,绝对圆判据, 自适应法等,见文献[6]的综述.但模糊控制是一种基于系统的模糊模型的控制方法,由于系统本身的非线性和不确定性,以及模糊模型本身的逼近误差,这就要求模糊控制具有鲁棒性. 这一方面已有相关的研究成果 (如文献[7~10]等), 比如,Tanaka等人[7]给出了模糊控制系统二次稳定的条件,但该方法过于复杂而难于验证, 况且未给出模糊控制鲁棒稳定区间的估计, Chen等人[8]的结果比较保守, 也未给出模糊控制鲁棒稳定区间的估计. 本文就是在这些方面进行研究, 给出模糊控制系统鲁棒稳定的一些新条件,并针对单输入单输出系统给出模糊控制系统鲁棒稳定区间的定量估计式来.", "num_citations": "4\n", "authors": ["1636"]}
{"title": "诱导空间的分子网收敛特征\n", "abstract": " 研究了诱导空间的分子网收敛理论, 给出诱导空间的几个与分子网收敛有关的刻画, 从本质上揭示了诱导空间分子网收敛的特征及与之相关的闭包运算的内部结构. 另外, 作为应用, 解决了《 L-fuzzy 拓扑空间论》 中提出的关于序列式空间的几个问题.", "num_citations": "4\n", "authors": ["1636"]}
{"title": "Quantum uncertainty relations of quantum coherence and dynamics under amplitude damping channel\n", "abstract": " In this paper, we discuss quantum uncertainty relations of quantum coherence through a different method from Ref.[52]. Some lower bounds with parameters and their minimal bounds are obtained. Moreover, we find that for two pairs of measurement bases with the same maximum overlap, quantum uncertainty relations and lower bounds with parameters are different, but the minimal bounds are the same. In addition, we discuss the dynamics of quantum uncertainty relations of quantum coherence and their lower bounds under the amplitude damping channel (ADC). We find that the ADC will change the uncertainty relations and their lower bounds, and their tendencies depend on the initial state.", "num_citations": "3\n", "authors": ["1636"]}
{"title": "Improving fidelity of quantum secret sharing in noisy environments\n", "abstract": " Abstract                  Quantum secret sharing is a procedure for sharing a secret among a number of participants such that only certain subsets of participants can collaboratively reconstruct it. In this paper, we review a quantum secret sharing scheme to realize a class of access structures. Based on this protocol, we give a concrete example with three participants. Since the noisy channel has a great influence on the shared quantum secret, we analyze the impacts of two kinds of noisy channels on quantum secret sharing and obtain the expression among the fidelity, noisy coefficient and shared quantum state coefficients. In order to enhance the fidelity of the shared secret, we give an optimized strategy through the concrete scheme. Furthermore, we analyze two specific cases, and we can enhance the fidelity through properly adjusting the compensation parameters. Compared with the original way, our …", "num_citations": "3\n", "authors": ["1636"]}
{"title": "Bisimulation Relations for Weighted Automata over Valuation Monoids\n", "abstract": " In this paper, we firstly give a definition of bisimulation relations for weighted automata over valuation monoids and prove that weighted automata A and B are equivalent with behavior under a bisimulation relation. Then we put forward the notion of surjective functional bisimulation relations and construct the related equivalence relations on A. We also give the properties of these related equivalence relations and define bisimulations relations for A with these properties. Finally, we prove the existence of the greatest bisimulation relation and give the method of constructing the greatest bisimulation relation.", "num_citations": "3\n", "authors": ["1636"]}
{"title": "含至多四个参与者的量子秘密共享方案的最优信息率\n", "abstract": " 信息率是衡量量子秘密共享方案性能的一个重要指标. 在本文中, 我们利用超图的相关理论刻画了量子存取结构. 然后, 利用超图和量子存取结构间的关系给出了参与者人数至多为 4 的所有 13 个量子存取结构, 并基于量子信息论研究了其最优信息率及所对应的完善的量子秘密共享方案. 对其中的 5 种存取结构的最优信息率的准确值进行了计算, 并讨论了达到此信息率的方案的具体构造; 对余下的 8 种存取结构的最优信息率的上界进行了计算.", "num_citations": "3\n", "authors": ["1636"]}
{"title": "The pasting constructions for effect algebras\n", "abstract": " The aim of this paper is to present several techniques of constructing a lattice-ordered effect algebra from a given family of lattice-ordered effect algebras, and to study the structure of finite lattice-ordered effect algebras. Firstly, we prove that any finite MV-effect algebra can be obtained by substituting the atoms of some Boolean algebra by linear MV-effect algebras. Then some conditions which can guarantee that the pasting of a family of effect algebras is an effect algebra are provided. At last, we prove that any finite lattice-ordered effect algebra E without atoms of type 2 can be obtained by substituting the atoms of some orthomodular lattice by linear MV-effect algebras. Furthermore, we give a way how to paste a lattice-ordered effect algebra from the family of MV-effect algebras.", "num_citations": "3\n", "authors": ["1636"]}
{"title": "On a condition for semirings to induce compact information algebras\n", "abstract": " In this paper we study the relationship between ordering structures on semirings and semiring-induced valuation algebras. We show that a semiring-induced valuation algebra is a complete (resp. continuous) lattice if and only if the semiring is complete (resp. continuous) lattice with respect to the reverse order-relation on semirings. Furthermore, a semiring-induced information algebra is compact, if the dual of the semiring is an algebraic lattice.", "num_citations": "3\n", "authors": ["1636"]}
{"title": "基于广义可能性测度的可达性问题的模型检测\n", "abstract": " 在广义可能性测度下, 提出了广义可能性 Kripke 结构来描述系统的量化行为. 在广义可能性 Kripke 结构下重新定义了线性时序逻辑的语构和语义, 研究了线性时间属性的最终可达性, 限制可达性, 重复可达性等模型检测问题. 本文所获得的结果扩大了可能性测度在模型检测中的应用范围.", "num_citations": "3\n", "authors": ["1636"]}
{"title": "量子最弱自由前置条件的交换性及其性质\n", "abstract": " 首先给出了量子最弱自由前置条件 (weakest liberal precondition, 简称 wlp) wlp (A, B, C)-可交换的定义, 研究了 wlp (A, B, C)-可交换的充分必要条件; 其次, 得到了 wlp 不是良好的谓词转换, 验证了 wlp 是比量子最弱前置条件 (weakest precondition, 简称 wp) 更弱的谓词转换, 揭示了 wlp 和 wp 的本质区别; 最后证明了 wlp 的序列合成, 并行合成和块结构等性质.", "num_citations": "3\n", "authors": ["1636"]}
{"title": "基于极小线性码上的秘密共享方案\n", "abstract": " 从理论上说, 每个线性码都可用于构造秘密共享方案, 但是在一般情况下, 所构造的秘密共享方案的存取结构是难以确定的. 本文提出了极小线性码的概念, 指出基于这种码的对偶码所构造的秘密共享方案的存取结构是容易确定的. 本文首先证明了极小线性码的缩短码一定是极小线性码. 然后对几类不可约循环码给出它们为极小线性码的判定条件, 并在理论上研究了基于几类不可约循环码的对偶码上的秘密共享方案的存取结构. 最后用编程具体求出了一些实例中方案的存取结构.", "num_citations": "3\n", "authors": ["1636"]}
{"title": "不完备决策软集与优势可信规则获取\n", "abstract": " 软集理论是一种新的处理不确定性知识的计算工具,它能灵活地表示数据,有效简化数据分析过程,在人工智能和系统科学领域有着重要的应用.针对基于优势关系的不完备决策信息系统,给出了一种拓展的软集模型,提出了不完备决策软集的概念以及决策软集的优势关系和优势集概念,进一步给出了一种基于优势关系的决策软集获得不完备决策系统中的优势可信规则的方法,以及软最优可信规则的提取算法.理论和实例分析表明,该优势可信规则挖掘方法是有效的,与粗糙集理论相比极大地约简了规则冗余,提高了运算的效率.", "num_citations": "3\n", "authors": ["1636"]}
{"title": "基于量子逻辑的图灵机及其通用性\n", "abstract": " 摘 要 基于量子逻辑的自动机理论是量子计算模型的一个重要研究方向. 该文研究了基于量子逻辑的图灵机 (简称量子图灵机) 及其一些变形, 给出了包括非确定型量子图灵机犾 VTM, 确定型量子图灵机犾 VDTM 以及相应类型的多带量子图灵机, 并引入量子图灵机基于深度优先与宽度优先识别语言的两种不同定义方式, 证明了这两种定义方式在量子逻辑意义下是不等价的. 进一步证明了犾 VTM, 犾 VDTM 与相应类型的多带量子图灵机之间的等价性. 其次, 给出了量子递归可枚举语言及量子递归语言的定义, 并给出了二者的层次刻画, 证明了犾 VTM 与犾 VDTM 不等价, 但两者作为量子递归语言的识别器是等价的. 最后, 文中讨论了基于量子逻辑的通用图灵机的存在性问题, 给出了一套合理编码系统, 证明了基于量子逻辑的通用图灵机在其所取值的正交模格无限时不存在, 而在其所取值的正交模格有限时是存在的.", "num_citations": "3\n", "authors": ["1636"]}
{"title": "Training of a female world-elite rower in pre-olympic year\n", "abstract": " PURPOSE: This study aims to analyze the training intensity distribution of a Chinese women single scull (W1x) in pre-Olympic year, who was successful several times in world championships and Olympic Games (OG).METHOD: The training load of a W1x sculler (32yrs, 177cm, 71kg, 18yrs of training experience as rower) in pre-Olympic year was analyzed according to the recording of actual training. All the rowing on water and ergometer, as well as cross-training (running and cycling) from October, 2007 to OG in 2008 was documented in minutes. As established by Seiler et al., three zones of intensity were divided by lactate threshold 1 (LT1, approximate 2 mM) and lactate threshold 2 (LT2, approximate 4 mM).RESULTS: In the observed period, 5827km (127km/week) were covered by the W1x, including 4202km on water, 910km on ergometer, and 715km in running and cycling. When divided by intensity zones, 75.2% of the distance was distributed in zone 1. The percentage of zone 2 and zone 3 was 22.4% and 2.4%, respectively. After dividing the training year into preparatory period (October to middle of March) and competition period (middle of March to OG), it was found that the training at or around lactate threshold (zone 2) decreased significantly from 34.4% in the preparatory period to 8.7% in the competition period, which was sacrificed by increasing the training volume in zone 1 and 3 from 63.5% to 88.6%, and from 2.1% to 2.7%, respectively.CONCLUSION: Compared with the so-called polarized-training model on the basis of diary record of training session, the training of the studied subject on the basis of recording every actual training …", "num_citations": "3\n", "authors": ["1636"]}
{"title": "On quotients of formal power series\n", "abstract": " Quotient is a basic operation of formal languages, which plays a key role in the construction of minimal deterministic finite automata (DFA) and the universal automata. In this paper, we extend this operation to formal power series and systemically investigate its implications in the study of weighted automata. In particular, we define two quotient operations for formal power series that coincide when calculated by a word. We term the first operation as (left or right) \\emph{quotient}, and the second as (left or right) \\emph{residual}. To support the definitions of quotients and residuals, the underlying semiring is restricted to complete semirings or complete c-semirings. Algebraical properties that are similar to the classical case are obtained in the formal power series case. Moreover, we show closure properties, under quotients and residuals, of regular series and weighted context-free series are similar as in formal languages. Using these operations, we define for each formal power series  two weighted automata  and . Both weighted automata accepts , and  is the minimal deterministic weighted automaton of . The universality of  is justified and, in particular, we show that  is a sub-automaton of . Last but not least, an effective method to construct the universal automaton is also presented in this paper.", "num_citations": "3\n", "authors": ["1636"]}
{"title": "伪的弱效应代数的同余和理想\n", "abstract": " 在伪的弱效应代数的基础上给出伪的弱差分偏序集的概念,证明了伪的弱效应代数和伪的弱差分偏序集是等价的.通过引入伪的弱效应代数中的同余等概念证明了在特殊的同余条件下的商代数仍然是伪的弱效应代数,证明了满足RDP性质的伪BL-效应代数在特殊的同余关系下的商代数也是一个伪BL-效应代数并且具有子直积表示.", "num_citations": "3\n", "authors": ["1636"]}
{"title": "Approximation of fuzzy context-free grammars\n", "abstract": " Fuzzy context-free max-★ grammar (or FCFG★, for short), as a straightforward extension of context-free grammar, has been introduced to express uncertainty, imprecision, and vagueness in natural language fragments. Li recently proposed the approximation of fuzzy finite automata, which may effectively deal with the practical problems of fuzziness, impreciseness and vagueness. In this paper, we further develop the approximation of fuzzy context-free grammars. In particular, we show that a fuzzy context-free grammar under max-★ compositional inference can be approximated by some fuzzy context-free grammar under max–min compositional inference with any given accuracy. In addition, some related properties of fuzzy context-free grammars and fuzzy languages generated by them are studied. Finally, the sensitivity of fuzzy context-free grammars is also discussed.", "num_citations": "3\n", "authors": ["1636"]}
{"title": "Fuzzy adaptive observer and filter backsteppping control for nonlinear systems\n", "abstract": " In this paper, a new fuzzy adaptive control approach is developed for a class of SISO nonlinear systems with unmeasured states. Using fuzzy logic systems to approximate the unknown nonlinear functions, a fuzzy adaptive observer based on filters is introduced for state estimation as well as system identification. Under the framework of the backstepping design, fuzzy adaptive output feedback control is constructed recursively. By theoretical analysis, all the closed-loop signals are semi-globally uniformly ultimately bounded, and the tracking errors are proved to converge to a small residual set around the origin.", "num_citations": "3\n", "authors": ["1636"]}
{"title": "Robustness of fuzzy reasoning\n", "abstract": " In this paper, wediscuss robustness of fuzzy reasoning. After proposing thedefinition of maximum perturbation of fuzzy sets, we presentrobustness results for various implication operators, inferencerules, and fuzzy reasoning machines, and discuss the relationsbetween the robustness of fuzzy reasoning and that of fuzzyconjunction and implication operators.", "num_citations": "3\n", "authors": ["1636"]}
{"title": "由可精确测量元控制的弱可换的伪效应代数\n", "abstract": " 主要研究了由可精确测量元控制的弱可换的伪效应代数中可精确测量元.证明了可精确测量元控制的弱可换的伪效应代数中可精确测量元是弱可换的伪正交代数代数.讨论了弱可换的伪效应代数与BZ-偏序集之间的关系.讨论了弱可换的伪效应代数商代数中可精确测量元与正规Riesz理想之间的关系.", "num_citations": "3\n", "authors": ["1636"]}
{"title": "The Congruences and Homomorphisms of Lattice-valued Mealy-type Machines [J]\n", "abstract": " The notion lattice-valued Mealy-type machine is introduced, we traverse some algebraic properties of this machine and investigate the congruences and homomorphisms of this type machine. Our main results indicate that the algebraic properties of lattice-valued Mealy-type machines has close linksto the algebraic properties of lattice-ordered monoids which machines take value in. Finally we study the minimization of lattice-valued Mealy-type machines and provide an algorithm to achieve the minimal lattice-valued Mealy-type machines within finite steps.", "num_citations": "3\n", "authors": ["1636"]}
{"title": "Decomposition and resolution of fuzzy relation equations (II) based on boolean-type implications\n", "abstract": " The problem of solving fuzzy relation equations (II) based on Boolean-type implications is studied in the present paper. Decomposition of fuzzy relation equations (II) based on Boolean-type implications is first presented in a finite case. Then, the solution existence of fuzzy relation equations (II) based on Boolean-type implications is discussed, and for nice Boolean-type implications, some new solvability criteria based upon the notion of ”solution matrices” are given. It is also shown that for each solution a of a fuzzy relation equation (II) based on Boolean-type implication, there exists a minimal solution a                            * of this equation, such that a                            * is less than or equal to a, whenever the solution set of this equation is nonempty. The complete solution set of fuzzy relation equation (II) based on Boolean-type implication can be determined by all minimal solutions of this equation. Finally, an …", "num_citations": "3\n", "authors": ["1636"]}
{"title": "Relations of Some Kinds of Lattice-valued Finite Automata [J]\n", "abstract": " In this paper, the definitions of the four kinds of lattice-valued finite automata and their languages are given. The equivalance of the former three kinds of lattice-valued finite automata are proved. Specially the relations between the forth and the other three forms are studied.[Fund]: 国家自然科学基金资助项目 (60174016);; 数学天元青年基金资助项目 (10226023);; 高等学校优秀青年教师教学科研奖励计划资助项目;; 国家重点基础研究发展计划 (973 计划) 资助项目 (2002CB312200)", "num_citations": "3\n", "authors": ["1636"]}
{"title": "θ-Fuzzy 关系方程的分解与求解\n", "abstract": " 在有限论域上首先给出θ-Fuzzy关系方程的分解,然后针对NR-蕴涵θ,探讨θ-Fuzzy关系方程的求解问题,基于解矩阵给出解的存在性的几个新判据,并在解集非空时,证明θ-Fuzzy关系方程的每一个解都存在一个极大解.", "num_citations": "3\n", "authors": ["1636"]}
{"title": "一类非线性系统的模糊控制与稳定性\n", "abstract": " 研究了模糊控制器对一类非线性系统的可控性.利用李雅普诺夫一次近似稳定性方法,证明了:1)若过程P可稳定控制(stabilized),则必可用T-s模糊控制器达到相同的稳定控制性能;2)模糊控制器为泛控制器.这些结果回答了J.J.Buckley提出的有关问题.", "num_citations": "3\n", "authors": ["1636"]}
{"title": "渐近稳定性与模糊控制\n", "abstract": " 研究了模糊控制器对被控过程的可控性.利用李雅普诺夫一次近似稳定性方法,证明了:(1)若过程P可稳定控制(stabilized),则必可用T-S模糊控制器达到相同的稳定控制性能;(2)模糊控制器为泛控制器.这些结果回答了J.J.Buckley提出的有关问题.", "num_citations": "3\n", "authors": ["1636"]}
{"title": "拓扑空间范畴, 拓扑 FUZZ 范畴与拓扑分子格范略畴间的反射与余反射\n", "abstract": " 从整体角度出发,证明拓扑空间范畴Top分别是拓扑Fuzz范畴TopFuzz与拓扑分子格范畴TML的反射与余反射满子范畴,TopFuzzy是TML的反射与余反射(非满)子范畴.", "num_citations": "3\n", "authors": ["1636"]}
{"title": "Quantifying quantum non-Markovianity via max-relative entropy\n", "abstract": " We investigate the non-Markovian behavior in open quantum systems from an information-theoretic perspective. Our main tool is the max-relative entropy, which quantifies the maximum probability with which a state ρ can appear in a convex decomposition of a state σ. This operational interpretation provides a new view for the non-Markovian process. We also find that max-relative entropy can be the witness and measure of non-Markovian processes. As applications, some examples are also given and compared with other measures in this paper.", "num_citations": "2\n", "authors": ["1636"]}
{"title": "A new class of states of reversible entanglement manipulation under positive partial transpose operations\n", "abstract": " We first study the reversibility for a class of states under the operations which completely preserve the positivity of partial transpose (PPT) and show that the entanglement cost is equal to the distillable entanglement for a rank-two mixed state on the 4⊗ 4 antisymmetric subspace under PPT operations. By using a similar method in finding the irreversibility, we also find that the value of a new efficiently computable additive lower bound E η (ρ) for the asymptotic PPT-relative entropy of entanglement presented in [Phys. Rev. Lett. 119, 180506 (2017)] is equal to the regularized Rains' bound and an upper bound E N (ρ) for distillable entanglement for these states. Furthermore, we find states on the symmetric subspace satisfying the relation mentioned above, generalize the antisymmetric states and symmetric states in higher dimensions, and give a specific value for distillable entanglement and entanglement cost for these …", "num_citations": "2\n", "authors": ["1636"]}
{"title": "Quantum uncertainty relations of two generalized quantum relative entropies of coherence\n", "abstract": " In this paper, we consider the quantum uncertainty relations of two generalized relative entropies of coherence based on two measurement bases. First, we give quantum uncertainty relations for pure states in a d-dimensional quantum system by making use of the majorization technique; these uncertainty relations are then generalized to mixed states. We find that the lower bounds are always nonnegative for pure states but may be negative for some mixed states. Second, the quantum uncertainty relations for single qubit states are obtained by the analytical method. We show that the lower bounds obtained by this technique are always positive for single qubit states. Third, the lower bounds obtained by the two methods described above are compared for single qubit states.", "num_citations": "2\n", "authors": ["1636"]}
{"title": "Dynamics of cohering and decohering power under Markovian channels\n", "abstract": " In this paper, we investigate the cohering and decohering power of the one-qubit Markovian channels with respect to coherence measures based on the l 1-norm, the Rényi α-relative entropy and the Tsallis α-relative entropy of coherence, respectively. The amplitude damping channel, phase damping channel, depolarizing channel, and flip channels are analytically calculated. It shows that the decohering power of the amplitude damping channel on the , and z basis is equal to each other. The same phenomenon can be seen for the phase damping channel and the flip channels. The cohering power for the phase damping channel and the flip channels on the  basis also equals to that on the z basis. However, the cohering and decohering power of the depolarizing channel is independent to the reference basises. And the cohering power of the amplitude damping channel on the  basis is different to that …", "num_citations": "2\n", "authors": ["1636"]}
{"title": "Coherent-induced state ordering with fixed mixedness\n", "abstract": " In this paper, we study coherence-induced state ordering with Tsallis relative entropy of coherence, relative entropy of coherence and  norm of coherence. Firstly, we show that these measures give the same ordering for single-qubit states with a fixed mixedness or a fixed length along the direction . Secondly, we consider some special cases of high dimensional states, we show that these measures generate the same ordering for the set of high dimensional pure states if any two states of the set satisfy majorization relation. Moreover, these three measures generate the same ordering for all  states with a fixed mixedness. Finally, we discuss dynamics of coherence-induced state ordering under Markovian channels. We find phase damping channel don't change the coherence-induced state ordering for some single-qubit states with fixed mixedness, instead amplitude damping channel change the coherence-induced ordering even though for single-qubit states with fixed mixedness.", "num_citations": "2\n", "authors": ["1636"]}
{"title": "直觉模糊测度的计算树逻辑\n", "abstract": " 建立了直觉模糊 Kripke 结构 (intuitionistic fuzzy Kripke structure, IFKS) 模型, 提出了基于直觉模糊 Kripke 结构的直觉模糊测度空间理论, 阐述了 IFKS 的一系列性质. 证明了任一路径转移的直觉模糊可达度 (intuitionistic fuzzy probability, IFP) 为初始状态的直觉模糊测度与各转移的 IFP 所取下确界, 任一状态出发的所有路径上路径转移的 IFP 为所有路径可达度的上确界. 给出了路径转移矩阵 P 及其传递闭包 P+ 的概念, 给出了通过计算路径转移矩阵传递闭包, 计算路径可达度的算法, 并分析了算法的复杂度. 提出了直觉模糊计算树逻辑 (intuitionistic fuzzy computation tree logic, IFPCTL) 理论, 讨论了一组 IFPCTL, 可能测度计算树逻辑 (possibilistic computation tree logic, PoCTL) 和经典计算树逻辑 (computation tree logic, CTL) 公式的等价性. 最后给出了一组等价的 IFPCTL 和 PoCTL 公式以及一组不等价的 IFPCTL 和 CTL 公式.", "num_citations": "2\n", "authors": ["1636"]}
{"title": "Detection of Aβ plaque deposition in MR images based on pixel feature selection and class information in image level\n", "abstract": " Amyloid β-protein (Aβ) plaque deposition is an important prevention and treatment target for Alzheimer’s disease (AD). As a noninvasive, nonradioactive and highly cost-effective clinical imaging method, magnetic resonance imaging (MRI) is the perfect imaging technology for the clinical diagnosis of AD, but it cannot display the plaque deposition directly. This paper resolves this problem based on pixel feature selection algorithms at the image level. Firstly, the brain region was segmented from mouse model brain MR images. Secondly, the pixels in the segmented brain region were extracted as a feature vector (features). Thirdly, feature selection was conducted on the extracted features, and the optimal feature subset was obtained. Fourthly, the various optimal feature subsets were obtained by repeating the same processing above. Fifthly, based on the optimal feature subsets, the final optimal feature subset was …", "num_citations": "2\n", "authors": ["1636"]}
{"title": "Estimating the brain pathological age of Alzheimer’s disease patients from MR image data based on the separability distance criterion\n", "abstract": " Traditional age estimation methods are based on the same idea that uses the real age as the training label. However, these methods ignore that there is a deviation between the real age and the brain age due to accelerated brain aging.", "num_citations": "2\n", "authors": ["1636"]}
{"title": "基于决策过程的广义可能性计算树逻辑模型检测\n", "abstract": " 摘要 本文研究了广义可能性计算树逻辑模型检测算法及其在系统验证中的应用, 特别是在非确定性系统验证中的应用. 首先引入作为系统模型的广义可能性决策过程和描述系统属性的广义可能性计算树逻辑, 然后给出基于广义可能性决策过程的广义可能性计算树逻辑模型检测算法. 该算法最大的优点是利用决策过程中的调度, 将模型检测问题转换为多项式时间内模糊矩阵的运算或模糊矩阵不动点的计算. 最后通过一个实例说明了广义可能性计算树逻辑模型检测在非确定性系统中的应用.", "num_citations": "2\n", "authors": ["1636"]}
{"title": "Pebble 模糊有穷自动机和传递闭包逻辑\n", "abstract": " 定义了Lukasiewicz逻辑下的一阶有界传递闭包逻辑,并且给出了模糊有穷自动机的一阶有界传递闭包逻辑;另外,我们还介绍了两类模糊有穷自动机:Nested模糊有穷自动机和Pebble模糊有穷自动机,并且证得这两类模糊自动机都可以由一阶有界传递闭包逻辑来刻画,因此它们并没有提升模糊自动机的语言识别能力;进而得到本文的主要结论:在Lukasiewicz逻辑下,模糊单体二阶逻辑与Lukasiewicz逻辑下的一阶有界传递闭包逻辑之间等价,且模糊自动机所识别的语言与Pebble模糊有穷自动机识别的语言是等价的.", "num_citations": "2\n", "authors": ["1636"]}
{"title": "Poster sessions schedule\n", "abstract": " Objective: Reading Disorder (RD) and Disorder of Written Expression (DWE) are among the highest co-occurring learning disabilities in children with Attention-Deficit/Hyperactivity Disorder (ADHD). However, little information is available regarding IQ and achievement tests predicting diagnoses in comorbid groups. The current study examined children diagnosed with ADHD-Inattentive, ADHD-Combined, or ADHD with coexisting RD and/or DWE. Method: Participants included 135 children with ADHD-Inattentive (n= 59), ADHD-Combined (n= 36), and ADHD, RD, and/or DWE (n= 40). Children were 10.2-year old and 66.5% male with an IQ of 100.9. Diagnoses were established in a private practice through comprehensive evaluations, including administration of the Wechsler Intelligence Scale for Children-Fourth Edition (WISC-IV) and Woodcock Johnson Tests of Achievement Third Edition (WJ-III …", "num_citations": "2\n", "authors": ["1636"]}
{"title": "Quantum and classical correlations in quantum measurement\n", "abstract": " We revisit quantum measurement when the apparatus is initially in a mixed state. We find that, in a particular restriction setup, the amount of entanglement between the system and the apparatus is given by the entropy increasing of the system under the measurement transformation. We show that the information gained is equal to the amount of entanglement under performing perfect measurement. Based on the perfect measurement, we give an upper bound of quantum discord.", "num_citations": "2\n", "authors": ["1636"]}
{"title": "可逆模糊自动机\n", "abstract": " 首先提出了可逆模糊自动机的概念,研究了能被可逆模糊自动机接受的语言(简记为F(∑))的一些性质.其次给出了自由群上被可逆模糊自动机接受的模糊子集的概念,详细研究了可逆模糊语言与经典可逆语言的关系.最后,通过引入语法幺半群刻画了F(∑)的代数性质.通过这些性质可以有效的判断一个模糊语言是否能被一个可逆模糊自动机接受.", "num_citations": "2\n", "authors": ["1636"]}
{"title": "Model-checking of linear-time properties in multi-valued systems\n", "abstract": " In this paper, we study model-checking of linear-time properties in multi-valued systems. Safety property, invariant property, liveness property, persistence and dual-persistence properties in multi-valued logic systems are introduced. Some algorithms related to the above multi-valued linear-time properties are discussed. The verification of multi-valued regular safety properties and multi-valued -regular properties using lattice-valued automata are thoroughly studied. Since the law of non-contradiction (i.e., ) and the law of excluded-middle (i.e., ) do not hold in multi-valued logic, the linear-time properties introduced in this paper have the new forms compared to those in classical logic. Compared to those classical model checking methods, our methods to multi-valued model checking are more directly accordingly. A new form of multi-valued model checking with membership degree is also introduced. In particular, we show that multi-valued model-checking can be reduced to the classical model checking. The related verification algorithms are also presented. Some illustrative examples and case study are also provided.", "num_citations": "2\n", "authors": ["1636"]}
{"title": "几种量子程序终止的有效验证\n", "abstract": " 摘 要 基于文献 [18] 提出的量子程序验证方法, 讨论了单量子比特系统上比特翻转, 去极化, 幅值阻尼, 相位阻尼等信道刻画的量子程序的验证, 通过选取不同的可观测算子对程序终止的情况进行了详细的讨论. 研究表明, 由这些量子信道所描述的量子程序的终止情况不仅依赖于输入态的选取, 还依赖于可观测算子的选取.", "num_citations": "2\n", "authors": ["1636"]}
{"title": "Finite automata based on quantum logic and monadic second-order quantum logic\n", "abstract": " We introduce monadic second-order quantum logic and prove that the behaviors of finite automata based on quantum logic are precisely the quantum languages definable with sentences of our monadic second-order quantum logic. This generalizes Buchi's and Elgot's fundamental theorems to quantum logic setting. We also consider first-order quantum logic and show that star-free quantum languages and aperiodic quantum languages introduced here coincide with the first-order quantum definable ones. This generalizes Schutzenberger's fundamental theorems to quantum logic setting. The determinazation of finite automata based on quantum logic is studied by introducing the generalized subset construction method. Then the Kleene theorem in the frame of quantum logic is presented here.", "num_citations": "2\n", "authors": ["1636"]}
{"title": "Specificity of Canoe-slalom and Guideline to Training [J]\n", "abstract": " By consulting the literature, analyzing the training load, combining the competition results and physiological tests, and investigating coaches, the specificity of canoe-slalom was studied from physical ability, skill and mental ability. The specific performance structure of canoe-slalom was established, which can be used as the guideline to canoe-slalom training. Canoe-slalom is a complicated event that demands the integration of physical ability, skill and psychological ability, which the physical training should be improved in aerobic endurance, strength variety and core stability, the skill training should enhance the efficiency and stable, and the mental training should be concentrated.", "num_citations": "2\n", "authors": ["1636"]}
{"title": "区间效应代数的张量积\n", "abstract": " 本文主要研究了区间效应代数的张量积的结构.证明了[0,1]与[0,1]的张量积不是[0,1].", "num_citations": "2\n", "authors": ["1636"]}
{"title": "Weakly regular quantum grammars and asynchronous quantum automata\n", "abstract": " In this paper, we define weakly regular quantum grammars (WRQG), regular quantum grammars (RQG), asynchronous quantum automata (AQA) and synchronous quantum automata (SQA). Moreover, we investigate the relationships between quantum languages generated by weakly quantum regular grammars and by asynchronous quantum automata. At the mean time, we discuss the relationships between regular quantum grammars and synchronous quantum automata.", "num_citations": "2\n", "authors": ["1636"]}
{"title": "Some algebraic properties of measure-once two-way quantum finite automata\n", "abstract": " Quantum finite automata (QFA) can be divided into four kinds depend upon the head-directions and the measure times. They are measure-once one way QFA (MO-1QFA) introduced by Moore and Crutchfield (Theor Comput Sci 237: 275–306, 2000); measure-many one way QFA (MM-1QFA) and measure-many two-way QFA (MM-2QFA) introduced by Kondacs and Watrous (Proceedings of the 38th IEEE annual symposium on 433 foundations of computer science, 66–75, 1997); and measure-once two-way QFA (MO-2QFA) which were not given until now. The purpose of this work is mainly to discuss one kind of QFA, which is called MO-2QFA for brief. First of all, the definition of MO-2QFA is given and the conditions for preserving unitary properties are shown. Then, we analysis the basic algebraic properties of the class of languages which can be recognized by MO-2QFA, such as the union, intersection …", "num_citations": "2\n", "authors": ["1636"]}
{"title": "Generalized ideals and supports in pseudo effect algebras\n", "abstract": " In this paper we introduce the definitions of generalized ideals and generalized filters in pseudo effect algebras. From the generalized ideals (filters), we obtain some equivalent characterization of ideals (filters). The relationships among generalized ideals, ideals and local ideals are studied in detail. We also establish an isomorphism between the set of supports and the set of generalized ideals of pseudo effect algebras.", "num_citations": "2\n", "authors": ["1636"]}
{"title": "模糊控制系统的镇定性能\n", "abstract": " 引入了模糊系统镇定性能的概念,讨论了连续状态下模糊控制器对被控过程的镇定性能,证明了若系统能被稳定控制,则可利用T-S模糊控制器使系统达到相同的稳定控制性能.", "num_citations": "2\n", "authors": ["1636"]}
{"title": "连续状态模糊控制系统的分区域稳定性分析\n", "abstract": " 给出简化的连续状态下模糊控制系统解的表达形式, 并给出简化模糊系统稳定的充分和必要条件, 统一了目前有关判定连续状态模糊控制系统的稳定性结论. 此外, 给出一种寻求稳定模糊控制的方法, 即基于梯度的控制器设计方法.", "num_citations": "2\n", "authors": ["1636"]}
{"title": "Relations among the category of topological molecular lattices and certain related categories\n", "abstract": " TAKING the theory of fuzzy topology and point set topology as background,the theory of topo-logical molecular lattices was first advanced in 1979,and after several generalizationsrefs.[4,5] are its general forms.Fuzzy topology and point set topology are both special casesof topological molecular lattices as pointed out in ref.[4],whereas it seems not clear whetherone can develop the theory of topological molecular lattices by means of methods in classical...", "num_citations": "2\n", "authors": ["1636"]}
{"title": "格上拟一致结构的分明化\n", "abstract": " 利用范畴代数, 首次给出了拓扑分子格与拟一致分子格的分明形式, 使格上的拓扑结构与分明的拓扑结构建立了某种自然的联系, 从而将格上的拓扑结构的研究最终归结到分明情形的研究.", "num_citations": "2\n", "authors": ["1636"]}
{"title": "Operational characterization of weight-based resource quantifiers via exclusion tasks in general probabilistic theories\n", "abstract": " The formalism of general probabilistic theories (GPTs), which include classical probability theory and quantum mechanics, has provided us with physical theories beyond quantum mechanics. In this work, we focus on studying the connection between several classes of exclusion tasks and core problems of resource theories-weight-based resource quantifiers and resource manipulations in any GPT. First, we introduce two resourceful quantifiers called the weight of state (WOS) and the weight of measurement (WOM) in any GPT; then, we show that the WOS accurately quantifies the best advantage that a given resource state offers over resourceless states in all channel exclusion tasks. Meanwhile, a similar conclusion can be drawn for the WOM. Second, we introduce the weight-generating power of a channel (WGPC) in any GPT, based on which the resource content of a nonfree channel can be quantified …", "num_citations": "1\n", "authors": ["1636"]}
{"title": "Distillability for non-full-rank coherent states in the probabilistic framework\n", "abstract": " We adequately characterize the distillability of quantum coherence under the maximally incoherent operations (MIO) in the probabilistic distillation’s framework. In particular, we prove that every non-full-rank coherent state exhibits a nonzero probability in the task of probabilistic deterministic distillation. Moreover, we find that the maximal coherence, a computable coherence monotone under strictly incoherent operations (SIO), is a coherence monotone under incoherent operations (IO) and add the proof that the maximal coherence fulfills strong monotonicity under SIO. It is suggested that the maximal success probability of distillation from all coherent states whose density matrix does not contain any rank-one submatrix is less than 1 under IO and equals 0 under SIO. Finally, we present an explicit example for probabilistic distillation under IO and show that a class of non-full rank 3-dimensional states possesses the …", "num_citations": "1\n", "authors": ["1636"]}
{"title": "Protocol of deterministic coherence distillation and dilution of pure states\n", "abstract": " Coherence distillation and dilution are two core problems in the manipulation of quantum resources. In this paper, we propose deterministic coherent distillation and dilution protocols, which fully demonstrate the change from the pure state to the maximum coherent state and vice versa. Our protocols can reach the theoretical value introduced in the upper bound proposed by Liu et al recently [Liu CL and Zhou DL Phys. Rev. Lett. 123 070 402 (2019)]. In particular, we propose pure distillation and dilution protocols through the majorization of the relation, which can be obtained by using the strictlyincoherent operators.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "Quantifying quantum non-markovianity via one-shot generalised mutual information\n", "abstract": " We propose an alternative non-Markovianity measure of open quantum systems, which is based on max-information. The max-information is a one-shot generalization of the mutual information derived from the max-relative entropy. This operational interpretation provides a new site for viewing the non-Markovian process. As applications, some typical noisy channels have been investigated: for phase damping and amplitude damping channels, non-Markovianity measure based on max-information is equivalent to the three previous non-Markovianity measures, ie the measures based on the distinguishability, entanglement of environment and the mutual information. For the random unitary channel, the proposed measurement in the witness of Markovianity is equivalent to the measures based on quantum trace distance and thus overlaps partly with the measurement based on the mutual information. It shows that …", "num_citations": "1\n", "authors": ["1636"]}
{"title": "The sum of observables on a                               σ -distributive lattice effect algebra\n", "abstract": " Observables on quantum structures can be seen as generalizations of random variables on a measurable space  for the case when  is not necessarily a Boolean algebra. The present paper investigates an extending of the usual pointwise sum of random variables onto the set of bounded observables on a -distributive lattice effect algebra E. We describe conditions under which this operation, so-called sum  of observables x, y, preserves continuity of spectral resolutions of x, y. We show how the spectrum  depends on spectra , , and we provide a relation between the meager part  and the dense part  of an observable x.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "Robustness of purity: an operational approach to resource theory of purity\n", "abstract": " Abstract                  Quantifying purity is a basic problem for quantum information theory. In this paper, we introduce the robustness of purity which has an operational interpretation. We find that robustness of purity satisfies all requirements for a valid purity measure, even for the stronger monotonicity which has not discussed before in the resource theory of purity. The upper and lower bounds of robustness of purity are obtained. The robustness of purity has an efficient numberical computability via semidefinite programming. We also prove the robustness of purity has operational significance as the best advantage one can obtain in mixture of unitary channel discrimination games. A trade-off relation between robustness of purity and mixedness is obtained. Finally, we discuss whether all the conditions holds for Rényi α-entropy purity and linear entropy purity respectively …", "num_citations": "1\n", "authors": ["1636"]}
{"title": "Topological characterization for fuzzy regular languages\n", "abstract": " We present a topological characterization for fuzzy regular languages: we show that there is a bijective correspondence between fuzzy regular languages and the set of all clopen fuzzy subsets with finite image in the induced fuzzy topological space of Stone space (Profinite space), and then we give a representation of closed fuzzy subsets in the induced fuzzy topological space via fuzzy regular languages. Moreover, we prove that the induced fuzzy topological space has a basis consisting of leveled characteristic functions of the closure of cut languages of fuzzy regular languages.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "Sufficient Conditions of the Same State Order Induced by Coherence\n", "abstract": " In this paper, we study coherence-induced state ordering with Tsallis relative entropy of coherence, relative entropy of coherence and l 1 norm of coherence, and give the sufficient conditions of the same state order induced by above coherence measures. First, we show that the above measures give the same ordering for single-qubit states in some special cases. Second, we consider some special states in a d-dimensional quantum system. We show that the above measures generate the same ordering for these special states. Finally, we discuss dynamics of coherence-induced state ordering under Markovian channels. We find amplitude damping channel changes the coherence-induced ordering even though for single-qubit states with fixed mixedness.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "Inequivalent multipartite coherence classes and new coherence monotones\n", "abstract": " Quantum coherence has received significant attention in recent years, but its study is mostly conducted in single party settings. In this paper, we generalize important results in multipartite entanglement theory to their counterparts in quantum coherence theory. First, we give a necessary and sufficient condition for when two pure multipartite states are equivalent under local quantum incoherent operations and classical communication (LICC), i.e., two states can be deterministically transformed to each other under LICC operations. Next, we investigate and give the conditions in which such a transformation succeeds only stochastically. Different from entanglement case for two-qubit states, we find that the SLICC equivalence classes are infinite. Moreover, it's possible that there are some classes of states in multipartite entanglement can convert into each other, while, they cannot convert into each other in multipartite coherence. In order to show the difference among SLICC classes, we introduce two coherence monotones: accessible coherence and source coherence, following the logistics given in [\\emph{Phys.~Rev.~Lett. 115,~150502 (2015)}]. These coherence monotones have a straightforward operational interpretation, namely, the accessible coherence characterizes the proficiency of a state to generate other states via quantum incoherent operations, while the source coherence characterizes the set of states that can be reached via quantum incoherent operations acting on the given state of interest.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "A novel table look-up scheme based on GFScom and its application\n", "abstract": " This work considers Mamdani fuzzy systems constructed from finite input–output data pairs using the generalized fuzzy sets with contradictory, opposite and medium negation (GFScom). Considering that the information available often consists of a set of finite numerical data pairs, a new table look-up scheme for constructing Mamdani fuzzy systems is presented. The designed fuzzy system is proved to be capable of approximating any real continuous function on a compact set to arbitrary degree of accuracy. We use this fuzzy modeling method for the truck back-upper control problem. The effectiveness of the proposed method is demonstrated by a comparison with the traditional table look-up scheme.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "广义可能性计算树逻辑的模型检测问题\n", "abstract": " 本文首先分别给出了 “约束可达”,“总是可达” 这两个公式在广义可能性计算树逻辑 (GPoCTL) 中的另外两种等价形式; 其次讨论了基于广义可能性测度的计算树逻辑的模型检测问题, 将 GPoCTL 的模型检测问题规约为经典的 CTL 模型检测问题, 利用截集的方法, 给出了计算 GPoCTL 的模型检测问题的算法及其复杂度, 并通过实例分析说明了这种算法的可行性; 最后, 研究了具有公平性假设的 GPoCTL 模型检测问题的计算复杂度, 得到了与上面相似的结论.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "The relationships among several forms of weighted finite automata over strong bimonoids\n", "abstract": " Given a strong bimonoid P, we introduce three different behaviors of a weighted finite automaton over P (called a P− valued finite automaton), named the initial object semantics, final object semantics and run semantics. We define four forms for a P− valued nondeterministic finite automaton (P− NFA) and three forms for a P− valued deterministic finite automaton (P− DFA). Under the above-mentioned semantics, the equivalence and differences among the four forms of P− NFAs are discussed and the equivalence among the three forms of P− DFAs are given. Moreover, we show that some equivalence depends on right distributivity or left distributivity, or even requires P to degenerate into a semiring.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "The Tsallis relative 2-entropy of coherence for qubit system\n", "abstract": " We show that Tsallis relative 2-entropy of coherence is equal to l                         1 norm of coherence for all pure states and give the additivity property for the general quantum states. We also explore the relation among Tsallis relative 2-entropy, l                         1 norm and relative entropy of coherence, and give some sharp inequalities connecting the three coherence measures. Further, we use the decay of coherence to study how does a quantum noise effect l                         1 norm and Tsallis relative 2-entropy of coherence on pure qubit system.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "Entanglement distribution in multi-particle systems in terms of unified entropy\n", "abstract": " We investigate the entanglement distribution in multi-particle systems in terms of unified (q, s)-entropy. We find that for any tripartite mixed state, the unified (q, s)-entropy entanglement of assistance follows a polygamy relation. This polygamy relation also holds in multi-particle systems. Furthermore, a generalized monogamy relation is provided for unified (q, s)-entropy entanglement in the multi-qubit system.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "Expressive power of linear-temporal logic based on generalized possibility measures\n", "abstract": " Model checking of linear-time properties based on possibility measures was developed by Li and Li (2013). However, the linear-time properties considered in the previous work were classical and qualitative, possibility information of the systems was not considered thoroughly at all. Therefore, the quantitative model checking of fuzzy linear-time properties based on generalized possibility measures was studied by Li (2016). This paper is a continuation of the above work. In this paper, we study the expressive power of possibilistic linear-temporal logic (PoLTL). Unlike possibilistic computation tree logic (PoCTL) in which the expressiveness of PoCTL is more powerful than computation tree logic (CTL), it is surprising that PoLTL is as expressive as linear-temporal logic (LTL). Furthermore, the comparison between PoLTL and generalized PoLTL (GPoLTL) is given. It is shown that the expressiveness of GPoLTL with …", "num_citations": "1\n", "authors": ["1636"]}
{"title": "Probabilistic Quantum Information Splitting Based on the Non-maximally Entangled Four-Qubit State\n", "abstract": " In this paper, we propose a scheme for quantum information splitting based on the non-maximally entangled four-qubit state in order to realize the splitting of the specific two-qubit state |ψ>                   A                   B                 =x|00>+y|11>. The information splitter will safely share an state to the receiver with help of the controller. Through introducing an auxiliary system and applying several appropriate unitary transformations the information receiver can reconstruct the original state sent by the information splitter. Due to the non-maximally entangled four-qubit state, the total probability that the receiver obtains the original information is P. Furthermore, we discuss the relationship between the successful splitting probability and the concurrence of the entangled state and get a specific expression. In addition, the scheme is tested against external and internal attacks, and we define a function to characterise the …", "num_citations": "1\n", "authors": ["1636"]}
{"title": "否定知识的代数表示及在模糊系统设计中的应用\n", "abstract": " 摘 要 对于模糊系统中的否定知识的认识, 首先从哲学层面上对潘正华提出的 3 种否定关系进行了研究, 提出了矛盾否定关系, 对立否定关系和中介否定关系的本质特征. 接着, 在 Zadeh 提出的语言变量中引入 3 种否定的概念, 得到了带有 3 种否定的语言变量. 为了能够刻画这些否定关系的本质特征和内在联系, 进一步研究了它们的集合基础, 定义了一种新的带有矛盾否定, 对立否定和中介否定的模糊集 GFScom, 并讨论了 GFScom 的一些基本运算及性质. 在此基础上, 给出了基于 GFScom 的具有一阶逼近精度和二阶逼近精度的模糊系统的设计方法, 并分析了所设计的模糊系统的逼近性能. 应用示例表明, GFScom 不仅丰富了模糊系统的推理功能, 而且能在仅知道部分隶属函数分布的情况下设计出具有给定精度的模糊系统.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "Exponentials in a Cartesian Closed Category Which Contains all Algebraic Domains\n", "abstract": " In this paper, the exponential is studied in the Cartesian closed category of all algebraic domains and all mappings which preserve directed suprema and the way-below relation. A problem presented by Zhongqiang Yang is partially solved.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "基于软集的无标记信息代数模型与算法\n", "abstract": " 在给定的一个初始论域 U 和参数集 E 上的全体软集中引入扩展运算与转移运算, 研究了它们的性质. 在此基础上引入商软集的概念, 并在全体商软集中引入联合运算与聚焦运算, 得到其构成一个无标记的信息代数, 并且若参数集 E 有限, 这个信息代数还是一个无标记的紧信息代数. 最后, 给出运用无标记信息代数的模型解决软集中不确定问题的决策算法与实例, 并与 Cagman 等人提出的 uni-int 决策算法做了比较说明.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "On conditions for mappings to preserve optimal solutions of semiring-induced valuation algebras\n", "abstract": " The valuation algebra is a generic algebraic structure which links up with local computation and inference. A projection problem in a valuation algebra concerns the focusing of a collection of information on a local domain. In this paper, according to a classification of variable sets, we present some corresponding necessary conditions for mappings to preserve optimal solutions of projection problems in semiring-induced valuation algebra systems. We show that, for a mapping between two semiring-induced valuation algebras, its properties of preserving optimal solutions and preserving the solution ordering are equivalent, if it is order-reflecting. Further, we propose some necessary and sufficient conditions for a projection problem and its translation to have a same optimal solution set. Finally, we show that a lower adjoint of a Galois connection defined between c-semirings preserves optimal solutions of projection …", "num_citations": "1\n", "authors": ["1636"]}
{"title": "The optimal information rates of the graph access structures on seven participants\n", "abstract": " The information rate is an important metric of the performance of a secret-sharing scheme. In this paper, we deal with determining the exact values for the optimal information rates of the six graph access structures and improving the information rate of a graph access structure on seven participants, which remained as open problems in Song's and Wang's paper ([1, 2]). We prove that the optimal information rate for each of the six graph access structures is equal to 4/7", "num_citations": "1\n", "authors": ["1636"]}
{"title": "极小特权数组上的理想多秘密共享方案\n", "abstract": " 如何构造针对一般存取结构的理想的多秘密共享方案是一个比较困难的问题. 本文首先解决了 Spiez 等最近提出的一个公开问题 [Finite Fields and Their Application, 2011, 17: 329–342], 即在特权数组存在的前提下, 设计求得任意长度的特权数组的算法. 进一步, 我们利用特权数组理论, 以 Pang 等和 Yang 等的方案为例, 分析了大多现有的基于 Shamir 门限体制的多秘密共享方案均不是完善的. 最后, 基于特权数组的算法, 本文提出了一个多秘密共享方案, 我们证明了该方案是理想的, 并且方案的存取结构中的授权集比门限方案的更加丰富.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "Energy contributions of 200 m sprint-canoeing on water\n", "abstract": " ResultsAcknowledgements: This study belongs to a project supported by Guangdong Sport Association200 m sprint-canoeing had its debut in world championship in 1993. After the revision of International Canoeing Federation in 2009, it was contested in London for the first time in Olympic history, where the finishing time of this event was averagely 43.4 s. Since its relative short history in Olympic Games and limited discipline (only male single), 200 m sprint-canoeing was rarely investigated. The single study which could be found was conducted in 1997, and the relative aerobic contribution was found to be 33-40% from only 2 canoeists on ergometer with the method of maximal accumulated oxygen deficit (MAOD)(Byrnes and Kearney 1997). Therefore, the objective of this study was to investigate on energy contributions in sprint-canoeing on water.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "模糊 Biichi 自动机的等价刻画\n", "abstract": " 模糊语言的研究是形式语言研究的焦点之一,然而如何对模糊语言进行刻画甚至更好地分类是其中一个重要研究方向.文章在模糊ω-语言的研究基础上,从模糊逻辑角度研究了模糊ω-正则语言的等价刻画.首先借助广义子集构造方法,证明了任一模糊Büchi自动机与具有分明初始状态和状态转移函数且具有模糊终状态的模糊Btichi自动机是等价的,藉此研究了模糊ω-正则语言的代数刻画和层次刻画,讨论了模糊ω-正则语言关于正则运算的封闭性;其次引入单体二阶Lukasiewicz逻辑的概念,给出模糊Btichi自动机识别语言的等价逻辑刻画;最后通过引入ω-星自由和ω-非周期模糊ω-语言,利用“层次化”处理技巧得到了多值逻辑意义下的分类定理,对模糊ω-正则语言给出了一种分类方法.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "格值有穷自动机和单体二阶格值逻辑\n", "abstract": " 引入了单体二阶格值逻辑,进而给出了基于格值逻辑的有穷自动机识别语言的逻辑描述,证明了格值逻辑意义下的Buchi—Elgot基本定理.通过引入星自由语言与非周期格值语言,完全刻画了可以用一阶格值逻辑定义的格值语言,得到了格值逻辑意义下的Schtitzenberger分类定理.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "Valid Verification of Termination for Some Quantum Programs\n", "abstract": " Using the verification method for quantum programs proposed in, the verification of quantum programs on the single qubit system described by bit flip channel, depolarizing channel, amplitude damping channel and phase damping channel was investigated, and the termination conditions of a quantum program were discussed in detail by selecting the different observable operators. It shows that the termination conditions of the quantum program described by quantum channel not only depends on the selection of input state, but also depends on the selection of observable operators.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "Possibilistic Kripke structure decision processes\n", "abstract": " We put forth the concept of possibilistic Kripke structure decision process (PKSDP). PKSDP is a generalization of possibilistic Kripke structure (PKS), useful for modeling and quantifying the possible outcomes of random actions. We define the path in a PKSDP, scheduler, PKS of a PKSDP induced by a scheduler, present the theory of reachability possibilities. We also address an example of PKSDP. Finally, we discuss the existence of optimal memoryless schedulers and value iteration for step-bounded reachability properties.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "The representation of semiring-based constraint satisfaction problems using fuzzy finite automata\n", "abstract": " In this paper, we give an approach to represent a semiring-based constraint satisfaction problem using fuzzy finite automata with membership values in a semilattice-ordered monoid. Then solving a semiring-based constraint satisfaction problem can be tackled by some simple operation on the corresponding fuzzy automata, some applications, including in particular optimal solution of a semiring-based constraint satisfaction problem are presented.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "通用模糊自动机\n", "abstract": " 首先使用模糊语言的分解定义了通用模糊自动机:这个自动机以该模糊语言的分解作为状态,通过模糊语言的包含度定义其转移函数.其次定义了模糊自动机上的态射,证明了接受给定模糊语言的所有自动机都可以标准地映射到该语言对应的通用模糊自动机上,这个性质称为通用性.最后进一步讨论了模糊商自动机,模糊m-最小自动机,模糊最小自动机及与通用模糊自动机之间的关系.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "Double order hybrid optimum codebook design for speaker recognition\n", "abstract": " Codebook design is important part of speaker recognition, and it is important research direction how to fast realize precise codebook design. Currently, there are two research methods. They are codebook design methods based on local optimization algorithms and global optimization algorithms. They have drawbacks to some extent for different speakers. Based on it, this paper proposed a double order hybrid optimum codebook design algorithm. This algorithm combines the two representative research methods, realize two codebook design algorithm based on GA (genetic algorithm) and LBG (linde-buzo-gray algorithm) +GA in parallel and obtain final optimum codebook by combination judgment. The experimental results show that, this algorithm can obtain better recognition accuracy and more stable recognition rate.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "A Splitting Algorithm Based on Soft Constraints for the Computation of Truth Degree in Quantitative Logic\n", "abstract": " The concept of the truth degree of a formula is the crucial tool and the building block in quantitative logic. So how to compute the truth degree of a formula efficiently is a principal question in this subject. This paper aims at bringing an optimal method for doing this job. Firstly, characterizations of the concept of truth degree are made with concepts from soft constraint theory. Particularly, two soft constraint systems are proposed such that formulas can be taken as soft constraints over them. Then by exploiting the algebraic properties of both constraint systems and n-valued propositional systems, it is shown that different soft constraint systems plays different roles in the computation of truth degree of formulas. An optimal method named splitting algorithm for computing truth degrees of formulas is proposed.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "量子 Mealy 自动机和量子 Moore 自动机的等价\n", "abstract": " 随着大数分解的量子算法和量子搜索算法的给出, 量子计算进入了一个全新的迅速的发展时期. 量子自动机是近十年来兴起的量子计算理论, 是一个很活跃的研究领域, 量子自动机的研究已经相当丰富. 首先定义了字符集上的有限维 Fock 空间, 给出基于有限维 Fock 空间的量子 Mealy 自动机和量子 Moore 自动机的定义, 考虑在不受外界环境影响下的两种量子自动机构成的封闭的量子系统, 详细地研究了量子 Mealy 自动机和量子 Moore 自动机的演化过程, 利用量子力学中密度算子的基本理论给出量子 Mealy 自动机和量子 Moore 自动机生成的量子语言. 最后, 在考虑纯态的情形下证明了量子 Mealy 自动机与量子 Moore 自动机是等价的.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "The Equivalence Between Quantum Mealy Automata and Quantum Moore Automata\n", "abstract": " The proposal of quantum algorithms for factorizing large numbers and of quantum searching algorithm has lead quantum computing to a new period of rapid development. Quantum automata theory has been a very active and fruitful research area, in which many meaningful results have been obtained over the past 10 years. In this paper, the authors firstly define the finite Fock space over an alphabet set, based on which, the definitions of quantum Mealy automata and quantum Moore automata are introduced. These definitions accord with quantum mechanics hypothesis. To consider a closed quantum system consisting of two kinds of automata without influence from the environments, based on the principle of quantum measurement, an investigation is made of the evolution of quantum Mealy automata and quantum Moore automata in detail. Then presented are the languages that are considered as quantum machine languages generated by quantum Mealy automata and quantum Moore automata utilizing the basic properties of density operator. It is well known that a complete measurement can always be represented as an unitary operation1and partial tracing. Considering this principle it is shown that quantum Mealy automata are equivalent to quantum Moore automata under the condition of the pure states.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "Lattice-valued fuzzy turing machines and their computing power\n", "abstract": " In this paper, fuzzy Turing machines with membership degrees in distributive lattices, which are called lattice-valued fuzzy Turing machines, are studied. First several formulations of lattice-valued fuzzy Turing machines, including in particular deterministic and nondeterministic lattice-valued fuzzy Turing machines (l-DTMcs and l-NTMs), are given. It is shown that l-DTMcs and l-NTMs are not equivalent as the acceptors of fuzzy languages. This contrasts sharply with classical Turing machines. Second, it is shown that lattice-valued fuzzy Turing machines can recognize n-r.e. sets in the sense of Bedregal and Figueira, the super-computing power of fuzzy Turing machines is established in the lattice-setting. Third, it is demonstrated that the truth-valued lattice being finite is a necessary and sufficient condition for the existence of a universal lattice-valued fuzzy Turing machine. For an infinite distributive lattice with a …", "num_citations": "1\n", "authors": ["1636"]}
{"title": "计量逻辑学中的收敛理论\n", "abstract": " 初步给出了计量逻辑学中的收敛理论.提出了逻辑度量空间中的度量收敛,赋值收敛和网收敛概念,对它们做出刻画并初步论证了它们之间的关系.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "计量逻辑学中的误差累计理论\n", "abstract": " 在二值逻辑系统中,初步给出了计量逻辑学中的误差累计理论.证明了逻辑结论(作为Γ结论)的误差不会超过各前提误差的和.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "模糊有穷自动机的互模拟关系\n", "abstract": " 互模拟是离散事件系统中的一个等价关系,它已经应用到概率,随机和加权自动机中.本文给出模糊有穷自动机(FFA)前向互模拟关系和后向互模拟关系的定义,并给出它们的一些性质,证明前向和后向互模拟关系对于模糊有穷自动机(FFA)的一些运算(并,连接,交)和模糊正则语言的表现定理是封闭的.另外文中还给出一个可在有限步计算极大前向互模拟关系的算法,最后指出前向和后向互模拟之间的区别.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "Fuzzy finite automata and fuzzy monadic second-order logic\n", "abstract": " We introduce fuzzy monadic second-order (LMSO-) logic and prove that the behaviours of fuzzy finite automata with membership values in an MV-algebra are precisely the fuzzy languages definable with sentences of our LMSO logic. This generalizes Buchipsilas and Elgotpsilas fundamental theorems to fuzzy logic setting. We also consider fuzzy first-order logic and show that star-free fuzzy languages and aperiodic fuzzy languages introduced here coincide with the fuzzy first-order definable ones.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "格值树自动机与格值上下文无关树文法的等价性\n", "abstract": " 本文将模糊树自动机和模糊上下文无关树文法的概念推广到格半群上.证明了在接受语言和生成语言的意义下,树自动机和上下文无关树文法是等价的.同时给出了构造正规形式的等价文法的方法.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "布尔型模糊系统逼近的充分条件\n", "abstract": " 为了保证布尔模糊系统逼近定义在紧集上任意实值连续函数的逼近精度, 给出一个估计布尔模糊系统的输入变量与输出变量各自需要构造的模糊集个数的公式, 讨论如何设计布尔模糊系统, 以便实现逼近任给的实值连续函数到需要的逼近精度. 最后通过一个例子展示了如何设计布尔模糊系统来逼近所给的连续函数的具体方法.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "Representation of RCC 11 Composition Table\n", "abstract": " This paper is mainly concerned with the relation-algebraic aspects of the well-known Region Connection Calculus (RCC). It is shown that the complemented closed disk algebra is a representation for the relation algebra determined by the RCC11 table, which was first described by Duntsch. The domain of this algebra contains two classes of regions, the closed disks and closures of their complements in the real plane, and the contact relation is the standard Whiteheadean contact.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "量子态转化的一些数学性质\n", "abstract": " 目的为研究混合量子态MLOCC和ELOCC的最大催化转化概率在一定条件下的数学性质.方法利用tensor积和量子纠缠态的有关性质.结果得出了几个关于MLOCC和ELOCC纠缠转化的定理.结论可以对量子纠缠态的转化问题作进一步的数学研究来加深对量子纠缠转化的物理理解.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "LexiT 序方法的推广\n", "abstract": " 在最大运算量为2^n的LexiT序和LexiS序的基础上,提出了新的LexiTN序和LexiSN序,这两种序保持了LexiT序和LexiS序的所有性质,且它们的最大运算量为2n-1.另外,基于广义平均算子与有序加权平均算子,提出了最大运算量为n的LexiH序与LexiF序,研究了其性质.将[0,1]^[n]上的LexiR序推广到[0,1]n上,讨论了其性质.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "New algorithms of neural fuzzy relation systems with min-implication composition\n", "abstract": " Min-implication fuzzy relation equations based on Boolean-type implications can also be viewed as a way of implementing fuzzy associative memories with perfect recall. In this paper, fuzzy associative memories with perfect recall are constructed, and new on-line learning algorithms adapting the weights of its interconnections are incorporated into this neural network when the solution set of the fuzzy relation equation is non-empty. These weight matrices are actually the least solution matrix and all maximal solution matrices of the fuzzy relation equation, respectively. The complete solution set of min-implication fuzzy relation equation can be determined by the maximal solution set of this equation.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "格值正则语言的性质\n", "abstract": " 给出了格值正则文法与格值正则语言的定义.从文法的角度来研究语言的性质,讨论了格植正则语言关于正则运算的封闭性及其条件.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "格值正则文法及其语言的性质\n", "abstract": " 给出了(确定)格值正则文法与(确定)格值正则语言的定义.从一个新的角度,即文法的角度研究确定格值正则语言关于正则运算的封闭性,从而完善了格值正则语言的运算性质,并给出了格值正则文法与确定格值正则文法等价的条件.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "Constructions of Some Quantum Structures and Fuzzy Effect Space\n", "abstract": " Quantum structures like effect algebras, σ-effect algebras, orthoalgebras, orthomodular posets, and σ-orthomodular posets are constructed by use of special fuzzy sets on posets. The concept of fuzzy effect space is introduced and a representation of a lattice effect algebra with a strong order determining system of states by means of fuzzy effect space is established.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "Anti-BZ-structure in effect algebras\n", "abstract": " The definitions of sharply approximating effect algebras, anti-BZ-effect algebras, central approximating effect algebras, and S-anti-BZ-effect algebras are given, the relationships between sharply approximating effect algebras and anti-BZ-effect algebras, between central approximating effect algebras and anti-BZ-effect algebras are established, and the set of anti-BZ-sharp elements in S-anti-BZ-effect algebras is proved to be an orthomodular lattice.", "num_citations": "1\n", "authors": ["1636"]}
{"title": "The Structures of Lower Convergence over Continuous Posets [J]\n", "abstract": " In this paper, the structutes of convergence nets with reapect to Scott topology and Lawson topology over continuous posets are exploited by introducing the concepts of lower-convergence and Lower-level-convergence. And the theory of lower-convergence over continuous posets is founded fully.", "num_citations": "1\n", "authors": ["1636"]}