{"title": "Multiobjective flexible job shop scheduling using memetic algorithms\n", "abstract": " In this paper, we propose new memetic algorithms (MAs) for the multiobjective flexible job shop scheduling problem (MO-FJSP) with the objectives to minimize the makespan, total workload, and critical workload. The problem is addressed in a Pareto manner, which aims to search for a set of Pareto optimal solutions. First, by using well-designed chromosome encoding/decoding scheme and genetic operators, the nondominated sorting genetic algorithm II (NSGA-II) is adapted for the MO-FJSP. Then, our MAs are developed by incorporating a novel local search algorithm into the adapted NSGA-II, where some good individuals are chosen from the offspring population for local search using a selection mechanism. Furthermore, in the proposed local search, a hierarchical strategy is adopted to handle the three objectives, which mainly considers the minimization of makespan, while the concern of the other two …", "num_citations": "183\n", "authors": ["565"]}
{"title": "A QoS-aware virtual machine scheduling method for energy conservation in cloud-based cyber-physical systems\n", "abstract": " Nowadays, with the development of cyber-physical systems (CPS), there are an increasing amount of applications deployed in the CPS to connect cyber space with physical world better and closer than ever. Furthermore, the cloud-based CPS bring massive computing and storage resource for CPS, which enables a wide range of applications. Meanwhile, due to the explosive expansion of applications deployed on the CPS, the energy consumption of the cloud-based CPS has received wide concern. To improve the energy efficiency in the cloud environment, the virtualized technology is employed to manage the resources, and the applications are generally hosted by virtual machines (VMs). However, it remains challenging to meet the Quality-of-Service (QoS) requirements. In view of this challenge, a QoS-aware VM scheduling method for energy conservation, named QVMS, in cloud-based CPS is …", "num_citations": "164\n", "authors": ["565"]}
{"title": "A hybrid harmony search algorithm for the flexible job shop scheduling problem\n", "abstract": " In this paper, a novel hybrid harmony search (HHS) algorithm based on the integrated approach, is proposed for solving the flexible job shop scheduling problem (FJSP) with the criterion to minimize makespan. First of all, to make the harmony search (HS) algorithm adaptive to the FJSP, the converting techniques are developed to convert the continuous harmony vector to a kind of discrete two-vector code for the FJSP. Secondly, the harmony vector is mapped into a feasible active schedule through effectively decoding the transformed two-vector code, which could largely reduce the search space. Thirdly, a resultful initialization scheme combining heuristic and random strategies is introduced to make the initial harmony memory (HM) occur with certain quality and diversity. Furthermore, a local search procedure is embedded in the HS algorithm to enhance the local exploitation ability, whereas HS is employed to …", "num_citations": "161\n", "authors": ["565"]}
{"title": "An improved NSGA-III procedure for evolutionary many-objective optimization\n", "abstract": " Many-objective (four or more objectives) optimization problems pose a great challenge to the classical Pareto-dominance based multi-objective evolutionary algorithms (MOEAs), such as NSGA-II and SPEA2. This is mainly due to the fact that the selection pressure based on Pareto-dominance degrades severely with the number of objectives increasing. Very recently, a reference-point based NSGA-II, referred as NSGA-III, is suggested to deal with many-objective problems, where the maintenance of diversity among population members is aided by supplying and adaptively updating a number of well-spread reference points. However, NSGA-III still relies on Pareto-dominance to push the population towards Pareto front (PF), leaving room for the improvement of its convergence ability. In this paper, an improved NSGA-III procedure, called θ-NSGA-III, is proposed, aiming to better tradeoff the convergence and …", "num_citations": "154\n", "authors": ["565"]}
{"title": "An edge computing-enabled computation offloading method with privacy preservation for internet of connected vehicles\n", "abstract": " The Internet of connected vehicles (IoV) is employed to collect real-time traffic conditions for transportation control systems, and the computing tasks are available to be offloaded from the vehicles to the edge computing devices (ECDs) for implementation. Despite numerous benefits of IoV and ECDs, the wireless communication for computation offloading increases the risk of privacy leakage, which may consequently lead to tracking, identity tampering and virtual vehicle hijacking. Therefore, it remains a challenge to avoid privacy conflicts for computation offloading to the ECDs in IoV. To address this challenge, an edge computing-enabled computation offloading method, named ECO, with privacy preservation for IoV is proposed in this paper. Technically, the privacy conflicts of the computing tasks in IoV are analyzed in a formalized way. Then, vehicle-to-vehicle (V2V) communication-based routing for a vehicle is …", "num_citations": "149\n", "authors": ["565"]}
{"title": "Evolutionary multitasking for multi-objective continuous optimization: Benchmark problems, performance metrics and baseline results\n", "abstract": " In this report, we suggest nine test problems for multi-task multi-objective optimization (MTMOO), each of which consists of two multiobjective optimization tasks that need to be solved simultaneously. The relationship between tasks varies between different test problems, which would be helpful to have a comprehensive evaluation of the MO-MFO algorithms. It is expected that the proposed test problems will germinate progress the field of the MTMOO research.", "num_citations": "117\n", "authors": ["565"]}
{"title": "Flexible job shop scheduling using hybrid differential evolution algorithms\n", "abstract": " This paper proposes hybrid differential evolution (HDE) algorithms for solving the flexible job shop scheduling problem (FJSP) with the criterion to minimize the makespan. Firstly, a novel conversion mechanism is developed to make the differential evolution (DE) algorithm that works on the continuous domain adaptive to explore the problem space of the discrete FJSP. Secondly, a local search algorithm based on the critical path is embedded in the DE framework to balance the exploration and exploitation by enhancing the local searching ability. In addition, in the local search phase, the speed-up method to find an acceptable schedule within the neighborhood structure is presented to improve the efficiency of whole algorithms. Extensive computational results and comparisons show that the proposed algorithms are very competitive with the state of the art, some new best known solutions for well known benchmark …", "num_citations": "108\n", "authors": ["565"]}
{"title": "ARJA: Automated Repair of Java Programs via Multi-Objective Genetic Programming\n", "abstract": " Automated program repair is the problem of automatically fixing bugs in programs in order to significantly reduce the debugging costs and improve the software quality. To address this problem, test-suite based repair techniques regard a given test suite as an oracle and modify the input buggy program to make the entire test suite pass. GenProg is well recognized as a prominent repair approach of this kind, which uses genetic programming (GP) to rearrange the statements already extant in the buggy program. However, recent empirical studies show that the performance of GenProg is not fully satisfactory, particularly for Java. In this paper, we propose ARJA, a new GP based repair approach for automated repair of Java programs. To be specific, we present a novel lower-granularity patch representation that properly decouples the search subspaces of likely-buggy locations, operation types and potential fix …", "num_citations": "77\n", "authors": ["565"]}
{"title": "An integrated search heuristic for large-scale flexible job shop scheduling problems\n", "abstract": " The flexible job shop scheduling problem (FJSP) is a generalization of the classical job shop scheduling problem (JSP), where each operation is allowed to be processed by any machine from a given set, rather than one specified machine. In this paper, two algorithm modules, namely hybrid harmony search (HHS) and large neighborhood search (LNS), are developed for the FJSP with makespan criterion. The HHS is an evolutionary-based algorithm with the memetic paradigm, while the LNS is typical of constraint-based approaches. To form a stronger search mechanism, an integrated search heuristic, denoted as HHS/LNS, is proposed for the FJSP based on the two algorithms, which starts with the HHS, and then the solution is further improved by the LNS. Computational simulations and comparisons demonstrate that the proposed HHS/LNS shows competitive performance with state-of-the-art algorithms on …", "num_citations": "76\n", "authors": ["565"]}
{"title": "Evolutionary Multitasking in Permutation-Based Combinatorial Optimization Problems: Realization with TSP, QAP, LOP, and JSP\n", "abstract": " Evolutionary computation (EC) has gained increasing popularity in dealing with permutation-based combinatorial optimization problems (PCOPs). Traditionally, EC focuses on solving a single optimization task at a time. However, in complex multi-echelon supply chain networks (SCNs), there usually exist various kinds of PCOPs at the same time, e.g., travel salesman problem (TSP), job-shop scheduling problem (JSP), etc. So, it is desirable to solve several PCOPs at once with both effectiveness and efficiency. Very recently, a new paradigm in EC, namely, multifactorial optimization (MFO) has been introduced to explore the potential of evolutionary multitasking, which can serve the purpose of simultaneously optimizing multiple PCOPs in SCNs. In this paper, the evolutionary multitasking of PCOPs is studied. In particular, based on a recently proposed multitasking engine known as the multifactorial evolutionary …", "num_citations": "75\n", "authors": ["565"]}
{"title": "Objective Reduction in Many-Objective Optimization: Evolutionary Multiobjective Approaches and Comprehensive Analysis\n", "abstract": " Many-objective optimization problems bring great difficulties to the existing multiobjective evolutionary algorithms, in terms of selection operators, computational cost, visualization of the high-dimensional tradeoff front, and so on. Objective reduction can alleviate such difficulties by removing the redundant objectives in the original objective set, which has become one of the most important techniques in many-objective optimization. In this paper, we suggest to view objective reduction as a multiobjective search problem and introduce three multiobjective formulations of the problem, where the first two formulations are both based on preservation of the dominance structure and the third one utilizes the correlation between objectives. For each multiobjective formulation, a multiobjective objective reduction algorithm is proposed by employing the nondominated sorting genetic algorithm II to generate a Pareto front of …", "num_citations": "61\n", "authors": ["565"]}
{"title": "Multiobjective computation offloading for workflow management in cloudlet‐based mobile cloud using NSGA‐II\n", "abstract": " Cloudlet is a novel computing paradigm, introduced to the mobile cloud service framework, which moves the computing resources closer to the mobile users, aiming to alleviate the communication delay between the mobile devices and the cloud platform and optimize the energy consumption for mobile devices. Currently, the mobile applications, modeled by the workflows, tend to be complicated and computation‐intensive. Such workflows are required to be offloaded to the cloudlet or the remote cloud platform for execution. However, it is still a key challenge to determine the offloading resolvent for the deadline‐constrained workflows in the cloudlet‐based mobile cloud, since a cloudlet often has limited resources. In this paper, a multiobjective computation offloading method, named MCO, is proposed to address the above challenge. Technically, an energy consumption model for the mobile devices is established …", "num_citations": "32\n", "authors": ["565"]}
{"title": "Blockchain-based cloudlet management for multimedia workflow in mobile cloud computing\n", "abstract": " For the issue of users’ sensibility to the QoS (Quality of Service) of multimedia applications, cloudlet has emerged as a novel paradigm which provides closer computing resources to users to improve the performance of multimedia applications and meet the QoS demands of users. However, the increasing users’ requirements of migrating tasks pose a challenge to preserve the security and integrity of offloaded data which are processed by cloudlets. In view of this challenge, a blockchain-based cloudlet management method for multimedia workflow, named MWSM, is proposed in this paper. Technically, we first model each multimedia application as a multimedia workflow and formulate the multimedia workflow scheduling problem. Then, blockchain is adopted to secure the data integrity during the offloading procedure. Besides, NSGA-III (Non-dominated Sorting Genetic Algorithm III) is employed to realize …", "num_citations": "24\n", "authors": ["565"]}
{"title": "An Experimental Investigation of Variation Operators in Reference-Point Based Many-Objective Optimization\n", "abstract": " Reference-point based multi-objective evolutionary algorithms (MOEAs) have shown promising performance in many-objective optimization. However, most of existing research within this area focused on improving the environmental selection procedure, and little work has been done on the effect of variation operators. In this paper, we conduct an experimental investigation of variation operators in a typical reference-point based MOEA, ie, NSGA-III. First, we provide a new NSGA-III variant, ie, NSGA-III-DE, which introduces differential evolution (DE) operator into NSGA-III, and we further examine the effect of two main control parameters in NSGA-III-DE. Second, we have an experimental analysis of the search behavior of NSGA-III-DE and NSGA-III. We observe that NSGA-III-DE is generally better at exploration whereas NSGA-III normally has advantages in exploitation. Third, based on this observation, we present …", "num_citations": "21\n", "authors": ["565"]}
{"title": "Evolutionary many-objective optimization using ensemble fitness ranking\n", "abstract": " In this paper, a new framework, called ensemble fitness ranking (EFR), is proposed for evolutionary many-objective optimization that allows to work with different types of fitness functions and ensemble ranking schemes. The framework aims to rank the solutions in the population more appropriately by combing the ranking results from many simple individual rankers. As to the form of EFR, it can be regarded as an extension of average and maximum ranking methods which have been shown promising for many-objective problems. The significant change is that EFR adopts more general fitness functions instead of objective functions, which would make it easier for EFR to balance the convergence and diversity in many-objective optimization. In the experimental studies, the influence of several fitness functions and ensemble ranking schemes on the performance of EFR is fist investigated. Afterwards, EFR is compared …", "num_citations": "20\n", "authors": ["565"]}
{"title": "Toward Better Evolutionary Program Repair: An Integrated Approach\n", "abstract": " Bug repair is a major component of software maintenance, which requires a huge amount of manpower. Evolutionary computation, particularly genetic programming (GP), is a class of promising techniques for automating this time-consuming and expensive process. Although recent research in evolutionary program repair has made significant progress, major challenges still remain. In this article, we propose ARJA-e, a new evolutionary repair system for Java code that aims to address challenges for the search space, search algorithm, and patch overfitting. To determine a search space that is more likely to contain correct patches, ARJA-e combines two sources of fix ingredients (i.e., the statement-level redundancy assumption and repair templates) with contextual analysis-based search space reduction, thereby leveraging their complementary strengths. To encode patches in GP more properly, ARJA-e unifies the …", "num_citations": "12\n", "authors": ["565"]}
{"title": "A Heuristic Virtual Machine Scheduling Method for Load Balancing in Fog-Cloud Computing\n", "abstract": " Fog computing is emerging as a powerful and popular computing paradigm, which extends cloud computing paradigm to enable the service execution in the edge network. The mobile and IoT (Internet of Things) applications could choose the computing nodes in both fog and cloud for resource provisioning. Generally, load balancing is one of the key factors to achieve resource efficiency and avoid bottleneck, overloaded and low-load resource usage. However, it is still a challenge to realize the load balancing for the computing nodes in the fog-cloud environment. In view of this challenge, a Virtual Machine (VM) scheduling method for load balancing in fog-cloud computing is proposed in this paper. Technically, a resource model and a load balancing model are analyzed first. Then a heuristic VM scheduling method is designed through VM placement and dynamic VM scheduling by leveraging the VM live migration …", "num_citations": "12\n", "authors": ["565"]}
{"title": "On the Emerging Notion of Evolutionary Multitasking: A Computational Analog of Cognitive Multitasking\n", "abstract": " Over the past decades, Evolutionary Computation (EC) has surfaced as a popular paradigm in the domain of computational intelligence for global optimization of complex multimodal functions. The distinctive feature of an Evolutionary Algorithm (EA) is the emergence of powerful implicit parallelism as an offshoot of the simple rules of population-based search. However, despite the known advantages of implicit parallelism, it is interesting to note that EAs have almost exclusively been developed to solve only a single optimization problem at a time; seldom has any effort been made to multitask, i.e., to tackle multiple self-contained optimization problems concurrently using the same population of evolving individuals. To this end, inspired by the remarkable ability of the human brain to perform multiple tasks with apparent simultaneity, we present evolutionary multitasking as an intriguing direction for EC research …", "num_citations": "9\n", "authors": ["565"]}
{"title": "Intrusion detection and prevention in cloud, fog, and internet of things\n", "abstract": " We are pleased to announce the publication of the special issue focusing on intrusion detection and prevention in cloud, fog, and Internet of Things (IoT). Internet of Things (IoT), cloud, and fog computing paradigms are as a whole provision a powerful large-scale computing infrastructure for many data and computation intensive applications. Specifically, the IoT technologies and deployment can widely perceive our physical world at a fine granularity and generate sensing data for further insight extraction. The fog computing facilities can provide computing power near the IoT devices where data are generated, aiming to achieve fast data processing for time critical applications or save the amount of data transmitted into cloud for storage or further processing. The cloud computing platforms can offer big data storage and large-scale processing services for cheap long-term storage or data intensive analytics with more advanced data mining models. Hence, it can be seen that the IoT/fog/cloud computing infrastructures can support the whole lifecycle of large-scale applications where big data collection, transmission, storage, processing, and mining can be seamlessly integrated. However, these state-of-the-art computing infrastructures still suffer from severe security and privacy threats because of their built-in properties such as the ubiquitous-access and multitenancy features of cloud computing, or the limited computing capability of IoT devices. The expanded attack surface and the lack of effective security and privacy protection measures are still one of the barriers of widely deploying applications on the IoT/fog/cloud infrastructure.Intrusion detection …", "num_citations": "8\n", "authors": ["565"]}
{"title": "A memetic algorithm for the multi-objective flexible job shop scheduling problem\n", "abstract": " In this paper, a new memetic algorithm (MA) is proposed for the muti-objective flexible job shop scheduling problem (MO-FJSP) with the objectives to minimize the makespan, total workload and critical workload. By using well-designed chromosome encoding/decoding scheme and genetic operators, the non-dominated sorting genetic algorithm II (NSGA-II) is first adapted for the MO-FJSP. Then the MA is developed by incorporating a novel local search algorithm into the adapted NSGA-II, where several mechanisms to balance the genetic search and local search are employed. In the proposed local search, a hierarchical strategy is adopted to handle the three objectives, which mainly considers the minimization of makespan, while the concern of the other two objectives is reflected in the order of trying all the possible actions that could generate the acceptable neighbor. Experimental results on well-known …", "num_citations": "8\n", "authors": ["565"]}
{"title": "Scale adaptive reproduction operator for decomposition based estimation of distribution algorithm\n", "abstract": " Multi-objective evolutionary algorithm based on decomposition (MOEA/D) uses crossover operator which often either breaks the building blocks or mix them ineffectively. Multi-objective estimation of distribution algorithm based on decomposition (MEDA/D) evolves a probability vector for each sub-problem to guide the search instead of using crossover operator.However, since the number of the weight vectors in the neighborhood of each weight vector is relatively small and MEDA/D does not provide a way to maintain diversity, the performance of MEDA/D is limited. To overcome the drawbacks of MEDA/D, we proposed a new reproduction operator. This operator could promote diversity. We introduced it into MOEA/D framework and the new algorithm is called s-MEDA/D. We also prove that the parameter newly introduced has physical significance and the reproduction operator is not susceptible to the scale of the …", "num_citations": "7\n", "authors": ["565"]}
{"title": "A Workflow Scheduling Method for Cloudlet Management in Mobile Cloud\n", "abstract": " Cloudlet has emerged as a new paradigm to improve the ability to perform complex computations in mobile cloud computing. However, cloudlet suffers from the challenge of inefficient resource utilization as most of the times it operates below optimum resource utilization conditions. This results in waste of vital resources and increase in computation cost. So keeping in view this challenge, in this paper, a Workflow Scheduling Method (WSM) for cloudlet is proposed, which leverages Genetic Algorithm (GA) for efficient work flow tasks scheduling. Extensive experiments are performed to compare WSM with state of the art work flow task management method MCGA and Benchmark algorithm GA. Experimental evaluation shows that WSM outperforms both techniques and reduce the time cost of workflows and optimize the resource utilization of the cloudlet.", "num_citations": "5\n", "authors": ["565"]}
{"title": "HHS/LNS: An integrated search method for flexible job shop scheduling\n", "abstract": " The flexible job shop scheduling problem (FJSP) is a generalization of the classical job shop scheduling problem (JSP), where each operation is allowed to be processed by any machine from a given set, rather than one specified machine. In this paper, two algorithm modules, namely, hybrid harmony search (HHS) and large neighborhood search (LNS) are developed for the FJSP with makespan criterion. The HHS is an evolutionary-based algorithm with the memetic paradigm, while the LNS is typical of constraint-based approaches. To form a stronger search mechanism, an integrated search method is proposed for the FJSP based on the two algorithms, which starts with the HHS, and then the solution is further improved by the LNS. Computational simulations and comparisons demonstrate that, the proposed HHS alone can effectively solve some medium to large FJSP instances, when integrated with the LNS, it …", "num_citations": "4\n", "authors": ["565"]}
{"title": "Frequent pattern mining assisted energy consumption evolutionary optimization approach based on surrogate model at GCC compile time\n", "abstract": " The evolutionary algorithms have been used to improve the energy consumption of embedded software by searching the optimal compilation options of GCC compiler. However, these algorithms do not consider the complex multivariate interactions between compilation options, which has negative effect on solution quality and convergence rate. Furthermore, it is also not investigated how to reduce the computational cost incurred by fitness evaluation using adaptive surrogate models. To address these problems, a novel approach to energy consumption optimization at GCC compile time, named FACET, is proposed in this paper. Firstly, the high-frequency multivariate interactions with positive effect on energy consumption are captured during evolution by our proposed frequent patterns mining algorithm. Secondly, the captured multivariate positive interactions are regarded as heuristic knowledge to guide the …", "num_citations": "3\n", "authors": ["565"]}
{"title": "Quantum-inspired evolutionary algorithm with linkage learning\n", "abstract": " The quantum-inspired evolutionary algorithm (QEA) uses several quantum computing principles to optimize problems on a classical computer. QEA possesses a number of quantum individuals, which are all probability vectors. They work well for linear problems but fail on problems with strong interactions among variables. Moreover, many optimization problems have multiple global optima. And because of the genetic drift, these problems are difficult for evolutionary algorithms to find all global optima. Local and global migration that QEA uses to synchronize different individuals prevent QEA from finding multiple optima. To overcome these difficulties, we proposed a quantum-inspired evolutionary algorithm with linkage learning (QEALL). QEALL uses a modified concept-guide operator based on low order statistics to learn linkage. We also replaced the migration procedure by a niching technology to prevent genetic …", "num_citations": "3\n", "authors": ["565"]}
{"title": "Making Better Use of Repair Templates in Automated Program Repair: A Multi-Objective Approach\n", "abstract": " The automation of program repair can be coached in terms of search algorithms. Repair templates derived from common bug-fix patterns can be used to determine a promising search space with potentially many correct patches, a space that can be effectively explored by GP methods. Here we propose a new repair system, ARJA-p, extended from our earlier ARJA system of bug repair for JAVA, which integrates and enhances the performance of the first approach that combines repair templates and EC, PAR. Empirical results on 224 real bugs in Defects4J show that ARJA-p outperforms state-of-the-art repair approaches by a large margin, both in terms of the number of bugs fixed and of their correctness. Specifically, ARJA-p can increase the number of fixed bugs in Defects4J by 29.2% (from 65 to 84) and the number of correctly fixed bugs by 42.3% (from 26 to 37).", "num_citations": "2\n", "authors": ["565"]}
{"title": "Joint optimization of energy conservation and migration cost for complex systems in edge computing\n", "abstract": " By means of the complex systems, multiple renewable energy sources are integrated to provide energy supply for users. Considering that there are massive services needed to process in complex systems, the mobile services are offloaded from mobile devices to edge servers for efficient implementation. In spite of the benefits of complex systems and edge servers, massive resource requirements for implementing the increasing resource requests decrease the execution efficiency and affect the whole resource usage of edge servers. Therefore, it remains an issue to achieve dynamic scheduling of the computing resources across edge servers. With the consideration of this issue, a Balanced Resource Scheduling Method, named BRSM, for trade-offs between virtual machine (VM) migration cost and energy consumption of VM migrations for edge server management, named BRSM, is designed in this paper. Technically, we analyze the load conditions of edge servers and formulate the energy consumption of VM migrations and VM migration cost as a multi-objective optimization problem. Then, we propose a dynamic resource scheduling method for WMAN to deal with the multi-objective optimization problem. In addition, nondominated sorting genetic algorithm III (NSGA-III) is adopted to generate optimal resource scheduling strategies. Finally, we conduct experiment simulations to testify the efficiency of the proposed method BRSM.", "num_citations": "2\n", "authors": ["565"]}
{"title": "Noisy multiobjective black-box optimization using bayesian optimization\n", "abstract": " Expensive black-box problems are usually optimized by Bayesian Optimization (BO) since it can reduce evaluation costs via cheaper surrogates. The most popular model used in Bayesian Optimization is the Gaussian process (GP) whose posterior is based on a joint GP prior built by initial observations, so the posterior is also a Gaussian process. Observations are often not noise-free, so in most of these cases, a noisy transformation of the objective space is observed. Many single objective optimization algorithms have succeeded in extending efficient global optimization (EGO) to noisy circumstances, while ParEGO fails to consider noise. In order to deal with noisy expensive black-box problems, we extending ParEGO to noisy optimization according to adding a Gaussian noisy error while approximating the surrogate. We call it noisy-ParEGO and results of S-metric indicate that the algorithm works well on …", "num_citations": "2\n", "authors": ["565"]}
{"title": "A hybrid evolutionary system for automatic software repair\n", "abstract": " This paper presents an automatic software repair system that combines the characteristic components of several typical evolutionary computation based repair approaches into a unified repair framework so as to take advantage of their respective component strengths. We exploit both the redundancy assumption and repair templates to create a search space of candidate repairs. Then we employ a multi-objective evolutionary algorithm with a low-granularity patch representation to explore this search space, in order to find simple patches. In order to further reduce the search space and alleviate patch overfitting we introduce replacement similarity and insertion relevance to select more related statements as promising fix ingredients, and we adopt anti-patterns to customize the available operation types for each likely-buggy statement. We evaluate our system on 224 real bugs from the Defects4J dataset in …", "num_citations": "2\n", "authors": ["565"]}
{"title": "Guest Editorial Special Issue on Privacy and Security in Computational Intelligence\n", "abstract": " Guest Editorial Special Issue on Privacy and Security in Computational Intelligence — Macquarie University Skip to main navigation Skip to search Skip to main content Macquarie University Logo Help & FAQ Home Profiles Research Units Projects Research Outputs Prizes Activities Press / Media Impacts Search by expertise, name or affiliation Guest Editorial Special Issue on Privacy and Security in Computational Intelligence Yuan Yuan, Xuyun Zhang, Jie Tang Department of Computing Research output: Contribution to journal › Editorial Overview Original language English Pages (from-to) 590-592 Number of pages 3 Journal IEEE Transactions on Emerging Topics in Computational Intelligence Volume 4 Issue number 5 DOIs https://doi.org/10.1109/TETCI.Publication status Published - Oct 2020 Access to Document 10.1109/TETCI.Link to publication in Scopus Cite this APA Author BIBTEX Harvard Standard RIS …", "num_citations": "1\n", "authors": ["565"]}
{"title": "Balancing exploration and exploitation in multiobjective batch bayesian optimization\n", "abstract": " Many applications such as hyper-parameter tunning in Machine Learning can be casted to multiobjective black-box problems and it is challenging to optimize them. Bayesian Optimization (BO) is an effective method to deal with black-box functions. This paper mainly focuses on balancing exploration and exploitation in multi-objective black-box optimization problems by multiple samplings in BBO. In each iteration, multiple recommendations are generated via two different trade-off strategies respectively the expected improvement (EI) and a multiobjective framework with the mean and variance function of the GP posterior forming two conflict objectives. We compare our algorithm with ParEGO by running on 12 test functions. Hypervolume (HV, also known as S-metric) results show that our algorithm works well in exploration-exploitation trade-off for multiobjective black-box optimization problems.", "num_citations": "1\n", "authors": ["565"]}