{"title": "Genome-wide dynamics of Htz1, a histone H2A variant that poises repressed/basal promoters for activation through histone loss\n", "abstract": " Histone variants help specialize chromatin regions; however, their impact on transcriptional regulation is largely unknown. Here, we determined the genome-wide localization and dynamics of Htz1, the yeast histone H2A variant. Htz1 localizes to hundreds of repressed/basal Pol II promoters and prefers TATA-less promoters. Specific Htz1 deposition requires the SWR1 complex, which largely colocalizes with Htz1. Htz1 occupancy correlates with particular histone modifications, and Htz1 deposition is partially reliant on Gcn5 (a histone acetyltransferase) and Bdf1, an SWR1 complex member that binds acetylated histones. Changes in growth conditions cause a striking redistribution of Htz1 from activated to repressed/basal promoters. Furthermore, Htz1 promotes full gene activation but does not generally impact repression. Importantly, Htz1 releases from purified chromatin in vitro under conditions where H2A and H3 …", "num_citations": "611\n", "authors": ["378"]}
{"title": "The Yaf9 component of the SWR1 and NuA4 complexes is required for proper gene expression, histone H4 acetylation, and Htz1 replacement near telomeres\n", "abstract": " Yaf9, Taf14, and Sas5 comprise the YEATS domain family in Saccharomyces cerevisiae, which in humans includes proteins involved in acute leukemias. The YEATS domain family is essential, as a yaf9Δ taf14Δ sas5Δ triple mutant is nonviable. We verify that Yaf9 is a stable component of NuA4, an essential histone H4 acetyltransferase complex. Yaf9 is also associated with the SWR1 complex, which deposits the histone H2A variant Htz1. However, the functional contribution of Yaf9 to these complexes has not been determined. Strains lacking YAF9 are sensitive to DNA-damaging agents, cold, and caffeine, and the YEATS domain is required for full Yaf9 function. NuA4 lacking Yaf9 retains histone acetyltransferase activity in vitro, and Yaf9 does not markedly reduce bulk H4 acetylation levels, suggesting a role for Yaf9 in the targeting or regulation of NuA4. Interestingly, yaf9Δ strains display reduced transcription of …", "num_citations": "140\n", "authors": ["378"]}
{"title": "Self-adaptive Monte Carlo localization for mobile robots using range finders\n", "abstract": " In order to achieve the autonomy of mobile robots, effective localization is a necessary prerequisite. In this paper, we propose an improved Monte Carlo localization algorithm using self-adaptive samples (abbreviated as SAMCL). By employing a pre-caching technique to reduce the online computational burden, SAMCL is more efficient than the regular MCL. Further, we define the concept of similar energy region (SER), which is a set of poses (grid cells) having similar energy with the robot in the robot space. By distributing global samples in SER instead of distributing randomly in the map, SAMCL obtains a better performance in localization. Position tracking, global localization and the kidnapped robot problem are the three sub-problems of the localization problem. Most localization approaches focus on solving one of these sub-problems. However, SAMCL solves all the three sub-problems together, thanks to self …", "num_citations": "72\n", "authors": ["378"]}
{"title": "Self-adaptive Monte Carlo localization for mobile robots using range sensors\n", "abstract": " In order to achieve the autonomy of mobile robots, effective localization is a necessary prerequisite. In this paper, we propose an improved Monte Carlo localization using self-adaptive samples, abbreviated as SAMCL. This algorithm employs a pre-caching technique to reduce the on-line computational burden. Further, we define the concept of similar energy region (SER), which is a set of poses (grid cells) having similar energy with the robot in the robot space. By distributing global samples in SER instead of distributing randomly in the map, SAMCL obtains a better performance in localization. Position tracking, global localization and the kidnapped robot problem are the three sub-problems of the localization problem. Most localization approaches focus on solving one of these sub-problems. However, SAMCL solves all these three sub-problems together thanks to self-adaptive samples that can automatically …", "num_citations": "45\n", "authors": ["378"]}
{"title": "Robust adaptive integral backstepping control of a 3-DOF helicopter\n", "abstract": " Unmanned aerial vehicles have enormous potential applications in military and civil fields. A Quanser's 3-DOF helicopter is a simplified and benchmark experimental model for validating the effectiveness of various flight control algorithms. The attitude control of the 3-DOF helicopter is a challenging task since the helicopter is an under-actuated system with strong coupling and model uncertainty characteristics. In this paper, an adaptive integral backstepping algorithm is proposed to realize robust control of the 3-DOF helicopter. The proposed control algorithm can estimate model uncertainties online and improve the robustness of the control system. Simulation and experiment results demonstrate that the proposed algorithm performs well in tracking and under model uncertainties.", "num_citations": "31\n", "authors": ["378"]}
{"title": "3d reconstruction of seabed surface through sonar data of auvs\n", "abstract": " Autonomous underwater vehicles (AUVs) are widely used to explore the mysterious underwater world. Following along predefined spatial paths, AUVs are able to gather valuable seabed information in a designated area by recruiting sonar suites. The acoustic data collected by AUVs are usually in the type of point cloud with range information. Hence, how to reconstruct the topography of seabed via 3D point cloud data is the key to build the 3D seabed map. In order to address the problem, the paper presents a practical mesh method to achieve an accurate reconstruction of seabed surface from raw sonar records. Sonar data processing consists of three stages: point clearing, point normal and 3D surface reconstruction. Simulation results show the effectiveness of the proposed approach.", "num_citations": "30\n", "authors": ["378"]}
{"title": "DNA methylation profiling in zebrafish\n", "abstract": " DNA methylation on cytosine in vertebrates such as zebrafish serves to silence gene expression by interfering with the binding of certain transcription factors and through the recruitment of repressive chromatin machinery. Cytosine DNA methylation is chemically stable and heritable through the germline – but also reversible through many modes, making it a useful and dynamic epigenetic modification. Virtually all of the enzymes and factors involved in the deposition, binding, and removal of cytosine methylation are conserved in zebrafish, and therefore the organism an excellent model for understanding the use of DNA methylation in the control of gene regulation and other processes. Here, we discuss the main approaches to quantifying DNA methylation levels genome-wide in zebrafish: one is an established method for revealing regional methylation (methylated DNA immunoprecipitation (MeDIP)), and the other …", "num_citations": "30\n", "authors": ["378"]}
{"title": "Self-adaptive monte carlo for single-robot and multi-robot localization\n", "abstract": " In order to achieve the autonomy of mobile robots, effective localization is a necessary prerequisite. In this paper, we propose an improved Monte Carlo localization using self-adaptive samples, abbreviated as SAMCL. This algorithm is able to solve the multi-robot localization problem as well as the single-robot localization problem. By employing a pre-caching technique to reduce the on-line computational burden, SAMCL is more efficient than regular MCL. We define the concept of Similar Energy Region (SER), which is a set of grid cells having similar energy with the robot in the robot space. By distributing global samples in SER instead of distributing randomly in the map, SAMCL obtains a better performance in localization. Thanks to self-adaptive samples that can automatically separate themselves into a global sample set and a local sample set according to need, SAMCL can solve position tracking, global …", "num_citations": "20\n", "authors": ["378"]}
{"title": "A three-level component model in component based software development\n", "abstract": " Component-based development promotes a software development process that focuses on component reuse. How to describe a desired component before searching in the repository? How to find an existing component that fulfills the required functionalities? How to capture the system personalization based on its constitutive components' customization? To answer these questions, this paper claims that components should be described using three different forms at three development stages: architecture specification, configuration and assembly. However, no architecture description language proposes such a detailed description for components that supports such a three step component-based development. This paper proposes a three-level Adl, named Dedal, that enables the explicit and separate definitions of component roles, component classes, and component instances.", "num_citations": "19\n", "authors": ["378"]}
{"title": "A formal approach for managing component-based architecture evolution\n", "abstract": " Software architectures are subject to several types of change during the software lifecycle (e.g. adding requirements, correcting bugs, enhancing performance). The variety of these changes makes architecture evolution management complex because all architecture descriptions must remain consistent after change. To do so, whatever part of the architectural description they affect, the effects of change have to be propagated to the other parts. The goal of this paper is to provide support for evolving component-based architectures at multiple abstraction levels. Architecture descriptions follow an architectural model named Dedal, the three description levels of which correspond to the three main development steps – specification, implementation and deployment. This paper formalizes an evolution management model that generates evolution plans according to a given architecture change request, thus preserving …", "num_citations": "17\n", "authors": ["378"]}
{"title": "Architecture-centric development and evolution processes for component-based software\n", "abstract": " Component-based development focuses on component reuse and composition: abstract components (as wished) must be searched for and matched to existing component (as found). This search and reuse activity greatly impacts software development and evolution processes. Unfortunately, very few works propose adaptations of traditional software engineering processes and no existing ADL yet permits to describe the resulting development artifacts. This paper proposes architecture-centric processes for the development and evolution of component-based software. Architecture-centric development produces descriptions for architecture specification, architecture configuration and component assembly. The paper shows how Dedal, a three-level ADL, can be used to support the consistent description of these three artifacts. The paper then shows how these descriptions can be used during a controlled architecturecentric evolution process that helps build, test and record versions of component-based software. This tackles the well-known issues of architecture erosion and drift that denote mismatches between the different architecture definitions.", "num_citations": "10\n", "authors": ["378"]}
{"title": "Connector-driven process for the gradual evolution of component-based software\n", "abstract": " Large, complex and long-lived software need to be upgraded at runtime. Addition, removal and replacement of a software component are the elementary evolution operations that have to be supported. Yet, dynamic changes are errorprone as it is difficult to guarantee that the new system will still work and that all functionalities and quality are preserved. Few existing work on ADLs fully support component addition, removal and substitution processes from their description to their test and validation. The main idea of this work is to have software architecture evolution dynamically driven by connectors (the software glue between components). It proposes a connector model which embeds the necessary mechanisms to do so. These connectors autonomically handle the reconfiguration of connections in architectures in order to support the addition, removal and substitution of components in a gradual, transparent and …", "num_citations": "10\n", "authors": ["378"]}
{"title": "Cloud robotics architecture: trends and challenges\n", "abstract": " Cloud robotics is a field of robotics that attempts to use Cloud technologies for robotics. The use of the Cloud for robotics and automation brings some potential benefits largely ameliorating the performance of robotic systems. However, there are also some challenges. First of all, from the viewpoint of architecture, how to model and describe the architectures of Cloud robotic systems? How to deploy the architecture in Cloud? Our proposed approach in this paper is based on the principles of software architectures. In particular, we leverage our lightweight architectural solution to solve the architecture problem of Cloud robotics and discuss different solutions to deploy Cloud robotics system in Cloud.", "num_citations": "9\n", "authors": ["378"]}
{"title": "An evolution management model for multi-level component-based software architectures\n", "abstract": " Handling evolution in component-based software archi- tectures is a non trivial task. Indeed, a series of changes ap- plied on software may alter its architecture leading to sev- eral inconsistencies. In turn, architecture inconsistencies lead to software erosion and shorten its lifetime. To avoid architectural inconsistencies and increase software reliabil- ity, architecture evolution must be handled at all steps of the software lifecycle. Moreover, changes must be treated as first class entities. In this paper, we propose an evolution management model that takes these criteria into account. The model is a support for our three-level Dedal architec- tural model. It captures and handles change at any of the Dedal abstraction levels: specification, implementation and deployment. It generates evolution plans using evolution rules proposed in previous work. The generation process is implemented using the ProB model checker and evaluated through three evolution scenarios of a Home Automation Software.", "num_citations": "9\n", "authors": ["378"]}
{"title": "Towards automating the coherence verification of multi-level architecture descriptions\n", "abstract": " Component-Based Software Engineering considers offthe-shelf software component reuse as its cornerstone. In previous work, we proposed Dedal, a three level Architecture Description Language. It supports a novel modeling approach that aims at describing the specification, the implemented configuration and the running assembly of the software. This eases reuse by guiding the search for existing components. In this paper, we propose a formal approach that states the rules for component reuse and interoperability among Dedal models. The use of B, a specification language providing model-checking capabilities, enables the automatic verification of Dedal architecture descriptions. The approach is illustrated using the example of a home automation software.", "num_citations": "9\n", "authors": ["378"]}
{"title": "Self-Adaptive Markov Localization for Single-Robot and Multi-Robot Systems\n", "abstract": " In order to achieve the autonomy of mobile robots, effective localization is a necessary prerequisite. In this thesis, we first study and compare three regular Markov localization algorithms by simulations. Then we propose an improved Monte Carlo localization algorithm using self-adaptive samples, abbreviated as SAMCL. By employing a pre-caching technique to reduce the on-line computational burden, SAMCL is more efficient than regular MCL. Further, we define the concept of similar energy region (SER), which is a set of poses (grid cells) having similar energy with the robot in the robot space. By distributing global samples in SER instead of distributing randomly in the map, SAMCL obtains a better performance in localization. Position tracking, global localization and the kidnapped robot problem are the three sub-problems of the localization problem. Most localization approaches focus on solving one of these sub-problems. However, SAMCL solves all the three sub-problems together thanks to self-adaptive samples that can automatically separate themselves into a global sample set and a local sample set according to needs. Cooperative localization among multiple robots is carried out by exchanging localization information derived from cooperation. We devise the Position Mapping (PM) algorithm to integrate this information, which can merge into the SAMCL algorithm as an extension. The validity and the efficiency of our algorithm are demonstrated by experiments carried out with a real robot in a structured and known environment. Extensive experiment results and comparisons are also given in this thesis.", "num_citations": "9\n", "authors": ["378"]}
{"title": "Security-aware models for clouds\n", "abstract": " Inria - Security-Aware Models for Clouds Accéder directement au contenu Accéder directement à la navigation Toggle navigation CCSD HAL HAL HALSHS TEL MédiHAL Liste des portails AURéHAL API Data Documentation Episciences.org Episciences.org Revues Documentation Sciencesconf.org Support HAL-Inria Les publications, logiciels... des scientifiques Inria Accueil Déposer Consulter tout HAL par date de publication/rédaction par domaine par type de publication par collection arXiv les derniers dépôts Publications Inria Recherche Services HalTools : créer sa page web Haltools : export RAWEB X2Hal : import par lot Consulter les structures de recherche connues de HAL Documentation Aide en ligne de HAL V3 Dernières évolutions de HAL V3 Documentation API HAL Ajouter des vignettes Aide en ligne Haltools Aide en ligne de X2hal OpenAccess Inria soutient la science ouverte hal-00840734, version -…", "num_citations": "8\n", "authors": ["378"]}
{"title": "Design of a cloud robotics middleware based on web service technology\n", "abstract": " In the process of robotics applications development, Robot Operating System (ROS) has been a defacto-standard tool. However, ROS nodes always run at the on-board computer. Limited resources of CPU and storage restrict the ability of robotics when performing a task. A good solution is to transfer the computing-intensive tasks to the Cloud. In view of this, we deploy ROS packages in Cloud virtual machines and encapsulate them as web services. Meanwhile, we design a middleware based on web service technology. As the core of the whole Cloud Robotics system, the middleware is responsible for parsing the Cloud Robotics task request and schedule ROS nodes in a distributed network. Experiments have been performed to validate the reliability of the middleware.", "num_citations": "6\n", "authors": ["378"]}
{"title": "A control middleware for cloud robotics\n", "abstract": " Future robot applications will require cloud computing. Using an architecture of cloud robotics would increase performance over hardware constraints (e.g., processors, memory, and power). In this paper, we propose a control middleware for cloud robotics, which not only can receive the robots' requests and allocate the cloud resources based on the robots demand, but also can ensure the connection between the robots and the cloud more stability. And then, we use an autonomous, humanoid robot to test the first stage of the control middleware. Effectiveness of this control middleware is demonstrated by experiments.", "num_citations": "6\n", "authors": ["378"]}
{"title": "CRALA: Towards a domain specific language of architecture-centric Cloud robotics\n", "abstract": " Cloud robotic system is a mono- or multi- robot system that profits one or more services of Cloud Computing. In a few short years, Cloud robotics as a newly emerged field has already received much research and industrial attention. The use of the Cloud for robotics and automation brings some potential benefits largely ameliorating the performance of robotic systems. However, there are also some challenges. First of all, from the viewpoint of architecture, how to model and describe the architectures of Cloud robotic systems? How to deploy these architectures in Clouds? Merely a language could explicitly describe or model the architecture of Cloud robotic systems. In this paper, we present an architecture approach to support design and implementation of Cloud robotic system.", "num_citations": "6\n", "authors": ["378"]}
{"title": "A domain specific architecture description language for autonomous mobile robots\n", "abstract": " As mobile robots have been more and more widely applied, their tasks become more and more complicated. Architectures of robots encapsulate and model the algorithms and hardware into components. How to organize and configure these components to make them work together appropriately becomes one of the most important research subjects. Domain specific model driven architecture is a development approach by modeling systems into architecture models, and then generating the source codes from these architecture models. In this paper, we propose a domain specific model driven architecture framework for Autonomous Mobile Robots(AMR). Our proposed framework can improve the reusability of architectures and reduce the time and cost of system development.", "num_citations": "6\n", "authors": ["378"]}
{"title": "A metamodel for representing safety lifecycle development process\n", "abstract": " Metamodeling process supports the effort of creating flexible process models. The purpose of process models is to document and communicate processes and to enhance the reuse of processes. Thus, processes can be better taught and executed. Results of using metamodel process are an increased productivity of process engineers and an improved quality of the models they produce. However, most useful metamodels are activity-oriented, and the required concepts of safety lifecycle, such as validation, can not be easily modeled through these metamodels. In this paper, we propose a safety-oriented process metamodel to support all the requirements of safety control. As a proof of concept, we examine a process model that has several safety lifecycle requirements: the IEC 61508 safety lifecycle V-model standard.", "num_citations": "6\n", "authors": ["378"]}
{"title": "Probabilistic localization methods of a mobile robot using ultrasonic perception system\n", "abstract": " Effective localization is a fundamental prerequisite for achieving autonomous mobile robot. In this paper, we propose three probabilistic approaches to solve the global localization problem and the kidnapped robot problem. The first approach named the hybrid Grid-MCL algorithm merges Monte Carlo Localization (MCL) and grid localization. It can solve the global localization problem with very low on-line computational costs. The second approach, sampling in Similar Energy Regions (SER), is used to conquer the kidnapped robot problem. The third approach is a combination of previous two approaches with adaptive samples, which solves the global localization problem and the kidnapped robot problem together. The validity of our approaches is verified through extensive simulations employing ultrasonic perception system.", "num_citations": "6\n", "authors": ["378"]}
{"title": "A three-step localization method for mobile robots\n", "abstract": " In order to achieve the autonomy of mobile robots, effective localization is a necessary prerequisite. In this paper, we propose a new approach to solve the localization problem. This method has three steps: traversing map, calculating similar energy regions (SER) and Monte Carlo localization with self-adaptive samples (SasMCL). It can solve position tracking, global localization and the kidnapped robot problem together. This paper also gives extensive simulation results to verify the validity of our approach.", "num_citations": "4\n", "authors": ["378"]}
{"title": "A multi-objective strategy based on frontier-based approach and fisher information matrix for autonomous exploration\n", "abstract": " This paper presents a multi-objective exploration strategy for autonomous exploration of unknown indoor environments. The strategy mainly consists of two parts. First, it evaluates and determines the best frontier by considering the sensor information, localizability and navigation distance simultaneously. Second, a motion planning method considering the robot uncertainty is used to generate trajectories towards selected frontier. Compared to other exploration algorithms, we pay much attention to how to ensure accurate localization during the exploration and motion planning, which means the strategy should select frontiers and generate trajectories that provide sufficient information to keep the robot well-localized. Simulation experiments are presented to show the feasibility of the proposed strategy.", "num_citations": "3\n", "authors": ["378"]}
{"title": "Dedal-CDL: Modeling First-class Architectural Changes in Dedal\n", "abstract": " In component-based software engineering, software architectures govern not only software development but also software evolution. Indeed, to efficiently and accurately manage software evolution and guarantee its quality, architecture models should be at the core of the evolution process, be accurately synchronized with the runtime systems and have their changes and version information be completely tracked. As architecture models are often captured by ADLs (Architecture Description Languages), an ADL supporting architecture-centric evolution is required. In this paper, we study how architecture-centric evolution can be supported by the Dedal ADL. We thus propose a dedicated CDL (Change Description Language) which models architectural changes as first-class entities and describes them from a semantic viewpoint.", "num_citations": "3\n", "authors": ["378"]}
{"title": "Dedal2: An ADL supporting domain specific software development\n", "abstract": " To apply software architecture techniques in domain specific development becomes an emergent issue. Many industrial domains such as aeronautics, automobile develop their own domain specific ADLs to benefit the advantages of software architecture techniques. However, for small domains, this is very costly in terms of time, manpower and money. However, domain specific software architecture (DSSA) development is one of their emergent requirements. In existing ADLs, there is merely an ADL which supporting all different software architectures produced during domain-specific software development. Thus in this paper, we first formalise domain specific software development (DSSD) from the views of domain driven, component-based and architecture-centric. Then we present our proposed ADL - Dedal2. Dedal2 supports all architecture descriptions in different development step of DSSD and all component …", "num_citations": "2\n", "authors": ["378"]}
{"title": "Isolation and Molecular Identification of T-2 Toxin-Producing Fusarium in Corn from Northeast China\n", "abstract": " Introduction. T-2 toxin belongs to a large group of trichothecene mycotoxins produced by various Fusarium molds. It is widely scattered in cereals and cereal, which can cause human and animal diseases. T-2 toxin has been paid more attention. The aim of this study was to isolate and identify T-2 toxin-producing Fusarium from moldy corn in Northeast China. Materials and Methods. A total of 20 corn samples from 10 corn field were collected. Isolation of the Fusarium was performed by RBM medium. T-2 toxin-producing with the corn medium and using HPLC detection. The highest T-2 production strains were identified by morphologic feature of macro-and microconidia and molecular method, using DNA sequence analysis. ITS region of ribosomal DNA was amplified and the PCR products were sequenced. Results. which 20 strains was selected for toxin-producting test. The 6th strain, which had the strongest capacity to produce T-2 toxin and homology with F. sporotrichioides reached to 100%. we can confirm the T-2 toxin-producing fungal was F. sporotrichioides.", "num_citations": "2\n", "authors": ["378"]}
{"title": "Optimization of critical treatment factors in chromosome preparation technique of sesame.\n", "abstract": " see more details were used to study the effects of the pretreatment methods, dissociation time, sampling length of roots tips and staining on the chromosome preparation. The results showed that the optimal pretreatment methods were as follows: 40 mg/L cycloheximide for 3 h, or saturated p-dichlorobenzene for 4 h, 0.002 mol/L 8-Hydroxyquinolin for 3 h; then dissociated with the solution (anhydrous alcohol: 37% concentrated hydrochloric acid= 1: 1) for 10 min at room temperature; the sampling length of root tips root tips Subject Category: Anatomical and Morphological Structuressee more details was 0.5-1.0 mm, and stained with modified carbolic acid-magenta solution for 8 min. With this method a very good effect of chromosome preparation could be obtained.", "num_citations": "2\n", "authors": ["378"]}
{"title": "Self-Adaptive Monte Carlo Localization for Cooperative Multi-Robot Systems\n", "abstract": " In this paper, the cooperative multi-robot localization problem is addressed. We propose an improved Monte Carlo localization using self-adaptive samples, abbreviated as SAMCL. This algorithm takes advantages of Monte Carlo localization (MCL) to provide an effective solution for global localization. Furthermore, it can solve the kidnapped robot problem that cannot be handled by MCL. It executes more efficiently than MCL, for employing an offline pre-caching technique. Cooperative localization among robots is carried out by exchanging their relative distance and orientation extracted from sensor data and a possible position and the reliability of this position. These information is integrated by a position mapping (PM) algorithm. The validity and the efficiency of our algorithm are demonstrated by experiments carried out with different intentions. Extensive experiment results are also given in this paper.", "num_citations": "2\n", "authors": ["378"]}
{"title": "Design of an Indoor Exploration and Multi-Objective Navigation System\n", "abstract": " In this paper, we propose an indoor robot autonomous navigation system. The robot firstly explores in an unknown environment, and then navigates autonomously by using the explored map. The robot is equipped a 2D laser scanner as the main sensor. The laser scanner is used for path planning and frontier-based exploration. A 2D global occupancy map is built for path planning, frontier-based exploration and multi-objective autonomous navigation. Laser scans are transmitted into Simultaneous Localization and Mapping (SLAM) process in the exploration phase. In indoor environment, the exploration efficiency is improved by merging a heuristic algorithm. By using multi-threading technology and a 3D perception approach proposed in this paper, the robot equipped with a low-cost RGBD sensor can detect all kinds of obstacles to achieve highly reliable navigation in complicated 3D environment. Meanwhile, we …", "num_citations": "1\n", "authors": ["378"]}
{"title": "A formalized architecture-centric evolution process for component-based software system\n", "abstract": " System quality is key part of software system in industry. It not only directly affects the customers/users' satisfaction, but also influences the entire lifecycle of system products from requirement to maintenance. Many quality assurance development methodologies and standards are proposed. However, software evolution as an another important part in software system lifecycle is less studied from the viewpoint of software quality assurance. Architectures, as the most basic and important factor in modern software engineering, are key to guarantee software system quality by replacing codes. Thus, in this paper, we propose a controlled evolution process based on ADLs and formalized by SPEM standard.", "num_citations": "1\n", "authors": ["378"]}
{"title": "First Experiment on Modeling Safety LifeCycle Process in Railway Systems\n", "abstract": " The conception and design of Resource Constrained Embedded Systems (RCES) is an inherently complex endeavor. Non-functional requirements from security and dependability are exacerbate this complexity. Model-Driven Engineering (MDE) is a promising approach for the design of trusted systems, as it bridges the gap between design issues and implementation concerns. The purpose of process models is to document and communicate processes, as well as reuse them. Thus, processes can be better taught and executed. However, most useful metamodels are activity-oriented, and the required concepts of safety lifecycle, such as validation, cannot be easily modeled. In this paper, the authors propose a safety-oriented process metamodel that extends exiting framework to support all safety control requirements. A new safety lifecycle development processes technique has been built to ease its use in a …", "num_citations": "1\n", "authors": ["378"]}
{"title": "Dedal: un ADL à trois dimensions pour gérer l’évolution des architectures à base de composants\n", "abstract": " Une architecture logicielle peut être définie à différents niveaux d’abstraction, correspondants aux différentes étapes de son processus de développement: spécification, implémentation et déploiement. La cohérence entre les différentes définitions d’une architecture doit être maintenue: sa définition à un niveau d’abstraction doit être conforme à sa définition au niveau d’abstraction immédiatement supérieur. Ce principe permet de contrôler l’évolution d’une architecture, en validant les modifications réalisées à un certain niveau d’abstraction ou en motivant la création d’une nouvelle version pour propager les modifications entre niveaux d’abstraction. Malheureusement, aucun ADL ne propose un modèle de définition d’architectures séparant clairement les niveaux d’abstraction couvrant le cycle de vie d’une architecture. Cet article présente Dedal, un ADL permettant une définition séparée de la spécification, de la configuration et de l’assemblage d’une architecture afin de prévenir l’érosion ou la dérive qui surviennent lors des évolutions entre les différents niveaux de définitions des architectures.", "num_citations": "1\n", "authors": ["378"]}
{"title": "Connector-driven gradual and dynamic software assembly evolution\n", "abstract": " Complex and long-lived software need to be upgraded at runtime. Replacing a software component with a newer version is the basic evolution operation that has to be supported. It is error-prone as it is difficult to guarantee the preservation of functionalities and quality. Few existing work on ADLs fully support a component replacement process from its description to its test and validation. The main idea of this work is to have software architecture evolution dynamically driven by connectors (the software glue between components). It proposes a connector model which autonomically handle the reconfiguration of connections in architectures in order to support the versioning of components in a gradual, transparent and testable manner. Hence, the system has the choice to commit the evolution after a successful test phase of the software or rollback to the previous state.", "num_citations": "1\n", "authors": ["378"]}