{"title": "Current state of agile user-centered design: A survey\n", "abstract": " Agile software development methods are quite popular nowadays and are being adopted at an increasing rate in the industry every year. However, these methods are still lacking usability awareness in their development lifecycle, and the integration of usability/User-Centered Design (UCD) into agile methods is not adequately addressed. This paper presents the preliminary results of a recently conducted online survey regarding the current state of the integration of agile methods and usability/UCD. A world wide response of 92 practitioners was received. The results show that the majority of practitioners perceive that the integration of agile methods with usability/UCD has added value to their adopted processes and to their teams; has resulted in the improvement of usability and quality of the product developed; and has increased the satisfaction of the end-users of the product developed. The top most used …", "num_citations": "130\n", "authors": ["2245"]}
{"title": "Extending UTAUT2 toward acceptance of mobile learning in the context of higher education\n", "abstract": " The use of smartphones as a learning tool in education is on the rise, causing a rapidly developing use of mobile learning (m-learning) in both developed and developing countries. The key features of smartphones, i.e., mobility, ubiquity, lightweight, low-cost and connectivity from anywhere and anytime, enhance their usage in a variety of ways. M-learning is an innovative idea that provides enormous opportunities by connecting humans and technology, such as better learning experiences and technology acceptance. The use of m-learning is growing at a higher pace worldwide, yet sufficient understanding of the factors that influence its acceptance in society is still lacking, particularly in developing countries. A number of models related to m-learning acceptance do exist, for instance, the extended unified theory of acceptance and use of technology (UTAUT2); however, the use of UTAUT2 to study m …", "num_citations": "54\n", "authors": ["2245"]}
{"title": "Investigating agile user-centered design in practice: A grounded theory perspective\n", "abstract": " This paper investigates how the integration of agile methods and User-Centered Design (UCD) is carried out in practice. For this study, we have applied grounded theory as a suitable qualitative approach to determine what is happening in actual practice. The data was collected by semi-structured interviews with professionals who have already worked with an integrated agile UCD methodology. Further data was collected by observing these professionals in their working context, and by studying their documents, where possible. The emerging themes that the study found show that there is an increasing realization of the importance of usability in software development among agile team members. The requirements are emerging; and both low and high fidelity prototypes based usability tests are highly used in agile teams. There is an appreciation of each other’s work from both UCD professionals and …", "num_citations": "45\n", "authors": ["2245"]}
{"title": "An analysis of the influence of a mobile learning application on the learning outcomes of higher education students\n", "abstract": " This study investigated the influence of a mobile learning (M-Learning) application on the learning outcomes of university students. The learning outcomes were assessed in terms of secured score in the Communication Skills course using the App for the period of one semester. The M-Learning App was developed for university students to make learning possible from anywhere, at anytime, and through any smartphone. An experiment was conducted to measure the learning outcomes of the students. In each group (experimental and control), 106 students were randomly selected using SPSS random sample cases. The learning outcomes were measured by means of a standard test designed by three course experts. Both groups took the test at the start of the semester; the results were recorded as pre-test. However, both groups undertook the same test again at the end of the semester as a post-test; this …", "num_citations": "37\n", "authors": ["2245"]}
{"title": "Evaluating Usability of M-Learning Application in the Context of Higher Education Institute\n", "abstract": " In a system development process, usability evaluation is a crucial part of the process. The purpose of this paper is to test the usability of new developed application called “DARSGAH” for getting optimum outcomes from m-learning (Mobile Learning) technology. This application provides learning opportunities to University students. Initially, pilot test was conducted with 10 participants. After slight word refinement and minor changes in the application full scale usability test was conducted with other 100 participants who were selected randomly from the University by generating random numbers (student IDs) using SPSS. The data was collected using System Usability Scale (SUS) questionnaire immediately after the test, to obtain students’ overall perception about the application. The findings revealed that the application is user friendly, effective, and efficient and the users were satisfied as the overall …", "num_citations": "19\n", "authors": ["2245"]}
{"title": "QUEST e-learning portal: Applying heuristic evaluation, usability testing and eye tracking\n", "abstract": " In this study, the development of an e-learning portal for university students is presented. The portal is based on responsive web design which is accessible from anywhere, at any time and on any device. A complementary user experience evaluation methodology consisting of heuristic evaluation, usability testing, user experience questionnaire and eye tracking has been applied to get a holistic understanding and identification of the potential usability problems in the portal. The methodology highlights the relative efficacy of each method. The results suggest that the heuristic evaluation identified more usability problems than the usability testing. However, few severe usability problems were identified in the usability testing and most of them were not spotted in the heuristic evaluation. For additional insights, the participants’ objective visual responses were tracked using an eye tracker (Tobii X-30 Hz); the eye …", "num_citations": "5\n", "authors": ["2245"]}
{"title": "Measuring usability of the mobile learning app for the children\n", "abstract": " This paper presents findings from the usability study that was conducted for the newly developed mobile learning App for the children. The App facilitates the children aged between 4 and 9 of Class-KG and Class-I to learn English with the help of their native language named Sindhi. After the pilot study, actual usability test was conducted with 100 children. In the study, besides usability tasks performed by the children, Smileyometer and Again-Again Table from the Fun Toolkit were also used to assess user experience. The outcomes disclose that the App was very easy and effective as task accomplishment rate was hundred percent. The results from the Smileyometer and Again-Again Table show that most of the children enjoyed the App. There was no statistically significant difference between the baby girls and the baby boys in terms of task completion time which shows that the App was equally efficient …", "num_citations": "5\n", "authors": ["2245"]}
{"title": "Analyzing real mobile web usage of a multimedia streaming application through log files\n", "abstract": " Web use on mobile phones is increasing day by day. Various web applications and services are emerging on mobile phones. One such application is consuming multimedia-Audio and Video (AV)-on mobile devices. We have been working on an application that enables a user to perform content-based search for AV content in large digital archives and play the streamed content on a mobile phone. The search is not only possible in meta data but the application is intelligent enough that it also searches in spoken words and shows the context of spoken words in the clip so that user can immediately watch the particular part of the clip where these words were spoken. The paper describes the application features. The paper also describes the preliminary results of a field trial study with 150 users from the perspectives of the real usage of the application and its web features. We mainly relied on quantitative methods …", "num_citations": "4\n", "authors": ["2245"]}
{"title": "Big data insights and comprehensions in industrial healthcare: an overview\n", "abstract": " Big data are the data which need to be shaped for their volume, size, and shape in order to extract meaningful information for an explicit purpose. Data are ever playing a significant role in organization and industry for their daily activities to functional smoothly. The volume of healthcare data is increasing with the rising of technology and passage of time. This rise in volume of data can be a challenging task toward analysing the big data for industry and Internet of things (IoT). Numerous approaches, techniques, and tools exist in the literature for supporting, to handle, and manage processing of data. A review of the literature is needed in order to collect existing evidence from the literature to show which method or tool works for which particular situation. Therefore, the current study presents a review of the existing techniques of big data insights and scientific programming in the industry of healthcare. The report presents the summary of the literature. The study collects evidences from the existing literature and organizes it through the process of literature review with some derivations. This review will benefit practitioners to identify the right techniques for their specific purpose of research.", "num_citations": "3\n", "authors": ["2245"]}
{"title": "Assessing the Usability of Urdu Learning Mobile Apps for Children\n", "abstract": " This study evaluated the usability of the children’s Urdu learning mobile Apps for Tablet-PCs. The pre-test questionnaire based on demographic information of the participants, post-test questionnaire using the Fun Toolkit and the usability tasks were developed for collecting data from the children. The usability test was conducted by 232 participating children having age between 5 and 10 years of the primary schools. After filling the demographic questionnaire, the usability tasks were given to the children where time was recorded for each of the tasks. Afterwards, the post-test questionnaire was administered among the children in order to gather their opinion about the apps. The study result illustrated that the App3 was the best App in terms of efficiency and effectiveness. According to the Smileyometer results, the children reported more fun in using the App3. The Again-Again table results also show that the …", "num_citations": "3\n", "authors": ["2245"]}
{"title": "Significance of Line Length for Tablet PC Users\n", "abstract": " This paper presents key findings about on-screen optimal line length for tablet personal computers (PCs). It examines the effects of four different line lengths on the reading speed and reading efficiency. Seventy participants ranging between the ages of 20 and 40 participated in this study. They read four different texts with an average length of 2000 characters. The texts contained substitution words, which were to be detected by the subjects to measure reading accuracy. Moreover, the subjects were asked to subjectively vote on their reading experience in the context of subjective measures like reading speed and accuracy. The results of the study revealed that 90 characters per line (CPL) were preferred by most of the participants. Nonetheless, some participants falling between the ages of 35 and 40 years preferred 60 CPL. The findings presented in this paper are quite worthwhile as the Tablet PC are …", "num_citations": "3\n", "authors": ["2245"]}
{"title": "Development and Validation of User Experience-Based E-Learning Acceptance Model for Sustainable Higher Education\n", "abstract": " E-learning is a convenient way of learning through a portal. E-learning is being increasingly adopted in the world; however, the factors that influence the intention of users for accepting the e-learning technology have not been sufficiently explored, particularly in developing countries. Although many e-learning acceptance models do exist, the research on a user experience (UX)-based e-learning acceptance model is still lacking. As UX is one of the crucial factors for the acceptance of an e-learning portal, this research study aims to develop and validate a UX-based e-learning acceptance framework for sustainable higher education. In this connection, a web-based responsive e-learning portal for university students has been developed. The portal can be accessed from anywhere, at any time, and on any device, making the learning sustainable. The UX-based e-learning acceptance framework is developed by integrating the selected constructs of a widely accepted UX model, technology acceptance model (TAM), and four well-known constructs from various technology acceptance models. The constructs are appeal, pleasure, satisfaction, perceived ease of use, perceived usefulness, information quality, self-efficacy, social influence, benefits, and behavioral intention, which can predict the intentions of the students for acceptance of the e-learning portal. The data were collected from 650 university students using online and manual questionnaires. After data screening, 513 valid responses were further analyzed using structural equation modeling. According to the results, the framework fits the data well. The constructs satisfaction, perceived ease of …", "num_citations": "2\n", "authors": ["2245"]}
{"title": "Interactive Learning System for Primary Schools using Tablet PC\n", "abstract": " The rapid development in technology has facilitated human beings in many ways such as automated home appliances, smart vehicles, smart mobile phones, and tablet computers. The uses of these tools and techniques are increasing in our daily lives to facilitate day to day work. The new trends in technology have focused on finding approaches towards improved learning techniques. Various tools are being used to integrate Information and Communication Technology in education. Tablet Personal Computers (PCs) are one of the new and innovative tools used in education for enhancing learning skills. This research has been conducted in five primary schools, where students of class nursery to class three were taught basic lessons using Tablet PC. In this research an application has been developed on android platform with easy to use interface, where the students were able to perform simple arithmetic …", "num_citations": "1\n", "authors": ["2245"]}