{"title": "A hybrid of ant colony optimization and chaos optimization algorithms approach for software cost estimation\n", "abstract": " The main challenge in the production and development of large and complex software projects is the cost estimation with high precision. Thus it can be said that estimating the cost of software projects play an important role in the organization productivity. With the increasing size and complexity of software projects the demand to offer new techniques to accomplish this important task increases day by day. Therefore, researchers have long attempted to provide models to fulfill this important task. The most documented algorithmic model is the Constructive Cost Model (COCOMO), which was introduced in 1981 by Barry W. Boehm. But due to the lack of values for the constant parameters in this model, it cannot meet the high precision for all software projects.Nowadays, regarding the increasing researches on machine learning algorithms and the success of these studies, in this paper, we have tried to estimate the cost of software projects according to meta-heuristic algorithms. In this paper, Ant Colony Optimization (ACO) and Lorentz transformation have been used as Chaos Optimization Algorithm (COA) and NASA datasets as training and testing sets.", "num_citations": "34\n", "authors": ["424"]}
{"title": "A new approach in software cost estimation with hybrid of bee colony and chaos optimizations algorithms\n", "abstract": " One of the most important aspects of managing software projects is estimating the cost and time required for developing information systems. In this paper, we have used Bee Colony Optimization, Artificial Bee Colony, and hybrid of bee colony and Chaos Optimization Algorithm (COA) to Software Cost Estimation (SCE), and tenet mapping as the COA and NASA dataset for test and training data. The results obtained by this method have been compared with the COCOMO II model. The results of this comparison indicate a reduction of absolute relative error of the estimated cost up to 0.07.", "num_citations": "16\n", "authors": ["424"]}
{"title": "PARTICLE SWARM OPTIMIZATION AND CHAOS THEORY BASED APPROACH FOR SOFTWARE COST ESTIMATION.\n", "abstract": " Nowadays, software development and production is considered as an essential need in many organizations. To produce and develop a good quality and affordable software, we need to have an accurate estimate of time and cost required to complete the software. Thus it can be said that the cost estimation of software projects play an important role in organization productivity. Usually it is difficult to estimate the cost of software projects. This could be due to reasons such as software projects not being tangible and understandable at the beginning of the production. Because the methods presented so far for estimating the cost of software projects do not fulfill this important task, new techniques are needed for a more accurate estimation. So in this paper, we have attempted to estimate the cost of software projects by using Particle Swarm Optimization (PSO) algorithm and Tent mapping as Chaos Optimization algorithm. We have used the NASA datasets as training and testing sets, and MARE to evaluate the performance of the proposed method. And the results have been compared to the intermediate COCOMO model proposed by Boehm (1981), which shows an Absolute Relative Error reduction in cost estimation up to 0.0797%.", "num_citations": "10\n", "authors": ["424"]}
{"title": "A NEW CHAOS AGENT BASED APPROACH IN PREDICTION OF THE ROAD ACCIDENTS WITH HYBRID OF PSO OPTIMIZATION AND CHAOS OPTIMIZATION ALGORITHMS: A CASE STUDY.\n", "abstract": " Nowadays, according to the increase of casualties in road accidents, providing solutions to explore and identify intricate relations between the factors involved in the accidents is essential. Considering the increasing rate of road accidents and consequently increase in information about the accidents, and presence of evident and latent dependencies among the influencing factors in road accidents using data mining techniques to identify the contribution of each factor involved in accidents and the relations between these factors are required. So we, in this paper, in order to achieve the optimal relationship between the factors involved in road accidents by type of accident (vehicle damage, injury, death) we have used the hybrid of Particle Swarm Optimization (PSO) algorithm and Chaos Optimization Algorithms (COA)(Tent map, Logistic Map, Lorenz attractor) as chaos factor. The main task of chaos factor is selecting the optimal values for the parameters of PSO algorithm from the values produced by three types of chaotic maps which each map presents 11 methods by combining PSO and COA. The results of the proposed method compared to the PSO algorithm and combination of PSO and COA reflect the improved performance of the PSO algorithm. Therefore based on the relations obtained from the proposed method, we have dealt with predicting road accidents which the results show 98 percent of accuracy in predictions.", "num_citations": "7\n", "authors": ["424"]}
{"title": "A Bee Colony Optimization Algorithm Approach for Software Cost Estimation\n", "abstract": " The Software Cost Estimation (SCE) is one of the most important stages of the production cycle of a system. Therefore, the managers need to accurately determine the requirements of the project to have accurate estimations. But given the fact that the SCE is done at the beginning of the system development, it can be problematic due to lack of accurate information about the project. To solve this problem, researchers have proposed several methods to estimate the cost of software projects but haven’t been successful in estimating the costs with 100% accuracy.In this paper, we intend to improve the accuracy of the cost estimation by using Bee Colony Optimization algorithm. It should be mentioned that the proposed method is compared with the intermediate COCOMO. The results indicate that the proposed method have reduced the mean absolute relative error to 0.1619.", "num_citations": "7\n", "authors": ["424"]}
{"title": "Evaluation of particle swarm optimization algorithm in prediction of the car accidents on the roads: A case study\n", "abstract": " Road traffic accidents are the most common accidents that annually Endangers lives of many people in the world. Our country Iran is one of the countries with highest incidence and mortality due to accidents that has been introduced. So it’s requires identification of underlay in dimensions in this field. Due to the increasing amount of car accidents in order to increase volume of information related to car accidents and needs to explore and reveal hidden dependencies and very long time among this information. So using traditional methods to discover these complex relations don't response between involved factors and we need to use new techniques. Considering that main aim of this paper is to find best relationship between volumes of information in shortest time. So, in this paper, we classify accidents in West Azerbaijan province in Iran by accident type (damage, injury, death) and we describe it by using Particle Swarm Optimization (PSO) algorithm.", "num_citations": "6\n", "authors": ["424"]}
{"title": "An Improvement in Support Vector Machines Algorithm with Imperialism Competitive Algorithm for Text Documents Classification\n", "abstract": " Due to the exponential growth of electronic texts, their organization and management requires a tool to provide information and data in search of users in the shortest possible time. Thus, classification methods have become very important in recent years.In natural language processing and especially text processing, one of the most basic tasks is automatic text classification. Moreover, text classification is one of the most important parts in data mining and machine learning. Classification can be considered as the most important supervised technique which classifies the input space to k groups based on similarity and difference such that targets in the same group are similar and targets in different groups are different. Text classification system has been widely used in many fields, like spam filtering, news classification, web page detection, Bioinformatics, machine translation, automatic response systems, and applications regarding of automatic organization of documents.", "num_citations": "1\n", "authors": ["424"]}
{"title": "A New Approach to Predict the Severity of Road Accidents with Hybrid MLP ANN and Differential Evolution Algorithm\n", "abstract": " In most cases, classification has been proposed as an effective method in decision-making. Although countless methods of classification have been stated by the researchers, none of these methods has the same performance and sufficient accuracy for various issues. Accordingly, a hybrid approach has been proposed for classification in this paper. Also, considering the fact that one of the most common accidents all around the world is road accidents and traffic accidents, which endangers the lives of many people annually, therefore, determining the characteristics affecting the type of the accident is very important. Therefore, the information collected by the transportation and terminal organization in Western Azerbaijan province (Iran) were used as data collection in this paper and the aim of it is the accident classification based on the type of accident (damage, injury, death). For this purpose, a new method has been proposed for classification based on the use of two algorithms of Differential Evolution (DE) algorithm and MLP ANN. In the proposed method, DE algorithm is used for extraction of affecting features of classification, and MLP ANN algorithm is used to classify information based on characteristics determined by DE algorithm. The results of the proposed method have been evaluated with evaluation criteria Recall, Precision, F-Measure, and Kappa which the results show that the proposed method is optimal.", "num_citations": "1\n", "authors": ["424"]}