{"title": "Analysis and evaluation of unstructured data: text mining versus natural language processing\n", "abstract": " Nowadays, most of information saved in companies are as unstructured models. Retrieval and extraction of the information is essential works and importance in semantic web areas. Many of these requirements will be depend on the storage efficiency and unstructured data analysis. Merrill Lynch recently estimated that more than 80% of all potentially useful business information is unstructured data. The large number and complexity of unstructured data opens up many new possibilities for the analyst. We analyze both structured and unstructured data individually and collectively. Text mining and natural language processing are two techniques with their methods for knowledge discovery form textual context in documents. In this study, text mining and natural language techniques will be illustrated. The aim of this work comparison and evaluation the similarities and differences between text mining and natural …", "num_citations": "97\n", "authors": ["422"]}
{"title": "Comparison and evaluation of data mining techniques with algorithmic models in software cost estimation\n", "abstract": " Software Cost Estimation (SCE) is one of important topics in producing software in recent decades. Real estimation requires cost and effort factors in producing software by using of algorithmic or Artificial Intelligent (AI) techniques. Boehm developed the Constructive Cost Model (COCOMO) that is one of the algorithmic SCE models. Also, these models contain three increasingly basic, intermediate and detailed forms, i.e. basic COCOMO is suitable for quick, early, rough order of among the estimates of required effort in producing software, but its accuracy is limited due to its loss of factors to account for difference between cost drivers. Intermediate COCOMO assumes these project attributes into account. In addition detailed COCOMO accounts for individual project phases used. The COCOMO algorithmic techniques families have used since 1981. In recent years, some techniques emerged by using intelligent …", "num_citations": "83\n", "authors": ["422"]}
{"title": "Neural network application in diagnosis of patient: a case study\n", "abstract": " Patient hep is keys to successfully managing heart diseases and to helping the patients to maintain quality of life. In recent years, with data mining techniques has been extracted important hidden information through clinical data, so these methods confect beneficial information for medical research and health centers. So it will be making a comer designs using hospital information is required fold add influence of clinical centers and hospitals. This paper suppose a decision support model able to help a physician as well as a health care system manage this heart failure population and describes the work on medical data mining and gives useful information about data mining. Finally, the case study is modelled by Neural Network (NN). Training data collects of 40 patients clinical records in health center search about heart problems in persons. The results show that our NN model generates correctly predictions for 85 …", "num_citations": "45\n", "authors": ["422"]}
{"title": "A survey of data mining techniques in software cost estimation\n", "abstract": " Software Cost Estimation (SCE) is one of complex problems in software engineering area. So, a lot of attention has been allocated to solving this problem. Thus the correct estimate of the cost and effort required for software companies and company executives and companies is very significant. In required effort prediction, estimated size and cost of the project with high accuracy is still vast challenge for projects masters. In 1981, had been developed algorithmic models which called Constructive Cost Model (COCOMO) by Boehm. These models were used for required effort prediction. Since, COCOMO 81 is not suitable model for responding new requirements in recent years, so COCOMO II model in 2000 published. COCOMO II is most transparent model among algorithmic models (COCOMO family) for estimates the cost of software. Today’s, there are very smart methods more efficient and effective algorithmic COCOMO methods, so many research and review the data mining techniques to estimate the true cost of software is done. This paper a survey of the literature of application of data mining techniques in SCE collected form software databases as well as international conferences and journals. Data mining techniques of expert systems were selected according to a set of criteria of work relevancy their internal architecture techniques were reviewed. The techniques are Fuzzy Decision Trees (FDTs), Artificial Neural Networks (ANN), Bayesian Networks (BN) classifiers and etc. Our work addresses the issue of software effort prediction via these methods using historical project data samples. A classification considering the main goal of the …", "num_citations": "19\n", "authors": ["422"]}
{"title": "A new approach in software cost estimation using regression based classifier\n", "abstract": " The correct cost estimation for software companies and company executives and companies is very important task. In required effort prediction, estimated time of delivery and cost of the project with high accuracy is still vast challenge for projects masters. For many years, algorithmic models like Constructive Cost Model (COCOMO) families were used for required effort prediction. Nowadays, intelligent methods have many applications in SCE. In this study, we firstly give introduction to software cost estimation (SCE) and requirements. Then, we proposed a new intelligent approach by means of additive regression model for classifying the training and testing instances on NASA projects. The results show that our proposed system is more effective. Performance is evaluated by comparing the COCOMO and additive regression based classifier results.", "num_citations": "19\n", "authors": ["422"]}
{"title": "Using intelligent tutoring systems in instruction and education\n", "abstract": " Nowadays, beside computer has come into our life, learning, independent from time and place, is implemented in an effective structure. Since many studies are consummated education is implemented in a structure which takes into account. Benefits of the qualities include being more effective, qualified and independent from time and place. In order to develop the software’s that present students effective instruction methods and provide education with being adapted to students, studies are carried out. Intelligent Tutoring Systems (ITSs) are tutoring systems which form with using artificial intelligence techniques in computer programs to facilitate instruction. These systems are based on cognitive learning theory which is a learning theory interested in how information organizes in human’s memory. ITSs are intelligent programs which know what, how and whom they will teach so computers play an important part in education and instruction aims are performed and suggested in this work. In this paper we describe ITSs in educational application and demonstrate used modules in ITSs. Otherwise, these have been compared with computer-aided learning systems.", "num_citations": "19\n", "authors": ["422"]}
{"title": "New Approach with Hybrid of Artificial Neural Network and Ant Colony Optimization in Software Cost Estimation\n", "abstract": " Nowadays, software cost estimation (SCE) with machine learning techniques are more performance than other traditional techniques which were based on algorithmic techniques. In this paper, we present a new hybrid model of multi-layer perceptron (MLP) artificial neural network (ANN) and ant colony optimization (ACO) algorithm for high accuracy in SCE called Multilayer Perceptron Ant Colony Optimization (MLPACO). Current research uses some of features for increasing accuracy of estimation among of the existing parameters has been considered for effort estimation in software projects, and then these selected features will be filtered by ACO algorithm in order to reach highest accuracy in estimation and optimization of MLP ANN method. The results show that this novel approach with high accuracy for more than 80% cases is better than algorithmic constructive cost model (COCOMO) in the majority cases. Also, the results of proposed algorithm show that mean magnitude of relative error (MMRE) in the proposed algorithm is lower than COCOMO model.", "num_citations": "11\n", "authors": ["422"]}
{"title": "Study on Information extraction methods from text mining and natural language processing perspectives\n", "abstract": " In today’s word, information had been stored in organizations is as unstructured data. Unstructured models include Unstructured Data (UD) like text files in warehouses or databases. UD specify information from data hoard in archive forms in data warehouses or text files. Also, Text Mining (TM) and Natural Language Processing (NLP) are two sub-domains of Artificial Intelligence (AI) techniques using to extract information from UD. Thus, extraction and retrieval of conductive data will be fundamental work in semantic web districts that depend on the storage’s quality. Then, UD can be enriched and tagged to identifying ambiguities and relevant based methods. These techniques applied for facilitating search and exploring actions. In this study, we investigate TM, NLP and UD firstly; TM and natural language techniques used to detect knowledge as well as information extraction (IE) will review and discussed. Main scope of the paper is evaluation among of the TM versus NLP through appropriate relevant techniques.", "num_citations": "7\n", "authors": ["422"]}
{"title": "Learning styles classification: Learner control implications in instruction and education\n", "abstract": " The world of information is becoming increasingly complicated and it gains more dynamic face these days. In this study, not only learning styles in web-based instruction are taken into account, but also the studies that give information about the effects of learner control are investigated. The styles are Kolb, Cognitive, McCarthy learning styles and etc according to a set of criteria of work relevancy their internal architecture techniques are discussed. Our work addresses the issue of software engineering usage through these methods using in elearning efficient systems. A classification considering the main goal of the methods has been made. For each category, a discussion of the suitability of learning techniques is proposed in cognition of requirements in inception phase of software engineering. The results of researches conducted indicate that in most cases, these methods very efficacious in web-based instruction and education.", "num_citations": "3\n", "authors": ["422"]}
{"title": "Comparison of Pervasive Home based Health Care Systems under E-Health Perspectives\n", "abstract": " Today’s, advanced Information and Communication Technologies (ICT) impress all of health perspectives. One of the human processes is body health and using e-health to help the health of individuals in human societies. ICT has high performance to support patients increasingly by means of new modern methods such as Multi Agent Systems (MASs). The agent based systems present new techniques to resolve human problems and implementing of them with software systems. In this paper, we introduce non-critical systems. The main characteristic of these systems are empathic on the remote healthcare as pervasively. We evaluate mobile multi agent based distributed information platforms for pervasive home healthcare monitoring as well as e-health security mechanisms in Java Agent Development Environment (JADE). Finally, we discuss about implemented e-health systems in Iran and their executive processes currently.", "num_citations": "1\n", "authors": ["422"]}
{"title": "Evaluation of Intelligent Tutoring Systems: Instruction and Education Approach\n", "abstract": " Nowadays, beside computer has come into our life, learning, independent from time and place, is implemented in an effective structure. Since many studies are consummated education is implemented in a structure which takes into account. Benefits of the qualities include being more effective, qualified and independent from time and place. In order to develop the software’s that present students effective instruction methods and provide education with being adapted to students, studies are carried out. Intelligent Tutoring Systems (ITSs) are tutoring systems which form with using artificial intelligence (AI) techniques in computer programs to facilitate instruction.These systems are based on cognitive learning theory which is a learning theory interested in how information organizes in human’s memory. ITSs are intelligent programs which know what, how and whom they will teach so computers play an important part in education and instruction aims are performed and suggested in this work. In this paper we described and reviewed some of ITSs in educational application and demonstrate used modules in ITSs. Otherwise, these have been compared with computer-aided learning systems. The results indicate that these systems formed with AI techniques omit this incompetence with vast rate and countenance students and teachers to learning in a better manner.", "num_citations": "1\n", "authors": ["422"]}